{
  "ground_truth": "She slams it closed, distracted. Gail sighs. She pops a piece of gum into her mouth as Mickey continues to speak. Mickey sighs. Pedestrians pass. The camera moves up the hotel's facade, past its welcoming flags, to its ornate windows several floors up. Elliot, his back to the camera, is opening the door to Lee. Elliot closes the door behind her as she enters. They stand very close to each other, framed by the door and a stark, subtly striped wallpapered wall. They walk towards the camera, further into the room. Elliot puts his arm around Lee. The camera follows Lee as she walks towards the curtained windows, past a fireplace, a mirror, some innocuous pictures, a delicate table holding a lamp, the foot of the bed. She parts a corner of the curtains, looking out the window, turning when Elliot speaks. He walks over to Lee by the curtained windows. He takes Lee into his arms. They kiss, their figures almost silhouetted in the warm glow of the room. Elliot takes Lee's coat off without breaking the kiss. They embrace. They kiss each other lightly, then stronger, more passionately, their embrace much tighter. The harpsichord music begins to play again as the camera moves over the bed covers to reveal Lee, lying contentedly under the sheets, her hair fanned out on the pillows, one arm near her head. He enters the screen, sitting down on the edge of the bed next to Lee. He holds a cigarette. Elliot chuckles; they hold hands. Elliot leans down to Lee; they begin to kiss passionately. Lee walks along the sidewalk in the rain; she's bareheaded. A car drives by; a pedestrian passes holding an umbrella. Lee passes a restaurant well lit inside by hanging lamps. The baroque music continues as she enters the loft, her head soaked. She closes the door, touching her soaking hair. Lee walks through the loft's living room area, unbelting her coat, towards the bathroom. She passes Frederick, who sits at a table in the kitchen area, drinking a cup of coffee and reading the paper. As he talks, Lee is seen turning on the bathroom light. She takes off her coat, hanging it on a hook, then begins to dry her hair with a towel. Frederick takes a bite of his sandwich and another sip of coffee as Lee walks out of the bathroom, tossing the towel down on the counter. She takes a kettle and fills it with water. As Frederick continues his monologue, Lee is busy in the background: striking a wooden match and lighting a burner on the stove for the kettle, taking a glass out of the cupboard, walking into the bathroom for some pills, filling the glass with water in the kitchen sink, and taking her pills.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She bangs it shut, preoccupied. Gail exhales. She pops a slice of gum into her mouth as Mickey proceeds to speak. Mickey exhales. Pedestrians pass. The camera shifts up the hotel's facade, past its inviting flags, to its ornate panes several stories up. Elliot, his back to the camera, is opening the portal to Lee. Elliot shuts the portal behind her as she enters. They stand very near to each other, outlined by the portal and a stark, subtly striped wallpapered barrier. They stroll towards the camera, further into the chamber. Elliot places his limb around Lee. The camera trails Lee as she strides towards the draped windows, past a hearth, a mirror, some innocuous illustrations, a delicate table supporting a lamp, the foot of the bed. She parts a corner of the drapes, peering out the window, turning when Elliot speaks. He strides over to Lee by the draped windows. He takes Lee into his embrace. They smooch, their forms nearly silhouetted in the warm glow of the chamber. Elliot removes Lee's coat without breaking the smooch. They hug. They peck each other lightly, then stronger, more fervently, their hug much tighter. The harpsichord melody commences to play again as the camera shifts over the bed covers to disclose Lee, lying contentedly under the sheets, her hair fanned out on the pillows, one limb near her head. He enters the screen, perching on the rim of the bed adjacent to Lee. He holds a cigarette. Elliot chuckles; they clasp hands. Elliot leans down to Lee; they commence to smooch fervently. Lee strolls along the sidewalk in the rain; she's bareheaded. An automobile drives by; a pedestrian passes holding an umbrella. Lee passes a restaurant well lit inside by hanging lamps. The baroque melody continues as she enters the loft, her head soaked. She shuts the door, touching her drenched hair. Lee strolls through the loft's living room area, unfastening her coat, towards the lavatory. She passes Frederick, who sits at a table in the kitchenette area, drinking a cup of coffee and perusing the paper. As he talks, Lee is seen switching on the lavatory light. She removes her coat, hanging it on a hook, then begins to dry her hair with a towel. Frederick takes a bite of his sandwich and another sip of coffee as Lee strolls out of the lavatory, tossing the towel down on the countertop. She takes a kettle and fills it with water. As Frederick continues his monologue, Lee is busy in the background: striking a wooden match and igniting a burner on the stove for the kettle, taking a glass out of the cupboard, strolling into the lavatory for some pills, filling the glass with water in the kitchen sink, and taking her pills."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "It is slammed closed by her, distracted. Gail sighs were heard. A piece of gum is popped into her mouth by her as Mickey continues to speak. A sigh is given by Mickey. They pass pedestrians. The hotel's facade is moved up by the camera, past its welcoming flags, to its ornate windows several floors up. Elliot, with his back to the camera, opens the door for Lee. The door is closed by Elliot behind her as she enters. They are stood very close to each other, framed by the door and a stark, subtly striped wallpapered wall. Towards the camera, further into the room, they walk. His arm is put around Lee by Elliot. Lee is followed by the camera as she walks towards the curtained windows, past a fireplace, a mirror, some innocuous pictures, a delicate table holding a lamp, the foot of the bed. A corner of the curtains is parted by her, looking out the window, turning when Elliot speaks. He walks over to Lee by the curtained windows. Lee is taken into his arms by him. They kiss, their figures almost silhouetted in the warm glow of the room. Lee's coat is taken off by Elliot without breaking the kiss. An embrace is shared by them. Light kisses are exchanged by them, then stronger, more passionately, their embrace much tighter. The harpsichord music begins to play again as the bed covers are moved over by the camera to reveal Lee, lying contentedly under the sheets, her hair fanned out on the pillows, one arm near her head. The screen shows him entering, sitting down on the edge of the bed next to Lee. A cigarette is held by him. A chuckle is given by Elliot; hands are held by them. Elliot leans down to Lee; they begin to kiss passionately. Along the sidewalk in the rain walks Lee; bareheaded is she. By a car, a pedestrian is driven past holding an umbrella. A restaurant well lit inside by hanging lamps is passed by Lee. The baroque music continues as the loft is entered by her, her head soaked. The door is closed by her, touching her soaking hair. Through the loft's living room area, Lee walks, unbelting her coat, towards the bathroom. Frederick, who sits at a table in the kitchen area, drinking a cup of coffee and reading the paper, is passed by her. As he talks, Lee turns on the bathroom light. Her coat is taken off by her, hanging it on a hook, then her hair is begun to dry with a towel. A bite of his sandwich and another sip of coffee are taken by Frederick as Lee walks out of the bathroom, tossing the towel down on the counter. A kettle is taken and filled with water by her. As Frederick continues his monologue, Lee is busy in the background: a wooden match is struck and a burner on the stove for the kettle is lit by her, a glass is taken out of the cupboard, she walks into the bathroom for some pills, the glass is filled with water in the kitchen sink, and her pills are taken by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Distracted, she slams it shut. Gail sighs and pops gum into her mouth as Mickey talks. Mickey sighs. Pedestrians pass by. The camera pans up the hotel facade, past welcoming flags to ornate windows above. Elliot, back to the camera, opens the door for Lee, closing it behind her. They stand closely against a striped wallpapered wall, then walk further into the room. Elliot puts his arm around Lee. The camera follows her to the curtained windows, past a fireplace, mirror, pictures, a delicate table with a lamp, and a bed’s foot. She parts the curtain, looking out, turning as Elliot talks. He approaches, embracing her. They kiss, silhouettes in the room’s warm glow. Elliot removes Lee's coat mid-kiss. Their kiss deepens and tightens. Harpsichord music plays as the camera reveals Lee content under sheets, her hair spread on pillows, an arm near her head. He sits on the bed's edge with a cigarette, chuckles, and they hold hands. Elliot leans in for a passionate kiss. Lee walks in the rain, bareheaded; a car and a pedestrian with an umbrella pass. She passes a brightly lit restaurant. The baroque music continues as she enters the loft, soaking wet. She closes the door, touches her wet hair, then walks through the loft, unbelting her coat, toward the bathroom. Frederick sits at a kitchen table, drinking coffee and reading the paper. As he talks, Lee turns on the bathroom light, removes her coat, and dries her hair with a towel. Frederick eats a sandwich and sips coffee. Lee leaves the bathroom, tosses the towel, fills a kettle with water, and listens to Frederick's monologue. She lights a stove burner, grabs a glass, fetches pills from the bathroom, fills the glass with water, and takes her pills."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gail sighs and pops gum in her mouth as Mickey speaks. Pedestrians pass. The camera pans up a hotel's facade to ornate windows. Elliot opens a door for Lee, closes it, and they stand close amid striped wallpaper. He puts his arm around her as they walk into the room. Lee walks to curtained windows, passing a fireplace, pictures, and a lamp-topped table. She parts the curtains, looks out, and turns when Elliot speaks. He joins her, they embrace, and kiss passionately, with her coat removed. Harpsichord music begins as the camera reveals Lee content under sheets, hair on pillows. Elliot sits beside her holding a cigarette, they kiss. Lee walks bareheaded in rain past a restaurant with hanging lamps. She enters a loft, closes the door, and dries her soaking hair. She passes Frederick, who drinks coffee and reads. She turns on the bathroom light, hangs her coat, and dries her hair. Frederick eats as Lee fills the kettle and lights the stove, takes a glass for pills, fills it at the sink, and takes her pills while Frederick continues his monologue."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She slams the door closed with a loud bang, clearly preoccupied and distracted. Gail lets out a long, weary sigh. She casually pops a piece of gum into her mouth while Mickey continues to speak without pausing. Mickey, too, lets out a heavy sigh. Pedestrians continue to pass by, bustling about in the background. The camera gradually moves upward, capturing the impressive facade of the hotel, which is adorned with welcoming flags gently fluttering in the breeze, ascending until it reaches the building’s beautifully ornate windows several floors above. With his back turned to the camera, Elliot is seen opening the door for Lee. As she steps inside, Elliot shuts the door behind her. The two stand extraordinarily close to one another, framed by the doorway and against a stark wall adorned with subtle, striped wallpaper. Together, they begin to walk towards the camera, moving further into the inviting room. Elliot affectionately places his arm around Lee. The camera continues to focus on Lee as she moves towards the curtained windows, passing by a quaint fireplace, a mirror reflecting the room's warmth, some innocuous pictures on the walls, a delicate table holding a slender lamp, and finally reaching the foot of the bed. She carefully parts a corner of the curtains, gazing out of the window before turning around when Elliot begins to speak. He then walks over to join Lee by the curtained windows. He gently takes Lee into his arms, and they share a kiss, their figures almost becoming silhouetted in the room's warm, glowing light. Without breaking the embrace of the kiss, Elliot slowly removes Lee's coat. They continue to embrace, their kisses start gently but then grow stronger and more passionate, their embrace tightening with every moment. The soothing sounds of harpsichord music softly begin to play once again as the camera pans over the bed covers to reveal Lee, lying contentedly beneath the sheets, her hair beautifully fanned out upon the pillows, with one arm resting near her head. Elliot then enters the scene, seating himself on the edge of the bed next to Lee, holding onto a cigarette. Elliot lets out a soft chuckle; they intertwine their hands. Leaning down towards Lee, they begin to kiss passionately once more. Later, Lee is seen walking along the rain-soaked sidewalk, bareheaded and exposed to the elements. A car drives by, splashing water, and a pedestrian passes by, wisely holding an umbrella. Lee walks past a restaurant, which is brightly lit from within by the glow of hanging lamps. The evocative baroque music continues to play as she eventually enters the loft, her hair and clothes soaked through from the rain. She closes the door behind her, reaching up to touch her dripping hair. Moving through the loft's living room area, she begins to unbelt her coat while heading toward the bathroom. As she passes Frederick, who is seated at a table in the kitchen area, he is seen sipping a cup of coffee and reading the newspaper. As Frederick speaks, Lee is visible turning on the bathroom light. She removes her wet coat, hanging it carefully on a hook, before starting to dry her hair with a towel. Meanwhile, Frederick takes a bite from his sandwich and another sip of his coffee as Lee emerges from the bathroom, casually tossing the towel down onto the counter. She proceeds to take a kettle and fills it with water. As Frederick continues his ongoing monologue, Lee remains busy in the background: she strikes a wooden match to light a burner on the stove for the kettle, retrieves a glass from the cupboard, heads into the bathroom for some pills, fills the glass with water at the kitchen sink, and finally takes her pills with a gulp of water."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a resounding bang that echoed through the quiet surroundings, she forcefully slammed the door shut, her mind clearly preoccupied and her demeanor noticeably distracted. Gail, feeling the weight of the world, let out a long, weary sigh that seemed to express her inner turmoil. Nonchalantly, and with practiced ease, she popped a piece of gum into her mouth, all the while Mickey continued speaking incessantly, without any signs of pausing. Mickey, too, let out a heavy sigh, joining Gail in her expression of fatigue. Meanwhile, on the bustling streets outside, pedestrians steadily continued to pass by, going about their own business, providing a backdrop of constant activity. \n\nThe camera, with a smooth and deliberate motion, gradually moved upward, capturing the impressive and elegant facade of the grand hotel. This facade was adorned with an array of welcoming flags that gently fluttered in the breeze, each movement a testament to the hotel's majestic presence. The camera ascended steadily until it reached the building's beautifully ornate windows, several floors above the ground. In the frame, with his back turned to the camera, Elliot was seen courteously opening the door for Lee. As she gracefully stepped inside, Elliot carefully shut the door behind her, and the two of them stood extraordinarily close to one another, framed perfectly by the doorway. They were against a stark wall decorated with subtle, striped wallpaper that added a touch of sophistication to the scene. Together, they began to walk slowly towards the camera, moving further into the inviting room. With a tender gesture, Elliot affectionately placed his arm around Lee, drawing her closer. \n\nThe camera maintained its focus on Lee as she walked towards the curtained windows, passing by charming elements in the room: a quaint fireplace that whispered of warmth, a mirror reflecting the room's cozy atmosphere, some innocuous pictures that adorned the walls, and a delicate table holding a slender, elegant lamp. She finally reached the foot of the bed, where she carefully parted a corner of the curtains to gaze out of the window at the world beyond. Turning around at the sound of Elliot's voice as he began to speak, she watched as he walked over to join her by the curtained windows. He gently took Lee into his arms, and they shared a kiss, their figures almost becoming silhouetted by the room's softly glowing, warm light. Without even breaking the embrace of their kiss, Elliot began to slowly remove Lee's coat. They continued to embrace, their kisses initially gentle but gradually growing stronger and more passionate, their embrace deepening and tightening with every passing moment.\n\nAs the soothing and melodic strains of harpsichord music softly resumed once again, the camera panned over the bedcovers to reveal Lee, lying contentedly beneath the sheets. Her hair was beautifully fanned out across the pillows, and her arm rested languidly near her head. Elliot then reentered the scene, seating himself comfortably on the edge of the bed next to Lee, holding onto a cigarette with a relaxed air. He let out a soft chuckle, and they intertwined their hands in a quiet moment of connection. Leaning down towards Lee, they began to kiss passionately once more, lost in the moment. Later on, Lee was seen walking along the rain-soaked sidewalk, her head bare and fully exposed to the relentless elements. A car drove by, splashing water in its wake, while a pedestrian wisely passed by, securely holding an umbrella against the rain. Lee continued her path, walking past a restaurant that was brightly lit from within by the warm glow of hanging lamps. The evocative, baroque music continued to play softly as she eventually reached and entered the loft, her hair and clothes thoroughly soaked through from the rain. She closed the door firmly behind her, reaching up to touch her damp, dripping hair. \n\nMoving through the loft's inviting living room area, she began to unbelt her coat while making her way towards the bathroom. As she passed Frederick, who was seated comfortably at a table in the kitchen area, he was seen sipping a cup of coffee and reading the newspaper in his usual morning routine. As Frederick engaged in conversation, Lee was visible through the doorway, turning on the bathroom light. She removed her wet coat, hanging it carefully on a hook to dry, before she started drying her hair with a towel. Meanwhile, Frederick took a bite from his sandwich and followed it with another sip of his coffee as Lee emerged, towing the towel onto the counter with casual ease. She proceeded to take a kettle, filling it with water in preparation. While Frederick continued his ongoing monologue, Lee remained busy in the background: striking a wooden match to light a burner on the stove for the kettle, retrieving a glass from the cupboard, heading into the bathroom for her pills, filling the glass with water at the kitchen sink, and finally taking her pills with a brisk gulp of water."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She forcefully shuts it with a distracted air, her mind seemingly elsewhere. Gail lets out a deep sigh, conveying a sense of weariness or exasperation. Simultaneously, she reaches into her pocket, extracts a piece of gum, and slips it into her mouth, chewing absently as Mickey continues his monologue. Another sigh escapes Mickey's lips, signaling frustration or resignation. Meanwhile, the busy city life trundles on, with pedestrians steadily moving along the bustling street. The camera begins to ascend, capturing the hotel’s exterior in a sweeping motion that glides past the welcoming flags fluttering in the breeze, moving up to showcase the ornate architectural details of the windows several floors above. Inside, Elliot, his back facing the camera, is seen opening the door to usher Lee into the room. As she crosses the threshold, Elliot gently closes the door behind her, the sound muted yet final. They stand intimately close, framed by the doorway and against a backdrop of stark, subtly striped wallpaper. Together, they begin to walk towards the camera, moving further into the room, their footsteps soft and in unison. Elliot gently wraps an arm around Lee, providing a sense of connection and intimacy. The camera tracks Lee as she moves gracefully towards the curtained windows, passing by a quaint fireplace, a reflective mirror, a collection of innocuous pictures, a delicate table supporting a lamp, and finally the foot of the bed. Upon reaching the windows, she gingerly parts the corner of the curtains, gazing out contemplatively. Her attention shifts as she turns in response to Elliot's voice, which draws him to her side by the window. In a tender gesture, Elliot enfolds Lee in his arms, leading them into a soft, shared kiss, their bodies silhouetted against the room’s warm glow. Without breaking contact, Elliot smoothly slips Lee's coat off her shoulders. They continue to embrace, their lips brushing lightly, then more intensely, locked in a deeper, more fervent kiss, their bodies pressing closer together. As the harpsichord music swells softly in the background, the camera drifts over the rumpled bed covers to reveal Lee resting contentedly beneath the sheets, her hair splayed out in a halo on the pillows, one arm resting near her head. Elliot appears in the frame, sitting gently on the edge of the bed beside her, a cigarette casually held between his fingers. He lets out a soft chuckle, their hands intertwining in a comfortable, familiar gesture. With a playful intent, Elliot leans down, initiating another passionate kiss with Lee, deepening the moment. The scene shifts to Lee, now walking along a rain-dampened sidewalk, her head unprotected from the drizzle. A car splashes by, and a pedestrian hurries past, clutching an umbrella against the rain. Lee, seemingly unperturbed, strides past a restaurant warmly lit with hanging lamps that cast a welcoming glow. The baroque music provides a rich audio backdrop as she steps into the loft, her hair visibly wet from the rain. She closes the door behind her, pausing to run her fingers through her drenched hair. Lee makes her way across the loft’s living room area, unfastening her coat as she heads towards the bathroom. On her way, she passes Frederick, who is seated at the kitchen table, sipping coffee and engrossed in his newspaper. His voice carries on as she reaches the bathroom, flipping on the light switch to illuminate the space. She methodically removes her coat, hanging it neatly on a hook, and proceeds to towel-dry her hair. Frederick, meanwhile, takes a bite of his sandwich, chasing it down with another sip of coffee. Lee reenters the living space, casually discarding the towel on the counter as she moves. She retrieves a kettle, filling it with water in preparation for tea. As Frederick continues his ongoing narrative, Lee efficiently moves about in the background: she strikes a wooden match to ignite a burner on the stove for the kettle, selects a glass from the cupboard, ventures into the bathroom to fetch some pills, fills the glass with water at the kitchen sink, and finally takes her pills, completing her routine with practiced ease."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Distracted, she closes something forcefully while Gail and Mickey sigh in the background. Meanwhile, the camera offers a view of the hotel’s facade, highlighting its welcoming flags and ornate windows. Inside, Elliot admits Lee into the room, closing the door as they stand closely together, framed by a starkly wallpapered wall. They move toward the camera, and Elliot embraces Lee while they walk past various furnishings until Lee reaches the windows. She peeks outside before turning back to Elliot, who approaches her. He embraces Lee, and they share a kiss, silhouetted by the room's warm glow. Without pausing the kiss, Elliot takes off Lee's coat, and they continue to kiss passionately as the harpsichord music plays. The scene transitions to Lee contentedly lying under the bed sheets, her hair spread across the pillows, with Elliot sitting beside her, smoking. They hold hands and share a chuckle before engaging in another passionate kiss.\n\nLater, Lee is seen walking bareheaded in the rain, passing a brightly lit restaurant. The baroque music continues as she enters her loft, soaking wet, and closes the door while touching her damp hair. She walks through the living room, removing her coat on the way to the bathroom, passing Frederick, who sips coffee while reading the paper. As Lee turns on the bathroom light and dries her hair with a towel, Frederick continues to talk. Lee exits the bathroom, discards the towel, and begins preparing tea by lighting the stove and filling a kettle. She then retrieves a glass from the cupboard, collects some pills from the bathroom, fills the glass with water at the kitchen sink, and takes her pills, all while Frederick continues his monologue."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She slams it closed, distracted by the myriad of thoughts racing through her mind about the upcoming meeting. Gail sighs, perhaps overwhelmed by the day's earlier events. She pops a piece of gum into her mouth, the peppermint flavor refreshing her senses, as Mickey continues to speak about the changes in the project's timeline. Mickey sighs with a hint of frustration. Pedestrians, likely in a hurry to escape the morning drizzle, pass by the bustling city street. The camera moves up the hotel's facade, a landmark known for its Art Deco architecture reminiscent of 1920s glamor, past its welcoming flags, to its ornate windows several floors up. Elliot, his back to the camera, is opening the door to Lee, who has just returned from a business trip. Elliot closes the door behind her as she enters. They stand very close to each other, framed by the door and a stark, subtly striped wallpapered wall that echoes the hotel's vintage charm. They walk towards the camera, further into the room. Elliot puts his arm around Lee, drawing her into a familiar embrace. The camera follows Lee as she walks towards the curtained windows, the heavy brocade hinting at the luxury within, past a fireplace that often holds a warm fire on colder nights, a mirror, some innocuous pictures capturing serene landscapes, a delicate table holding a lamp designed by a renowned local artisan, the foot of the bed draped with a plush comforter. She parts a corner of the curtains, looking out the window at the city below, turning when Elliot speaks. He walks over to Lee by the curtained windows. He takes Lee into his arms. They kiss, their figures almost silhouetted in the warm glow of the room, the kind of lighting that suggests intimacy and calm. Elliot takes Lee's coat off without breaking the kiss. They embrace. They kiss each other lightly, then stronger, more passionately, their embrace much tighter. The harpsichord music begins to play again, echoing the classical tones often associated with this hotel's elegant atmosphere, as the camera moves over the bed covers to reveal Lee, lying contentedly under the sheets, her hair fanned out on the pillows, one arm near her head. He enters the screen, sitting down on the edge of the bed next to Lee. He holds a cigarette, its scent mingling with the faint aroma of lavender from the sheets. Elliot chuckles; they hold hands. Elliot leans down to Lee; they begin to kiss passionately. Lee walks along the sidewalk in the rain; she's bareheaded, defying the weather with a sense of freedom. A car drives by; a pedestrian passes holding an umbrella. Lee passes a restaurant well lit inside by hanging lamps, the kind of place loved by artists and intellectuals for its cozy atmosphere. The baroque music continues as she enters the loft, her head soaked from the unrelenting rain. She closes the door, touching her soaking hair, the dampness a reminder of the weather's unpredictability. Lee walks through the loft's living room area, filled with eclectic furniture reflecting her artistic taste, unbelting her coat, towards the bathroom. She passes Frederick, who sits at a table in the kitchen area, the aroma of freshly brewed coffee filling the air, drinking a cup and reading the paper. As he talks, Lee is seen turning on the bathroom light. She takes off her coat, hanging it on a hook, then begins to dry her hair with a towel. Frederick takes a bite of his sandwich, the crunch of fresh lettuce audible, and another sip of coffee as Lee walks out of the bathroom, tossing the towel down on the counter. She takes a kettle and fills it with water, preparing for an evening cup of herbal tea. As Frederick continues his monologue about the day's news, Lee is busy in the background: striking a wooden match and lighting a burner on the stove for the kettle, taking a glass out of the cupboard, walking into the bathroom for some pills prescribed for her persistent headaches, filling the glass with water in the kitchen sink, and taking her pills thoughtfully."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She slams it closed distracted. Gail sighs. She pops a piece of gum into her mouth as Mickey continues to speak. Mickey sighs. Pedestrians pass. The camera moves up the hotel's facade past its welcoming flags to its ornate windows several floors up. Elliot his back to the camera is opening the door to Lee. Elliot closes the door behind her as she enters. They stand very close to each other framed by the door and a stark subtly striped wallpapered wall. They walk towards the camera further into the room. Elliot puts his arm around Lee. The camera follows Lee as she walks towards the curtained windows past a fireplace a mirror some innocuous pictures a delicate table holding a lamp the foot of the bed. She parts a corner of the curtains looking out the window turning when Elliot speaks. He walks over to Lee by the curtained windows. He takes Lee into his arms. They kiss their figures almost silhouetted in the warm glow of the room. Elliot takes Lee's coat off without breaking the kiss. They embrace. They kiss each other lightly then stronger more passionately their embrace much tighter. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. The harpsichord music begins to play again as the camera moves over the bed covers to reveal Lee lying contentedly under the sheets her hair fanned out on the pillows one arm near her head. He enters the screen sitting down on the edge of the bed next to Lee. He holds a cigarette. Elliot chuckles. they hold hands. Elliot leans down to Lee. they begin to kiss passionately. Lee walks along the sidewalk in the rain. she is bareheaded. A car drives by a pedestrian passes holding an umbrella. Lee passes a restaurant well lit inside by hanging lamps. The baroque music continues as she enters the loft her head soaked. She closes the door touching her soaking hair. Lee walks through the loft's living room area unbelting her coat towards the bathroom. She passes Frederick who sits at a table in the kitchen area drinking a cup of coffee and reading the paper. As he talks Lee is seen turning on the bathroom light. She takes off her coat hanging it on a hook then begins to dry her hair with a towel. Frederick takes a bite of his sandwich and another sip of coffee as Lee walks out of the bathroom tossing the towel down on the counter. She takes a kettle and fills it with water. As Frederick continues his monologue Lee is busy in the background striking a wooden match and lighting a burner on the stove for the kettle taking a glass out of the cupboard walking into the bathroom for some pills filling the glass with water in the kitchen sink and taking her pills."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She slams it closed distracted. Gail sighs. She pops a piece of gum into her mouth as Mickey continues to speak. Mickey sighs. Pedestrians pass. The camera moves up the hotel's facade past its welcoming flags to its ornate windows several floors up. Elliot his back to the camera is opening the door to Lee. Elliot closes the door behind her as she enters. They stand very close to each other framed by the door and a stark subtly striped wallpapered wall. They walk towards the camera further into the room. Elliot puts his arm around Lee. The camera follows Lee as she walks towards the curtained windows past a fireplace a mirror some innocuous pictures a delicate table holding a lamp the foot of the bed. She parts a corner of the curtains looking out the window turning when Elliot speaks. He walks over to Lee by the curtained windows. He takes Lee into his arms. They kiss their figures almost silhouetted in the warm glow of the room. Elliot takes Lee's coat off without breaking the kiss. They embrace. They kiss each other lightly then stronger more passionately their embrace much tighter. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. The harpsichord music begins to play again as the camera moves over the bed covers to reveal Lee lying contentedly under the sheets her hair fanned out on the pillows one arm near her head. He enters the screen sitting down on the edge of the bed next to Lee. He holds a cigarette. Elliot chuckles. they hold hands. Elliot leans down to Lee. they begin to kiss passionately. Lee walks along the sidewalk in the rain. she is bareheaded. A car drives by a pedestrian passes holding an umbrella. Lee passes a restaurant well lit inside by hanging lamps. The baroque music continues as she enters the loft her head soaked. She closes the door touching her soaking hair. Lee walks through the loft's living room area unbelting her coat towards the bathroom. She passes Frederick who sits at a table in the kitchen area drinking a cup of coffee and reading the paper. As he talks Lee is seen turning on the bathroom light. She takes off her coat hanging it on a hook then begins to dry her hair with a towel. Frederick takes a bite of his sandwich and another sip of coffee as Lee walks out of the bathroom tossing the towel down on the counter. She takes a kettle and fills it with water. As Frederick continues his monologue Lee is busy in the background striking a wooden match and lighting a burner on the stove for the kettle taking a glass out of the cupboard walking into the bathroom for some pills filling the glass with water in the kitchen sink and taking her pills."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She slams it closed distracted. Gail sighs. She pops a piece of gum into her mouth as Mickey continues to speak. Mickey sighs. Pedestrians pass. The camera moves up the hotel's facade past its welcoming flags to its ornate windows several floors up. Elliot his back to the camera is opening the door to Lee. Elliot closes the door behind her as she enters. They stand very close to each other framed by the door and a stark subtly striped wallpapered wall. They walk towards the camera further into the room. Lee passes a restaurant well lit inside by hanging lamps. The baroque music continues as she enters the loft her head soaked. She closes the door touching her soaking hair. Lee walks through the loft's living room area unbelting her coat towards the bathroom. She passes Frederick who sits at a table in the kitchen area drinking a cup of coffee and reading the paper. As he talks Lee is seen turning on the bathroom light. She takes off her coat hanging it on a hook then begins to dry her hair with a towel. Frederick takes a bite of his sandwich and another sip of coffee as Lee walks out of the bathroom tossing the towel down on the counter. She takes a kettle and fills it with water. As Frederick continues his monologue Lee is busy in the background striking a wooden match and lighting a burner on the stove for the kettle taking a glass out of the cupboard walking into the bathroom for some pills filling the glass with water in the kitchen sink and taking her pills."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She slams it closed distracted. Gail sighs. She pops a piece of gum into her mouth as Mickey continues to speak. Mickey sighs. She takes off her coat hanging it on a hook then begins to dry her hair with a towel. Frederick takes a bite of his sandwich and another sip of coffee as Lee walks out of the bathroom tossing the towel down on the counter. She takes a kettle and fills it with water. As Frederick continues his monologue Lee is busy in the background striking a wooden match and lighting a burner on the stove for the kettle taking a glass out of the cupboard walking into the bathroom for some pills filling the glass with water in the kitchen sink and taking her pills."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "He throws it open, bewildered. Lester grunts. He slips a slice of bread into his pocket as Wanda proceeds to sing. Wanda grunts. Cyclists pedal. The lens tilts down the bungalow's roof, beneath its swaying banners, to its shattered skylights a few stories down. Beverly, her face to the lens, is closing the gate on Finn. Beverly opens the gate before him as he exits. They sit quite far from each other, bordered by the gate and a smooth, vividly flowered carpeted ceiling. They run away from the lens, deeper out of the space. Beverly lifts her foot below Finn. The lens trails Finn as he runs away from the open skylights, beyond a staircase, a shelf, some vibrant books, a sturdy chair holding a candle, the post of the couch. He pushes a corner of the blinds, staring in the ceiling, singing when Beverly dances. She jumps away from Finn near the open skylights. She drops Finn from her feet. They laugh, their silhouettes barely highlighted in the cool shadow of the space. Beverly puts Finn's scarf on without ending the laugh. They part. They laugh around wildly, then softer, less intensely, their parting much lighter. The flute music ends to stop again as the lens jumps under the couch cushions to hide Finn, standing nervously on top of the blankets, his shoes tangled around the rugs, one foot on his lap. She exits the picture, standing up from the middle of the couch beside Finn. She drops a magazine. Beverly sobs; they wave feet. Beverly jumps up from Finn; they refuse to laugh softly. Finn runs beside the pathway in the sunshine; he's wearing shoes. A bicycle stops near; a cyclist sidesteps dropping a scarf. Finn stops an office poorly dimmed outside by flickering candles. The jazz music pauses before he exits the basement, their shoes dried. He opens the gate, fixing his freshly combed shoes. Finn runs around the basement's swimming area, undoing his scarf, away toward the bedroom. He jumps over Margot, who floats through a chair on the garden table, stirring a bowl of soup and writing the letter. Since she yells, Finn disappears switching off the bedroom fan. He drops on his scarf, throwing it below a rack, then finishes to clean his shoes with a mop. Margot drops a piece of her cake and one more dunk of soup as Finn jumps in on the bedroom, flipping the mop up on the floor. He drops a blender and empties it with milk. Since Margot pauses her soliloquy, Finn has been quiet in the foreground: tossing a plastic lighter and extinguishing a candle on the porch for the blender, dropping a cup into the cabinet, jumping out of the bedroom for a pen, emptying the cup with milk into the garden hose, and dropping his pen."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gail, distracted, closes something and sighs while Mickey continues speaking, and pedestrians pass by. The scene shifts to a hotel's facade, and inside, Elliot welcomes Lee into the room. They stand close, framed by a subtly striped wall, and move further into the room as Elliot embraces Lee. She approaches the curtained windows, looks out, and then turns to Elliot. They kiss passionately, silhouetted in the warm room light. Elliot removes Lee’s coat as they continue embracing and kissing. Harpsichord music plays as Lee lies contentedly under the sheets. Elliot sits on the bed, holding a cigarette, then they kiss again. Later, Lee walks bareheaded in the rain, passing a lit restaurant. Entering a loft, she touches her wet hair and heads to the bathroom. She passes Frederick in the kitchen, drinking coffee and reading. Lee dries her hair, boils a kettle, and takes some pills while Frederick talks on, showcasing her busy routine in the background."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As Frederick continues his monologue Lee is busy in the background striking a wooden match and lighting a burner on the stove for the kettle taking a glass out of the cupboard walking into the bathroom for some pills filling the glass with water in the kitchen sink and taking her pills She takes a kettle and fills it with water Frederick takes a bite of his sandwich and another sip of coffee as Lee walks out of the bathroom tossing the towel down on the counter She takes off her coat hanging it on a hook then begins to dry her hair with a towel As he talks Lee is seen turning on the bathroom light She passes Frederick who sits at a table in the kitchen area drinking a cup of coffee and reading the paper Lee walks through the loft's living room area unbelting her coat towards the bathroom She closes the door touching her soaking hair The baroque music continues as she enters the loft her head soaked Lee passes a restaurant well lit inside by hanging lamps A car drives by a pedestrian passes holding an umbrella she is bareheaded Lee walks along the sidewalk in the rain they begin to kiss passionately Elliot leans down to Lee they hold hands Elliot chuckles He holds a cigarette He enters the screen sitting down on the edge of the bed next to Lee The harpsichord music begins to play again as the camera moves over the bed covers to reveal Lee lying contentedly under the sheets her hair fanned out on the pillows one arm near her head They kiss each other lightly then stronger more passionately their embrace much tighter They embrace Elliot takes Lee's coat off without breaking the kiss They kiss their figures almost silhouetted in the warm glow of the room He takes Lee into his arms He walks over to Lee by the curtained windows She parts a corner of the curtains looking out the window turning when Elliot speaks The camera follows Lee as she walks towards the curtained windows past a fireplace a mirror some innocuous pictures a delicate table holding a lamp the foot of the bed Elliot puts his arm around Lee They walk towards the camera further into the room They stand very close to each other framed by the door and a stark subtly striped wallpapered wall Elliot closes the door behind her as she enters Elliot his back to the camera is opening the door to Lee The camera moves up the hotel's facade past its welcoming flags to its ornate windows several floors up Pedestrians pass Mickey sighs She pops a piece of gum into her mouth as Mickey continues to speak Gail sighs She slams it closed distracted"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Gail sighs She slams it closed distracted Mickey sighs She pops a piece of gum into her mouth as Mickey continues to speak The camera moves up the hotel's facade past its welcoming flags to its ornate windows several floors up Pedestrians pass Elliot closes the door behind her as she enters Elliot his back to the camera is opening the door to Lee They walk towards the camera further into the room They stand very close to each other framed by the door and a stark subtly striped wallpapered wall The camera follows Lee as she walks towards the curtained windows past a fireplace a mirror some innocuous pictures a delicate table holding a lamp the foot of the bed Elliot puts his arm around Lee He walks over to Lee by the curtained windows She parts a corner of the curtains looking out the window turning when Elliot speaks They kiss their figures almost silhouetted in the warm glow of the room He takes Lee into his arms They embrace Elliot takes Lee's coat off without breaking the kiss The harpsichord music begins to play again as the camera moves over the bed covers to reveal Lee lying contentedly under the sheets her hair fanned out on the pillows one arm near her head They kiss each other lightly then stronger more passionately their embrace much tighter He holds a cigarette He enters the screen sitting down on the edge of the bed next to Lee they hold hands Elliot chuckles they begin to kiss passionately Elliot leans down to Lee she is bareheaded Lee walks along the sidewalk in the rain Lee passes a restaurant well lit inside by hanging lamps A car drives by a pedestrian passes holding an umbrella She closes the door touching her soaking hair The baroque music continues as she enters the loft her head soaked She passes Frederick who sits at a table in the kitchen area drinking a cup of coffee and reading the paper Lee walks through the loft's living room area unbelting her coat towards the bathroom She takes off her coat hanging it on a hook then begins to dry her hair with a towel As he talks Lee is seen turning on the bathroom light She takes a kettle and fills it with water Frederick takes a bite of his sandwich and another sip of coffee as Lee walks out of the bathroom tossing the towel down on the counter As Frederick continues his monologue Lee is busy in the background striking a wooden match and lighting a burner on the stove for the kettle taking a glass out of the cupboard walking into the bathroom for some pills filling the glass with water in the kitchen sink and taking her pills"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He enters the screen sitting down on the edge of the bed next to Lee He holds a cigarette Elliot chuckles they hold hands Elliot leans down to Lee they begin to kiss passionately Lee walks along the sidewalk in the rain she is bareheaded A car drives by a pedestrian passes holding an umbrella Lee passes a restaurant well lit inside by hanging lamps The baroque music continues as she enters the loft her head soaked She closes the door touching her soaking hair Lee walks through the loft's living room area unbelting her coat towards the bathroom She passes Frederick who sits at a table in the kitchen area drinking a cup of coffee and reading the paper As he talks Lee is seen turning on the bathroom light She takes off her coat hanging it on a hook then begins to dry her hair with a towel Frederick takes a bite of his sandwich and another sip of coffee as Lee walks out of the bathroom tossing the towel down on the counter She takes a kettle and fills it with water As Frederick continues his monologue Lee is busy in the background striking a wooden match and lighting a burner on the stove for the kettle taking a glass out of the cupboard walking into the bathroom for some pills filling the glass with water in the kitchen sink and taking her pills She slams it closed distracted Gail sighs She pops a piece of gum into her mouth as Mickey continues to speak Mickey sighs Pedestrians pass The camera moves up the hotel's facade past its welcoming flags to its ornate windows several floors up Elliot his back to the camera is opening the door to Lee Elliot closes the door behind her as she enters They stand very close to each other framed by the door and a stark subtly striped wallpapered wall They walk towards the camera further into the room Elliot puts his arm around Lee The camera follows Lee as she walks towards the curtained windows past a fireplace a mirror some innocuous pictures a delicate table holding a lamp the foot of the bed She parts a corner of the curtains looking out the window turning when Elliot speaks He walks over to Lee by the curtained windows He takes Lee into his arms They kiss their figures almost silhouetted in the warm glow of the room Elliot takes Lee's coat off without breaking the kiss They embrace They kiss each other lightly then stronger more passionately their embrace much tighter The harpsichord music begins to play again as the camera moves over the bed covers to reveal Lee lying contentedly under the sheets her hair fanned out on the pillows one arm near her head"
        }
      ]
    }
  ]
}