{
  "ground_truth": "Reggie is on the phone, followed by Dyle also being on the phone. She opens the door of the cabin and starts out, stepping out of her cabin and looking into the others. All the cabins are occupied except one, which she looks inside, noticing the receiver hanging by its cord, swinging back and forth, leaving her confused. Meanwhile, Dyle and Scobie stand together waiting for the elevator, with Scobie clearly holding a gun in the pocket of his raincoat. The self-service elevator doors open, one or two passengers come out, and Dyle and Scobie enter, followed by a young girl who starts in after them. Scobie reaches out with his metal hand and presses the top button, and the doors close. As Scobie follows Dyle out of the elevator, Scobie looks around and notices an open door at the end of a short hall. He and Dyle approach it, with the camera following, and through the door, which Scobie closes behind them, is a flight of stairs leading up to a second floor. Dyle yawns wide, then gets to his feet, and starts up the stairs, followed by Scobie. Dyle stops at the door, opens it, and the stairs continue up to a spectacular view of the Paris rooftops and the city lights beyond. Dyle and Scobie come out onto a level portion of the roof. On the street side, the roof angles down abruptly into a steep, slate-covered pitch, broken only by two widely separated oval-shaped dormer windows. Dyle turns and looks, seeing nothing behind him but a sheer drop to the street, and moving quickly, he lashes out and hacks Scobie's gun hand with the side of his palm, causing the gun to fall to the roof. Dyle follows through by punching the large man full in the jaw, but instead of falling, Scobie wraps his arm around Dyle, holding on tightly until his head clears. To Dyle's amazement, he is lifted into the air, unable to break the bear-hold, and is carried toward the edge of the roof. Dyle works his arms between their two bodies and suddenly flails them out with all his strength, breaking the hold, but at the cost of his coat and the flesh on his back as Scobie's metal claw rips through both, leaving a wound extending from the center of Dyle's back to his shoulder. Both men look around for the gun, spotting it simultaneously and leaping for it, both landing short of the mark. They grapple with one another, each trying to break free and reach for the gun. Two hands, one real and one metal, inch toward the gun as the battle goes in Scobie's favor, whose weight and strength begin to tire Dyle, now on his back, trying to stop Scobie from crawling over him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Reggie is on the telephone, followed by Dyle also being on the telephone. She opens the portal of the cabin and starts out, stepping out of her cabin and looking into the others. All the cabins are occupied except one, which she inspects inside, noticing the handset hanging by its cord, swinging back and forth, leaving her perplexed. Meanwhile, Dyle and Scobie stand together waiting for the lift, with Scobie clearly holding a firearm in the pocket of his raincoat. The self-service lift doors open, one or two travelers come out, and Dyle and Scobie enter, followed by a young girl who starts in after them. Scobie reaches out with his metallic hand and presses the top button, and the doors shut. As Scobie follows Dyle out of the lift, Scobie looks around and notices an open portal at the end of a brief corridor. He and Dyle approach it, with the camera following, and through the portal, which Scobie closes behind them, is a flight of stairs leading up to a second story. Dyle yawns wide, then gets to his feet, and starts up the stairs, followed by Scobie. Dyle halts at the portal, opens it, and the stairs continue up to a spectacular view of the Paris rooftops and the city lights beyond. Dyle and Scobie come out onto a level portion of the roof. On the street side, the roof angles down abruptly into a steep, slate-covered pitch, broken only by two widely separated oval-shaped dormer windows. Dyle turns and looks, seeing nothing behind him but a sheer drop to the street, and moving quickly, he lashes out and hacks Scobie's firearm hand with the side of his palm, causing the firearm to fall to the roof. Dyle follows through by punching the large man full in the jaw, but instead of falling, Scobie wraps his arm around Dyle, holding on tightly until his head clears. To Dyle's astonishment, he is lifted into the air, unable to break the bear-hold, and is carried toward the edge of the roof. Dyle works his arms between their two bodies and suddenly flails them out with all his strength, breaking the hold, but at the cost of his coat and the flesh on his back as Scobie's metallic claw rips through both, leaving a wound extending from the center of Dyle's back to his shoulder. Both men look around for the firearm, spotting it simultaneously and leaping for it, both landing short of the mark. They grapple with one another, each trying to break free and reach for the firearm. Two hands, one real and one metallic, inch toward the firearm as the struggle goes in Scobie's favor, whose weight and strength begin to fatigue Dyle, now on his back, trying to stop Scobie from crawling over him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Reggie is on the phone, and Dyle is also on the phone. The door of the cabin is opened by her, and she starts out, stepping out of her cabin and looking into the others. She notices that all the cabins are occupied except one, in which the receiver hangs by its cord, swinging back and forth, leaving her confused. Meanwhile, the elevator is waited for by Dyle and Scobie, with a gun clearly held by Scobie in the pocket of his raincoat. The self-service elevator doors open, one or two passengers come out, and Dyle and Scobie enter, followed by a young girl who starts in after them. The top button is pressed by Scobie with his metal hand, and the doors close. As Dyle is followed by Scobie out of the elevator, Scobie looks around and notices an open door at the end of a short hall. The door is approached by him and Dyle, with the camera following, and a flight of stairs leading up to a second floor is through the door, which is closed by Scobie behind them. Dyle yawns wide, then gets to his feet and starts up the stairs, with Scobie following. At the door Dyle stops, opens it, and the stairs continue up to a spectacular view of the Paris rooftops and the city lights beyond. Dyle and Scobie come out onto a level portion of the roof. On the street side, the roof angles down abruptly into a steep, slate-covered pitch, broken only by two widely separated oval-shaped dormer windows. Dyle turns and looks, seeing nothing behind him but a sheer drop to the street, and moving quickly, Scobie's gun hand is hacked by him with the side of his palm, causing the gun to fall to the roof. The large man is punched full in the jaw by Dyle, but instead of falling, Dyle is wrapped by Scobie in his arm, holding on tightly until his head clears. To Dyle's amazement, he lifts him into the air, and Dyle is unable to break the bear-hold and is carried toward the edge of the roof. Dyle works his arms between their two bodies and suddenly flails them out with all his strength, breaking the hold, but at the cost of his coat and the flesh on his back as both are ripped by Scobie's metal claw, leaving a wound extending from the center of Dyle's back to his shoulder. The gun is looked around for by both men, spotted simultaneously, and leapt for, with both landing short of the mark. They grapple with one another, each trying to break free and reach for the gun. Two hands, one real and one metal, inch toward the gun as the battle goes in favor of Scobie, whose weight and strength begin to tire Dyle, now on his back, trying to stop Scobie from crawling over him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Reggie is on the phone, followed by Dyle. She exits her cabin, observing that all cabins are occupied except one, where the receiver hangs and swings, puzzling her. Meanwhile, Dyle and Scobie wait for the elevator, Scobie with a gun in his raincoat pocket. The elevator arrives, and they enter with a young girl. Scobie uses his metal hand to press the top button. As they exit, Scobie notices an open door at the hall's end. They approach, enter, and find stairs leading to a second floor. Dyle yawns and ascends, followed by Scobie, to a rooftop with Paris views. The roof slopes steeply, broken by dormer windows. Dyle checks his surroundings, and suddenly strikes Scobie's gun hand, causing the gun to fall. Dyle punches Scobie, but Scobie holds him tightly, lifting him toward the roof edge. Dyle breaks free but tears his coat and injures his back on Scobie's metal claw. Both men spot the gun simultaneously. They grapple, each trying to reach the gun. Scobie's strength and weight begin to overwhelm Dyle, now struggling on his back."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Reggie and Dyle are both on the phone. Reggie exits her cabin, noticing all cabins occupied except one with a dangling receiver, leaving her puzzled. Dyle and Scobie wait for an elevator; Scobie conceals a gun in his raincoat. They enter the elevator with a young girl; Scobie uses his metal hand to press the top button. Exiting, they notice an open door leading to stairs and a rooftop with city views. Dyle hacks Scobie's gun hand, causing the gun to fall. They struggle; Scobie lifts Dyle, who breaks free but sustains a back injury. Both scramble for the gun; Scobie's weight overpowers Dyle."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Reggie is engaged in a phone conversation, soon followed by Dyle, who is also on the telephone. She proceeds to open the door of her cabin and steps out into the corridor, glancing curiously into the other cabins. Every cabin she passes is occupied except for a single one, which catches her attention. As she peers inside this vacant cabin, she notices the telephone receiver, which is dangling mysteriously by its cord, swaying gently back and forth. This sight leaves her feeling puzzled and uncertain. Meanwhile, Dyle and Scobie are standing together, waiting patiently for the arrival of the elevator. It is noticeable that Scobie is clearly holding a gun, concealed within the pocket of his raincoat. The self-service elevator doors open smoothly, and one or two passengers emerge. Dyle and Scobie then step into the elevator, followed by a young girl who enters cautiously after them. Scobie, using his metal hand, presses the top button to begin their ascent, and the elevator doors close. \n\nAs Scobie follows Dyle out of the elevator, he takes a moment to glance around, noticing an open door at the very end of a short hallway. He and Dyle proceed to approach this door, with the camera following their movements closely. Through this door, which Scobie closes securely behind them, they find themselves at a flight of stairs leading upward to another level. Dyle yawns widely as he stands up and begins to climb the stairs, with Scobie following closely behind. Dyle comes to a stop at the door, opens it, and the stairs continue their ascent to a breathtaking view of the Paris rooftops and the sparkling city lights in the distance. Dyle and Scobie emerge together onto a flat section of the roof. On the side facing the street, the roof abruptly angles downward into a steep, slate-covered pitch, interrupted only by two widely spaced, oval-shaped dormer windows. \n\nDyle turns to look back, seeing nothing behind him but an intimidating sheer drop to the street below. Moving swiftly, he strikes out decisively, using the side of his palm to hit Scobie's gun hand, causing the firearm to fall onto the roof. Dyle follows through with a strong punch to the large man's jaw. However, rather than falling, Scobie wraps his arm firmly around Dyle, maintaining a tight grip until his head clears. To Dyle's utter astonishment, he finds himself lifted into the air, unable to break free from the bear-like hold, and is carried toward the perilous edge of the roof. Dyle manages to work his arms between their two bodies and suddenly flails them out with all the strength he can muster, breaking the hold at last. But this comes at a cost—his coat and the skin on his back are torn as Scobie's metal claw rips through both, leaving a painful wound extending from the center of Dyle's back all the way to his shoulder. \n\nBoth men then scan the area for the gun, spotting it at the same time and leaping toward it, though both fall short of reaching it. They engage in a fierce struggle, each desperately trying to break free from the other's grip and reach the elusive gun. Two hands, one genuine and the other metal, inch ever closer to the weapon as the battle appears to swing in favor of Scobie. His weight and strength begin to wear down Dyle, who finds himself on his back, struggling to prevent Scobie from crawling over him and gaining the upper hand."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Reggie is engaged in a lengthy phone conversation, and shortly thereafter, Dyle finds himself similarly occupied with a phone call. Observing her surroundings, she makes the decision to open the door of her small, enclosed cabin and steps cautiously out into the dimly lit corridor, her eyes curiously glancing into the interiors of the other cabins she passes by. It becomes apparent that every single cabin she passes is filled with occupants, save for one solitary cabin, which immediately captures her attention. As she peers inquisitively into this unoccupied space, she notices the telephone receiver, dangling mysteriously by its cord, gently swaying back and forth, back and forth. This strange and unexpected sight leaves her feeling a profound sense of puzzlement and uncertainty. Meanwhile, in another part of the building, Dyle and Scobie stand together, patiently waiting for the self-service elevator to arrive. It is noticeable that Scobie is clearly holding a gun, concealed discreetly within the spacious pocket of his raincoat. The elevator doors open smoothly and silently, and one or two passengers step out, allowing Dyle and Scobie to enter the elevator. They are soon followed by a young girl who enters with a sense of caution after them. Scobie, using his distinct metal hand, reaches out to press the top button, initiating their ascent as the elevator doors close slowly behind them.\n\nWhen the elevator reaches its destination, Scobie follows Dyle out, taking a brief moment to glance around, his eyes landing on an open door at the far end of the short, narrow hallway. He and Dyle proceed to walk toward this door, with the camera closely following their every movement. Passing through this door, which Scobie closes securely behind them, they find themselves at a flight of stairs leading upwards to another level. Dyle, feeling a bit weary, yawns widely as he pushes himself up and begins to climb the stairs, with Scobie staying close behind. When Dyle reaches the top, he stops in front of the door, opens it, and they both continue their ascent, greeted by a breathtaking panoramic view of the iconic Paris rooftops and the sparkling city lights in the far distance. Emerging together onto a flat section of the roof, they take in the surroundings. The side of the roof facing the bustling street below abruptly angles downward into a steep, slate-covered pitch, interrupted only by two widely spaced, oval-shaped dormer windows.\n\nDyle turns to cast a look back, seeing nothing behind him but an intimidating sheer drop that leads directly to the street below. Moving swiftly and decisively, he strikes out with great precision, using the side of his palm to deliver a sharp hit to Scobie's gun hand, causing the firearm to fall precariously onto the roof. Without hesitation, Dyle follows through with a strong, forceful punch aimed directly at the large man's jaw. Yet, rather than succumbing to the blow, Scobie retaliates by wrapping his arm firmly around Dyle, maintaining a tight, almost crushing grip until clarity returns to his mind. To Dyle's utter astonishment and disbelief, he suddenly finds himself being lifted into the air, unable to break free from the bear-like hold, and is carried menacingly toward the perilous edge of the roof. Frantically, Dyle manages to work his arms between their two bodies and, in a sudden burst of energy, flails them out with all the strength he can summon, breaking the hold at last. However, this act of desperation comes at a painful cost—his coat and the skin on his back are torn as Scobie's metal claw viciously rips through both, leaving a raw, painful wound that stretches from the center of Dyle's back all the way to his shoulder.\n\nIn that tense, adrenaline-charged moment, both men scan the area for the fallen gun, spotting it simultaneously and leaping toward it with all the agility they can muster, though frustratingly both fall short of reaching it. They become entangled in a fierce, desperate struggle, each man desperately trying to break free from the other's unyielding grip and reach the elusive, potentially life-saving gun. Two hands, one genuine and the other metal, inch ever closer to the weapon as the battle appears to swing in favor of Scobie. His superior weight and sheer physical strength begin to wear down Dyle, who finds himself helplessly on his back, struggling with all his might to prevent Scobie from crawling over him and gaining the upper hand in this life-or-death confrontation."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Reggie is engaged in a phone conversation, her attention focused on the call, followed closely by Dyle, who is also on the phone, presumably wrapped in his own dialogue. She disengages from her call and proceeds to approach the door of her cabin. She grips the handle, turns it slowly, and swings the door open, stepping out into the corridor. With curiosity, she methodically peers into each cabin she passes, noticing that all are occupied until she reaches one particular cabin where she catches sight of something unusual. She directs her gaze inward, noticing the receiver swinging back and forth, dangling by its cord with an almost hypnotic motion, leaving her feeling puzzled. In a different scene, Dyle and Scobie stand side by side, waiting patiently for the elevator. Scobie subtly conceals a gun within the pocket of his raincoat, maintaining a composed demeanor. As the elevator arrives, the doors slide open smoothly, allowing one or two passengers to exit. With purposeful steps, Dyle and Scobie enter the elevator, accompanied by a young girl who slips in just after them. Scobie, using his metal hand, reaches out deliberately to press the button for the top floor. The elevator doors close, sealing them inside. When the elevator arrives at their destination, Scobie trails behind Dyle as they exit. Scobie casts a cautious glance around, his attention drawn to an open door at the end of a short hallway. He and Dyle advance towards it, the camera capturing their movement. Once they pass through, Scobie closes the door behind them, revealing a staircase that ascends to a second floor. With a wide yawn, Dyle rises to his feet and begins to climb the stairs, Scobie following closely. As Dyle reaches the top, he pauses momentarily at a door, opens it, and continues to ascend the stairs which reveal a breathtaking vista of the Paris rooftops and the sparkling city lights extending into the distance. Dyle and Scobie emerge onto a flat section of the roof. Observing the street side, Dyle notices how the roof sharply angles down into a steep, slate-covered pitch, interrupted only by two distant oval-shaped dormer windows. Turning to survey his surroundings, Dyle sees nothing but a sheer drop to the street behind him. Acting swiftly, he pivots and strikes at Scobie's gun hand with the edge of his palm, causing the weapon to clatter to the roof. Dyle immediately follows up with a forceful punch to Scobie's jaw. Surprisingly, instead of collapsing, Scobie encircles Dyle in a tight embrace, clutching him with unyielding strength until his senses return. Astonished, Dyle finds himself hoisted off the ground, trapped in the bear-hold, and carried toward the precarious edge of the roof. In a desperate bid for freedom, Dyle wedges his arms between their bodies and with a sudden burst of energy, he flails them outward with all his might, breaking free from the hold. However, this escape is not without cost, as Scobie's metal claw tears through Dyle's coat and skin, leaving a painful wound from the center of his back to his shoulder. Both men immediately direct their attention to the fallen gun, spotting it at the same time, and they lunge toward it, landing just short of their target. In a frantic struggle, they grapple with each other, each vying for control and trying to reach the gun. Two hands, one flesh and one metal, inch ever closer to the weapon as the tide of battle shifts in Scobie's favor. His superior weight and strength begin to overpower Dyle, now pinned on his back, desperately attempting to thwart Scobie from crawling over him and seizing the gun."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Reggie exits her cabin, noticing all others are occupied except for one, where a receiver swings by its cord, leaving her puzzled. Meanwhile, Dyle and Scobie, the latter concealing a gun in his raincoat pocket, wait for the elevator. After a couple of passengers exit, they enter with a young girl. Scobie uses his metal hand to press the top button, and the doors close. Exiting the elevator, they spot an open door at a hall's end and approach it, revealing stairs to a second floor. Dyle yawns, rises, and ascends the stairs with Scobie. At the top, they emerge to a view of Paris rooftops and city lights. On the rooftop, Dyle surveys a sheer drop to the street and swiftly knocks the gun from Scobie's hand. Though Dyle punches him, Scobie recovers, lifts Dyle, and moves toward the edge. Dyle breaks free, sacrificing his coat and skin to Scobie's metal claw, leaving a wound. Both men search for the gun, leap, but miss it, engaging in a physical struggle. As Scobie's strength gains the upper hand, Dyle, now on his back, attempts to fend him off while they both reach for the gun."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Reggie is on the phone, a rotary model from the 1960s common in the area, followed by Dyle also being on the phone. She opens the door of the cabin and starts out, stepping out of her cabin and looking into the others. All the cabins, rustic retreats often rented by tourists in the Swiss Alps, are occupied except one, which she looks inside, noticing the receiver hanging by its cord, swinging back and forth, leaving her confused. Meanwhile, Dyle and Scobie stand together waiting for the elevator, with Scobie clearly holding a gun in the pocket of his raincoat, a typical trench coat style worn by detectives in noir films. The self-service elevator doors open, an invention made popular in mid-century urban architecture, one or two passengers come out, and Dyle and Scobie enter, followed by a young girl wearing a brightly patterned dress, who starts in after them. Scobie reaches out with his metal hand, a prosthetic from a war injury, and presses the top button, and the doors close. As Scobie follows Dyle out of the elevator, Scobie looks around and notices an open door at the end of a short hall. He and Dyle approach it, with the camera following, a classic suspense technique used in many Hitchcock films, and through the door, which Scobie closes behind them, is a flight of stairs leading up to a second floor. Dyle yawns wide, then gets to his feet, and starts up the stairs, followed by Scobie. Dyle stops at the door, opens it, and the stairs continue up to a spectacular view of the Paris rooftops and the city lights beyond, a scene famously romanticized by countless painters and poets. Dyle and Scobie come out onto a level portion of the roof. On the street side, the roof angles down abruptly into a steep, slate-covered pitch, a typical design to keep rain off the old buildings, broken only by two widely separated oval-shaped dormer windows. Dyle turns and looks, seeing nothing behind him but a sheer drop to the street, a dizzying height that rivals any highrise, and moving quickly, he lashes out and hacks Scobie's gun hand with the side of his palm, using a martial arts move he learned from a self-defense class, causing the gun to fall to the roof. Dyle follows through by punching the large man full in the jaw, but instead of falling, Scobie, trained in combat during his past military service, wraps his arm around Dyle, holding on tightly until his head clears. To Dyle's amazement, he is lifted into the air, unable to break the bear-hold, and is carried toward the edge of the roof. Dyle works his arms between their two bodies and suddenly flails them out with all his strength, breaking the hold, but at the cost of his coat and the flesh on his back as Scobie's metal claw rips through both, leaving a wound extending from the center of Dyle's back to his shoulder. Both men look around for the gun, spotting it simultaneously and leaping for it, both landing short of the mark. They grapple with one another, each trying to break free and reach for the gun. Two hands, one real and one metal, inch toward the gun as the battle goes in Scobie's favor, whose weight and strength begin to tire Dyle, now on his back, trying to stop Scobie from crawling over him."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "As Scobie follows Dyle out of the elevator Scobie looks around and notices an open door at the end of a short hall Both men look around for the gun spotting it simultaneously and leaping for it both landing short of the mark Reggie is on the phone followed by Dyle also being on the phone Dyle works his arms between their two bodies and suddenly flails them out with all his strength breaking the hold but at the cost of his coat and the flesh on his back as Scobie's metal claw rips through both leaving a wound extending from the center of Dyle's back to his shoulder He and Dyle approach it with the camera following and through the door which Scobie closes behind them is a flight of stairs leading up to a second floor She opens the door of the cabin and starts out stepping out of her cabin and looking into the others Dyle now on his back trying to stop Scobie from crawling over him All the cabins are occupied except one which she looks inside noticing the receiver hanging by its cord swinging back and forth leaving her confused Dyle and Scobie come out onto a level portion of the roof All the cabins are occupied except one which she looks inside noticing the receiver hanging by its cord swinging back and forth leaving her confused Meanwhile Dyle and Scobie stand together waiting for the elevator with Scobie clearly holding a gun in the pocket of his raincoat The selfservice elevator doors open one or two passengers come out and Dyle and Scobie enter followed by a young girl who starts in after them Scobie reaches out with his metal hand and presses the top button and the doors close As Scobie follows Dyle out of the elevator Scobie looks around and notices an open door at the end of a short hall He and Dyle approach it with the camera following and through the door which Scobie closes behind them is a flight of stairs leading up to a second floor Dyle yawns wide then gets to his feet and starts up the stairs followed by Scobie She opens the door of the cabin and starts out stepping out of her cabin and looking into the others Dyle stops at the door opens it and the stairs continue up to a spectacular view of the Paris rooftops and the city lights beyond Dyle and Scobie come out onto a level portion of the roof Dyle stops at the door opens it and the stairs continue up to a spectacular view of the Paris rooftops and the city lights beyond Reggie is on the phone followed by Dyle also being on the phone On the street side the roof angles down abruptly into a steep slatecovered pitch broken only by two widely separated ovalshaped dormer windows Dyle turns and looks seeing nothing behind him but a sheer drop to the street and moving quickly he lashes out and hacks Scobie's gun hand with the side of his palm causing the gun to fall to the roof Dyle follows through by punching the large man full in the jaw but instead of falling Scobie wraps his arm around Dyle holding on tightly until his head clears To Dyle's amazement he is lifted into the air unable to break the bearhold and is carried toward the edge of the roof Dyle works his arms between their two bodies and suddenly flails them out with all his strength breaking the hold but at the cost of his coat and the flesh on his back as Scobie's metal claw rips through both leaving a wound extending from the center of Dyle's back to his shoulder Meanwhile Dyle and Scobie stand together waiting for the elevator with Scobie clearly holding a gun in the pocket of his raincoat Both men look around for the gun spotting it simultaneously and leaping for it both landing short of the mark They grapple with one another each trying to break free and reach for the gun Two hands one real and one metal inch toward the gun as the battle goes in Scobie's favor whose weight and strength begin to tire Dyle now on his back trying to stop Scobie from crawling over him"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Reggie is on the phone followed by Dyle also being on the phone. She opens the door of the cabin and starts out stepping out of her cabin and looking into the others. All the cabins are occupied except one which she looks inside noticing the receiver hanging by its cord swinging back and forth leaving her confused. Meanwhile Dyle and Scobie stand together waiting for the elevator with Scobie clearly holding a gun in the pocket of his raincoat. The selfservice elevator doors open. one or two passengers come out and Dyle and Scobie enter followed by a young girl who starts in after them. Scobie reaches out with his metal hand and presses the top button and the doors close. As Scobie follows Dyle out of the elevator Scobie looks around and notices an open door at the end of a short hall. He and Dyle approach it with the camera following and through the door which Scobie closes behind them is a flight of stairs leading up to a second floor. Dyle yawns wide then gets to his feet and starts up the stairs followed by Scobie. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Dyle stops at the door opens it and the stairs continue up to a spectacular view of the Paris rooftops and the city lights beyond. Dyle and Scobie come out onto a level portion of the roof. On the street side the roof angles down abruptly into a steep slatecovered pitch broken only by two widely separated ovalshaped dormer windows. Dyle turns and looks seeing nothing behind him but a sheer drop to the street and moving quickly he lashes out and hacks Scobie's gun hand with the side of his palm causing the gun to fall to the roof. Dyle follows through by punching the large man full in the jaw but instead of falling Scobie wraps his arm around Dyle holding on tightly until his head clears. To Dyle's amazement he is lifted into the air unable to break the bearhold and is carried toward the edge of the roof. Dyle works his arms between their two bodies and suddenly flails them out with all his strength breaking the hold but at the cost of his coat and the flesh on his back as Scobie's metal claw rips through both leaving a wound extending from the center of Dyle's back to his shoulder. Both men look around for the gun spotting it simultaneously and leaping for it both landing short of the mark. They grapple with one another each trying to break free and reach for the gun. Two hands one real and one metal inch toward the gun as the battle goes in Scobie's favor whose weight and strength begin to tire. Dyle now on his back trying to stop Scobie from crawling over him."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Reggie is on the phone followed by Dyle also being on the phone. She opens the door of the cabin and starts out stepping out of her cabin and looking into the others. All the cabins are occupied except one which she looks inside noticing the receiver hanging by its cord swinging back and forth leaving her confused. Meanwhile Dyle and Scobie stand together waiting for the elevator with Scobie clearly holding a gun in the pocket of his raincoat. The selfservice elevator doors open. one or two passengers come out and Dyle and Scobie enter followed by a young girl who starts in after them. Scobie reaches out with his metal hand and presses the top button and the doors close. As Scobie follows Dyle out of the elevator Scobie looks around and notices an open door at the end of a short hall. He and Dyle approach it with the camera following and through the door which Scobie closes behind them is a flight of stairs leading up to a second floor. Dyle yawns wide then gets to his feet and starts up the stairs followed by Scobie. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Dyle stops at the door opens it and the stairs continue up to a spectacular view of the Paris rooftops and the city lights beyond. Dyle and Scobie come out onto a level portion of the roof. On the street side the roof angles down abruptly into a steep slatecovered pitch broken only by two widely separated ovalshaped dormer windows. Dyle turns and looks seeing nothing behind him but a sheer drop to the street and moving quickly he lashes out and hacks Scobie's gun hand with the side of his palm causing the gun to fall to the roof. Dyle follows through by punching the large man full in the jaw but instead of falling Scobie wraps his arm around Dyle holding on tightly until his head clears. To Dyle's amazement he is lifted into the air unable to break the bearhold and is carried toward the edge of the roof. Dyle works his arms between their two bodies and suddenly flails them out with all his strength breaking the hold but at the cost of his coat and the flesh on his back as Scobie's metal claw rips through both leaving a wound extending from the center of Dyle's back to his shoulder. Both men look around for the gun spotting it simultaneously and leaping for it both landing short of the mark. They grapple with one another each trying to break free and reach for the gun. Two hands one real and one metal inch toward the gun as the battle goes in Scobie's favor whose weight and strength begin to tire. Dyle now on his back trying to stop Scobie from crawling over him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Reggie is on the phone followed by Dyle also being on the phone. She opens the door of the cabin and starts out stepping out of her cabin and looking into the others. All the cabins are occupied except one which she looks inside noticing the receiver hanging by its cord swinging back and forth leaving her confused. Meanwhile Dyle and Scobie stand together waiting for the elevator with Scobie clearly holding a gun in the pocket of his raincoat. The selfservice elevator doors open. To Dyle's amazement he is lifted into the air unable to break the bearhold and is carried toward the edge of the roof. Dyle works his arms between their two bodies and suddenly flails them out with all his strength breaking the hold but at the cost of his coat and the flesh on his back as Scobie's metal claw rips through both leaving a wound extending from the center of Dyle's back to his shoulder. Both men look around for the gun spotting it simultaneously and leaping for it both landing short of the mark. They grapple with one another each trying to break free and reach for the gun. Two hands one real and one metal inch toward the gun as the battle goes in Scobie's favor whose weight and strength begin to tire. Dyle now on his back trying to stop Scobie from crawling over him."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Reggie is on the phone followed by Dyle also being on the phone. She opens the door of the cabin and starts out stepping out of her cabin and looking into the others. They grapple with one another each trying to break free and reach for the gun. Two hands one real and one metal inch toward the gun as the battle goes in Scobie's favor whose weight and strength begin to tire. Dyle now on his back trying to stop Scobie from crawling over him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat is on the phone, followed by a dog also being on the phone. A squirrel opens the door of the cabin and starts out, stepping out of her cabin and looking into the others. All the cabins are occupied except one, which a squirrel looks inside, noticing the receiver hanging by its cord, swinging back and forth, leaving a squirrel confused. Meanwhile, the rabbit and the elephant stand together waiting for the elevator, with the elephant clearly holding a gun in the pocket of his raincoat. The self-service elevator doors open, one or two passengers come out, and the rabbit and the elephant enter, followed by a young parrot who starts in after them. The elephant reaches out with his metal hand and presses the top button, and the doors close. As the elephant follows the rabbit out of the elevator, the elephant looks around and notices an open door at the end of a short hall. A lion and the rabbit approach it, with the camera following, and through the door, which a lion closes behind them, is a flight of stairs leading up to a second floor. The rabbit yawns wide, then gets to his feet, and starts up the stairs, followed by a lion. The rabbit stops at the door, opens it, and the stairs continue up to a spectacular view of the Paris rooftops and the city lights beyond. The rabbit and the lion come out onto a level portion of the roof. On the street side, the roof angles down abruptly into a steep, slate-covered pitch, broken only by two widely separated oval-shaped dormer windows. The rabbit turns and looks, seeing nothing behind him but a sheer drop to the street, and moving quickly, he lashes out and hacks the lion's gun hand with the side of his palm, causing the gun to fall to the roof. The rabbit follows through by punching the large man full in the jaw, but instead of falling, the lion wraps his arm around the rabbit, holding on tightly until his head clears. To the rabbit's amazement, he is lifted into the air, unable to break the bear-hold, and is carried toward the edge of the roof. The rabbit works his arms between their two bodies and suddenly flails them out with all his strength, breaking the hold, but at the cost of his coat and the flesh on his back as the lion's metal claw rips through both, leaving a wound extending from the center of the rabbit's back to his shoulder. Both men look around for the gun, spotting it simultaneously and leaping for it, both landing short of the mark. They grapple with one another, each trying to break free and reach for the gun. Two hands, one real and one metal, inch toward the gun as the battle goes in the lion's favor, whose weight and strength begin to tire the rabbit, now on his back, trying to stop the lion from crawling over him."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Reggie is on the phone, followed by Dyle also being on the phone. She opens the door of the greenhouse and starts out, stepping out of her greenhouse and looking into the others. All the greenhouses are occupied except one, which she looks inside, noticing the lantern hanging by its chain, swinging back and forth, leaving her confused. Meanwhile, Dyle and Scobie stand together waiting for the escalator, with Scobie clearly holding a hammer in the pocket of his trench coat. The self-service escalator gates open, one or two passengers come out, and Dyle and Scobie enter, followed by a young girl who starts in after them. Scobie reaches out with his metal elbow and presses the top button, and the gates close. As Scobie follows Dyle out of the escalator, Scobie looks around and notices an open window at the end of a short corridor. He and Dyle approach it, with the camera following, and through the window, which Scobie closes behind them, is a ladder leading up to a second floor. Dyle yawns wide, then gets to his feet, and starts up the ladder, followed by Scobie. Dyle stops at the window, opens it, and the ladder continues up to a spectacular view of the Parisian skyline and the city lights beyond. Dyle and Scobie come out onto a level portion of the rooftop garden. On the street side, the rooftop garden angles down abruptly into a steep, grass-covered slope, broken only by two widely separated rectangular dormer windows. Dyle turns and looks, seeing nothing behind him but a sheer drop to the street, and moving quickly, he lashes out and hacks Scobie's spade hand with the side of his palm, causing the hammer to fall to the garden. Dyle follows through by punching the large man full in the collar, but instead of falling, Scobie wraps his arm around Dyle, holding on tightly until his head clears. To Dyle's amazement, he is lifted into the air, unable to break the bear-hold, and is carried toward the edge of the garden. Dyle works his arms between their two bodies and suddenly flails them out with all his strength, breaking the hold, but at the cost of his vest and the skin on his back as Scobie's metal claw rips through both, leaving a wound extending from the center of Dyle's back to his shoulder. Both men look around for the hammer, spotting it simultaneously and leaping for it, both landing short of the mark. They grapple with one another, each trying to break free and reach for the hammer. Two hands, one real and one metal, inch toward the hammer as the battle goes in Scobie's favor, whose weight and strength begin to tire Dyle, now on his back, trying to stop Scobie from crawling over him."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Reggie is on the phone, succeeded by Dyle also being on the phone. She closes the door of the cabin and finishes up, jumping out of her cabin and peering into the others. All the cabins are occupied except one, which she examines inside, noticing the receiver resting by its cord, hanging still, leaving her uncertain. Meanwhile, Dyle and Scobie sit together waiting for the elevator, with Scobie clearly displaying a gun in the pocket of his raincoat. The self-service elevator doors close, one or two passengers go in, and Dyle and Scobie exit, followed by a young girl who finishes after them. Scobie reaches out with his metal hand and taps the top button, and the doors open. As Scobie follows Dyle into the elevator, Scobie glances around and notices a closed door at the end of a short hall. He and Dyle retreat from it, with the camera staying behind, and through the door, which Scobie opens in front of them, is a flight of stairs leading down to a second floor. Dyle yawns wide, then sits down, and descends the stairs, followed by Scobie. Dyle arrives at the door, shuts it, and the stairs end up at a spectacular view of the Paris rooftops and the city lights beyond. Dyle and Scobie disappear onto a level portion of the roof. On the street side, the roof rises up abruptly into a steep, slate-covered pitch, broken only by two closely placed oval-shaped dormer windows. Dyle turns and listens, hearing nothing behind him but a gentle breeze from the street, and moving slowly, he reaches out and taps Scobie's gun hand with the side of his palm, causing the gun to stay on the roof. Dyle follows through by waving at the large man gently in the jaw, but instead of moving away, Scobie wraps his arm around Dyle, holding on gently until his head calms. To Dyle's relief, he is set back on the ground, unable to shake the bear-hold, and is placed toward the center of the roof. Dyle wiggles his arms between their two bodies and suddenly stretches them out with all his strength, maintaining the hold, but at the boon of his coat and the fabric on his back as Scobie's metal claw scrapes through both, leaving a scratch extending from the center of Dyle's back to his shoulder. Both men glance around for the gun, spotting it simultaneously and leaping away from it, both landing next to the mark. They dance with one another, each trying to hold fast and shy away from the gun. Two hands, one real and one metal, linger away from the gun as the battle veers in Dyle's favor, whose weight and strength begin to invigorate Dyle, now on his back, trying to encourage Scobie from retreating over him."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Jasper is on the tractor, followed by Fiona also being on the tractor. He opens the hatch of the igloo and starts out, stepping out of his igloo and looking into the others. All the igloos are occupied except one, which he looks inside, noticing the guitar hanging by its strap, swinging back and forth, leaving him puzzled. Meanwhile, Fiona and Max stand together waiting for the carousel, with Max clearly holding a violin in the pocket of his overalls. The self-service carousel doors open, one or two snowmen come out, and Fiona and Max enter, followed by a young penguin who starts in after them. Max reaches out with his wooden foot and presses the rainbow button, and the doors close. As Max follows Fiona out of the carousel, Max looks around and notices an open portal at the end of a short alley. He and Fiona approach it, with the kitten following, and through the portal, which Max closes behind them, is a spiral of noodles leading up to a second galaxy. Fiona sneezes wide, then gets to his feet, and starts up the noodles, followed by Max. Fiona stops at the portal, opens it, and the noodles continue up to a spectacular view of the Beijing skylines and the ocean waves beyond. Fiona and Max come out onto a level portion of the meteor. On the desert side, the meteor angles down abruptly into a steep, marble-covered pitch, broken only by two widely separated triangular-shaped umbrella windows. Fiona turns and looks, seeing nothing behind him but a sheer drop to the desert, and moving swiftly, he lashes out and hacks Max's violin hand with the side of his leaf, causing the violin to fall to the meteor. Fiona follows through by punching the tiny squirrel full in the beak, but instead of falling, Max wraps his leg around Fiona, holding on tightly until his beak clears. To Fiona's amazement, he is lifted into the fog, unable to break the squirrel-hold, and is carried toward the tip of the meteor. Fiona works his legs between their two auras and suddenly flails them out with all his might, breaking the hold, but at the cost of his backpack and the fur on his chest as Max's wooden claw rips through both, leaving a mark extending from the center of Fiona's chest to his elbow. Both spiders look around for the violin, spotting it simultaneously and leaping for it, both landing short of the spot. They swivel with one another, each trying to break free and reach for the violin. Two elbows, one real and one wooden, inch toward the violin as the water swirls in Max's favor, whose laughter and shadow begin to tire Fiona, now on his shell, trying to stop Max from flying over him."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Olivia is on the laptop, followed by Mason also being on the laptop. He closes the window of the cabin and crawls out, tiptoeing out of his cabin and peering into the others. All the cabins are inhabited except one, which he peers inside, noticing the remote dangling by its wire, spinning in circles, leaving him perplexed. Meanwhile, Mason and Jordan sit together waiting for the train, with Jordan quietly carrying a book in the pocket of his coat. The automatic train doors open, one or two passengers hop out, and Mason and Jordan enter, followed by a young boy who sneaks in after them. Jordan extends his wooden arm and points to the top button, and the doors shut. As Jordan tails Mason out of the train, Jordan glances around and observes an open window at the end of a narrow hall. He and Mason head toward it, with the lens tracking them, and through the window, which Jordan shuts after them, is a path of steps leading up to an attic. Mason sneezes loudly, then stretches and clambers up the steps, with Jordan behind. Mason halts at the window, pulls it open, and the steps lead to a breathtaking view of the Paris skyline and the city lights beyond. Mason and Jordan emerge onto a flat section of the roof. On the street side, the roof slopes down sharply into a steep, slate-covered incline, interrupted only by two far-apart oval-shaped skylights. Mason turns and glances, seeing nothing below him but a sheer descent to the street, and moving swiftly, he lunges out and slaps Jordan's book hand with the side of his foot, causing the book to tumble to the roof. Mason continues by shoving the large man squarely in the shoulder, but instead of stumbling, Jordan grabs his arm around Mason, clutching tightly until his mind clears. To Mason's astonishment, he is hoisted into the air, unable to slip the bear-grip, and is carried toward the brink of the roof. Mason forces his arms between their two bodies and suddenly flings them wide with all his force, breaking the grip, but at the expense of his jacket and the skin on his back as Jordan's wooden claw tears through both, leaving a gash extending from the middle of Mason's back to his shoulder. Both men scan for the book, spotting it simultaneously and lunging for it, both falling short of the spot. They wrestle with one another, each striving to escape and reach for the book. Two hands, one real and one wooden, inch toward the book as the struggle turns in Jordan's favor, whose size and power begin to wear down Mason, now beneath him, fighting to prevent Jordan from sliding over him."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Reggie is on the keyboard, followed by Dyle also being on the keyboard. She unlocks the window of the hut and stretches out, climbing out of her hut and peering into the others. All the huts are filled except one, which she glances inside, noticing the lantern dangling by its chain, swaying side to side, leaving her perplexed. Meanwhile, Dyle and Scobie stand together waiting for the tram, with Scobie clearly juggling a sandwich in the pocket of his raincoat. The automated tram doors slide open, one or two animals trot out, and Dyle and Scobie enter, followed by a young girl who hops in after them. Scobie reaches out with his plastic hand and taps the bottom button, and the doors seal. As Scobie trails Dyle out of the tram, Scobie glances around and spots a closed window at the end of a narrow corridor. He and Dyle head toward it, with the camera trailing, and through the window, which Scobie opens behind them, is a ladder leading down to a basement level. Dyle sneezes quietly, then rises to his feet and descends the ladder, followed by Scobie. Dyle pauses at the window, swings it open, and the ladder continues down to an impressive view of the New York alleyways and the city lights beyond. Dyle and Scobie emerge onto a flat platform of the terrace. On the garden side, the terrace slopes down sharply into a gentle, tiled-covered incline, interrupted only by two closely placed round-shaped skylights. Dyle pivots and checks, seeing nothing behind him but a steep drop to the park, and moving swiftly, he swings out and taps Scobie's sandwich hand with the heel of his boot, causing the sandwich to tumble to the terrace. Dyle follows this by slapping the large man right on the nose, but instead of dropping, Scobie wraps his leg around Dyle, clutching tightly until his eyes focus. To Dyle's astonishment, he is hoisted into the air, unable to escape the leg-lock, and is carried toward the boundary of the terrace. Dyle works his legs between their two bodies and suddenly kicks them out with all his strength, breaking the hold, but at the cost of his jacket and the fabric on his back as Scobie's plastic claw tears through both, leaving a scratch extending from the center of Dyle's back to his neck. Both men gaze around for the sandwich, spotting it simultaneously and lunging for it, both landing short of the target. They scuffle with one another, each trying to break free and reach for the sandwich. Two legs, one real and one plastic, inch toward the sandwich as the skirmish swings in Scobie's favor, whose bulk and might begin to weary Dyle, now on his back, trying to prevent Scobie from crawling over him."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Blanca is holding a banana, followed by Perry also holding a banana. He climbs the wall of the igloo and steps in, tumbling into his igloo and peeking through the windows. All the igloos are full except one, which he peeks inside, observing the sandwich dangling by its wrapper, swinging back and forth, leaving him intrigued. Meanwhile, Perry and Casey dance together waiting for the ladder, with Casey distinctly juggling a pie in the pocket of his trench coat. The rotating ladder flaps open, one or two squirrels dash out, and Perry and Casey ride, trailed by a young boy who skips in after them. Casey extends his wooden leg and taps the middle rung, and the flaps shut. As Casey shadows Perry out of the ladder, Casey glances around and observes an open window at the end of a narrow corridor. He and Perry tiptoe to it, with the zebra following, and through the window, which Casey closes behind them, is a slide of ice leading down to a third floor. Perry twirls around, then jumps to his nose, and glides down the ice, trailed by Casey. Perry halts at the window, slams it, and the slide continues down to a gorgeous view of the Sahara desert and the oasis lights beyond. Perry and Casey emerge onto a bumpy section of the dune. On the river side, the dune angles up steeply into a smooth, banana-covered slope, punctuated only by three narrowly spaced triangular igloo windows. Perry spins and listens, hearing nothing beside him but a sheer ascent to the river, and moving leisurely, he jabs out and pats Casey's pie hand with the side of his snout, causing the pie to roll to the dune. Perry continues by tickling the massive penguin full in the beak, but instead of tumbling, Casey curls his tentacle around Perry, squeezing snugly until his bill clears. To Perry's surprise, he is spun through the air, unable to escape the octopus-grip, and is spun toward the peak of the dune. Perry weaves his feet between their two forms and abruptly twitches them out with all his might, breaking the grip, but at the cost of his toga and the wool on his chest as Casey's wooden hook slashes through both, leaving a pattern extending from the peak of Perry's chest to his fin. Both creatures scout around for the pie, spotting it at the same time and diving for it, both landing off the spot. They wrestle with each other, each attempting to duck away and grab the pie. Two fins, one actual and one wooden, creep toward the pie as the struggle goes in Casey's favor, whose momentum and grip begin to exhaust Perry, now on his chest, striving to deter Casey from rolling over him."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Reggie is on the phone, while Dyle and Scobie wait for an elevator, with Scobie concealing a gun in his raincoat pocket. Dyle and Scobie board the elevator with a young girl, and Scobie selects the top button with his metal hand. Reaching the rooftop of a building, they enjoy a view of Paris. Dyle suddenly attacks Scobie, striking his gun hand, and a fight ensues. Scobie, using his strength, lifts Dyle toward the edge of the roof but Dyle breaks free, injuring his back. Both men spot the gun and dive for it, falling short. They struggle, and Scobie's strength gives him the upper hand as they both inch toward the weapon, leaving Dyle on his back, trying to fend off Scobie's advance."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Dyle now on his back trying to stop Scobie from crawling over him Two hands one real and one metal inch toward the gun as the battle goes in Scobie's favor whose weight and strength begin to tire They grapple with one another each trying to break free and reach for the gun Both men look around for the gun spotting it simultaneously and leaping for it both landing short of the mark Dyle works his arms between their two bodies and suddenly flails them out with all his strength breaking the hold but at the cost of his coat and the flesh on his back as Scobie's metal claw rips through both leaving a wound extending from the center of Dyle's back to his shoulder To Dyle's amazement he is lifted into the air unable to break the bearhold and is carried toward the edge of the roof Dyle follows through by punching the large man full in the jaw but instead of falling Scobie wraps his arm around Dyle holding on tightly until his head clears Dyle turns and looks seeing nothing behind him but a sheer drop to the street and moving quickly he lashes out and hacks Scobie's gun hand with the side of his palm causing the gun to fall to the roof On the street side the roof angles down abruptly into a steep slatecovered pitch broken only by two widely separated ovalshaped dormer windows Dyle and Scobie come out onto a level portion of the roof Dyle stops at the door opens it and the stairs continue up to a spectacular view of the Paris rooftops and the city lights beyond Dyle yawns wide then gets to his feet and starts up the stairs followed by Scobie He and Dyle approach it with the camera following and through the door which Scobie closes behind them is a flight of stairs leading up to a second floor As Scobie follows Dyle out of the elevator Scobie looks around and notices an open door at the end of a short hall Scobie reaches out with his metal hand and presses the top button and the doors close one or two passengers come out and Dyle and Scobie enter followed by a young girl who starts in after them The selfservice elevator doors open Meanwhile Dyle and Scobie stand together waiting for the elevator with Scobie clearly holding a gun in the pocket of his raincoat All the cabins are occupied except one which she looks inside noticing the receiver hanging by its cord swinging back and forth leaving her confused She opens the door of the cabin and starts out stepping out of her cabin and looking into the others Reggie is on the phone followed by Dyle also being on the phone"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Two hands one real and one metal inch toward the gun as the battle goes in Scobie's favor whose weight and strength begin to tire one or two passengers come out and Dyle and Scobie enter followed by a young girl who starts in after them Dyle follows through by punching the large man full in the jaw but instead of falling Scobie wraps his arm around Dyle holding on tightly until his head clears The selfservice elevator doors open Dyle yawns wide then gets to his feet and starts up the stairs followed by Scobie Dyle turns and looks seeing nothing behind him but a sheer drop to the street and moving quickly he lashes out and hacks Scobie's gun hand with the side of his palm causing the gun to fall to the roof To Dyle's amazement he is lifted into the air unable to break the bearhold and is carried toward the edge of the roof They grapple with one another each trying to break free and reach for the gun Scobie reaches out with his metal hand and presses the top button and the doors close On the street side the roof angles down abruptly into a steep slatecovered pitch broken only by two widely separated ovalshaped dormer windows Both men look around for the gun spotting it simultaneously and leaping for it both landing short of the mark Dyle stops at the door opens it and the stairs continue up to a spectacular view of the Paris rooftops and the city lights beyond She opens the door of the cabin and starts out stepping out of her cabin and looking into the others Dyle and Scobie come out onto a level portion of the roof All the cabins are occupied except one which she looks inside noticing the receiver hanging by its cord swinging back and forth leaving her confused Dyle works his arms between their two bodies and suddenly flails them out with all his strength breaking the hold but at the cost of his coat and the flesh on his back as Scobie's metal claw rips through both leaving a wound extending from the center of Dyle's back to his shoulder As Scobie follows Dyle out of the elevator Scobie looks around and notices an open door at the end of a short hall He and Dyle approach it with the camera following and through the door which Scobie closes behind them is a flight of stairs leading up to a second floor Reggie is on the phone followed by Dyle also being on the phone Meanwhile Dyle and Scobie stand together waiting for the elevator with Scobie clearly holding a gun in the pocket of his raincoat Dyle now on his back trying to stop Scobie from crawling over him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Dyle and Scobie come out onto a level portion of the roof On the street side the roof angles down abruptly into a steep slatecovered pitch broken only by two widely separated ovalshaped dormer windows Dyle turns and looks seeing nothing behind him but a sheer drop to the street and moving quickly he lashes out and hacks Scobie's gun hand with the side of his palm causing the gun to fall to the roof Dyle follows through by punching the large man full in the jaw but instead of falling Scobie wraps his arm around Dyle holding on tightly until his head clears To Dyle's amazement he is lifted into the air unable to break the bearhold and is carried toward the edge of the roof Dyle works his arms between their two bodies and suddenly flails them out with all his strength breaking the hold but at the cost of his coat and the flesh on his back as Scobie's metal claw rips through both leaving a wound extending from the center of Dyle's back to his shoulder Both men look around for the gun spotting it simultaneously and leaping for it both landing short of the mark They grapple with one another each trying to break free and reach for the gun Two hands one real and one metal inch toward the gun as the battle goes in Scobie's favor whose weight and strength begin to tire Dyle now on his back trying to stop Scobie from crawling over him Reggie is on the phone followed by Dyle also being on the phone She opens the door of the cabin and starts out stepping out of her cabin and looking into the others All the cabins are occupied except one which she looks inside noticing the receiver hanging by its cord swinging back and forth leaving her confused Meanwhile Dyle and Scobie stand together waiting for the elevator with Scobie clearly holding a gun in the pocket of his raincoat The selfservice elevator doors open one or two passengers come out and Dyle and Scobie enter followed by a young girl who starts in after them Scobie reaches out with his metal hand and presses the top button and the doors close As Scobie follows Dyle out of the elevator Scobie looks around and notices an open door at the end of a short hall He and Dyle approach it with the camera following and through the door which Scobie closes behind them is a flight of stairs leading up to a second floor Dyle yawns wide then gets to his feet and starts up the stairs followed by Scobie Dyle stops at the door opens it and the stairs continue up to a spectacular view of the Paris rooftops and the city lights beyond"
        }
      ]
    }
  ]
}