{
  "ground_truth": "Holly stays under the awning as Mickey walks to the curb and looks angrily back at her. People pass by while Mickey walks back and forth from the curb to Holly, becoming angrier. A taxi pulls up, and Mickey and Holly walk to the rear door. Mickey holds the door open for Holly, who gets in and then slams the door. Mickey starts walking along the sidewalk as the taxi drives off, passing the hotel and several evening-lit store windows. Both a bus and a taxi drive down the street, blocking Mickey from view. In the reflection of a mirror over a dresser, Elliot and Lee can be seen dancing cheek to cheek; they dance into view. Elliot picks up a glass of champagne and hands it to Lee, who sips. Elliot sips from his glass and returns it to the dresser. They embrace tightly, continuing to dance. Elliot, Hannah, and the twins are sitting at the dining room table. Hannah shows her two adopted children how a small camera works while they observe, fascinated. Elliot looks listless and stares blankly at the table. One child takes the camera from Hannah and picks up another identical one. The adopted children leave with the twins. After they're gone, Hannah sips her coffee and looks at Elliot, then puts her cup down while still watching him. Hannah sighs, and Elliot angrily throws his napkin on the table, stands up, paces behind her, and sits back down beside her with a ketchup bottle in front of him. The camera moves in on Elliot's anguished face as he looks down. Hannah tenderly puts her hand on his shoulder, touches his hand, and Elliot embraces her. Elliot kisses Hannah and they embrace tightly while she touches his hair. A metal staircase next to a large white column appears on screen; Holly and Hannah's voices are heard as they walk up the stairs into view. A man carrying a shopping bag walks down the steps past them. Holly follows Hannah to a rack of blouses; Hannah takes a jacket off the rack, looks at it, and holds it to herself. Turning to Holly with surprise, she puts the jacket back on the rack, inhales, and stares at her sister, who watches with a frown. Hannah then looks at the rack of clothes on Holly's side and takes a blouse off to examine it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Holly remains beneath the shelter as Mickey strides to the edge and glances furiously back at her. Individuals pass by while Mickey strides back and forth from the edge to Holly, becoming more enraged. A cab arrives, and Mickey and Holly proceed to the rear entrance. Mickey holds the entrance open for Holly, who enters and then bangs the entrance. Mickey begins strolling along the pavement as the cab departs, passing the inn and several evening-illuminated shop windows. Both a coach and a cab travel down the road, obstructing Mickey from sight. In the reflection of a looking glass over a vanity, Elliot and Lee are seen dancing face to face; they dance into view. Elliot picks up a flute of bubbly and hands it to Lee, who drinks. Elliot drinks from his flute and replaces it on the vanity. They hug tightly, continuing to dance. Elliot, Hannah, and the twins are seated at the dining area table. Hannah shows her two adopted offspring how a compact camera functions while they watch, captivated. Elliot appears listless and gazes vacantly at the table. One child takes the camera from Hannah and picks up another identical one. The adopted offspring leave with the twins. After they're absent, Hannah drinks her coffee and gazes at Elliot, then sets her cup down while still observing him. Hannah sighs, and Elliot furiously tosses his serviette on the table, rises, strides behind her, and sits beside her again with a ketchup container in front of him. The camera focuses on Elliot's distressed visage as he gazes downward. Hannah tenderly places her hand on his shoulder, touches his hand, and Elliot hugs her. Elliot kisses Hannah and they hug tightly while she touches his hair. A metallic staircase next to a large white pillar appears on screen; Holly and Hannah's voices are heard as they ascend the stairs into view. A gentleman carrying a shopping sack descends the steps past them. Holly follows Hannah to a rack of shirts; Hannah takes a coat off the rack, gazes at it, and holds it to herself. Turning to Holly with astonishment, she places the coat back on the rack, inhales, and gazes at her sibling, who watches with a frown. Hannah then gazes at the rack of garments on Holly's side and takes a shirt off to inspect it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Under the awning, Holly is stayed by Mickey as he walks to the curb and angrily looks back at her. While people are passed by, Mickey is walked back and forth from the curb to Holly, becoming angrier. A taxi is pulled up, and the rear door is walked to by Mickey and Holly. The door is held open by Mickey for Holly, who gets in and then slams it. The sidewalk is started to be walked along by Mickey as the taxi drives off, passing the hotel and several evening-lit store windows. The street is driven down by both a bus and a taxi, blocking him from view. In the reflection of a mirror over a dresser, Elliot and Lee are seen dancing cheek to cheek; they are danced into view. A glass of champagne is picked up by Elliot and handed to Lee, who sips. His glass is sipped from by Elliot and returned to the dresser. They are embraced tightly, continuing to dance. The dining room table is sat at by Elliot, Hannah, and the twins. Hannah shows her two adopted children how a small camera works while they are observed, fascinated. The table is stared at blankly by Elliot, who looks listless. The camera is taken from Hannah by one child and another identical one is picked up. The twins leave with the adopted children. After they're gone, her coffee is sipped by Hannah, who then looks at Elliot, puts her cup down while still watching him. A sigh is let out by Hannah, and angrily, Elliot throws his napkin on the table, stands up, paces behind her, and sits back down beside her with a ketchup bottle in front of him. On Elliot's anguished face, the camera moves in as he looks down. Her hand is tenderly put on his shoulder by Hannah, touching his hand, and he embraces her. Hannah is kissed by Elliot, and they are embraced tightly while her hair is touched by her. A metal staircase next to a large white column is appeared on screen; Holly and Hannah's voices are heard as the stairs are walked up into view by them. The steps are walked down past them by a man carrying a shopping bag. Hannah is followed by Holly to a rack of blouses; a jacket is taken off the rack by Hannah, looked at, and held to herself. Turning to Holly with surprise, the jacket is put back on the rack by her, she inhales, and her sister is stared at by her, who watches with a frown. The rack of clothes on Holly's side is then looked at by Hannah, and a blouse is taken off to examine it by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Holly stands under the awning as Mickey angrily paces between her and the curb. A taxi arrives, and Mickey holds the door for Holly, who enters and slams it. As the taxi departs, Mickey walks past evening-lit store windows. Buses and taxis obscure him from view. In a mirror reflection, Elliot and Lee dance closely; Elliot hands Lee champagne, they sip, embrace, and continue dancing. Later, Elliot, Hannah, and the twins sit at the dining table. Hannah shows her adopted children how a camera works while Elliot appears listless. One child takes a camera, and the children leave. Hannah watches Elliot, sips coffee, and sighs. Elliot angrily throws his napkin, stands up, paces, and sits back with a ketchup bottle. The camera focuses on Elliot's anguished face as Hannah comforts him. They embrace, and he kisses her. Holly and Hannah ascend a metal staircase; a man with a shopping bag passes them. At a rack, Hannah examines a jacket, surprises herself, then turns to Holly with a stare. She looks at Holly's side and inspects a blouse."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Holly stays under the awning while Mickey angrily paces to the curb. A taxi arrives, and Mickey holds the door for Holly, who gets in and slams it. Mickey walks away as the taxi departs. A mirror reflects Elliot and Lee dancing cheek to cheek; they sip champagne, embrace, and continue dancing. At the dining table, Hannah shows the twins a camera, while Elliot looks listless. One child takes a camera from Hannah and leaves with the twins. Hannah sips coffee, looks at Elliot, who angrily discards his napkin, then sits down. She places her hand on his shoulder, and they embrace. Holly and Hannah ascend a staircase, then browse a rack of clothes. Hannah, surprised, takes a jacket, then examines a blouse while Holly watches."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Holly remains sheltered beneath the cover of the awning while Mickey strides purposefully toward the curb, casting a frustrated and angry glance back at her. As the busy city life continues around them, with people bustling by on the street, Mickey paces back and forth from the curb to where Holly is standing, his irritation visibly increasing with each step. Eventually, a taxi arrives and pulls up to the curb, prompting both Mickey and Holly to approach the rear door of the vehicle. Mickey courteously holds the door open, allowing Holly to climb inside before she forcefully slams the door shut behind her. As the taxi begins to drive away, merging into the evening traffic, Mickey starts his walk along the bustling sidewalk, passing by the hotel's illuminated presence and several brightly lit store windows that line the street. Meanwhile, both a bus and another taxi travel down the busy thoroughfare, momentarily obscuring Mickey's figure from sight.\n\nIn another scene, captured within the reflective surface of a mirror positioned above a dresser, the figures of Elliot and Lee are seen moving gracefully as they dance closely, their cheeks touching in an intimate embrace. They continue to sway into clearer view. Elliot then takes hold of a glass of champagne, offering it to Lee, who gracefully sips from it. Following suit, Elliot takes a sip from his own glass before returning it to its place on the dresser. The couple then embraces each other tightly, maintaining their rhythm and connection as they continue to dance.\n\nThe scene shifts to reveal Elliot, Hannah, and the twins sitting together at the dining room table. Hannah is engaged in showing her two adopted children how a small camera operates, while the children watch with eagerness and fascination. Elliot, however, appears disengaged, staring blankly at the table with a listless expression. One of the children takes the camera from Hannah's hands and picks up another identical one. The adopted children, along with the twins, soon leave the table, departing to another room. After they have left, Hannah takes a moment to sip her coffee, gazing thoughtfully at Elliot. She places her cup back down, keeping her eyes on him. With a sigh that conveys her concern, Hannah watches as Elliot, in a moment of frustration, angrily throws his napkin onto the table, stands up, and paces restlessly behind her. He eventually returns to his seat beside her with a ketchup bottle prominently placed in front of him. The camera gradually focuses on Elliot's face, capturing the anguish etched into his expression as he looks downward. Hannah responds with tenderness, gently placing her hand on his shoulder and touching his hand. Elliot then embraces her, and in a moment of shared solace, he kisses Hannah as she tenderly touches his hair, drawing the embrace even tighter.\n\nThe scene transitions to a visual of a metal staircase, situated next to a large white column. Off-screen, the voices of Holly and Hannah are heard as they ascend the stairs, coming gradually into view. On the way down the steps, a man burdened with a shopping bag passes them. Holly follows Hannah as they make their way to a rack filled with blouses. Hannah selects a jacket from the rack, scrutinizes it closely, and holds it up against herself as if evaluating its fit. Turning to Holly with a look of surprise, she decides to place the jacket back on the rack, taking a deep breath as she stares at her sister with an expression of contemplation, while Holly watches her with a frown. Hannah then turns her attention to the rack of clothing on Holly's side, and she proceeds to take a blouse off the rack to examine it more closely."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Holly remains well-protected and sheltered beneath the cover of the awning while Mickey strides with purposeful determination toward the curb, casting a glance full of frustration and anger back at her. As the vibrant, busy city life continues unabated around them, with people bustling by on the street, Mickey repeatedly paces back and forth from the edge of the curb to the spot where Holly is standing, his irritation visibly increasing and becoming more pronounced with each and every step he takes. Eventually, a taxi arrives and pulls up to the curb, prompting both Mickey and Holly to approach the rear door of the vehicle. With courteous politeness, Mickey holds the door open, allowing Holly to climb inside before she forcefully slams the door shut behind her. As the taxi begins to drive away, merging seamlessly into the evening traffic, Mickey starts his walk along the bustling and busy sidewalk, passing by the hotel’s illuminated presence and several brightly lit store windows that line the street. Meanwhile, both a bus and another taxi travel swiftly down the busy thoroughfare, momentarily obscuring Mickey’s figure from sight.\n\nIn another scene, beautifully captured within the reflective surface of a mirror strategically positioned above a dresser, the figures of Elliot and Lee are seen moving gracefully as they dance closely, their cheeks delicately touching in an intimate embrace. They continue to sway gently into clearer view. Elliot then gracefully takes hold of a glass of champagne, offering it considerately to Lee, who sips from it with elegance. Following suit, Elliot takes a sip from his own glass before returning it to its place on the dresser. The couple then embraces each other tightly, maintaining their rhythm and connection as they continue to dance seamlessly together.\n\nThe scene shifts to reveal Elliot, Hannah, and the twins sitting together at the dining room table. Hannah is deeply engaged in showing her two adopted children how a small camera operates, while the children watch with eagerness and fascination in their eyes. Elliot, however, appears disengaged, staring blankly at the table with a listless expression that suggests his mind is elsewhere. One of the children, interested and curious, takes the camera from Hannah’s hands and then picks up another identical one. The adopted children, along with the twins, soon decide to leave the table, departing into another room. After they have left, Hannah takes a moment to sip her coffee, gazing thoughtfully at Elliot. She gently places her cup back down on the table, keeping her eyes focused on him. With a sigh that conveys her deep concern, Hannah watches as Elliot, in a moment of frustration, angrily throws his napkin onto the table, stands up, and begins to pace restlessly behind her. He eventually returns to his seat beside her with a ketchup bottle prominently placed in front of him. The camera gradually focuses on Elliot's face, capturing the anguish intricately etched into his expression as he looks downward. Hannah responds with tenderness, gently placing her hand on his shoulder and softly touching his hand. Elliot then embraces her, and in a moment of shared solace and comfort, he kisses Hannah as she tenderly touches his hair, drawing the embrace even tighter.\n\nThe scene transitions smoothly to a visual of a metal staircase, situated next to a large white column. Off-screen, the voices of Holly and Hannah are heard as they ascend the stairs, coming gradually and steadily into view. On the way down the steps, a man burdened with a shopping bag passes them. Holly follows behind Hannah as they make their way to a rack filled with various blouses. Hannah selects a jacket from the rack, scrutinizes it closely, and holds it up against herself as if evaluating its fit. Turning to Holly with a look of surprise on her face, she decides to place the jacket back on the rack, taking a deep breath as she stares at her sister with an expression of contemplation, while Holly watches her with a frown. Hannah then turns her attention to the rack of clothing on Holly’s side, and she proceeds to take a blouse off the rack to examine it more closely."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Holly stands under the awning, sheltered from the elements, while Mickey strides purposefully to the curb, his demeanor marked by frustration as he glances back at her with a look of anger. As the hustle and bustle of pedestrians continue around them, Mickey paces between the curb and Holly, his agitation visibly increasing with each step. Amidst this tense interaction, a taxi pulls up to the curb, prompting Mickey and Holly to approach the rear door together. Mickey, demonstrating a moment of courtesy despite his anger, holds the door open for Holly, who gets into the cab with a determined motion and then forcefully slams the door shut. As the taxi begins to move away, Mickey starts to walk along the sidewalk, his feet covering ground with a steady rhythm as he passes by the hotel and several inviting store windows, their displays warmly illuminated by the evening lights. Meanwhile, both a bus and another taxi traverse the street, momentarily obscuring Mickey from view. In an indoor setting, the reflection in a mirror over a dresser captures the image of Elliot and Lee dancing closely together, cheek to cheek, and they dance further into sight. Elliot, maintaining the celebratory air, picks up a glass of champagne and offers it to Lee, who takes a delicate sip. Elliot follows suit by sipping from his own glass before placing it back upon the dresser. They envelop one another in a tight embrace, allowing the dance to continue as they hold each other close. In a different part of the house, Elliot, Hannah, and their twins are seated around the dining room table. Hannah, assuming the role of educator, attentively demonstrates the workings of a small camera to her two enthralled adopted children, who watch with rapt interest. As this scene unfolds, Elliot appears disconnected, his gaze listlessly fixed on the table in front of him. One of the children, eager to experiment, takes the camera from Hannah's hands and reaches for another identical one, eager to delve into its mysteries. The twins and the adopted children exit the scene together, leaving Elliot and Hannah alone at the table. With a moment to herself, Hannah takes an introspective sip of her coffee, her eyes lingering on Elliot. Despite her calm demeanor, she emits a sigh that seems to resonate with Elliot's growing frustration, prompting him to throw his napkin down in a sudden display of anger. He then rises from his chair, paces behind her with restlessness, and ultimately returns to his seat beside her, setting a ketchup bottle in front of himself with a sense of resignation. As the camera zooms in, it captures the depths of Elliot's distress etched into his features as he looks downward. In an attempt to bridge the emotional distance, Hannah reaches out with tenderness, placing her hand on his shoulder and gently touching his hand. This gesture prompts Elliot to embrace Hannah, and in a moment of vulnerability, he kisses her as they hold each other tightly, with Hannah tenderly running her fingers through his hair. The scene transitions to a new setting where a metal staircase, adjacent to a large white column, becomes the focal point; the sound of Holly and Hannah's voices echo as they ascend the stairs and come into view. As they make their way upwards, a man carrying a shopping bag descends past them, navigating the steps with ease. Holly trails behind Hannah, who leads the way to a rack of blouses. With an air of curiosity, Hannah retrieves a jacket from the rack, holds it up to herself for appraisal, and turns to Holly with a momentary expression of surprise. Opting to return the jacket to its place, she pauses to take a deep breath, her gaze fixing on her sister, who observes the interaction with a frown. Determined to find something suitable, Hannah shifts her attention to the rack of clothes on Holly's side, selecting a blouse to scrutinize its details."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Holly waits under the awning as Mickey paces angrily at the curb, glancing back at her amid passing pedestrians. A taxi arrives, and Mickey and Holly head to the rear door. Mickey opens it for Holly, who enters and slams it shut. As the taxi departs, Mickey walks along the sidewalk past the hotel and lit store windows, briefly obscured by passing traffic. In a mirrored reflection, Elliot and Lee are seen dancing closely; Elliot hands Lee a glass of champagne, they both sip, and then embrace while continuing to dance. Elsewhere, Elliot, Hannah, and the twins sit at the dining table. Hannah demonstrates a small camera to her captivated adopted children, while Elliot appears distracted. One of the children takes the camera and then another, leaving with the twins afterward. Once alone, Hannah sips her coffee, observes Elliot, sighs, and Elliot angrily discards his napkin, pacing before sitting back beside her. The camera focuses on Elliot's distressed face, prompting Hannah to comfort him with a gentle touch. They embrace and kiss tenderly. Holly and Hannah’s voices emerge as they ascend a staircase into view. Passing a man with a shopping bag, Holly follows Hannah to a rack of blouses. Hannah examines a jacket with surprise, replaces it, and shares a moment with Holly, who watches with a frown before Hannah turns to inspect a blouse on Holly’s side."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Holly stays under the awning of the historic downtown café as Mickey walks to the curb and looks angrily back at her. People pass by, likely heading to the nearby bustling market, while Mickey walks back and forth from the curb to Holly, becoming angrier. A taxi, part of the city's reliable fleet that has been in service for decades, pulls up, and Mickey and Holly walk to the rear door. Mickey, known for his gentlemanly manners, holds the door open for Holly, who gets in and then slams the door with an echo of frustration. Mickey starts walking along the sidewalk as the taxi drives off, passing the iconic hotel renowned for its vintage architecture and several evening-lit store windows displaying the latest in fashion. Both a bus and a taxi drive down the street, typical of the city's busy night scene, blocking Mickey from view. In the reflection of a mirror over a dresser in a warmly-lit room, Elliot and Lee can be seen dancing cheek to cheek; they dance into view with elegant rhythm. Elliot picks up a glass of champagne, a vintage Dom Pérignon reserved for celebrations, and hands it to Lee, who sips with delight. Elliot sips from his glass and returns it to the dresser, polished to a shine. They embrace tightly, continuing to dance to the soft music playing in the background. Elliot, Hannah, and the twins are sitting at the dining room table, gracefully set for a family gathering. Hannah shows her two adopted children how a small camera works, a gift she brought them from her recent art exhibition, while they observe, fascinated. Elliot looks listless, weighed down by recent challenges at work, and stares blankly at the table. One child takes the camera from Hannah and picks up another identical one, a family tradition to have matching items. The adopted children leave with the twins, heading to their favorite playroom upstairs. After they're gone, Hannah sips her coffee, a rich blend she brews every morning, and looks at Elliot, then puts her cup down while still watching him. Hannah sighs, deeply worried about his recent withdrawal, and Elliot angrily throws his napkin on the table, stands up, paces behind her, and sits back down beside her with a ketchup bottle, a staple at their meals, in front of him. The camera moves in on Elliot's anguished face as he looks down, contemplating his feelings. Hannah tenderly puts her hand on his shoulder, touches his hand, and Elliot embraces her, feeling a moment of solace. Elliot kisses Hannah and they embrace tightly while she touches his hair, a gesture of reassurance. A metal staircase next to a large white column, part of the department store's striking design, appears on screen; Holly and Hannah's voices are heard as they walk up the stairs into view. A man carrying a shopping bag, likely filled with his latest purchases from the store's renowned sale, walks down the steps past them. Holly follows Hannah to a rack of blouses, an eclectic mix of designers, where Hannah takes a jacket off the rack, looks at it, and holds it to herself thoughtfully. Turning to Holly with surprise, she puts the jacket back on the rack, inhales to calm her racing thoughts, and stares at her sister, who watches with a frown of concern. Hannah then looks at the rack of clothes on Holly's side and takes a blouse off to examine it, evaluating it with her keen fashion sense."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Holly stays under the awning as Mickey walks to the curb and looks angrily back at her. People pass by while Mickey walks back and forth from the curb to Holly becoming angrier. A taxi pulls up and Mickey and Holly walk to the rear door. Mickey holds the door open for Holly who gets in and then slams the door. Mickey starts walking along the sidewalk as the taxi drives off passing the hotel and several eveninglit store windows. Both a bus and a taxi drive down the street blocking Mickey from view. In the reflection of a mirror over a dresser Elliot and Lee can be seen dancing cheek to cheek. they dance into view. Elliot picks up a glass of champagne and hands it to Lee who sips. Elliot sips from his glass and returns it to the dresser. They embrace tightly continuing to dance. Elliot Hannah and the twins are sitting at the dining room table. Hannah shows her two adopted children how a small camera works while they observe fascinated. Elliot looks listless and stares blankly at the table. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. One child takes the camera from Hannah and picks up another identical one. The adopted children leave with the twins. After they are gone Hannah sips her coffee and looks at. Elliot then puts her cup down while still watching him. Hannah sighs and Elliot angrily throws his napkin on the table stands up paces behind her and sits back down beside her with a ketchup bottle in front of him. The camera moves in on Elliot's anguished face as he looks down. Hannah tenderly puts her hand on his shoulder touches his hand and Elliot embraces her. Elliot kisses Hannah and they embrace tightly while she touches his hair. A metal staircase next to a large white column appears on screen. Holly and Hannah's voices are heard as they walk up the stairs into view. A man carrying a shopping bag walks down the steps past them. Holly follows Hannah to a rack of blouses. Hannah takes a jacket off the rack looks at it and holds it to herself. Turning to Holly with surprise she puts the jacket back on the rack inhales and stares at her sister who watches with a frown. Hannah then looks at the rack of clothes on Holly's side and takes a blouse off to examine it."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Holly stays under the awning as Mickey walks to the curb and looks angrily back at her. People pass by while Mickey walks back and forth from the curb to Holly becoming angrier. A taxi pulls up and Mickey and Holly walk to the rear door. Mickey holds the door open for Holly who gets in and then slams the door. Mickey starts walking along the sidewalk as the taxi drives off passing the hotel and several eveninglit store windows. Both a bus and a taxi drive down the street blocking Mickey from view. In the reflection of a mirror over a dresser Elliot and Lee can be seen dancing cheek to cheek. they dance into view. Elliot picks up a glass of champagne and hands it to Lee who sips. Elliot sips from his glass and returns it to the dresser. They embrace tightly continuing to dance. Elliot Hannah and the twins are sitting at the dining room table. Hannah shows her two adopted children how a small camera works while they observe fascinated. Elliot looks listless and stares blankly at the table. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. One child takes the camera from Hannah and picks up another identical one. The adopted children leave with the twins. After they are gone Hannah sips her coffee and looks at. Elliot then puts her cup down while still watching him. Hannah sighs and Elliot angrily throws his napkin on the table stands up paces behind her and sits back down beside her with a ketchup bottle in front of him. The camera moves in on Elliot's anguished face as he looks down. Hannah tenderly puts her hand on his shoulder touches his hand and Elliot embraces her. Elliot kisses Hannah and they embrace tightly while she touches his hair. A metal staircase next to a large white column appears on screen. Holly and Hannah's voices are heard as they walk up the stairs into view. A man carrying a shopping bag walks down the steps past them. Holly follows Hannah to a rack of blouses. Hannah takes a jacket off the rack looks at it and holds it to herself. Turning to Holly with surprise she puts the jacket back on the rack inhales and stares at her sister who watches with a frown. Hannah then looks at the rack of clothes on Holly's side and takes a blouse off to examine it."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Holly stays under the awning as Mickey walks to the curb and looks angrily back at her. People pass by while Mickey walks back and forth from the curb to Holly becoming angrier. A taxi pulls up and Mickey and Holly walk to the rear door. Mickey holds the door open for Holly who gets in and then slams the door. Mickey starts walking along the sidewalk as the taxi drives off passing the hotel and several eveninglit store windows. Both a bus and a taxi drive down the street blocking Mickey from view. In the reflection of a mirror over a dresser Elliot and Lee can be seen dancing cheek to cheek. Elliot kisses Hannah and they embrace tightly while she touches his hair. A metal staircase next to a large white column appears on screen. Holly and Hannah's voices are heard as they walk up the stairs into view. A man carrying a shopping bag walks down the steps past them. Holly follows Hannah to a rack of blouses. Hannah takes a jacket off the rack looks at it and holds it to herself. Turning to Holly with surprise she puts the jacket back on the rack inhales and stares at her sister who watches with a frown. Hannah then looks at the rack of clothes on Holly's side and takes a blouse off to examine it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Holly stays under the awning as Mickey walks to the curb and looks angrily back at her. People pass by while Mickey walks back and forth from the curb to Holly becoming angrier. A taxi pulls up and Mickey and Holly walk to the rear door. Hannah takes a jacket off the rack looks at it and holds it to herself. Turning to Holly with surprise she puts the jacket back on the rack inhales and stares at her sister who watches with a frown. Hannah then looks at the rack of clothes on Holly's side and takes a blouse off to examine it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Lenny lurks beneath the archway as Jessie marches to the flower bed and glares joyfully back at him. Felines slink by while Jessie marches to and fro from the flower bed to Lenny, growing more joyful. A limousine rolls in, and Jessie and Lenny trot to the front gate. Jessie swings the gate open for Lenny, who hops in and then smashes the gate. Jessie begins hopping beside the lane as the limousine zooms away, weaving past the library and numerous brightly-lit billboards. Both a scooter and a limousine roll down the avenue, obstructing Jessie from sight. In the reflection of a pond above a piano, Olivia and Max are spotted leaping hop-skip-jump; they leap into focus. Olivia hoists a basket of bread and passes it to Max, who nibbles. Olivia nibbles from her basket and places it back on the piano. They twirl loosely, keeping their leap. Olivia, Sam, and the parrots are resting at the kitchen bench. Sam reveals her two borrowed penguins how an enormous telescope operates while they peer, intrigued. Olivia appears lively and gazes brightly at the bench. One penguin seizes the telescope from Sam and snatches another similar one. The borrowed penguins exit with the parrots. Once they've departed, Sam gulps her lemonade and gazes at Olivia, then sets her glass down while still observing her. Sam chuckles, and Olivia cheerfully tosses her spoon on the bench, leaps up, circles in front of her, and plops back down next to her with a mustard jar beside her. The telescope zooms in on Olivia’s delighted expression as she gazes up. Sam affectionately places her hat on his elbow, nudges his foot, and Olivia tickles her. Olivia nudges Sam and they tickle gently while she nudges her chin. A wooden bridge beside a tiny purple gate materializes on screen; Lenny and Sam’s footsteps echo as they skip down the bridge into focus. A woman clutching a basket of apples skips up the bridge beside them. Lenny trails Sam to a stack of caps; Sam snatches a scarf off the stack, inspects it, and presses it to himself. Pivoting to Lenny with delight, he drapes the scarf back on the stack, sighs, and peers at his brother, who peers back with a chuckle. Sam then peers at the stack of gadgets on Lenny’s side and snatches a scarf off to scrutinize it."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Holly stays under the awning as Mickey angrily paces between her and the curb. A taxi arrives, and after Holly gets in and slams the door, Mickey walks away as it drives off. The scene shifts to Elliot and Lee dancing cheek to cheek, sipping champagne, and embracing. Later, Elliot, Hannah, and their adopted children sit at a dining table. Hannah shows the kids a camera, while Elliot looks despondent. The children leave, and Elliot angrily paces before sitting back down beside Hannah, who comforts him. They embrace tenderly. The focus then shifts to Holly and Hannah, who are shopping. Hannah tries on a jacket, surprises herself, and carefully examines a blouse as Holly watches."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Hannah then looks at the rack of clothes on Holly's side and takes a blouse off to examine it Turning to Holly with surprise she puts the jacket back on the rack inhales and stares at her sister who watches with a frown Hannah takes a jacket off the rack looks at it and holds it to herself Holly follows Hannah to a rack of blouses A man carrying a shopping bag walks down the steps past them Holly and Hannah's voices are heard as they walk up the stairs into view A metal staircase next to a large white column appears on screen Elliot kisses Hannah and they embrace tightly while she touches his hair Hannah tenderly puts her hand on his shoulder touches his hand and Elliot embraces her The camera moves in on Elliot's anguished face as he looks down Hannah sighs and Elliot angrily throws his napkin on the table stands up paces behind her and sits back down beside her with a ketchup bottle in front of him Elliot then puts her cup down while still watching him After they are gone Hannah sips her coffee and looks at The adopted children leave with the twins One child takes the camera from Hannah and picks up another identical one Elliot looks listless and stares blankly at the table Hannah shows her two adopted children how a small camera works while they observe fascinated Elliot Hannah and the twins are sitting at the dining room table They embrace tightly continuing to dance Elliot sips from his glass and returns it to the dresser Elliot picks up a glass of champagne and hands it to Lee who sips they dance into view In the reflection of a mirror over a dresser Elliot and Lee can be seen dancing cheek to cheek Both a bus and a taxi drive down the street blocking Mickey from view Mickey starts walking along the sidewalk as the taxi drives off passing the hotel and several eveninglit store windows Mickey holds the door open for Holly who gets in and then slams the door A taxi pulls up and Mickey and Holly walk to the rear door People pass by while Mickey walks back and forth from the curb to Holly becoming angrier Holly stays under the awning as Mickey walks to the curb and looks angrily back at her"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "People pass by while Mickey walks back and forth from the curb to Holly becoming angrier Holly stays under the awning as Mickey walks to the curb and looks angrily back at her Mickey holds the door open for Holly who gets in and then slams the door A taxi pulls up and Mickey and Holly walk to the rear door Both a bus and a taxi drive down the street blocking Mickey from view Mickey starts walking along the sidewalk as the taxi drives off passing the hotel and several eveninglit store windows they dance into view In the reflection of a mirror over a dresser Elliot and Lee can be seen dancing cheek to cheek Elliot sips from his glass and returns it to the dresser Elliot picks up a glass of champagne and hands it to Lee who sips Elliot Hannah and the twins are sitting at the dining room table They embrace tightly continuing to dance Elliot looks listless and stares blankly at the table Hannah shows her two adopted children how a small camera works while they observe fascinated The adopted children leave with the twins One child takes the camera from Hannah and picks up another identical one Elliot then puts her cup down while still watching him After they are gone Hannah sips her coffee and looks at The camera moves in on Elliot's anguished face as he looks down Hannah sighs and Elliot angrily throws his napkin on the table stands up paces behind her and sits back down beside her with a ketchup bottle in front of him Elliot kisses Hannah and they embrace tightly while she touches his hair Hannah tenderly puts her hand on his shoulder touches his hand and Elliot embraces her Holly and Hannah's voices are heard as they walk up the stairs into view A metal staircase next to a large white column appears on screen Holly follows Hannah to a rack of blouses A man carrying a shopping bag walks down the steps past them Turning to Holly with surprise she puts the jacket back on the rack inhales and stares at her sister who watches with a frown Hannah takes a jacket off the rack looks at it and holds it to herself Hannah then looks at the rack of clothes on Holly's side and takes a blouse off to examine it"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The adopted children leave with the twins After they are gone Hannah sips her coffee and looks at Elliot then puts her cup down while still watching him Hannah sighs and Elliot angrily throws his napkin on the table stands up paces behind her and sits back down beside her with a ketchup bottle in front of him The camera moves in on Elliot's anguished face as he looks down Hannah tenderly puts her hand on his shoulder touches his hand and Elliot embraces her Elliot kisses Hannah and they embrace tightly while she touches his hair A metal staircase next to a large white column appears on screen Holly and Hannah's voices are heard as they walk up the stairs into view A man carrying a shopping bag walks down the steps past them Holly follows Hannah to a rack of blouses Hannah takes a jacket off the rack looks at it and holds it to herself Turning to Holly with surprise she puts the jacket back on the rack inhales and stares at her sister who watches with a frown Hannah then looks at the rack of clothes on Holly's side and takes a blouse off to examine it Holly stays under the awning as Mickey walks to the curb and looks angrily back at her People pass by while Mickey walks back and forth from the curb to Holly becoming angrier A taxi pulls up and Mickey and Holly walk to the rear door Mickey holds the door open for Holly who gets in and then slams the door Mickey starts walking along the sidewalk as the taxi drives off passing the hotel and several eveninglit store windows Both a bus and a taxi drive down the street blocking Mickey from view In the reflection of a mirror over a dresser Elliot and Lee can be seen dancing cheek to cheek they dance into view Elliot picks up a glass of champagne and hands it to Lee who sips Elliot sips from his glass and returns it to the dresser They embrace tightly continuing to dance Elliot Hannah and the twins are sitting at the dining room table Hannah shows her two adopted children how a small camera works while they observe fascinated Elliot looks listless and stares blankly at the table One child takes the camera from Hannah and picks up another identical one"
        }
      ]
    }
  ]
}