{
  "ground_truth": "They look at each other, reacting, as the film cuts back to Hannah's kitchen. Norma's face can be seen in the porthole window on the other side of the pantry's swinging door. She looks around the kitchen, then opens the door and steps inside. Holly stands nearby, working in the pantry area. Holly chuckles. Norma steps back out of the kitchen, the door swinging shut behind her. Holly looks at the door, sipping her wine, as the movie cuts back to Hannah's living room. A chubby, friendly uncle sits on a sofa, one child on his lap and several others gathered cross-legged around him on the floor. They lean on the coffee table, which is covered with glasses and a bowl of chips. Other guests mingle in the background; one couple enters the living room, smiling at the scene on the sofa. Mavis crosses the well-lit foyer in the background and opens the door to more guests. The uncle pours more beer from his bottle into the kids' outstretched glasses. They cry indistinctly with excitement. Laughing, he turns to the little girl sitting on his lap; he clinks his bottle against the bottle she is holding, which is almost as big as she is. The uncle and the children happily drink their beer as the movie cuts to a wall with subtly patterned wallpaper in Hannah's bedroom. Her face moves on to the screen. Hannah walks towards Elliot; he's in the bathroom standing over the sink. Elliot walks from behind the partially closed door to an offscreen medicine cabinet. Elliot turns back to the sink, once again obscured by the partially closed door. He dries his hands as Hannah, standing behind him, continues to talk. He closes the door, briefly obscuring Hannah and himself from view. The camera moves behind the closed door, into the bathroom. He opens the medicine cabinet and puts the aspirin bottle back. Elliot slams the medicine cabinet shut. He leaves. Hannah watches him go, reacting. She is stunned. Piano music is still heard very softly in the background as Hannah, hugging herself, walks slowly down the hallway into the living room. She briefly looks around, lost in thought. She sits down heavily, tiredly, on the arm of the couch as the movie cuts to several framed photographs on the mantel. The camera, however, moves closer and closer to a photograph showing Hannah, Lee, and Holly, the three sisters, smiling into the camera. The film shows the bedroom night table, holding a small lamp, a wooden box, a cast-iron fire truck, an ashtray, and glasses. Elliot's pajama-clad arm moves into view. He turns off the lamp; the room is now pitch-black. Elliot turns the lamp back on, then turns to Hannah; she is lying on her side of the bed, partially in shadow.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "They gaze at each other, responding, as the movie transitions back to Hannah's cooking area. Norma's visage can be observed in the porthole glass on the opposite side of the pantry's swinging portal. She glances around the cooking area, then unseals the portal and strides inward. Holly stands nearby, laboring in the pantry space. Holly giggles. Norma steps back out of the cooking area, the portal swinging closed behind her. Holly gazes at the portal, sipping her wine, as the movie transitions back to Hannah's parlor. A rotund, affable uncle perches on a couch, one youngster on his lap and several others congregated cross-legged around him on the ground. They lean on the coffee table, which is laden with glasses and a bowl of crisps. Other visitors intermingle in the background; one pair enters the parlor, grinning at the tableau on the couch. Mavis traverses the well-lit entry in the background and unseals the portal to additional visitors. The uncle pours additional ale from his bottle into the kids' extended glasses. They exclaim indistinctly with enthusiasm. Chortling, he turns to the diminutive girl sitting on his lap; he clinks his bottle against the bottle she is clutching, which is nearly as large as she is. The uncle and the children gleefully drink their ale as the movie transitions to a partition with subtly patterned wallpaper in Hannah's sleeping quarters. Her visage shifts onto the screen. Hannah strolls towards Elliot; he's in the lavatory standing over the basin. Elliot moves from behind the partially closed portal to an offscreen medicine cabinet. Elliot turns back to the basin, once more obscured by the partially closed portal. He dries his hands as Hannah, standing behind him, continues to converse. He closes the portal, briefly obscuring Hannah and himself from view. The camera moves behind the closed portal, into the lavatory. He unseals the medicine cabinet and returns the aspirin bottle. Elliot slams the medicine cabinet shut. He departs. Hannah watches him leave, responding. She is astonished. Piano music is still heard very softly in the background as Hannah, embracing herself, walks slowly down the corridor into the parlor. She briefly glances around, lost in contemplation. She sits down heavily, wearily, on the arm of the sofa as the movie transitions to several framed images on the mantel. The camera, however, draws nearer and nearer to an image showing Hannah, Lee, and Holly, the three sisters, smiling into the camera. The movie shows the sleeping quarters night table, holding a small lamp, a wooden container, a cast-iron fire engine, an ashtray, and glasses. Elliot's pajama-clad arm moves into sight. He extinguishes the lamp; the room is now pitch-black. Elliot turns the lamp back on, then turns to Hannah; she is lying on her side of the bed, partially in shadow."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Each other is looked at by them, reacting, as the film is cut back to Hannah's kitchen. In the porthole window on the other side of the pantry's swinging door, Norma's face can be seen. She looks around the kitchen, then opens the door and steps inside. Holly stands nearby, working in the pantry area. Holly is chuckled by. The kitchen is stepped back out of by Norma, the door swinging shut behind her. The door is looked at by Holly, sipping her wine, as the movie is cut back to Hannah's living room. On a sofa sits a chubby, friendly uncle, with one child on his lap and several others leaning on the coffee table, covered with glasses and a bowl of chips. Guests mingle in the background; the scene on the sofa is smiled at by one couple entering the living room. Across the well-lit foyer, Mavis crosses and opens the door to more guests. More beer is poured by the uncle from his bottle into the kids' outstretched glasses. They cry indistinctly with excitement. The little girl sitting on his lap is turned to by him, laughing; the bottle against the bottle she is holding, which is almost as big as she is, is clinked by him. The uncle and the children happily drink their beer as the movie is cut to a wall with subtly patterned wallpaper in Hannah's bedroom. Her face moves on to the screen. Hannah walks towards Elliot; the bathroom is stood in by him over the sink. From behind the partially closed door, Elliot walks to an offscreen medicine cabinet. Back to the sink, Elliot turns, once again obscured by the partially closed door. His hands are dried by him as Hannah, standing behind him, continues to talk. The door is closed by him, briefly obscuring Hannah and himself from view. Behind the closed door, the camera moves into the bathroom. The medicine cabinet is opened by him, and he puts the aspirin bottle back. The medicine cabinet is slammed shut by Elliot. He leaves. Hannah watches him go, reacting. She is stunned. Piano music is still heard very softly in the background as herself is hugged by Hannah, walking slowly down the hallway into the living room. Around is briefly looked at by her, lost in thought. On the arm of the couch, she sits down heavily, tiredly, as the movie is cut to several framed photographs on the mantel. However, the camera moves closer and closer to a photograph showing Hannah, Lee, and Holly, the three sisters, smiling into the camera. A small lamp, a wooden box, a cast-iron fire truck, an ashtray, and glasses are shown by the film on the bedroom night table. Into view moves Elliot's pajama-clad arm. The lamp is turned off by him; the room is now pitch-black. The lamp is turned back on by Elliot, then he turns to Hannah; on her side of the bed, partially in shadow, she is lying."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "They exchange glances as the film cuts to Hannah's kitchen. Norma's face appears in the porthole window of the pantry door. She surveys the kitchen, enters, and Holly, working nearby, chuckles. Norma exits, the door swinging shut. Holly sips her wine, watching the door as the scene shifts to Hannah's living room. A friendly uncle sits on a sofa with a child on his lap and others around him, leaning on a coffee table covered with glasses and chips. Guests mingle; a couple smiles at the sofa scene. Mavis opens the door to more guests. The uncle pours beer into the kids' glasses, and they cheer. Laughing, he clinks bottles with a girl on his lap. The uncle and children drink happily as the film cuts to Hannah's bedroom wall. Hannah approaches Elliot in the bathroom. Elliot moves to the medicine cabinet, obscured by the door, and dries his hands. He closes the door, briefly hiding them both. The camera enters the bathroom as he returns the aspirin bottle and slams the cabinet shut. Elliot leaves, and Hannah, stunned, watches. Piano music plays softly as she walks down the hallway, lost in thought, and sits on the couch arm. The film focuses on framed photos on the mantel, zooming in on one of Hannah, Lee, and Holly smiling. The bedroom night table holds a lamp, wooden box, fire truck, ashtray, and glasses. Elliot's arm appears, turning off the lamp, leaving the room dark. He turns it back on, looking at Hannah lying in bed, partially shadowed."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "They react as the film cuts to Hannah's kitchen. Norma's face appears in the porthole window of the pantry door. She looks around, enters, and Holly chuckles. Norma exits, door swinging shut. Holly sips wine as the film cuts to Hannah's living room. A friendly uncle sits with kids, pouring beer into their glasses. Mavis opens the door to more guests. The uncle clinks bottles with a girl on his lap. The movie cuts to Hannah's bedroom. She walks to Elliot in the bathroom. Elliot uses the medicine cabinet, obscured by the door. He leaves, and Hannah reacts, stunned. Piano music plays softly as Hannah walks to the living room. She sits on the couch arm, lost in thought. The camera focuses on a photo of Hannah, Lee, and Holly. The bedroom night table holds a lamp, wooden box, fire truck, ashtray, and glasses. Elliot's arm turns off the lamp, then back on, looking at Hannah in shadow."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "They exchange glances, reacting to the moment, as the film transitions back to the familiar setting of Hannah's cozy kitchen. Through the small, round porthole window on the other side of the pantry's swinging door, Norma's face becomes visible. She surveys the kitchen with a curious gaze, then decisively opens the door and steps inside. Nearby, Holly is occupied with her tasks in the pantry area. She lets out a light chuckle. Norma then steps back out of the kitchen, allowing the door to swing shut behind her. Holly watches the door, sipping her wine thoughtfully, as the movie shifts back to the lively scene in Hannah's living room. A chubby, amiable uncle is comfortably seated on a sofa, with one child perched on his lap and several others gathered around him, sitting cross-legged on the floor. They lean against the coffee table, which is cluttered with glasses and a bowl brimming with chips. Other guests are mingling in the background; a couple enters the living room, smiling warmly at the heartwarming scene on the sofa. In the background, Mavis crosses the brightly lit foyer and opens the door to welcome more guests. The uncle, with a jovial air, pours more beer from his bottle into the eagerly outstretched glasses of the children. They cry out with indistinct excitement. Laughing heartily, he turns to the little girl sitting on his lap; he clinks his bottle against the one she is holding, which appears almost as large as she is. The uncle and the children cheerfully drink their beer as the movie transitions to a wall adorned with subtly patterned wallpaper in Hannah's bedroom. Her face appears on the screen. Hannah walks towards Elliot, who is in the bathroom standing over the sink. Elliot moves from behind the partially closed door to an offscreen medicine cabinet. He turns back to the sink, once again hidden by the partially closed door. He dries his hands as Hannah, standing behind him, continues to speak. He closes the door, momentarily obscuring both Hannah and himself from view. The camera then moves behind the closed door, entering the bathroom. He opens the medicine cabinet and places the aspirin bottle back inside. Elliot slams the medicine cabinet shut and leaves. Hannah watches him depart, reacting with a stunned expression. Soft piano music continues to play gently in the background as Hannah, hugging herself for comfort, walks slowly down the hallway into the living room. She briefly surveys her surroundings, lost in thought. She sits down heavily and wearily on the arm of the couch as the movie cuts to several framed photographs on the mantel. The camera, however, zooms in closer and closer to a photograph depicting Hannah, Lee, and Holly, the three sisters, smiling warmly into the camera. The film then shows the bedroom night table, which holds a small lamp, a wooden box, a cast-iron fire truck, an ashtray, and glasses. Elliot's pajama-clad arm comes into view. He turns off the lamp, plunging the room into pitch-black darkness. Elliot then turns the lamp back on and turns to face Hannah; she is lying on her side of the bed, partially enveloped in shadow."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The two individuals exchange brief glances, responding subtly to the moment, as the film gracefully shifts back to the well-known and welcoming setting of Hannah's comfortably snug kitchen. Through the compact, round porthole window set into the opposite side of the pantry's swinging door, Norma's face emerges into view. She takes in the details of the kitchen with an inquisitive gaze, then makes the choice to open the door and step gracefully inside. Nearby, Holly is diligently engrossed in her various tasks in the pantry area. She emits a light, carefree chuckle. Following this, Norma exits the kitchen, allowing the door to gently swing back to its closed position behind her. Holly observes the closing door, sipping her wine with a thoughtful expression, as the narrative of the movie shifts its focus back to the bustling and lively activity taking place in the heart of Hannah's living room. A chubby, amiable uncle, exuding warmth, is comfortably seated on the plush sofa, with one playful child sitting cozily on his lap. Several other children are gathered around him, sitting cross-legged on the floor. They lean against the coffee table, which is crowded with various glasses and a bowl overflowing with crispy chips. In the background, other guests are engaging in social conversation; a couple makes their way into the living room, smiling warmly at the endearing scene unfolding on the sofa. Meanwhile, in the background, Mavis moves across the brightly illuminated foyer and opens the door to greet and welcome more arriving guests. The uncle, with a jovial and carefree demeanor, pours more beer from his bottle into the eagerly extended glasses of the children. Their indistinct exclamations of excitement fill the room. Laughing heartily, he turns his attention to the little girl who is perched on his lap; he clinks his bottle playfully against the one she is holding, which seems almost as large as she is. The uncle and the children joyfully drink their beer as the movie transitions smoothly to focus on a wall adorned with subtly intricate patterned wallpaper in Hannah's bedroom. Her face appears as the focal point on the screen. Hannah proceeds to walk towards Elliot, who is positioned in the bathroom standing over the sink. Elliot moves from behind the partially ajar door to an offscreen medicine cabinet. He returns to the sink, once again obscured by the partially closed door, and dries his hands as Hannah, standing directly behind him, continues to engage him in conversation. He closes the door, momentarily obscuring both Hannah and himself from view. The camera then makes a transition behind the closed door, entering the bathroom space. He opens the medicine cabinet and places the aspirin bottle back inside. He slams the medicine cabinet shut and departs. Hannah watches him leave, her face registering a stunned expression. Soft, gentle piano music continues to play quietly in the background as Hannah, seeking solace, hugs herself for comfort and walks slowly down the hallway into the living room. She briefly takes in her surroundings, her mind lost in deep thought. She sits down heavily, with a weary demeanor, on the arm of the couch as the movie cuts to focus on several framed photographs arranged neatly on the mantel. The camera, however, zooms in closer and closer to one particular photograph, depicting Hannah, Lee, and Holly, the three sisters, smiling warmly into the camera. The film then transitions to the bedroom night table, which holds a small lamp, a wooden box, a cast-iron fire truck, an ashtray, and glasses. Elliot's pajama-clad arm comes into view. He turns off the lamp, plunging the room into pitch-black darkness. Elliot then turns the lamp back on and turns to face Hannah; she is lying on her side of the bed, partially enveloped in shadow."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "They look at each other, their eyes meeting and conveying unspoken reactions, as the film transitions back to the familiar setting of Hannah's kitchen. Through the small, round porthole window on the other side of the pantry's swinging door, Norma's face becomes visible. She scans the kitchen with a curious gaze, taking in the details of the room, before deciding to open the door and step inside. Holly is nearby, engaged in her tasks within the pantry area, and she lets out a chuckle, a light-hearted response to the unfolding scene. Norma, having completed her brief visit, steps back out of the kitchen, allowing the door to swing shut behind her with a gentle motion. Holly, now alone, turns her attention to the door, sipping her wine thoughtfully as the movie shifts focus back to Hannah's living room. In the living room, a chubby, friendly uncle is comfortably seated on a sofa, with one child perched on his lap and several others gathered around him, sitting cross-legged on the floor. The children lean against the coffee table, which is cluttered with glasses and a bowl of chips, adding to the lively atmosphere. In the background, other guests are mingling, their conversations and laughter filling the room; a couple enters the living room, their faces lighting up with smiles as they take in the heartwarming scene on the sofa. Meanwhile, Mavis crosses the well-lit foyer, her movements purposeful as she opens the door to welcome more guests into the gathering. The uncle, in a playful gesture, pours more beer from his bottle into the eagerly outstretched glasses of the children, who respond with indistinct cries of excitement. Laughing, he turns his attention to the little girl sitting on his lap, and with a jovial clink, he taps his bottle against the one she is holding, which appears almost comically large in her small hands. The uncle and the children share a moment of happiness as they drink their beer, and the movie transitions to a wall adorned with subtly patterned wallpaper in Hannah's bedroom. Hannah's face appears on the screen as she walks towards Elliot, who is in the bathroom, standing over the sink. Elliot moves from behind the partially closed door to an offscreen medicine cabinet, his actions deliberate and routine. He turns back to the sink, once again obscured by the partially closed door, and dries his hands while Hannah, standing behind him, continues to speak. He closes the door, momentarily obscuring both himself and Hannah from view. The camera follows, moving behind the closed door and into the bathroom, where Elliot opens the medicine cabinet to return the aspirin bottle to its place. With a decisive motion, he slams the medicine cabinet shut and leaves the room. Hannah watches him go, her expression one of stunned reaction. As piano music plays softly in the background, Hannah, hugging herself for comfort, walks slowly down the hallway and into the living room. She pauses briefly, her gaze wandering as she becomes lost in thought, before sitting down heavily and tiredly on the arm of the couch. The movie then cuts to several framed photographs on the mantel, and the camera gradually zooms in on a photograph capturing Hannah, Lee, and Holly, the three sisters, smiling warmly into the camera. The film shifts to the bedroom night table, which holds a small lamp, a wooden box, a cast-iron fire truck, an ashtray, and glasses. Elliot's arm, clad in pajamas, moves into view as he reaches to turn off the lamp, plunging the room into pitch-black darkness. He then turns the lamp back on, casting light once more, and turns to face Hannah, who is lying on her side of the bed, partially enveloped in shadow."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "They exchange glances as the scene shifts to Hannah's kitchen, where Norma peers through the pantry's porthole window before entering. Holly, working nearby, chuckles as Norma exits, leaving the door swinging shut. The film transitions to Hannah's living room, where a jovial uncle entertains children on the sofa, surrounded by glasses and a bowl of chips. Guests mingle, and a couple enters, smiling at the lively scene. Mavis welcomes more guests at the door. The uncle playfully pours beer into the children's glasses, clinking bottles with a little girl on his lap, and they all drink happily. The scene shifts to Hannah's bedroom, where she approaches Elliot in the bathroom. He moves to the medicine cabinet, obscured by the door, and returns to the sink, drying his hands as Hannah talks. After closing the cabinet, Elliot leaves, stunning Hannah. Soft piano music plays as she walks down the hallway, lost in thought, and sits on the couch arm. The camera focuses on a mantel photograph of Hannah, Lee, and Holly smiling. In the bedroom, Elliot turns off the lamp, plunging the room into darkness, then turns it back on, revealing Hannah lying in partial shadow."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "They look at each other, reacting with a shared understanding only siblings can have, as the film cuts back to Hannah's kitchen, known for its blend of vintage and modern appliances that serve as the heart of lively gatherings. Norma's face can be seen in the porthole window on the other side of the pantry's swinging door, reminiscent of those found in classic ships, adding a nautical charm to the home. She looks around the kitchen, taking in the aroma of freshly baked bread, then opens the door and steps inside. Holly stands nearby, working in the pantry area, her sleeves rolled up as she organizes ingredients for Hannah’s famous apple pie, a recipe passed down through generations. Holly chuckles, remembering a childhood prank involving flour and an unexpected sneeze. Norma steps back out of the kitchen, the door swinging shut behind her with the gentle creak that only a well-loved house can produce. Holly looks at the door, sipping her wine, a robust red from a local vineyard known for its rich flavor, as the movie cuts back to Hannah's living room, a cozy space filled with memories and laughter. A chubby, friendly uncle sits on a sofa, wearing a beloved, well-worn sweater, one child on his lap and several others gathered cross-legged around him on the floor, eager for his storytelling. They lean on the coffee table, which is covered with glasses and a bowl of chips, a staple snack for such gatherings. Other guests mingle in the background; one couple enters the living room, smiling at the scene on the sofa, grateful for moments that weave family ties tighter. Mavis crosses the well-lit foyer, adorned with a stained-glass window that casts colorful patterns in the morning sun, in the background and opens the door to more guests, each bringing dishes for the evening's potluck. The uncle pours more beer, a non-alcoholic ginger brew that fizzes delightfully, from his bottle into the kids' outstretched glasses. They cry indistinctly with excitement, their voices echoing lightly against the high ceilings. Laughing, he turns to the little girl sitting on his lap; he clinks his bottle against the bottle she is holding, which is almost as big as she is. The uncle and the children happily drink their beer as the movie cuts to a wall with subtly patterned wallpaper in Hannah's bedroom, a nod to the Art Deco movement that inspired many architects of her grandparents' era. Her face moves on to the screen, framed by a warm, yellow glow from the bedside lamp. Hannah walks towards Elliot; he's in the bathroom standing over the sink, which is adorned with a delicate arrangement of seashells collected from family vacations. Elliot walks from behind the partially closed door to an offscreen medicine cabinet, where he keeps an assortment of homeopathic remedies. Elliot turns back to the sink, once again obscured by the partially closed door. He dries his hands with a monogrammed towel, a wedding gift from his sister. Hannah, standing behind him with an air of quiet concern, continues to talk. He closes the door, briefly obscuring Hannah and himself from view, creating a moment of separation both physical and emotional. The camera moves behind the closed door, into the bathroom, capturing the intimate details of their space. He opens the medicine cabinet, which holds a mix of daily essentials and small mementos from their travels, and puts the aspirin bottle back. Elliot slams the medicine cabinet shut with frustration. He leaves, the sound of his footsteps barely audible on the soft carpet. Hannah watches him go, reacting, her mind racing with unspoken worries. She is stunned, her heart heavy with the weight of unasked questions. Piano music is still heard very softly in the background, a gentle, melancholic tune that underscores the unfolding drama, as Hannah, hugging herself for comfort, walks slowly down the hallway into the living room. She briefly looks around, lost in thought, as memories of happier times flicker through her mind. She sits down heavily, tiredly, on the arm of the couch, which has been with her since her college days, as the movie cuts to several framed photographs on the mantel, each a snapshot of cherished moments. The camera, however, moves closer and closer to a photograph showing Hannah, Lee, and Holly, the three sisters, smiling into the camera during last summer’s family reunion in upstate New York. The film shows the bedroom night table, holding a small lamp with a soft shade, a wooden box carved by her grandfather, a cast-iron fire truck from Elliot's childhood, an ashtray from an antique store, and glasses that reflect the light of the lamp. Elliot's pajama-clad arm moves into view, the fabric patterned with tiny anchors, a nod to his love of sailing. He turns off the lamp; the room is now pitch-black, the kind of darkness that promises a deep, restful sleep. Elliot turns the lamp back on, then turns to Hannah; she is lying on her side of the bed, partially in shadow, her face peaceful yet thoughtful."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "They look at each other reacting as the film cuts back to Hannah's kitchen  Holly stands nearby working in the pantry area  Holly chuckles  Norma steps back out of the kitchen the door swinging shut behind her  Holly looks at the door sipping her wine as the movie cuts back to Hannah's living room  A chubby friendly uncle sits on a sofa one child on his lap and several others gathered crosslegged around him on the floor  They lean on the coffee table which is covered with glasses and a bowl of chips  Other guests mingle in the background  one couple enters the living room smiling at the scene on the sofa  Mavis crosses the welllit foyer in the background and opens the door to more guests  The uncle pours more beer from his bottle into the kids' outstretched glasses  They cry indistinctly with excitement  Laughing he turns to the little girl sitting on his lap  he clinks his bottle against the bottle she is holding which is almost as big as she is  The uncle and the children happily drink their beer as the movie cuts to a wall with subtly patterned wallpaper in Hannah's bedroom  Her face moves on to the screen  Hannah walks towards Elliot  he's in the bathroom standing over the sink  Elliot walks from behind the partially closed door to an offscreen medicine cabinet  Elliot turns back to the sink once again obscured by the partially closed door  He dries his hands as Hannah standing behind him continues to talk  Norma's face can be seen in the porthole window on the other side of the pantry's swinging door  She looks around the kitchen then opens the door and steps inside  Holly stands nearby working in the pantry area  Holly chuckles  Norma steps back out of the kitchen the door swinging shut behind her  Holly looks at the door sipping her wine as the movie cuts back to Hannah's living room  A chubby friendly uncle sits on a sofa one child on his lap and several others gathered crosslegged around him on the floor  They lean on the coffee table which is covered with glasses and a bowl of chips  Other guests mingle in the background  one couple enters the living room smiling at the scene on the sofa  Mavis crosses the welllit foyer in the background and opens the door to more guests  The uncle pours more beer from his bottle into the kids' outstretched glasses  They cry indistinctly with excitement  Laughing he turns to the little girl sitting on his lap  he clinks his bottle against the bottle she is holding which is almost as big as she is  The uncle and the children happily drink their beer as the movie cuts to a wall with subtly patterned wallpaper in Hannah's bedroom  Her face moves on to the screen  Hannah walks towards Elliot  he's in the bathroom standing over the sink  Elliot walks from behind the partially closed door to an offscreen medicine cabinet  Elliot turns back to the sink once again obscured by the partially closed door  He dries his hands as Hannah standing behind him continues to talk  He closes the door briefly obscuring Hannah and himself from view  The camera moves behind the closed door into the bathroom  He opens the medicine cabinet and puts the aspirin bottle back  Elliot slams the medicine cabinet shut  He leaves Hannah watches him go reacting  She is stunned  Piano music is still heard very softly in the background as Hannah hugging herself walks slowly down the hallway into the living room  She briefly looks around lost in thought  She sits down heavily tiredly on the arm of the couch as the movie cuts to several framed photographs on the mantel  The camera however moves closer and closer to a photograph showing Hannah Lee and Holly the three sisters smiling into the camera  The film shows the bedroom night table holding a small lamp a wooden box a castiron fire truck an ashtray and glasses  Elliot's pajamaclad arm moves into view  He turns off the lamp  the room is now pitchblack  Elliot turns the lamp back on then turns to Hannah  she is lying on her side of the bed partially in shadow"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "They look at each other reacting as the film cuts back to Hannah's kitchen. Norma's face can be seen in the porthole window on the other side of the pantry's swinging door. She looks around the kitchen then opens the door and steps inside. Holly stands nearby working in the pantry area. Holly chuckles. Norma steps back out of the kitchen the door swinging shut behind her. Holly looks at the door sipping her wine as the movie cuts back to Hannah's living room. A chubby friendly uncle sits on a sofa one child on his lap and several others gathered crosslegged around him on the floor. They lean on the coffee table which is covered with glasses and a bowl of chips. Other guests mingle in the background. one couple enters the living room smiling at the scene on the sofa. Mavis crosses the welllit foyer in the background and opens the door to more guests. The uncle pours more beer from his bottle into the kids' outstretched glasses. They cry indistinctly with excitement. Laughing he turns to the little girl sitting on his lap. he clinks his bottle against the bottle she is holding which is almost as big as she is. The uncle and the children happily drink their beer as the movie cuts to a wall with subtly patterned wallpaper in Hannah's bedroom. Her face moves on to the screen. Hannah walks towards Elliot. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. he is in the bathroom standing over the sink. Elliot walks from behind the partially closed door to an offscreen medicine cabinet. Elliot turns back to the sink once again obscured by the partially closed door. He dries his hands as Hannah standing behind him continues to talk. He closes the door briefly obscuring Hannah and himself from view. The camera moves behind the closed door into the bathroom. He opens the medicine cabinet and puts the aspirin bottle back. Elliot slams the medicine cabinet shut. He leaves Hannah watches him go reacting. She is stunned. Piano music is still heard very softly in the background as Hannah hugging herself walks slowly down the hallway into the living room. She briefly looks around lost in thought. She sits down heavily tiredly on the arm of the couch as the movie cuts to several framed photographs on the mantel. The camera however moves closer and closer to a photograph showing Hannah Lee and Holly the three sisters smiling into the camera. The film shows the bedroom night table holding a small lamp a wooden box a castiron fire truck an ashtray and glasses. Elliot's pajamaclad arm moves into view. He turns off the lamp. the room is now pitchblack. Elliot turns the lamp back on then turns to Hannah. she is lying on her side of the bed partially in shadow."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "They look at each other reacting as the film cuts back to Hannah's kitchen. Norma's face can be seen in the porthole window on the other side of the pantry's swinging door. She looks around the kitchen then opens the door and steps inside. Holly stands nearby working in the pantry area. Holly chuckles. Norma steps back out of the kitchen the door swinging shut behind her. Holly looks at the door sipping her wine as the movie cuts back to Hannah's living room. A chubby friendly uncle sits on a sofa one child on his lap and several others gathered crosslegged around him on the floor. They lean on the coffee table which is covered with glasses and a bowl of chips. Other guests mingle in the background. one couple enters the living room smiling at the scene on the sofa. Mavis crosses the welllit foyer in the background and opens the door to more guests. The uncle pours more beer from his bottle into the kids' outstretched glasses. They cry indistinctly with excitement. Laughing he turns to the little girl sitting on his lap. he clinks his bottle against the bottle she is holding which is almost as big as she is. The uncle and the children happily drink their beer as the movie cuts to a wall with subtly patterned wallpaper in Hannah's bedroom. Her face moves on to the screen. Hannah walks towards Elliot. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. he is in the bathroom standing over the sink. Elliot walks from behind the partially closed door to an offscreen medicine cabinet. Elliot turns back to the sink once again obscured by the partially closed door. He dries his hands as Hannah standing behind him continues to talk. He closes the door briefly obscuring Hannah and himself from view. The camera moves behind the closed door into the bathroom. He opens the medicine cabinet and puts the aspirin bottle back. Elliot slams the medicine cabinet shut. He leaves Hannah watches him go reacting. She is stunned. Piano music is still heard very softly in the background as Hannah hugging herself walks slowly down the hallway into the living room. She briefly looks around lost in thought. She sits down heavily tiredly on the arm of the couch as the movie cuts to several framed photographs on the mantel. The camera however moves closer and closer to a photograph showing Hannah Lee and Holly the three sisters smiling into the camera. The film shows the bedroom night table holding a small lamp a wooden box a castiron fire truck an ashtray and glasses. Elliot's pajamaclad arm moves into view. He turns off the lamp. the room is now pitchblack. Elliot turns the lamp back on then turns to Hannah. she is lying on her side of the bed partially in shadow."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "They look at each other reacting as the film cuts back to Hannah's kitchen. Norma's face can be seen in the porthole window on the other side of the pantry's swinging door. She looks around the kitchen then opens the door and steps inside. Holly stands nearby working in the pantry area. Holly chuckles. Norma steps back out of the kitchen the door swinging shut behind her. Holly looks at the door sipping her wine as the movie cuts back to Hannah's living room. A chubby friendly uncle sits on a sofa one child on his lap and several others gathered crosslegged around him on the floor. They lean on the coffee table which is covered with glasses and a bowl of chips. Other guests mingle in the background. Piano music is still heard very softly in the background as Hannah hugging herself walks slowly down the hallway into the living room. She briefly looks around lost in thought. She sits down heavily tiredly on the arm of the couch as the movie cuts to several framed photographs on the mantel. The camera however moves closer and closer to a photograph showing Hannah Lee and Holly the three sisters smiling into the camera. The film shows the bedroom night table holding a small lamp a wooden box a castiron fire truck an ashtray and glasses. Elliot's pajamaclad arm moves into view. He turns off the lamp. the room is now pitchblack. Elliot turns the lamp back on then turns to Hannah. she is lying on her side of the bed partially in shadow."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "They look at each other reacting as the film cuts back to Hannah's kitchen. Norma's face can be seen in the porthole window on the other side of the pantry's swinging door. She looks around the kitchen then opens the door and steps inside. Holly stands nearby working in the pantry area. He turns off the lamp. the room is now pitchblack. Elliot turns the lamp back on then turns to Hannah. she is lying on her side of the bed partially in shadow."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The turtle looks at each other, reacting, as the film cuts back to Hannah's kitchen. A peacock's face can be seen in the porthole window on the other side of the pantry's swinging door. It looks around the kitchen, then opens the door and steps inside. The squirrel stands nearby, working in the pantry area. The squirrel chuckles. The peacock steps back out of the kitchen, the door swinging shut behind it. The squirrel looks at the door, sipping its wine, as the movie cuts back to Hannah's living room. A dragon sits on a sofa, one child on its lap and several others gathered cross-legged around it on the floor. They lean on the coffee table, which is covered with glasses and a bowl of chips. Other guests mingle in the background; one couple enters the living room, smiling at the scene on the sofa. A rabbit crosses the well-lit foyer in the background and opens the door to more guests. The dragon pours more beer from its bottle into the kids' outstretched glasses. They cry indistinctly with excitement. Laughing, the dragon turns to the little girl sitting on its lap; it clinks its bottle against the bottle she is holding, which is almost as big as she is. The dragon and the children happily drink their beer as the movie cuts to a wall with subtly patterned wallpaper in Hannah's bedroom. A bear's face moves on to the screen. The bear walks towards a cat; it's in the bathroom standing over the sink. The cat walks from behind the partially closed door to an offscreen medicine cabinet. The cat turns back to the sink, once again obscured by the partially closed door. It dries its hands as the bear, standing behind it, continues to talk. The cat closes the door, briefly obscuring the bear and itself from view. The camera moves behind the closed door, into the bathroom. The cat opens the medicine cabinet and puts the aspirin bottle back. The cat slams the medicine cabinet shut. The cat leaves. The bear watches it go, reacting. The bear is stunned. Piano music is still heard very softly in the background as the bear, hugging itself, walks slowly down the hallway into the living room. It briefly looks around, lost in thought. It sits down heavily, tiredly, on the arm of the couch as the movie cuts to several framed photographs on the mantel. The camera, however, moves closer and closer to a photograph showing Hannah, Lee, and Holly, the three sisters, smiling into the camera. The film shows the bedroom night table, holding a small lamp, a wooden box, a cast-iron fire truck, an ashtray, and glasses. A dolphin's pajama-clad arm moves into view. It turns off the lamp; the room is now pitch-black. The dolphin turns the lamp back on, then turns to an owl; it is lying on its side of the bed, partially in shadow."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "They look at each other, reacting, as the film cuts back to Hannah's garden. Norma's face can be seen in the stained glass window on the other side of the greenhouse's swinging door. She looks around the garden, then opens the door and steps inside. Holly stands nearby, working in the greenhouse area. Holly chuckles. Norma steps back out of the garden, the door swinging shut behind her. Holly looks at the door, sipping her lemonade, as the movie cuts back to Hannah's den. A chubby, friendly uncle sits on a recliner, one child on his lap and several others gathered cross-legged around him on the floor. They lean on the ottoman, which is covered with mugs and a plate of crackers. Other guests mingle in the background; one couple enters the den, smiling at the scene on the recliner. Mavis crosses the dim hallway in the background and opens the door to more guests. The uncle pours more soda from his can into the kids' outstretched mugs. They cry indistinctly with excitement. Laughing, he turns to the little girl sitting on his lap; he clinks his can against the can she is holding, which is almost as big as she is. The uncle and the children happily drink their soda as the movie cuts to a wall with subtly patterned wallpaper in Hannah's study. Her face moves on to the screen. Hannah walks towards Elliot; he's in the utility room standing over the counter. Elliot walks from behind the partially closed door to an offscreen storage cabinet. Elliot turns back to the counter, once again obscured by the partially closed door. He dries his hands as Hannah, standing behind him, continues to talk. He closes the door, briefly obscuring Hannah and himself from view. The camera moves behind the closed door, into the utility room. He opens the storage cabinet and puts the vitamin bottle back. Elliot slams the storage cabinet shut. He leaves. Hannah watches him go, reacting. She is stunned. Violin music is still heard very softly in the background as Hannah, hugging herself, walks slowly down the hallway into the den. She briefly looks around, lost in thought. She sits down heavily, tiredly, on the arm of the armchair as the movie cuts to several framed maps on the mantle. The camera, however, moves closer and closer to a map showing Hannah, Lee, and Holly, the three sisters, smiling into the camera. The film shows the study desk, holding a small clock, a glass jar, a wooden horse, an ashtray, and glasses. Elliot's pajama-clad arm moves into view. He turns off the clock; the room is now pitch-black. Elliot turns the clock back on, then turns to Hannah; she is lying on her side of the hammock, partially in shadow."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "They stare at each other, contemplating, as the film switches back to Hannah's kitchen. Norma's face can be seen in the porthole window on the other side of the pantry's swinging door. She glances around the kitchen, then knocks on the door and steps inside. Holly stands nearby, organizing in the pantry area. Holly giggles. Norma wanders back out of the kitchen, the door drifting shut behind her. Holly gazes at the door, swirling her wine, as the movie shifts back to Hannah's living room. A chubby, friendly uncle lounges on a sofa, one child on his lap and several others gathered cross-legged around him on the floor. They prop their elbows on the coffee table, which is covered with glasses and a bowl of chips. Other guests sway in the background; one couple enters the living room, laughing at the scene on the sofa. Mavis strolls across the well-lit foyer in the background and greets more guests. The uncle hands out more juice from his bottle into the kids' outstretched glasses. They shout indistinctly with excitement. Chuckling, he turns to the little girl sitting on his lap; he taps his bottle against the bottle she is holding, which is almost as big as she is. The uncle and the children cheerfully sip their juice as the movie changes to a wall with subtly patterned wallpaper in Hannah's bedroom. Her face comes into focus on the screen. Hannah approaches Elliot; he's in the bathroom washing his hands. Elliot emerges from behind the partially closed door to an offscreen medicine cabinet. Elliot turns back to the sink, once again concealed by the partially closed door. He wipes his hands as Hannah, standing behind him, continues to converse. He closes the door, briefly hiding Hannah and himself from sight. The camera sneaks behind the closed door, into the bathroom. He retrieves the medicine cabinet and places the aspirin bottle back. Elliot snaps the medicine cabinet shut. He exits. Hannah watches him leave, contemplating. She is bewildered. Piano music is still heard very softly in the background as Hannah, hugging herself, strolls slowly down the hallway into the living room. She briefly scans the room, deep in thought. She settles down heavily, tiredly, on the arm of the couch as the movie transitions to several framed photographs on the mantel. The camera, however, moves closer and closer to a photograph showing Hannah, Lee, and Holly, the three sisters, posing into the camera. The film highlights the bedroom night table, holding a small lamp, a wooden box, a cast-iron fire truck, an ashtray, and glasses. Elliot's pajama-clad arm glides into view. He dims the lamp; the room is now pitch-black. Elliot illuminates the lamp again, then turns to Hannah; she is lying on her side of the bed, partially in shadow."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "They gaze at one another, responding, as the documentary shifts back to Bert's den. Claudia's expression can be seen in the skylight on the opposite side of the closet’s sliding panel. She glances around the den, then pulls open the panel and steps within. Sam stands close by, toiling in the closet quadrant. Sam snickers. Claudia withdraws from the den, the panel sliding closed behind her. Sam glances at the panel, sipping her juice, as the documentary shifts back to Bert's lounge. A tall, jovial cousin sprawls on a lounger, a cat on his knees and several puppies gathered cross-legged around him on the rug. They lean on the console table, which is strewn with mugs and a dish of pretzels. Other visitors circulate in the backdrop; a pair of twins enter the lounge, beaming at the tableau on the lounger. Agnes strides across the dim vestibule in the backdrop and pulls open the panel to further visitors. The cousin pours additional soda from his can into the puppies' waiting mugs. They exclaim vaguely with excitement. Chuckling, he turns to the little boy perched on his knees; he taps his can against the can the boy is clutching, which is nearly as large as he is. The cousin and the animals merrily sip their soda as the documentary shifts to a partition with delicately adorned wall covering in Bert's boudoir. His visage transitions on to the monitor. Bert strolls towards Dora; she's in the washroom leaning over the basin. Dora strolls from beyond the barely ajar panel to an unseen medicine drawer. Dora turns back to the basin, once more hidden by the barely ajar panel. She dries her fingers as Bert, positioned behind her, keeps chatting. She shuts the panel, momentarily hiding Bert and herself from sight. The lens shifts beyond the shut panel, into the washroom. She opens the medicine drawer and places the vitamin jar back. Dora bangs the medicine drawer shut. She departs. Bert observes her leave, responding. He is astonished. Guitar chords are still perceived faintly in the backdrop as Bert, clasping himself, strolls leisurely down the corridor into the lounge. He momentarily glances around, immersed in contemplation. He plops down heavily, wearily, on the armrest of the settee as the documentary shifts to an array of framed snapshots on the bookshelf. The lens, however, drifts nearer and nearer to a snapshot depicting Bert, Max, and Sam, the trio of brothers, grinning at the lens. The documentary displays the boudoir nightstand, holding a modest lamp, a tin canister, a ceramic locomotive, an incense holder, and mugs. Dora's nightgown-covered limb emerges into sight. She switches off the lamp; the space is now shrouded in darkness. Dora switches the lamp back on, then turns to Bert; he is reclining on his side of the mattress, partially veiled in shadow."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "They glance at one another, observing, as the film shifts back to Sarah's kitchen. Lila's silhouette can be seen in the porthole window on the opposite side of the pantry's swinging door. She scans the kitchen, then swings open the door and floats inside. Becky loiters nearby, fiddling in the pantry area. Becky snickers. Lila glides out of the kitchen, the door swinging shut behind her. Becky peers at the door, swirling her tea, as the movie shifts back to Sarah's living room. A tall, jovial aunt lounges on a sofa, one dog on her lap and several more sprawled across the floor. They rest against the coffee table, which is decorated with glasses and a bowl of fruits. Other attendees drift in the background; one duo enters the living room, grinning at the tableau on the sofa. Greg strolls across the dimly-lit hallway in the background and announces the arrival of more attendees. The aunt serves more soda from her pitcher into the dogs' eager bowls. They yelp indistinctly with excitement. Grinning, she turns to the small boy perched on her lap; she taps her pitcher against the bottle he is holding, which is nearly as big as he is. The aunt and the dogs joyfully sip their soda as the movie shifts to a wall with intricate patterned wallpaper in Sarah's bedroom. Her image drifts onto the screen. Sarah strides towards Jason; he's in the bathroom hovering above the sink. Jason ambles from behind the partially closed door to an offscreen medicine cabinet. Jason swivels back to the sink, again concealed by the partially closed door. He polishes his glasses as Sarah, standing nearby, persists in her speech. He seals the door, briefly concealing Sarah and himself from sight. The camera swings behind the closed door, into the bathroom. He cracks open the medicine cabinet and retrieves the cough syrup bottle. Jason slams the medicine cabinet shut. He departs. Sarah observes him go, observing. She is astonished. Violin music is still heard faintly in the background as Sarah, hugging herself, meanders slowly down the corridor into the living room. She cursorily glances around, lost in contemplation. She perches heavily, wearily, on the arm of the couch as the movie shifts to several framed images on the mantel. The camera, nonetheless, zooms closer and closer to a photograph showing Sarah, Amy, and Becky, the three sisters, beaming into the camera. The film reveals the bedroom nightstand, holding a small radio, a silver box, a toy motorcycle, a candleholder, and coasters. Jason's robe-clad arm drifts into view. He flicks off the radio; the room now lies in silence. Jason flicks the radio back on, then turns to Sarah; she is reclining on her side of the bed, partially in shadow."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "They glance at one another, hesitating, as the scene shifts back to Hannah's library. Norma's silhouette can be perceived through the submarine window on the other side of the study's revolving door. She glances around the library, then removes the door and floats inside. Holly stands nearby, playing in the study area. Holly giggles. Norma floats back out of the library, the door revolving shut behind her. Holly gazes at the door, nibbling her muffin, as the film shifts back to Hannah's dining room. A stout, amiable uncle lounges on a loveseat, one pet on his lap and several others clustered kneeling around him on the floor. They lean on the ottoman, which is filled with flowers and a pile of magazines. Other guests wander in the background; one duo enters the dining room, grinning at the display on the loveseat. Mavis traverses the dimly lit corridor in the background and adjusts the window for more light. The uncle pours more lemonade from his pitcher into the pets' outstretched bowls. They bark indistinctly with excitement. Chuckling, he turns to the little girl perched on his lap; he taps his pitcher against the pail she is holding, which is nearly as bulky as she is. The uncle and the pets merrily drink their lemonade as the film shifts to a ceiling with intricately carved moulding in Hannah's lounge. Her expression shifts into the foreground. Hannah drifts towards Elliot; he's in the closet hovering over the dresser. Elliot emerges from behind the partially ajar bookshelves to an invisible drawer. Elliot turns back to the dresser, once more concealed by the partially ajar bookshelves. He folds his sleeves as Hannah, standing nearby, persists in speaking. He shuts the bookshelves, momentarily hiding Hannah and himself from sight. The camera pans behind the closed bookshelves, into the closet. He opens the drawer and places the marble jar back. Elliot swings the drawer closed. He exits. Hannah observes him leave, hesitating. She is confounded. Violin music is still audible very softly in the background as Hannah, hugging herself, glides slowly down the corridor into the dining room. She momentarily gazes around, absorbed in contemplation. She perches heavily, wearily, on the edge of the stool as the film transitions to several framed paintings on the bookcase. The camera, however, inches closer and closer to a portrait displaying Hannah, Lee, and Holly, the three siblings, grinning at the viewer. The scene exhibits the lounge vanity, holding a small statue, a ceramic vase, a brass locomotive, a candleholder, and spectacles. Elliot's bathrobe-clad hand drifts into sight. He snuffs out the statue; the space is now completely dark. Elliot illuminates the statue again, then turns to Hannah; she is reclining on her section of the divan, partially in shadow."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The flamingos squawk at each other, juggling, as the cartoon skips back to Mabel's garage. Eddie's mug can be spotted in the telescope lens on the opposite side of the laundry chute's sliding hatch. He glances around the garage, then seals the hatch and hops inside. George lounges nearby, juggling in the laundry area. George snickers. Eddie hops back out of the garage, the hatch sliding closed behind him. George studies the hatch, chewing his gum, as the cartoon skips back to Mabel's dining room. A scrawny, grumpy teacher lounges on a hammock, one cactus on his toe and several other potted plants scattered cross-legged around him on the rug. They balance on the shoe rack, which is cluttered with marbles and a basket of apples. Other vendors saunter in the foreground; a solitary pigeon exits the dining room, winking at the vista on the hammock. Fiona hops over the dimly lit hallway in the foreground and seals the hatch to fewer vendors. The teacher sprinkles more soda from his can into the plants’ uprooted pots. They howl indistinctly with curiosity. Crying, he spins to the scruffy dog lounging on his toe; he taps his can against the can the dog is holding, which is nearly as enormous as the dog itself. The teacher and the plants silently sip their soda as the cartoon skips to a floor with intricately painted tile in Mabel's closet. Her mug materializes on to the paper. Mabel skips away from Marvin; he's on the porch lounging under the faucet. Marvin skips to the side of the fully open hatch to an onscreen tool shed. Marvin skips away from the faucet, still exposed by the fully open hatch. He moistens his elbows as Mabel, lounging in front of him, refuses to giggle. He swings the hatch, fleetingly exposing Mabel and himself to view. The panorama spins in front of the open hatch, toward the porch. He swings the tool shed and grabs the ketchup bottle back. Marvin whacks the tool shed open. He skips. Mabel ignores him leave, juggling. She is ecstatic. Drum music is still silenced very loudly in the foreground as Mabel, waving at herself, skips quickly through the kitchen toward the dining room. She quietly glances away, consumed in panic. She skips quietly, hungrily, on the trunk of the hammock as the cartoon skips to a dozen sculpted busts on the ceiling. The panorama, nonetheless, darts farther and farther from a sculpture displaying Mabel, Brian, and George, the three shipmates, wailing at the panorama. The cartoon displays the closet basement shelf, harboring a giant fan, a plastic tub, a titanium steam engine, a dustbin, and ribbons. Marvin's jeans-clad ear vanishes from view. He kicks on the fan; the closet becomes bright-yellow. Marvin kicks the fan off, then spins to Mabel; he is juggling on her corner of the porch, entirely lit up."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In Hannah's kitchen, Norma peeks through the pantry door, then steps inside as Holly, who’s nearby, chuckles. Norma exits, and the scene shifts to Hannah's living room where a cheerful uncle entertains kids on the sofa with glasses raised for a playful toast. Mavis welcomes more guests as they join the lively gathering. The focus then moves to Hannah and Elliot in the bathroom; Elliot puts away aspirin and leaves abruptly, stunning Hannah. As piano music plays softly, Hannah walks to the living room, contemplating, before sitting on the couch arm. The camera zooms in on photographs of Hannah and her sisters, Lee and Holly, smiling. In the bedroom, Elliot turns off and then back on a lamp, glancing at Hannah partially in shadow on her side of the bed."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "she is lying on her side of the bed partially in shadow Elliot turns the lamp back on then turns to Hannah  the room is now pitchblack  He turns off the lamp  Elliot's pajamaclad arm moves into view  The film shows the bedroom night table holding a small lamp a wooden box a castiron fire truck an ashtray and glasses  The camera however moves closer and closer to a photograph showing Hannah Lee and Holly the three sisters smiling into the camera  She sits down heavily tiredly on the arm of the couch as the movie cuts to several framed photographs on the mantel  She briefly looks around lost in thought  Piano music is still heard very softly in the background as Hannah hugging herself walks slowly down the hallway into the living room  She is stunned  He leaves Hannah watches him go reacting  Elliot slams the medicine cabinet shut  He opens the medicine cabinet and puts the aspirin bottle back  The camera moves behind the closed door into the bathroom  He closes the door briefly obscuring Hannah and himself from view  He dries his hands as Hannah standing behind him continues to talk  Elliot turns back to the sink once again obscured by the partially closed door  Elliot walks from behind the partially closed door to an offscreen medicine cabinet  he's in the bathroom standing over the sink  Hannah walks towards Elliot  Her face moves on to the screen  The uncle and the children happily drink their beer as the movie cuts to a wall with subtly patterned wallpaper in Hannah's bedroom  he clinks his bottle against the bottle she is holding which is almost as big as she is  Laughing he turns to the little girl sitting on his lap  They cry indistinctly with excitement  The uncle pours more beer from his bottle into the kids' outstretched glasses  Mavis crosses the welllit foyer in the background and opens the door to more guests  one couple enters the living room smiling at the scene on the sofa  Other guests mingle in the background  They lean on the coffee table which is covered with glasses and a bowl of chips  A chubby friendly uncle sits on a sofa one child on his lap and several others gathered crosslegged around him on the floor  Holly looks at the door sipping her wine as the movie cuts back to Hannah's living room  Norma steps back out of the kitchen the door swinging shut behind her  Holly chuckles  Holly stands nearby working in the pantry area  She looks around the kitchen then opens the door and steps inside  Norma's face can be seen in the porthole window on the other side of the pantry's swinging door  They look at each other reacting as the film cuts back to Hannah's kitchen "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Laughing he turns to the little girl sitting on his lap  he clinks his bottle against the bottle she is holding which is almost as big as she is  They cry indistinctly with excitement  They look at each other reacting as the film cuts back to Hannah's kitchen  The camera however moves closer and closer to a photograph showing Hannah Lee and Holly the three sisters smiling into the camera  The uncle pours more beer from his bottle into the kids' outstretched glasses  He leaves Hannah watches him go reacting  They lean on the coffee table which is covered with glasses and a bowl of chips  He opens the medicine cabinet and puts the aspirin bottle back  She briefly looks around lost in thought  She sits down heavily tiredly on the arm of the couch as the movie cuts to several framed photographs on the mantel  one couple enters the living room smiling at the scene on the sofa  the room is now pitchblack  Holly chuckles  He closes the door briefly obscuring Hannah and himself from view  Holly stands nearby working in the pantry area  She is stunned  Elliot turns back to the sink once again obscured by the partially closed door  Elliot's pajamaclad arm moves into view  The film shows the bedroom night table holding a small lamp a wooden box a castiron fire truck an ashtray and glasses  Norma's face can be seen in the porthole window on the other side of the pantry's swinging door  He turns off the lamp  Elliot turns the lamp back on then turns to Hannah  Holly looks at the door sipping her wine as the movie cuts back to Hannah's living room  Hannah walks towards Elliot  Mavis crosses the welllit foyer in the background and opens the door to more guests  he's in the bathroom standing over the sink  Elliot walks from behind the partially closed door to an offscreen medicine cabinet  Elliot slams the medicine cabinet shut  Other guests mingle in the background  Her face moves on to the screen  Norma steps back out of the kitchen the door swinging shut behind her  The camera moves behind the closed door into the bathroom  A chubby friendly uncle sits on a sofa one child on his lap and several others gathered crosslegged around him on the floor  Piano music is still heard very softly in the background as Hannah hugging herself walks slowly down the hallway into the living room  She looks around the kitchen then opens the door and steps inside  The uncle and the children happily drink their beer as the movie cuts to a wall with subtly patterned wallpaper in Hannah's bedroom  she is lying on her side of the bed partially in shadow He dries his hands as Hannah standing behind him continues to talk "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Elliot walks from behind the partially closed door to an offscreen medicine cabinet  Elliot turns back to the sink once again obscured by the partially closed door  He dries his hands as Hannah standing behind him continues to talk  He closes the door briefly obscuring Hannah and himself from view  The camera moves behind the closed door into the bathroom  He opens the medicine cabinet and puts the aspirin bottle back  Elliot slams the medicine cabinet shut  He leaves Hannah watches him go reacting  She is stunned  Piano music is still heard very softly in the background as Hannah hugging herself walks slowly down the hallway into the living room  She briefly looks around lost in thought  She sits down heavily tiredly on the arm of the couch as the movie cuts to several framed photographs on the mantel  The camera however moves closer and closer to a photograph showing Hannah Lee and Holly the three sisters smiling into the camera  The film shows the bedroom night table holding a small lamp a wooden box a castiron fire truck an ashtray and glasses  Elliot's pajamaclad arm moves into view  He turns off the lamp  the room is now pitchblack  Elliot turns the lamp back on then turns to Hannah  she is lying on her side of the bed partially in shadow They look at each other reacting as the film cuts back to Hannah's kitchen  Norma's face can be seen in the porthole window on the other side of the pantry's swinging door  She looks around the kitchen then opens the door and steps inside  Holly stands nearby working in the pantry area  Holly chuckles  Norma steps back out of the kitchen the door swinging shut behind her  Holly looks at the door sipping her wine as the movie cuts back to Hannah's living room  A chubby friendly uncle sits on a sofa one child on his lap and several others gathered crosslegged around him on the floor  They lean on the coffee table which is covered with glasses and a bowl of chips  Other guests mingle in the background  one couple enters the living room smiling at the scene on the sofa  Mavis crosses the welllit foyer in the background and opens the door to more guests  The uncle pours more beer from his bottle into the kids' outstretched glasses  They cry indistinctly with excitement  Laughing he turns to the little girl sitting on his lap  he clinks his bottle against the bottle she is holding which is almost as big as she is  The uncle and the children happily drink their beer as the movie cuts to a wall with subtly patterned wallpaper in Hannah's bedroom  Her face moves on to the screen  Hannah walks towards Elliot  he's in the bathroom standing over the sink "
        }
      ]
    }
  ]
}