{
  "ground_truth": "The mirror shatters. Mickey, holding the rifle, is seen running over to the shattered mirror. Mickey runs offscreen briefly to answer the door. He returns onscreen, panting; he looks frantically once again around the living room. Occasionally, he is obscured by a tree trunk on the opposite side of the street; a few taxis go by as he talks over the scene. The movie cuts to the exterior of the Metro movie theater, with its smoked glass entrance doors and its Art Deco feel. An old publicity photo hangs inside. Mickey's reflection is seen at the almost-transparent doors, as well as the reflection of the street and various cars whizzing by. His reflection walks towards the theater entrance; he continues his story. Mickey walks into the movie house. He is seen through the glass doors, which still reflect the street and traffic outside. He makes his way through the lobby into the actual theater. The film abruptly cuts to the theater's black-and-white screen, where the Marx Brothers, in Duck Soup, play the helmets of several soldiers standing in a line like a live xylophone. The film cuts back to the black-and-white movie screen as Mickey continues to talk. The movie cuts back to Mickey, sitting almost obscured in the dark theater. As Mickey talks, the film cuts back to the antics of the Marx Brothers on the black-and-white theater screen. The four brothers are now swaying and singing and strutting, their voices indistinct over Mickey's narration. The film is back on Mickey's dark form in the audience. As Mickey continues, the film cuts back to Duck Soup on the black-and-white screen. The Marx Brothers are sitting on a judge's bench, playing banjos and singing with the other cast members. They jump down from the bench, still singing. The Marx Brothers kneel, strumming their banjos, and the movie cuts back to Central Park. They pass some people, a cluster of buildings that look like castles, and the Manhattan skyline as seen through the trees, as the camera moves back, farther and farther away from them, showing a beautiful Central Park, frozen in time. They stroll offscreen. Mavis passes the table, licking some food off her hand. Hannah, in the background, is busy by the stove. As Mavis leaves the kitchen, Lee enters, carrying some empty glasses. Norma walks over to a glass-doored cabinet and takes out a bottle of gin. Norma unscrews the liquor bottle and pours some into her empty glass as Hannah stops her mashing, reacting. The movie leaves the kitchen and cuts to the doorway between the dining room and the living room. Two women stand by the partially set dining room table, chatting and arranging some plates, as Elliot strolls into view, sipping a drink.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The reflector fractures. Mickey, clutching the firearm, is perceived sprinting over to the fractured reflector. Mickey sprints offscreen briefly to respond to the entrance. He returns onscreen, gasping; he glances frantically once more around the living area. Occasionally, he is obscured by a tree trunk on the opposing side of the thoroughfare; a few cabs glide by as he narrates over the scenario. The film slices to the outside of the Metro cinema theater, with its smoked glass entry doors and its Art Deco ambiance. An old promotional image dangles inside. Mickey's likeness is perceived at the almost-transparent doors, as well as the likeness of the thoroughfare and various automobiles speeding by. His likeness strides towards the theater entry; he continues his tale. Mickey strides into the cinema house. He is perceived through the glass doors, which still mirror the thoroughfare and vehicles outside. He makes his path through the foyer into the actual theater. The film abruptly slices to the theater's monochrome screen, where the Marx Brothers, in Duck Soup, play the helmets of several soldiers standing in a queue like a live xylophone. The film slices back to the monochrome cinema screen as Mickey continues to narrate. The film slices back to Mickey, seated almost hidden in the dim theater. As Mickey narrates, the film slices back to the antics of the Marx Brothers on the monochrome theater screen. The four siblings are now swaying and chanting and strutting, their voices indistinct over Mickey's commentary. The film is back on Mickey's dark silhouette in the audience. As Mickey continues, the film slices back to Duck Soup on the monochrome screen. The Marx Brothers are seated on a judge's bench, strumming banjos and chanting with the other cast members. They leap down from the bench, still chanting. The Marx Brothers kneel, plucking their banjos, and the film slices back to Central Park. They pass some individuals, a cluster of edifices that resemble fortresses, and the Manhattan skyline as perceived through the trees, as the camera moves back, farther and farther away from them, displaying a magnificent Central Park, frozen in time. They amble offscreen. Mavis passes the table, licking some nourishment off her hand. Hannah, in the background, is occupied by the stove. As Mavis exits the kitchen, Lee enters, bearing some vacant glasses. Norma strides over to a glass-doored cabinet and retrieves a bottle of gin. Norma unscrews the liquor bottle and pours some into her vacant glass as Hannah halts her mashing, reacting. The film departs the kitchen and slices to the entryway between the dining area and the living area. Two women stand by the partially set dining area table, chatting and arranging some plates, as Elliot strolls into view, sipping a beverage."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The mirror is shattered. Mickey, holding the rifle, sees himself running over to the mirror that has been shattered. The door is answered by him after he briefly runs offscreen. Onscreen, Mickey returns, panting; the living room is looked around frantically by him once again. A tree trunk on the opposite side of the street occasionally obscures him; he talks over the scene as a few taxis go by. The movie cuts to the exterior of the Metro movie theater, with its smoked glass entrance doors and its Art Deco feel. An old publicity photo is hung inside. At the almost-transparent doors, Mickey's reflection can be seen, along with the reflection of the street and various cars whizzing by. Towards the theater entrance, his reflection walks; the story is continued by him. The movie house is entered by Mickey. Through the glass doors, he is seen, which still reflect the street and traffic outside. His way is made by him through the lobby into the actual theater. The theater's black-and-white screen is abruptly cut to by the film, where the Marx Brothers, in Duck Soup, play the helmets of several soldiers standing in a line like a live xylophone. As Mickey continues to talk, the film cuts back to the black-and-white movie screen. Mickey is cut back to by the movie, showing him sitting almost obscured in the dark theater. As Mickey talks, the antics of the Marx Brothers on the black-and-white theater screen are cut back to by the film. Now swaying, singing, and strutting, the four brothers appear, their voices indistinct over Mickey's narration. Mickey's dark form in the audience is the focus of the film again. As Mickey continues, Duck Soup is cut back to on the black-and-white screen by the film. Sitting on a judge's bench, the Marx Brothers play banjos and sing with the other cast members. From the bench, they jump down, still singing. Kneeling, the Marx Brothers strum their banjos, and Central Park is cut back to by the movie. Passing some people, a cluster of buildings that look like castles, and the Manhattan skyline as seen through the trees, they are moved back from by the camera, farther and farther away from them, showing a beautiful Central Park, frozen in time. Offscreen, they stroll. The table is passed by Mavis, who licks some food off her hand. Busy by the stove, Hannah is in the background. As the kitchen is left by Mavis, Lee enters, carrying some empty glasses. Over to a glass-doored cabinet, Norma walks and takes out a bottle of gin. The liquor bottle is unscrewed by Norma, and some is poured into her empty glass as Hannah stops her mashing, reacting. The kitchen is left by the movie, and the doorway between the dining room and the living room is cut to. By the partially set dining room table, two women stand, chatting and arranging some plates, as a drink is sipped by Elliot while he strolls into view."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The mirror shatters. Mickey, with a rifle, rushes to it, then briefly exits to answer the door. Returning panting, he nervously scans the living room. Occasionally obscured by a tree trunk across the street, taxis pass as he speaks. The scene shifts to the Metro movie theater with smoked glass and Art Deco style. An old photo is inside. Mickey's reflection appears on the doors as cars speed by. He heads toward the entrance, continuing his story, and enters the theater. Seen through glass doors, he moves through the lobby to the theater. The film cuts to the black-and-white screen showing the Marx Brothers in Duck Soup, playing xylophone on soldiers' helmets. It returns to Mickey, almost obscured in the dark. As he talks, the film alternates between the Marx Brothers' antics and Mickey's dark form. The brothers, now singing on a judge's bench, jump down and strum banjos as the scene shifts to Central Park. They pass castle-like buildings and the Manhattan skyline through trees, revealing a timeless Central Park. They walk offscreen. Mavis licks food from her hand as she exits the kitchen, where Hannah is busy cooking. Lee enters with glasses, and Norma retrieves gin from a cabinet, pouring into a glass. The film cuts to the dining room, where two women chat while setting a table, and Elliot enters, sipping a drink."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The mirror shatters. Mickey, with a rifle, runs to the broken mirror, then offscreen to answer the door. Returning panting, he looks frantically around the living room, occasionally hidden by a tree trunk across the street as taxis pass. The scene cuts to the Metro movie theater's Art Deco exterior. Mickey's reflection appears on the transparent doors, alongside street reflections and cars. He walks into the theater, continuing his story. Through the glass doors, still reflecting the street, he enters the lobby and theater. The film cuts to the theater screen, showing the Marx Brothers in Duck Soup, playing helmets as xylophones. Mickey talks, and the film alternates between his shadowed figure and the antics onscreen. The Marx Brothers sway, sing indistinctly over Mickey's narration, and play banjos from a judge's bench. They strum kneeling, as the movie cuts to Central Park, showing frozen-in-time scenes of castles, Manhattan's skyline, and people strolling. Mavis licks food off her hand in the kitchen, where Hannah is busy cooking. Mavis exits as Lee enters with empty glasses. Norma pours gin, reacting to Hannah. The movie shifts to the dining-room doorway, where two women chat, arrange plates, and Elliot drinks nearby."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The mirror unexpectedly shatters into pieces. Mickey, who is clutching the rifle in his hands, is quickly seen rushing over to the now-broken mirror. For a brief moment, Mickey dashes offscreen as he goes to answer the persistent knocking at the door. He soon returns to the screen, visibly panting and out of breath; he looks around frantically in a state of panic, his gaze darting once again around the living room. Occasionally, he is partially obscured by the trunk of a tree located on the opposite side of the street; during this moment, a few taxis are seen driving by as he continues talking over the unfolding scene. The movie transitions to the exterior of the elegant Metro movie theater, noted for its smoked glass entrance doors and distinctive Art Deco flair. Inside, an old publicity photo is prominently displayed. Mickey's reflection is visible at the nearly-transparent doors, as is the mirrored image of the street and various cars speeding by. His silhouette moves towards the entrance of the theater; as he does so, he continues narrating his story. Mickey walks directly into the movie house. He is visible through the glass doors, which continue to reflect the bustling street and ongoing traffic outside. He navigates his way through the lobby to enter the actual theater area. Suddenly, the film shifts to the theater's black-and-white screen, where the Marx Brothers, in their classic film Duck Soup, humorously play the helmets of several soldiers, standing in a synchronized line like a live xylophone. The film then shifts back to the black-and-white screen as Mickey carries on with his narration. The movie cuts back to show Mickey, sitting almost completely obscured in the darkened theater. As Mickey continues speaking, the film once again shifts back to the antics of the Marx Brothers on the black-and-white theater screen. The four comedic brothers are now joyously swaying, singing, and strutting around, their voices blending indistinctly with Mickey's ongoing narration. The film returns to focus on Mickey's shadowy form in the audience. As Mickey continues, the film shifts back to the scenes from Duck Soup on the monochrome screen. The Marx Brothers are shown sitting on a judge's bench, energetically playing banjos and singing along with other cast members. They leap down from the elevated bench, still joyfully singing. The Marx Brothers then kneel down, strumming their banjos, and the movie cuts back to a picturesque Central Park. They pass by several people, a cluster of buildings resembling castles, and the iconic Manhattan skyline as seen through the dense trees, as the camera gradually moves back, farther and farther, revealing a beautiful Central Park, seemingly frozen in time. The group then strolls offscreen. Mavis walks by the table, licking some remnants of food off her hand. In the background, Hannah is busily occupied by the stove. As Mavis exits the kitchen, Lee enters, carefully carrying some empty glasses. Norma walks over to a glass-doored cabinet and retrieves a bottle of gin. Norma unscrews the cap of the liquor bottle and pours some of it into her empty glass, as Hannah pauses her mashing, reacting to this. The movie leaves the bustling kitchen and cuts to the entrance between the dining room and the living room. Two women stand near the partially set dining room table, chatting animatedly while arranging some plates, as Elliot leisurely strolls into view, sipping a drink."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The mirror, quite unexpectedly and without any warning, shatters into many pieces. Mickey, who is tightly clutching the rifle with both hands, is quickly seen making his way over to the now-broken mirror, his expression one of shock and urgency. For a brief moment, Mickey dashes offscreen, disappearing from view as he hurries to answer the persistent and relentless knocking at the door. Not long after, he soon returns to the screen, visibly panting and struggling to catch his breath; his eyes dart around frantically in a state of panic, his gaze quickly scanning the living room once again. Occasionally, he is partially obscured by the trunk of a large tree located on the opposite side of the street; during these moments of partial concealment, a few taxis are seen driving by as he continues talking over the unfolding scene. The movie then smoothly transitions to the exterior of the elegant Metro movie theater, distinguished by its smoked glass entrance doors and its distinctive Art Deco flair. Inside, an old publicity photo is prominently displayed for all to see. Mickey's reflection is visible at the nearly-transparent doors, as is the mirrored image of the bustling street and the various cars speeding by. His silhouette moves purposefully towards the entrance of the theater; as he does so, he continues narrating his story with a steady voice. Mickey walks directly into the movie house. He is clearly visible through the glass doors, which continue to reflect the bustling street and the ongoing traffic outside. He carefully navigates his way through the lobby to enter the actual theater area. Suddenly, the film makes a dramatic shift to the theater's black-and-white screen, where the Marx Brothers, in their classic film Duck Soup, are humorously playing the helmets of several soldiers, standing in a synchronized line like a live xylophone. The film then shifts back once more to the black-and-white screen as Mickey carries on with his narration. The movie cuts back to show Mickey, sitting almost completely obscured in the darkened theater. As Mickey continues speaking, the film once again shifts back to the antics of the Marx Brothers on the black-and-white theater screen. The four comedic brothers are now joyously swaying, singing, and strutting around, their boisterous voices blending indistinctly with Mickey's ongoing narration. The film returns to focus in on Mickey's shadowy form, nestled in the audience. As Mickey continues, the film once more shifts back to the scenes from Duck Soup on the monochrome screen. The Marx Brothers are shown sitting on a judge's bench, energetically playing banjos and singing, harmonizing along with other cast members. They gleefully leap down from the elevated bench, still joyfully singing. The Marx Brothers then kneel down, strumming their banjos with enthusiasm, and the movie cuts back to a picturesque Central Park. They pass by several groups of people, a cluster of buildings resembling majestic castles, and the iconic Manhattan skyline as seen through the dense trees, as the camera gradually moves back, farther and farther, revealing a beautiful Central Park, seemingly frozen in time. The group then gently strolls offscreen. Mavis walks by the table, licking some remnants of food off her hand with casual ease. In the background, Hannah is busily occupied by the stove. As Mavis exits the kitchen, Lee enters, carefully carrying some empty glasses in her hands. Norma walks over to a glass-doored cabinet and retrieves a bottle of gin. Norma unscrews the cap of the liquor bottle and pours some of it into her empty glass, as Hannah pauses her mashing, reacting to this with a glance. The movie leaves the bustling kitchen behind and cuts to the entrance between the dining room and the living room. Two women stand near the partially set dining room table, chatting animatedly while arranging some plates, as Elliot leisurely strolls into view, sipping a drink with a relaxed demeanor."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The film opens with the sudden and dramatic shattering of a mirror. Mickey, who is clutching a rifle, is immediately seen sprinting over to the newly-shattered mirror, possibly to inspect the damage or assess the situation. Just as quickly, he darts offscreen for a moment to attend to the ringing doorbell. Shortly after, he returns into view, breathing heavily and visibly anxious, scanning the living room with urgency. As he narrates over the unfolding scene, the camera occasionally loses sight of him, obstructed by a tree trunk located across the street, while a few taxis casually pass by in the background. The next scene transitions to the exterior of the Metro movie theater, highlighting its distinctive smoked glass entrance doors and striking Art Deco design. Inside, an aged publicity photograph is displayed prominently. Mickey's reflection appears on the nearly transparent doors, alongside the moving reflections of the street's hustle and various cars zipping by. His reflected image approaches the theater entrance as he continues his narrative. He physically enters the movie theater, visible through the glass doors, which still capture the vibrant reflections of the bustling street and traffic outside. He proceeds through the lobby, moving steadily towards the main theater area. In an abrupt cut, the focus shifts to the theater's black-and-white screen, featuring a lively scene from Duck Soup, where the Marx Brothers are humorously using soldiers' helmets as a live xylophone. The scene then flips back to Mickey, seated and almost hidden in the dimly lit theater, continuing his discourse. As Mickey speaks, the film revisits the antics of the Marx Brothers on the theater screen, depicting the four brothers energetically swaying, singing, and strutting, though their voices remain indistinct under Mickey's narration. The camera returns to Mickey's shadowy silhouette in the audience. Concurrently, the film alternates back to Duck Soup on the black-and-white screen, showing the Marx Brothers now perched on a judge's bench, engaging in a playful banjo performance with fellow cast members. They leap down from the bench, maintaining their musical momentum. The Marx Brothers then kneel, still strumming their banjos, as the film transitions to a scenic view of Central Park. The camera pans across people, a cluster of castle-like buildings, and the iconic Manhattan skyline framed by trees, gradually pulling back to reveal Central Park's timeless beauty before the brothers stroll offscreen. Mavis enters the scene, passing a table while licking some food from her hand. In the background, Hannah is actively occupied at the stove. As Mavis exits the kitchen, Lee makes his entrance, carrying several empty glasses. Meanwhile, Norma approaches a glass-doored cabinet, retrieves a bottle of gin, and proceeds to unscrew it, pouring the liquid into her empty glass as Hannah halts her mashing, visibly reacting to the action. The scene leaves the kitchen behind and transitions to the doorway that connects the dining room and the living room. In this space, two women stand near the partially set dining table, engaging in a light-hearted conversation and arranging plates, when Elliot casually strides into the scene, leisurely sipping his drink."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The mirror shatters, and Mickey, holding the rifle, quickly checks the damage before rushing offscreen to answer the door. Returning breathless, he anxiously scans the living room. As he narrates, the scene occasionally shifts to a street view with passing taxis, and then transitions to the exterior of the Metro movie theater, showcasing its Art Deco features. Reflections of Mickey, the street, and passing cars are captured on the theater's glass doors as Mickey continues his story, entering the theater and moving through the lobby into the screening room. The film cuts to the Marx Brothers' antics in Duck Soup on the black-and-white screen, interspersed with shots of a silhouetted Mickey in the audience narrating over the Brothers' indistinct singing and strutting. The scene shifts to Central Park, where the Marx Brothers pass by people, castle-like buildings, and the Manhattan skyline, with the camera drawing back to reveal a timeless park setting. As they exit the frame, the film moves to a kitchen scene where Mavis licks food off her hand while Hannah cooks in the background. Lee enters with empty glasses as Mavis leaves, and Norma retrieves a gin bottle, pouring a drink as Hannah reacts. The focus then shifts to the dining room, where two women chat and set the table, and Elliot appears, sipping a drink."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The mirror shatters with a jarring sound, reminiscent of scenes from classic thrillers where such moments mark pivotal plot points. Mickey, tightly gripping the vintage rifle that he inherited from his grandfather who was a marksman during World War II, is seen running over to the shattered mirror. Mickey runs offscreen briefly to answer the door, where in films of this genre, one might expect an unforeseen and crucial visitor. He returns onscreen, panting from the sprint; he looks frantically once again around the living room, a space filled with eclectic art and furniture that hints at his passion for mid-century modern design. Occasionally, he is obscured by a tree trunk on the opposite side of the street, an oak that's been standing there for over fifty years, adding timeless character to the urban landscape; a few taxis go by as he talks over the scene, the iconic yellow cabs of New York City that symbolize its constant hustle and bustle. The movie cuts to the exterior of the Metro movie theater, a historic venue known in the 1930s for its grandeur and elegance, with its smoked glass entrance doors and its Art Deco feel, reminiscent of the Great Gatsby era. An old publicity photo hangs inside, a black-and-white image of Hollywood stars from the theater's heyday. Mickey's reflection is seen at the almost-transparent doors, as well as the reflection of the street and various cars whizzing by, capturing the perpetual motion of city life. His reflection walks towards the theater entrance; he continues his story, weaving through memories as fluidly as he moves through the crowds. Mickey walks into the movie house, a place that for decades has served as an escape for many into the fantasies of cinema. He is seen through the glass doors, which still reflect the street and traffic outside, a juxtaposition of reality and fiction. He makes his way through the lobby into the actual theater, which has retained its vintage charm despite the passage of time. The film abruptly cuts to the theater's black-and-white screen, where the Marx Brothers, in their timeless comedy Duck Soup, play the helmets of several soldiers standing in a line like a live xylophone, showcasing their signature slapstick humor that has entertained audiences since the 1930s. The film cuts back to the black-and-white movie screen as Mickey continues to talk, narrating a tale full of twists and turns. The movie cuts back to Mickey, sitting almost obscured in the dark theater, his silhouette a mere shadow against the flickering screen. As Mickey talks, the film cuts back to the antics of the Marx Brothers on the black-and-white theater screen, their comedic timing unmatched even today. The four brothers are now swaying and singing and strutting, their voices indistinct over Mickey's narration, yet their exuberant energy visible as always. The film is back on Mickey's dark form in the audience. As Mickey continues, the film cuts back to Duck Soup on the black-and-white screen. The Marx Brothers are sitting on a judge's bench, playing banjos and singing with the other cast members, a scene from the movie that parodies the absurdities of politics. They jump down from the bench, still singing with gleeful irreverence. The Marx Brothers kneel, strumming their banjos, and the movie cuts back to Central Park, New York’s iconic green refuge known for its sprawling lawns and scenic vistas. They pass some people, a cluster of buildings that look like castles, and the Manhattan skyline as seen through the trees, a breathtaking view that has inspired countless filmmakers and photographers, as the camera moves back, farther and farther away from them, showing a beautiful Central Park, frozen in time. They stroll offscreen. Mavis passes the table, licking some food off her hand, likely a nod to the casual, relatable moments of everyday life. Hannah, in the background, is busy by the stove, preparing a meal that fills the room with a comforting aroma. As Mavis leaves the kitchen, Lee enters, carrying some empty glasses, a sign that a gathering has recently concluded. Norma walks over to a glass-doored cabinet and takes out a bottle of gin, a liquor often associated with social rituals and relaxation. Norma unscrews the liquor bottle and pours some into her empty glass as Hannah stops her mashing, reacting as if sensing the beginning of a conversation that goes beyond the small talk. The movie leaves the kitchen and cuts to the doorway between the dining room and the living room. Two women stand by the partially set dining room table, chatting and arranging some plates, an image reminiscent of familial gatherings that evoke nostalgia. Elliot strolls into view, sipping a drink, his casual demeanor suggesting a man used to social gatherings, perhaps the host or a close friend of the family."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He is seen through the glass doors which still reflect the street and traffic outside The mirror shatters The film abruptly cuts to the theater's blackandwhite screen where the Marx Brothers in Duck Soup play the helmets of several soldiers standing in a line like a live xylophone Mickey holding the rifle is seen running over to the shattered mirror Mickey runs offscreen briefly to answer the door He returns onscreen panting he looks frantically once again around the living room Occasionally he is obscured by a tree trunk on the opposite side of the street a few taxis go by as he talks over the scene The movie cuts to the exterior of the Metro movie theater with its smoked glass entrance doors and its Art Deco feel The Marx Brothers kneel strumming their banjos and the movie cuts back to Central Park An old publicity photo hangs inside Mickey's reflection is seen at the almosttransparent doors as well as the reflection of the street and various cars whizzing by His reflection walks towards the theater entrance he looks frantically once again around the living room he continues his story As Mavis leaves the kitchen Lee enters carrying some empty glasses Mickey walks into the movie house He is seen through the glass doors which still reflect the street and traffic outside As Mickey talks the film cuts back to the antics of the Marx Brothers on the blackandwhite theater screen The movie cuts to the exterior of the Metro movie theater with its smoked glass entrance doors and its Art Deco feel He makes his way through the lobby into the actual theater The film abruptly cuts to the theater's blackandwhite screen where the Marx Brothers in Duck Soup play the helmets of several soldiers standing in a line like a live xylophone The film cuts back to the blackandwhite movie screen as Mickey continues to talk The movie cuts back to Mickey sitting almost obscured in the dark theater As Mickey talks the film cuts back to the antics of the Marx Brothers on the blackandwhite theater screen The four brothers are now swaying and singing and strutting their voices indistinct over Mickey's narration The film is back on Mickey's dark form in the audience As Mickey continues the film cuts back to Duck Soup on the blackandwhite screen The Marx Brothers are sitting on a judge's bench playing banjos and singing with the other cast members As Mickey continues the film cuts back to Duck Soup on the blackandwhite screen The movie leaves the kitchen and cuts to the doorway between the dining room and the living room They jump down from the bench still singing The Marx Brothers kneel strumming their banjos and the movie cuts back to Central Park They pass some people a cluster of buildings that look like castles and the Manhattan skyline as seen through the trees as the camera moves back farther and farther away from them showing a beautiful Central Park frozen in time They stroll offscreen Mavis passes the table licking some food off her hand Hannah in the background is busy by the stove As Mavis leaves the kitchen Lee enters carrying some empty glasses Norma walks over to a glassdoored cabinet and takes out a bottle of gin Mickey runs offscreen briefly to answer the door He returns onscreen panting Mickey holding the rifle is seen running over to the shattered mirror Norma unscrews the liquor bottle and pours some into her empty glass a few taxis go by as he talks over the scene He makes his way through the lobby into the actual theater as Hannah stops her mashing reacting The movie leaves the kitchen and cuts to the doorway between the dining room and the living room Two women stand by the partially set dining room table chatting and arranging some plates as Elliot strolls into view sipping a drink Two women stand by the partially set dining room table chatting and arranging some plates They jump down from the bench still singing The movie cuts back to Mickey sitting almost obscured in the dark theater The mirror shatters"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The mirror shatters. Mickey holding the rifle is seen running over to the shattered mirror. Mickey runs offscreen briefly to answer the door. He returns onscreen panting. he looks frantically once again around the living room. Occasionally he is obscured by a tree trunk on the opposite side of the street. a few taxis go by as he talks over the scene. The movie cuts to the exterior of the Metro movie theater with its smoked glass entrance doors and its Art Deco feel. An old publicity photo hangs inside. Mickey's reflection is seen at the almosttransparent doors as well as the reflection of the street and various cars whizzing by. His reflection walks towards the theater entrance. he continues his story. Mickey walks into the movie house. He is seen through the glass doors which still reflect the street and traffic outside. He makes his way through the lobby into the actual theater. The film abruptly cuts to the theater's blackandwhite screen where the Marx Brothers in Duck Soup play the helmets of several soldiers standing in a line like a live xylophone. The film cuts back to the blackandwhite movie screen as Mickey continues to talk. The movie cuts back to Mickey sitting almost obscured in the dark theater. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. As Mickey talks the film cuts back to the antics of the Marx Brothers on the blackandwhite theater screen. The four brothers are now swaying and singing and strutting their voices indistinct over Mickey's narration. The film is back on Mickey's dark form in the audience. As Mickey continues the film cuts back to Duck Soup on the blackandwhite screen. The Marx Brothers are sitting on a judge's bench playing banjos and singing with the other cast members. They jump down from the bench still singing. The Marx Brothers kneel strumming their banjos and the movie cuts back to Central Park. They pass some people a cluster of buildings that look like castles and the Manhattan skyline as seen through the trees as the camera moves back farther and farther away from them showing a beautiful Central Park frozen in time. They stroll offscreen. Mavis passes the table licking some food off her hand. Hannah in the background is busy by the stove. As Mavis leaves the kitchen Lee enters carrying some empty glasses. Norma walks over to a glassdoored cabinet and takes out a bottle of gin. Norma unscrews the liquor bottle and pours some into her empty glass. as Hannah stops her mashing reacting. The movie leaves the kitchen and cuts to the doorway between the dining room and the living room. Two women stand by the partially set dining room table chatting and arranging some plates. as Elliot strolls into view sipping a drink."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The mirror shatters. Mickey holding the rifle is seen running over to the shattered mirror. Mickey runs offscreen briefly to answer the door. He returns onscreen panting. he looks frantically once again around the living room. Occasionally he is obscured by a tree trunk on the opposite side of the street. a few taxis go by as he talks over the scene. The movie cuts to the exterior of the Metro movie theater with its smoked glass entrance doors and its Art Deco feel. An old publicity photo hangs inside. Mickey's reflection is seen at the almosttransparent doors as well as the reflection of the street and various cars whizzing by. His reflection walks towards the theater entrance. he continues his story. Mickey walks into the movie house. He is seen through the glass doors which still reflect the street and traffic outside. He makes his way through the lobby into the actual theater. The film abruptly cuts to the theater's blackandwhite screen where the Marx Brothers in Duck Soup play the helmets of several soldiers standing in a line like a live xylophone. The film cuts back to the blackandwhite movie screen as Mickey continues to talk. The movie cuts back to Mickey sitting almost obscured in the dark theater. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. As Mickey talks the film cuts back to the antics of the Marx Brothers on the blackandwhite theater screen. The four brothers are now swaying and singing and strutting their voices indistinct over Mickey's narration. The film is back on Mickey's dark form in the audience. As Mickey continues the film cuts back to Duck Soup on the blackandwhite screen. The Marx Brothers are sitting on a judge's bench playing banjos and singing with the other cast members. They jump down from the bench still singing. The Marx Brothers kneel strumming their banjos and the movie cuts back to Central Park. They pass some people a cluster of buildings that look like castles and the Manhattan skyline as seen through the trees as the camera moves back farther and farther away from them showing a beautiful Central Park frozen in time. They stroll offscreen. Mavis passes the table licking some food off her hand. Hannah in the background is busy by the stove. As Mavis leaves the kitchen Lee enters carrying some empty glasses. Norma walks over to a glassdoored cabinet and takes out a bottle of gin. Norma unscrews the liquor bottle and pours some into her empty glass. as Hannah stops her mashing reacting. The movie leaves the kitchen and cuts to the doorway between the dining room and the living room. Two women stand by the partially set dining room table chatting and arranging some plates. as Elliot strolls into view sipping a drink."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The mirror shatters. Mickey holding the rifle is seen running over to the shattered mirror. Mickey runs offscreen briefly to answer the door. He returns onscreen panting. he looks frantically once again around the living room. Occasionally he is obscured by a tree trunk on the opposite side of the street. a few taxis go by as he talks over the scene. The movie cuts to the exterior of the Metro movie theater with its smoked glass entrance doors and its Art Deco feel. An old publicity photo hangs inside. Mavis passes the table licking some food off her hand. Hannah in the background is busy by the stove. As Mavis leaves the kitchen Lee enters carrying some empty glasses. Norma walks over to a glassdoored cabinet and takes out a bottle of gin. Norma unscrews the liquor bottle and pours some into her empty glass. as Hannah stops her mashing reacting. The movie leaves the kitchen and cuts to the doorway between the dining room and the living room. Two women stand by the partially set dining room table chatting and arranging some plates. as Elliot strolls into view sipping a drink."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The mirror shatters. Mickey holding the rifle is seen running over to the shattered mirror. Mickey runs offscreen briefly to answer the door. He returns onscreen panting. as Hannah stops her mashing reacting. The movie leaves the kitchen and cuts to the doorway between the dining room and the living room. Two women stand by the partially set dining room table chatting and arranging some plates. as Elliot strolls into view sipping a drink."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The mirror shatters. A pelican, holding the rifle, is seen running over to the shattered mirror. The pelican runs offscreen briefly to answer the door. The pelican returns onscreen, panting; the pelican looks frantically once again around the living room. Occasionally, the pelican is obscured by a tree trunk on the opposite side of the street; a few taxis go by as the pelican talks over the scene. The movie cuts to the exterior of the Metro movie theater, with its smoked glass entrance doors and its Art Deco feel. An old publicity photo hangs inside. The pelican's reflection is seen at the almost-transparent doors, as well as the reflection of the street and various cars whizzing by. The pelican's reflection walks towards the theater entrance; the pelican continues its story. The pelican walks into the movie house. The pelican is seen through the glass doors, which still reflect the street and traffic outside. The pelican makes its way through the lobby into the actual theater. The film abruptly cuts to the theater's black-and-white screen, where the Marx Brothers, in Duck Soup, play the helmets of several soldiers standing in a line like a live xylophone. The film cuts back to the black-and-white movie screen as the pelican continues to talk. The movie cuts back to the pelican, sitting almost obscured in the dark theater. As the pelican talks, the film cuts back to the antics of the Marx Brothers on the black-and-white theater screen. The four brothers are now swaying and singing and strutting, their voices indistinct over the pelican's narration. The film is back on the pelican's dark form in the audience. As the pelican continues, the film cuts back to Duck Soup on the black-and-white screen. The Marx Brothers are sitting on a judge's bench, playing banjos and singing with the other cast members. They jump down from the bench, still singing. The Marx Brothers kneel, strumming their banjos, and the movie cuts back to Central Park. They pass some people, a cluster of buildings that look like castles, and the Manhattan skyline as seen through the trees, as the camera moves back, farther and farther away from them, showing a beautiful Central Park, frozen in time. They stroll offscreen. A rabbit passes the table, licking some food off its hand. A kangaroo, in the background, is busy by the stove. As the rabbit leaves the kitchen, a dolphin enters, carrying some empty glasses. A giraffe walks over to a glass-doored cabinet and takes out a bottle of gin. The giraffe unscrews the liquor bottle and pours some into its empty glass as the kangaroo stops her mashing, reacting. The movie leaves the kitchen and cuts to the doorway between the dining room and the living room. Two parrots stand by the partially set dining room table, chatting and arranging some plates, as a penguin strolls into view, sipping a drink."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The vase shatters. Mickey, holding the skateboard, is seen running over to the shattered vase. Mickey runs offscreen briefly to answer the gate. He returns onscreen, panting; he looks frantically once again around the garden. Occasionally, he is obscured by a billboard on the opposite side of the street; a few bicycles go by as he talks over the scene. The movie cuts to the exterior of the Royal opera house, with its stained glass entrance doors and its Gothic feel. An old publicity pamphlet hangs inside. Mickey's reflection is seen at the almost-transparent doors, as well as the reflection of the street and various motorcycles whizzing by. His reflection walks towards the opera house entrance; he continues his story. Mickey walks into the concert hall. He is seen through the glass doors, which still reflect the street and traffic outside. He makes his way through the lobby into the actual auditorium. The film abruptly cuts to the auditorium's sepia-toned screen, where the Marx Brothers, in Duck Soup, play the shields of several soldiers standing in a line like a live steel drum. The film cuts back to the sepia-toned movie screen as Mickey continues to talk. The movie cuts back to Mickey, sitting almost obscured in the dim auditorium. As Mickey talks, the film cuts back to the antics of the Marx Brothers on the sepia-toned theater screen. The four brothers are now swaying and singing and strutting, their voices indistinct over Mickey's narration. The film is back on Mickey's dark form in the audience. As Mickey continues, the film cuts back to Duck Soup on the sepia-toned screen. The Marx Brothers are sitting on a lifeguard's chair, playing violins and singing with the other cast members. They jump down from the chair, still singing. The Marx Brothers kneel, strumming their violins, and the movie cuts back to Hyde Park. They pass some animals, a cluster of buildings that look like mansions, and the London skyline as seen through the trees, as the camera moves back, farther and farther away from them, showing a beautiful Hyde Park, frozen in time. They stroll offscreen. Mavis passes the counter, licking some jam off her hand. Hannah, in the background, is busy by the grill. As Mavis leaves the pantry, Lee enters, carrying some empty bowls. Norma walks over to a glass-doored cabinet and takes out a bottle of soda. Norma unscrews the soda bottle and pours some into her empty bowl as Hannah stops her frying, reacting. The movie leaves the pantry and cuts to the doorway between the drawing room and the study. Two women stand by the partially set drawing room table, chatting and arranging some cups, as Elliot strolls into view, sipping a cocktail."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The mirror gleams. Mickey, holding the rifle, is seen dancing over to the gleaming mirror. Mickey hops offscreen briefly to paint the door. He returns onscreen, laughing; he searches meticulously once again around the living room. Occasionally, he is disguised by a tree trunk on the opposite side of the street; a few taxis drift by as he whispers over the scene. The movie shifts to the exterior of the Metro movie theater, with its polished glass entrance doors and its Art Deco facade. An old publicity photo rests inside. Mickey's reflection is seen at the almost-transparent doors, as well as the reflection of the street and various cars floating by. His reflection strolls towards the theater entrance; he interrupts his story. Mickey skips into the movie house. He is seen through the glass doors, which still reflect the street and traffic outside. He glides his way through the lobby into the actual theater. The film gradually cuts to the theater's black-and-white screen, where the Marx Brothers, in Duck Soup, juggle the helmets of several soldiers standing in a line like a live orchestra. The film shifts back to the black-and-white movie screen as Mickey pauses to listen. The movie returns back to Mickey, sitting almost hidden in the dark theater. As Mickey listens, the film shifts back to the antics of the Marx Brothers on the black-and-white theater screen. The four brothers are now dancing and whispering and tiptoeing, their voices indistinct over Mickey's narration. The film is back on Mickey's dark form in the audience. As Mickey listens, the film shifts back to Duck Soup on the black-and-white screen. The Marx Brothers are sitting on a judge's bench, juggling banjos and whispering with the other cast members. They climb down from the bench, still whispering. The Marx Brothers sit, balancing their banjos, and the movie shifts back to Central Park. They glide past some people, a cluster of buildings that look like castles, and the Manhattan skyline as seen through the trees, as the camera rolls back, farther and farther away from them, showing a beautiful Central Park, frozen in time. They glide offscreen. Mavis skips past the table, nibbling some food off her hand. Hannah, in the background, is sketching by the stove. As Mavis twirls out of the kitchen, Lee strolls in, rearranging some empty glasses. Norma pirouettes over to a glass-doored cabinet and picks up a bottle of gin. Norma shakes the liquor bottle and sprinkles some into her empty glass as Hannah pauses her humming, reacting. The movie drifts out of the kitchen and shifts to the doorway between the dining room and the living room. Two women sway by the partially set dining room table, gesturing and inspecting some plates, as Elliot dances into view, juggling a drink."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The window disintegrates. Oliver, clutching the trumpet, is seen sprinting over to the broken window. Oliver darts offscreen briefly to open the gate. He reappears onscreen, gasping; he glances wildly once again around the bathroom. Occasionally, he is concealed by a lamppost on the opposite side of the highway; a few bicycles roll by as he narrates over the setting. The video transitions to the outside of the Opera concert hall, with its frosted wooden entryways and its Bauhaus flavor. An ancient advertisement poster hangs inside. Oliver's silhouette is seen at the nearly-invisible entryways, as well as the outline of the avenue and various motorbikes zipping by. His silhouette moves towards the concert hall entry; he continues his tale. Oliver steps into the concert venue. He is observed through the wooden doors, which still outline the avenue and commotion outside. He navigates through the foyer into the main concert area. The film suddenly shifts to the venue's monochrome display, where the Three Stooges, in Animal Crackers, strike the helmets of several officers lined up like a live marimba. The film switches back to the monochrome screen as Oliver keeps narrating. The movie returns to Oliver, sitting almost hidden in the dim concert hall. As Oliver narrates, the film switches back to the humor of the Three Stooges on the monochrome venue screen. The three stooges are now gliding and chanting and pirouetting, their voices indistinct over Oliver's voiceover. The film returns to Oliver's dim outline in the audience. As Oliver proceeds, the film switches back to Animal Crackers on the monochrome display. The Three Stooges are perched on a referee's bench, strumming guitars and chanting with the other performers. They leap off the bench, still chanting. The Three Stooges crouch, plucking their guitars, and the movie transitions back to Green Park. They pass some animals, a cluster of mountains that look like fortresses, and the Brooklyn skyline as seen through the branches, as the camera retreats, farther and farther away from them, displaying a stunning Green Park, captured in essence. They wander offscreen. Beatrice passes the chair, nibbling some fruit off her fingers. Karen, in the background, is engaged by the oven. As Beatrice exits the kitchen, Alex arrives, holding some full bowls. Sophie walks over to a wooden-shelved closet and retrieves a bag of flour. Sophie opens the flour bag and sprinkles some into her full bowl as Karen halts her chopping, reacting. The film exits the kitchen and transitions to the hallway between the study and the parlor. Two men stand by the half-set study table, conversing and arranging some cups, as Martin meanders into view, sipping a beverage."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The window collapses. Charlie, clutching the umbrella, is observed cycling over to the broken window. Charlie cycles offscreen briefly to greet the guest. He returns onscreen, breathing heavily; he peers cautiously once again around the dining room. Occasionally, he is concealed by a lamppost on the opposite side of the avenue; a few bicycles fly by as he whispers over the scene. The video transitions to the exterior of the Opera house, with its frosted glass entrance doors and its Gothic design. An antique brochure hangs outside. Charlie's silhouette is seen at the almost-invisible doors, as well as the silhouette of the avenue and various bicycles zooming past. His silhouette glides towards the opera entrance; he concludes his tale. Charlie glides into the opera house. He is perceived through the glass doors, which still reflect the avenue and bicycle traffic outside. He meanders his way through the foyer into the actual hall. The video suddenly switches to the hall's black-and-white stage, where the Three Stooges, in Duck Soup, juggle the trombones of several musicians standing in a row like a live marimba. The video switches back to the black-and-white stage as Charlie continues to murmur. The video reverts to Charlie, seated almost concealed in the dim hall. As Charlie whispers, the video switches back to the antics of the Three Stooges on the black-and-white hall stage. The trio now twist and chant and prance, their utterances indistinct over Charlie's commentary. The video focuses again on Charlie's dim figure in the attendees. As Charlie continues, the video switches back to Duck Soup on the black-and-white stage. The Three Stooges are perched on a lawyer's stand, strumming guitars and chanting with the other performers. They leap down from the stand, still chanting. The Three Stooges crouch, plucking their guitars, and the video switches back to Riverside Park. They glide past some animals, a collection of monuments that resemble towers, and the Brooklyn skyline as glimpsed through the foliage, as the camera retracts, farther and farther away from them, presenting a stunning Riverside Park, trapped in time. They glide offscreen. Macy passes the bench, nibbling some dessert off her finger. Sarah, in the background, is occupied by the fridge. As Macy exits the kitchen, Neil steps in, balancing some empty bottles. Paula strides over to a glass-paned cupboard and fetches a bottle of tequila. Paula cracks the tequila bottle open and spills some into her vacant glass as Sarah halts her kneading, responding. The video exits the kitchen and transitions to the archway between the parlor and the drawing room. Two men stand by the partially set parlor table, conversing and arranging some bowls, as Oscar jogs into view, nibbling a snack."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The window splinters. Mickey, grasping the violin, is seen leaping over to the splintered window. Mickey skips offscreen briefly to greet the elevator. He returns onscreen, gasping; he gazes frantically once again around the library. Occasionally, he is obscured by a lamppost on the opposite side of the highway; a few bicycles cruise by as he whispers over the scene. The video shifts to the exterior of the Metro music hall, with its stained wooden gate and its Victorian vibe. An ancient announcement flyer dangles inside. Mickey's silhouette is observed at the nearly-invisible gate, as well as the silhouette of the avenue and assorted wagons zipping by. His silhouette dances towards the music hall gate; he continues his monologue. Mickey skips into the music area. He is seen through the wooden gate, which still mirrors the avenue and convoy outside. He skips through the corridor into the actual hall. The reel suddenly shifts to the hall's monochrome screen, where the Marx Brothers, in Duck Soup, beat the drums of several chefs standing in a queue like a live harmonica. The reel shifts back to the monochrome television screen as Mickey continues to whisper. The video shifts back to Mickey, seated almost concealed in the dim hall. As Mickey whispers, the reel shifts back to the antics of the Marx Brothers on the monochrome hall screen. The four brothers are now gliding and humming and waltzing, their whispers indistinct over Mickey's monologue. The reel is back on Mickey's dim figure in the audience. As Mickey continues, the reel shifts back to Duck Soup on the monochrome screen. The Marx Brothers are lounging on a musician's stage, plucking harps and humming with the other crew members. They slide down from the stage, still humming. The Marx Brothers bow, strumming their harps, and the video shifts back to Golden Gate Park. They glide past some cyclists, a brigade of towers that resemble palaces, and the San Francisco skyline as observed through the bushes, as the camera pans back, farther and farther away from them, displaying a picturesque Golden Gate Park, captured in eternity. They skip offscreen. Mavis passes the bench, nibbling some fruit off her finger. Hannah, in the backdrop, is occupied by the oven. As Mavis exits the pantry, Lee enters, lugging some full mugs. Norma ambles over to a wooden-doored wardrobe and extracts a flask of tonic. Norma uncaps the refreshment flask and spills some into her full mug as Hannah halts her baking, reacting. The video exits the pantry and shifts to the archway between the drawing room and the library. Two women stand by the partly arranged drawing room bench, giggling and stacking some bowls, as Elliot strides into view, munching a snack."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The vase explodes. Felix, clutching the umbrella, is spotted skipping over to the exploded vase. Felix skips offscreen temporarily to open the window. He reappears onscreen, sweating; he gazes anxiously once more around the bedroom. Occasionally, he is hidden by a lamppost on the adjacent sidewalk; several bicycles roll past as he whispers throughout the scene. The cartoon switches to the exterior of the Luna opera house, with its frosted stone entryway and its Victorian charm. A vintage magazine clipping hangs outside. Felix's silhouette is seen at the semi-opaque entryway, as well as the silhouette of the avenue and various buses zooming past. His silhouette strides towards the opera portal; he continues his tale. Felix strides into the opera dome. He is glimpsed through the stone entryway, which still mirrors the avenue and bicycles beyond. He navigates his path through the corridor into the actual dome. The cartoon suddenly shifts to the dome's sepia-toned banner, where the Looney Tunes, in Rabbit Seasoning, juggle the helmets of several sailors standing in a row like a vibrant piano. The cartoon shifts back to the sepia-toned banner as Felix continues to whisper. The cartoon shifts back to Felix, seated nearly hidden in the shaded dome. As Felix whispers, the cartoon shifts back to the escapades of the Looney Tunes on the sepia-toned banner. The four toons are now twirling and chanting and prancing, their tones muffled under Felix's tale. The cartoon focuses again on Felix's shadowed silhouette in the crowd. As Felix continues, the cartoon shifts back to Rabbit Seasoning on the sepia-toned banner. The Looney Tunes are perched on a magistrate's railing, juggling ukuleles and chanting with the other crew members. They leap off the railing, still chanting. The Looney Tunes kneel, strumming their ukuleles, and the cartoon shifts back to Hyde Park. They pass a few creatures, a cluster of spires that resemble fortresses, and the Brooklyn horizon as glimpsed through the shrubbery, as the camera retreats, further and further from them, revealing a stunning Hyde Park, frozen in history. They saunter offscreen. Miranda brushes the counter, nibbling some candy off her thumb. Greta, in the background, is busy by the oven. As Miranda exits the pantry, Mark wanders in, clutching some empty jars. Laura tiptoes over to a wooden-shelved cupboard and retrieves a jar of honey. Laura twists open the honey jar and drizzles some into her vacant jar as Greta pauses her stirring, responding. The cartoon exits the pantry and shifts to the entryway between the study and the parlor. Two men linger by the partially arranged study table, murmuring and placing some forks, as Oscar shuffles into view, tasting a brew."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The mirror shatters as Mickey, holding a rifle, runs to it. He briefly leaves to answer the door, returns, and scans the living room. Occasionally obscured by a tree, Mickey narrates over a scene of taxis passing. The film transitions to the Metro theater's exterior, with Mickey's reflection visible in its glass doors. He enters the theater, walks through the lobby, and into the auditorium while continuing his story. The screen shows the Marx Brothers’ \"Duck Soup,\" and cuts between the movie and Mickey in the dark theater. The Marx Brothers' antics play out as Mickey narrates, with scenes shifting back to Central Park and its timeless beauty. Meanwhile, Mavis licks her hand in the kitchen, Hannah is by the stove, Lee enters with glasses, and Norma pours gin, reacting to Hannah's actions. The scene cuts to two women arranging plates at a dining table, chatting as Elliot appears drinking."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "as Elliot strolls into view sipping a drink Two women stand by the partially set dining room table chatting and arranging some plates The movie leaves the kitchen and cuts to the doorway between the dining room and the living room as Hannah stops her mashing reacting Norma unscrews the liquor bottle and pours some into her empty glass Norma walks over to a glassdoored cabinet and takes out a bottle of gin As Mavis leaves the kitchen Lee enters carrying some empty glasses Hannah in the background is busy by the stove Mavis passes the table licking some food off her hand They stroll offscreen They pass some people a cluster of buildings that look like castles and the Manhattan skyline as seen through the trees as the camera moves back farther and farther away from them showing a beautiful Central Park frozen in time The Marx Brothers kneel strumming their banjos and the movie cuts back to Central Park They jump down from the bench still singing The Marx Brothers are sitting on a judge's bench playing banjos and singing with the other cast members As Mickey continues the film cuts back to Duck Soup on the blackandwhite screen The film is back on Mickey's dark form in the audience The four brothers are now swaying and singing and strutting their voices indistinct over Mickey's narration As Mickey talks the film cuts back to the antics of the Marx Brothers on the blackandwhite theater screen The movie cuts back to Mickey sitting almost obscured in the dark theater The film cuts back to the blackandwhite movie screen as Mickey continues to talk The film abruptly cuts to the theater's blackandwhite screen where the Marx Brothers in Duck Soup play the helmets of several soldiers standing in a line like a live xylophone He makes his way through the lobby into the actual theater He is seen through the glass doors which still reflect the street and traffic outside Mickey walks into the movie house he continues his story His reflection walks towards the theater entrance Mickey's reflection is seen at the almosttransparent doors as well as the reflection of the street and various cars whizzing by An old publicity photo hangs inside The movie cuts to the exterior of the Metro movie theater with its smoked glass entrance doors and its Art Deco feel a few taxis go by as he talks over the scene Occasionally he is obscured by a tree trunk on the opposite side of the street he looks frantically once again around the living room He returns onscreen panting Mickey runs offscreen briefly to answer the door Mickey holding the rifle is seen running over to the shattered mirror The mirror shatters"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Mickey's reflection is seen at the almosttransparent doors as well as the reflection of the street and various cars whizzing by Mickey walks into the movie house Occasionally he is obscured by a tree trunk on the opposite side of the street Mavis passes the table licking some food off her hand as Hannah stops her mashing reacting The four brothers are now swaying and singing and strutting their voices indistinct over Mickey's narration Norma walks over to a glassdoored cabinet and takes out a bottle of gin They pass some people a cluster of buildings that look like castles and the Manhattan skyline as seen through the trees as the camera moves back farther and farther away from them showing a beautiful Central Park frozen in time The Marx Brothers are sitting on a judge's bench playing banjos and singing with the other cast members They stroll offscreen Norma unscrews the liquor bottle and pours some into her empty glass His reflection walks towards the theater entrance he continues his story Hannah in the background is busy by the stove An old publicity photo hangs inside The film is back on Mickey's dark form in the audience The film cuts back to the blackandwhite movie screen as Mickey continues to talk as Elliot strolls into view sipping a drink a few taxis go by as he talks over the scene The Marx Brothers kneel strumming their banjos and the movie cuts back to Central Park The mirror shatters Two women stand by the partially set dining room table chatting and arranging some plates He is seen through the glass doors which still reflect the street and traffic outside As Mickey talks the film cuts back to the antics of the Marx Brothers on the blackandwhite theater screen Mickey runs offscreen briefly to answer the door The movie leaves the kitchen and cuts to the doorway between the dining room and the living room As Mavis leaves the kitchen Lee enters carrying some empty glasses As Mickey continues the film cuts back to Duck Soup on the blackandwhite screen He returns onscreen panting They jump down from the bench still singing he looks frantically once again around the living room He makes his way through the lobby into the actual theater The film abruptly cuts to the theater's blackandwhite screen where the Marx Brothers in Duck Soup play the helmets of several soldiers standing in a line like a live xylophone The movie cuts back to Mickey sitting almost obscured in the dark theater Mickey holding the rifle is seen running over to the shattered mirror The movie cuts to the exterior of the Metro movie theater with its smoked glass entrance doors and its Art Deco feel"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "As Mickey talks the film cuts back to the antics of the Marx Brothers on the blackandwhite theater screen The four brothers are now swaying and singing and strutting their voices indistinct over Mickey's narration The film is back on Mickey's dark form in the audience As Mickey continues the film cuts back to Duck Soup on the blackandwhite screen The Marx Brothers are sitting on a judge's bench playing banjos and singing with the other cast members They jump down from the bench still singing The Marx Brothers kneel strumming their banjos and the movie cuts back to Central Park They pass some people a cluster of buildings that look like castles and the Manhattan skyline as seen through the trees as the camera moves back farther and farther away from them showing a beautiful Central Park frozen in time They stroll offscreen Mavis passes the table licking some food off her hand Hannah in the background is busy by the stove As Mavis leaves the kitchen Lee enters carrying some empty glasses Norma walks over to a glassdoored cabinet and takes out a bottle of gin Norma unscrews the liquor bottle and pours some into her empty glass as Hannah stops her mashing reacting The movie leaves the kitchen and cuts to the doorway between the dining room and the living room Two women stand by the partially set dining room table chatting and arranging some plates as Elliot strolls into view sipping a drink The mirror shatters Mickey holding the rifle is seen running over to the shattered mirror Mickey runs offscreen briefly to answer the door He returns onscreen panting he looks frantically once again around the living room Occasionally he is obscured by a tree trunk on the opposite side of the street a few taxis go by as he talks over the scene The movie cuts to the exterior of the Metro movie theater with its smoked glass entrance doors and its Art Deco feel An old publicity photo hangs inside Mickey's reflection is seen at the almosttransparent doors as well as the reflection of the street and various cars whizzing by His reflection walks towards the theater entrance he continues his story Mickey walks into the movie house He is seen through the glass doors which still reflect the street and traffic outside He makes his way through the lobby into the actual theater The film abruptly cuts to the theater's blackandwhite screen where the Marx Brothers in Duck Soup play the helmets of several soldiers standing in a line like a live xylophone The film cuts back to the blackandwhite movie screen as Mickey continues to talk The movie cuts back to Mickey sitting almost obscured in the dark theater"
        }
      ]
    }
  ]
}