{
  "ground_truth": "Lamps hang down from the ceiling as classical music still plays in the background. Lee stops at a plastic-enclosed work area, where Frederick can be seen working at a drawing board on the other side of the clear plastic screen. As Lee walks over to the drawing board where Frederick is sitting, he is seen intently cleaning some paintbrushes with a rag. Lee stands by him, leaning over the board, and looks directly at him. The table is filled with cans of brushes and artist's equipment. Frederick and Lee embrace; Lee sighs. Lee kisses Frederick twice, then releases him and walks out of the work area. Lee walks over to the loft's stereo area, pulling up the sleeves of her sweater as Frederick talks. Lee picks up a book from the stereo shelf and leans back against the unit, glancing through its pages. Frederick, leaving his work area, walks past Lee with his hands in his pockets. The camera stays with Frederick as he walks into the loft's bedroom area. He sits down at the foot of the bed and starts taking off his shoes. Lee sits down next to Frederick; he takes her hand. Lee kisses Frederick back on the cheek, and they embrace. Frederick laughs; their embrace gets tighter. Without missing a beat, he takes Mary's wrist and continues walking. As the group walks through a large doorway, Larry catches up to Mickey. The group turns right into a new corridor, briefly off the screen. As the group briskly walks past an open door, Gail, another assistant, runs out, brandishing her glasses. The fast-tracking group turns the corner as Gail pats Mickey's back and gestures in exasperation. Mickey is interrupted by Ed Smythe, an official from the Standards and Practices Department, who's been standing in the corridor waiting for Mickey. Mickey stops and shakes Ed's hand as if he'd known the official would be there. Gail stops by his side while the others walk into a background studio doorway that is busy with scurrying personnel. A writer, holding a script, walks out of the background studio, looking around. Mickey and Gail walk over to the angry writer, Ed forgotten with this new crisis. Mickey, Gail, and the writer start walking down a corridor adjacent to the studio. The writer reacts angrily as Gail tries to get Mickey's attention while they walk. Mickey, still in surprised shock, turns away from the angry writer and stands by an open dressing room, where Ron, an actor, slouches, dazed, in a chair facing a makeup mirror. People mill in the background behind the actor as Mickey, remembering Ron, runs into the dressing room with Gail following him. Inside, a man and a woman talk, ignoring Ron as they share a drink in a paper cup.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Luminaires dangle down from the roof as traditional melody still performs in the backdrop. Lee pauses at a polymer-enclosed task zone, where Frederick can be observed laboring at a drafting table on the opposite side of the transparent polymer barrier. As Lee strolls over to the drafting table where Frederick is seated, he is noticed meticulously scrubbing some paintbrushes with a cloth. Lee stands by him, bending over the table, and gazes directly at him. The surface is crowded with tins of brushes and artist's tools. Frederick and Lee hug; Lee exhales. Lee kisses Frederick twice, then frees him and strides out of the task zone. Lee proceeds over to the loft's sound area, rolling up the sleeves of her pullover as Frederick speaks. Lee picks up a volume from the sound rack and reclines against the unit, skimming through its sheets. Frederick, departing his task zone, strolls past Lee with his hands in his pockets. The camera remains with Frederick as he proceeds into the loft's sleeping space. He positions himself at the base of the bed and initiates removing his footwear. Lee positions herself next to Frederick; he grasps her hand. Lee kisses Frederick again on the cheek, and they hug. Frederick chuckles; their hug becomes firmer. Without missing a beat, he takes Mary's wrist and continues strolling. As the group moves through a sizable entryway, Larry catches up to Mickey. The group rotates right into a new hallway, briefly off the screen. As the group rapidly moves past an open portal, Gail, another aide, runs out, brandishing her spectacles. The rapidly-moving group turns the angle as Gail pats Mickey's back and signals in frustration. Mickey is interrupted by Ed Smythe, an official from the Standards and Practices Division, who's been waiting in the hallway for Mickey. Mickey pauses and shakes Ed's hand as if he'd known the official would be there. Gail pauses by his side while the others enter a backdrop studio entrance that is busy with hurrying personnel. A writer, clutching a manuscript, exits the backdrop studio, glancing around. Mickey and Gail proceed over to the irate writer, Ed forgotten with this new dilemma. Mickey, Gail, and the writer commence walking down a passage adjacent to the studio. The writer reacts angrily as Gail attempts to gain Mickey's attention while they stroll. Mickey, still in astonished shock, turns away from the irate writer and stands by an open dressing room, where Ron, an actor, slouches, dazed, in a chair facing a makeup mirror. People mill in the background behind the actor as Mickey, recalling Ron, rushes into the dressing room with Gail trailing him. Inside, a man and a woman converse, ignoring Ron as they share a drink in a paper cup."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Down from the ceiling, lamps are hung as classical music is still played in the background. A stop is made by Lee at a plastic-enclosed work area, where they see Frederick working at a drawing board on the other side of the clear plastic screen. As the drawing board is approached by Lee, where Frederick is sitting, he intently cleans some paintbrushes with a rag. By him stands Lee, leaning over the board, and looks directly at him. The table is filled with cans of brushes and artist's equipment. An embrace is shared by Frederick and Lee; a sigh is let out by Lee. Frederick is kissed twice by Lee, who then releases him and walks out of the work area. The loft’s stereo area is walked over to by Lee, who pulls up the sleeves of her sweater as Frederick talks. A book is picked up by Lee from the stereo shelf, and she leans back against the unit, glancing through its pages. Leaving his work area, Frederick walks past Lee with his hands in his pockets. The camera follows Frederick as he walks into the loft's bedroom area. He sits down at the foot of the bed and begins taking off his shoes. Lee sits down next to Frederick; her hand is taken by him. Lee kisses Frederick back on the cheek, and they embrace. A laugh is let out by Frederick; their embrace gets tighter. Without missing a beat, Mary's wrist is taken by him, and he continues walking. As the group walks through a large doorway, Larry catches up to Mickey. The group turns right into a new corridor, briefly off the screen. As the group briskly walks past an open door, another assistant, Gail, runs out, brandishing her glasses. The corner is turned by the fast-tracking group as Gail pats Mickey's back and gestures in exasperation. Mickey is interrupted by Ed Smythe, an official from the Standards and Practices Department, who waits for Mickey in the corridor. Mickey stops and shakes Ed's hand as if he’d known the official would be there. By his side, Gail stops while the others walk into a background studio doorway that is busy with scurrying personnel. Out of the background studio, a writer walks, holding a script and looking around. Mickey and Gail walk over to the angry writer, with Ed forgotten amidst this new crisis. Down a corridor adjacent to the studio, Mickey, Gail, and the writer start walking. As Gail tries to get Mickey's attention while they walk, the writer reacts angrily. Still in surprised shock, Mickey turns away from the angry writer and stands by an open dressing room, where Ron, an actor, slouches, dazed, in a chair facing a makeup mirror. People mill in the background behind the actor as Mickey, remembering Ron, runs into the dressing room with Gail following him. Inside, a conversation is held by a man and a woman, who ignore Ron as they share a drink in a paper cup."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Lamps hang from the ceiling as classical music plays. Lee stops at a plastic-enclosed area, watching Frederick work at a drawing board behind a clear screen. Approaching Frederick, who cleans brushes with a rag, Lee leans over the board. The table is cluttered with brushes and art tools. They embrace, Lee kisses Frederick twice, then leaves. Lee goes to the stereo, rolls up her sweater sleeves, picks a book, and browses it. Frederick exits his work area, passing Lee, and moves to the bedroom, sits, and removes his shoes. Lee joins him, they hold hands, kiss on the cheek, and embrace tighter as Frederick laughs. Without pause, he takes Mary's wrist, continuing through a doorway. Larry catches up to Mickey as the group enters a new corridor. Passing an open door, Gail runs out with her glasses, patting Mickey's back and gesturing. Mickey meets Ed Smythe, an official from Standards and Practices, and shakes his hand knowingly. Gail stays by Mickey as others enter a busy studio doorway. A writer exits, holding a script and looking around. Mickey and Gail approach the upset writer, forgetting Ed. They walk down a studio-adjacent corridor as Gail tries to get Mickey's attention. Mickey, shocked by the writer, turns to an open dressing room where Ron, an actor, slouches in front of a mirror. Mickey rushes in, remembering Ron, with Gail following. Inside, a man and woman chat, ignoring Ron as they share a drink."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Lamps hang from the ceiling with classical music playing. Lee stops at a plastic-enclosed work area, where Frederick works at a drawing board behind a clear screen. Lee approaches, finds Frederick cleaning brushes, and looks at him. The table holds artist's supplies. They embrace and Lee kisses Frederick twice before leaving. Lee moves to the stereo, rolls up her sleeves, picks a book, and reads. Frederick walks to the bedroom area, sits on the bed, and removes his shoes. Lee sits beside him, they hold hands and kiss. Frederick laughs, their embrace tightens. Without pause, he takes Mary's wrist, and the group enters a corridor as Larry catches Mickey. Gail, another assistant, runs out, gesturing. Mickey encounters Ed Smythe, who he greets, then moves to a writer holding a script. Mickey, Gail, and the writer walk, the writer angry. Mickey, startled, turns to an open dressing room where Ron slouches. Mickey and Gail rush in, seeing a man and woman sharing a drink, ignoring Ron."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The elegant lamps are suspended gracefully from the ceiling while the soothing strains of classical music continue to fill the background with their melodious presence. Lee halts momentarily at a work area enveloped in clear plastic, where the figure of Frederick is discernible, diligently engaged at his drawing board, visible through the transparent screen. As Lee makes her way over to the area where Frederick is seated, he is observed with focused attention, meticulously cleaning a selection of paintbrushes with a cloth. Lee stands beside him, leaning slightly over the drawing board, and gazes directly at him with intent. The table before them is cluttered with an assortment of cans of brushes and various artist's tools and equipment. In a display of affection, Frederick and Lee share an embrace, and Lee lets out a gentle sigh. Lee kisses Frederick twice, then releases him from her embrace and steps out of the enclosed work area.\n\nLee proceeds to walk over to the section of the loft designated for the stereo system, all the while rolling up the sleeves of her cozy sweater as Frederick continues to speak. She picks up a book from the shelf that houses the stereo and leans back against the unit, taking a moment to glance through its pages with interest. Meanwhile, Frederick departs from his work area, casually walking past Lee with his hands tucked into his pockets. The camera's focus remains on Frederick as he moves into the bedroom area of the loft. He then settles himself down on the edge of the bed and begins removing his shoes. Lee joins Frederick, sitting down beside him, and he gently takes her hand in his. Lee returns the gesture by planting a kiss on Frederick's cheek, leading to another embrace. Frederick laughs warmly, and their embrace becomes even tighter. Without losing momentum, he takes hold of Mary's wrist and continues moving forward.\n\nAs the group makes its way through an expansive doorway, Larry catches up to Mickey, walking in stride with him. The group takes a sharp right turn into a new corridor, briefly disappearing off-screen. As they briskly pass an open door, Gail, another assistant, hurriedly emerges, brandishing her glasses with urgency. The group, moving at a swift pace, turns a corner with Gail following and patting Mickey on the back, expressing her frustration through animated gestures. Mickey is momentarily interrupted by Ed Smythe, an official representing the Standards and Practices Department, who has been standing in the corridor awaiting Mickey's arrival. Mickey stops in his tracks, shaking Ed's hand as if having anticipated this encounter. Gail pauses by his side while the others proceed into a doorway leading to a bustling background studio teeming with industrious personnel. A writer, script in hand, steps out from the background studio, casting searching glances around the area.\n\nMickey and Gail approach the visibly upset writer, Ed momentarily forgotten amidst this newly arisen crisis. Together, Mickey, Gail, and the writer commence walking down a corridor adjacent to the studio. The writer reacts with visible anger, while Gail attempts to capture Mickey’s attention as they continue moving. Mickey, still in a state of surprised shock, turns away from the agitated writer and positions himself by an open door leading to a dressing room. Inside, Ron, an actor, slouches in a chair facing a makeup mirror, appearing dazed. People meander about behind the actor as Mickey, suddenly remembering Ron, darts into the dressing room with Gail trailing closely behind. Within the room, a man and a woman engage in conversation, seemingly oblivious to Ron as they share a drink from a paper cup."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The elegantly crafted lamps are suspended gracefully and effortlessly from the high ceiling, their soft glow illuminating the room. Meanwhile, the soothing strains of classical music continue to fill the atmosphere with a melodious presence that charms the senses. Lee pauses for a brief moment at an area dedicated to work, which is enveloped in clear plastic sheeting. Through this transparent screen, the form of Frederick is discernible. He is diligently engaged at his drawing board, visible and absorbed in his work. As Lee approaches the area where Frederick is seated, he can be observed with focused attention, carefully and meticulously cleaning a selection of paintbrushes using a cloth. Lee positions herself beside him, leaning slightly over the drawing board, and gazes directly at him with intent and interest. The table before them is cluttered with an assortment of cans filled with brushes and various other artist's tools and equipment. In an endearing display of affection, Frederick and Lee share a tender embrace, and Lee lets out a gentle sigh of contentment. Lee proceeds to kiss Frederick twice before releasing him from the warm embrace and stepping away from the enclosed work area.\n\nLee then makes her way over to the section of the spacious loft that is designated for the stereo system. As she walks, she begins rolling up the sleeves of her cozy sweater, all the while listening to Frederick continue to speak. She picks up a book from the shelf that houses the stereo system and leans back against the unit, taking a moment to glance through its pages with genuine interest. Meanwhile, Frederick departs from his work area and casually strolls past Lee with his hands comfortably tucked into his pockets. The camera's focus remains on Frederick as he moves into the bedroom area of the inviting loft. He then settles himself down on the edge of the bed and begins the task of removing his shoes. Lee joins Frederick, sitting down beside him, and he gently takes her hand in his own. Lee reciprocates the gesture by planting a gentle kiss on Frederick's cheek, which naturally leads to another affectionate embrace. Frederick laughs warmly, and their embrace becomes even tighter and more heartfelt. Without losing momentum, he takes hold of Mary's wrist and continues moving forward with determination.\n\nAs the group makes its way through an expansive doorway, Larry catches up to Mickey, ensuring he walks in stride with him. The group collectively takes a sharp right turn into a new corridor, momentarily disappearing off-screen from view. As they briskly pass an open door, Gail, who is another assistant, hurriedly emerges, brandishing her glasses with a sense of urgency. The group, moving at a swift pace, turns a corner, with Gail following closely behind. She pats Mickey on the back, expressing her frustration through animated gestures that convey her feelings. Mickey is momentarily interrupted by Ed Smythe, an official representing the Standards and Practices Department, who has been standing in the corridor, clearly awaiting Mickey's arrival. Mickey stops abruptly in his tracks, shaking Ed's hand as if he had anticipated this encounter. Gail pauses by his side while the others continue into a doorway leading to a bustling background studio teeming with industrious personnel, all engaged in their work. A writer, with a script in hand, steps out from the busy background studio, casting searching and inquisitive glances around the area.\n\nMickey and Gail approach the visibly upset writer, with Ed momentarily forgotten amidst this newly arisen crisis. Together, Mickey, Gail, and the writer commence walking down a corridor that runs adjacent to the studio. The writer reacts with visible anger and frustration, while Gail attempts to capture Mickey’s attention as they continue moving. Mickey, still in a state of surprised shock, turns away from the agitated writer and positions himself by an open door leading to a dressing room. Inside the room, Ron, an actor, is slouched in a chair facing a makeup mirror, appearing somewhat dazed. People meander about behind the actor as Mickey, suddenly remembering Ron, darts into the dressing room with Gail trailing closely behind him. Within the room, a man and a woman are engaged in conversation, seemingly oblivious to Ron as they share a drink from a crumpled paper cup."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Lamps hang down from the ceiling, casting a warm glow, as classical music continues to play softly in the background, creating an inviting atmosphere. Lee approaches a plastic-enclosed work area, pausing to observe the scene where Frederick is visible on the other side, engrossed in his work at a drawing board. Walking around the clear plastic screen, Lee makes her way toward the drawing board where Frederick, completely absorbed in cleaning paintbrushes with a rag, concentrates intently on his task. Standing beside him, Lee leans over the board, directing her gaze directly at Frederick. The table before them is cluttered with an assortment of brushes and various pieces of artist's equipment, each tool reflecting Frederick’s craft. In a moment of connection, Frederick and Lee embrace warmly, and Lee releases a sigh that hints at the depth of their relationship. Lee then tenderly kisses Frederick twice before she gently lets go, signaling the end of their brief interaction, and exits the work area. She strides over to the loft’s stereo area, methodically pulling up the sleeves of her sweater in a relaxed gesture, while Frederick remains engaged in conversation. Lee reaches for a book from the stereo shelf, leans back comfortably against the unit, and leisurely flips through the pages, absorbing its content. Meanwhile, Frederick leaves his work area and ambles past Lee, his hands tucked casually in his pockets. The camera follows Frederick as he makes his way into the bedroom area of the loft, where he settles down at the foot of the bed and begins the routine of removing his shoes. Lee joins him by sitting down beside him, and in a comforting gesture, he takes her hand in his. Lee responds with affection, planting a gentle kiss on Frederick’s cheek, and they share another embrace, their connection deepening as Frederick laughs, and their embrace becomes tighter, filled with warmth and understanding. In a seamless transition, a new scene unfolds where a group of individuals moves through a large doorway, with Larry catching up to Mickey as they proceed. The group makes a swift turn to the right into a new corridor, briefly disappearing from sight. As they walk briskly past an open door, Gail, another assistant, emerges energetically, clutching her glasses in hand. The group picks up pace, rounding a corner with Gail catching up to Mickey, patting his back, and gesturing with exasperation as she tries to communicate urgently. Mickey’s attention is suddenly diverted when Ed Smythe, an official from the Standards and Practices Department, positioned in the corridor, halts him. Mickey pauses and extends his hand in a friendly manner, shaking Ed's hand with the familiarity of someone who expected this encounter. Gail stands by his side, her attention momentarily diverted, while the rest of the group, undeterred, files into a background studio doorway bustling with personnel moving about in a flurry of activity. A writer, holding a script, exits the studio, casting his eyes about with a searching expression. Mickey and Gail, attuned to a new and pressing issue, move over to where the frustrated writer stands, Ed’s presence momentarily forgotten in the face of this developing crisis. United in purpose, Mickey, Gail, and the writer stride down a corridor adjacent to the studio, with the writer’s anger becoming more apparent as Gail attempts to capture Mickey’s focus amidst their determined march. Mickey, visibly taken aback, diverts his gaze away from the agitated writer and positions himself by an open dressing room, where Ron, an actor, slouches in a chair, dazed, facing a makeup mirror. Beyond Ron, the hustle and bustle of people moving in the background carries on, indifferent to the scene unfolding. Mickey, jolted by the sight of Ron, rushes into the dressing room, with Gail quick on his heels. Inside, a man and a woman engage in their own animated conversation, seemingly oblivious to the distracted actor, as they share a drink from a paper cup, encapsulating a private world within the chaos."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Lamps hang from the ceiling as classical music plays softly. Lee pauses at a plastic-enclosed work area to observe Frederick working at his drawing board. Approaching him, she notices Frederick cleaning paintbrushes and then leans over the board to engage with him. After sharing an embrace and exchanging kisses, Lee leaves the work area and heads to the stereo, where she adjusts her sweater sleeves, picks up a book, and casually browses its pages while listening to Frederick. Frederick exits his work area and moves into the bedroom, where he sits at the foot of the bed to remove his shoes. Lee joins him, and they share a tender moment, culminating in laughter and a more intimate embrace.\n\nMeanwhile, a group, including Mickey, briskly walks through a large doorway and turns into a corridor, briefly disappearing from view. Gail, another assistant, emerges from an open door, catching up with them just as Mickey is approached by Ed Smythe from the Standards and Practices Department. After a brief handshake with Ed, Mickey is joined by Gail, and they divert their attention to an angry writer emerging from a studio. As they walk down a corridor adjacent to the studio, Gail tries to capture Mickey's attention, but he is preoccupied by the writer's agitation. Mickey then notices Ron, an actor who seems dazed, sitting in a dressing room. Mickey and Gail rush into the dressing room, passing by milling people and ignoring a couple sharing a drink, to address Ron's state."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Lamps hang down from the ceiling as classical music, a genre often associated with creating a calm and focused atmosphere, still plays in the background. Lee, a dedicated art studio manager, stops at a plastic-enclosed work area, where Frederick, a renowned illustrator known for his meticulous attention to detail, can be seen working at a drawing board on the other side of the clear plastic screen. As Lee walks over to the drawing board where Frederick is sitting, he is seen intently cleaning some paintbrushes with a rag, a necessary task to maintain the brushes' quality for precise artistic work. Lee stands by him, leaning over the board, and looks directly at him. The table is filled with cans of brushes and artist's equipment, essential tools for Frederick's creative process. Frederick and Lee embrace; Lee sighs, feeling the weight of their upcoming gallery exhibition. Lee kisses Frederick twice, then releases him and walks out of the work area. Lee walks over to the loft's stereo area, pulling up the sleeves of her sweater, preparing to adjust the sound system as Frederick talks. Lee picks up a book from the stereo shelf, an art history tome, and leans back against the unit, glancing through its pages. Frederick, leaving his work area, walks past Lee with his hands in his pockets, a sign of his contemplative nature. The camera stays with Frederick as he walks into the loft's bedroom area. He sits down at the foot of the bed and starts taking off his shoes, worn from long hours of standing at his drawing board. Lee sits down next to Frederick; he takes her hand, offering her silent support. Lee kisses Frederick back on the cheek, and they embrace, sharing a moment of solace before the busy day ahead. Frederick laughs; their embrace gets tighter. Without missing a beat, he takes Mary's wrist, his imaginative muse in the project, and continues walking. As the group, bustling with creative energy, walks through a large doorway, Larry, a key production assistant, catches up to Mickey. The group turns right into a new corridor, briefly off the screen. As the group briskly walks past an open door, Gail, another assistant known for her exceptional organizational skills, runs out, brandishing her glasses which she relies on to keep meticulous notes. The fast-tracking group turns the corner as Gail pats Mickey's back and gestures in exasperation, worried about staying on schedule. Mickey is interrupted by Ed Smythe, an official from the Standards and Practices Department, who's been standing in the corridor waiting for Mickey to discuss compliance issues. Mickey stops and shakes Ed's hand as if he'd known the official would be there, a regular occurrence in their hectic work environment. Gail stops by his side while the others walk into a background studio doorway that is busy with scurrying personnel, each person contributing to the production's success. A writer, holding a script crucial for the day's rehearsal, walks out of the background studio, looking around for the director. Mickey and Gail walk over to the angry writer, Ed forgotten with this new crisis involving a last-minute script change. Mickey, Gail, and the writer start walking down a corridor adjacent to the studio. The writer reacts angrily as Gail tries to get Mickey's attention while they walk, concerned about the implications of the changes. Mickey, still in surprised shock, turns away from the angry writer and stands by an open dressing room, where Ron, an actor known for his intense method acting, slouches, dazed, in a chair facing a makeup mirror. People mill in the background behind the actor, bustling in preparation for the upcoming production, as Mickey, remembering Ron's recent triumph in a leading role, runs into the dressing room with Gail following him. Inside, a man and a woman talk, ignoring Ron as they share a drink in a paper cup, unaware of the chaos unfolding around them."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Lamps hang down from the ceiling as classical music still plays in the background. Lee stops at a plasticenclosed work area where Frederick can be seen working at a drawing board on the other side of the clear plastic screen. As Lee walks over to the drawing board where Frederick is sitting he is seen intently cleaning some paintbrushes with a rag. Lee stands by him leaning over the board and looks directly at him. The table is filled with cans of brushes and artist's equipment. Frederick and Lee embrace. Lee sighs. Lee kisses Frederick twice then releases him and walks out of the work area. Lee walks over to the loft's stereo area pulling up the sleeves of her sweater. as Frederick talks. Lee picks up a book from the stereo shelf and leans back against the unit glancing through its pages. Frederick leaving his work area walks past Lee with his hands in his pockets. The camera stays with Frederick as he walks into the loft's bedroom area. He sits down at the foot of the bed and starts taking off his shoes. Lee sits down next to Frederick. he takes her hand. Lee kisses Frederick back on the cheek and they embrace. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Frederick laughs. their embrace gets tighter. Without missing a beat he takes Mary's wrist and continues walking. As the group walks through a large doorway Larry catches up to Mickey. The group turns right into a new corridor briefly off the screen. As the group briskly walks past an open door Gail another assistant runs out brandishing her glasses. The fasttracking group turns the corner as Gail pats Mickey's back and gestures in exasperation. Mickey is interrupted by Ed Smythe an official from the Standards and Practices Department who is been standing in the corridor waiting for Mickey. Mickey stops and shakes Ed's hand as if he would known the official would be there. Gail stops by his side while the others walk into a background studio doorway that is busy with scurrying personnel. A writer holding a script walks out of the background studio looking around. Mickey and Gail walk over to the angry writer. Ed forgotten with this new crisis. Mickey Gail and the writer start walking down a corridor adjacent to the studio. The writer reacts angrily as Gail tries to get Mickey's attention while they walk. Mickey still in surprised shock turns away from the angry writer and stands by an open dressing room where Ron an actor slouches dazed in a chair facing a makeup mirror. People mill in the background behind the actor as Mickey remembering Ron runs into the dressing room with Gail following him. Inside a man and a woman talk ignoring Ron as they share a drink in a paper cup."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Lamps hang down from the ceiling as classical music still plays in the background. Lee stops at a plasticenclosed work area where Frederick can be seen working at a drawing board on the other side of the clear plastic screen. As Lee walks over to the drawing board where Frederick is sitting he is seen intently cleaning some paintbrushes with a rag. Lee stands by him leaning over the board and looks directly at him. The table is filled with cans of brushes and artist's equipment. Frederick and Lee embrace. Lee sighs. Lee kisses Frederick twice then releases him and walks out of the work area. Lee walks over to the loft's stereo area pulling up the sleeves of her sweater. as Frederick talks. Lee picks up a book from the stereo shelf and leans back against the unit glancing through its pages. Frederick leaving his work area walks past Lee with his hands in his pockets. The camera stays with Frederick as he walks into the loft's bedroom area. He sits down at the foot of the bed and starts taking off his shoes. Lee sits down next to Frederick. he takes her hand. Lee kisses Frederick back on the cheek and they embrace. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Frederick laughs. their embrace gets tighter. Without missing a beat he takes Mary's wrist and continues walking. As the group walks through a large doorway Larry catches up to Mickey. The group turns right into a new corridor briefly off the screen. As the group briskly walks past an open door Gail another assistant runs out brandishing her glasses. The fasttracking group turns the corner as Gail pats Mickey's back and gestures in exasperation. Mickey is interrupted by Ed Smythe an official from the Standards and Practices Department who is been standing in the corridor waiting for Mickey. Mickey stops and shakes Ed's hand as if he would known the official would be there. Gail stops by his side while the others walk into a background studio doorway that is busy with scurrying personnel. A writer holding a script walks out of the background studio looking around. Mickey and Gail walk over to the angry writer. Ed forgotten with this new crisis. Mickey Gail and the writer start walking down a corridor adjacent to the studio. The writer reacts angrily as Gail tries to get Mickey's attention while they walk. Mickey still in surprised shock turns away from the angry writer and stands by an open dressing room where Ron an actor slouches dazed in a chair facing a makeup mirror. People mill in the background behind the actor as Mickey remembering Ron runs into the dressing room with Gail following him. Inside a man and a woman talk ignoring Ron as they share a drink in a paper cup."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Lamps hang down from the ceiling as classical music still plays in the background. Lee stops at a plasticenclosed work area where Frederick can be seen working at a drawing board on the other side of the clear plastic screen. As Lee walks over to the drawing board where Frederick is sitting he is seen intently cleaning some paintbrushes with a rag. Lee stands by him leaning over the board and looks directly at him. The table is filled with cans of brushes and artist's equipment. Frederick and Lee embrace. Lee sighs. Lee kisses Frederick twice then releases him and walks out of the work area. Lee walks over to the loft's stereo area pulling up the sleeves of her sweater. Gail stops by his side while the others walk into a background studio doorway that is busy with scurrying personnel. A writer holding a script walks out of the background studio looking around. Mickey and Gail walk over to the angry writer. Ed forgotten with this new crisis. Mickey Gail and the writer start walking down a corridor adjacent to the studio. The writer reacts angrily as Gail tries to get Mickey's attention while they walk. Mickey still in surprised shock turns away from the angry writer and stands by an open dressing room where Ron an actor slouches dazed in a chair facing a makeup mirror. People mill in the background behind the actor as Mickey remembering Ron runs into the dressing room with Gail following him. Inside a man and a woman talk ignoring Ron as they share a drink in a paper cup."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Lamps hang down from the ceiling as classical music still plays in the background. Lee stops at a plasticenclosed work area where Frederick can be seen working at a drawing board on the other side of the clear plastic screen. As Lee walks over to the drawing board where Frederick is sitting he is seen intently cleaning some paintbrushes with a rag. The writer reacts angrily as Gail tries to get Mickey's attention while they walk. Mickey still in surprised shock turns away from the angry writer and stands by an open dressing room where Ron an actor slouches dazed in a chair facing a makeup mirror. People mill in the background behind the actor as Mickey remembering Ron runs into the dressing room with Gail following him. Inside a man and a woman talk ignoring Ron as they share a drink in a paper cup."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Beetles dangle below from the treetops as jazz music softly hums in the foreground. Sarah pauses at a glass-enclosed study corner, where Rupert can be observed lounging on a hammock in front of the frosted glass wall. As Sarah strides over to the hammock where Rupert is reclining, she is noticed hurriedly folding some napkins with a newspaper. Sarah hovers by him, crouching over the hammock, and squints carefully at him. The desk is crowded with jars of pencils and engineer's gadgets. Rupert and Sarah high-five; Sarah giggles. Sarah pecks Rupert thrice, then lets go of him and prances out of the study corner. Sarah skips over to the balcony's television spot, rolling up the cuffs of her jacket as Rupert whispers. Sarah snatches a magazine from the television rack and lounges back against the fixture, scanning through its covers. Rupert, exiting his study nook, strides past Sarah with his elbows in his hood. The lens follows Rupert as he strides into the balcony's kitchen spot. He kneels down at the head of the stove and begins unlacing his boots. Sarah kneels down beside Rupert; she grasps his elbow. Sarah pecks Rupert back on the forehead, and they high-five again. Rupert chuckles; their high-five gets stronger. Without breaking stride, he grips Emma's ankle and keeps striding. As the crowd strolls through a tiny archway, Calvin catches up to Henry. The crowd veers left into a fresh chamber, momentarily out of view. As the crowd hurriedly strolls past a shut window, Nina, another guide, sprints out, waving her binoculars. The speedy-moving crowd veers the edge as Nina taps Henry's elbow and signals in disbelief. Henry is startled by Tom Jenkins, a guard from the Safety and Compliance Division, who's been leaning in the chamber waiting for Henry. Henry pauses and bumps Tom's shoe as if he'd predicted the guard would be there. Nina pauses beside his knee while the rest stride into a distant arena archway that is bustling with dashing crew. A chef, clutching a menu, strides out of the distant arena, peering around. Henry and Nina stride over to the irate chef, Tom overlooked with this fresh predicament. Henry, Nina, and the chef commence pacing along a lane adjacent to the arena. The chef reacts irritably as Nina attempts to seize Henry's notice while they pace. Henry, still in shocked awe, pivots away from the irate chef and stands by a closed kitchen pantry, where Sam, a baker, droops, bemused, in a stool facing a snack tray. People swirl in the foreground behind the baker as Henry, recalling Sam, dashes into the pantry with Nina tailing him. Within, a boy and a girl converse, neglecting Sam as they savor a pastry from a plastic dish."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Classical music plays as Lee approaches Frederick, who is working at a drawing board in a plastic-enclosed area, cleaning brushes. They share a tender moment as Lee kisses and embraces him before moving to the loft’s stereo area, where she examines a book. Frederick passes by and heads to the bedroom, sitting on the bed and removing his shoes. Lee joins him, and they share another embrace and laughter. Meanwhile, Mickey and his group, including Gail, move through a busy corridor. Mickey encounters Ed Smythe from the Standards and Practices Department and greets him before a crisis with an angry writer diverts his attention. Mickey and Gail address the writer's concern while noticing Ron, an actor, in a dressing room, leading them to intervene, leaving Ed behind."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Inside a man and a woman talk ignoring Ron as they share a drink in a paper cup People mill in the background behind the actor as Mickey remembering Ron runs into the dressing room with Gail following him Mickey still in surprised shock turns away from the angry writer and stands by an open dressing room where Ron an actor slouches dazed in a chair facing a makeup mirror The writer reacts angrily as Gail tries to get Mickey's attention while they walk Mickey Gail and the writer start walking down a corridor adjacent to the studio Ed forgotten with this new crisis Mickey and Gail walk over to the angry writer A writer holding a script walks out of the background studio looking around Gail stops by his side while the others walk into a background studio doorway that is busy with scurrying personnel Mickey stops and shakes Ed's hand as if he would known the official would be there Mickey is interrupted by Ed Smythe an official from the Standards and Practices Department who is been standing in the corridor waiting for Mickey The fasttracking group turns the corner as Gail pats Mickey's back and gestures in exasperation As the group briskly walks past an open door Gail another assistant runs out brandishing her glasses The group turns right into a new corridor briefly off the screen As the group walks through a large doorway Larry catches up to Mickey Without missing a beat he takes Mary's wrist and continues walking their embrace gets tighter Frederick laughs Lee kisses Frederick back on the cheek and they embrace he takes her hand Lee sits down next to Frederick He sits down at the foot of the bed and starts taking off his shoes The camera stays with Frederick as he walks into the loft's bedroom area Frederick leaving his work area walks past Lee with his hands in his pockets Lee picks up a book from the stereo shelf and leans back against the unit glancing through its pages as Frederick talks Lee walks over to the loft's stereo area pulling up the sleeves of her sweater Lee kisses Frederick twice then releases him and walks out of the work area Lee sighs Frederick and Lee embrace The table is filled with cans of brushes and artist's equipment Lee stands by him leaning over the board and looks directly at him As Lee walks over to the drawing board where Frederick is sitting he is seen intently cleaning some paintbrushes with a rag Lee stops at a plasticenclosed work area where Frederick can be seen working at a drawing board on the other side of the clear plastic screen Lamps hang down from the ceiling as classical music still plays in the background"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Lee stops at a plasticenclosed work area where Frederick can be seen working at a drawing board on the other side of the clear plastic screen Lamps hang down from the ceiling as classical music still plays in the background Lee stands by him leaning over the board and looks directly at him As Lee walks over to the drawing board where Frederick is sitting he is seen intently cleaning some paintbrushes with a rag Frederick and Lee embrace The table is filled with cans of brushes and artist's equipment Lee kisses Frederick twice then releases him and walks out of the work area Lee sighs as Frederick talks Lee walks over to the loft's stereo area pulling up the sleeves of her sweater Frederick leaving his work area walks past Lee with his hands in his pockets Lee picks up a book from the stereo shelf and leans back against the unit glancing through its pages He sits down at the foot of the bed and starts taking off his shoes The camera stays with Frederick as he walks into the loft's bedroom area he takes her hand Lee sits down next to Frederick Frederick laughs Lee kisses Frederick back on the cheek and they embrace Without missing a beat he takes Mary's wrist and continues walking their embrace gets tighter The group turns right into a new corridor briefly off the screen As the group walks through a large doorway Larry catches up to Mickey The fasttracking group turns the corner as Gail pats Mickey's back and gestures in exasperation As the group briskly walks past an open door Gail another assistant runs out brandishing her glasses Mickey stops and shakes Ed's hand as if he would known the official would be there Mickey is interrupted by Ed Smythe an official from the Standards and Practices Department who is been standing in the corridor waiting for Mickey A writer holding a script walks out of the background studio looking around Gail stops by his side while the others walk into a background studio doorway that is busy with scurrying personnel Ed forgotten with this new crisis Mickey and Gail walk over to the angry writer The writer reacts angrily as Gail tries to get Mickey's attention while they walk Mickey Gail and the writer start walking down a corridor adjacent to the studio People mill in the background behind the actor as Mickey remembering Ron runs into the dressing room with Gail following him Mickey still in surprised shock turns away from the angry writer and stands by an open dressing room where Ron an actor slouches dazed in a chair facing a makeup mirror Inside a man and a woman talk ignoring Ron as they share a drink in a paper cup"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "their embrace gets tighter Without missing a beat he takes Mary's wrist and continues walking As the group walks through a large doorway Larry catches up to Mickey The group turns right into a new corridor briefly off the screen As the group briskly walks past an open door Gail another assistant runs out brandishing her glasses The fasttracking group turns the corner as Gail pats Mickey's back and gestures in exasperation Mickey is interrupted by Ed Smythe an official from the Standards and Practices Department who is been standing in the corridor waiting for Mickey Mickey stops and shakes Ed's hand as if he would known the official would be there Gail stops by his side while the others walk into a background studio doorway that is busy with scurrying personnel A writer holding a script walks out of the background studio looking around Mickey and Gail walk over to the angry writer Ed forgotten with this new crisis Mickey Gail and the writer start walking down a corridor adjacent to the studio The writer reacts angrily as Gail tries to get Mickey's attention while they walk Mickey still in surprised shock turns away from the angry writer and stands by an open dressing room where Ron an actor slouches dazed in a chair facing a makeup mirror People mill in the background behind the actor as Mickey remembering Ron runs into the dressing room with Gail following him Inside a man and a woman talk ignoring Ron as they share a drink in a paper cup Lamps hang down from the ceiling as classical music still plays in the background Lee stops at a plasticenclosed work area where Frederick can be seen working at a drawing board on the other side of the clear plastic screen As Lee walks over to the drawing board where Frederick is sitting he is seen intently cleaning some paintbrushes with a rag Lee stands by him leaning over the board and looks directly at him The table is filled with cans of brushes and artist's equipment Frederick and Lee embrace Lee sighs Lee kisses Frederick twice then releases him and walks out of the work area Lee walks over to the loft's stereo area pulling up the sleeves of her sweater as Frederick talks Lee picks up a book from the stereo shelf and leans back against the unit glancing through its pages Frederick leaving his work area walks past Lee with his hands in his pockets The camera stays with Frederick as he walks into the loft's bedroom area He sits down at the foot of the bed and starts taking off his shoes Lee sits down next to Frederick he takes her hand Lee kisses Frederick back on the cheek and they embrace Frederick laughs"
        }
      ]
    }
  ]
}