{
  "ground_truth": "The woman looks back at Ron; she gestures with disgust. Ron coughs. Gail walks around the chair. The camera shows she and Mickey talking to Ron through the reflection in the cluttered makeup mirror. Ron sighs. Mickey, as reflected in the mirror, starts to pace. Norman, a Los Angeles TV producer and Mickey's former partner, is driving down a peaceful street lined with palm trees. He's wearing sunglasses and headphones. He clicks his fingers in time to the music only he hears on his Walkman. He's smiling contentedly while Mickey talks over the sun-filled scene. As Mickey finishes his ruminations, Hannah is seen walking towards her front door. She opens it, her back to the camera. Mickey stands there holding two boxed gifts. Hannah continues to nod patiently, patting Mickey on the back, as they make their way across the foyer into the den, where the twins are playing. Mickey wears his coat. Mickey hands a gift to each twin. The twins put down their gifts, one on the sofa, one on the coffee table, and hug their father. Mickey throws the football. There's a sound of breaking glass. Hannah and Mickey react. Mickey is walking up a West Side street, his hands in his coat pockets. Mickey pushes open the outside door of Dr. Abel's office, as the movie cuts to the doctor's consultation room. The doctor is framed in the doorway, looking through a file cabinet. While Mickey answers him offscreen, Dr. Abel turns and walks toward him. The camera follows the doctor's movements from the other side of the wall, obscuring him briefly. It moves across a dark examining-room wall to a second doorway, where Mickey sits on a stool, continuing to talk to the offscreen Dr. Abel. Dr. Abel walks back onscreen. Both he and Mickey are now seen through the second doorway. Dr. Abel sniffs and stands directly in front of the sitting Mickey. He stares down at him as Mickey talks. Dr. Abel chuckles. An uptempo big-band sound is heard as the movie cuts to Mickey's examination, beginning with a close-up of Dr. Abel using an otoscope to examine the ear of a nervous Mickey. The film shows the doctor's hands turning the dials on a sonometer. Mickey sits on a nearby high stool, large earphones on his head. He listens with such concentration that he squints his eyes. He holds up a finger in response to the sounds he hears in his headset. Finally, the film shows Dr. Abel hitting a large tuning fork with his finger. He puts the vibrating fork to Mickey's ear. Mickey, looking up at the offscreen doctor's face, nods. Dr. Abel walks from the examining room, through the consultation room, to a second examining room across the way.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The lady gazes back at Ron; she motions with revulsion. Ron clears his throat. Gail strolls around the seat. The camera displays she and Mickey conversing to Ron via the reflection in the cluttered makeup mirror. Ron exhales. Mickey, as mirrored in the glass, begins to stride. Norman, a Los Angeles television producer and Mickey's former collaborator, is driving down a tranquil road bordered with palm trees. He's wearing sunglasses and headphones. He snaps his fingers in rhythm to the music only he perceives on his Walkman. He's grinning contentedly while Mickey speaks over the sunlit scene. As Mickey concludes his reflections, Hannah is observed walking towards her front door. She opens it, her back to the lens. Mickey stands there holding two boxed presents. Hannah continues to nod tolerantly, patting Mickey on the back, as they make their way across the foyer into the den, where the twins are playing. Mickey wears his coat. Mickey hands a present to each twin. The twins put down their presents, one on the couch, one on the coffee table, and embrace their father. Mickey throws the football. There's a noise of shattering glass. Hannah and Mickey react. Mickey is strolling up a West Side street, his hands in his coat pockets. Mickey pushes open the exterior door of Dr. Abel's office, as the movie cuts to the doctor's consultation room. The doctor is framed in the entrance, looking through a file cabinet. While Mickey replies to him offscreen, Dr. Abel turns and walks toward him. The camera tracks the doctor's movements from the other side of the wall, obscuring him momentarily. It moves across a dim examining-room wall to a second entrance, where Mickey sits on a stool, continuing to converse with the offscreen Dr. Abel. Dr. Abel walks back onscreen. Both he and Mickey are now seen through the second entrance. Dr. Abel sniffs and stands directly in front of the sitting Mickey. He gazes down at him as Mickey talks. Dr. Abel laughs. An uptempo big-band tune is heard as the movie cuts to Mickey's assessment, beginning with a close-up of Dr. Abel using an otoscope to inspect the ear of an anxious Mickey. The film shows the doctor's hands turning the dials on a sonometer. Mickey sits on a nearby high stool, large earphones on his head. He listens with such focus that he narrows his eyes. He holds up a finger in reply to the noises he hears in his headset. Finally, the film shows Dr. Abel striking a large tuning fork with his finger. He puts the oscillating fork to Mickey's ear. Mickey, looking up at the offscreen doctor's visage, nods. Dr. Abel walks from the examining chamber, through the consultation room, to a second examining chamber across the way."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The woman looks back at Ron; disgust is gestured by her. A cough is emitted by Ron. The chair is walked around by Gail. The reflection in the cluttered makeup mirror shows her and Mickey talking to Ron. A sigh is let out by Ron. Mickey's reflection in the mirror begins to pace. Norman, a Los Angeles TV producer and Mickey's former partner, drives down a peaceful street lined with palm trees. He wears sunglasses and headphones. The fingers are clicked by him in time to the music only heard by him on his Walkman. A contented smile is on his face while Mickey talks over the sun-filled scene. As his ruminations are finished by Mickey, Hannah walks towards her front door. It is opened by her, her back to the camera. Mickey stands there holding two boxed gifts. Patient nods are continued by Hannah, and Mickey is patted on the back by her, as their way across the foyer into the den is made, where the twins play. His coat is worn by Mickey. A gift is handed by Mickey to each twin. The gifts are put down by the twins, one on the sofa, one on the coffee table, and their father is hugged by them. The football is thrown by Mickey. The sound of breaking glass is heard. A reaction is made by Hannah and Mickey. His hands in his coat pockets, Mickey walks up a West Side street. The outside door of Dr. Abel's office is pushed open by Mickey, as the movie cuts to the doctor's consultation room. Dr. Abel is framed in the doorway, looking through a file cabinet. While Mickey answers him offscreen, he is turned to and approached by Dr. Abel. The camera follows the movements of the doctor from the other side of the wall, obscuring him briefly. It moves across a dark examining-room wall to a second doorway, where Mickey sits on a stool, continuing to talk to the offscreen Dr. Abel. Dr. Abel walks back onscreen. Through the second doorway, both he and Mickey are now seen. A sniff is done by Dr. Abel, and directly in front of the sitting Mickey, he stands. Down at him, he stares as Mickey talks. A chuckle is let out by Dr. Abel. An uptempo big-band sound is played as the movie cuts to Mickey's examination, beginning with a close-up of an otoscope being used by Dr. Abel to examine the ear of a nervous Mickey. The film shows the dials on a sonometer being turned by the doctor's hands. Mickey sits on a nearby high stool, large earphones on his head. With such concentration, he listens that his eyes are squinted. A finger is held up by him in response to the sounds heard in his headset. Finally, Dr. Abel is shown by the film hitting a large tuning fork with his finger. The vibrating fork is put by him to Mickey's ear. Up at the offscreen doctor's face, Mickey looks and nods. From the examining room, Dr. Abel walks, through the consultation room, to a second examining room across the way."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The woman looks back at Ron with disgust. Ron coughs. Gail circles the chair. The camera shows her and Mickey talking to Ron via the cluttered makeup mirror reflection. Ron sighs. Mickey, reflected in the mirror, paces. Norman, a Los Angeles TV producer and Mickey's ex-partner, drives down a palm-lined street, wearing sunglasses and headphones, clicking his fingers to music on his Walkman. He smiles contentedly as Mickey talks over the sunny scene. As Mickey finishes, Hannah walks to her front door, opens it with her back to the camera. Mickey stands there with two boxed gifts. Hannah nods patiently, patting Mickey's back as they move into the den where the twins play. Mickey, in his coat, gives each twin a gift. The twins place their gifts on the sofa and coffee table, then hug their father. Mickey throws a football, and glass breaks. Hannah and Mickey react. Mickey walks up a West Side street, hands in coat pockets, and enters Dr. Abel's office. The movie cuts to the consultation room, where Dr. Abel looks through a file cabinet. As Mickey answers offscreen, Dr. Abel approaches him. The camera follows the doctor, briefly obscured, then moves to a second doorway where Mickey sits, talking to the offscreen doctor. Dr. Abel returns onscreen, standing before Mickey, who talks. Dr. Abel chuckles. An uptempo big-band sound plays as the movie shows Mickey's examination, starting with Dr. Abel using an otoscope on Mickey's ear. The doctor adjusts a sonometer's dials. Mickey, on a high stool with earphones, listens intently, squinting and raising a finger to the sounds. Finally, Dr. Abel hits a tuning fork, placing it by Mickey's ear. Mickey nods at the offscreen doctor. Dr. Abel exits the examining room, crosses the consultation room, and enters another examining room."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The woman looks back at Ron with disgust. Ron coughs. Gail circles the chair. The camera shows her and Mickey talking to Ron via the cluttered makeup mirror reflection. Ron sighs. Mickey paces in the mirror. Norman, a Los Angeles TV producer and Mickey's ex-partner, drives down a palm-lined street, wearing sunglasses and headphones, clicking his fingers to his Walkman music. He smiles contentedly as Mickey talks over the sunny scene. As Mickey finishes, Hannah walks to her front door, opens it, and Mickey stands there with two boxed gifts. Hannah nods patiently, patting Mickey's back as they enter the den where the twins play. Mickey, in his coat, gives each twin a gift. The twins place their gifts on the sofa and coffee table, then hug their father. Mickey throws a football, and glass breaks. Hannah and Mickey react. Mickey walks up a West Side street, hands in coat pockets, and enters Dr. Abel's office. The movie cuts to the consultation room, where Dr. Abel looks through a file cabinet. Mickey answers offscreen as Dr. Abel approaches. The camera follows the doctor, briefly obscured, to a second doorway where Mickey sits, talking to the offscreen doctor. Dr. Abel returns onscreen, standing before Mickey, who talks. Dr. Abel chuckles. An uptempo big-band sound plays as the movie cuts to Mickey's examination. Dr. Abel uses an otoscope on Mickey's ear. The doctor adjusts a sonometer while Mickey, on a stool with earphones, listens intently, squinting and raising a finger to the sounds. Dr. Abel hits a tuning fork, placing it by Mickey's ear. Mickey nods at the offscreen doctor. Dr. Abel leaves the examining room, through the consultation room, to another examining room."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The woman turns her head to look back at Ron, and with a gesture full of disdain and disgust, she communicates her feelings. Ron responds with a cough. Meanwhile, Gail makes her way around the chair. The camera captures a scene where she and Mickey are engaged in conversation with Ron, visible through the reflection in a cluttered makeup mirror. Ron lets out a sigh. In the mirror's reflection, Mickey begins to pace back and forth. Norman, who is a television producer based in Los Angeles and also happens to be Mickey's former partner, is seen driving leisurely down a serene street that is beautifully lined with tall palm trees. He is wearing a pair of sunglasses and has headphones on. He rhythmically clicks his fingers in time with the music that only he can hear through his Walkman. A contented smile spreads across his face while Mickey's voice narrates over the sunlit scene. As Mickey concludes his thoughtful musings, Hannah appears, walking towards her front door. She opens it, her back facing the camera. Mickey is standing there, holding two neatly boxed gifts. Hannah continues to nod with patience, gently patting Mickey on the back as they move together across the foyer and into the den, where the twins are actively playing. Mickey is still wearing his coat. He hands a gift to each of the twins. The twins, in turn, place their gifts down, one on the sofa and the other on the coffee table, before they embrace their father warmly. Mickey then throws a football, and suddenly, the sound of breaking glass is heard. Both Hannah and Mickey react to the noise. Mickey is later seen walking along a street on the West Side, his hands tucked into the pockets of his coat. He pushes open the outside door of Dr. Abel's office, and the movie transitions to the doctor's consultation room. Dr. Abel is framed in the doorway, busy looking through a file cabinet. As Mickey responds to him from offscreen, Dr. Abel turns and walks toward him. The camera follows the doctor's movements from the opposite side of the wall, briefly obscuring him from view. It pans across a dark examining-room wall to a second doorway, where Mickey is seated on a stool, continuing his conversation with the offscreen Dr. Abel. Dr. Abel reappears onscreen. Both he and Mickey are now visible through the second doorway. Dr. Abel sniffs and stands directly in front of the seated Mickey, staring down at him as Mickey continues to speak. Dr. Abel lets out a chuckle. An upbeat big-band tune begins to play as the movie transitions to Mickey's examination, starting with a close-up of Dr. Abel using an otoscope to carefully examine the ear of a visibly nervous Mickey. The film shows the doctor's hands as they turn the dials on a sonometer. Mickey sits on a nearby high stool, wearing large earphones on his head. He listens with such intense concentration that he squints his eyes. He raises a finger in response to the sounds he hears through his headset. Finally, the film depicts Dr. Abel striking a large tuning fork with his finger. He places the vibrating fork near Mickey's ear. Mickey, looking up at the offscreen doctor's face, nods in acknowledgment. Dr. Abel then walks from the examining room, through the consultation room, and into a second examining room located across the way."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The woman turns her head quite deliberately to glance back at Ron, and with a gesture that is unmistakably full of disdain and a palpable sense of disgust, she clearly communicates her feelings towards him. In response, Ron lets out a small cough, possibly indicating his discomfort. Meanwhile, Gail is seen making her way around the chair with a purpose. The camera captures a scene wherein she and Mickey are engaged in a lively conversation with Ron, and this interaction is cleverly visible through the reflection in a cluttered makeup mirror. Ron lets out a weary sigh. Within the mirror's reflection, Mickey begins to move restlessly, pacing back and forth. Norman, who is a television producer working in Los Angeles and also happens to be Mickey's former partner, is observed driving leisurely down a serene street, beautifully lined with tall palm trees. He is casually wearing a pair of sunglasses and has headphones on, rhythmically clicking his fingers in time with the music that only he is able to hear through his Walkman. A contented smile spreads across his face, all the while Mickey's voice narrates over the sunlit scene. As Mickey finishes his thoughtful musings, Hannah appears, walking purposefully towards her front door. She opens it, her back facing the camera, revealing Mickey standing there, holding two neatly boxed gifts. She continues to nod with patience, gently patting Mickey on the back as they move together across the foyer and into the cozy den, where the twins are energetically playing. Mickey is still wearing his coat. He offers a gift to each of the twins. The twins, in turn, place their gifts down, one on the inviting sofa and the other on the sturdy coffee table, before they embrace their father warmly. Mickey then throws a football, and suddenly, the unsettling sound of shattering glass is heard. Both Hannah and Mickey react instinctively to the noise. Mickey is later seen walking along a busy street on the West Side, his hands tucked deep into the pockets of his warm coat for comfort. He pushes open the solid outside door of Dr. Abel's office, and the movie seamlessly transitions to the doctor's well-organized consultation room. Dr. Abel is framed thoughtfully in the doorway, busy looking through a vast file cabinet. As Mickey responds to him from offscreen, Dr. Abel turns and walks toward him. The camera follows the doctor’s movements from the opposite side of the wall, briefly obscuring him from view. It slowly pans across a dark examining-room wall towards a second doorway, where Mickey is seated on a high stool, continuing his conversation with the offscreen Dr. Abel. Dr. Abel then reappears onscreen. Both he and Mickey are now visible through the open second doorway. Dr. Abel sniffs and stands directly in front of the seated Mickey, staring down at him as Mickey continues to speak. Dr. Abel lets out a soft chuckle. An upbeat big-band tune begins to play as the movie transitions seamlessly to Mickey's medical examination, starting with a close-up of Dr. Abel using an otoscope to carefully examine the ear of a visibly nervous Mickey. The film then shows the doctor's steady hands as they turn the dials on a precise sonometer. Mickey sits on a nearby high stool, wearing large earphones on his head, listening with such intense concentration that he squints his eyes. He raises a finger in response to the various sounds he hears through his headset. Eventually, the film depicts Dr. Abel striking a large tuning fork with his finger. He places the vibrating fork near Mickey's ear, and Mickey, looking up at the offscreen doctor’s face, nods in acknowledgment. Dr. Abel then walks from the examining room, through the consultation room, and into a second examining room located just across the way."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The woman turns her head to glance back at Ron, her expression shifting to one of clear disgust as she raises her hand to gesture dismissively. In response, Ron lets out a cough, the sound echoing slightly in the room. Meanwhile, Gail moves with purpose, circling around the chair to position herself strategically. The camera captures a unique angle, showing Gail and Mickey engaged in conversation with Ron, their reflections visible in the cluttered makeup mirror that sits nearby. Ron releases a deep sigh, the weight of the moment evident in his demeanor. In the mirror's reflection, Mickey begins to pace back and forth, his movements restless and filled with energy. At the same time, Norman, a Los Angeles TV producer and Mickey's former partner, is seen driving leisurely down a serene street, the road flanked by tall, swaying palm trees. He wears sunglasses that shield his eyes from the bright sun and headphones that cover his ears, isolating him in his own world. With a rhythmic motion, he clicks his fingers in sync with the music playing on his Walkman, a private soundtrack that only he can hear. A contented smile spreads across his face, a stark contrast to the bustling world outside. As Mickey's voice narrates over this sunlit scene, the focus shifts to Hannah, who is walking with purpose towards her front door. She reaches out, turning the doorknob and opening the door, her back facing the camera. Standing on the threshold is Mickey, holding two neatly wrapped boxed gifts in his hands. Hannah nods with patience, acknowledging Mickey's presence, and gently pats him on the back as they move together across the foyer and into the den, where the twins are energetically playing. Mickey, still wearing his coat, extends his arms to hand a gift to each of the twins. The twins, filled with excitement, place their gifts down, one on the sofa and the other on the coffee table, before rushing forward to embrace their father in a warm hug. In a playful moment, Mickey picks up a football and throws it, but the sound of breaking glass abruptly interrupts the scene, causing both Hannah and Mickey to react with surprise. The narrative then transitions to Mickey walking along a West Side street, his hands tucked into the pockets of his coat, a contemplative look on his face. He approaches the outside door of Dr. Abel's office and pushes it open, the scene seamlessly cutting to the interior of the doctor's consultation room. Dr. Abel is framed in the doorway, his attention focused on searching through a file cabinet. As Mickey's voice is heard offscreen, Dr. Abel turns away from the cabinet and walks towards the source of the voice. The camera tracks the doctor's movements from the opposite side of the wall, momentarily obscuring him from view. It then glides across a dimly lit examining-room wall to reveal a second doorway, where Mickey is seated on a stool, continuing his conversation with the unseen Dr. Abel. Dr. Abel reappears onscreen, and both he and Mickey are now visible through the second doorway. Dr. Abel sniffs, a small gesture, and positions himself directly in front of Mickey, who remains seated. He gazes down at Mickey, listening intently as Mickey speaks. A chuckle escapes Dr. Abel, adding a lighthearted note to the interaction. The scene shifts with the introduction of an uptempo big-band sound, signaling the start of Mickey's examination. The camera zooms in on Dr. Abel as he uses an otoscope to carefully examine Mickey's ear, the tension evident in Mickey's nervous expression. The film then captures the doctor's hands as they deftly turn the dials on a sonometer, adjusting the settings with precision. Mickey, now seated on a nearby high stool, wears large earphones over his head, his focus so intense that he squints his eyes in concentration. He raises a finger in response to the auditory cues he perceives through the headset. The examination concludes with Dr. Abel striking a large tuning fork with his finger, the fork vibrating as he places it near Mickey's ear. Mickey, looking up at the doctor's face, which remains offscreen, nods in acknowledgment. Dr. Abel then exits the examining room, walking through the consultation room and into a second examining room located across the way, his movements deliberate and unhurried."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The woman looks back at Ron with a gesture of disgust as Ron coughs. Gail moves around the chair, and the camera captures her and Mickey talking to Ron through the reflection in a cluttered makeup mirror. Ron sighs while Mickey, seen pacing in the mirror, reflects on the situation. Meanwhile, Norman, a Los Angeles TV producer and Mickey's former partner, drives down a peaceful, palm-lined street, wearing sunglasses and headphones. He clicks his fingers to the music from his Walkman, smiling contentedly as Mickey's voice narrates over the sunlit scene. As Mickey concludes his thoughts, Hannah approaches her front door and opens it to find Mickey standing there with two boxed gifts. She nods patiently, patting Mickey on the back as they move through the foyer into the den, where the twins are playing. Mickey, still in his coat, hands a gift to each twin, who then set them down and hug their father. Mickey throws a football, resulting in the sound of breaking glass, prompting reactions from both Hannah and Mickey. Later, Mickey walks up a West Side street with his hands in his coat pockets and enters Dr. Abel's office. The scene shifts to the doctor's consultation room, where Dr. Abel is seen through a doorway, searching a file cabinet while Mickey speaks offscreen. The camera follows Dr. Abel as he moves toward Mickey, briefly obscured by a wall, before revealing Mickey sitting on a stool in a second doorway, continuing his conversation. Dr. Abel returns onscreen, standing in front of Mickey, who is seated, and listens as Mickey talks. Dr. Abel chuckles, and an uptempo big-band sound transitions the scene to Mickey's examination. Dr. Abel uses an otoscope to examine Mickey's ear, then adjusts a sonometer while Mickey, wearing large earphones, listens intently, squinting and raising a finger in response to the sounds. Finally, Dr. Abel strikes a tuning fork and places it near Mickey's ear, prompting Mickey to nod in acknowledgment. Dr. Abel then exits the examining room, moving through the consultation room to another examining room."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The woman looks back at Ron; she gestures with disgust, a reaction stemming from their earlier disagreement at the bustling downtown coffee shop. Ron coughs, a persistent issue since he caught a cold during a rainy night at the outdoor concert. Gail walks around the chair. The camera shows she and Mickey talking to Ron through the reflection in the cluttered makeup mirror, which is covered with cosmetics and notes from the on-set stylist. Ron sighs. Mickey, as reflected in the mirror, starts to pace, his shoes tapping lightly on the wooden backstage floor of the old theater. Norman, a Los Angeles TV producer known for his work on popular sitcoms, and Mickey's former partner, is driving down a peaceful street lined with palm trees, a characteristic sight in Los Angeles neighborhoods like Beverly Hills. He's wearing sunglasses and headphones. He clicks his fingers in time to the music only he hears on his Walkman, a popular portable cassette player from the 1980s. He's smiling contentedly while Mickey talks over the sun-filled scene. As Mickey finishes his ruminations, Hannah is seen walking towards her front door of the house they recently renovated. She opens it, her back to the camera. Mickey stands there holding two boxed gifts, wrapped carefully after his visit to the upscale gift shop in town. Hannah continues to nod patiently, patting Mickey on the back, as they make their way across the foyer into the den, where the twins are playing with their set of wooden blocks. Mickey wears his coat, a reminder of the chilly weather outside. Mickey hands a gift to each twin. The twins put down their gifts, one on the sofa, one on the coffee table, and hug their father with childlike enthusiasm. Mickey throws the football, an impromptu game sparked by the twins' encouragement. There's a sound of breaking glass, probably from the antique vase on the mantel. Hannah and Mickey react. Mickey is walking up a West Side street, the vibrant urban neighborhood known for its cultural diversity, his hands in his coat pockets. Mickey pushes open the outside door of Dr. Abel's office, a small practice renowned for its personalized care, as the movie cuts to the doctor's consultation room. The doctor is framed in the doorway, looking through a file cabinet filled with medical records. While Mickey answers him offscreen, Dr. Abel turns and walks toward him, his white coat swaying slightly. The camera follows the doctor's movements from the other side of the wall, obscuring him briefly. It moves across a dark examining-room wall to a second doorway, where Mickey sits on a stool, continuing to talk to the offscreen Dr. Abel, expressing his concerns about his recent health issues. Dr. Abel walks back onscreen. Both he and Mickey are now seen through the second doorway. Dr. Abel sniffs and stands directly in front of the sitting Mickey. He stares down at him as Mickey talks about his symptoms. Dr. Abel chuckles, sharing a moment of lightness in the otherwise serious consultation. An uptempo big-band sound, reminiscent of the jazz records Mickey enjoys, is heard as the movie cuts to Mickey's examination, beginning with a close-up of Dr. Abel using an otoscope to examine the ear of a nervous Mickey. The film shows the doctor's hands turning the dials on a sonometer, an instrument used to test hearing. Mickey sits on a nearby high stool, large earphones on his head, which are part of the standard auditory testing equipment. He listens with such concentration that he squints his eyes. He holds up a finger in response to the sounds he hears in his headset, indicating he can hear the tones. Finally, the film shows Dr. Abel hitting a large tuning fork with his finger. He puts the vibrating fork to Mickey's ear, a traditional method for assessing hearing acuity. Mickey, looking up at the offscreen doctor's face, nods in understanding. Dr. Abel walks from the examining room, through the consultation room, to a second examining room across the way, preparing for his next patient."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The woman looks back at Ron  she gestures with disgust  Ron coughs  Gail walks around the chair  The camera shows she and Mickey talking to Ron through the reflection in the cluttered makeup mirror  Ron sighs  Mickey as reflected in the mirror starts to pace  Hannah and Mickey react  Mickey is walking up a West Side street his hands in his coat pockets  Mickey pushes open the outside door of Dr Abel's office as the movie cuts to the doctor's consultation room  The doctor is framed in the doorway looking through a file cabinet  While Mickey answers him offscreen Dr Abel turns and walks toward him  The camera follows the doctor's movements from the other side of the wall obscuring him briefly  It moves across a dark examiningroom wall to a second doorway where Mickey sits on a stool continuing to talk to the offscreen Dr Abel  Dr Abel walks back onscreen  Both he and Mickey are now seen through the second doorway  Dr Abel sniffs and stands directly in front of the sitting Mickey  He stares down at him as Mickey talks  Dr Abel chuckles  An uptempo bigband sound is heard as the movie cuts to Mickey's examination beginning with a closeup of Dr Abel using an otoscope to examine the ear of a nervous Mickey  The film shows the doctor's hands turning the dials on a sonometer  Mickey sits on a nearby high stool large earphones on his head  He listens with such concentration that he squints his eyes  He holds up a finger in response to the sounds he hears in his headset  Finally the film shows Dr Abel hitting a large tuning fork with his finger  He puts the vibrating fork to Mickey's ear  Mickey looking up at the offscreen doctor's face nods  Dr Abel walks from the examining room through the consultation room to a second examining room across the way Norman a Los Angeles TV producer and Mickey's former partner is driving down a peaceful street lined with palm trees  He's wearing sunglasses and headphones  He clicks his fingers in time to the music only he hears on his Walkman  He's smiling contentedly while Mickey talks over the sunfilled scene  As Mickey finishes his ruminations Hannah is seen walking towards her front door  She opens it her back to the camera  Mickey stands there holding two boxed gifts  Hannah continues to nod patiently patting Mickey on the back as they make their way across the foyer into the den where the twins are playing  Mickey wears his coat  Mickey hands a gift to each twin  The twins put down their gifts one on the sofa one on the coffee table and hug their father  Mickey throws the football  There's a sound of breaking glass  Hannah and Mickey react  Mickey is walking up a West Side street his hands in his coat pockets  Mickey pushes open the outside door of Dr Abel's office as the movie cuts to the doctor's consultation room  The doctor is framed in the doorway looking through a file cabinet  While Mickey answers him offscreen Dr Abel turns and walks toward him  The camera follows the doctor's movements from the other side of the wall obscuring him briefly  It moves across a dark examiningroom wall to a second doorway where Mickey sits on a stool continuing to talk to the offscreen Dr Abel  Dr Abel walks back onscreen  Both he and Mickey are now seen through the second doorway  Dr Abel sniffs and stands directly in front of the sitting Mickey  He stares down at him as Mickey talks  Dr Abel chuckles  An uptempo bigband sound is heard as the movie cuts to Mickey's examination beginning with a closeup of Dr Abel using an otoscope to examine the ear of a nervous Mickey  The film shows the doctor's hands turning the dials on a sonometer  Mickey sits on a nearby high stool large earphones on his head  He listens with such concentration that he squints his eyes  He holds up a finger in response to the sounds he hears in his headset  Finally the film shows Dr Abel hitting a large tuning fork with his finger  He puts the vibrating fork to Mickey's ear  Mickey looking up at the offscreen doctor's face nods  Dr Abel walks from the examining room through the consultation room to a second examining room across the way"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The woman looks back at Ron. she gestures with disgust. Ron coughs. Gail walks around the chair. The camera shows she and Mickey talking to Ron through the reflection in the cluttered makeup mirror. Ron sighs. Mickey as reflected in the mirror starts to pace. Norman a Los Angeles TV producer and Mickey's former partner is driving down a peaceful street lined with palm trees. He is wearing sunglasses and headphones. He clicks his fingers in time to the music only he hears on his Walkman. He is smiling contentedly while Mickey talks over the sunfilled scene. As Mickey finishes his ruminations Hannah is seen walking towards her front door. She opens it her back to the camera. Mickey stands there holding two boxed gifts. Hannah continues to nod patiently patting Mickey on the back as they make their way across the foyer into the den where the twins are playing. Mickey wears his coat. Mickey hands a gift to each twin. The twins put down their gifts one on the sofa one on the coffee table and hug their father. Mickey throws the football. There is a sound of breaking glass. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Hannah and Mickey react. Mickey is walking up a West Side street his hands in his coat pockets. Mickey pushes open the outside door of Dr Abel's office as the movie cuts to the doctor's consultation room. The doctor is framed in the doorway looking through a file cabinet. While Mickey answers him offscreen Dr Abel turns and walks toward him. The camera follows the doctor's movements from the other side of the wall obscuring him briefly. It moves across a dark examiningroom wall to a second doorway where Mickey sits on a stool continuing to talk to the offscreen Dr Abel. Dr Abel walks back onscreen. Both he and Mickey are now seen through the second doorway. Dr Abel sniffs and stands directly in front of the sitting Mickey. He stares down at him as Mickey talks. Dr Abel chuckles. An uptempo bigband sound is heard as the movie cuts to Mickey's examination beginning with a closeup of Dr Abel using an otoscope to examine the ear of a nervous Mickey. The film shows the doctor's hands turning the dials on a sonometer. Mickey sits on a nearby high stool large earphones on his head. He listens with such concentration that he squints his eyes. He holds up a finger in response to the sounds he hears in his headset. Finally the film shows Dr Abel hitting a large tuning fork with his finger. He puts the vibrating fork to Mickey's ear. Mickey looking up at the offscreen doctor's face nods. Dr Abel walks from the examining room through the consultation room to a second examining room across the way."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The woman looks back at Ron. she gestures with disgust. Ron coughs. Gail walks around the chair. The camera shows she and Mickey talking to Ron through the reflection in the cluttered makeup mirror. Ron sighs. Mickey as reflected in the mirror starts to pace. Norman a Los Angeles TV producer and Mickey's former partner is driving down a peaceful street lined with palm trees. He is wearing sunglasses and headphones. He clicks his fingers in time to the music only he hears on his Walkman. He is smiling contentedly while Mickey talks over the sunfilled scene. As Mickey finishes his ruminations Hannah is seen walking towards her front door. She opens it her back to the camera. Mickey stands there holding two boxed gifts. Hannah continues to nod patiently patting Mickey on the back as they make their way across the foyer into the den where the twins are playing. Mickey wears his coat. Mickey hands a gift to each twin. The twins put down their gifts one on the sofa one on the coffee table and hug their father. Mickey throws the football. There is a sound of breaking glass. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Hannah and Mickey react. Mickey is walking up a West Side street his hands in his coat pockets. Mickey pushes open the outside door of Dr Abel's office as the movie cuts to the doctor's consultation room. The doctor is framed in the doorway looking through a file cabinet. While Mickey answers him offscreen Dr Abel turns and walks toward him. The camera follows the doctor's movements from the other side of the wall obscuring him briefly. It moves across a dark examiningroom wall to a second doorway where Mickey sits on a stool continuing to talk to the offscreen Dr Abel. Dr Abel walks back onscreen. Both he and Mickey are now seen through the second doorway. Dr Abel sniffs and stands directly in front of the sitting Mickey. He stares down at him as Mickey talks. Dr Abel chuckles. An uptempo bigband sound is heard as the movie cuts to Mickey's examination beginning with a closeup of Dr Abel using an otoscope to examine the ear of a nervous Mickey. The film shows the doctor's hands turning the dials on a sonometer. Mickey sits on a nearby high stool large earphones on his head. He listens with such concentration that he squints his eyes. He holds up a finger in response to the sounds he hears in his headset. Finally the film shows Dr Abel hitting a large tuning fork with his finger. He puts the vibrating fork to Mickey's ear. Mickey looking up at the offscreen doctor's face nods. Dr Abel walks from the examining room through the consultation room to a second examining room across the way."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The woman looks back at Ron. she gestures with disgust. Ron coughs. Gail walks around the chair. The camera shows she and Mickey talking to Ron through the reflection in the cluttered makeup mirror. Ron sighs. Mickey as reflected in the mirror starts to pace. Norman a Los Angeles TV producer and Mickey's former partner is driving down a peaceful street lined with palm trees. He is wearing sunglasses and headphones. He clicks his fingers in time to the music only he hears on his Walkman. He stares down at him as Mickey talks. Dr Abel chuckles. An uptempo bigband sound is heard as the movie cuts to Mickey's examination beginning with a closeup of Dr Abel using an otoscope to examine the ear of a nervous Mickey. The film shows the doctor's hands turning the dials on a sonometer. Mickey sits on a nearby high stool large earphones on his head. He listens with such concentration that he squints his eyes. He holds up a finger in response to the sounds he hears in his headset. Finally the film shows Dr Abel hitting a large tuning fork with his finger. He puts the vibrating fork to Mickey's ear. Mickey looking up at the offscreen doctor's face nods. Dr Abel walks from the examining room through the consultation room to a second examining room across the way."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The woman looks back at Ron. she gestures with disgust. Ron coughs. Gail walks around the chair. He holds up a finger in response to the sounds he hears in his headset. Finally the film shows Dr Abel hitting a large tuning fork with his finger. He puts the vibrating fork to Mickey's ear. Mickey looking up at the offscreen doctor's face nods. Dr Abel walks from the examining room through the consultation room to a second examining room across the way."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog looks back at the dolphin; the dog gestures with disgust. The dolphin coughs. The cat walks around the chair. The camera shows the cat and the penguin talking to the dolphin through the reflection in the cluttered makeup mirror. The dolphin sighs. The penguin, as reflected in the mirror, starts to pace. The squirrel, a Los Angeles TV producer and the penguin's former partner, is driving down a peaceful street lined with palm trees. The squirrel is wearing sunglasses and headphones. The squirrel clicks its fingers in time to the music only it hears on its Walkman. It's smiling contentedly while the penguin talks over the sun-filled scene. As the penguin finishes its ruminations, the rabbit is seen walking towards its front door. It opens it, its back to the camera. The penguin stands there holding two boxed gifts. The rabbit continues to nod patiently, patting the penguin on the back, as they make their way across the foyer into the den, where the owls are playing. The penguin wears its coat. The penguin hands a gift to each owl. The owls put down their gifts, one on the sofa, one on the coffee table, and hug their father. The penguin throws the football. There's a sound of breaking glass. The rabbit and the penguin react. The penguin is walking up a West Side street, its hands in its coat pockets. The penguin pushes open the outside door of Dr. Koala's office, as the movie cuts to the doctor's consultation room. The doctor is framed in the doorway, looking through a file cabinet. While the penguin answers him offscreen, Dr. Koala turns and walks toward it. The camera follows the doctor's movements from the other side of the wall, obscuring him briefly. It moves across a dark examining-room wall to a second doorway, where the penguin sits on a stool, continuing to talk to the offscreen Dr. Koala. Dr. Koala walks back onscreen. Both he and the penguin are now seen through the second doorway. Dr. Koala sniffs and stands directly in front of the sitting penguin. He stares down at it as the penguin talks. Dr. Koala chuckles. An uptempo big-band sound is heard as the movie cuts to the penguin's examination, beginning with a close-up of Dr. Koala using an otoscope to examine the ear of a nervous penguin. The film shows the doctor's hands turning the dials on a sonometer. The penguin sits on a nearby high stool, large earphones on its head. It listens with such concentration that it squints its eyes. It holds up a finger in response to the sounds it hears in its headset. Finally, the film shows Dr. Koala hitting a large tuning fork with his finger. He puts the vibrating fork to the penguin's ear. The penguin, looking up at the offscreen doctor's face, nods. Dr. Koala walks from the examining room, through the consultation room, to a second examining room across the way."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The woman looks back at Ron; she gestures with disgust. Ron coughs. Gail walks around the sofa. The lens shows she and Mickey talking to Ron through the reflection in the cluttered vanity mirror. Ron sighs. Mickey, as reflected in the mirror, starts to pace. Norman, a Los Angeles TV producer and Mickey's former partner, is driving down a tranquil avenue lined with pine trees. He's wearing goggles and earbuds. He snaps his fingers in time to the music only he hears on his Discman. He's smiling contentedly while Mickey talks over the rain-filled scene. As Mickey finishes his ruminations, Hannah is seen walking towards her back gate. She opens it, her back to the lens. Mickey stands there holding two wrapped packages. Hannah continues to nod patiently, patting Mickey on the shoulder, as they make their way across the hallway into the library, where the twins are playing. Mickey wears his jacket. Mickey hands a package to each twin. The twins put down their packages, one on the recliner, one on the end table, and hug their father. Mickey throws the frisbee. There's a sound of breaking porcelain. Hannah and Mickey react. Mickey is walking up an East Side avenue, his hands in his jacket pockets. Mickey pushes open the front door of Dr. Abel's clinic, as the film cuts to the doctor's office room. The doctor is framed in the archway, looking through a filing box. While Mickey answers him offscreen, Dr. Abel turns and walks toward him. The lens follows the doctor's movements from the other side of the partition, obscuring him briefly. It moves across a dim examining-room partition to a second archway, where Mickey sits on a cushion, continuing to talk to the offscreen Dr. Abel. Dr. Abel walks back onscreen. Both he and Mickey are now seen through the second archway. Dr. Abel sniffs and stands directly in front of the sitting Mickey. He stares down at him as Mickey talks. Dr. Abel chuckles. An uptempo jazz tune is heard as the film cuts to Mickey's examination, beginning with a close-up of Dr. Abel using a stethoscope to examine the chest of a nervous Mickey. The film shows the doctor's hands turning the buttons on a metronome. Mickey sits on a nearby tall cushion, large headphones on his head. He listens with such concentration that he squints his eyes. He holds up a finger in response to the sounds he hears in his headset. Finally, the film shows Dr. Abel hitting a large gong with his finger. He puts the vibrating gong to Mickey's shoulder. Mickey, looking up at the offscreen doctor's face, nods. Dr. Abel walks from the examining room, through the office room, to a second examining room across the way."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The woman glances back at Ron; she groans with disgust. Ron sneezes. Gail skips around the chair. The camera captures she and Mickey painting to Ron through the reflection in the cluttered makeup mirror. Ron chuckles. Mickey, as reflected in the mirror, starts to fidget. Norman, a Los Angeles TV producer and Mickey's former partner, is strolling down a peaceful street lined with palm trees. He's wearing sunglasses and headphones. He taps his feet in time to the music only he hears on his Walkman. He's grinning broadly while Mickey sketches over the sun-filled scene. As Mickey completes his musings, Hannah is seen dancing towards her front door. She slides it, her back to the camera. Mickey stands there holding two boxed gifts. Hannah continues to hum patiently, patting Mickey on the shoulder, as they waltz their way across the foyer into the den, where the twins are painting. Mickey wears his coat. Mickey tosses a gift to each twin. The twins place their gifts, one on the sofa, one on the coffee table, and high-five their father. Mickey kicks the football. There's a sound of breaking glass. Hannah and Mickey gasp. Mickey is sauntering up a West Side street, his hands in his coat pockets. Mickey swings open the outside door of Dr. Abel's office, as the movie shifts to the doctor's consultation room. The doctor is perched in the doorway, sorting through a file cabinet. While Mickey narrates offscreen, Dr. Abel spins and hops toward him. The camera tracks the doctor's movements from the other side of the wall, hiding him briefly. It pans across a dim examining-room wall to a second doorway, where Mickey lounges on a stool, continuing to chat to the offscreen Dr. Abel. Dr. Abel shuffles back onscreen. Both he and Mickey are now visible through the second doorway. Dr. Abel snorts and leans directly in front of the sitting Mickey. He gazes down at him as Mickey rambles. Dr. Abel smirks. An uptempo big-band sound is heard as the movie transitions to Mickey's examination, starting with a close-up of Dr. Abel waving an otoscope to peer into the ear of a nervous Mickey. The film shows the doctor's hands spinning the dials on a sonometer. Mickey perches on a nearby high stool, large earphones on his head. He listens with such focus that he wrinkles his nose. He raises a finger in reaction to the sounds he hears in his headset. Finally, the film shows Dr. Abel striking a large tuning fork with his palm. He places the vibrating fork to Mickey's ear. Mickey, glancing up at the offscreen doctor's face, nods. Dr. Abel dances from the examining room, through the consultation room, to a second examining room across the way."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The cloud looks back at the stapler; it gestures with disgust. The stapler coughs. The watermelon walks around the tractor. The mailbox shows it and the book talking to the stapler through the reflection in the cluttered toaster. The stapler sighs. The book, as reflected in the toaster, starts to pace. The pencil, a Los Angeles TV producer and the book's former partner, is driving down a peaceful hallway lined with curtains. It's wearing shoes and a helmet. It clicks its fingers in time to the painting only it hears on its Walkman. It's smiling contentedly while the book talks over the sun-filled blanket. As the book finishes its ruminations, the volcano is seen walking towards its front elevator. It opens it, its back to the mailbox. The book stands there holding two boxed sandwiches. The volcano continues to nod patiently, patting the book on the shoulder, as they make their way across the pantry into the attic, where the tires are playing. The book wears its blanket. The book hands a sandwich to each tire. The tires put down their sandwiches, one on the trampoline, one on the shoebox, and hug their dinosaur. The book throws the frisbee. There's a sound of breaking ice. The volcano and the book react. The book is walking up a West Side ladder, its hands in its blanket pockets. The book pushes open the outside elevator of Dr. Yarn's bedroom, as the movie cuts to the doctor's consultation balcony. The doctor is framed in the escalator, looking through a file bucket. While the book answers it offscreen, Dr. Yarn turns and walks toward it. The mailbox follows the doctor's movements from the other side of the screen, obscuring it briefly. It moves across a dark examining-room screen to a second escalator, where the book sits on a donut, continuing to talk to the offscreen Dr. Yarn. Dr. Yarn walks back onscreen. Both it and the book are now seen through the second escalator. Dr. Yarn sniffs and stands directly in front of the sitting book. It stares down at it as the book talks. Dr. Yarn chuckles. An uptempo big-band rain is heard as the movie cuts to the book's examination, beginning with a close-up of Dr. Yarn using an otoscope to examine the ear of a nervous book. The film shows the doctor's hands turning the dials on a sonometer. The book sits on a nearby high donut, large earphones on its head. It listens with such concentration that it squints its eyes. It holds up a muffin in response to the sounds it hears in its headset. Finally, the film shows Dr. Yarn hitting a large tuning drum with its shoe. It puts the vibrating drum to the book's ear. The book, looking up at the offscreen doctor's face, nods. Dr. Yarn walks from the examining room, through the consultation balcony, to a second examining room across the way."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The cat glances back at Lucy; it waves with enthusiasm. Lucy sneezes. Dave tiptoes around the table. The camera displays he and Charlie whispering to Lucy through the reflection in the pristine bathroom mirror. Lucy groans. Charlie, as reflected in the mirror, begins to hop. Oliver, a Chicago radio announcer and Charlie's former assistant, is jogging down a bustling boulevard lined with lampposts. He's wearing a hat and earbuds. He snaps his fingers in time to the music only he hears on his smartphone. He's grinning cheerfully while Charlie narrates over the moonlit scene. As Charlie concludes his observations, Emily is noticed running towards her garage door. She closes it, her back to the camera. Charlie stands there holding two caged birds. Emily continues to wave eagerly, patting Charlie on the arm, as they wander through the kitchen into the dining room, where the pets are sleeping. Charlie wears his scarf. Charlie passes a treat to each pet. The pets set aside their treats, one on the carpet, one on the bookshelf, and chase their owner. Charlie bounces the basketball. There's a sound of exploding fireworks. Emily and Charlie giggle. Charlie is skipping down a South Side avenue, his hands in his sweater pockets. Charlie slides open the inside door of Dr. Bennett's clinic, as the movie shifts to the vet's office. The vet is silhouetted in the hallway, sorting through a file drawer. While Charlie responds offscreen, Dr. Bennett turns and hops toward him. The camera trails the vet's steps from the opposite side of the room, hiding him momentarily. It drifts across a bright waiting-room wall to a third doorway, where Charlie perches on a couch, continuing to chat with the offscreen Dr. Bennett. Dr. Bennett strides back onscreen. Both she and Charlie are now visible through the third doorway. Dr. Bennett inhales and stands directly in front of the reclining Charlie. She peers down at him as Charlie talks. Dr. Bennett guffaws. An upbeat jazz tune is played as the movie transitions to Charlie's check-up, beginning with a close-up of Dr. Bennett using a magnifier to examine the eye of a calm Charlie. The film shows the vet’s hands adjusting the settings on a monitor. Charlie rests on a nearby lounge chair, small earbuds in his ears. He listens with such focus that he widens his eyes. He raises a hand in response to the sounds he hears in his earbuds. Finally, the film shows Dr. Bennett tapping a small triangle with her hand. She places the resonating triangle to Charlie's eye. Charlie, glancing at the offscreen vet's expression, agrees. Dr. Bennett strolls from the waiting room, through the treatment area, to a third exam room on the opposite side."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The woman glances back at Ron; she signals with amusement. Ron sneezes. Gail dances around the sofa. The camera reveals she and Mickey chatting with Ron through the reflection in the messy dressing room mirror. Ron yawns. Mickey, as seen in the mirror, starts to hop. Norman, a Los Angeles TV producer and Mickey's former partner, is floating down a bustling avenue lined with sunflowers. He's wearing a hat and earmuffs. He taps his foot in rhythm with the tune only he imagines on his Discman. He's grinning cheerfully while Mickey narrates over the rain-soaked scene. As Mickey concludes his musings, Hannah is glimpsed marching towards her garden gate. She swings it open, her side to the camera. Mickey stands there holding two wrapped books. Hannah continues to shake her head thoughtfully, tapping Mickey on the shoulder, as they journey across the hallway into the studio, where the twins are singing. Mickey wears his scarf. Mickey hands a book to each twin. The twins set down their books, one on the recliner, one on the kitchen counter, and high-five their father. Mickey kicks the soccer ball. There's a sound of a shattering vase. Hannah and Mickey jump. Mickey is jogging up a South Side avenue, his hands in his scarf loops. Mickey pushes open the garage door of Dr. Abel's office, as the film transitions to the doctor's kitchen. The doctor is framed in the entrance, peering through a bookshelf. While Mickey replies offscreen, Dr. Abel spins and jogs toward him. The camera captures the doctor's steps from behind a curtain, hiding him momentarily. It glides across a dim waiting-room wall to a second entrance, where Mickey perches on a swing, continuing to converse with the offscreen Dr. Abel. Dr. Abel twirls back onscreen. Both he and Mickey are now visible through the second entrance. Dr. Abel whistles and stands directly over the reclining Mickey. He gazes down at him as Mickey chats. Dr. Abel snorts. A lively jazz melody is heard as the film shifts to Mickey's appointment, beginning with a close-up of Dr. Abel using a magnifying glass to inspect the nose of a jittery Mickey. The movie shows the doctor's hands twisting the knobs on a kaleidoscope. Mickey perches on a nearby bench, large goggles on his head. He watches with such focus that he widens his eyes. He waves a hand in response to the images he sees in his goggles. Finally, the film displays Dr. Abel striking a large cymbal with his palm. He places the resonating cymbal near Mickey's nose. Mickey, peering up at the offscreen doctor's face, shakes his head. Dr. Abel strolls from the waiting room, through the lobby, to a second consultation room across the corridor."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat glances back at Tim; it waves with delight. Tim sneezes. Lisa hops over the couch. The telescope displays she and Jamie whispering to Tim through the reflection in the pristine dining mirror. Tim chuckles. Jamie, as mirrored in the reflection, starts to dance. Oliver, a Chicago fashion designer and Jamie's previous associate, is cycling down a bustling avenue lined with skyscrapers. He's wearing a cap and earmuffs. He snaps his toes in rhythm to the podcast only he perceives on his radio. He's grinning joyfully while Jamie sings over the moonlit scene. As Jamie concludes his musings, Sandra is spotted jogging towards her garage. She shuts it, her face to the telescope. Jamie stands there holding two wrapped books. Sandra continues to shake her head vigorously, tapping Jamie on the shoulder, as they meander across the balcony into the pantry, where the pets are sleeping. Jamie wears his scarf. Jamie drops a book to each pet. The pets leap over their books, one on the mattress, one on the dinner plate, and cuddle their owner. Jamie tosses the frisbee. There's a sound of shattering ceramic. Sandra and Jamie jump. Jamie is strolling down an East Side avenue, his hands in his scarf pockets. Jamie pulls closed the wooden gate of Dr. Keller's clinic, as the movie shifts to the nurse's consultation room. The nurse is bordered in the window, peering through a bookshelf. While Jamie questions her offscreen, Nurse Keller spins and skips toward him. The telescope captures the nurse's steps from the opposite side of the painting, hiding her momentarily. It glides across a dim waiting-room tapestry to a first window, where Jamie reclines on a bench, continuing to question the offscreen Nurse Keller. Nurse Keller skips back onscreen. Both she and Jamie are now visible through the first window. Nurse Keller snorts and stands directly beside the reclining Jamie. She peers across at him as Jamie questions. Nurse Keller giggles. A slow classical waltz is heard as the movie shifts to Jamie's measurement, beginning with a close-up of Nurse Keller using a stethoscope to measure the neck of a confident Jamie. The film displays the nurse's hands flipping the switches on a barometer. Jamie leans on a distant low chair, small gloves on his hands. He observes with such relaxation that he relaxes his lips. He shakes a toe in reaction to the vibrations he senses in his mittens. Subsequently, the film displays Nurse Keller tapping a tiny harp with her toe. She places the resonating harp to Jamie's neck. Jamie, glancing down at the offscreen nurse's shoes, shakes a foot. Nurse Keller skips out of the measuring room, through the consultation window, to a first measuring room along the sidewalk."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The scene opens with Ron, Gail, and Mickey in a room, with Ron feeling frustrated. Meanwhile, Norman, a TV producer and Mickey's ex-partner, drives contently through Los Angeles. Mickey then visits Hannah, bringing gifts for their twins, who warmly embrace him. During a game, a window breaks, causing surprise. Mickey later walks to Dr. Abel's office, entering for a consultation. The doctor searches the file cabinet while Mickey speaks. They move to an examination room, where Dr. Abel uses an otoscope and sonometer to evaluate a tense Mickey's hearing. Mickey listens intently through headphones, responding to the sounds, and nods when Dr. Abel tests his ear with a tuning fork. The doctor concludes the examination, moving to another room."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Dr Abel walks from the examining room through the consultation room to a second examining room across the way Mickey looking up at the offscreen doctor's face nods  He puts the vibrating fork to Mickey's ear  Finally the film shows Dr Abel hitting a large tuning fork with his finger  He holds up a finger in response to the sounds he hears in his headset  He listens with such concentration that he squints his eyes  Mickey sits on a nearby high stool large earphones on his head  The film shows the doctor's hands turning the dials on a sonometer  An uptempo bigband sound is heard as the movie cuts to Mickey's examination beginning with a closeup of Dr Abel using an otoscope to examine the ear of a nervous Mickey  Dr Abel chuckles  He stares down at him as Mickey talks  Dr Abel sniffs and stands directly in front of the sitting Mickey  Both he and Mickey are now seen through the second doorway  Dr Abel walks back onscreen  It moves across a dark examiningroom wall to a second doorway where Mickey sits on a stool continuing to talk to the offscreen Dr Abel  The camera follows the doctor's movements from the other side of the wall obscuring him briefly  While Mickey answers him offscreen Dr Abel turns and walks toward him  The doctor is framed in the doorway looking through a file cabinet  Mickey pushes open the outside door of Dr Abel's office as the movie cuts to the doctor's consultation room  Mickey is walking up a West Side street his hands in his coat pockets  Hannah and Mickey react  There's a sound of breaking glass  Mickey throws the football  The twins put down their gifts one on the sofa one on the coffee table and hug their father  Mickey hands a gift to each twin  Mickey wears his coat  Hannah continues to nod patiently patting Mickey on the back as they make their way across the foyer into the den where the twins are playing  Mickey stands there holding two boxed gifts  She opens it her back to the camera  As Mickey finishes his ruminations Hannah is seen walking towards her front door  He's smiling contentedly while Mickey talks over the sunfilled scene  He clicks his fingers in time to the music only he hears on his Walkman  He's wearing sunglasses and headphones  Norman a Los Angeles TV producer and Mickey's former partner is driving down a peaceful street lined with palm trees  Mickey as reflected in the mirror starts to pace  Ron sighs  The camera shows she and Mickey talking to Ron through the reflection in the cluttered makeup mirror  Gail walks around the chair  Ron coughs  she gestures with disgust  The woman looks back at Ron "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Hannah continues to nod patiently patting Mickey on the back as they make their way across the foyer into the den where the twins are playing  Mickey wears his coat  Mickey stands there holding two boxed gifts  The woman looks back at Ron  An uptempo bigband sound is heard as the movie cuts to Mickey's examination beginning with a closeup of Dr Abel using an otoscope to examine the ear of a nervous Mickey  She opens it her back to the camera  Dr Abel walks back onscreen  He's wearing sunglasses and headphones  The camera follows the doctor's movements from the other side of the wall obscuring him briefly  He stares down at him as Mickey talks  Dr Abel chuckles  He's smiling contentedly while Mickey talks over the sunfilled scene  Finally the film shows Dr Abel hitting a large tuning fork with his finger  The camera shows she and Mickey talking to Ron through the reflection in the cluttered makeup mirror  The doctor is framed in the doorway looking through a file cabinet  Gail walks around the chair  Both he and Mickey are now seen through the second doorway  Mickey is walking up a West Side street his hands in his coat pockets  He listens with such concentration that he squints his eyes  The film shows the doctor's hands turning the dials on a sonometer  she gestures with disgust  He holds up a finger in response to the sounds he hears in his headset  Mickey looking up at the offscreen doctor's face nods  Mickey as reflected in the mirror starts to pace  Mickey throws the football  As Mickey finishes his ruminations Hannah is seen walking towards her front door  There's a sound of breaking glass  Hannah and Mickey react  It moves across a dark examiningroom wall to a second doorway where Mickey sits on a stool continuing to talk to the offscreen Dr Abel  He clicks his fingers in time to the music only he hears on his Walkman  The twins put down their gifts one on the sofa one on the coffee table and hug their father  Ron sighs  While Mickey answers him offscreen Dr Abel turns and walks toward him  Norman a Los Angeles TV producer and Mickey's former partner is driving down a peaceful street lined with palm trees  Mickey sits on a nearby high stool large earphones on his head  Dr Abel sniffs and stands directly in front of the sitting Mickey  Ron coughs  Mickey hands a gift to each twin  He puts the vibrating fork to Mickey's ear  Dr Abel walks from the examining room through the consultation room to a second examining room across the way Mickey pushes open the outside door of Dr Abel's office as the movie cuts to the doctor's consultation room "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Mickey is walking up a West Side street his hands in his coat pockets  Mickey pushes open the outside door of Dr Abel's office as the movie cuts to the doctor's consultation room  The doctor is framed in the doorway looking through a file cabinet  While Mickey answers him offscreen Dr Abel turns and walks toward him  The camera follows the doctor's movements from the other side of the wall obscuring him briefly  It moves across a dark examiningroom wall to a second doorway where Mickey sits on a stool continuing to talk to the offscreen Dr Abel  Dr Abel walks back onscreen  Both he and Mickey are now seen through the second doorway  Dr Abel sniffs and stands directly in front of the sitting Mickey  He stares down at him as Mickey talks  Dr Abel chuckles  An uptempo bigband sound is heard as the movie cuts to Mickey's examination beginning with a closeup of Dr Abel using an otoscope to examine the ear of a nervous Mickey  The film shows the doctor's hands turning the dials on a sonometer  Mickey sits on a nearby high stool large earphones on his head  He listens with such concentration that he squints his eyes  He holds up a finger in response to the sounds he hears in his headset  Finally the film shows Dr Abel hitting a large tuning fork with his finger  He puts the vibrating fork to Mickey's ear  Mickey looking up at the offscreen doctor's face nods  Dr Abel walks from the examining room through the consultation room to a second examining room across the way The woman looks back at Ron  she gestures with disgust  Ron coughs  Gail walks around the chair  The camera shows she and Mickey talking to Ron through the reflection in the cluttered makeup mirror  Ron sighs  Mickey as reflected in the mirror starts to pace  Norman a Los Angeles TV producer and Mickey's former partner is driving down a peaceful street lined with palm trees  He's wearing sunglasses and headphones  He clicks his fingers in time to the music only he hears on his Walkman  He's smiling contentedly while Mickey talks over the sunfilled scene  As Mickey finishes his ruminations Hannah is seen walking towards her front door  She opens it her back to the camera  Mickey stands there holding two boxed gifts  Hannah continues to nod patiently patting Mickey on the back as they make their way across the foyer into the den where the twins are playing  Mickey wears his coat  Mickey hands a gift to each twin  The twins put down their gifts one on the sofa one on the coffee table and hug their father  Mickey throws the football  There's a sound of breaking glass  Hannah and Mickey react "
        }
      ]
    }
  ]
}