{
  "ground_truth": "The movie cuts to Holly's point of view: the front seat where David and April sit, the Jaguar's windshield, and the passing lights and traffic of the street. Holly continues her ruminations as April leans over to say something to David. The film moves back to Holly in the backseat, still lost in thought. The screen cuts to black and a title appears. The movie briefly holds on a ripped, red, paint-splattered door as Elliot, wearing a raincoat, appears nearby. He looks down the street and the film cuts to his point of view: Frederick's loft building. The movie goes back to the impatient Elliot; he's looking around him. He glances at his watch as the film cuts back once again to the loft building, where Lee finally appears, walking down the street away from Elliot. A truck passes down the street. She walks further and further away; she turns a corner. Elliot frantically looks around again; then, in a burst of decision, he runs around a garbage dump, crossing the street, and still running, he moves down an adjacent street, past The Canal Lumber Company and several other buildings, as the film cuts back to Lee, walking down a different street, oblivious. The jazz plays on as the movie cuts back and forth between the fast-moving Elliot, rushing down the SoHo streets, past a truck waiting for a light to change, past some pedestrians, some garbage cans, turning corners, and the strolling Lee, walking up different streets, past different buildings. Lee eventually crosses a street, lost in thought, looking right and left, as Elliot, pretending nonchalance, waits on the corner, looking at his watch. She looks up in surprise; the music stops. They begin to walk down the street. She shrugs. They begin to walk again as the movie cuts to the interior of the Pageant Book & Print Shop, an old, serious bookstore. A nude print hangs at the end of one of the library shelf-like bookcases, which are packed, row after row, with books. An unseen Elliot and Lee carry on a conversation as the camera moves down an aisle, past the rows of books. Pictures hang on the aisle ends of the shelves. The camera moves past another aisle of books to reveal Lee, browsing through a shelf. She walks down a center aisle, the camera still in its parallel aisle, following her. Lee stops at the row where Elliot has been browsing. She is hidden by a shelf; only Elliot is seen as he talks to the offscreen Lee. Elliot starts walking down the center aisle, in the same direction Lee had walked up. He continues to talk to her as she remains offscreen in a nearby row.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The film shifts to Holly's perspective: the front seat where David and April sit, the Jaguar's windshield, and the passing illuminations and traffic of the road. Holly continues her reflections as April leans over to utter something to David. The picture moves back to Holly in the backseat, still absorbed in thought. The screen fades to black and a caption emerges. The film briefly holds on a torn, crimson, paint-splattered portal as Elliot, wearing a raincoat, appears nearby. He peers down the road and the picture shifts to his perspective: Frederick's loft edifice. The film reverts to the impatient Elliot; he's glancing around him. He peeks at his timepiece as the picture shifts back once again to the loft edifice, where Lee finally emerges, strolling down the road away from Elliot. A lorry moves down the road. She strides further and further away; she turns a bend. Elliot frantically surveys around again; then, in a surge of determination, he dashes around a refuse dump, traversing the road, and still running, he moves down an adjacent road, past The Canal Lumber Company and several other edifices, as the picture shifts back to Lee, strolling down a separate road, unaware. The jazz resounds on as the film shifts back and forth between the fast-moving Elliot, rushing down the SoHo roads, past a lorry waiting for a signal to change, past some pedestrians, some refuse bins, turning bends, and the ambling Lee, strolling up different roads, past different edifices. Lee eventually traverses a road, absorbed in thought, glancing right and left, as Elliot, feigning nonchalance, waits on the bend, glancing at his timepiece. She glances up in astonishment; the melody halts. They begin to stroll down the road. She shrugs. They commence to traverse again as the film shifts to the interior of the Pageant Book & Print Shop, an old, serious bookshop. A nude engraving hangs at the end of one of the library shelf-like bookcases, which are filled, row after row, with books. An unseen Elliot and Lee continue a dialogue as the camera moves down an aisle, past the rows of tomes. Pictures hang on the aisle ends of the bookcases. The camera moves past another aisle of tomes to reveal Lee, perusing through a shelf. She progresses down a center aisle, the camera still in its parallel aisle, following her. Lee pauses at the row where Elliot has been perusing. She is obscured by a shelf; only Elliot is visible as he converses with the offscreen Lee. Elliot starts progressing down the center aisle, in the same direction Lee had strolled up. He continues to converse with her as she remains offscreen in a nearby row."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The movie is cut to Holly's point of view: the front seat where David and April are seated, the Jaguar's windshield, and the passing lights and traffic of the street. Holly's ruminations are continued by her as April leans over to say something to David. The film is moved back to Holly in the backseat, still lost in thought. The screen is cut to black and a title is made to appear. The movie briefly holds on a ripped, red, paint-splattered door as Elliot, wearing a raincoat, is nearby. He looks down the street and the film is cut to his point of view: Frederick's loft building. The movie is brought back to the impatient Elliot; he looks around him. He glances at his watch as the film is cut back once again to the loft building, where Lee finally appears, walking down the street away from Elliot. A truck is passed down the street. She walks further and further away; she turns a corner. Elliot frantically looks around again; then, in a burst of decision, a garbage dump is run around by him, the street is crossed, and still running, an adjacent street is moved down by him, past The Canal Lumber Company and several other buildings, as the film is cut back to Lee, walking down a different street, oblivious. The jazz plays on as the movie is cut back and forth between the fast-moving Elliot, rushing down the SoHo streets, past a truck waiting for a light to change, past some pedestrians, some garbage cans, turning corners, and Lee strolling, walking up different streets, past different buildings. A street is eventually crossed by Lee, lost in thought, looking right and left, as the corner is waited on by Elliot, pretending nonchalance, looking at his watch. She looks up in surprise; the music stops. They begin to walk down the street. She shrugs. They begin to walk again as the interior of the Pageant Book & Print Shop, an old, serious bookstore, is shown by the movie. A nude print is hung at the end of one of the library shelf-like bookcases, which are packed, row after row, with books. A conversation is carried on by Elliot and Lee, unseen, as an aisle is moved down by the camera, past the rows of books. Pictures are hung at the aisle ends of the shelves. The camera is moved past another aisle of books to reveal Lee, browsing through a shelf. She walks down a center aisle, the parallel aisle is still followed by the camera, following her. The row where Elliot has been browsing is stopped at by Lee. She is hidden by a shelf; only Elliot is seen as he talks to Lee offscreen. The center aisle is started down by Elliot, in the same direction Lee had walked up. He continues to talk to her as she remains offscreen in a nearby row."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The movie shifts to Holly's perspective: she observes David and April in the front seat, the Jaguar's windshield, and street traffic. As April whispers to David, Holly remains deep in thought. A black screen with a title follows. A scene shows a ripped, red, paint-splattered door, with Elliot in a raincoat nearby, looking toward Frederick's loft. Impatient, Elliot checks his watch, then sees Lee walking away. A truck passes; Lee turns a corner. Elliot decides to run, passing the Canal Lumber Company and other buildings, while Lee walks, unaware. Jazz plays as the film alternates between Elliot rushing through SoHo and Lee, lost in thought, crossing streets. Elliot waits at a corner; Lee appears surprised, and they walk together. The movie cuts to the Pageant Book & Print Shop, an old-fashioned bookstore. The camera follows rows of books, showing Lee browsing. Lee stops by a shelf where Elliot is visible, while she remains hidden. Elliot walks and talks to the offscreen Lee."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The movie shifts to Holly's view: David and April in the front seat, the Jaguar's windshield, and passing street lights. Holly ponders while April talks to David. The scene returns to Holly, deep in thought. A black screen and title appear. A ripped, red door is shown; Elliot, in a raincoat, appears, looking down the street. It cuts to his view: Frederick's loft. Impatient Elliot checks his watch as Lee walks away from him. A truck passes; Lee turns a corner. Elliot decides to run, crossing the street and rushing past buildings, as Lee walks elsewhere, unaware. Jazz plays while the film alternates between fast-moving Elliot and strolling Lee. She crosses a street, Elliot waits, checks his watch; she looks surprised, the music halts. They walk together, enter the Pageant Book & Print Shop. A nude print hangs at the back; rows of books line the shelves. Unseen, Elliot and Lee converse as the camera moves down aisles. Lee browses through books, walks down a center aisle parallel to the camera. She stops by Elliot’s row, hidden by a shelf, listening to him. Elliot walks down the aisle, talking to the offscreen Lee."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The film takes a dramatic turn as it shifts focus to Holly's perspective, capturing her view from the backseat of the luxurious car. The scene is framed by the front seat where David and April are seated, the Jaguar’s expansive windshield, and the array of city lights illuminating the night, complemented by the bustling street traffic. As Holly continues her deep contemplations, April leans closer to David to whisper something, adding a sense of intimacy to the moment. The camera then smoothly transitions back to Holly, who remains in the backseat, still absorbed in her reflections. Abruptly, the scene fades to black, and a stark title appears on the screen, creating a sense of anticipation and suspense. \n\nThe movie briefly focuses on a vivid visual: a torn, red, paint-splattered door standing out in the scene, as Elliot enters the frame wearing a practical raincoat. He casts his gaze down the street, and the film seamlessly transitions to show us his perspective: the imposing facade of Frederick’s loft building. The narrative quickly returns to an evidently impatient Elliot, who glances around anxiously. He checks the time on his wristwatch, and the scene once again cuts back to the looming loft building, as Lee finally makes her appearance, walking purposefully down the street and away from Elliot. A large truck rumbles by on the street, momentarily obstructing our view. \n\nLee continues to walk determinedly, moving further and further into the distance until she eventually turns a corner, disappearing from direct sight. Elliot, visibly agitated, looks around frantically, and then, propelled by a sudden resolve, he darts around a nearby garbage dump. He crosses the street hastily and continues running energetically, down an adjacent street, weaving past The Canal Lumber Company as well as several other notable buildings, while the camera seamlessly cuts back to Lee, who is strolling down a different street entirely, seemingly unaware of Elliot's hurried pursuit.\n\nThe scene continues to unfold with a jazz soundtrack playing in the background, rhythmically synchronizing with the alternating shots of Elliot, who is making rapid progress through the energetic streets of SoHo. He rushes past a truck waiting patiently for a traffic light to change, and skillfully navigates around pedestrians and scattered garbage cans, turning corners with urgency. Meanwhile, Lee meanders up different streets, passing various buildings lost in her own private thoughts. Eventually, Lee crosses a bustling street, her mind still preoccupied, as she glances about, looking both right and left. In a contrasting moment of feigned calm, Elliot waits on the corner, checking his watch as she approaches. Lee looks up, surprised by his presence, and the music abruptly halts, leaving only the ambient sounds of the city.\n\nTogether, they begin to walk side by side down the street, Lee nonchalantly shrugging at the situation. They continue their walk as the scene changes to the inside of the Pageant Book & Print Shop, an establishment with an air of antiquity and seriousness about it. The shop is filled with a maze of library shelf-like bookcases, each densely packed, row upon row, with an array of books. A striking nude print conspicuously hangs at the end of one of the bookcases, adding an artistic touch to the shop's decor. As Elliot and Lee, unseen by the camera, engage in conversation, the focus shifts to the camera, which glides gracefully down an aisle, passing by countless rows of books. Pictures are sporadically hung on the aisle ends of the shelves, adding character. The camera continues its journey through another aisle and eventually reveals Lee, browsing through a shelf thoughtfully. She walks along a central aisle as the camera, positioned in a parallel aisle, follows her discreetly.\n\nLee pauses at the row where Elliot has been browsing, subtly hidden behind a shelf, leaving only Elliot visible as he speaks to the offscreen Lee. Elliot then begins to walk down the central aisle, heading in the very direction Lee had previously walked. He continues to engage her in conversation, though she remains offscreen in the nearby row, her presence felt but unseen."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the film unfolds, it takes a notably dramatic turn, directing its attention to the perspective of Holly, capturing her unique view from her position in the backseat of the luxurious and elegant car. The scene is meticulously framed by the front seat, where both David and April are comfortably seated. The expansive windshield of the Jaguar, along with the myriad of city lights illuminating the night sky, and the vibrant, bustling traffic on the streets, all come together to set the scene. While Holly remains engaged in her deep and thoughtful contemplations, April leans in closer to David to whisper something softly to him, adding an intimate and personal touch to this moment. The camera then transitions smoothly back to Holly, who is still seated in the back, fully absorbed in her reflections and musings. Suddenly, without warning, the scene fades to black, and a stark, bold title appears on the screen, successfully creating a tantalizing sense of anticipation and suspense.\n\nThe movie then shifts its brief focus to a vivid and striking visual: a torn, red, paint-splattered door that prominently stands out within the scene. At this moment, Elliot enters the frame wearing a practical and functional raincoat. He casts his gaze steadily down the street, and the film seamlessly transitions to show us his perspective: the imposing and majestic facade of Frederick’s loft building. The narrative swiftly returns to Elliot, who is clearly displaying signs of impatience, as he glances around anxiously. He checks the time on his wristwatch, and then the scene abruptly cuts back to the looming loft building. Lee finally makes her appearance, walking with purpose and determination down the street, moving away from Elliot. A large truck rumbles noisily by on the street, momentarily obstructing our view of the unfolding scene.\n\nContinuing her determined walk, Lee moves further and further away, into the distance, until she ultimately turns a corner and disappears from direct sight. Meanwhile, Elliot, visibly agitated by the situation, frantically looks around and, propelled by a sudden sense of resolve, darts around a nearby garbage dump. He hastily crosses the street and continues running energetically down an adjacent street, weaving past The Canal Lumber Company along with several other notable buildings in the area. The camera then seamlessly cuts back to Lee, who is strolling leisurely down a different street entirely, seemingly unaware of Elliot's hurried and energetic pursuit.\n\nThe scene continues to unfold with a lively jazz soundtrack playing in the background, rhythmically synchronizing with the alternating shots of Elliot, who is making rapid and determined progress through the energetic streets of SoHo. He rushes past a truck that is patiently waiting for the traffic light to change and skillfully navigates around pedestrians and scattered garbage cans, turning corners with a sense of urgency. Meanwhile, Lee meanders up different streets, passing various buildings while being lost in her own private and introspective thoughts. Eventually, Lee crosses a bustling street, her mind still preoccupied, as she glances about, looking both right and left. In a contrasting and unexpected moment of feigned calm, Elliot waits on the corner, checking his watch as she approaches. Lee looks up, clearly surprised by his presence, and the music abruptly halts, leaving only the ambient and natural sounds of the city surrounding them.\n\nTogether, they begin to walk side by side down the street, with Lee nonchalantly shrugging at the situation. They continue their walk as the scene gradually transitions to the inside of the Pageant Book & Print Shop, an establishment that exudes an air of antiquity and seriousness. The shop is filled with a maze-like arrangement of library shelf-style bookcases, each densely packed, row upon row, with a diverse and extensive array of books. A striking nude print is conspicuously hung at the end of one of the bookcases, adding an artistic and sophisticated touch to the shop's overall decor. As Elliot and Lee, unseen by the camera, engage in conversation, the focus shifts to the camera itself, which glides gracefully down an aisle, passing by countless rows of books. Pictures are sporadically hung on the ends of the shelves, adding character to the scene. The camera continues its journey along another aisle and eventually reveals Lee, who is browsing thoughtfully through a shelf. She walks along a central aisle as the camera, positioned in a parallel aisle, discreetly follows her movements.\n\nLee pauses at the row where Elliot has been browsing, remaining subtly hidden behind a shelf and leaving only Elliot visible as he speaks to the offscreen Lee. Elliot then begins to walk down the central aisle, heading in the very direction that Lee had previously walked. He continues to engage her in conversation, though she remains offscreen in the nearby row, her presence felt but unseen, adding a layer of intrigue and depth to the unfolding interaction."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The movie transitions to Holly's perspective, focusing on the front seat where David and April are situated, along with the view through the Jaguar's windshield showcasing the passing lights and bustling traffic of the street. Holly, engaged in her reflections, observes as April leans over to whisper something to David. The scene shifts back to Holly in the backseat, still absorbed in her thoughts, when the screen abruptly cuts to black and a title materializes. The film lingers momentarily on a ripped, red door adorned with splatters of paint, as Elliot, attired in a raincoat, comes into view nearby. He casts his gaze down the street, prompting the scene to transition to his perspective, displaying Frederick's loft building. The narrative shifts back to Elliot, who appears restless and scans his surroundings before glancing at his watch, leading the scene to return once more to the loft building, where Lee finally emerges into view, striding down the street away from Elliot. A truck trundles down the street as she continues to walk further away, eventually turning a corner. Elliot, gripped by urgency, surveys his surroundings once more before making a sudden decision to dash around a garbage dump, crossing the street, and continuing to sprint along an adjacent street, passing The Canal Lumber Company and several other buildings. Meanwhile, the film cuts back to Lee, who remains unaware as she ambles down a different street. The jazz soundtrack persists, punctuating the alternating scenes of the rapidly moving Elliot, who rushes down the SoHo streets, skirting a truck waiting at a traffic light, weaving past pedestrians and garbage cans, and navigating around corners, juxtaposed against Lee's unhurried stroll along various streets, past diverse buildings. Eventually, Lee crosses a street, lost in her musings, glancing around as Elliot, feigning casualness, waits at the corner, checking his watch. She suddenly looks up, surprised, and the music halts. They proceed to walk down the street together, with Lee shrugging, and after a brief pause, they continue their walk, as the scene shifts to the interior of the Pageant Book & Print Shop, an old, dignified bookstore. At the end of one of the library shelf-like bookcases, a nude print is displayed, while the shelves themselves are densely packed with rows upon rows of books. An unseen Elliot and Lee engage in conversation as the camera glides down an aisle, passing the orderly rows of books. Pictures adorn the aisle ends of the shelves as the camera progresses past another aisle to finally reveal Lee, who is perusing a bookshelf. She meanders down a central aisle, with the camera positioned in a parallel aisle, tracking her movement. Lee pauses at the row where Elliot has been browsing, becoming obscured by a shelf; only Elliot is visible as he converses with the offscreen Lee. Elliot then begins to walk down the center aisle, retracing the path Lee had taken, continuing his conversation with her, who remains out of sight in a nearby row."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The movie shifts to Holly's perspective, showing the front seat where David and April are seated, along with the Jaguar's windshield and the passing streetlights and traffic. Holly continues her reflections as April leans over to speak with David. The scene returns to Holly, deep in thought in the backseat, before cutting to black as a title appears. The focus then shifts to a scene with Elliot, who, clad in a raincoat, stands near a ripped, red, paint-splattered door. He glances down the street towards Frederick's loft building, checking his watch impatiently, as he waits for Lee. When he finally spots her walking away from him, he sprints across the street and down an adjacent street, passing The Canal Lumber Company and other buildings. Meanwhile, Lee, unaware of Elliot's pursuit, strolls down different streets, absorbed in her thoughts. The scene alternates between Elliot's hurried pursuit through SoHo and Lee's unhurried walk past various buildings. Eventually, Lee crosses a street, and Elliot, feigning nonchalance, waits at the corner. Surprised to see him, Lee shrugs, and they walk together as the scene transitions to the interior of the Pageant Book & Print Shop. The camera pans through the bookstore, lined with library shelf-like bookcases packed with books, and an unseen Elliot and Lee engage in conversation. As the camera moves past rows of books, it reveals Lee browsing a shelf, while Elliot, visible in a parallel aisle, talks to her. Elliot then walks down the center aisle, continuing their conversation as Lee remains offscreen."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The movie cuts to Holly's point of view: the front seat where David and April sit, the Jaguar's windshield framing the scene with its iconic leaping feline emblem associated with luxury, and the passing lights and traffic of the bustling New York street. Holly continues her ruminations as April leans over to say something to David. The film moves back to Holly in the backseat, still lost in thought. The screen cuts to black and a title appears. The movie briefly holds on a ripped, red, paint-splattered door that once belonged to an artist's studio in the vibrant art district, as Elliot, wearing a raincoat to shield against the sudden downpour, appears nearby. He looks down the street and the film cuts to his point of view: Frederick's loft building, a renowned venue for avant-garde exhibitions. The movie goes back to the impatient Elliot; he's looking around him. He glances at his watch, an heirloom from his grandfather, as the film cuts back once again to the loft building, where Lee finally appears, walking down the street away from Elliot. A delivery truck passes down the street, its daily rounds interrupted by the unfolding drama. She walks further and further away; she turns a corner decorated with street art by local artists. Elliot frantically looks around again; then, in a burst of decision, he runs around a garbage dump overflowing with refuse from nearby restaurants, crossing the street, and still running, he moves down an adjacent street, past The Canal Lumber Company, a historic supplier in the area, and several other buildings, as the film cuts back to Lee, walking down a different street, oblivious to Elliot's pursuit. The jazz plays on, reminiscent of 1950s bebop, as the movie cuts back and forth between the fast-moving Elliot, rushing down the SoHo streets renowned for their cast-iron architecture, past a truck waiting for a light to change, past some pedestrians engrossed in their own worlds, some garbage cans lined up for collection, turning corners like a character in a noir film, and the strolling Lee, walking up different streets, past different buildings with stories to tell. Lee eventually crosses a street, lost in thought, looking right and left, as Elliot, pretending nonchalance, waits on the corner, looking at his watch as if to remind himself of time's incessant march. She looks up in surprise; the music stops, leaving a poignant silence. They begin to walk down the street, stepping in sync with the city’s heartbeat. She shrugs, a gesture of resignation or acceptance. They begin to walk again as the movie cuts to the interior of the Pageant Book & Print Shop, an old, serious bookstore reputed for its rare and out-of-print collections. A nude print hangs at the end of one of the library shelf-like bookcases, which are packed, row after row, with books, some of which are first editions of literary classics. An unseen Elliot and Lee carry on a conversation as the camera moves down an aisle, past the rows of books that hold worlds within them. Pictures hang on the aisle ends of the shelves, depicting the history of the literary giants who once graced these aisles. The camera moves past another aisle of books to reveal Lee, browsing through a shelf filled with poetry volumes. She walks down a center aisle, the camera still in its parallel aisle, following her. Lee stops at the row where Elliot has been browsing, an area known for its philosophical texts. She is hidden by a shelf; only Elliot is seen as he talks to the offscreen Lee, discussing themes of existentialism. Elliot starts walking down the center aisle, in the same direction Lee had walked up, mirroring her path. He continues to talk to her as she remains offscreen in a nearby row, their voices weaving together in the stillness of the room."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The film moves back to Holly in the backseat still lost in thought The movie cuts to Holly's point of view the front seat where David and April sit the Jaguar's windshield and the passing lights and traffic of the street Lee eventually crosses a street lost in thought looking right and left as Elliot pretending nonchalance waits on the corner looking at his watch Holly continues her ruminations as April leans over to say something to David The film moves back to Holly in the backseat still lost in thought The screen cuts to black and a title appears The movie briefly holds on a ripped red paintsplattered door as Elliot wearing a raincoat appears nearby He looks down the street and the film cuts to his point of view Frederick's loft building The movie goes back to the impatient Elliot The movie goes back to the impatient Elliot he is looking around him She looks up in surprise He glances at his watch as the film cuts back once again to the loft building where Lee finally appears walking down the street away from Elliot A truck passes down the street She walks further and further away He continues to talk to her as she remains offscreen in a nearby row she turns a corner The screen cuts to black and a title appears Pictures hang on the aisle ends of the shelves Elliot frantically looks around again then in a burst of decision he runs around a garbage dump crossing the street and still running Elliot starts walking down the center aisle in the same direction he is looking around him The movie cuts to Holly's point of view the front seat where David and April sit the Jaguar's windshield and the passing lights and traffic of the street he moves down an adjacent street past The Canal Lumber Company and several other buildings as the film cuts back to Lee walking down a different street oblivious The jazz plays on as the movie cuts back and forth between the fastmoving Elliot rushing down the SoHo streets past a truck waiting for a light to change past some pedestrians some garbage cans turning corners and the strolling Lee walking up different streets past different buildings Lee eventually crosses a street lost in thought looking right and left as Elliot pretending nonchalance waits on the corner looking at his watch She looks up in surprise the music stops Lee had walked up They begin to walk down the street She shrugs They begin to walk again as the movie cuts to the interior of the Pageant Book  Print Shop an old serious bookstore A nude print hangs at the end of one of the library shelflike bookcases which are packed row after row with books She shrugs A nude print hangs at the end of one of the library shelflike bookcases which are packed row after row with books An unseen Elliot and Lee carry on a conversation as the camera moves down an aisle past the rows of books Pictures hang on the aisle ends of the shelves The camera moves past another aisle of books to reveal Lee browsing through a shelf She walks down a center aisle the camera still in its parallel aisle following her Lee stops at the row where Elliot has been browsing She is hidden by a shelf only the camera still in its parallel aisle following her The movie briefly holds on a ripped red paintsplattered door as Elliot wearing a raincoat appears nearby Holly continues her ruminations as April leans over to say something to David Elliot is seen as he talks to the offscreen Lee then in a burst of decision he runs around a garbage dump crossing the street and still running The jazz plays on as the movie cuts back and forth between the fastmoving Elliot rushing down the SoHo streets past a truck waiting for a light to change past some pedestrians Elliot starts walking down the center aisle in the same direction Lee had walked up He continues to talk to her as she remains offscreen in a nearby row"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The movie cuts to Holly's point of view the front seat where David and April sit the Jaguar's windshield and the passing lights and traffic of the street. Holly continues her ruminations as April leans over to say something to David. The film moves back to Holly in the backseat still lost in thought. The screen cuts to black and a title appears. The movie briefly holds on a ripped red paintsplattered door as Elliot wearing a raincoat appears nearby. He looks down the street and the film cuts to his point of view Frederick's loft building. The movie goes back to the impatient Elliot. he is looking around him. He glances at his watch as the film cuts back once again to the loft building where Lee finally appears walking down the street away from Elliot. A truck passes down the street. She walks further and further away. she turns a corner. Elliot frantically looks around again. then in a burst of decision he runs around a garbage dump crossing the street and still running. he moves down an adjacent street past The Canal Lumber Company and several other buildings as the film cuts back to Lee walking down a different street oblivious. The jazz plays on as the movie cuts back and forth between the fastmoving Elliot rushing down the SoHo streets past a truck waiting for a light to change past some pedestrians. some garbage cans turning corners and the strolling Lee walking up different streets past different buildings. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Lee eventually crosses a street lost in thought looking right and left as Elliot pretending nonchalance waits on the corner looking at his watch. She looks up in surprise. the music stops. They begin to walk down the street. She shrugs. They begin to walk again as the movie cuts to the interior of the Pageant Book  Print Shop an old serious bookstore. A nude print hangs at the end of one of the library shelflike bookcases which are packed row after row with books. An unseen Elliot and Lee carry on a conversation as the camera moves down an aisle past the rows of books. Pictures hang on the aisle ends of the shelves. The camera moves past another aisle of books to reveal Lee browsing through a shelf. She walks down a center aisle. the camera still in its parallel aisle following her. Lee stops at the row where Elliot has been browsing. She is hidden by a shelf only. Elliot is seen as he talks to the offscreen Lee. Elliot starts walking down the center aisle in the same direction. Lee had walked up. He continues to talk to her as she remains offscreen in a nearby row."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The movie cuts to Holly's point of view the front seat where David and April sit the Jaguar's windshield and the passing lights and traffic of the street. Holly continues her ruminations as April leans over to say something to David. The film moves back to Holly in the backseat still lost in thought. The screen cuts to black and a title appears. The movie briefly holds on a ripped red paintsplattered door as Elliot wearing a raincoat appears nearby. He looks down the street and the film cuts to his point of view Frederick's loft building. The movie goes back to the impatient Elliot. he is looking around him. He glances at his watch as the film cuts back once again to the loft building where Lee finally appears walking down the street away from Elliot. A truck passes down the street. She walks further and further away. she turns a corner. Elliot frantically looks around again. then in a burst of decision he runs around a garbage dump crossing the street and still running. he moves down an adjacent street past The Canal Lumber Company and several other buildings as the film cuts back to Lee walking down a different street oblivious. The jazz plays on as the movie cuts back and forth between the fastmoving Elliot rushing down the SoHo streets past a truck waiting for a light to change past some pedestrians. some garbage cans turning corners and the strolling Lee walking up different streets past different buildings. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Lee eventually crosses a street lost in thought looking right and left as Elliot pretending nonchalance waits on the corner looking at his watch. She looks up in surprise. the music stops. They begin to walk down the street. She shrugs. They begin to walk again as the movie cuts to the interior of the Pageant Book  Print Shop an old serious bookstore. A nude print hangs at the end of one of the library shelflike bookcases which are packed row after row with books. An unseen Elliot and Lee carry on a conversation as the camera moves down an aisle past the rows of books. Pictures hang on the aisle ends of the shelves. The camera moves past another aisle of books to reveal Lee browsing through a shelf. She walks down a center aisle. the camera still in its parallel aisle following her. Lee stops at the row where Elliot has been browsing. She is hidden by a shelf only. Elliot is seen as he talks to the offscreen Lee. Elliot starts walking down the center aisle in the same direction. Lee had walked up. He continues to talk to her as she remains offscreen in a nearby row."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The movie cuts to Holly's point of view the front seat where David and April sit the Jaguar's windshield and the passing lights and traffic of the street. Holly continues her ruminations as April leans over to say something to David. The film moves back to Holly in the backseat still lost in thought. The screen cuts to black and a title appears. The movie briefly holds on a ripped red paintsplattered door as Elliot wearing a raincoat appears nearby. He looks down the street and the film cuts to his point of view Frederick's loft building. The movie goes back to the impatient Elliot. he is looking around him. He glances at his watch as the film cuts back once again to the loft building where Lee finally appears walking down the street away from Elliot. The camera moves past another aisle of books to reveal Lee browsing through a shelf. She walks down a center aisle. the camera still in its parallel aisle following her. Lee stops at the row where Elliot has been browsing. She is hidden by a shelf only. Elliot is seen as he talks to the offscreen Lee. Elliot starts walking down the center aisle in the same direction. Lee had walked up. He continues to talk to her as she remains offscreen in a nearby row."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The movie cuts to Holly's point of view the front seat where David and April sit the Jaguar's windshield and the passing lights and traffic of the street. Holly continues her ruminations as April leans over to say something to David. The film moves back to Holly in the backseat still lost in thought. Elliot is seen as he talks to the offscreen Lee. Elliot starts walking down the center aisle in the same direction. Lee had walked up. He continues to talk to her as she remains offscreen in a nearby row."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The movie cuts to a dog's point of view: the front seat where a cat and a rabbit sit, the Jaguar's windshield, and the passing lights and traffic of the street. A dog continues its ruminations as a rabbit leans over to say something to a cat. The film moves back to the dog in the backseat, still lost in thought. The screen cuts to black and a title appears. The movie briefly holds on a ripped, red, paint-splattered door as a penguin, wearing a raincoat, appears nearby. It looks down the street and the film cuts to its point of view: a giraffe's loft building. The movie goes back to the impatient penguin; it's looking around it. It glances at its watch as the film cuts back once again to the loft building, where a parrot finally appears, walking down the street away from the penguin. A truck passes down the street. It walks further and further away; it turns a corner. The penguin frantically looks around again; then, in a burst of decision, it runs around a garbage dump, crossing the street, and still running, it moves down an adjacent street, past The Canal Lumber Company and several other buildings, as the film cuts back to the parrot, walking down a different street, oblivious. The jazz plays on as the movie cuts back and forth between the fast-moving penguin, rushing down the SoHo streets, past a truck waiting for a light to change, past some pedestrians, some garbage cans, turning corners, and the strolling parrot, walking up different streets, past different buildings. The parrot eventually crosses a street, lost in thought, looking right and left, as the penguin, pretending nonchalance, waits on the corner, looking at its watch. It looks up in surprise; the music stops. They begin to walk down the street. It shrugs. They begin to walk again as the movie cuts to the interior of the Pageant Book & Print Shop, an old, serious bookstore. A nude print hangs at the end of one of the library shelf-like bookcases, which are packed, row after row, with books. An unseen penguin and parrot carry on a conversation as the camera moves down an aisle, past the rows of books. Pictures hang on the aisle ends of the shelves. The camera moves past another aisle of books to reveal the parrot, browsing through a shelf. It walks down a center aisle, the camera still in its parallel aisle, following it. The parrot stops at the row where the penguin has been browsing. It is hidden by a shelf; only the penguin is seen as it talks to the offscreen parrot. The penguin starts walking down the center aisle, in the same direction the parrot had walked up. It continues to talk to it as it remains offscreen in a nearby row."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The movie cuts to Holly's point of view: the front seat where David and April sit, the bicycle's handlebars, and the passing shadows and breeze of the forest. Holly continues her ruminations as April leans over to say something to David. The film moves back to Holly in the backseat, still lost in thought. The screen cuts to black and a title appears. The movie briefly holds on a torn, green, mud-splattered curtain as Elliot, wearing a windbreaker, appears nearby. He looks down the path and the film cuts to his point of view: Frederick's cottage. The movie goes back to the impatient Elliot; he's looking around him. He glances at his watch as the film cuts back once again to the cottage, where Lee finally appears, walking down the path away from Elliot. A bicycle passes down the path. She walks further and further away; she turns a corner. Elliot frantically looks around again; then, in a burst of decision, he runs around a sandpit, crossing the path, and still running, he moves down an adjacent path, past The Orchard Supply Company and several other buildings, as the film cuts back to Lee, walking down a different path, oblivious. The blues plays on as the movie cuts back and forth between the fast-moving Elliot, rushing down the Greenwich paths, past a motorcycle waiting for a signal to change, past some joggers, some recycling bins, turning corners, and the strolling Lee, walking up different paths, past different buildings. Lee eventually crosses a path, lost in thought, looking right and left, as Elliot, pretending nonchalance, waits on the corner, looking at his watch. She looks up in surprise; the music stops. They begin to walk down the path. She shrugs. They begin to walk again as the movie cuts to the interior of the Symposium Music & Art Shop, an old, serious art store. A sketch hangs at the end of one of the gallery shelf-like display cases, which are packed, row after row, with paintings. An unseen Elliot and Lee carry on a conversation as the camera moves down an aisle, past the rows of paintings. Photographs hang on the aisle ends of the displays. The camera moves past another aisle of paintings to reveal Lee, browsing through a shelf. She walks down a center aisle, the camera still in its parallel aisle, following her. Lee stops at the row where Elliot has been browsing. She is hidden by a display; only Elliot is seen as he talks to the offscreen Lee. Elliot starts walking down the center aisle, in the same direction Lee had walked up. He continues to talk to her as she remains offscreen in a nearby row."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The movie shifts to Holly's point of view: the front seat where David and April rest, the Jaguar's windshield, and the flickering lights and traffic of the street. Holly continues her reflections as April nudges over to mumble something to David. The film transitions back to Holly in the backseat, still deep in contemplation. The screen fades to black and a heading emerges. The movie briefly focuses on a cracked, red, paint-smeared door as Elliot, wearing a raincoat, emerges nearby. He peers up the street and the film transitions to his point of view: Frederick's loft building. The movie returns to the restless Elliot; he's scanning his surroundings. He checks his watch as the film transitions back once again to the loft building, where Lee eventually emerges, strolling down the street away from Elliot. A truck rolls down the street. She wanders further and further away; she veers around a corner. Elliot hurriedly scans his surroundings again; then, in a flash of determination, he jogs around a garbage dump, crossing the street, and continuing to jog, he proceeds down an adjacent street, past The Canal Lumber Company and numerous other buildings, as the film transitions back to Lee, wandering down a different street, unaware. The jazz continues as the movie transitions back and forth between the rapid-moving Elliot, dashing down the SoHo streets, past a truck idling at a light, past several pedestrians, a few garbage cans, rounding corners, and the meandering Lee, sauntering up different streets, past various buildings. Lee eventually crosses a street, engrossed in her thoughts, glancing right and left, as Elliot, feigning indifference, lingers on the corner, inspecting his watch. She glances up in astonishment; the music pauses. They start to stroll down the street. She gestures. They resume walking again as the movie transitions to the interior of the Pageant Book & Print Shop, an old, solemn bookstore. A nude print dangles at the end of one of the library shelf-like bookcases, which are filled, row after row, with books. An unseen Elliot and Lee engage in a conversation as the camera glides down an aisle, past the rows of books. Pictures are displayed on the aisle ends of the shelves. The camera glides past another aisle of books to reveal Lee, perusing through a shelf. She ambles down a center aisle, the camera still in its parallel aisle, trailing her. Lee pauses at the row where Elliot has been perusing. She is concealed by a shelf; only Elliot is visible as he converses with the offscreen Lee. Elliot begins ambling down the center aisle, in the same direction Lee had strolled up. He continues to converse with her as she remains offscreen in a nearby row."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The video cuts to Daisy's perspective: the back seat where Greg and Olivia sit, the Lamborghini's side window, and the flickering signs and bicycles of the avenue. Daisy continues her contemplations as Olivia leans over to whisper something to Greg. The footage shifts back to Daisy in the passenger seat, still deep in thought. The screen fades to white and a heading emerges. The clip briefly frames a shattered, green, graffiti-covered window as Oscar, wearing a trench coat, emerges nearby. He gazes up the avenue and the scene cuts to his perspective: Gerald's studio apartment. The video reverts to the restless Oscar; he's scanning around him. He checks his phone as the footage cuts back once again to the studio apartment, where Jamie finally appears, drifting up the avenue away from Oscar. A bicycle zooms up the avenue. She drifts further and further away; she rounds a bend. Oscar hurriedly scans around again; then, in a spontaneous decision, he darts around a flower cart, crossing the avenue, and still sprinting, he proceeds up a neighboring avenue, past The Riverine Hardware Store and several other establishments, as the footage cuts back to Jamie, drifting up another avenue, unaware. The blues music continues as the clip cuts back and forth between the swift Oscar, dashing up the Chelsea avenues, past a bicycle waiting for a signal to shift, past some passersby, some flower pots, rounding corners, and the meandering Jamie, strolling across varied avenues, past diverse stores. Jamie eventually traverses an avenue, absorbed in thought, glancing up and down, as Oscar, feigning casualness, waits by the intersection, glancing at his phone. She glances ahead in surprise; the melody halts. They start to stroll up the avenue. She sighs. They resume strolling as the video cuts to the inside of the Sonata Record & Music Store, an old, stately shop. A faded poster hangs at the end of one of the archive shelf-like racks, which are stacked, layer after layer, with records. An unseen Oscar and Jamie engage in conversation as the lens pans through an aisle, past the layers of records. Posters hang on the aisle ends of the racks. The lens pans past another aisle of records to uncover Jamie, perusing through a rack. She strolls through a central aisle, the lens still in its parallel aisle, shadowing her. Jamie halts at the section where Oscar has been perusing. She is obscured by a rack; only Oscar is visible as he converses with the offscreen Jamie. Oscar begins strolling through the central aisle, in the same route Jamie had drifted down. He keeps conversing with her as she stays offscreen in an adjacent section."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The video shifts to Rupert's perspective: the back seat where Samantha and Oliver lounge, the Volvo's rearview mirror, and the vibrant banners and people of the boardwalk. Rupert continues his reflections as Samantha shifts over to whisper something to Oliver. The scene transitions back to Rupert in the front seat, still engaged in contemplation. The picture fades to blue and a subtitle emerges. The film briefly lingers on a cracked, blue, sap-covered window as Martha, wearing a cape, materializes nearby. She gazes up the avenue and the scene transitions to her perspective: George's townhouse. The film returns to the restless Martha; she's scanning her surroundings. She checks her phone as the picture transitions once again to the townhouse, where Max finally emerges, cycling down the avenue away from Martha. A scooter rides up the road. He cycles farther and farther away; he veers around a bend. Martha hastily scans around again; then, with a spurt of action, she dances around a flowerbed, scaling the road, and still dancing, she heads down a neighboring avenue, past The Pier Furniture Store and several other shops, as the scene transitions back to Max, cycling down a separate avenue, unaware. The salsa beats on as the video shifts back and forth between the quick-stepping Martha, racing down the Queens avenues, past a taxi waiting for a signal to turn, past some bikers, some cafe tables, weaving through alleys, and the pedaling Max, cycling through different avenues, past other houses. Max eventually veers onto a road, lost in reverie, looking up and down, as Martha, feigning indifference, stands by a lamppost, checking her phone. He glances up in confusion; the soundtrack halts. They begin to cycle up the road. He shrugs. They continue to cycle as the scene transitions to the interior of the Harmony Music & Record Shop, a quaint, lively record store. A patterned album cover hangs at the end of one of the shelf-like displays, which are filled, stack after stack, with records. An undetected Martha and Max engage in a dialogue as the camera glides down an aisle, past the stacks of records. Posters hang on the aisle ends of the displays. The camera glides past another row of albums to unveil Max, perusing a shelf. He cycles down a central aisle, the camera still in its perpendicular aisle, tailing him. Max halts at the stack where Martha has been perusing. She is obscured by a display; only Max is visible as he converses with the offscreen Martha. Max begins cycling down the central aisle, in the opposite direction Martha had cycled along. He proceeds to converse with her as she stays offscreen in a nearby stack."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The movie cuts to Holly's point of view: the back seat where David and April rest, the bicycle's wheels, and the flickering stars and shadows of the city. Holly maintains her reflections as April stretches over to whisper something to David. The film transitions back to Holly in the trunk, still engrossed in contemplation. The screen fades to green and a phrase emerges. The movie briefly lingers on a shattered, blue, ink-splattered window as Elliot, wearing a trench coat, emerges nearby. He gazes up the alley, and the film jumps to his point of view: Frederick's tower building. The movie returns to the exasperated Elliot; he's examining around him. He peers at his phone as the film cuts back once again to the tower building, where Lee gradually appears, skipping down the alley away from Elliot. A bicycle zooms down the alley. She skips further and further away; she ducks into an alley. Elliot hastily peers around again; then, in a surge of decision, he dances around a newsstand, crossing the alley, and still dancing, he glides down an adjacent alley, past The Canal Furniture Company and several other towers, as the film cuts back to Lee, skipping down a different alley, unaware. The rock music plays on as the movie flips back and forth between the hurried Elliot, leaping down the SoHo alleys, past a bicycle waiting for a pedestrian to pass, past some street performers, some flower pots, hopping corners, and the striding Lee, gliding up different alleys, past different towers. Lee eventually crosses an alley, deep in reverie, peering up and down, as Elliot, feigning casualness, rests on the corner, glancing at his phone. She looks up in awe; the music halts. They begin to glide down the alley. She grins. They begin to glide again as the movie cuts to the interior of the Pageant Toy & Puzzle Shop, an old, playful wonderland. A colorful puzzle hangs at the end of one of the maze-like shelves, which are stacked, row after row, with games. An unseen Elliot and Lee engage in a dialogue as the camera maneuvers down a corridor, past the rows of games. Posters hang on the corridor ends of the shelves. The camera glides past another corridor of games to reveal Lee, sifting through a shelf. She strides down a main corridor, the camera still in its parallel corridor, trailing her. Lee pauses at the row where Elliot has been sifting. She is concealed by a shelf; only Elliot is visible as he chats with the offscreen Lee. Elliot begins striding down the main corridor, in the same direction Lee had glided up. He keeps chatting with her as she remains offscreen in a nearby row."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cartoon switches to Tim's angle: the backseat where Carla and Kevin lounge, the taxi's side window, and the flying birds and clouds of the sky. Tim continues his musings as Carla bends over to whisper something to Kevin. The animation shifts back to Tim in the front seat, still absorbed in curiosity. The screen fades to green and a message flashes. The cartoon briefly lingers on a shattered, blue, ink-dripped umbrella as Mark, donning a sweater, appears close by. He gazes across the garden and the animation switches to his view: Brenda's treehouse. The cartoon returns to the eager Mark; he's peering around him. He checks his phone as the animation switches back again to the treehouse, where Jill finally emerges, strolling up the path away from Mark. A bicycle rolls up the path. She strolls further and further away; she crosses a bridge. Mark anxiously peers around again; then, in a burst of choice, he dashes around a pile of leaves, traversing the garden, and still sprinting, he maneuvers down a parallel path, past The River Woodshop and various other gazebos, as the animation switches back to Jill, strolling up a different path, unaware. The blues echoes on as the cartoon switches back and forth between the speedy Mark, racing up the Farmville lanes, past a bicycle parked for a sign to switch, past some joggers, some bushes, rounding curves, and the ambling Jill, wandering along different paths, past other trees. Jill eventually crosses a path, deep in reflection, watching back and forth, as Mark, feigning ease, lingers on the curve, checking his phone. She glances up in shock; the melody halts. They commence to stroll down the path. She sighs. They resume to stroll again as the cartoon cuts to the inside of the Festival Cafe & Craft Store, a new, lively marketplace. A tribal mask hangs at the end of one of the aisle-like market stalls, which are cluttered, row after row, with trinkets. An unseen Mark and Jill engage in a dialogue as the camera pans down a lane, past the rows of trinkets. Posters hang on the lane ends of the stalls. The camera pans past another lane of trinkets to reveal Jill, perusing through a stall. She strolls down a middle lane, the camera still in its adjacent lane, following her. Jill halts at the row where Mark has been shopping. She is obscured by a stall; only Mark is visible as he chats with the offscreen Jill. Mark begins walking up the middle lane, in the same direction Jill had wandered down. He continues to converse with her as she remains offscreen in a close row."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The film shifts to Holly's perspective: she observes David and April in the front seat of a Jaguar, while city lights flash by. Holly remains deep in thought. The scene cuts to Elliot in a raincoat, focusing on Frederick's loft. Impatiently checking his watch, Elliot spots Lee walking away. He runs after her, navigating the streets and buildings, while Lee, lost in thought, strolls obliviously. Jazz plays as Elliot chases Lee through SoHo, dodging traffic and pedestrians. Eventually, they encounter each other at a street corner, surprising Lee as the music halts. They walk together, transitioning to the interior of an old bookstore, filled with rows of books and art. Lee browses as Elliot talks to her offscreen, moving through the aisles. Elliot walks toward Lee, conversing as she remains unseen."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He continues to talk to her as she remains offscreen in a nearby row Lee had walked up Elliot starts walking down the center aisle in the same direction Elliot is seen as he talks to the offscreen Lee She is hidden by a shelf only Lee stops at the row where Elliot has been browsing the camera still in its parallel aisle following her She walks down a center aisle The camera moves past another aisle of books to reveal Lee browsing through a shelf Pictures hang on the aisle ends of the shelves An unseen Elliot and Lee carry on a conversation as the camera moves down an aisle past the rows of books A nude print hangs at the end of one of the library shelflike bookcases which are packed row after row with books They begin to walk again as the movie cuts to the interior of the Pageant Book  Print Shop an old serious bookstore She shrugs They begin to walk down the street the music stops She looks up in surprise Lee eventually crosses a street lost in thought looking right and left as Elliot pretending nonchalance waits on the corner looking at his watch some garbage cans turning corners and the strolling Lee walking up different streets past different buildings The jazz plays on as the movie cuts back and forth between the fastmoving Elliot rushing down the SoHo streets past a truck waiting for a light to change past some pedestrians he moves down an adjacent street past The Canal Lumber Company and several other buildings as the film cuts back to Lee walking down a different street oblivious then in a burst of decision he runs around a garbage dump crossing the street and still running Elliot frantically looks around again she turns a corner She walks further and further away A truck passes down the street He glances at his watch as the film cuts back once again to the loft building where Lee finally appears walking down the street away from Elliot he is looking around him The movie goes back to the impatient Elliot He looks down the street and the film cuts to his point of view Frederick's loft building The movie briefly holds on a ripped red paintsplattered door as Elliot wearing a raincoat appears nearby The screen cuts to black and a title appears The film moves back to Holly in the backseat still lost in thought Holly continues her ruminations as April leans over to say something to David The movie cuts to Holly's point of view the front seat where David and April sit the Jaguar's windshield and the passing lights and traffic of the street"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "A truck passes down the street Elliot frantically looks around again He looks down the street and the film cuts to his point of view Frederick's loft building They begin to walk down the street Elliot is seen as he talks to the offscreen Lee They begin to walk again as the movie cuts to the interior of the Pageant Book  Print Shop an old serious bookstore Lee stops at the row where Elliot has been browsing some garbage cans turning corners and the strolling Lee walking up different streets past different buildings The camera moves past another aisle of books to reveal Lee browsing through a shelf An unseen Elliot and Lee carry on a conversation as the camera moves down an aisle past the rows of books he moves down an adjacent street past The Canal Lumber Company and several other buildings as the film cuts back to Lee walking down a different street oblivious She walks further and further away she turns a corner She walks down a center aisle He glances at his watch as the film cuts back once again to the loft building where Lee finally appears walking down the street away from Elliot the music stops She is hidden by a shelf only The movie goes back to the impatient Elliot Pictures hang on the aisle ends of the shelves The movie cuts to Holly's point of view the front seat where David and April sit the Jaguar's windshield and the passing lights and traffic of the street Lee had walked up then in a burst of decision he runs around a garbage dump crossing the street and still running She looks up in surprise The film moves back to Holly in the backseat still lost in thought Elliot starts walking down the center aisle in the same direction the camera still in its parallel aisle following her She shrugs The screen cuts to black and a title appears A nude print hangs at the end of one of the library shelflike bookcases which are packed row after row with books The movie briefly holds on a ripped red paintsplattered door as Elliot wearing a raincoat appears nearby He continues to talk to her as she remains offscreen in a nearby row The jazz plays on as the movie cuts back and forth between the fastmoving Elliot rushing down the SoHo streets past a truck waiting for a light to change past some pedestrians Lee eventually crosses a street lost in thought looking right and left as Elliot pretending nonchalance waits on the corner looking at his watch Holly continues her ruminations as April leans over to say something to David he is looking around him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She looks up in surprise the music stops They begin to walk down the street She shrugs They begin to walk again as the movie cuts to the interior of the Pageant Book  Print Shop an old serious bookstore A nude print hangs at the end of one of the library shelflike bookcases which are packed row after row with books An unseen Elliot and Lee carry on a conversation as the camera moves down an aisle past the rows of books Pictures hang on the aisle ends of the shelves The camera moves past another aisle of books to reveal Lee browsing through a shelf She walks down a center aisle the camera still in its parallel aisle following her Lee stops at the row where Elliot has been browsing She is hidden by a shelf only Elliot is seen as he talks to the offscreen Lee Elliot starts walking down the center aisle in the same direction Lee had walked up He continues to talk to her as she remains offscreen in a nearby row The movie cuts to Holly's point of view the front seat where David and April sit the Jaguar's windshield and the passing lights and traffic of the street Holly continues her ruminations as April leans over to say something to David The film moves back to Holly in the backseat still lost in thought The screen cuts to black and a title appears The movie briefly holds on a ripped red paintsplattered door as Elliot wearing a raincoat appears nearby He looks down the street and the film cuts to his point of view Frederick's loft building The movie goes back to the impatient Elliot he is looking around him He glances at his watch as the film cuts back once again to the loft building where Lee finally appears walking down the street away from Elliot A truck passes down the street She walks further and further away she turns a corner Elliot frantically looks around again then in a burst of decision he runs around a garbage dump crossing the street and still running he moves down an adjacent street past The Canal Lumber Company and several other buildings as the film cuts back to Lee walking down a different street oblivious The jazz plays on as the movie cuts back and forth between the fastmoving Elliot rushing down the SoHo streets past a truck waiting for a light to change past some pedestrians some garbage cans turning corners and the strolling Lee walking up different streets past different buildings Lee eventually crosses a street lost in thought looking right and left as Elliot pretending nonchalance waits on the corner looking at his watch"
        }
      ]
    }
  ]
}