{
  "ground_truth": "Elliot stops walking to browse through some books, then turns and walks back down the center aisle to a row of books he'd already passed. Lee walks over to Elliot in the center aisle, looks at the book, and he hands it to her. She thumbs through it, and later, Lee, holding the book in a brown bag, and Elliot are walking out. A taxi pulls over to the curb; they walk over to it, and Elliot opens the rear door for Lee. She laughs as she gets in. As Lee continues to read aloud, the movie cuts to Elliot's darkened den, lit by a light in the hallway. Elliot enters, wearing a robe, crossing the room in the dark, then turns on a light. The camera stays on his face as he looks off into the distance, mouthing indistinctly the line of poetry Lee next reads. The film leaves Elliot's face and cuts back to the loft, where Lee, having finished the poem, sits up in the bed, staring pensively, lost in her thoughts. Upbeat jazz begins to play, and the film cuts to the facade of Mount Sinai Hospital. A few cars whiz by as the film moves inside to various scenes depicting Mickey's comprehensive exam. First is a hearing test, and the movie cuts to a darkened hearing-test room. A light goes on, revealing a slouched-over Mickey sitting in a glass booth, wearing a set of headphones. The camera moves back, revealing a technician at the console on the other side of the booth. Mickey signals with his finger when he hears a sound on his headset. Next is an electronystagmography (ENG). Graph paper rolls out of a machine, and after a brief glimpse of the rolling paper, the camera moves over to show Mickey lying terrified, without his glasses, on a couch, with electrodes stuck all over his head. The film then cuts to a BSER test room, where Mickey, sitting in a corner chair, wears another set of headphones. An electrode is attached to his forehead; a nearby technician sits at a computer video screen, looking at a monitoring graph. Last but not least is the tomography. Over the shoulders of a technician in a booth, a large window displays a huge, white rotating machine. The camera moves down the giant cranelike device to reveal Mickey, once again lying down, this time on a table, his eyes closed, underneath it. A sitting Dr. Grey, his back to the camera, is examining a group of X-rays clipped to the light board behind his desk. The doctor turns his chair around to face a tense Mickey sitting on the other side of his desk.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Elliot halts strolling to peruse through some volumes, then rotates and ambles back down the center passageway to a series of volumes he'd already traversed. Lee ambles over to Elliot in the center passageway, gazes at the volume, and he hands it to her. She flips through it, and later, Lee, grasping the volume in a brown sack, and Elliot are strolling out. A cab pulls over to the verge; they amble over to it, and Elliot opens the rear portal for Lee. She chuckles as she gets in. As Lee continues to recite aloud, the film alters to Elliot's dimmed study, illuminated by a glow in the corridor. Elliot enters, donning a robe, crossing the chamber in the dark, then switches on a light. The camera remains on his visage as he gazes off into the expanse, mouthing indistinctly the verse of poetry Lee next recites. The film leaves Elliot's visage and alters back to the loft, where Lee, having completed the poem, rises up in the bed, gazing thoughtfully, absorbed in her musings. Upbeat jazz starts to play, and the film alters to the facade of Mount Sinai Infirmary. A few automobiles speed by as the film transitions inside to various sequences depicting Mickey's exhaustive assessment. First is an auditory examination, and the film alters to a dimmed auditory-examination chamber. A glow goes on, unveiling a slouched-over Mickey seated in a glass enclosure, donning a set of earphones. The camera transitions back, unveiling a technician at the console on the other side of the enclosure. Mickey signals with his digit when he perceives a sound on his earpiece. Next is an electronystagmography (ENG). Graph paper unfurls from a machine, and after a brief glance of the unfurling paper, the camera transitions over to exhibit Mickey lying terrified, without his spectacles, on a couch, with electrodes affixed all over his cranium. The film then alters to a BSER examination chamber, where Mickey, seated in a corner seat, dons another set of earphones. An electrode is affixed to his brow; a nearby technician sits at a computer video screen, gazing at a monitoring graph. Last but not least is the tomography. Over the shoulders of a technician in an enclosure, a large pane displays a huge, white rotating apparatus. The camera transitions down the gigantic cranelike device to unveil Mickey, once again reclining, this time on a table, his eyelids closed, underneath it. A seated Dr. Grey, his back to the camera, is inspecting a collection of X-rays clipped to the glow panel behind his desk. The physician swivels his chair around to confront a tense Mickey seated on the other side of his desk."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Some books are browsed through by Elliot, who stops walking, then a turn is made, and he walks back down the center aisle to a row of books he'd already passed. Elliot is walked over to by Lee in the center aisle, a look is given at the book, and it is handed to her by him. It is thumbed through by her, and later, Lee, holding the book in a brown bag, and Elliot walk out. The curb is pulled over to by a taxi; it is walked over to by them, and the rear door is opened by Elliot for Lee. She laughs as she gets in. As Lee continues to read aloud, Elliot's darkened den is cut to by the movie, lit by a light in the hallway. The room is crossed by Elliot, wearing a robe, then a light is turned on by him. His face is stayed on by the camera as a distant look is given by him, indistinctly mouthing the line of poetry next read by Lee. Elliot's face is left by the film, and the loft is cut back to, where Lee, having finished the poem, sits up in the bed, pensive and lost in her thoughts. Upbeat jazz begins to play, and the facade of Mount Sinai Hospital is cut to by the film. A few cars whiz by as various scenes depicting Mickey's comprehensive exam are moved inside to by the film. First is a hearing test, and a darkened hearing-test room is cut to by the movie. A light goes on, revealing Mickey slouched over, sitting in a glass booth, wearing a set of headphones. The camera moves back, revealing a technician at the console on the other side of the booth. Mickey signals with his finger when he hears a sound on his headset. Next is an electronystagmography (ENG). Graph paper rolls out of a machine, and after a brief glimpse of the rolling paper, Mickey is shown lying terrified, without his glasses, on a couch, with electrodes stuck all over his head, as the camera moves over. The film then cuts to a BSER test room, where Mickey, sitting in a corner chair, wears another set of headphones. An electrode is attached to his forehead; a nearby technician sits at a computer video screen, looking at a monitoring graph. Last but not least is the tomography. A large window displays a huge, white rotating machine over the shoulders of a technician in a booth. The camera moves down the giant cranelike device to reveal Mickey lying down once again, this time on a table, eyes closed, underneath it. Dr. Grey, examining a group of X-rays clipped to the light board behind his desk, turns his chair around to face a tense Mickey sitting on the other side of his desk."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Elliot pauses to browse books, then returns to a previously passed row. Lee approaches in the center aisle; Elliot hands her a book, and she thumbs through it. Later, Lee, with the book in a brown bag, exits with Elliot. A taxi arrives; Elliot opens the door for her, and she laughs while entering. As Lee reads aloud, the scene shifts to Elliot's darkened den, lit by hallway light. Wearing a robe, he turns on a light and mouths a line of poetry while looking into the distance. The scene returns to Lee in bed, staring thoughtfully. Upbeat jazz plays as the film cuts to Mount Sinai Hospital. Cars pass by as the film transitions inside to show Mickey's exam. First, in a dark hearing-test room, Mickey, wearing headphones, signals a technician when he hears sounds. During an ENG, graph paper rolls from a machine, and Mickey lies terrified on a couch with electrodes on his head. The BSER room shows Mickey with headphones and an electrode on his forehead, while a technician monitors a graph. Lastly, tomography reveals Mickey lying under a large rotating machine. Dr. Grey examines X-rays before turning to face a tense Mickey across his desk."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Elliot pauses to browse books, returns down the aisle, then hands a book to Lee. She thumbs through it, and later, they exit with the book in a brown bag. A taxi arrives; Elliot opens the door for Lee, who laughs and gets in. As Lee reads aloud, the scene shifts to Elliot's dim den. He enters in a robe, crosses the room, and turns on a light, mouthing Lee's poem. The scene shifts to Lee in bed, lost in thought, as jazz plays. The film shows Mount Sinai Hospital's facade, then transitions to Mickey's exam scenes. First, a hearing test shows Mickey in a booth signaling sounds. During an ENG, graph paper rolls as Mickey lies terrified with electrodes. In a BSER test room, Mickey wears headphones, with electrodes on his forehead, observed by a technician. Lastly, a tomography shows Mickey under a crane-like machine, eyes closed. Dr. Grey examines X-rays, then faces tense Mickey across his desk."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Elliot pauses his stride to take a closer look at some intriguing books, momentarily engrossed in their pages. Afterward, he pivots and retraces his steps down the bustling center aisle, heading back toward a particular row lined with books that he had previously passed by. At this moment, Lee approaches Elliot in the center aisle, intrigued by his interests. She gazes at the book he is holding, and Elliot gracefully hands it over to her. Lee flips through the pages thoughtfully, immersing herself in its content. Later, with the book now snugly placed inside a brown bag, Lee and Elliot are seen walking together towards the exit. A taxi, summoned by chance, pulls up smoothly to the curb; they casually stroll over to it, and Elliot, with a gentlemanly gesture, opens the rear door for Lee. She lets out a cheerful laugh as she slides into the vehicle. As the scene transitions, Lee continues to read aloud, and the movie seamlessly shifts to Elliot's dimly lit den, which is faintly illuminated by a soft light glowing in the hallway. Elliot walks in, clad in a comfortable robe, and crosses the room enveloped in shadows, before switching on a light. The camera holds steadily on his face, capturing his pensive expression as he gazes into the distance, softly mouthing the poetic line that Lee is reading next. The scene then moves away from Elliot's musings and returns to the loft. Lee, having finished reciting the poem, sits up in bed with a contemplative look, her mind adrift in thought. The mood changes as upbeat jazz music begins to play, and the film transitions to the exterior view of Mount Sinai Hospital. Several cars zoom by as the narrative shifts inside to various scenes illustrating Mickey's thorough examination. The first is a hearing test, and the film cuts to a dimly lit hearing-test room. A light flickers on, revealing a weary Mickey slumped over in a glass booth, wearing cumbersome headphones. As the camera pulls away, it reveals a technician seated at the console on the opposite side of the booth. Mickey subtly signals with his finger whenever he perceives a sound through his headset. The next procedure shown is an electronystagmography, commonly known as ENG. Sheets of graph paper spool out from a machine, and after a brief shot of the paper unrolling, the camera tracks over to display Mickey, visibly terrified without his glasses. He is lying down on a couch with numerous electrodes affixed to his head. The scene then transitions to a Brainstem Evoked Response (BSER) test room, where Mickey sits tensely in a corner chair, wearing yet another pair of headphones. An electrode is securely attached to his forehead, and nearby, a technician is intently focused on a computer video screen, monitoring a complex graph of data. Finally, the narrative presents the tomography stage of the examination. As the view expands from behind the shoulders of a technician in a secluded booth, a large window unveils a massive, white, rotating machine in motion. The camera glides down the imposing, cranelike apparatus to reveal Mickey, once more reclined, this time on a table beneath the machine, his eyes closed in submission. Meanwhile, Dr. Grey is seated with his back to the camera, meticulously assessing a collection of X-rays fastened to the illuminated light board behind his desk. The doctor then swivels his chair around to face an anxious Mickey, who is seated tensely on the opposite side of his desk."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Elliot, in the midst of his leisurely stroll, pauses his stride to take a closer, more scrutinizing look at some intriguing books, momentarily losing himself, engrossed in the tantalizing pages. After spending a few moments absorbed in the text, he pivots around and retraces his steps down the bustling and lively center aisle, heading back with purpose toward a particular row lined with an array of books that had previously piqued his interest. It is at this moment that Lee, filled with curiosity, approaches Elliot in the center aisle, intrigued by what has captured his attention. She gazes thoughtfully at the book he is holding, and with a graceful motion, Elliot hands it over to her with courtesy. Lee then begins to flip through the pages thoughtfully, immersing herself in the captivating content. Later on, with the book now snugly placed and secure inside a brown bag, Lee and Elliot are seen walking together in unison toward the store’s exit. As if by fate, a taxi, summoned by chance, smoothly pulls up to the curb; they casually make their way over to it, and Elliot, with a gentlemanly gesture full of chivalry, opens the rear door for Lee. She lets out a cheerful, infectious laugh as she gracefully slides into the vehicle. As the scene seamlessly transitions, Lee continues to read aloud, capturing the atmosphere, and the movie fluidly shifts to Elliot's dimly lit den, which is faintly illuminated by a soft, warm light glowing in the hallway. Elliot walks in, comfortably clad in a cozy robe, and crosses the room enveloped in deep shadows, before switching on a light. The camera steadily holds its focus on his face, capturing his pensive expression as he gazes thoughtfully into the distance, softly mouthing the poetic line that Lee is reading next. The scene then transitions away from Elliot's musings and returns to the loft. Lee, having finished reciting the moving poem, sits up in bed with a contemplative look, her mind adrift and awash in thought. The mood shifts as upbeat jazz music begins to play, and the film transitions to an exterior view of Mount Sinai Hospital. Several cars zoom by as the narrative shifts inside, presenting various scenes illustrating Mickey's thorough medical examination. The first test showcased is a hearing test, and the film cuts to a dimly lit hearing-test room. A light flickers on, revealing a weary Mickey slumped over in a glass booth, wearing cumbersome headphones. As the camera pulls away, it reveals a technician, seated at the console, concentrating on the opposite side of the booth. Mickey subtly signals with his finger whenever he perceives a sound filtering through his headset. The next procedure depicted is an electronystagmography, commonly known as ENG. Sheets of graph paper spool out rhythmically from a machine, and after a brief shot of the paper unrolling, the camera glides over to display Mickey, visibly terrified without his familiar glasses. He is lying down on a couch, with numerous electrodes carefully affixed to his head. The scene then seamlessly transitions to a Brainstem Evoked Response (BSER) test room, where Mickey sits tensely in a corner chair, wearing yet another pair of headphones. An electrode is securely attached to his forehead, and nearby, a technician is intently focused on a computer video screen, diligently monitoring a complex graph of data. Finally, the narrative presents the tomography stage of the examination. As the view expands from behind the shoulders of a technician in a secluded booth, a large window unveils a massive, white, rotating machine in motion. The camera glides down the imposing, cranelike apparatus to reveal Mickey, once more reclined, this time on a table beneath the machine, his eyes closed in resignation and submission. Meanwhile, Dr. Grey is seated with his back to the camera, meticulously and intently assessing a collection of X-rays fastened to the illuminated light board behind his desk. The doctor then swivels his chair around to face an anxious Mickey, who is seated tensely on the opposite side of his desk, awaiting the results."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Elliot pauses his stride, halting his movement to engage in perusing a selection of books, his eyes scanning titles and covers with interest. After a moment of contemplation, he pivots on his heel, redirecting his steps back along the center aisle, retracing his path to revisit a particular row of books he had previously walked by. Concurrently, Lee approaches Elliot in the same central aisle, where her attention is drawn to the book he has selected. Elliot extends his hand, offering the book to Lee, who receives it with curiosity and begins to flip through its pages, her fingers delicately turning each one. Time passes, and the scene transitions to show Lee holding the book, now tucked inside a brown bag, as she and Elliot make their way out together. Outside, a taxi pulls up to the curb, coming to a stop, prompting Elliot and Lee to walk towards it. As they reach the vehicle, Elliot courteously opens the rear door, inviting Lee to step inside. She responds with a laugh, her amusement evident as she settles into the seat. As the narrative shifts, Lee's voice continues to resonate, reading aloud, while the setting changes to Elliot's den, shrouded in darkness except for the glow emanating from a hallway light. Elliot enters the dimly lit room, dressed in a robe, moving purposefully across the space until he reaches a switch, turning on a light to illuminate the area. The camera captures his introspective expression as he gazes into the distance, silently mouthing the line of poetry that Lee recites next. The focus then shifts away from Elliot's contemplative face, returning to the loft where Lee, having finished reciting the poem, sits upright in bed. She stares thoughtfully into space, absorbed in her reflections. The atmosphere transitions with the introduction of lively jazz music, accompanying the visual cut to the facade of Mount Sinai Hospital. Outside, a few cars zip by, and the scene transitions indoors to showcase a series of procedures involved in Mickey's comprehensive examination. The first is a hearing test, depicted in a darkened room where a light switches on to reveal Mickey slumped in a glass booth, headphones over his ears. The camera pulls back to uncover a technician positioned at the console on the opposite side of the booth, monitoring the test. Mickey responds by raising a finger whenever he perceives a sound through the headphones. The examination progresses to an electronystagmography (ENG), illustrated by graph paper feeding from a machine. The camera momentarily captures the rolling paper, then shifts focus to Mickey lying anxiously on a couch, his glasses absent, electrodes affixed to his head. The sequence moves on to a BSER test room, where Mickey, seated in a corner chair, dons another pair of headphones, with an electrode attached to his forehead. Nearby, a technician reviews a monitoring graph on a computer screen. Lastly, the tomography is depicted from the vantage point of a technician inside a booth. A large window reveals the expansive white rotating machinery, and the camera pans down the crane-like structure to expose Mickey lying supine on a table beneath it, his eyes closed in resignation. Across the room, Dr. Grey is seated with his back to the camera, examining a series of X-rays displayed on a light board behind his desk. Turning his chair to face forward, Dr. Grey pivots to engage with Mickey, who sits tensely on the opposite side of the desk, awaiting the doctor's assessment."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Elliot pauses to browse some books, then returns to a previous row. Lee joins him, and he hands her a book, which she thumbs through. Later, Lee, now holding the book in a brown bag, and Elliot leave the store. A taxi arrives, and Elliot opens the door for Lee, who laughs as she gets in. As Lee reads aloud, the scene shifts to Elliot's dimly lit den. He enters in a robe, crosses the room, and turns on a light, mouthing lines of poetry that Lee reads. The scene transitions back to the loft, where Lee finishes the poem and sits contemplatively on the bed. Upbeat jazz plays as the scene shifts to the exterior of Mount Sinai Hospital. Inside, Mickey undergoes a comprehensive exam. He first signals in a hearing test booth, then moves to an electronystagmography, visibly anxious, with electrodes on his head. Next, during a BSER test, he sits in a chair, with electrodes connected, while a technician monitors the results. Finally, in a tomography session, Mickey lies under a large machine, eyes closed. Nearby, Dr. Grey examines X-rays before turning to face a nervous Mickey seated across from him."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Elliot, an avid reader familiar with the popular independent bookshop where he often spends his afternoons, stops walking to browse through some books, then turns and walks back down the center aisle to a row of books he'd already passed. Lee, curious about Elliot's selection, walks over to Elliot in the center aisle, looks at the book, a newly released novel by a renowned author, and he hands it to her. She thumbs through it, intrigued by its engaging prose, and later, Lee, holding the book in a brown bag from the bookstore, and Elliot are walking out. A taxi, part of the bustling New York City traffic known for its iconic yellow cabs, pulls over to the curb; they walk over to it, and Elliot opens the rear door for Lee. She laughs as she gets in, amused by the taxi driver's humorous greeting. As Lee continues to read aloud, her voice blending with the sounds of the city, the movie cuts to Elliot's darkened den, lit by a light in the hallway of his Upper East Side apartment. Elliot enters, wearing a robe made of soft, luxurious fabric, crossing the room in the dark, then turns on a light. The camera stays on his face as he looks off into the distance, mouthing indistinctly the line of poetry Lee next reads, a classic piece by Emily Dickinson evoking deep reflection. The film leaves Elliot's face and cuts back to the loft, where Lee, having finished the poem, sits up in the bed, staring pensively, lost in her thoughts about the poem's themes of nature and solitude. Upbeat jazz, reminiscent of the vibrant New York jazz scene, begins to play, and the film cuts to the facade of Mount Sinai Hospital, a leading medical center in Manhattan. A few cars whiz by as the film moves inside to various scenes depicting Mickey's comprehensive exam, a routine check-up to address his recent unexplained symptoms. First is a hearing test, and the movie cuts to a darkened hearing-test room, an environment designed for acoustic precision. A light goes on, revealing a slouched-over Mickey sitting in a glass booth, wearing a set of headphones that isolate external noise. The camera moves back, revealing a technician at the console on the other side of the booth. Mickey signals with his finger when he hears a sound on his headset, indicating varying levels of auditory perception. Next is an electronystagmography (ENG), a diagnostic test used to detect involuntary eye movements related to balance disorders. Graph paper rolls out of a machine, and after a brief glimpse of the rolling paper, the camera moves over to show Mickey lying terrified, without his glasses, on a couch, with electrodes stuck all over his head to record eye movements. The film then cuts to a BSER test room, where Mickey, sitting in a corner chair, wears another set of headphones. An electrode is attached to his forehead; a nearby technician sits at a computer video screen, looking at a monitoring graph that reflects Mickey's brainstem responses to sound. Last but not least is the tomography, a sophisticated imaging test that provides cross-sectional images of the body. Over the shoulders of a technician in a booth, a large window displays a huge, white rotating machine, a vital tool for detailed internal examination. The camera moves down the giant cranelike device to reveal Mickey, once again lying down, this time on a table, his eyes closed, underneath it, while the machine hums softly. A sitting Dr. Grey, an experienced specialist known for his meticulous attention to detail, his back to the camera, is examining a group of X-rays clipped to the light board behind his desk. The doctor turns his chair around to face a tense Mickey sitting on the other side of his desk, ready to discuss the findings that could explain Mickey's recent health concerns."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Lee walks over to Elliot in the center aisle looks at the book and he hands it to her Elliot stops walking to browse through some books then turns and walks back down the center aisle to a row of books he would already passed The camera stays on his face as he looks off into the distance mouthing indistinctly the line of poetry Lee walks over to Elliot in the center aisle looks at the book and he hands it to her Graph paper rolls out of a machine and after a brief glimpse of the rolling paper the camera moves over to show Mickey lying terrified without his glasses on a couch with electrodes stuck all over his head She thumbs through it and later Lee holding the book in a brown bag and Elliot are walking out A taxi pulls over to the curb they walk over to it and Elliot opens the rear door for Lee She laughs as she gets in As Lee continues to read aloud the movie cuts to Elliot's darkened den lit by a light in the hallway A sitting Dr Grey his back to the camera is examining a group of Xrays clipped to the light board behind his desk Elliot enters wearing a robe crossing the room in the dark then turns on a light The camera stays on his face as he looks off into the distance mouthing indistinctly the line of poetry Lee next reads Last but not least is the tomography The film leaves Elliot's face and cuts back to the loft where Lee having finished the poem sits up in the bed staring pensively lost in her thoughts Mickey signals with his finger when he hears a sound on his headset Upbeat jazz begins to play and the film cuts to the facade of Mount Sinai Hospital A taxi pulls over to the curb First is a hearing test and the movie cuts to a darkened hearingtest room Elliot stops walking to browse through some books then turns and walks back down the center aisle to a row of books he would already passed A few cars whiz by as the film moves inside to various scenes depicting Mickey's comprehensive exam First is a hearing test and the movie cuts to a darkened hearingtest room A light goes on revealing a slouchedover Mickey sitting in a glass booth wearing a set of headphones The camera moves back revealing a technician at the console on the other side of the booth Mickey signals with his finger when he hears a sound on his headset Next is an electronystagmography ENG Graph paper rolls out of a machine and after a brief glimpse of the rolling paper the camera moves over to show Mickey lying terrified without his glasses on a couch with electrodes stuck all over his head The doctor turns his chair around to face a tense She thumbs through it and later Lee holding the book in a brown bag and Elliot are walking out The film then cuts to a BSER test room where Mickey sitting in a corner chair wears another set of headphones An electrode is attached to his forehead a nearby technician sits at a computer video screen looking at a monitoring graph Last but not least is the tomography Over the shoulders of a technician in a booth a large window displays a huge white rotating machine The camera moves down the giant cranelike device to reveal Mickey once again lying down this time on a table his eyes closed underneath it A sitting Dr Grey his back to the camera is examining a group of Xrays clipped to the light board behind his desk The doctor turns his chair around to face a tense Next is an electronystagmography they walk over to it and Elliot opens the rear door for Lee a nearby technician sits at a computer video screen looking at a monitoring graph Mickey sitting on the other side of his desk Elliot enters wearing a robe crossing the room in the dark then turns on a light"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Elliot stops walking to browse through some books then turns and walks back down the center aisle to a row of books he would already passed. Lee walks over to Elliot in the center aisle looks at the book and he hands it to her. She thumbs through it and later Lee holding the book in a brown bag and Elliot are walking out. A taxi pulls over to the curb. they walk over to it and Elliot opens the rear door for Lee. She laughs as she gets in. As Lee continues to read aloud the movie cuts to Elliot's darkened den lit by a light in the hallway. Elliot enters wearing a robe crossing the room in the dark then turns on a light. The camera stays on his face as he looks off into the distance mouthing indistinctly the line of poetry. Lee next reads. The film leaves Elliot's face and cuts back to the loft where Lee having finished the poem sits up in the bed staring pensively lost in her thoughts. Upbeat jazz begins to play and the film cuts to the facade of Mount Sinai Hospital. A few cars whiz by as the film moves inside to various scenes depicting Mickey's comprehensive exam. First is a hearing test and the movie cuts to a darkened hearingtest room. A light goes on revealing a slouchedover. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Mickey sitting in a glass booth wearing a set of headphones. The camera moves back revealing a technician at the console on the other side of the booth. Mickey signals with his finger when he hears a sound on his headset. Next is an electronystagmography. ENG. Graph paper rolls out of a machine and after a brief glimpse of the rolling paper the camera moves over to show Mickey lying terrified without his glasses on a couch with electrodes stuck all over his head. The film then cuts to a BSER test room where Mickey sitting in a corner chair wears another set of headphones. An electrode is attached to his forehead. a nearby technician sits at a computer video screen looking at a monitoring graph. Last but not least is the tomography. Over the shoulders of a technician in a booth a large window displays a huge white rotating machine. The camera moves down the giant cranelike device to reveal Mickey once again lying down this time on a table his eyes closed underneath it. A sitting Dr Grey his back to the camera is examining a group of Xrays clipped to the light board behind his desk. The doctor turns his chair around to face a tense. Mickey sitting on the other side of his desk."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Elliot stops walking to browse through some books then turns and walks back down the center aisle to a row of books he would already passed. Lee walks over to Elliot in the center aisle looks at the book and he hands it to her. She thumbs through it and later Lee holding the book in a brown bag and Elliot are walking out. A taxi pulls over to the curb. they walk over to it and Elliot opens the rear door for Lee. She laughs as she gets in. As Lee continues to read aloud the movie cuts to Elliot's darkened den lit by a light in the hallway. Elliot enters wearing a robe crossing the room in the dark then turns on a light. The camera stays on his face as he looks off into the distance mouthing indistinctly the line of poetry. Lee next reads. The film leaves Elliot's face and cuts back to the loft where Lee having finished the poem sits up in the bed staring pensively lost in her thoughts. Upbeat jazz begins to play and the film cuts to the facade of Mount Sinai Hospital. A few cars whiz by as the film moves inside to various scenes depicting Mickey's comprehensive exam. First is a hearing test and the movie cuts to a darkened hearingtest room. A light goes on revealing a slouchedover. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Mickey sitting in a glass booth wearing a set of headphones. The camera moves back revealing a technician at the console on the other side of the booth. Mickey signals with his finger when he hears a sound on his headset. Next is an electronystagmography. ENG. Graph paper rolls out of a machine and after a brief glimpse of the rolling paper the camera moves over to show Mickey lying terrified without his glasses on a couch with electrodes stuck all over his head. The film then cuts to a BSER test room where Mickey sitting in a corner chair wears another set of headphones. An electrode is attached to his forehead. a nearby technician sits at a computer video screen looking at a monitoring graph. Last but not least is the tomography. Over the shoulders of a technician in a booth a large window displays a huge white rotating machine. The camera moves down the giant cranelike device to reveal Mickey once again lying down this time on a table his eyes closed underneath it. A sitting Dr Grey his back to the camera is examining a group of Xrays clipped to the light board behind his desk. The doctor turns his chair around to face a tense. Mickey sitting on the other side of his desk."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Elliot stops walking to browse through some books then turns and walks back down the center aisle to a row of books he would already passed. Lee walks over to Elliot in the center aisle looks at the book and he hands it to her. She thumbs through it and later Lee holding the book in a brown bag and Elliot are walking out. A taxi pulls over to the curb. they walk over to it and Elliot opens the rear door for Lee. She laughs as she gets in. As Lee continues to read aloud the movie cuts to Elliot's darkened den lit by a light in the hallway. Elliot enters wearing a robe crossing the room in the dark then turns on a light. a nearby technician sits at a computer video screen looking at a monitoring graph. Last but not least is the tomography. Over the shoulders of a technician in a booth a large window displays a huge white rotating machine. The camera moves down the giant cranelike device to reveal Mickey once again lying down this time on a table his eyes closed underneath it. A sitting Dr Grey his back to the camera is examining a group of Xrays clipped to the light board behind his desk. The doctor turns his chair around to face a tense. Mickey sitting on the other side of his desk."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Elliot stops walking to browse through some books then turns and walks back down the center aisle to a row of books he would already passed. Lee walks over to Elliot in the center aisle looks at the book and he hands it to her. She thumbs through it and later Lee holding the book in a brown bag and Elliot are walking out. A sitting Dr Grey his back to the camera is examining a group of Xrays clipped to the light board behind his desk. The doctor turns his chair around to face a tense. Mickey sitting on the other side of his desk."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Toby stops walking to browse through some books, then turns and walks back down the center aisle to a row of books he'd already passed. Nina walks over to Toby in the center aisle, looks at the book, and he hands it to her. She thumbs through it, and later, Nina, holding the book in a brown bag, and Toby are walking out. A delivery truck pulls over to the curb; they walk over to it, and Toby opens the rear door for Nina. She laughs as she gets in. As Nina continues to read aloud, the movie cuts to Toby's darkened den, lit by a light in the hallway. Toby enters, wearing a robe, crossing the room in the dark, then turns on a light. The camera stays on his face as he looks off into the distance, mouthing indistinctly the line of poetry Nina next reads. The film leaves Toby's face and cuts back to the loft, where Nina, having finished the poem, sits up in the bed, staring pensively, lost in her thoughts. Upbeat jazz begins to play, and the film cuts to the facade of Mount Sinai Hospital. A few trucks whiz by as the film moves inside to various scenes depicting Jordan's comprehensive exam. First is a hearing test, and the movie cuts to a darkened hearing-test room. A light goes on, revealing a slouched-over Jordan sitting in a glass booth, wearing a set of headphones. The camera moves back, revealing a nurse at the console on the other side of the booth. Jordan signals with his finger when he hears a sound on his headset. Next is an electronystagmography (ENG). Graph paper rolls out of a machine, and after a brief glimpse of the rolling paper, the camera moves over to show Jordan lying terrified, without his glasses, on a couch, with electrodes stuck all over his head. The film then cuts to a BSER test room, where Jordan, sitting in a corner chair, wears another set of headphones. An electrode is attached to his forehead; a nearby nurse sits at a computer video screen, looking at a monitoring graph. Last but not least is the tomography. Over the shoulders of a nurse in a booth, a large window displays a huge, white rotating machine. The camera moves down the giant cranelike device to reveal Jordan, once again lying down, this time on a table, his eyes closed, underneath it. A sitting Dr. Harris, his back to the camera, is examining a group of X-rays clipped to the light board behind his desk. The doctor turns his chair around to face a tense Jordan sitting on the other side of his desk."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Elliot stops walking to browse through some pottery, then turns and walks back down the center aisle to a row of sculptures he'd already passed. Lee walks over to Elliot in the center aisle, looks at the sculpture, and he hands it to her. She examines it closely, and later, Lee, holding the sculpture in a green cloth, and Elliot are walking out. A rickshaw pulls over to the curb; they walk over to it, and Elliot opens the rear compartment for Lee. She laughs as she gets in. As Lee continues to recite aloud, the movie cuts to Elliot's dimmed studio, lit by a lamp in the hallway. Elliot enters, wearing a jacket, crossing the room in the dark, then turns on a lamp. The camera stays on his face as he looks off into the distance, mouthing indistinctly the lines of poetry Lee next recites. The film leaves Elliot's face and cuts back to the attic, where Lee, having finished the poem, sits up on the couch, staring pensively, lost in her thoughts. Upbeat classical music begins to play, and the film cuts to the facade of Grand Central Station. A few bicycles whiz by as the film moves inside to various scenes depicting Mickey's comprehensive assessment. First is a sight test, and the movie cuts to a darkened sight-test room. A lamp goes on, revealing a slouched-over Mickey sitting in a glass booth, wearing a pair of spectacles. The camera moves back, revealing a technician at the controls on the other side of the booth. Mickey signals with his finger when he sees a flash on his glasses. Next is a spirometry test. A chart rolls out of a machine, and after a brief glimpse of the rolling chart, the camera moves over to show Mickey lying terrified, without his watch, on a chaise, with sensors stuck all over his chest. The film then cuts to a VEP test room, where Mickey, sitting in a corner stool, wears another pair of spectacles. A sensor is attached to his temple; a nearby technician sits at a computer monitor, looking at a waveform display. Last but not least is the ultrasound. Over the shoulders of a technician in a booth, a large window displays a huge, white rotating scanner. The camera moves down the giant cranelike device to reveal Mickey, once again lying down, this time on a couch, his eyes closed, underneath it. A sitting Dr. Grey, his back to the camera, is examining a group of charts clipped to the bulletin board behind his desk. The doctor turns his chair around to face a tense Mickey sitting on the other side of his desk."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Elliot starts dancing to flip through some books, then twists and skips back down the center aisle to a row of books he'd already skipped past. Lee skips over to Elliot in the center aisle, glances at the book, and he tosses it to her. She hums through it, and later, Lee, clutching the book in a brown bag, and Elliot are skipping out. A taxi floats over to the curb; they bounce over to it, and Elliot slams the rear door for Lee. She giggles as she leaps in. As Lee continues to whisper aloud, the movie cuts to Elliot's darkened den, illuminated by a shadow in the hallway. Elliot wanders in, wearing a robe, sliding across the room in the dark, then flips on a light. The camera dances on his face as he glances off into the distance, singing indistinctly the line of poetry Lee next whispers. The film leaves Elliot's face and cuts back to the loft, where Lee, having twisted the poem, jumps up in the bed, staring brightly, lost in her thoughts. Upbeat jazz begins to roar, and the film cuts to the facade of Mount Sinai Hospital. A few cars slide by as the film drifts inside to various scenes depicting Mickey's spontaneous exam. First is a hearing test, and the movie cuts to a luminous hearing-test room. A light fades on, unveiling a slouched-over Mickey reclining in a glass booth, wearing a set of headphones. The camera drifts back, unveiling a technician at the console on the other side of the booth. Mickey dances with his finger when he detects a sound on his headset. Next is an electronystagmography (ENG). Graph paper rolls into a machine, and after a brief reflection of the rolling paper, the camera floats over to show Mickey resting terrified, without his glasses, on a couch, with electrodes dangled all over his head. The film then jumps to a BSER test room, where Mickey, hopping in a corner chair, wears another set of headphones. An electrode is dangled on his forehead; a nearby technician bobs at a computer video screen, gazing at a monitoring graph. Last but not least is the tomography. Over the shoulders of a technician in a booth, a large window unveils a huge, white spinning machine. The camera drifts down the giant cranelike device to unveil Mickey, once again reclining, this time on a table, his eyes opened, underneath it. A lounging Dr. Grey, his back to the camera, is critiquing a group of X-rays pinned to the light board behind his desk. The doctor spins his chair around to face a relaxed Mickey lounging on the other side of his desk."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Marigold stops floating to browse through some vases, then turns and floats back down the center aisle to a row of candles she'd already passed. Fern glides over to Marigold in the center aisle, looks at the candle, and she hands it to him. He thumbs through it, and later, Fern, holding the candle in a green basket, and Marigold are floating out. A bicycle pulls over to the sidewalk; they glide over to it, and Marigold opens the rear door for Fern. He chuckles as he gets in. As Fern continues to recite aloud, the film cuts to Marigold's darkened studio, lit by a lamp in the hallway. Marigold enters, wearing a cape, crossing the chamber in the dark, then turns on a lamp. The camera stays on her hair as she looks off into the distance, mouthing indistinctly the line of lyrics Fern next recites. The scene leaves Marigold's hair and cuts back to the loft, where Fern, having finished the lyrics, sits up on the carpet, staring pensively, lost in his thoughts. Upbeat blues begins to echo, and the scene cuts to the exterior of Central Park Zoo. A few bicycles zip by as the scene moves inside to various scenes depicting Oliver's comprehensive presentation. First is a math quiz, and the film cuts to a dimly lit math-quiz room. A lamp goes on, revealing a slouched-over Oliver sitting in a wooden box, wearing a set of binoculars. The camera moves back, revealing a gardener at the console on the other side of the box. Oliver signals with his toe when he hears a whisper on his headset. Next is an electrocardiography (EKG). Map paper rolls out of a contraption, and after a brief glimpse of the rolling paper, the camera moves over to show Oliver lying horrified, without his binoculars, on a rug, with clips stuck all over his arm. The film then cuts to a BP monitor room, where Oliver, sitting in a corner hammock, wears another set of binoculars. A clip is attached to his chin; a nearby gardener sits at a tablet screen, examining a monitoring chart. Finally, there is the radiography. Over the shoulders of a gardener in a box, a large porthole displays a huge, silver rotating carousel. The camera moves down the giant robotic device to reveal Oliver, once again lying down, this time on a mat, his eyes closed, underneath it. A seated Dr. Plum, his back to the camera, is reviewing a group of sketches clipped to the light panel behind his chair. The gardener spins his chair around to face an anxious Oliver sitting on the other side of his chair."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Morgan halts cycling to gaze through some paintings, then pivots and skips back down the main corridor to a collection of paintings he'd already ignored. Jordan dances over to Morgan in the main corridor, examines the painting, and he tosses it to her. She flips through it, and later, Jordan, clutching the painting in a blue bag, and Morgan are skipping out. A wagon veers over to the pavement; they skip over to it, and Morgan swings open the front door for Jordan. She chuckles as she hops in. As Jordan continues to sing aloud, the scene shifts to Morgan's dim studio, illuminated by a lamp in the kitchen. Morgan saunters in, donning a jacket, sliding across the space in the dimness, then switches on a lamp. The camera focuses on his expression as he stares off into the void, humming indistinctly the line of song Jordan next hums. The movie drifts from Morgan's expression and shifts back to the penthouse, where Jordan, having stopped her singing, stands up from the couch, staring dreamily, lost in her musings. Energetic rock begins to play, and the film transitions to the front of Bellevue Hospital. Several bicycles zip by as the film moves indoors to various shots showcasing Dylan's thorough evaluation. First is an eye exam, and the movie transitions to a dimly lit vision-test room. A light turns on, revealing a hunched-over Dylan sitting in a wooden booth, wearing a pair of goggles. The camera zooms out, revealing a scientist at the keyboard on the other side of the booth. Dylan gestures with his hand when he glimpses a flash in his goggles. Next is a computerized tomography (CT). The ribbon unfurls from a gadget, and after a brief look at the unwinding ribbon, the camera pans to show Dylan sitting anxiously, without his wristwatch, on a lounger, with sensors stuck all over his arms. The film then shifts to an EEG test room, where Dylan, sitting in a window chair, wears another pair of goggles. A sensor is attached to his chin; a nearby scientist sits at a digital console, examining a monitoring chart. Finally, there's the MRI scan. Over the shoulders of a scientist in a station, a massive window showcases an enormous, white spinning apparatus. The camera slides down the enormous forklift-like device to reveal Dylan, once again sitting upright, this time on a stool, his eyes open, beneath it. A standing Dr. White, his profile turned to the camera, is surveying a collection of films clipped to the projector behind his workstation. The scientist swivels his stool around to face a tense Dylan sitting on the opposite side of his workstation."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Elliot stops dancing to sift through some recipes, then spins and skips back down the center aisle to a row of paintings he'd already admired. Lee glides over to Elliot in the center aisle, gazes at the canvas, and he tosses it to her. She flips it over, and later, Lee, clutching the canvas in a blue box, and Elliot are skipping out. A tram stops by the fountain; they skip over to it, and Elliot unlocks the front hatch for Lee. She chuckles as she jumps in. As Lee continues to sing aloud, the movie cuts to Elliot's illuminated attic, lit by a lamp in the hallway. Elliot enters, wearing a cloak, sliding across the room in the light, then turns off a lamp. The camera stays on his profile as he stares into the distance, mouthing indistinctly the line of music Lee next sings. The film leaves Elliot's profile and cuts back to the loft, where Lee, having finished the song, stands up in the hammock, staring dreamily, lost in her thoughts. Soft rock begins to play, and the film cuts to the facade of Lincoln Memorial. A few bicycles zip past as the film moves inside to various scenes depicting Mickey's intricate workshop. First is a painting review, and the movie cuts to a shadowy art-review room. A bulb turns on, revealing a slumped-over Mickey sitting in a wooden booth, wearing a pair of goggles. The camera moves back, revealing an artist at the easel on the other side of the booth. Mickey gestures with his hand when he sees a stroke on his canvas. Next is an ink sketching. Colored paper rolls out of a toolbox, and after a brief glimpse of the rolling paper, the camera moves over to show Mickey lying petrified, without his hat, on a chair, with brushes stuck all over his lap. The film then cuts to a charcoal studio, where Mickey, sitting in a corner bench, wears another pair of goggles. A sketching pen is taped to his collar; a nearby artist sits at a computer video screen, glancing at a display. Last but not least is the sculpture. Over the shoulders of an artist in a booth, a large window displays a huge, rotating pedestal. The camera moves down the giant arms like structure to reveal Mickey, once again sitting down, this time on a stool, his eyes open, underneath it. A standing Dr. Grey, his back to the camera, is examining a group of canvases pinned to the display board behind his table. The doctor turns his easel around to face a nervous Mickey standing on the other side of his table."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Sarah pauses swimming to admire a collection of sculptures, then pivots and swims back up the central stream to a cluster of statues she had already bypassed. Max paddles over to Sarah in the central stream, examines the sculpture, and she offers it to him. He glances over it, and later, Max, clutching the sculpture in a yellow box, and Sarah are swimming away. A trolley halts beside the sidewalk; they float over to it, and Max slides open the front window for Sarah. He chuckles as he hops inside. As Max continues to sing softly, the animation transitions to Sarah's illuminated studio, lit by a lamp in the corridor. Sarah arrives, wearing a jacket, navigating the space in the dimness, then switches on a lamp. The animation focuses on her expression as she gazes into the void, whispering inaudibly the verse of lyrics Max next sings. The sequence drifts from Sarah's expression and transitions back to the penthouse, where Max, having completed the verse, stands up from the hammock, gazing thoughtfully, absorbed in his musings. Energetic blues begins to play, and the sequence transitions to the exterior of St. Mary's Chapel. Several bicycles dash past as the animation shifts inside to various scenes portraying Charlie's thorough inspection. Initially is a vision check, and the animation transitions to a dimly lit vision-test chamber. A bulb illuminates, exposing a hunched-over Charlie perched in a glass chamber, donning a pair of spectacles. The view retreats, uncovering an operator at the dashboard on the opposite side of the chamber. Charlie gestures with his hand when he sees an image on his visor. Subsequently is an electrocardiograph (ECG). Paper spools from a device, and following a brief look at the moving paper, the view shifts over to reveal Charlie sitting apprehensively, without his watch, on a bench, with sensors fastened around his torso. The sequence then shifts to an MRI lab, where Charlie, sitting in an edge stool, dons a fresh pair of spectacles. A sensor is fastened to his wrist; a nearby operator peers at a digital monitor, reviewing a tracking chart. Finally is the cardiography. Beyond the shoulders of an operator in a chamber, a sizable pane reveals an immense, silver rotating apparatus. The view pans down the gigantic mechanical contraption to disclose Charlie, once again seated, this time on a bench, his hands clasped, beneath it. A standing Dr. Brown, facing away from the view, is inspecting a series of CT scans affixed to the illuminated panel behind his workspace. The physician pivots his stool to confront an anxious Charlie situated on the opposite side of the workspace."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Elliot browses books and hands one to Lee, who reviews it. Later, they leave the store together, with Lee holding the book in a bag. They laugh as they enter a taxi. The scene shifts to Elliot's dark den, where he silently mouths a line from the poem Lee reads aloud. Lee finishes the poem, looking thoughtful in bed. The mood changes with upbeat jazz, transitioning to Mount Sinai Hospital for Mickey's exam. The film shows Mickey's hearing test in a dark room, followed by an ENG, where he lies terrified with electrodes on his head. In a BSER test, Mickey reacts nervously under observation. Finally, we see him under a large tomography machine, eyes closed. Dr. Grey reviews X-rays and turns to face a tense Mickey, highlighting his anxiety."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Mickey sitting on the other side of his desk The doctor turns his chair around to face a tense A sitting Dr Grey his back to the camera is examining a group of Xrays clipped to the light board behind his desk The camera moves down the giant cranelike device to reveal Mickey once again lying down this time on a table his eyes closed underneath it Over the shoulders of a technician in a booth a large window displays a huge white rotating machine Last but not least is the tomography a nearby technician sits at a computer video screen looking at a monitoring graph An electrode is attached to his forehead The film then cuts to a BSER test room where Mickey sitting in a corner chair wears another set of headphones Graph paper rolls out of a machine and after a brief glimpse of the rolling paper the camera moves over to show Mickey lying terrified without his glasses on a couch with electrodes stuck all over his head ENG Next is an electronystagmography Mickey signals with his finger when he hears a sound on his headset The camera moves back revealing a technician at the console on the other side of the booth Mickey sitting in a glass booth wearing a set of headphones A light goes on revealing a slouchedover First is a hearing test and the movie cuts to a darkened hearingtest room A few cars whiz by as the film moves inside to various scenes depicting Mickey's comprehensive exam Upbeat jazz begins to play and the film cuts to the facade of Mount Sinai Hospital The film leaves Elliot's face and cuts back to the loft where Lee having finished the poem sits up in the bed staring pensively lost in her thoughts Lee next reads The camera stays on his face as he looks off into the distance mouthing indistinctly the line of poetry Elliot enters wearing a robe crossing the room in the dark then turns on a light As Lee continues to read aloud the movie cuts to Elliot's darkened den lit by a light in the hallway She laughs as she gets in they walk over to it and Elliot opens the rear door for Lee A taxi pulls over to the curb She thumbs through it and later Lee holding the book in a brown bag and Elliot are walking out Lee walks over to Elliot in the center aisle looks at the book and he hands it to her Elliot stops walking to browse through some books then turns and walks back down the center aisle to a row of books he would already passed"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "ENG A light goes on revealing a slouchedover The film leaves Elliot's face and cuts back to the loft where Lee having finished the poem sits up in the bed staring pensively lost in her thoughts The camera moves down the giant cranelike device to reveal Mickey once again lying down this time on a table his eyes closed underneath it An electrode is attached to his forehead As Lee continues to read aloud the movie cuts to Elliot's darkened den lit by a light in the hallway She laughs as she gets in A few cars whiz by as the film moves inside to various scenes depicting Mickey's comprehensive exam Upbeat jazz begins to play and the film cuts to the facade of Mount Sinai Hospital Mickey sitting in a glass booth wearing a set of headphones Lee next reads Over the shoulders of a technician in a booth a large window displays a huge white rotating machine Mickey sitting on the other side of his desk The film then cuts to a BSER test room where Mickey sitting in a corner chair wears another set of headphones The camera moves back revealing a technician at the console on the other side of the booth A sitting Dr Grey his back to the camera is examining a group of Xrays clipped to the light board behind his desk Lee walks over to Elliot in the center aisle looks at the book and he hands it to her First is a hearing test and the movie cuts to a darkened hearingtest room Next is an electronystagmography She thumbs through it and later Lee holding the book in a brown bag and Elliot are walking out Mickey signals with his finger when he hears a sound on his headset The doctor turns his chair around to face a tense they walk over to it and Elliot opens the rear door for Lee Last but not least is the tomography Elliot enters wearing a robe crossing the room in the dark then turns on a light The camera stays on his face as he looks off into the distance mouthing indistinctly the line of poetry a nearby technician sits at a computer video screen looking at a monitoring graph Elliot stops walking to browse through some books then turns and walks back down the center aisle to a row of books he would already passed A taxi pulls over to the curb Graph paper rolls out of a machine and after a brief glimpse of the rolling paper the camera moves over to show Mickey lying terrified without his glasses on a couch with electrodes stuck all over his head"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Mickey sitting in a glass booth wearing a set of headphones The camera moves back revealing a technician at the console on the other side of the booth Mickey signals with his finger when he hears a sound on his headset Next is an electronystagmography ENG Graph paper rolls out of a machine and after a brief glimpse of the rolling paper the camera moves over to show Mickey lying terrified without his glasses on a couch with electrodes stuck all over his head The film then cuts to a BSER test room where Mickey sitting in a corner chair wears another set of headphones An electrode is attached to his forehead a nearby technician sits at a computer video screen looking at a monitoring graph Last but not least is the tomography Over the shoulders of a technician in a booth a large window displays a huge white rotating machine The camera moves down the giant cranelike device to reveal Mickey once again lying down this time on a table his eyes closed underneath it A sitting Dr Grey his back to the camera is examining a group of Xrays clipped to the light board behind his desk The doctor turns his chair around to face a tense Mickey sitting on the other side of his desk Elliot stops walking to browse through some books then turns and walks back down the center aisle to a row of books he would already passed Lee walks over to Elliot in the center aisle looks at the book and he hands it to her She thumbs through it and later Lee holding the book in a brown bag and Elliot are walking out A taxi pulls over to the curb they walk over to it and Elliot opens the rear door for Lee She laughs as she gets in As Lee continues to read aloud the movie cuts to Elliot's darkened den lit by a light in the hallway Elliot enters wearing a robe crossing the room in the dark then turns on a light The camera stays on his face as he looks off into the distance mouthing indistinctly the line of poetry Lee next reads The film leaves Elliot's face and cuts back to the loft where Lee having finished the poem sits up in the bed staring pensively lost in her thoughts Upbeat jazz begins to play and the film cuts to the facade of Mount Sinai Hospital A few cars whiz by as the film moves inside to various scenes depicting Mickey's comprehensive exam First is a hearing test and the movie cuts to a darkened hearingtest room A light goes on revealing a slouchedover"
        }
      ]
    }
  ]
}