{
  "ground_truth": "Gittes reaches into his desk and pulls out a shot glass, quickly selects a cheaper bottle of bourbon from several fifths of more expensive whiskeys and pours a large shot. He shoves the glass across his desk toward Curly, who stares dumbly at it, then picks it up and drains it. He's now walking Curly past Sophie, who pointedly averts her gaze. Gittes throws an arm around Curly and flashes a dazzling smile, then shuts the door on him and the smile disappears. Walsh rises when Gittes enters, Gittes nods and walks on in. Gittes walks over to Mrs. Mulwray and again flashes a warm, sympathetic smile, and she holds her breath. Gittes pulls up a chair sitting next to Mrs. Mulwray between Duffy and Walsh, gives Duffy an irritated glance, causing Duffy to stop chewing, and then Gittes sighs. Former Mayor Sam Bagby is speaking, with a huge map, overleafs, and bold lettering behind him. Some councilmen are reading funny papers and gossip columns while Bagby is speaking, and some grubby farmers sit next to them, bored. One yawns and edges away from one of the dirtier farmers, while an amalgam of farmers, businessmen, and city employees listen with keen interest. A man looks up with interest from his racing form during a whispered conference, walks to the huge map with overleafs, and he is a slender man in his sixties, who wears glasses and moves with surprising fluidity. He turns to a smaller, younger man and nods, prompting the man to turn the overleaf on the map. Mulwray leaves the overleaf board and sits down. Suddenly, there are some whoops and hollers from the rear of the chambers, and a red-faced farmer drives in several scrawny, bleating sheep. Bailiffs and sergeants-at-arms respond to the imprecations of the Council and attempt to capture the sheep and the farmers, having to restrain one who looks like he's going to bodily attack Mulwray. The sun blazes off the river's ugly concrete banks, while where the banks are earthen, they are parched and choked with weeds. After a moment, Mulwray's car pulls into view on a flood control road about fifteen feet above the riverbed. Someone holding a pair of binoculars is positioned downstream and just above the flood control road, using some dried mustard weeds for cover, and trains the binoculars on him. They watch while Mulwray makes his way down to the center of the riverbed, where he stops, turns slowly, and appears to be looking at the bottom of the riverbed or at nothing at all. Then a small Mexican boy atop a swayback horse rides it into the riverbed and into Gittes' view. Gittes moves a little further back as Mulwray rounds the bend in the river and comes face to face with the Mexican boy on the muddy banks.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Gittes reaches into his bureau and pulls out a shot glass, quickly selects a cheaper bottle of bourbon from several fifths of more costly whiskeys and pours a large shot. He shoves the glass across his bureau toward Curly, who stares blankly at it, then picks it up and drains it. He's now guiding Curly past Sophie, who pointedly averts her gaze. Gittes throws an arm around Curly and flashes a dazzling grin, then shuts the door on him and the grin disappears. Walsh rises when Gittes enters, Gittes nods and walks on in. Gittes walks over to Mrs. Mulwray and again flashes a warm, compassionate grin, and she holds her breath. Gittes pulls up a chair sitting next to Mrs. Mulwray between Duffy and Walsh, gives Duffy an annoyed glance, causing Duffy to stop chewing, and then Gittes exhales. Former Mayor Sam Bagby is talking, with a huge chart, overleafs, and bold lettering behind him. Some councilmen are reading humorous papers and gossip columns while Bagby is talking, and some scruffy farmers sit next to them, bored. One yawns and edges away from one of the grimier farmers, while a mixture of farmers, businessmen, and city employees listen with keen interest. A man looks up with interest from his racing form during a whispered discussion, walks to the huge chart with overleafs, and he is a slender man in his sixties, who wears spectacles and moves with surprising fluidity. He turns to a smaller, younger man and nods, prompting the man to turn the overleaf on the chart. Mulwray leaves the overleaf board and sits down. Suddenly, there are some whoops and hollers from the rear of the chambers, and a red-faced farmer drives in several scrawny, bleating sheep. Bailiffs and sergeants-at-arms respond to the imprecations of the Council and attempt to capture the sheep and the farmers, having to restrain one who looks like he's going to bodily assault Mulwray. The sun blazes off the river's ugly concrete banks, while where the banks are earthen, they are parched and choked with weeds. After a moment, Mulwray's car pulls into view on a flood control road about fifteen feet above the riverbed. Someone holding a pair of binoculars is positioned downstream and just above the flood control road, using some dried mustard weeds for concealment, and trains the binoculars on him. They watch while Mulwray makes his way down to the center of the riverbed, where he stops, turns slowly, and appears to be looking at the bottom of the riverbed or at nothing at all. Then a small Mexican boy atop a swayback horse rides it into the riverbed and into Gittes' view. Gittes moves a little further back as Mulwray rounds the bend in the river and comes face to face with the Mexican boy on the muddy banks."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Gittes reaches into his desk and a shot glass is pulled out by him, a cheaper bottle of bourbon is quickly selected by him from several fifths of more expensive whiskeys, and a large shot is poured. The glass is shoved across his desk by him toward Curly, who dumbly stares at it, then it is picked up by Curly and drained. Curly is now walked past Sophie by him, and her gaze is pointedly averted. An arm is thrown around Curly by Gittes, and a dazzling smile is flashed by him, then the door is shut on him and the smile disappears. When Gittes enters, Walsh rises, and he nods at Walsh and walks on in. Gittes walks over to Mrs. Mulwray, and a warm, sympathetic smile is again flashed by him, and her breath is held by her. A chair sitting next to Mrs. Mulwray between Duffy and Walsh is pulled up by Gittes, and an irritated glance is given to Duffy by him, causing Duffy to stop chewing, and then a sigh is given by Gittes. Former Mayor Sam Bagby speaks with a huge map, overleafs, and bold lettering behind him. While Bagby speaks, some councilmen read funny papers and gossip columns, and some grubby farmers sit next to them, bored. One yawns and edges away from one of the dirtier farmers, while an amalgam of farmers, businessmen, and city employees listen with keen interest. During a whispered conference, a man looks up with interest from his racing form, walks to the huge map with overleafs, and he is a slender man in his sixties, who wears glasses and moves with surprising fluidity. He turns to a smaller, younger man and nods, prompting the man to turn the overleaf on the map. Mulwray leaves the overleaf board and sits down. Suddenly, some whoops and hollers erupt from the rear of the chambers, and several scrawny, bleating sheep are driven in by a red-faced farmer. Bailiffs and sergeants-at-arms respond to the imprecations of the Council and the sheep and the farmers are attempted to be captured, having to restrain one who looks like he's going to bodily attack Mulwray. The sun blazes off the river's ugly concrete banks, while the earthen banks are parched and choked with weeds. After a moment, the view of Mulwray's car is pulled into on a flood control road about fifteen feet above the riverbed. Someone positions themselves with a pair of binoculars downstream and just above the flood control road, covering themselves with some dried mustard weeds, and they train the binoculars on him. While Mulwray makes his way down to the center of the riverbed, they watch, where he stops, slowly turns, and appears to be looking at the bottom of the riverbed or at nothing at all. Then a small Mexican boy atop a swayback horse rides it into the riverbed, and Gittes' view is met. Gittes moves a little further back as the bend in the river is rounded by Mulwray, and he comes face to face with the Mexican boy on the muddy banks."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Gittes reaches into his desk, selects a cheaper bourbon from several pricier whiskeys, and pours a large shot. He slides the glass to Curly, who stares at it before drinking. Gittes walks Curly past Sophie, who avoids eye contact. Gittes smiles warmly at Curly, then closes the door, and his smile fades. Walsh stands as Gittes enters, and Gittes nods, proceeding to Mrs. Mulwray, offering a sympathetic smile. He sits beside her, glances irritably at Duffy, who stops chewing, and sighs. Former Mayor Sam Bagby speaks in front of a large map, while some councilmen read comics and gossip columns. Bored farmers sit nearby, one yawning and moving away from a dirtier farmer. A man, interested, leaves his racing form, approaches the map, and nods to a younger man to turn the overleaf. Mulwray leaves the board and sits. Suddenly, whoops erupt as a red-faced farmer drives in bleating sheep. Bailiffs and sergeants-at-arms try to capture the sheep and restrain a farmer threatening Mulwray. The sun glares off the river's concrete banks, while earthen banks are dry and weedy. Mulwray's car appears on a flood control road above the riverbed. Someone with binoculars watches him from dried mustard weeds. Mulwray walks to the riverbed's center, stops, and looks around. A Mexican boy on a swayback horse rides into the riverbed, catching Gittes' attention. Gittes moves back as Mulwray encounters the boy on the muddy banks."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gittes grabs a shot glass, chooses a cheap bourbon from several pricier whiskeys, and pours a large shot. He slides it to Curly, who drinks it. Gittes walks Curly past Sophie, who looks away, then smiles at Curly before shutting the door, losing the smile. Walsh stands as Gittes enters, Gittes nods and continues to Mrs. Mulwray, smiling warmly. He sits next to her, glances at Duffy, who stops chewing, and sighs. Former Mayor Sam Bagby speaks with a large map behind him. Some councilmen read comics while bored farmers sit nearby. A man, interested, approaches the map, nods to a younger man to turn the overleaf. Mulwray sits down. Suddenly, a farmer drives sheep into the chambers, causing chaos. Bailiffs and sergeants-at-arms try to control the situation. The sun glares off the river's concrete banks, while earthen banks are dry and weedy. Mulwray's car appears on a flood control road. Someone with binoculars watches him from cover. Mulwray walks to the riverbed's center, looking around. A Mexican boy on a horse enters the riverbed, catching Gittes' attention. Gittes moves back as Mulwray meets the boy on the muddy banks."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Gittes, with a deliberate motion, reaches into the depths of his desk and retrieves a shot glass. He quickly surveys the selection of bottles before him, opting for a less expensive bottle of bourbon from among several fifths of pricier whiskeys. With a practiced hand, he pours a generous shot into the glass. Without hesitation, he slides the glass across the surface of his desk toward Curly, who stares at it with a blank expression before finally picking it up and downing it in one swift motion. Now, Gittes is guiding Curly past Sophie, who makes a point of looking away. Gittes throws an arm around Curly's shoulders, flashing a dazzling smile, but as soon as he shuts the door behind Curly, the smile vanishes from his face. As Gittes enters the room, Walsh stands up in acknowledgment, and Gittes gives him a nod before continuing on his way. He approaches Mrs. Mulwray, offering her a warm, sympathetic smile that causes her to hold her breath. Gittes pulls up a chair and sits down next to Mrs. Mulwray, positioning himself between Duffy and Walsh. He shoots Duffy an irritated glance, which prompts Duffy to cease his chewing, and then Gittes lets out a sigh. Meanwhile, former Mayor Sam Bagby is speaking, standing in front of a massive map adorned with overleafs and bold lettering. Some councilmen are distracted, engrossed in reading funny papers and gossip columns while Bagby continues his speech. Nearby, a group of grubby farmers sits, looking bored and uninterested. One of them yawns and shifts away from a particularly dirty farmer, while a mix of farmers, businessmen, and city employees listen with keen interest. During a whispered conference, a man looks up with interest from his racing form, walks over to the large map with overleafs, and is revealed to be a slender man in his sixties, wearing glasses and moving with surprising fluidity. He turns to a smaller, younger man and nods, prompting the younger man to turn the overleaf on the map. Mulwray steps away from the overleaf board and takes a seat. Suddenly, the chambers erupt with whoops and hollers from the back, as a red-faced farmer drives in several scrawny, bleating sheep. Bailiffs and sergeants-at-arms respond to the Council's imprecations, attempting to capture both the sheep and the farmers, and they have to restrain one farmer who looks as though he might physically attack Mulwray. Outside, the sun blazes harshly off the river's unsightly concrete banks, while the earthen banks are dry and overgrown with weeds. After a moment, Mulwray's car comes into view, traveling along a flood control road about fifteen feet above the riverbed. Positioned downstream and just above the flood control road, someone is holding a pair of binoculars, using some dried mustard weeds for cover, and they focus the binoculars on Mulwray. They watch intently as Mulwray makes his way down to the center of the riverbed, where he stops, turns slowly, and seems to be looking at the bottom of the riverbed or perhaps at nothing at all. Then, a small Mexican boy atop a swayback horse rides into the riverbed, coming into Gittes' view. Gittes moves a little further back as Mulwray rounds the bend in the river and comes face to face with the Mexican boy on the muddy banks."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Gittes, moving with deliberate care and precision, extends his hand into the depths of his cluttered desk and brings forth a small shot glass. He takes a moment to quickly appraise the assortment of bottles before him, deciding to go with a more economical bottle of bourbon from a selection that includes several higher-end whiskey fifths. With a practiced and steady hand, he pours a generous serving into the glass. Without a moment's hesitation, he slides the filled glass smoothly across the desk to Curly, who gazes at it with a blank expression before finally lifting it and downing the contents in one swift motion. Now, Gittes guides Curly past Sophie, who makes a conspicuous effort to avert her gaze. Gittes, with an arm casually draped around Curly's shoulders, flashes a broad, dazzling smile, but as soon as the door closes behind Curly, the smile swiftly disappears from his face. As Gittes enters the room, Walsh stands up as a gesture of acknowledgment, and Gittes returns the gesture with a nod before continuing on his way. He approaches Mrs. Mulwray, offering her a warm and sympathetic smile that causes her to momentarily hold her breath. Gittes draws up a chair and sits down next to Mrs. Mulwray, positioning himself snugly between Duffy and Walsh. He shoots an irritated glance in Duffy's direction, which prompts Duffy to stop his incessant chewing, and then Gittes lets out a weary sigh. Meanwhile, former Mayor Sam Bagby is delivering his speech, standing authoritatively in front of a massive map adorned with overleafs and bold lettering. Some of the councilmen are distracted, their attention captured by the amusing papers and gossip columns, while Bagby soldiers on with his speech. Nearby, a cluster of grubby, disinterested farmers sits, appearing bored and disengaged. One farmer yawns tiredly and shifts away from another particularly dirty farmer, while a mix of farmers, businessmen, and city employees listens with varying degrees of interest. During a whispered conference, a man glances up with interest from his racing form, walks over to the expansive map with overleafs, and is revealed to be a slender man in his sixties, wearing glasses and moving with a surprising grace. He turns to a smaller, younger man and nods, prompting this younger man to turn the overleaf on the map. Mulwray steps away from the overleaf board and takes a seat. Suddenly, the chambers erupt with a cacophony of whoops and hollers from the back, as a red-faced farmer drives in several scrawny, bleating sheep. Bailiffs and sergeants-at-arms respond to the Council's fervent imprecations, attempting to capture both the unruly sheep and the disruptive farmers, and they have to restrain one particularly agitated farmer who seems poised to physically attack Mulwray. Outside, the sun blazes down harshly on the river's stark, unsightly concrete banks, while the earthen banks are dry and choked with weeds. After a moment, Mulwray's car comes into view, traveling along a flood control road elevated about fifteen feet above the bottom of the riverbed. Positioned downstream and just above this flood control road, someone is holding a pair of binoculars, using some dried mustard weeds for cover, and they focus intently on Mulwray. They watch closely as Mulwray makes his way down to the center of the riverbed, where he pauses, turning slowly, as if contemplating the bottom of the riverbed or perhaps simply staring into the void. Then, a small Mexican boy atop a swayback horse rides into the riverbed, coming into Gittes' line of sight. Gittes instinctively moves a bit further back as Mulwray rounds the bend in the river and comes face to face with the Mexican boy on the muddy riverbanks."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Gittes reaches into his desk, his fingers brushing past various items until they close around a shot glass, which he pulls out with a swift motion. He quickly scans the array of whiskey bottles lined up, their labels glinting in the light, and decisively selects a cheaper bottle of bourbon, ignoring the more expensive options. With practiced ease, he unscrews the cap and pours a generous shot into the glass, the liquid splashing slightly as it fills. He then shoves the glass across the desk toward Curly, who stares at it blankly for a moment before his hand reaches out, wraps around the glass, and lifts it to his lips. Curly tilts his head back, draining the contents in one swift motion. Gittes then guides Curly past Sophie, who deliberately turns her gaze away, avoiding eye contact. As they walk, Gittes throws an arm around Curly's shoulders, offering a dazzling smile that seems to light up his face. However, as soon as he shuts the door behind Curly, the smile vanishes, replaced by a more serious expression. Inside, Walsh rises to his feet as Gittes enters the room, acknowledging him with a nod before continuing on his way. Gittes approaches Mrs. Mulwray, his face softening into a warm, sympathetic smile that seems to put her on edge, causing her to hold her breath. He pulls up a chair and sits down next to her, positioning himself between Duffy and Walsh. Gittes casts an irritated glance at Duffy, who is chewing noisily, prompting Duffy to stop mid-chew. Gittes then lets out a sigh, the sound filling the brief silence. Meanwhile, former Mayor Sam Bagby is speaking, standing in front of a huge map adorned with overleafs and bold lettering. Some councilmen, seemingly uninterested, are absorbed in reading funny papers and gossip columns, while a group of grubby farmers sits nearby, looking bored. One farmer yawns and subtly shifts away from a particularly dirty neighbor. Despite this, a mix of farmers, businessmen, and city employees listen intently to Bagby's words. A man, engrossed in his racing form, looks up with interest during a whispered conference, then rises and walks over to the large map. He is a slender man in his sixties, wearing glasses, and moves with a surprising fluidity. He turns to a smaller, younger man, nodding to signal him to turn the overleaf on the map. Mulwray then leaves the overleaf board and returns to his seat. Suddenly, the chambers erupt with whoops and hollers as a red-faced farmer drives several scrawny, bleating sheep into the room. Bailiffs and sergeants-at-arms spring into action, responding to the Council's demands to capture the sheep and restrain the farmers, one of whom seems ready to physically confront Mulwray. Outside, the sun blazes down on the river's ugly concrete banks, while the earthen banks are dry and overgrown with weeds. After a moment, Mulwray's car appears on a flood control road, elevated about fifteen feet above the riverbed. Downstream, someone is positioned just above the road, using dried mustard weeds for cover, and they train a pair of binoculars on Mulwray. They watch as Mulwray makes his way down to the center of the riverbed, where he stops, turns slowly, and seems to be looking at the bottom of the riverbed or perhaps at nothing at all. Then, a small Mexican boy atop a swayback horse rides into the riverbed, coming into Gittes' view. Gittes shifts slightly, moving further back as Mulwray rounds the bend in the river and comes face to face with the Mexican boy on the muddy banks."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gittes selects a cheaper bourbon from his desk, pours a large shot, and slides it to Curly, who drinks it. As they walk past Sophie, Gittes throws an arm around Curly, smiling, but his smile fades once he shuts the door on him. Inside, Gittes nods at Walsh and approaches Mrs. Mulwray with a warm smile, causing her to hold her breath. He sits next to her, glances irritably at Duffy, who stops chewing, and sighs. Meanwhile, former Mayor Sam Bagby speaks in front of a large map, while some councilmen are distracted by funny papers. Farmers, businessmen, and city employees listen intently, though one councilman yawns and shifts away from a dirty farmer. A slender, older man with glasses moves fluidly to the map, nods to a younger man to turn an overleaf, and then Mulwray sits down. Suddenly, chaos erupts as a farmer drives sheep into the chambers, prompting bailiffs and sergeants-at-arms to intervene and restrain an aggressive farmer. Outside, the sun glares off the river's concrete banks, contrasting with the parched, weed-choked earthen sections. Mulwray's car appears on a flood control road, observed by someone with binoculars hidden in dried mustard weeds. They watch as Mulwray descends to the riverbed, seemingly inspecting it. A Mexican boy on a swayback horse rides into view, and Gittes steps back as Mulwray encounters the boy on the muddy banks."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Gittes, a private investigator whose office is cluttered with files and mismatched furniture, reaches into his desk and pulls out a shot glass, quickly selects a cheaper bottle of bourbon, the quintessential American whiskey known for its robust flavor, from several fifths of more expensive whiskeys and pours a large shot. He shoves the glass across his desk toward Curly, a local fisherman who often seeks Gittes' advice, who stares dumbly at it, then picks it up and drains it. He's now walking Curly past Sophie, Gittes' efficient secretary who manages the office affairs, and who pointedly averts her gaze. Gittes throws an arm around Curly and flashes a dazzling smile, honed through years of dealing with all kinds of clients, then shuts the door on him and the smile disappears. Walsh, Gittes' seasoned and loyal associate, rises when Gittes enters, Gittes nods, acknowledging Walsh's silent professionalism, and walks on in. Gittes walks over to Mrs. Mulwray, the elegant and poised wife of a prominent engineer, and again flashes a warm, sympathetic smile, and she holds her breath, feeling the weight of her secretive concerns. Gittes pulls up a chair sitting next to Mrs. Mulwray between Duffy and Walsh, gives Duffy, their quick-tempered colleague, an irritated glance, causing Duffy to stop chewing, likely on a piece of gum, and then Gittes sighs. Former Mayor Sam Bagby is speaking, known for his controversial water policies that have divided the community, with a huge map, overleafs, and bold lettering behind him. Some councilmen are reading funny papers and gossip columns, indicative of their disregard for the proceedings, while Bagby is speaking, and some grubby farmers sit next to them, bored, having traveled from the outskirts of the city to voice their concerns. One yawns and edges away from one of the dirtier farmers, while an amalgam of farmers, businessmen, and city employees listen with keen interest, aware of the impact of Bagby's decisions on their livelihoods. A man looks up with interest from his racing form, commonly browsed by gambling aficionados, during a whispered conference, walks to the huge map with overleafs, and he is a slender man in his sixties, who wears glasses and moves with surprising fluidity, developed from years of working in the fields. He turns to a smaller, younger man and nods, prompting the man to turn the overleaf on the map, revealing the proposed water routes. Mulwray, a key figure in the city's water department, leaves the overleaf board and sits down. Suddenly, there are some whoops and hollers from the rear of the chambers, and a red-faced farmer drives in several scrawny, bleating sheep, protesting recent water diversions affecting their pastures. Bailiffs and sergeants-at-arms respond to the imprecations of the Council and attempt to capture the sheep and the farmers, having to restrain one who looks like he's going to bodily attack Mulwray, frustrated by the water shortage impacting his livelihood. The sun blazes off the river's ugly concrete banks, part of the city's controversial flood control measures, while where the banks are earthen, they are parched and choked with weeds, indicative of the ongoing drought. After a moment, Mulwray's car pulls into view on a flood control road about fifteen feet above the riverbed, where he often goes to contemplate his next moves. Someone holding a pair of binoculars is positioned downstream, possibly a private investigator or concerned citizen, and just above the flood control road, using some dried mustard weeds for cover, and trains the binoculars on him. They watch while Mulwray makes his way down to the center of the riverbed, where he stops, turns slowly, and appears to be looking at the bottom of the riverbed or at nothing at all, a habit that hints at his deep contemplation of the city's water issues. Then a small Mexican boy atop a swayback horse, an animal reflecting the rough, rural life in the area, rides it into the riverbed and into Gittes' view. Gittes moves a little further back as Mulwray rounds the bend in the river and comes face to face with the Mexican boy on the muddy banks, an encounter that seems to puzzle both."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Gittes reaches into his desk and pulls out a shot glass quickly selects a cheaper bottle of bourbon from several fifths of more expensive whiskeys and pours a large shot. He shoves the glass across his desk toward Curly who stares dumbly at it then picks it up and drains it. He is now walking Curly past Sophie who pointedly averts her gaze. Gittes throws an arm around Curly and flashes a dazzling smile then shuts the door on him and the smile disappears. Walsh rises when Gittes enters. Gittes nods and walks on in. Gittes walks over to Mrs Mulwray and again flashes a warm sympathetic smile and she holds her breath. Gittes pulls up a chair sitting next to Mrs Mulwray between Duffy and Walsh gives Duffy an irritated glance causing Duffy to stop chewing and then Gittes sighs. Former Mayor Sam Bagby is speaking with a huge map overleafs and bold lettering behind him. Some councilmen are reading funny papers and gossip columns while Bagby is speaking and some grubby farmers sit next to them bored. One yawns and edges away from one of the dirtier farmers while an amalgam of farmers businessmen and city employees listen with keen interest. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. A man looks up with interest from his racing form during a whispered conference walks to the huge map with overleafs and he is a slender man in his sixties who wears glasses and moves with surprising fluidity. He turns to a smaller younger man and nods prompting the man to turn the overleaf on the map. Mulwray leaves the overleaf board and sits down. Suddenly there are some whoops and hollers from the rear of the chambers and a redfaced farmer drives in several scrawny bleating sheep. Bailiffs and sergeantsatarms respond to the imprecations of the Council and attempt to capture the sheep and the farmers having to restrain. one who looks like he is going to bodily attack Mulwray. The sun blazes off the river's ugly concrete banks while where the banks are earthen they are parched and choked with weeds. After a moment Mulwray's car pulls into view on a flood control road about fifteen feet above the riverbed. Someone holding a pair of binoculars is positioned downstream and just above the flood control road using some dried mustard weeds for cover and trains the binoculars on him. They watch while Mulwray makes his way down to the center of the riverbed where he stops turns slowly and appears to be looking at the bottom of the riverbed or at nothing at all. Then a small Mexican boy atop a swayback horse rides it into the riverbed and into Gittes' view. Gittes moves a little further back as Mulwray rounds the bend in the river and comes face to face with the Mexican boy on the muddy banks."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Gittes reaches into his desk and pulls out a shot glass quickly selects a cheaper bottle of bourbon from several fifths of more expensive whiskeys and pours a large shot. He shoves the glass across his desk toward Curly who stares dumbly at it then picks it up and drains it. He is now walking Curly past Sophie who pointedly averts her gaze. Gittes throws an arm around Curly and flashes a dazzling smile then shuts the door on him and the smile disappears. Walsh rises when Gittes enters. Gittes nods and walks on in. Gittes walks over to Mrs Mulwray and again flashes a warm sympathetic smile and she holds her breath. Gittes pulls up a chair sitting next to Mrs Mulwray between Duffy and Walsh gives Duffy an irritated glance causing Duffy to stop chewing and then Gittes sighs. Former Mayor Sam Bagby is speaking with a huge map overleafs and bold lettering behind him. Some councilmen are reading funny papers and gossip columns while Bagby is speaking and some grubby farmers sit next to them bored. One yawns and edges away from one of the dirtier farmers while an amalgam of farmers businessmen and city employees listen with keen interest. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. A man looks up with interest from his racing form during a whispered conference walks to the huge map with overleafs and he is a slender man in his sixties who wears glasses and moves with surprising fluidity. He turns to a smaller younger man and nods prompting the man to turn the overleaf on the map. Mulwray leaves the overleaf board and sits down. Suddenly there are some whoops and hollers from the rear of the chambers and a redfaced farmer drives in several scrawny bleating sheep. Bailiffs and sergeantsatarms respond to the imprecations of the Council and attempt to capture the sheep and the farmers having to restrain. one who looks like he is going to bodily attack Mulwray. The sun blazes off the river's ugly concrete banks while where the banks are earthen they are parched and choked with weeds. After a moment Mulwray's car pulls into view on a flood control road about fifteen feet above the riverbed. Someone holding a pair of binoculars is positioned downstream and just above the flood control road using some dried mustard weeds for cover and trains the binoculars on him. They watch while Mulwray makes his way down to the center of the riverbed where he stops turns slowly and appears to be looking at the bottom of the riverbed or at nothing at all. Then a small Mexican boy atop a swayback horse rides it into the riverbed and into Gittes' view. Gittes moves a little further back as Mulwray rounds the bend in the river and comes face to face with the Mexican boy on the muddy banks."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Gittes reaches into his desk and pulls out a shot glass quickly selects a cheaper bottle of bourbon from several fifths of more expensive whiskeys and pours a large shot. He shoves the glass across his desk toward Curly who stares dumbly at it then picks it up and drains it. He is now walking Curly past Sophie who pointedly averts her gaze. Gittes throws an arm around Curly and flashes a dazzling smile then shuts the door on him and the smile disappears. Walsh rises when Gittes enters. Gittes nods and walks on in. The sun blazes off the river's ugly concrete banks while where the banks are earthen they are parched and choked with weeds. After a moment Mulwray's car pulls into view on a flood control road about fifteen feet above the riverbed. Someone holding a pair of binoculars is positioned downstream and just above the flood control road using some dried mustard weeds for cover and trains the binoculars on him. They watch while Mulwray makes his way down to the center of the riverbed where he stops turns slowly and appears to be looking at the bottom of the riverbed or at nothing at all. Then a small Mexican boy atop a swayback horse rides it into the riverbed and into Gittes' view. Gittes moves a little further back as Mulwray rounds the bend in the river and comes face to face with the Mexican boy on the muddy banks."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Gittes reaches into his desk and pulls out a shot glass quickly selects a cheaper bottle of bourbon from several fifths of more expensive whiskeys and pours a large shot. He shoves the glass across his desk toward Curly who stares dumbly at it then picks it up and drains it. They watch while Mulwray makes his way down to the center of the riverbed where he stops turns slowly and appears to be looking at the bottom of the riverbed or at nothing at all. Then a small Mexican boy atop a swayback horse rides it into the riverbed and into Gittes' view. Gittes moves a little further back as Mulwray rounds the bend in the river and comes face to face with the Mexican boy on the muddy banks."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Baxter digs into his backpack and extracts a thimble, hastily picks out a budget bottle of apple cider from several gallons of pricier juices, and pours a hefty thimbleful. He slides the thimble across the table toward Rufus, who gawks blankly at it, then grabs it and empties it. He's now escorting Rufus past Clara, who deliberately avoids his look. Baxter wraps a leg around Rufus and beams a radiant grin, then closes the curtain on him and the grin vanishes. Taylor stands when Baxter arrives, Baxter winks and strolls on through. Baxter ambles over to Mrs. Hippo and again beams a gentle, compassionate grin, and she holds her laughter. Baxter drags up a stool sitting next to Mrs. Hippo between Grady and Taylor, gives Grady an exasperated glare, causing Grady to stop doodling, and then Baxter groans. Retired Doctor Fred Bloom is reciting, with a giant globe, illustrations, and bold artwork behind him. Some jurors are perusing comic strips and advice columns while Bloom is reciting, and some dusty travelers sit beside them, uninterested. One coughs and inches away from one of the grimier travelers, while a mixture of travelers, merchants, and office workers listen with eager attention. A woman glances up with enthusiasm from her betting guide during a whispered discussion, strolls to the giant globe with illustrations, and she is a slender woman in her seventies, who wears a hat and moves with surprising grace. She turns to a larger, older woman and winks, prompting the woman to flip the illustration on the globe. Hippo exits the illustration board and takes a seat. Suddenly, there are some cheers and shouts from the front of the arena, and a flushed traveler herds in several scruffy, braying goats. Attendants and security guards react to the appeals of the Assembly and attempt to corral the goats and the travelers, having to contain one who looks like she's going to physically tussle with Hippo. The moon glints off the canal's shiny marble edges, while where the edges are grassy, they are dry and crowded with flowers. After a moment, Hippo's wagon rolls into sight on an irrigation trail about ten feet above the canal floor. Someone holding a telescope is situated upstream and just below the irrigation trail, using some dried lavender flowers for concealment, and aims the telescope at her. They observe while Hippo makes her way down to the middle of the canal floor, where she halts, pivots gradually, and seems to be gazing at the base of the canal floor or at nothing whatsoever. Then a small Italian girl atop a sturdy donkey trots it into the canal floor and into Baxter's line of sight. Baxter shifts a little further forward as Hippo curves around the bend in the canal and comes nose to nose with the Italian girl on the dusty edges."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gittes, selecting a cheap bourbon, pours a shot for Curly, who drinks it and leaves. Gittes then greets Mrs. Mulwray with a reassuring smile as he sits beside her, casting an annoyed look at Duffy. Meanwhile, former Mayor Sam Bagby presents a large map, while councilmen and farmers exhibit varying levels of interest. Mulwray, involved in map discussions, sits down as chaos erupts with a farmer driving sheep into the chambers. Bailiffs try to control the situation, preventing any attack on Mulwray. Outside, Mulwray drives along a flood control road, observed by someone with binoculars. Mulwray stops in the riverbed, seemingly lost in thought. A Mexican boy on horseback approaches, catching Gittes' interest as he watches the encounter unfold."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Gittes moves a little further back as Mulwray rounds the bend in the river and comes face to face with the Mexican boy on the muddy banks Then a small Mexican boy atop a swayback horse rides it into the riverbed and into Gittes' view  They watch while Mulwray makes his way down to the center of the riverbed where he stops turns slowly and appears to be looking at the bottom of the riverbed or at nothing at all  Someone holding a pair of binoculars is positioned downstream and just above the flood control road using some dried mustard weeds for cover and trains the binoculars on him  After a moment Mulwray's car pulls into view on a flood control road about fifteen feet above the riverbed  The sun blazes off the river's ugly concrete banks while where the banks are earthen they are parched and choked with weeds  one who looks like he's going to bodily attack Mulwray  Bailiffs and sergeantsatarms respond to the imprecations of the Council and attempt to capture the sheep and the farmers having to restrain  Suddenly there are some whoops and hollers from the rear of the chambers and a redfaced farmer drives in several scrawny bleating sheep  Mulwray leaves the overleaf board and sits down  He turns to a smaller younger man and nods prompting the man to turn the overleaf on the map  A man looks up with interest from his racing form during a whispered conference walks to the huge map with overleafs and he is a slender man in his sixties who wears glasses and moves with surprising fluidity  One yawns and edges away from one of the dirtier farmers while an amalgam of farmers businessmen and city employees listen with keen interest  Some councilmen are reading funny papers and gossip columns while Bagby is speaking and some grubby farmers sit next to them bored  Former Mayor Sam Bagby is speaking with a huge map overleafs and bold lettering behind him  Gittes pulls up a chair sitting next to Mrs Mulwray between Duffy and Walsh gives Duffy an irritated glance causing Duffy to stop chewing and then Gittes sighs  Gittes walks over to Mrs Mulwray and again flashes a warm sympathetic smile and she holds her breath  Gittes nods and walks on in  Walsh rises when Gittes enters  Gittes throws an arm around Curly and flashes a dazzling smile then shuts the door on him and the smile disappears  He's now walking Curly past Sophie who pointedly averts her gaze  He shoves the glass across his desk toward Curly who stares dumbly at it then picks it up and drains it  Gittes reaches into his desk and pulls out a shot glass quickly selects a cheaper bottle of bourbon from several fifths of more expensive whiskeys and pours a large shot "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He shoves the glass across his desk toward Curly who stares dumbly at it then picks it up and drains it Gittes reaches into his desk and pulls out a shot glass quickly selects a cheaper bottle of bourbon from several fifths of more expensive whiskeys and pours a large shot Gittes throws an arm around Curly and flashes a dazzling smile then shuts the door on him and the smile disappears He is now walking Curly past Sophie who pointedly averts her gaze Gittes nods and walks on in Walsh rises when Gittes enters Gittes pulls up a chair sitting next to Mrs Mulwray between Duffy and Walsh gives Duffy an irritated glance causing Duffy to stop chewing and then Gittes sighs Gittes walks over to Mrs Mulwray and again flashes a warm sympathetic smile and she holds her breath Some councilmen are reading funny papers and gossip columns while Bagby is speaking and some grubby farmers sit next to them bored Former Mayor Sam Bagby is speaking with a huge map overleafs and bold lettering behind him A man looks up with interest from his racing form during a whispered conference walks to the huge map with overleafs and he is a slender man in his sixties who wears glasses and moves with surprising fluidity One yawns and edges away from one of the dirtier farmers while an amalgam of farmers businessmen and city employees listen with keen interest Mulwray leaves the overleaf board and sits down He turns to a smaller younger man and nods prompting the man to turn the overleaf on the map Bailiffs and sergeantsatarms respond to the imprecations of the Council and attempt to capture the sheep and the farmers having to restrain Suddenly there are some whoops and hollers from the rear of the chambers and a redfaced farmer drives in several scrawny bleating sheep The sun blazes off the river's ugly concrete banks while where the banks are earthen they are parched and choked with weeds one who looks like he is going to bodily attack Mulwray Someone holding a pair of binoculars is positioned downstream and just above the flood control road using some dried mustard weeds for cover and trains the binoculars on him After a moment Mulwray's car pulls into view on a flood control road about fifteen feet above the riverbed Then a small Mexican boy atop a swayback horse rides it into the riverbed and into Gittes' view They watch while Mulwray makes his way down to the center of the riverbed where he stops turns slowly and appears to be looking at the bottom of the riverbed or at nothing at all Gittes moves a little further back as Mulwray rounds the bend in the river and comes face to face with the Mexican boy on the muddy banks"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He turns to a smaller younger man and nods prompting the man to turn the overleaf on the map  Mulwray leaves the overleaf board and sits down  Suddenly there are some whoops and hollers from the rear of the chambers and a redfaced farmer drives in several scrawny bleating sheep  Bailiffs and sergeantsatarms respond to the imprecations of the Council and attempt to capture the sheep and the farmers having to restrain  one who looks like he's going to bodily attack Mulwray  The sun blazes off the river's ugly concrete banks while where the banks are earthen they are parched and choked with weeds  After a moment Mulwray's car pulls into view on a flood control road about fifteen feet above the riverbed  Someone holding a pair of binoculars is positioned downstream and just above the flood control road using some dried mustard weeds for cover and trains the binoculars on him  They watch while Mulwray makes his way down to the center of the riverbed where he stops turns slowly and appears to be looking at the bottom of the riverbed or at nothing at all  Then a small Mexican boy atop a swayback horse rides it into the riverbed and into Gittes' view  Gittes moves a little further back as Mulwray rounds the bend in the river and comes face to face with the Mexican boy on the muddy banks Gittes reaches into his desk and pulls out a shot glass quickly selects a cheaper bottle of bourbon from several fifths of more expensive whiskeys and pours a large shot  He shoves the glass across his desk toward Curly who stares dumbly at it then picks it up and drains it  He's now walking Curly past Sophie who pointedly averts her gaze  Gittes throws an arm around Curly and flashes a dazzling smile then shuts the door on him and the smile disappears  Walsh rises when Gittes enters  Gittes nods and walks on in  Gittes walks over to Mrs Mulwray and again flashes a warm sympathetic smile and she holds her breath  Gittes pulls up a chair sitting next to Mrs Mulwray between Duffy and Walsh gives Duffy an irritated glance causing Duffy to stop chewing and then Gittes sighs  Former Mayor Sam Bagby is speaking with a huge map overleafs and bold lettering behind him  Some councilmen are reading funny papers and gossip columns while Bagby is speaking and some grubby farmers sit next to them bored  One yawns and edges away from one of the dirtier farmers while an amalgam of farmers businessmen and city employees listen with keen interest  A man looks up with interest from his racing form during a whispered conference walks to the huge map with overleafs and he is a slender man in his sixties who wears glasses and moves with surprising fluidity "
        }
      ]
    }
  ]
}