{
  "ground_truth": "Thunder explodes in the distance as lightning flashes, while the Mercedes-Benz drives into the courtyard of a formidable stone castle. Indy reaches into the back seat to retrieve his bullwhip, and he glances up at Elsa's beret, which she adjusts. A butler walks to the door and opens it to reveal Indy and Elsa standing outside in the rain, with Elsa now wearing Indy's fedora and Indy wearing Elsa's beret. Indy, followed by Elsa, steps inside, shaking the water from his overcoat, and as he does so, he pushes past the startled butler, pulling a handkerchief from the man's pocket. Elsa follows, taking off her coat, while Indy sneezes hard and dabs at his nose with the handkerchief as Elsa looks on in amused amazement. The butler falls against a wall tapestry, sliding down to the floor, unconscious. Indy and Elsa move cautiously and quietly down the wide, vaulted hallway, creeping past a room full of Nazi soldiers who are working around a large table with a map atop it, and Indy reacts to the sight of them. Indy and Elsa continue down the hallway, with Indy carrying a gun in his hand and his whip hanging from his belt. He steps to a closed door and listens, then points out an electrical wire, studies the situation for a moment, and decides to enter one of the other doors. He knocks at the door, but there is no response, so he looks back at Elsa and enters. The room is dark and empty, and Indy throws open the window shutters to look out at the rain coming down in sheets. There is a wide ledge beneath each window, but below that is a sheer drop. Indy leans out the window and wraps his bullwhip around some wires that protrude from the castle wall above the next window. He swings from the window to a stone gargoyle and then takes hold of the bullwhip with both hands, pushes off with his feet, and swings toward a shuttered window with his feet extended, crashing through the wooden shutters as a clap of thunder disguises the noise. Indy crashes through the shutters and glass into the room, stunned and sinking to one knee as his father, Professor Henry Jones, steps out of the shadows. Indy gets to his feet, and now they look at each other, pressing themselves against the wall, with Henry still holding a broken vase in his hand. Indy steps to the window and looks down while Henry moves to a lamp to hold the vase under the light for a closer look, all the while focused on the broken vase.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Thunder detonates in the remoteness as lightning flickers, while the Mercedes-Benz rolls into the courtyard of a formidable stone fortress. Indy reaches into the rear seat to reclaim his bullwhip, and he glances up at Elsa's cap, which she adjusts. A servant walks to the entrance and opens it to reveal Indy and Elsa standing outside in the rain, with Elsa now wearing Indy's hat and Indy wearing Elsa's cap. Indy, followed by Elsa, steps inside, shaking the water from his overcoat, and as he does so, he pushes past the startled servant, pulling a handkerchief from the man's pocket. Elsa follows, removing her coat, while Indy sneezes forcefully and dabs at his nose with the handkerchief as Elsa looks on in amused amazement. The servant falls against a wall tapestry, sliding down to the floor, insensible. Indy and Elsa move cautiously and quietly down the broad, vaulted corridor, creeping past a chamber full of Nazi troops who are working around a large table with a chart atop it, and Indy reacts to the sight of them. Indy and Elsa proceed down the corridor, with Indy carrying a gun in his hand and his whip hanging from his belt. He steps to a shut door and listens, then points out an electrical wire, examines the situation for a moment, and decides to enter one of the other doors. He knocks at the door, but there is no reply, so he looks back at Elsa and enters. The chamber is dark and vacant, and Indy throws open the window shutters to look out at the rain descending in torrents. There is a wide ledge beneath each window, but below that is a sheer drop. Indy leans out the window and wraps his bullwhip around some wires that jut from the fortress wall above the next window. He swings from the window to a stone gargoyle and then grips the bullwhip with both hands, pushes off with his feet, and swings toward a shuttered window with his feet extended, crashing through the wooden shutters as a crash of thunder masks the noise. Indy crashes through the shutters and glass into the chamber, stunned and sinking to one knee as his father, Professor Henry Jones, steps out of the shadows. Indy gets to his feet, and now they look at each other, pressing themselves against the wall, with Henry still holding a shattered vase in his hand. Indy steps to the window and looks down while Henry moves to a lamp to hold the vase under the light for a closer inspection, all the while focused on the shattered vase."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Thunder is exploded in the distance by lightning flashes, while the courtyard of a formidable stone castle is driven into by the Mercedes-Benz. The bullwhip is retrieved by Indy from the back seat, and up is glanced by him at Elsa's beret, which is adjusted by her. The door is walked to and opened by a butler to reveal Indy and Elsa standing outside in the rain, with Indy's fedora now worn by Elsa and Elsa's beret worn by Indy. Inside is stepped by Indy, followed by Elsa, and as this is done by him, the water is shaken from his overcoat, and the startled butler is pushed past by him, a handkerchief being pulled from the man's pocket. The coat of Elsa is taken off by her as she follows, while a hard sneeze is sneezed by Indy, and his nose is dabbed at with the handkerchief as Elsa looks on in amused amazement. Against a wall tapestry falls the butler, sliding down to the floor, unconscious. Cautiously and quietly, the wide, vaulted hallway is moved down by Indy and Elsa, creeping past a room full of Nazi soldiers who work around a large table with a map atop it, and the sight of them is reacted to by Indy. Down the hallway continue Indy and Elsa, with a gun carried by Indy in his hand and his whip hanging from his belt. To a closed door steps Indy, and the situation is listened to by him, then an electrical wire is pointed out, studied for a moment, and one of the other doors is decided on entering. The door is knocked at by him, but a response is not received, so back is looked by him at Elsa and entrance is made. Dark and empty is the room, and the window shutters are thrown open by Indy to look out at the rain coming down in sheets. Beneath each window is a wide ledge, but a sheer drop is below that. Out the window leans Indy, and his bullwhip is wrapped around some wires that protrude from the castle wall above the next window. From the window, a swing is taken to a stone gargoyle by him, and the bullwhip is taken hold of with both hands, pushed off with his feet, and toward a shuttered window is swung with his feet extended, the wooden shutters being crashed through as a clap of thunder disguises the noise. Through the shutters and glass crashes Indy into the room, stunned and sinking to one knee as the shadows are stepped out of by his father, Professor Henry Jones. To his feet gets Indy, and now at each other they look, pressed against the wall, with a broken vase still held by Henry in his hand. To the window steps Indy and looks down while a lamp is moved to by Henry to hold the vase under the light for a closer look, all the while focusing on the broken vase."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Thunder erupts as lightning illuminates a Mercedes-Benz entering a stone castle courtyard. Indy retrieves his bullwhip from the back seat and notices Elsa adjusting her beret. A butler opens the door, revealing them standing in the rain—Elsa now wears Indy's fedora, and Indy has Elsa's beret. Indy enters, shaking off water, and pulls a handkerchief from the butler's pocket. Elsa follows, amused as Indy sneezes and wipes his nose. The butler collapses against a wall. Indy and Elsa stealthily move down a vaulted hallway, passing Nazis working around a map. With a gun and whip, Indy listens at a door, spots an electrical wire, and decides to enter another room. Finding it dark and empty, he opens the shutters to see rain pouring outside. Indy wraps his bullwhip around wires and swings to a stone gargoyle, then crashes through a window as thunder masks the noise. Inside, stunned and kneeling, he sees his father, Professor Henry Jones, standing in the shadows. Indy rises, they press against the wall, and Henry examines a broken vase under a lamp, still focused on it."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Thunder rumbles and lightning flashes as a Mercedes-Benz arrives at a stone castle. Indy grabs his bullwhip, noticing Elsa adjusting her beret. A butler opens the door, revealing Indy and Elsa in swapped hats, standing in the rain. Indy enters, shaking his coat and taking a handkerchief from the butler, who faints after they pass. Elsa follows, amused as Indy sneezes. They quietly navigate a hallway full of Nazi soldiers by a table with a map. Indy, gun in hand, listens at a door, notices an electrical wire, and decides to enter another door. Finding it dark and empty, he opens the window shutters to see rain. Below is a sheer drop, so Indy wraps his bullwhip around wires above, swinging to a stone gargoyle and crashing through window shutters, thunder masking the noise. Inside, stunned, Indy sees his father, Professor Henry Jones, emerge. They meet eyes as Henry, holding a broken vase, focuses on it while Indy checks the window."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the distance, thunder rumbles ominously, while bolts of lightning illuminate the sky in sporadic flashes, setting an eerie atmosphere as the Mercedes-Benz glides into the expansive courtyard of a foreboding, ancient stone castle. Inside the vehicle, Indy reaches into the back seat to grab his trusty bullwhip, a gesture that has become second nature to him, and he briefly glances upward at Elsa, who is adjusting her stylish beret with a practiced hand. Outside, as the vehicle comes to a stop, a dignified butler approaches the grand door, diligently opening it to reveal Indy and Elsa standing in the rain—Elsa now sporting Indy's iconic fedora and Indy donning Elsa's distinctive beret. With a decisive step, Indy enters the castle first, closely trailed by Elsa, water streaming off his overcoat as he vigorously shakes it. As they move past the butler, whose face shows shock and surprise, Indy briskly pulls a handkerchief from the man's pocket. Elsa follows suit, removing her own coat, all while Indy lets out a loud sneeze and uses the handkerchief to dab at his nose, causing Elsa to watch in a mix of amusement and wonder. Meanwhile, the butler, losing his balance, collapses against a grand wall tapestry and slides unceremoniously to the floor, unconscious. \n\nCautiously, with careful and deliberate movements, Indy and Elsa make their way down the broad, echoing hallway, taking great care to remain silent. They quietly pass a room bustling with Nazi soldiers clustered around a large table, intently focused on a map spread out before them; Indy involuntarily reacts at the sight of them. Undeterred, he and Elsa continue their silent journey down the corridor, with Indy holding a gun securely in his hand and his whip conspicuously hanging from his belt. Upon arriving at a closed door, he listens intently, noticing an electrical wire—a detail that catches his attention. After a moment of consideration, he decides to opt for one of the alternative doors. He knocks confidently at this door, but hearing no answer, he exchanges a look with Elsa before decisively stepping inside. The room is dark and devoid of any life, prompting Indy to fling open the window shutters to peer out into the storm. Sheets of rain cascade from the sky, an unbroken downpour. Below the window, a wide ledge can be seen, but beneath that lies a perilous sheer drop, adding to the room's daunting aura. \n\nWith determination, Indy leans far out the window, skillfully wrapping his bullwhip around a set of wires that jut out from the castle wall above the next window. Using his agility, he swings from the window to a sturdy stone gargoyle, firmly grasping the bullwhip with both hands. He pushes off with his feet, propelling himself toward a nearby shuttered window with his feet extended forward, crashing through the wooden shutters with a crash that is fortuitously masked by a simultaneous clap of thunder. Indy lands inside, bursting through the shattered shutters and fractured glass, momentarily stunned, sinking to one knee from the impact. Just then, his father, Professor Henry Jones, emerges from the shadows, breaking the momentary silence. Indy rises to his feet, and together they exchange meaningful looks, pressing themselves against the wall for concealment. Henry, still holding a broken vase in his hand, remains fixated on it, while Indy heads to the window to survey the drop below. Meanwhile, Henry moves to the lamp, carefully bringing the vase into the light for a closer inspection, his attention unwavering as he studies its fragments."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the far-off distance, the sound of thunder resonates ominously across the landscape, accompanied by sporadic, brilliant flashes of lightning that light up the sky, creating a haunting and eerie atmosphere. Amidst this dramatic backdrop, a sleek Mercedes-Benz gracefully glides into the expansive courtyard of an imposing, ancient stone castle that exudes a foreboding presence. Seated inside the vehicle, Indy reaches back into the rear seat to retrieve his trusty bullwhip, a gesture that has become almost instinctive for him over the years. He briefly lifts his gaze to glance at Elsa, who is deftly adjusting her stylish beret with the ease of practiced familiarity. As the car rolls to a stop outside the castle, a dignified butler promptly makes his way to the grand door, methodically opening it to reveal Indy and Elsa standing in the rain. Elsa is now wearing Indy's iconic fedora, while Indy dons Elsa's distinctive beret. With a decisive and purposeful step, Indy crosses the threshold into the castle first, with Elsa following closely behind, water streaming off his long overcoat as he gives it a vigorous shake. As they stride past the butler, whose expression betrays shock and disbelief, Indy briskly pulls a handkerchief from the man's pocket. Elsa mirrors him by removing her coat, all while Indy emits a loud sneeze, using the purloined handkerchief to dab at his nose, which prompts Elsa to watch with a mix of amusement and wonder. Meanwhile, the stunned butler loses his balance and collapses against a grand wall tapestry, sliding unceremoniously to the floor in a faint.\n\nCarefully and with deliberate caution, Indy and Elsa proceed down the broad, echo-filled hallway, ensuring they remain as silent as possible. As they quietly pass by a room bustling with Nazi soldiers, who are gathered around a large table with their attention firmly fixed on a map spread out before them, Indy involuntarily reacts at the sight. Despite this, he and Elsa are undeterred, continuing their quiet journey through the corridor. Indy holds a gun securely in his hand, with his whip conspicuously hanging from his belt. When they reach a closed door, he listens intently and notices an electrical wire, a detail that catches his attention and prompts a moment of careful consideration. Deciding against this door, he chooses one of the alternatives. He knocks confidently at this new door, and upon receiving no response, he exchanges a meaningful look with Elsa before decisively stepping inside. The room is plunged in darkness and devoid of any signs of life, prompting Indy to fling open the window shutters to peer out into the stormy night. Sheets of relentless rain cascade from the sky, creating an unbroken downpour. Below the window, a wide ledge is visible, but beneath that lies a perilous sheer drop, adding to the room's daunting aura.\n\nWith unwavering determination, Indy leans far out of the window, deftly wrapping his bullwhip around a set of wires that jut out from the castle wall above the adjacent window. Relying on his agility, he swings from the window to a sturdy stone gargoyle, firmly grasping the bullwhip with both hands. Pushing off with his feet, he propels himself toward a nearby shuttered window with his feet extended forward, crashing through the wooden shutters with a loud crash that is fortuitously masked by a simultaneous clap of thunder. Indy lands inside, bursting through the shattered shutters and fractured glass, momentarily stunned, sinking to one knee from the impact. At that moment, his father, Professor Henry Jones, emerges from the shadows, breaking the silence that had settled over the room. Indy quickly rises to his feet, and together they exchange meaningful and understanding looks before pressing themselves against the wall for concealment. Henry, still holding a broken vase in his hand, remains fixated on it, while Indy moves to the window to survey the perilous drop below. Meanwhile, Henry approaches the lamp, carefully bringing the vase into the light for closer examination, his attention unwavering as he meticulously studies its fragments."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the distance, thunder erupts with a powerful explosion, accompanied by bright flashes of lightning, creating a dramatic atmosphere as the Mercedes-Benz expertly navigates its way into the courtyard of a formidable stone castle. Inside the car, Indy reaches back with a swift motion to grab his bullwhip from the back seat, casting a quick and observant glance upward at Elsa, who elegantly adjusts her beret to fit just right. At the castle's entrance, a butler makes his way to the door with methodical steps, pulling it open to reveal Indy and Elsa standing outside, drenched by the relentless rain. Notably, Elsa now sports Indy's iconic fedora, while Indy has donned Elsa's beret, creating an amusing swap. Indy steps forward with determination, closely followed by Elsa, both dripping wet as Indy shakes the excess water from his overcoat. As they make their entrance, Indy brushes past the bewildered butler with a sense of urgency, deftly pulling a handkerchief from the man's pocket without missing a beat. Elsa enters right behind him, gracefully removing her coat with a fluid motion, while Indy succumbs to a powerful sneeze, quickly using the handkerchief to dab at his nose, much to Elsa's amused amazement. The butler, overwhelmed by the sudden turn of events, stumbles backward against a wall tapestry and slides down to the floor, unconscious. Indy and Elsa proceed with cautious, deliberate steps down the wide, vaulted hallway, maintaining a quiet demeanor as they creep past a room filled with Nazi soldiers busily working around a large table with a map spread out atop it. Indy absorbs the sight with a reflexive reaction but doesn’t pause, continuing down the hallway with Elsa. Indy's hand grips a gun, and his trusty whip hangs from his belt as they proceed. Reaching a closed door, Indy stops to listen intently, then points out an electrical wire, analyzing the situation thoughtfully before deciding to try entering one of the other doors. Approaching a different door, he knocks firmly but receives no response. Undeterred, he glances back at Elsa to signal his intention before stepping inside. The room they enter is dim and vacant, prompting Indy to move confidently to the window where he throws open the shutters, revealing sheets of rain pouring down outside. He observes the wide ledge beneath each window and notes the sheer drop below. Leaning out of the window, Indy quickly wraps his bullwhip around protruding wires above the adjacent window with practiced precision. Securing his hold, he swings from the window with agility, aiming for a stone gargoyle nearby. Grasping the bullwhip firmly with both hands, he pushes off with his feet, launching himself toward another shuttered window with his feet outstretched. The momentum carries him crashing through the wooden shutters, the sound effectively masked by a timely clap of thunder. Indy tumbles through the shattered shutters and glass, momentarily stunned as he drops to one knee. In the dimly lit room, his father, Professor Henry Jones, emerges from the shadows, taking in the sudden arrival. Indy rises to his feet, and the two men share a moment, pressing themselves strategically against the wall. Henry is engrossed with a broken vase in his hand, stepping toward a lamp to inspect it more closely under the light, his attention fully captured by the artifact despite the commotion."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Thunder rumbles as a Mercedes-Benz arrives at a stone castle. Indy grabs his bullwhip and exchanges hats with Elsa. A butler opens the door to reveal them in the rain, with Elsa wearing Indy's fedora and Indy, Elsa's beret. They enter, with Indy shaking off the rain and deftly taking a handkerchief from the butler's pocket as he sneezes, amusing Elsa. The butler faints against a wall tapestry. Indy and Elsa cautiously proceed down a hallway past a room of Nazi soldiers and reacts to their presence. Indy carries a gun and approaches a door, listens, and after spotting an electrical wire, decides to try another door. Receiving no response after knocking, he enters, opens the window shutters, and observes the rain outside. Noticing a wide ledge and a sheer drop below, he wraps his bullwhip around protruding wires and swings to a gargoyle, then propels himself through another window. He crashes in, stunned, as his father, Professor Henry Jones, emerges from the shadows. They exchange glances, pressing against the wall, as Henry inspects a broken vase under a lamp."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Thunder explodes in the distance as lightning flashes, while the Mercedes-Benz, a luxury German automobile brand known for its high-performance vehicles, drives into the courtyard of a formidable stone castle, reminiscent of medieval European fortresses. Indy, an adventurous archaeologist famed for his daring exploits, reaches into the back seat to retrieve his iconic bullwhip, a tool he often uses in his escapades, and he glances up at Elsa's beret, which she adjusts with a hint of Parisian flair. A butler, dressed in traditional formal attire often seen in stately homes, walks to the door and opens it to reveal Indy and Elsa standing outside in the rain, with Elsa now wearing Indy's signature brown fedora and Indy wearing Elsa's fashionable beret. Indy, followed by Elsa, steps inside, shaking the water from his overcoat, and as he does so, he pushes past the startled butler, who had been trained to maintain his composure under any circumstance, pulling a handkerchief from the man's pocket. Elsa follows, taking off her coat, made from fine wool to withstand the chill, while Indy sneezes hard, likely from the sudden temperature change, and dabs at his nose with the handkerchief as Elsa looks on in amused amazement. The butler falls against a wall tapestry, an intricately woven artwork depicting historical scenes, sliding down to the floor, unconscious. Indy and Elsa move cautiously and quietly down the wide, vaulted hallway, reminiscent of Gothic architecture, creeping past a room full of Nazi soldiers, notorious for their roles in World War II, who are working around a large table with a strategic map atop it, and Indy reacts to the sight of them with tense alertness. Indy and Elsa continue down the hallway, with Indy carrying a gun in his hand, a precautionary measure in dangerous situations, and his whip hanging from his belt. He steps to a closed door and listens, then points out an electrical wire, noting the primitive but functional wiring typical of older buildings, studies the situation for a moment, and decides to enter one of the other doors. He knocks at the door, but there is no response, so he looks back at Elsa and enters. The room is dark and empty, and Indy throws open the window shutters to look out at the rain coming down in sheets, heavy as a monsoon. There is a wide ledge beneath each window, but below that is a sheer drop, typical of castle defenses designed to deter intruders. Indy leans out the window and wraps his bullwhip around some wires that protrude from the castle wall above the next window, using them as makeshift climbing aids. He swings from the window to a stone gargoyle, a decorative waterspout designed to protect walls from rainwater, and then takes hold of the bullwhip with both hands, pushes off with his feet, and swings toward a shuttered window with his feet extended, crashing through the wooden shutters as a clap of thunder disguises the noise. Indy crashes through the shutters and glass into the room, stunned and sinking to one knee as his father, Professor Henry Jones, a distinguished scholar renowned for his expertise in ancient history, steps out of the shadows. Indy gets to his feet, and now they look at each other, pressing themselves against the wall, with Henry still holding a broken vase in his hand, which Indy recognizes as an artifact of historical significance. Indy steps to the window and looks down while Henry moves to a lamp to hold the vase under the light for a closer look, all the while focused on the broken vase and its implications for their quest."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Thunder explodes in the distance as lightning flashes while the MercedesBenz drives into the courtyard of a formidable stone castle. Indy reaches into the back seat to retrieve his bullwhip and he glances up at Elsa's beret which she adjusts. A butler walks to the door and opens it to reveal Indy and Elsa standing outside in the rain with Elsa now wearing Indy's fedora and Indy wearing Elsa's beret. Indy followed by Elsa steps inside shaking the water from his overcoat and as he does so he pushes past the startled butler pulling a handkerchief from the man's pocket. Elsa follows taking off her coat while Indy sneezes hard and dabs at his nose with the handkerchief as Elsa looks on in amused amazement. The butler falls against a wall tapestry sliding down to the floor unconscious. Indy and Elsa move cautiously and quietly down the wide vaulted hallway creeping past a room full of Nazi soldiers who are working around a large table with a map atop it and Indy reacts to the sight of them. Indy and Elsa continue down the hallway with Indy carrying a gun in his hand and his whip hanging from his belt. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. He steps to a closed door and listens then points out an electrical wire studies the situation for a moment and decides to enter one of the other doors. He knocks at the door but there is no response so he looks back at Elsa and enters. The room is dark and empty and Indy throws open the window shutters to look out at the rain coming down in sheets. There is a wide ledge beneath each window but below that is a sheer drop. Indy leans out the window and wraps his bullwhip around some wires that protrude from the castle wall above the next window. He swings from the window to a stone gargoyle and then takes hold of the bullwhip with both hands pushes off with his feet and swings toward a shuttered window with his feet extended crashing through the wooden shutters as a clap of thunder disguises the noise. Indy crashes through the shutters and glass into the room stunned and sinking to one knee as his father Professor Henry Jones steps out of the shadows. Indy gets to his feet and now they look at each other pressing themselves against the wall with Henry still holding a broken vase in his hand. Indy steps to the window and looks down while Henry moves to a lamp to hold the vase under the light for a closer look all the while focused on the broken vase."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Thunder explodes in the distance as lightning flashes while the MercedesBenz drives into the courtyard of a formidable stone castle. Indy reaches into the back seat to retrieve his bullwhip and he glances up at Elsa's beret which she adjusts. A butler walks to the door and opens it to reveal Indy and Elsa standing outside in the rain with Elsa now wearing Indy's fedora and Indy wearing Elsa's beret. Indy followed by Elsa steps inside shaking the water from his overcoat and as he does so he pushes past the startled butler pulling a handkerchief from the man's pocket. Elsa follows taking off her coat while Indy sneezes hard and dabs at his nose with the handkerchief as Elsa looks on in amused amazement. The butler falls against a wall tapestry sliding down to the floor unconscious. Indy and Elsa move cautiously and quietly down the wide vaulted hallway creeping past a room full of Nazi soldiers who are working around a large table with a map atop it and Indy reacts to the sight of them. Indy and Elsa continue down the hallway with Indy carrying a gun in his hand and his whip hanging from his belt. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. He steps to a closed door and listens then points out an electrical wire studies the situation for a moment and decides to enter one of the other doors. He knocks at the door but there is no response so he looks back at Elsa and enters. The room is dark and empty and Indy throws open the window shutters to look out at the rain coming down in sheets. There is a wide ledge beneath each window but below that is a sheer drop. Indy leans out the window and wraps his bullwhip around some wires that protrude from the castle wall above the next window. He swings from the window to a stone gargoyle and then takes hold of the bullwhip with both hands pushes off with his feet and swings toward a shuttered window with his feet extended crashing through the wooden shutters as a clap of thunder disguises the noise. Indy crashes through the shutters and glass into the room stunned and sinking to one knee as his father Professor Henry Jones steps out of the shadows. Indy gets to his feet and now they look at each other pressing themselves against the wall with Henry still holding a broken vase in his hand. Indy steps to the window and looks down while Henry moves to a lamp to hold the vase under the light for a closer look all the while focused on the broken vase."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Thunder explodes in the distance as lightning flashes while the MercedesBenz drives into the courtyard of a formidable stone castle. Indy reaches into the back seat to retrieve his bullwhip and he glances up at Elsa's beret which she adjusts. A butler walks to the door and opens it to reveal Indy and Elsa standing outside in the rain with Elsa now wearing Indy's fedora and Indy wearing Elsa's beret. Indy followed by Elsa steps inside shaking the water from his overcoat and as he does so he pushes past the startled butler pulling a handkerchief from the man's pocket. Indy leans out the window and wraps his bullwhip around some wires that protrude from the castle wall above the next window. He swings from the window to a stone gargoyle and then takes hold of the bullwhip with both hands pushes off with his feet and swings toward a shuttered window with his feet extended crashing through the wooden shutters as a clap of thunder disguises the noise. Indy crashes through the shutters and glass into the room stunned and sinking to one knee as his father Professor Henry Jones steps out of the shadows. Indy gets to his feet and now they look at each other pressing themselves against the wall with Henry still holding a broken vase in his hand. Indy steps to the window and looks down while Henry moves to a lamp to hold the vase under the light for a closer look all the while focused on the broken vase."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Thunder explodes in the distance as lightning flashes while the MercedesBenz drives into the courtyard of a formidable stone castle. Indy reaches into the back seat to retrieve his bullwhip and he glances up at Elsa's beret which she adjusts. Indy gets to his feet and now they look at each other pressing themselves against the wall with Henry still holding a broken vase in his hand. Indy steps to the window and looks down while Henry moves to a lamp to hold the vase under the light for a closer look all the while focused on the broken vase."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Thunder whispers in the background as sparklers flicker, while the bicycle rolls into the meadow of an ancient brick fortress. Max reaches into the backpack to locate his umbrella, and he peers up at Clara's helmet, which she adjusts. A chef strolls to the gate and opens it to reveal Max and Clara standing outside in the drizzle, with Clara now wearing Max's jacket and Max wearing Clara's helmet. Max, followed by Clara, strides inside, flicking the droplets from his cape, and as he does so, he brushes past the surprised chef, plucking a napkin from the man's pocket. Clara follows, removing her scarf, while Max coughs loudly and wipes at his cheek with the napkin as Clara observes in curious delight. The chef stumbles against a wall painting, sliding down to the ground, asleep. Max and Clara tiptoe carefully and softly down the narrow, arched corridor, sneaking past a chamber full of pirate crewmen who are assembling around a small bench with a globe atop it, and Max reacts to the sight of them. Max and Clara proceed down the corridor, with Max holding a book in his hand and his umbrella hanging from his shoulder. He tiptoes to a closed hatch and listens, then points out a power cord, evaluates the situation for a moment, and chooses to enter one of the other hatches. He taps at the hatch, but there is no reply, so he glances back at Clara and enters. The space is dim and vacant, and Max flings open the blinds to gaze out at the drizzle pouring down in torrents. There is a narrow shelf beneath each pane, but below that is a steep precipice. Max leans out the pane and wraps his umbrella around some ropes that jut from the fortress wall above the next pane. He swings from the pane to a stone statue and then grabs the umbrella with both hands, pushes off with his legs, and sails toward a closed pane with his legs stretched out, bursting through the wooden blinds as a rumble of sparklers masks the sound. Max bursts through the blinds and glass into the space, dazed and sinking to one knee as his mentor, Professor Arthur Bradley, steps out of the shadows. Max rises, and now they glance at each other, pressing themselves against the wall, with Arthur still holding a cracked jug in his hand. Max tiptoes to the pane and looks downward while Arthur moves to a candle to hold the jug under the glow for a closer inspection, all the while fixated on the cracked jug."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Thunder rumbles as lightning illuminates a stone castle, where a Mercedes-Benz arrives in the courtyard. Indy grabs his bullwhip, and Elsa adjusts her beret, now also wearing Indy's fedora. They enter the castle, passing a startled butler who falls unconscious against a tapestry. Moving cautiously past a room with Nazi soldiers, Indy carries a gun and his whip. He notices an electrical wire and decides to enter a different door. Finding a dark, empty room, Indy opens a window to see the rain and wraps his bullwhip around wires to swing to another window. He breaks through the shutters with a thunder clap masking the sound. Inside, Indy's father, Professor Henry Jones, emerges from shadows, holding a broken vase. Indy rises, and both quietly press against the wall."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Indy steps to the window and looks down while Henry moves to a lamp to hold the vase under the light for a closer look all the while focused on the broken vase Indy gets to his feet and now they look at each other pressing themselves against the wall with Henry still holding a broken vase in his hand Indy crashes through the shutters and glass into the room stunned and sinking to one knee as his father Professor Henry Jones steps out of the shadows He swings from the window to a stone gargoyle and then takes hold of the bullwhip with both hands pushes off with his feet and swings toward a shuttered window with his feet extended crashing through the wooden shutters as a clap of thunder disguises the noise Indy leans out the window and wraps his bullwhip around some wires that protrude from the castle wall above the next window There is a wide ledge beneath each window but below that is a sheer drop The room is dark and empty and Indy throws open the window shutters to look out at the rain coming down in sheets He knocks at the door but there is no response so he looks back at Elsa and enters He steps to a closed door and listens then points out an electrical wire studies the situation for a moment and decides to enter one of the other doors Indy and Elsa continue down the hallway with Indy carrying a gun in his hand and his whip hanging from his belt Indy and Elsa move cautiously and quietly down the wide vaulted hallway creeping past a room full of Nazi soldiers who are working around a large table with a map atop it and Indy reacts to the sight of them The butler falls against a wall tapestry sliding down to the floor unconscious Elsa follows taking off her coat while Indy sneezes hard and dabs at his nose with the handkerchief as Elsa looks on in amused amazement Indy followed by Elsa steps inside shaking the water from his overcoat and as he does so he pushes past the startled butler pulling a handkerchief from the man's pocket A butler walks to the door and opens it to reveal Indy and Elsa standing outside in the rain with Elsa now wearing Indy's fedora and Indy wearing Elsa's beret Indy reaches into the back seat to retrieve his bullwhip and he glances up at Elsa's beret which she adjusts Thunder explodes in the distance as lightning flashes while the MercedesBenz drives into the courtyard of a formidable stone castle"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Indy reaches into the back seat to retrieve his bullwhip and he glances up at Elsa's beret which she adjusts Thunder explodes in the distance as lightning flashes while the MercedesBenz drives into the courtyard of a formidable stone castle Indy followed by Elsa steps inside shaking the water from his overcoat and as he does so he pushes past the startled butler pulling a handkerchief from the man's pocket A butler walks to the door and opens it to reveal Indy and Elsa standing outside in the rain with Elsa now wearing Indy's fedora and Indy wearing Elsa's beret The butler falls against a wall tapestry sliding down to the floor unconscious Elsa follows taking off her coat while Indy sneezes hard and dabs at his nose with the handkerchief as Elsa looks on in amused amazement Indy and Elsa continue down the hallway with Indy carrying a gun in his hand and his whip hanging from his belt Indy and Elsa move cautiously and quietly down the wide vaulted hallway creeping past a room full of Nazi soldiers who are working around a large table with a map atop it and Indy reacts to the sight of them He knocks at the door but there is no response so he looks back at Elsa and enters He steps to a closed door and listens then points out an electrical wire studies the situation for a moment and decides to enter one of the other doors There is a wide ledge beneath each window but below that is a sheer drop The room is dark and empty and Indy throws open the window shutters to look out at the rain coming down in sheets He swings from the window to a stone gargoyle and then takes hold of the bullwhip with both hands pushes off with his feet and swings toward a shuttered window with his feet extended crashing through the wooden shutters as a clap of thunder disguises the noise Indy leans out the window and wraps his bullwhip around some wires that protrude from the castle wall above the next window Indy gets to his feet and now they look at each other pressing themselves against the wall with Henry still holding a broken vase in his hand Indy crashes through the shutters and glass into the room stunned and sinking to one knee as his father Professor Henry Jones steps out of the shadows Indy steps to the window and looks down while Henry moves to a lamp to hold the vase under the light for a closer look all the while focused on the broken vase"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He knocks at the door but there is no response so he looks back at Elsa and enters The room is dark and empty and Indy throws open the window shutters to look out at the rain coming down in sheets There is a wide ledge beneath each window but below that is a sheer drop Indy leans out the window and wraps his bullwhip around some wires that protrude from the castle wall above the next window He swings from the window to a stone gargoyle and then takes hold of the bullwhip with both hands pushes off with his feet and swings toward a shuttered window with his feet extended crashing through the wooden shutters as a clap of thunder disguises the noise Indy crashes through the shutters and glass into the room stunned and sinking to one knee as his father Professor Henry Jones steps out of the shadows Indy gets to his feet and now they look at each other pressing themselves against the wall with Henry still holding a broken vase in his hand Indy steps to the window and looks down while Henry moves to a lamp to hold the vase under the light for a closer look all the while focused on the broken vase Thunder explodes in the distance as lightning flashes while the MercedesBenz drives into the courtyard of a formidable stone castle Indy reaches into the back seat to retrieve his bullwhip and he glances up at Elsa's beret which she adjusts A butler walks to the door and opens it to reveal Indy and Elsa standing outside in the rain with Elsa now wearing Indy's fedora and Indy wearing Elsa's beret Indy followed by Elsa steps inside shaking the water from his overcoat and as he does so he pushes past the startled butler pulling a handkerchief from the man's pocket Elsa follows taking off her coat while Indy sneezes hard and dabs at his nose with the handkerchief as Elsa looks on in amused amazement The butler falls against a wall tapestry sliding down to the floor unconscious Indy and Elsa move cautiously and quietly down the wide vaulted hallway creeping past a room full of Nazi soldiers who are working around a large table with a map atop it and Indy reacts to the sight of them Indy and Elsa continue down the hallway with Indy carrying a gun in his hand and his whip hanging from his belt He steps to a closed door and listens then points out an electrical wire studies the situation for a moment and decides to enter one of the other doors"
        }
      ]
    }
  ]
}