{
  "ground_truth": "Henry presses against the wall, which rotates again. As he disappears into the next room, a dead Nazi radioman swivels into the room, and the other Nazis rush forward to him. Indy picks up a bust of Hitler and uses it to jam the rotating wall in place, sealing the Nazis inside the burning room. Vogel strides purposefully down the hallway and barks an order, causing two more Nazis to fall into step with him. Indy grabs his whip, leather sack, and Henry's case from a table, hands the case to Henry, and they begin to run. Indy and Henry step into an empty room, and Henry looks horrified by what he's been forced to do as Indy searches frantically for an exit. Indy begins to run his hands over the walls with urgency. Henry sits on a chair that tips back, hitting the wall behind it, causing the floor at Indy's feet to suddenly drop away. Indy grabs a railing to keep from falling but loses his grip and plunges through the opening, forming a spiral staircase. He rolls down the stairs, and Henry follows Indy down the staircase. The stairway deposits Indy and Henry into an enormous watery cavern beneath the mountain on which the castle was built, where a full-scale Nazi boat dock has been constructed. Indy boards one of the motorboats and starts the motor. Henry tosses his case at Indy, who catches it and angrily throws it back to his father. Indy moves back to the dock and pushes the boat away, and Henry looks confused. Vogel and the Nazi soldiers enter the room, spot the spiral staircase leading below, and quickly descend the stairs. As Vogel and the Nazi soldiers rush to the dock, Vogel sees that a motorboat is missing and orders the Nazi soldiers into a boat. The motorbike skids to a stop, and Henry slaps him across the face. Arrows point in opposite directions to Venice and Berlin, and the camera moves in on the portion of the sign reading Berlin. A Nazi rally is in process, with a book-burning occurring. The mound of burning books is ten feet tall and growing as college students and Nazi brownshirts continually toss more books onto the fire. Flags, banners, and standards displaying the swastika are waved rhythmically, echoing the mounting frenzy of the enormous crowd. Indy and Henry walk toward the square, with Indy wearing the uniform of a Nazi soldier and buttoning up the tunic, which happens to be several sizes too big. High-ranking officers of the Third Reich flank Adolf Hitler as they oversee the rally.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Henry presses against the partition, which turns again. As he vanishes into the subsequent chamber, a lifeless Nazi radioman rotates into the space, and the other Nazis dash forward to him. Indy picks up a sculpture of Hitler and utilizes it to wedge the revolving partition in position, trapping the Nazis inside the blazing chamber. Vogel strides determinedly down the corridor and barks a command, causing two additional Nazis to fall into step with him. Indy grabs his lash, leather pouch, and Henry's case from a counter, hands the case to Henry, and they commence to sprint. Indy and Henry step into a vacant chamber, and Henry looks appalled by what he's been compelled to undertake as Indy searches frantically for an egress. Indy begins to run his hands over the partitions with urgency. Henry sits on a chair that tips back, striking the partition behind it, causing the floor at Indy's feet to abruptly drop away. Indy grabs a railing to prevent from falling but loses his grip and plunges through the aperture, forming a spiral staircase. He rolls down the steps, and Henry follows Indy down the staircase. The stairway deposits Indy and Henry into a vast watery cavern beneath the mountain on which the stronghold was built, where a full-scale Nazi vessel dock has been constructed. Indy boards one of the motorboats and starts the engine. Henry tosses his case at Indy, who catches it and angrily throws it back to his father. Indy moves back to the dock and pushes the boat away, and Henry looks perplexed. Vogel and the Nazi soldiers enter the chamber, spot the spiral staircase leading below, and quickly descend the steps. As Vogel and the Nazi soldiers rush to the dock, Vogel sees that a motorboat is missing and commands the Nazi soldiers into a boat. The motorbike skids to a stop, and Henry slaps him across the visage. Arrows point in opposing directions to Venice and Berlin, and the camera moves in on the portion of the sign reading Berlin. A Nazi rally is in progress, with a book-burning occurring. The mound of blazing tomes is ten feet tall and increasing as college students and Nazi brownshirts continually toss additional books onto the blaze. Flags, banners, and standards displaying the swastika are waved rhythmically, echoing the mounting frenzy of the enormous throng. Indy and Henry walk toward the plaza, with Indy wearing the uniform of a Nazi soldier and buttoning up the tunic, which happens to be several sizes too large. High-ranking officers of the Third Reich flank Adolf Hitler as they supervise the rally."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The wall is pressed against by Henry, causing it to rotate again. As he is made to disappear into the next room, a dead Nazi radioman is swiveled into the room, and the other Nazis rush forward to him. A bust of Hitler is picked up by Indy and used to jam the rotating wall in place, sealing the Nazis inside the burning room. An order is barked by Vogel as he strides purposefully down the hallway, causing two more Nazis to fall into step with him. A whip, leather sack, and Henry's case are grabbed from a table by Indy, who hands the case to Henry, and they begin to run. Indy and Henry step into an empty room, and Henry is looked at with horror due to what he has been forced to do as Indy frantically searches for an exit. The walls are run over with urgency by Indy. A chair is sat on by Henry, tipping back, and hitting the wall behind it, causing the floor at Indy's feet to suddenly drop away. A railing is grabbed by Indy to keep from falling but his grip is lost, and he plunges through the opening, forming a spiral staircase. The stairs are rolled down by him, and Indy is followed by Henry down the staircase. Indy and Henry are deposited by the stairway into an enormous watery cavern beneath the mountain on which the castle was built, where they find a full-scale Nazi boat dock. A motorboat is boarded by Indy, and the motor is started. Henry tosses his case at Indy, who catches it and angrily throws it back to his father. The dock is moved back to by Indy, and the boat is pushed away, causing Henry to look confused. The room is entered by Vogel and the Nazi soldiers, who spot the spiral staircase leading below and quickly descend the stairs. As the dock is rushed to by Vogel and the Nazi soldiers, Vogel orders the Nazi soldiers into a boat upon seeing that a motorboat is missing. A stop is skidded to by the motorbike, and Henry slaps him across the face. Opposite directions to Venice and Berlin are pointed to by arrows, and the portion of the sign reading Berlin is moved in on by the camera. A Nazi rally is overseeing a book-burning, which is in process. The mound of burning books is grown to ten feet tall as college students and Nazi brownshirts continually toss more books onto the fire. Flags, banners, and standards displaying the swastika are waved rhythmically, echoing the mounting frenzy of the enormous crowd. The square is walked toward by Indy and Henry, with Indy wearing the uniform of a Nazi soldier and buttoning up the tunic, which happens to be several sizes too big. Adolf Hitler is flanked by high-ranking officers of the Third Reich as they oversee the rally."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Henry presses against the wall, which rotates again. As he vanishes into the next room, a dead Nazi radioman swivels in, and other Nazis rush to him. Indy picks up a bust of Hitler to jam the rotating wall, trapping the Nazis in the burning room. Vogel strides down the hallway, ordering two more Nazis to join him. Indy grabs his whip, leather sack, and Henry's case from a table, hands the case to Henry, and they run. In an empty room, Henry looks horrified by his actions as Indy frantically searches for an exit. Indy urgently runs his hands over the walls. Henry sits on a chair that tips back, hitting the wall and causing the floor at Indy's feet to drop away. Indy grabs a railing but loses his grip, plunging through the opening, forming a spiral staircase. He rolls down the stairs, and Henry follows. The stairway leads them to a vast watery cavern beneath the mountain, where a Nazi boat dock is constructed. Indy boards a motorboat and starts the engine. Henry tosses his case to Indy, who angrily throws it back. Indy moves to the dock and pushes the boat away, leaving Henry confused. Vogel and Nazi soldiers enter, spot the missing motorboat, and quickly descend the stairs. Vogel orders the soldiers into a boat. The motorbike skids to a stop, and Henry slaps him. Arrows point to Venice and Berlin, and the camera focuses on the Berlin sign. A Nazi rally is underway, with a book-burning. The mound of burning books grows as students and Nazi brownshirts add more. Flags and banners with swastikas wave rhythmically, echoing the crowd's frenzy. Indy and Henry walk toward the square, with Indy in an oversized Nazi uniform. High-ranking Third Reich officers flank Adolf Hitler, overseeing the rally."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Henry presses against the wall, rotating it. As he vanishes into the next room, a dead Nazi radioman appears, and other Nazis rush to him. Indy uses a bust of Hitler to jam the wall, trapping the Nazis in the burning room. Vogel orders two Nazis to follow him. Indy grabs his whip, leather sack, and Henry's case, handing it to Henry, and they run. In an empty room, Henry looks horrified as Indy searches for an exit. Henry tips a chair, triggering the floor to drop. Indy grabs a railing but falls, forming a spiral staircase. He rolls down, followed by Henry, into a cavern with a Nazi boat dock. Indy starts a motorboat, Henry throws his case, Indy returns it, and pushes the boat away. Vogel and soldiers descend the stairs, see a missing boat, and board another. A motorbike skids, and Henry slaps him. Arrows point to Venice and Berlin. A Nazi rally with book-burning occurs, with flags and swastikas waved. Indy and Henry approach, Indy in an oversized Nazi uniform. High-ranking officers flank Hitler at the rally."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Henry presses himself firmly against the wall, which, in response, rotates once more. As he vanishes into the adjacent room, the lifeless body of a Nazi radioman swivels into view, prompting the other Nazis to rush forward toward him. Indy, seizing the opportunity, picks up a bust of Hitler and cleverly uses it to jam the rotating wall in place, effectively trapping the Nazis inside the room that is now engulfed in flames. Meanwhile, Vogel strides purposefully down the hallway, barking an order that causes two additional Nazis to fall into step with him. Indy quickly grabs his trusty whip, a leather sack, and Henry's case from a nearby table. He hands the case to Henry, and together, they begin to run with urgency. \n\nIndy and Henry find themselves stepping into an empty room, and Henry appears horrified by the actions he has been compelled to take. Indy, on the other hand, frantically searches for an exit, running his hands over the walls with a sense of urgency. Henry, in a moment of unintended consequence, sits on a chair that tips backward, striking the wall behind it. This action causes the floor beneath Indy's feet to suddenly give way. Indy desperately grabs onto a railing to prevent himself from falling but ultimately loses his grip, plunging through the opening, which reveals a spiral staircase. He rolls down the stairs, and Henry follows closely behind him. \n\nThe stairway deposits both Indy and Henry into a vast, watery cavern located beneath the mountain on which the castle was constructed. Here, they discover a full-scale Nazi boat dock that has been built. Indy quickly boards one of the motorboats and starts the engine. Henry, in a moment of haste, tosses his case to Indy, who catches it but then angrily throws it back to his father. Indy maneuvers back to the dock and pushes the boat away, leaving Henry looking confused. At this moment, Vogel and the Nazi soldiers enter the room, spot the spiral staircase leading below, and rapidly descend the stairs. As Vogel and the Nazi soldiers rush to the dock, Vogel notices that a motorboat is missing and promptly orders the Nazi soldiers into another boat. \n\nThe motorbike skids to a stop, and Henry, in a moment of frustration, slaps him across the face. Arrows on a sign point in opposite directions to Venice and Berlin, and the camera zooms in on the portion of the sign that reads Berlin. A Nazi rally is underway, with a book-burning event taking place. The mound of burning books reaches ten feet in height and continues to grow as college students and Nazi brownshirts relentlessly toss more books onto the fire. Flags, banners, and standards emblazoned with the swastika are waved rhythmically, echoing the mounting frenzy of the enormous crowd. Indy and Henry walk toward the square, with Indy now wearing the uniform of a Nazi soldier and buttoning up the tunic, which is noticeably several sizes too large for him. High-ranking officers of the Third Reich flank Adolf Hitler as they oversee the rally, adding to the tense atmosphere."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Henry presses himself firmly against the solid wall, which, in response, rotates once more in a mechanical motion. As he vanishes completely into the adjacent room, the lifeless body of a Nazi radioman swivels into view, prompting the other Nazis to rush forward toward him with urgency. Indy, recognizing the opportunity before him, quickly picks up a bust of Hitler and cleverly uses it to jam the rotating wall in place. This decisive action effectively traps the Nazis inside the room that is now engulfed in growing flames. Meanwhile, Vogel strides purposefully down the hallway, barking an authoritative order that prompts two additional Nazis to fall into step with him in quick succession. Indy quickly grabs his trusty whip, a worn leather sack, and Henry's precious case from a nearby table. He hands the case to Henry, and together, they begin to run with great urgency.\n\nIndy and Henry find themselves stepping into an empty, silent room, and Henry appears visibly horrified by the drastic actions he has been compelled to take. Indy, on the other hand, frantically searches for a reliable exit, running his hands over the walls with a palpable sense of urgency. In a moment of unintended consequence, Henry sits on a chair that unexpectedly tips backward, striking the wall directly behind it. This seemingly simple action causes the floor beneath Indy's feet to suddenly give way. Indy desperately grabs onto a railing to prevent himself from falling but ultimately loses his grip entirely, plunging through the opening, which reveals a spiral staircase. He rolls down the stairs, and Henry follows closely behind him, equally caught off-guard.\n\nThe stairway deposits both Indy and Henry into a vast, watery cavern located beneath the massive mountain on which the castle was constructed. Here, they discover a full-scale Nazi boat dock that has been meticulously built. Indy quickly boards one of the motorboats and starts the engine without hesitation. Henry, in a moment of haste, tosses his case to Indy, who catches it with precision but then, in a fit of anger, throws it back to his father. Indy skillfully maneuvers back to the dock and pushes the boat away, leaving Henry momentarily looking confused by the abrupt action. At this critical moment, Vogel and the Nazi soldiers enter the room, spot the spiral staircase leading below, and rapidly descend the stairs. As Vogel and the Nazi soldiers rush to the dock, Vogel notices that a motorboat is visibly missing and promptly orders the Nazi soldiers into another available boat.\n\nThe motorbike skids to a sudden stop, and Henry, in a moment of sheer frustration, slaps him across the face. Arrows on a nearby sign point in opposite directions to Venice and Berlin, and the camera dramatically zooms in on the portion of the sign that reads Berlin. A Nazi rally is already underway, with a surreal book-burning event taking place. The mound of burning books climbs to an astonishing ten feet in height and continues to grow as college students and Nazi brownshirts relentlessly toss more books onto the raging fire. Flags, banners, and standards emblazoned with the swastika are waved rhythmically, echoing the mounting frenzy of the enormous crowd. Indy and Henry walk toward the bustling square, with Indy now wearing the uniform of a Nazi soldier and buttoning up the tunic, which is noticeably several sizes too large for him. High-ranking officers of the Third Reich flank Adolf Hitler as they oversee the rally, adding a layer of tension to the already charged atmosphere."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Henry presses himself firmly against the wall, feeling the surface give way as it begins to rotate once more. As the wall completes its rotation, Henry vanishes into the adjacent room, and simultaneously, the lifeless body of a Nazi radioman is revealed, swiveling into view. The other Nazis, upon seeing the radioman, rush forward in a flurry of movement. Meanwhile, Indy quickly assesses the situation, spotting a bust of Hitler nearby. He swiftly picks it up and wedges it into the mechanism of the rotating wall, effectively jamming it in place and trapping the Nazis inside the room that is now engulfed in flames. Vogel, with a determined stride, makes his way down the hallway, his voice cutting through the air as he barks an order, prompting two more Nazis to fall into step behind him. Indy, acting with urgency, snatches his whip, a leather sack, and Henry's case from a table. He hands the case to Henry, and together they break into a run. Entering an empty room, Henry's face contorts with horror at the actions he's been compelled to take, while Indy frantically searches for an exit, his hands moving swiftly over the walls in desperation. Henry, seeking a moment of respite, sits on a chair, which unexpectedly tips backward, striking the wall behind it. This action triggers a mechanism that causes the floor beneath Indy's feet to suddenly give way. Indy instinctively grabs onto a railing to prevent himself from falling, but his grip falters, and he plunges through the opening, which reveals a spiral staircase. He tumbles down the stairs, and Henry, regaining his composure, follows closely behind. The staircase deposits both Indy and Henry into a vast, watery cavern beneath the mountain where the castle stands, revealing a full-scale Nazi boat dock. Indy quickly boards one of the motorboats and starts the engine. Henry, not missing a beat, tosses his case to Indy, who catches it with a flash of irritation and throws it back to his father. Indy then maneuvers back to the dock, giving the boat a firm push away, leaving Henry momentarily bewildered. At that moment, Vogel and the Nazi soldiers burst into the room, their eyes immediately drawn to the spiral staircase leading below. They waste no time in descending the stairs. As they reach the dock, Vogel notices the absence of a motorboat and promptly orders the Nazi soldiers to board another boat. Meanwhile, a motorbike skids to a halt, and Henry, in a moment of frustration, slaps the rider across the face. Nearby, arrows on a sign point in opposite directions to Venice and Berlin, and the camera zooms in on the section of the sign indicating Berlin. In Berlin, a Nazi rally is underway, with a massive book-burning event taking place. The pile of burning books reaches ten feet in height and continues to grow as college students and Nazi brownshirts relentlessly add more books to the flames. Flags, banners, and standards emblazoned with the swastika are waved in unison, mirroring the escalating fervor of the immense crowd. Indy and Henry make their way toward the square, with Indy now clad in the uniform of a Nazi soldier, hurriedly buttoning up the tunic, which is noticeably several sizes too large for him. High-ranking officers of the Third Reich stand flanking Adolf Hitler as they oversee the rally, their presence adding to the gravity of the event."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Henry presses against the wall, triggering its rotation and disappearing into the next room as a dead Nazi radioman swivels into view, prompting the other Nazis to rush forward. Indy quickly jams the rotating wall with a bust of Hitler, trapping the Nazis in the burning room. Meanwhile, Vogel strides down the hallway, ordering two more Nazis to join him. Indy gathers his whip, leather sack, and Henry's case from a table, handing the case to Henry as they start running. Entering an empty room, Henry looks horrified by their situation while Indy urgently searches for an exit. As Indy frantically runs his hands over the walls, Henry accidentally tips back a chair, triggering a mechanism that causes the floor to drop away, revealing a spiral staircase. Indy loses his grip on a railing and tumbles down the stairs, with Henry following. They find themselves in a vast watery cavern beneath the mountain, where a Nazi boat dock is located. Indy boards a motorboat and starts the engine, catching and angrily returning Henry's tossed case. Indy then pushes the boat away from the dock, leaving Henry momentarily confused. Vogel and the Nazi soldiers arrive, spot the missing motorboat, and quickly descend the stairs to pursue them. As Vogel orders the soldiers into a boat, the scene shifts to a Nazi rally in Berlin, where a book-burning is underway. Indy and Henry approach the square, with Indy wearing an oversized Nazi uniform. High-ranking officers, including Adolf Hitler, oversee the rally amidst the rhythmic waving of swastika flags and banners by the frenzied crowd."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Henry presses against the wall, which cleverly rotates again, reminiscent of hidden passages often found in ancient castles. As he disappears into the next room, a dead Nazi radioman, possibly responsible for relaying critical communications during World War II, swivels into the room, and the other Nazis rush forward to him. Indy picks up a bust of Hitler, a common fixture in Nazi-occupied buildings due to the leader's cult of personality, and uses it to jam the rotating wall in place, sealing the Nazis inside the burning room. Vogel, a determined and high-ranking Nazi officer, strides purposefully down the hallway and barks an order, causing two more Nazis to fall into step with him. Indy grabs his whip, leather sack, and Henry's case from a table, hands the case to Henry, and they begin to run. Indy and Henry step into an empty room, and Henry looks horrified by what he's been forced to do as Indy searches frantically for an exit. Indy begins to run his hands over the walls with urgency, reminiscent of a treasure hunter's search for clues. Henry sits on a chair that tips back, hitting the wall behind it, a design often used in mystery novels, causing the floor at Indy's feet to suddenly drop away. Indy grabs a railing to keep from falling but loses his grip and plunges through the opening, forming a spiral staircase often used in labyrinthine architecture. He rolls down the stairs, and Henry follows Indy down the staircase. The stairway deposits Indy and Henry into an enormous watery cavern beneath the mountain on which the castle, potentially a strategic military installation, was built, where a full-scale Nazi boat dock has been constructed for quick escape or smuggling. Indy boards one of the motorboats and starts the motor. Henry tosses his case at Indy, who catches it and angrily throws it back to his father. Indy moves back to the dock and pushes the boat away, and Henry looks confused. Vogel and the Nazi soldiers enter the room, spot the spiral staircase leading below, and quickly descend the stairs. As Vogel and the Nazi soldiers rush to the dock, Vogel sees that a motorboat is missing and orders the Nazi soldiers into a boat. The motorbike skids to a stop, and Henry slaps him across the face, a move likely made in sheer exasperation. Arrows point in opposite directions to Venice and Berlin, highlighting the geographic context of their location, and the camera moves in on the portion of the sign reading Berlin. A Nazi rally is in process, emphasizing the regime's propaganda efforts, with a book-burning occurring as part of their campaign against \"un-German\" ideas. The mound of burning books is ten feet tall and growing as college students and Nazi brownshirts, reflecting societal indoctrination, continually toss more books onto the fire. Flags, banners, and standards displaying the swastika are waved rhythmically, echoing the mounting frenzy of the enormous crowd. Indy and Henry walk toward the square, with Indy wearing the uniform of a Nazi soldier and buttoning up the tunic, which happens to be several sizes too big, likely taken from an unfortunate soldier. High-ranking officers of the Third Reich flank Adolf Hitler, the dictator whose policies led to this dark chapter in history, as they oversee the rally."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Henry presses against the wall which rotates again. As he disappears into the next room a dead Nazi radioman swivels into the room and the other Nazis rush forward to him. Indy picks up a bust of Hitler and uses it to jam the rotating wall in place sealing the Nazis inside the burning room. Vogel strides purposefully down the hallway and barks an order causing two more Nazis to fall into step with him. Indy grabs his whip leather sack and Henry's case from a table hands the case to Henry and they begin to run. Indy and Henry step into an empty room and Henry looks horrified by what he is been forced to do as Indy searches frantically for an exit. Indy begins to run his hands over the walls with urgency. Henry sits on a chair that tips back hitting the wall behind it causing the floor at Indy's feet to suddenly drop away. Indy grabs a railing to keep from falling but loses his grip and plunges through the opening forming a spiral staircase. He rolls down the stairs and Henry follows Indy down the staircase. The stairway deposits Indy and Henry into an enormous watery cavern beneath the mountain on which the castle was built where a fullscale Nazi boat dock has been constructed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Indy boards one of the motorboats and starts the motor. Henry tosses his case at Indy who catches it and angrily throws it back to his father. Indy moves back to the dock and pushes the boat away and Henry looks confused. Vogel and the Nazi soldiers enter the room spot the spiral staircase leading below and quickly descend the stairs. As Vogel and the Nazi soldiers rush to the dock Vogel sees that a motorboat is missing and orders the Nazi soldiers into a boat. The motorbike skids to a stop and Henry slaps him across the face. Arrows point in opposite directions to Venice and Berlin and the camera moves in on the portion of the sign reading Berlin. A Nazi rally is in process with a bookburning occurring. The mound of burning books is ten feet tall and growing as college students and Nazi brownshirts continually toss more books onto the fire. Flags banners and standards displaying the swastika are waved rhythmically echoing the mounting frenzy of the enormous crowd. Indy and Henry walk toward the square with Indy wearing the uniform of a Nazi soldier and buttoning up the tunic which happens to be several sizes too big. Highranking officers of the Third Reich flank Adolf Hitler as they oversee the rally."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Henry presses against the wall which rotates again. As he disappears into the next room a dead Nazi radioman swivels into the room and the other Nazis rush forward to him. Indy picks up a bust of Hitler and uses it to jam the rotating wall in place sealing the Nazis inside the burning room. Vogel strides purposefully down the hallway and barks an order causing two more Nazis to fall into step with him. Indy grabs his whip leather sack and Henry's case from a table hands the case to Henry and they begin to run. Indy and Henry step into an empty room and Henry looks horrified by what he is been forced to do as Indy searches frantically for an exit. Indy begins to run his hands over the walls with urgency. Henry sits on a chair that tips back hitting the wall behind it causing the floor at Indy's feet to suddenly drop away. Indy grabs a railing to keep from falling but loses his grip and plunges through the opening forming a spiral staircase. He rolls down the stairs and Henry follows Indy down the staircase. The stairway deposits Indy and Henry into an enormous watery cavern beneath the mountain on which the castle was built where a fullscale Nazi boat dock has been constructed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Indy boards one of the motorboats and starts the motor. Henry tosses his case at Indy who catches it and angrily throws it back to his father. Indy moves back to the dock and pushes the boat away and Henry looks confused. Vogel and the Nazi soldiers enter the room spot the spiral staircase leading below and quickly descend the stairs. As Vogel and the Nazi soldiers rush to the dock Vogel sees that a motorboat is missing and orders the Nazi soldiers into a boat. The motorbike skids to a stop and Henry slaps him across the face. Arrows point in opposite directions to Venice and Berlin and the camera moves in on the portion of the sign reading Berlin. A Nazi rally is in process with a bookburning occurring. The mound of burning books is ten feet tall and growing as college students and Nazi brownshirts continually toss more books onto the fire. Flags banners and standards displaying the swastika are waved rhythmically echoing the mounting frenzy of the enormous crowd. Indy and Henry walk toward the square with Indy wearing the uniform of a Nazi soldier and buttoning up the tunic which happens to be several sizes too big. Highranking officers of the Third Reich flank Adolf Hitler as they oversee the rally."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Henry presses against the wall which rotates again. As he disappears into the next room a dead Nazi radioman swivels into the room and the other Nazis rush forward to him. Indy picks up a bust of Hitler and uses it to jam the rotating wall in place sealing the Nazis inside the burning room. Vogel strides purposefully down the hallway and barks an order causing two more Nazis to fall into step with him. Indy grabs his whip leather sack and Henry's case from a table hands the case to Henry and they begin to run. Indy and Henry step into an empty room and Henry looks horrified by what he is been forced to do as Indy searches frantically for an exit. Arrows point in opposite directions to Venice and Berlin and the camera moves in on the portion of the sign reading Berlin. A Nazi rally is in process with a bookburning occurring. The mound of burning books is ten feet tall and growing as college students and Nazi brownshirts continually toss more books onto the fire. Flags banners and standards displaying the swastika are waved rhythmically echoing the mounting frenzy of the enormous crowd. Indy and Henry walk toward the square with Indy wearing the uniform of a Nazi soldier and buttoning up the tunic which happens to be several sizes too big. Highranking officers of the Third Reich flank Adolf Hitler as they oversee the rally."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Henry presses against the wall which rotates again. As he disappears into the next room a dead Nazi radioman swivels into the room and the other Nazis rush forward to him. Flags banners and standards displaying the swastika are waved rhythmically echoing the mounting frenzy of the enormous crowd. Indy and Henry walk toward the square with Indy wearing the uniform of a Nazi soldier and buttoning up the tunic which happens to be several sizes too big. Highranking officers of the Third Reich flank Adolf Hitler as they oversee the rally."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Oliver leans against the tree, which tilts again. As he vanishes into the following space, a lifeless Viking pianist swivels into the meadow, and the other Vikings charge forward to him. Sam picks up a statue of Napoleon and uses it to wedge the spinning tree in position, trapping the Vikings inside the fiery meadow. Marcus strides confidently down the corridor and shouts a command, causing two more Vikings to march alongside him. Sam grabs his pencil, silk pouch, and Oliver's lantern from a bench, hands the lantern to Oliver, and they start to sprint. Sam and Oliver step into a vacant clearing, and Oliver looks appalled by what he's been compelled to do as Sam searches wildly for an escape. Sam starts to wave his arms over the trees with urgency. Oliver sits on a bucket that tips back, striking the fence behind it, causing the ground at Sam's boots to suddenly collapse. Sam clutches a branch to keep from tumbling but loses his hold and plummets through the gap, forming a winding slide. He tumbles down the slide, and Oliver follows Sam down the winding path. The slide leads Sam and Oliver into an enormous ice cavern beneath the forest on which the fort stood, where a full-scale Viking ship dock has been erected. Sam boards one of the sailboats and starts the engine. Oliver hurls his lantern at Sam, who catches it and furiously throws it back to his companion. Sam moves back to the dock and nudges the boat away, and Oliver looks puzzled. Marcus and the Viking warriors enter the clearing, spot the winding slide leading below, and quickly glide down the slide. As Marcus and the Viking warriors dash to the dock, Marcus sees that a sailboat is missing and orders the Viking warriors onto a galleon. The skateboard slides to a halt, and Oliver taps him on the back. Signs point in opposite directions to Paris and Rome, and the camera focuses on the section of the sign reading Rome. A pirate gathering is underway, with a treasure-burning taking place. The pile of burning treasures is ten feet tall and growing as villagers and pirate crewmen relentlessly toss more treasures onto the blaze. Flags, banners, and emblems displaying the skull and crossbones are waved in rhythm, echoing the rising excitement of the colossal crowd. Sam and Oliver stroll toward the circle, with Sam wearing the outfit of a pirate crewman and fastening the jacket, which happens to be several sizes too large. High-ranking captains of the pirate fleet flank Blackbeard as they supervise the gathering."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Henry presses against a rotating wall, vanishing into another room as other Nazis rush to a dead radioman. Indy uses a bust of Hitler to jam the wall, trapping Nazis in the burning room. Vogel orders more Nazis to follow him, while Indy grabs his gear and Henry's case, and they start to flee. In an empty room, Henry triggers a hidden mechanism, creating a spiral staircase. Indy and Henry descend into a vast watery cavern with a Nazi boat dock. Indy boards a motorboat, but Henry throws his case, prompting Indy to angrily return it. Nazis, led by Vogel, follow the staircase to the dock. As Vogel notices a missing boat, Indy and Henry's escape is underway. Meanwhile, in Berlin, a massive Nazi rally is in progress with a book-burning event. Indy and Henry, with Indy in an oversized Nazi uniform, approach the rally where high-ranking officers, including Hitler, are present."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Highranking officers of the Third Reich flank Adolf Hitler as they oversee the rally Indy and Henry walk toward the square with Indy wearing the uniform of a Nazi soldier and buttoning up the tunic which happens to be several sizes too big  Flags banners and standards displaying the swastika are waved rhythmically echoing the mounting frenzy of the enormous crowd  The mound of burning books is ten feet tall and growing as college students and Nazi brownshirts continually toss more books onto the fire  A Nazi rally is in process with a bookburning occurring  Arrows point in opposite directions to Venice and Berlin and the camera moves in on the portion of the sign reading Berlin  The motorbike skids to a stop and Henry slaps him across the face  As Vogel and the Nazi soldiers rush to the dock Vogel sees that a motorboat is missing and orders the Nazi soldiers into a boat  Vogel and the Nazi soldiers enter the room spot the spiral staircase leading below and quickly descend the stairs  Indy moves back to the dock and pushes the boat away and Henry looks confused  Henry tosses his case at Indy who catches it and angrily throws it back to his father  Indy boards one of the motorboats and starts the motor  The stairway deposits Indy and Henry into an enormous watery cavern beneath the mountain on which the castle was built where a fullscale Nazi boat dock has been constructed  He rolls down the stairs and Henry follows Indy down the staircase  Indy grabs a railing to keep from falling but loses his grip and plunges through the opening forming a spiral staircase  Henry sits on a chair that tips back hitting the wall behind it causing the floor at Indy's feet to suddenly drop away  Indy begins to run his hands over the walls with urgency  Indy and Henry step into an empty room and Henry looks horrified by what he's been forced to do as Indy searches frantically for an exit  Indy grabs his whip leather sack and Henry's case from a table hands the case to Henry and they begin to run  Vogel strides purposefully down the hallway and barks an order causing two more Nazis to fall into step with him  Indy picks up a bust of Hitler and uses it to jam the rotating wall in place sealing the Nazis inside the burning room  As he disappears into the next room a dead Nazi radioman swivels into the room and the other Nazis rush forward to him  Henry presses against the wall which rotates again "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "As he disappears into the next room a dead Nazi radioman swivels into the room and the other Nazis rush forward to him Henry presses against the wall which rotates again Vogel strides purposefully down the hallway and barks an order causing two more Nazis to fall into step with him Indy picks up a bust of Hitler and uses it to jam the rotating wall in place sealing the Nazis inside the burning room Indy and Henry step into an empty room and Henry looks horrified by what he is been forced to do as Indy searches frantically for an exit Indy grabs his whip leather sack and Henry's case from a table hands the case to Henry and they begin to run Henry sits on a chair that tips back hitting the wall behind it causing the floor at Indy's feet to suddenly drop away Indy begins to run his hands over the walls with urgency He rolls down the stairs and Henry follows Indy down the staircase Indy grabs a railing to keep from falling but loses his grip and plunges through the opening forming a spiral staircase Indy boards one of the motorboats and starts the motor The stairway deposits Indy and Henry into an enormous watery cavern beneath the mountain on which the castle was built where a fullscale Nazi boat dock has been constructed Indy moves back to the dock and pushes the boat away and Henry looks confused Henry tosses his case at Indy who catches it and angrily throws it back to his father As Vogel and the Nazi soldiers rush to the dock Vogel sees that a motorboat is missing and orders the Nazi soldiers into a boat Vogel and the Nazi soldiers enter the room spot the spiral staircase leading below and quickly descend the stairs Arrows point in opposite directions to Venice and Berlin and the camera moves in on the portion of the sign reading Berlin The motorbike skids to a stop and Henry slaps him across the face The mound of burning books is ten feet tall and growing as college students and Nazi brownshirts continually toss more books onto the fire A Nazi rally is in process with a bookburning occurring Indy and Henry walk toward the square with Indy wearing the uniform of a Nazi soldier and buttoning up the tunic which happens to be several sizes too big Flags banners and standards displaying the swastika are waved rhythmically echoing the mounting frenzy of the enormous crowd Highranking officers of the Third Reich flank Adolf Hitler as they oversee the rally"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Henry tosses his case at Indy who catches it and angrily throws it back to his father  Indy moves back to the dock and pushes the boat away and Henry looks confused  Vogel and the Nazi soldiers enter the room spot the spiral staircase leading below and quickly descend the stairs  As Vogel and the Nazi soldiers rush to the dock Vogel sees that a motorboat is missing and orders the Nazi soldiers into a boat  The motorbike skids to a stop and Henry slaps him across the face  Arrows point in opposite directions to Venice and Berlin and the camera moves in on the portion of the sign reading Berlin  A Nazi rally is in process with a bookburning occurring  The mound of burning books is ten feet tall and growing as college students and Nazi brownshirts continually toss more books onto the fire  Flags banners and standards displaying the swastika are waved rhythmically echoing the mounting frenzy of the enormous crowd  Indy and Henry walk toward the square with Indy wearing the uniform of a Nazi soldier and buttoning up the tunic which happens to be several sizes too big  Highranking officers of the Third Reich flank Adolf Hitler as they oversee the rally Henry presses against the wall which rotates again  As he disappears into the next room a dead Nazi radioman swivels into the room and the other Nazis rush forward to him  Indy picks up a bust of Hitler and uses it to jam the rotating wall in place sealing the Nazis inside the burning room  Vogel strides purposefully down the hallway and barks an order causing two more Nazis to fall into step with him  Indy grabs his whip leather sack and Henry's case from a table hands the case to Henry and they begin to run  Indy and Henry step into an empty room and Henry looks horrified by what he's been forced to do as Indy searches frantically for an exit  Indy begins to run his hands over the walls with urgency  Henry sits on a chair that tips back hitting the wall behind it causing the floor at Indy's feet to suddenly drop away  Indy grabs a railing to keep from falling but loses his grip and plunges through the opening forming a spiral staircase  He rolls down the stairs and Henry follows Indy down the staircase  The stairway deposits Indy and Henry into an enormous watery cavern beneath the mountain on which the castle was built where a fullscale Nazi boat dock has been constructed  Indy boards one of the motorboats and starts the motor "
        }
      ]
    }
  ]
}