{
  "ground_truth": "Elsa and Donovan take cover beside the parked car. Indy and Henry, followed by Sallah, take cover behind a rock to watch Kazim's Men and the Nazi Troops exchanging fire below them. The Brethren are firing at the Donovan party and are being fired on by the Donovan party. Two Nazi Soldiers throw hand grenades into the cliffs. They explode, killing one of Kazim's Brethren. The battle continues with a fierce exchange of gunshots, grenades, and machine gun fire, resulting in losses on both sides. Crouched behind a rock, they watch as men on both sides of the battle run amongst camels and horses. They look down at Kazim, who lies mortally wounded on the ground at their feet. Elsa looks saddened. Kazim dies. Indy leaps atop a Turkish Soldier on horseback, pulling the man and the horse to the ground. A second Turk comes to assist his comrade; Indy mounts the horse, knocking both Turks to the ground. Brody has been left alone in the tank. Henry climbs down into the tank and taps Brody on the shoulder, startling him. Brody then tugs his ears, flaps his arms, and touches his head. They exchange a handshake. The Nazi Soldiers point their guns at Henry and Brody. Vogel removes a glove and slaps Henry with it. He slaps Henry again. Another slap. Vogel reaches out to slap Henry yet again, but Henry grabs his arm, stopping him. Donovan appears at the turret cover. Indy and Sallah charge forward, leading their horses and camels. Then Vogel commands the Tank Driver to give chase. Vogel shouts to the Tank Driver. Henry and Brody are still held at gunpoint by the Nazi Soldier. The Nazi Soldier swings his fist, knocking Henry off his seat. Smoke pours from the top of the tank as the turret pops open. Vogel emerges and aims his gun at Indy. Indy and Vogel exchange shots as Indy chases the tank on his horse. Indy pulls the trigger again—his gun is empty! Indy immediately takes the high trail. Now Indy is above the tank, twelve feet on a paralleling trail. He moves out of the saddle and leaps from the speeding horse onto the trundling tank. Hate-staring at Indy. Hate-staring back at Vogel. Suddenly, from nowhere, a German soldier flies into frame, tackling Indy. One of the two troop carriers is paralleling the tank, and like pirates boarding a galleon, Nazi Soldiers leap over the treads and swarm all over Indy. Indy presses the Luger against his assailant and forces the Nazi to squeeze off a shot into himself. The bullet not only passes through the Nazi, but passes through two other Nazis standing directly behind him on the crowded tank top, and three bodies fall away, leaving Indy to stare at the gun in disbelief.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Elsa and Donovan hide next to the stationary automobile. Indy and Henry, trailed by Sallah, hide behind a stone to observe Kazim's Men and the Nazi Troops trading gunfire beneath them. The Brethren are shooting at the Donovan group and are being shot at by the Donovan group. Two Nazi Soldiers toss explosives into the cliffs. They detonate, killing one of Kazim's Brethren. The skirmish persists with an intense swap of bullets, explosives, and automatic weapon fire, culminating in casualties on both sides. Huddled behind a stone, they observe as men on both sides of the fight run amongst camels and horses. They glance down at Kazim, who lies fatally injured on the terrain at their feet. Elsa appears mournful. Kazim perishes. Indy springs onto a Turkish Soldier on horseback, dragging the man and the steed to the terrain. A second Turk arrives to aid his ally; Indy mounts the steed, knocking both Turks to the terrain. Brody has been abandoned alone in the tank. Henry descends into the tank and taps Brody on the shoulder, startling him. Brody then tugs his ears, flaps his arms, and touches his head. They swap a handshake. The Nazi Soldiers point their firearms at Henry and Brody. Vogel removes a glove and smacks Henry with it. He smacks Henry again. Another smack. Vogel reaches out to smack Henry yet again, but Henry grabs his limb, halting him. Donovan appears at the turret cover. Indy and Sallah charge forward, leading their steeds and camels. Then Vogel commands the Tank Operator to give pursuit. Vogel shouts to the Tank Operator. Henry and Brody are still held at gunpoint by the Nazi Soldier. The Nazi Soldier swings his fist, knocking Henry off his seat. Smoke spills from the top of the tank as the turret pops open. Vogel emerges and aims his firearm at Indy. Indy and Vogel trade shots as Indy pursues the tank on his steed. Indy pulls the trigger again—his firearm is empty! Indy immediately takes the high trail. Now Indy is above the tank, twelve feet on a paralleling path. He moves out of the saddle and leaps from the speeding steed onto the trundling tank. Hate-glaring at Indy. Hate-glaring back at Vogel. Suddenly, from nowhere, a German soldier flies into frame, tackling Indy. One of the two troop carriers is paralleling the tank, and like pirates boarding a galleon, Nazi Soldiers leap over the treads and swarm all over Indy. Indy presses the Luger against his attacker and forces the Nazi to squeeze off a shot into himself. The bullet not only passes through the Nazi, but passes through two other Nazis standing directly behind him on the crowded tank top, and three bodies fall away, leaving Indy to stare at the firearm in disbelief."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Elsa and Donovan are covered beside the parked car. Indy and Henry, followed by Sallah, are covered behind a rock to observe Kazim's Men and the Nazi Troops exchanging fire below them. The Donovan party fires at the Brethren and is being fired upon by them. Two Nazi Soldiers are throwing hand grenades into the cliffs. Explosions occur, killing one of Kazim's Brethren. A fierce exchange of gunshots, grenades, and machine gun fire continues the battle, resulting in losses on both sides. Crouching behind a rock, men on both sides of the battle are watched by them running amongst camels and horses. Kazim is looked down upon by them, lying mortally wounded on the ground at their feet. Elsa is saddened. Kazim is dead. Indy leaps atop a Turkish Soldier on horseback, pulling the man and the horse to the ground. A second Turk assists his comrade; the horse is mounted by Indy, and both Turks are knocked to the ground. Brody leaves the tank alone. Henry climbs into the tank and taps Brody on the shoulder, startling him. Brody then tugs his ears, flaps his arms, and touches his head. A handshake is exchanged by them. Guns are pointed at Henry and Brody by the Nazi Soldiers. A glove is removed by Vogel, and Henry is slapped with it. Henry is slapped again. Another slap. Vogel reaches out to slap Henry yet again, but his arm is grabbed by Henry, stopping him. The turret cover is where Donovan appears. Indy and Sallah charge forward, leading their horses and camels. Then the Tank Driver is commanded by Vogel to give chase. The Tank Driver is shouted at by Vogel. Henry and Brody are still held at gunpoint by the Nazi Soldier. Henry is knocked off his seat by the Nazi Soldier's swinging fist. Smoke pours from the top of the tank as the turret is popped open. Vogel emerges and aims his gun at Indy. Indy and Vogel exchange shots as the tank on his horse is chased by Indy. The trigger is pulled again by Indy—his gun is empty! The high trail is immediately taken by Indy. Now the tank is being paralleled by Indy, twelve feet on a paralleling trail. He moves out of the saddle and leaps from the speeding horse onto the trundling tank. Hate-staring at Indy. Hate-staring back at Vogel. Suddenly, from nowhere, Indy is tackled as a German soldier flies into frame. One of the two troop carriers is paralleling the tank, and like pirates boarding a galleon, Indy is leaped over by Nazi Soldiers swarming all over him. The Luger is pressed by Indy against his assailant, and the Nazi is forced to squeeze off a shot into himself. Not only does the bullet pass through the Nazi, but it also passes through two other Nazis standing directly behind him on the crowded tank top, and three bodies fall away, leaving Indy to stare at the gun in disbelief."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Elsa and Donovan hide beside a parked car as Indy, Henry, and Sallah take cover behind a rock to observe Kazim's Men and Nazi Troops exchanging fire. The Brethren and Donovan's party fire at each other, while two Nazi Soldiers hurl grenades into the cliffs, killing one of Kazim's Brethren. Gunfire continues fiercely, causing losses on both sides. Crouched, they watch men running among camels and horses and see Kazim mortally wounded. Elsa appears saddened as Kazim dies. Indy jumps on a Turkish Soldier on horseback, pulling him and the horse down. A second Turk tries to help; Indy mounts the horse, knocking both Turks down. Brody is alone in the tank when Henry taps his shoulder, startling him. They exchange a handshake. Nazi Soldiers aim guns at Henry and Brody. Vogel slaps Henry, who grabs Vogel's arm to stop him. Donovan appears at the turret cover. Indy and Sallah lead horses and camels forward as Vogel orders the Tank Driver to pursue them. Henry and Brody remain at gunpoint. A Nazi Soldier punches Henry off his seat. Smoke emerges from the tank as Vogel appears, aiming at Indy. Indy and Vogel exchange gunfire, but Indy's weapon soon empties. Indy takes a higher trail, twelve feet above the tank, leaping from his horse onto the moving tank. Suddenly, a German soldier tackles Indy. Troop carriers parallel the tank, and Nazi Soldiers swarm Indy. He forces a Nazi to fire his Luger, the bullet passing through two others, leaving Indy staring at the gun in disbelief."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Elsa and Donovan hide by a car while Indy, Henry, and Sallah take cover behind a rock, observing Kazim's Men and Nazi Troops exchanging fire. The Brethren and Donovan's party shoot at each other. Two Nazi Soldiers throw grenades, killing one of Kazim's Brethren. The battle of gunshots, grenades, and machine guns rages, causing losses on both sides. Crouched, they watch men running among camels and horses. They see mortally wounded Kazim; Elsa is saddened as he dies. Indy jumps onto a Turkish Soldier's horse, bringing them down. Another Turk assists, and Indy mounts the horse, dismounting both Turks. Brody is alone in the tank; Henry joins him, startling Brody, who then gestures and shakes hands with him. Nazi Soldiers point guns at them; Vogel slaps Henry but is stopped by Henry grabbing his arm. Donovan appears at the turret. Indy and Sallah lead horses and camels forward as Vogel commands the Tank Driver to pursue. A Nazi Soldier punches Henry, knocking him from his seat. Smoke rises as Vogel aims at Indy. They exchange shots until Indy's gun is empty; he takes a higher trail, leaping from his horse onto the tank. Indy and Vogel exchange hate-filled stares. A German soldier tackles Indy, and Nazi Soldiers swarm him. Indy forces his assailant to fire a shot, piercing through three Nazis, leaving Indy shocked at the gun."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Elsa and Donovan quickly take cover beside the sturdy, parked car, seeking shelter from the chaos around them. Meanwhile, Indy and Henry, followed closely by Sallah, find refuge behind a large rock, positioning themselves to observe as Kazim's Men engage in a fierce firefight with the Nazi Troops below their vantage point. The Brethren are actively exchanging fire with the Donovan party, with fierce intensity on both sides. In a sudden and violent turn of events, two Nazi Soldiers launch hand grenades into the cliffs, where they explode with devastating force, tragically killing one of Kazim's valiant Brethren. The battle rages on with an unrelenting barrage of gunshots, the boom of grenades, and the harsh rattle of machine gun fire, leading to grievous losses for both factions. \n\nCrouched low behind their rocky cover, they watch with intense focus as men from both sides of the conflict rush amidst the chaos, navigating between camels and horses. Their gaze shifts downward to Kazim, who lies gravely wounded, breathing his last breaths on the dust-covered ground at their feet. Elsa's face is a portrait of sadness as she observes this scene. Kazim, unable to fight any longer, succumbs to his injuries. Indy, seizing an opportunity amidst the turmoil, leaps onto a Turkish Soldier seated on horseback, forcefully pulling both the man and the horse crashing to the ground. A second Turk rushes over, attempting to aid his comrade; however, Indy swiftly mounts the horse, leaving both Turks sprawled on the earth.\n\nIn another part of the battlefield, Brody is left isolated inside the tank, with no immediate allies at his side. Henry, exerting determination, climbs down into the interior of the tank and taps Brody on his shoulder, catching him by surprise. In response, Brody performs a series of gestures, tugging at his ears, flapping his arms, and touching his head, before they finally exchange a firm handshake. Meanwhile, the threat looms as Nazi Soldiers aim their guns menacingly at Henry and Brody. Vogel, with a sense of arrogance, removes a glove and slaps Henry forcefully with it, repeating the action with another sharp slap. Just as Vogel is about to land another blow, Henry intercepts it, firmly grasping Vogel's arm and halting his assault. At this tense moment, Donovan makes an appearance at the turret cover, watching the proceedings with interest. \n\nSimultaneously, Indy and Sallah drive forward with urgency, spurring their horses and camels onward. Vogel barks orders to the Tank Driver, commanding him to pursue with vigor. The Tank Driver responds to Vogel's urgent shouting, accelerating the chase. Meanwhile, Henry and Brody remain held at gunpoint by the vigilant Nazi Soldier. In a swift motion, the Nazi Soldier swings his fist violently, causing Henry to tumble from his seat. Smoke begins to pour from the tank's top, creating a haze as the turret pops open. Vogel emerges, gun in hand, leveling it at Indy with deadly intent. A tense exchange of gunfire ensues between Indy and Vogel as Indy gallops on his horse in pursuit of the tank. As Indy pulls his trigger yet again, he discovers his gun is frustratingly empty! Without hesitation, Indy takes the high trail, moving to a position twelve feet above the tank on a parallel path. Nimbly, he transitions out of the saddle, making a bold leap from his swift horse onto the lumbering tank below. \n\nLocked in intense eye contact, Indy and Vogel exchange hate-filled stares. Suddenly, unexpectedly, a German soldier bursts into the scene, tackling Indy with aggressive force. One of the troop carriers, keeping pace with the tank, allows Nazi Soldiers to leap agilely over the treads, swarming around Indy in a manner akin to pirates boarding a galleon. Amidst the fray, Indy forces the Luger against his opponent, compelling the Nazi to inadvertently discharge a shot into himself. The bullet, with unanticipated lethality, not only pierces the assailant but also penetrates through two additional Nazis who are positioned directly behind him on the overcrowded tank top. With three bodies collapsing away, Indy stares in disbelief at the gun in his grasp, caught in the startling aftermath of his actions."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Elsa and Donovan, acting with urgency, quickly find shelter beside the sturdy and dependable parked car, seeking refuge from the chaotic turmoil that surrounds them. Meanwhile, Indy and Henry, followed closely in tow by their loyal companion Sallah, manage to secure a spot behind a large, protective rock. They carefully position themselves to observe the chaotic scene unfolding below, as Kazim's Men fiercely engage in a brutally intense firefight with the relentless Nazi Troops from their elevated vantage point. The conflict grows more intense as the Brethren energetically exchange fire with the Donovan party, with fierce determination evident on both sides. In a shocking and violent twist of events, two Nazi Soldiers hurl hand grenades into the cliffs, where they detonate with devastating impact, tragically claiming the life of one of Kazim's bravely fighting Brethren. The battle continues to rage on, characterized by an unrelenting barrage of gunfire, the thunderous boom of grenades, and the piercing rattle of machine gun fire, leading to severe and grievous losses for both factions.\n\nCrouched low and pressed close behind their rocky cover, they watch with unwavering focus as men from both sides of the conflict rush headlong through the chaos, maneuvering amidst the camels and horses. Their gaze drifts downward to Kazim, who lies gravely wounded, drawing his final breaths on the dust-covered ground at their feet. Elsa's face becomes a moving portrait of sadness as she takes in this scene of suffering. Kazim, no longer able to continue fighting, succumbs to his grievous injuries. Indy, perceiving a rare opportunity amidst the turmoil, leaps onto a Turkish Soldier who is seated on horseback, forcefully pulling both the Turk and the horse crashing to the ground. A second Turk rushes over, attempting to assist his comrade; however, Indy swiftly mounts the horse, leaving both Turks sprawling helplessly on the earth.\n\nIn a separate part of the battlefield, Brody finds himself isolated and alone inside the tank, with no immediate allies at his side to offer assistance. Henry, driven by determination, climbs down into the interior of the tank and taps Brody on the shoulder, catching him off guard and surprising him. In response, Brody performs a series of exaggerated gestures, tugging at his ears, flapping his arms, and touching his head, before they finally share a firm handshake, solidifying their bond. Meanwhile, the looming threat becomes palpable as Nazi Soldiers menacingly aim their weapons at Henry and Brody. Vogel, exuding arrogance, removes a glove and delivers a forceful slap to Henry, following it with another sharp slap. Just as Vogel prepares to land yet another blow, Henry intercepts it, firmly grasping Vogel's arm to halt his aggressive assault. At this tense moment, Donovan makes a timely appearance at the turret cover, observing the proceedings with keen interest.\n\nSimultaneously, Indy and Sallah press forward with a sense of urgency, driving their horses and camels onward with determination. Vogel barks orders to the Tank Driver, commanding him to pursue them with vigor and intensity. The Tank Driver responds to Vogel's urgent shouting, accelerating the vehicle in a determined chase. Meanwhile, Henry and Brody remain held at gunpoint by the vigilant Nazi Soldier. In a swift and brutal motion, the Nazi Soldier swings his fist with violent force, causing Henry to tumble from his seat. Smoke begins to billow from the tank's top, creating a dense haze as the turret pops open. Vogel emerges with gun in hand, leveling it at Indy with clear deadly intent. A tense and rigorous exchange of gunfire ensues between Indy and Vogel as Indy gallops on his horse, trying to keep pace with the moving tank. As Indy pulls his trigger yet again, he frustratingly discovers that his gun is empty! Without hesitation, Indy takes the high trail, moving quickly to a position approximately twelve feet above the tank on a parallel path. With agility and precision, he transitions out of the saddle, making a daring leap from his swift horse onto the lumbering tank below.\n\nLocked in intense and hostile eye contact, Indy and Vogel exchange hate-filled, venomous stares. Suddenly, and quite unexpectedly, a German soldier bursts onto the scene with aggressive force, tackling Indy. One of the troop carriers, maintaining pace with the tank, allows Nazi Soldiers to agilely leap over the treads, swarming around Indy much like pirates boarding a galleon. Amidst the chaos and fray, Indy forces the Luger against his adversary, compelling the Nazi to inadvertently discharge a shot into himself. The bullet, with lethal unexpectedness, not only pierces the assailant but also penetrates through two additional Nazis positioned directly behind him on the overcrowded tank top. With three bodies collapsing away, Indy stares in disbelief at the gun in his grasp, caught in the startling and shocking aftermath of his own actions."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Elsa and Donovan swiftly move to take cover beside the parked car, they crouch down, positioning themselves to remain hidden from sight while peering cautiously over the vehicle for any signs of danger. Meanwhile, Indy and Henry, with Sallah close on their heels, find refuge behind a rock, carefully selecting a spot that offers both concealment and a clear vantage point to observe the chaotic scene unfolding below. They watch intently as Kazim's Men and the Nazi Troops exchange a relentless barrage of gunfire, each group determined to overpower the other. The Brethren, resolute in their mission, fire persistently at the Donovan party, while Donovan's group retaliates in equal measure. Amidst this chaotic exchange, two Nazi Soldiers emerge, their faces set with grim determination, as they pull pins from hand grenades and hurl them into the cliffs with calculated precision. The ensuing explosions send shockwaves through the area, tragically claiming the life of one of Kazim's Brethren, a casualty of the ongoing battle. As the confrontation intensifies, the air becomes thick with the sounds of gunshots, grenades, and the rapid fire of machine guns, leading to inevitable losses on both sides of the conflict. Indy, Sallah, and Henry remain crouched behind the rock, their eyes darting back and forth as they witness men from both factions weaving amidst camels and horses, attempting to gain a strategic advantage. Directly below them lies Kazim, gravely wounded and teetering on the edge of life, his breaths shallow and labored. Elsa, unable to conceal her emotions, wears an expression of profound sadness as she looks upon the scene, aware of Kazim's impending death. With a final exhalation, Kazim succumbs to his injuries. Determined to gain control of the situation, Indy spots a Turkish Soldier mounted on horseback and promptly leaps onto the soldier, his momentum pulling both man and horse to the ground in a swift, decisive maneuver. As a second Turkish soldier rushes to assist his fallen comrade, Indy seizes the opportunity, quickly mounting the horse and knocking both Turks to the ground, securing his position on the steed. Meanwhile, Brody is alone in the tank, momentarily isolated from the chaos outside. Henry decides to join him, descending carefully into the tank's interior and reaching out to gently tap Brody on the shoulder, inadvertently startling him. In a moment of comic relief, Brody responds to this surprise by tugging his ears, flapping his arms, and touching his head in a whimsical display before they exchange a friendly handshake. However, the momentary camaraderie is short-lived as Nazi Soldiers advance, pointing their guns menacingly at Henry and Brody. Vogel, with an air of authority, steps forward, methodically removing a glove before delivering a swift slap to Henry's face—a gesture repeated twice more as an act of intimidation. On the third attempt, Henry's hand shoots up, intercepting Vogel's arm and halting the impending slap. At this pivotal moment, Donovan appears at the turret cover, surveying the scene with calculated intent. Indy and Sallah seize the opportunity, spurring their horses and camels forward with urgency and determination, charging across the battlefield. Recognizing the threat, Vogel commands the Tank Driver to give chase, his voice sharp and commanding as he relays his orders. Meanwhile, Henry and Brody remain at gunpoint, the situation growing increasingly precarious. Without warning, the Nazi Soldier swings a powerful fist, striking Henry and knocking him off his seat, leaving him momentarily disoriented. As the tank's turret pops open, smoke billows from within, and Vogel emerges, gun in hand, taking aim at the approaching Indy. As Vogel and Indy engage in a tense exchange of shots, Indy remains undeterred, pursuing the tank on horseback with unwavering resolve. However, as Indy pulls the trigger once more, he is met with the disheartening click of an empty chamber. Reacting swiftly, Indy veers onto the high trail, his horse carrying him above the tank on a parallel path approximately twelve feet above. With agility and precision, he shifts out of the saddle and, timing his leap expertly, drops onto the lumbering tank below. As Vogel and Indy lock eyes in a mutual glare of animosity, a German soldier suddenly bursts into the frame, tackling Indy with unexpected force. Amidst the ensuing struggle, one of the troop carriers draws alongside the tank, allowing Nazi Soldiers to leap over the treads, swarming Indy in a coordinated assault reminiscent of pirates boarding a galleon. In a moment of desperation and quick thinking, Indy presses the Luger against his assailant, forcing the reluctant Nazi to fire a shot into himself. The bullet pierces through the soldier's body and continues its path through two additional Nazis standing closely behind on the crowded tank top, resulting in three bodies tumbling away and leaving Indy in an incredulous state, staring at the gun in disbelief."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Elsa and Donovan take cover beside a parked car while Indy, Henry, and Sallah hide behind a rock to observe Kazim's Men and Nazi Troops exchanging heavy fire below. The exchange involves gunshots, grenades, and machine gun fire, leading to casualties, including a fatality among Kazim's men. As the battle rages on, Indy notices Kazim mortally wounded and jumps onto a Turkish soldier's horse, unseating two soldiers to take control. Meanwhile, Henry startles Brody in the tank before exchanging pleasantries, only to be held at gunpoint by Nazi soldiers. Vogel slaps Henry repeatedly until Henry intervenes. As Indy and Sallah advance with horses and camels, Vogel commands the Tank Driver to pursue them. Despite the Nazis holding Henry and Brody at gunpoint and knocking Henry down, Indy engages in a chase with Vogel, maneuvering his horse onto a track parallel to the tank. Indy leaps onto the tank, where he exchanges shots with Vogel. When his gun runs empty, Indy tackles a German soldier who suddenly appears, using the soldier's weapon to shoot through him, inadvertently hitting two more Nazis, leaving Indy stunned at the outcome."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Elsa and Donovan take cover beside the parked car, a dusty relic from the era of early automobiles, providing scant protection. Indy and Henry, followed by Sallah, take cover behind a rock to watch Kazim's Men, a group of local resistance fighters fiercely loyal to their cause, and the Nazi Troops, notorious for their brutal efficiency, exchanging fire below them. The Brethren are firing at the Donovan party and are being fired on by the Donovan party, a chaotic scene reflecting the complex alliances in the region. Two Nazi Soldiers, clad in their distinctive grey uniforms, throw hand grenades into the cliffs. They explode with a deafening roar, killing one of Kazim's Brethren, who had been fighting to protect his homeland from foreign invaders. The battle continues with a fierce exchange of gunshots, grenades, and machine gun fire, resulting in losses on both sides, a grim testament to the brutality of war. Crouched behind a rock, they watch as men on both sides of the battle run amongst camels and horses, the traditional steeds of desert warfare. They look down at Kazim, who lies mortally wounded on the ground at their feet, his life ebbing away despite his valiant efforts. Elsa looks saddened, aware of the inevitable loss of life in such conflicts. Kazim dies. Indy, demonstrating the quick thinking and agility that have made him famous, leaps atop a Turkish Soldier on horseback, pulling the man and the horse to the ground. A second Turk, loyal to his comrade, comes to assist; Indy mounts the horse, knocking both Turks to the ground in a swift motion. Brody, usually more at home in libraries than battlefields, has been left alone in the tank, an ominous fortress of steel and firepower. Henry climbs down into the tank and taps Brody on the shoulder, startling him with the urgency of the situation. Brody then tugs his ears, flaps his arms, and touches his head, a silent code once shared between them in lighter times. They exchange a handshake of resolve and camaraderie. The Nazi Soldiers point their guns at Henry and Brody, a chilling reminder of the stakes. Vogel, a ruthless officer known for his sadistic tendencies, removes a glove and slaps Henry with it. He slaps Henry again. Another slap. Vogel reaches out to slap Henry yet again, but Henry grabs his arm, stopping him, displaying a quiet defiance. Donovan appears at the turret cover. Indy and Sallah charge forward, leading their horses and camels, the noble beasts that have carried them across many adventures. Then Vogel commands the Tank Driver, a man conscripted into the war machine, to give chase. Vogel shouts to the Tank Driver. Henry and Brody are still held at gunpoint by the Nazi Soldier. The Nazi Soldier swings his fist, knocking Henry off his seat, a testament to the tense, unyielding nature of their captivity. Smoke pours from the top of the tank as the turret pops open, signaling imminent danger. Vogel emerges and aims his gun at Indy. Indy and Vogel exchange shots as Indy chases the tank on his horse, the familiar sound of gunfire punctuating their rivalry. Indy pulls the trigger again—his gun is empty! Indy immediately takes the high trail, using the terrain to his advantage. Now Indy is above the tank, twelve feet on a paralleling trail, calculating his next daring move. He moves out of the saddle and leaps from the speeding horse onto the trundling tank, a feat of daring courage. Hate-staring at Indy, Vogel reflects the deep animosity between them. Hate-staring back at Vogel, Indy embodies relentless determination. Suddenly, from nowhere, a German soldier flies into frame, tackling Indy with the force of a linebacker. One of the two troop carriers is paralleling the tank, and like pirates boarding a galleon, Nazi Soldiers leap over the treads and swarm all over Indy, each driven by orders and ideology. Indy presses the Luger, a German pistol known for its reliability, against his assailant and forces the Nazi to squeeze off a shot into himself. The bullet not only passes through the Nazi, but passes through two other Nazis standing directly behind him on the crowded tank top, and three bodies fall away, leaving Indy to stare at the gun in disbelief, a stark reminder of the lethal power he holds."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Elsa and Donovan take cover beside the parked car. Indy and Henry followed by Sallah take cover behind a rock to watch Kazim's Men and the Nazi Troops exchanging fire below them. The Brethren are firing at the Donovan party and are being fired on by the Donovan party. Two Nazi Soldiers throw hand grenades into the cliffs. They explode killing one of Kazim's Brethren. The battle continues with a fierce exchange of gunshots grenades and machine gun fire resulting in losses on both sides. Crouched behind a rock they watch as men on both sides of the battle run amongst camels and horses. They look down at Kazim who lies mortally wounded on the ground at their feet. Elsa looks saddened. Kazim dies. Indy leaps atop a Turkish Soldier on horseback pulling the man and the horse to the ground. A second Turk comes to assist his comrade. Indy mounts the horse knocking both Turks to the ground. Brody has been left alone in the tank. Henry climbs down into the tank and taps Brody on the shoulder startling him. Brody then tugs his ears flaps his arms and touches his head. They exchange a handshake. The Nazi Soldiers point their guns at Henry and Brody. Vogel removes a glove and slaps Henry with it. He slaps Henry again. Another slap. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Vogel reaches out to slap Henry yet again but Henry grabs his arm stopping him. Donovan appears at the turret cover. Indy and Sallah charge forward leading their horses and camels. Then Vogel commands the Tank Driver to give chase. Vogel shouts to the Tank Driver. Henry and Brody are still held at gunpoint by the Nazi Soldier. The Nazi Soldier swings his fist knocking Henry off his seat. Smoke pours from the top of the tank as the turret pops open. Vogel emerges and aims his gun at Indy. Indy and Vogel exchange shots as Indy chases the tank on his horse. Indy pulls the trigger again—his gun is empty. Indy immediately takes the high trail. Now Indy is above the tank twelve feet on a paralleling trail. He moves out of the saddle and leaps from the speeding horse onto the trundling tank. Hatestaring at Indy. Hatestaring back at Vogel. Suddenly from nowhere a German soldier flies into frame tackling Indy. One of the two troop carriers is paralleling the tank and like pirates boarding a galleon. Nazi Soldiers leap over the treads and swarm all over Indy. Indy presses the Luger against his assailant and forces the Nazi to squeeze off a shot into himself. The bullet not only passes through the Nazi but passes through two other Nazis standing directly behind him on the crowded tank top and three bodies fall away leaving Indy to stare at the gun in disbelief."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Elsa and Donovan take cover beside the parked car. Indy and Henry followed by Sallah take cover behind a rock to watch Kazim's Men and the Nazi Troops exchanging fire below them. The Brethren are firing at the Donovan party and are being fired on by the Donovan party. Two Nazi Soldiers throw hand grenades into the cliffs. They explode killing one of Kazim's Brethren. The battle continues with a fierce exchange of gunshots grenades and machine gun fire resulting in losses on both sides. Crouched behind a rock they watch as men on both sides of the battle run amongst camels and horses. They look down at Kazim who lies mortally wounded on the ground at their feet. Elsa looks saddened. Kazim dies. Indy leaps atop a Turkish Soldier on horseback pulling the man and the horse to the ground. A second Turk comes to assist his comrade. Indy mounts the horse knocking both Turks to the ground. Brody has been left alone in the tank. Henry climbs down into the tank and taps Brody on the shoulder startling him. Brody then tugs his ears flaps his arms and touches his head. They exchange a handshake. The Nazi Soldiers point their guns at Henry and Brody. Vogel removes a glove and slaps Henry with it. He slaps Henry again. Another slap. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Vogel reaches out to slap Henry yet again but Henry grabs his arm stopping him. Donovan appears at the turret cover. Indy and Sallah charge forward leading their horses and camels. Then Vogel commands the Tank Driver to give chase. Vogel shouts to the Tank Driver. Henry and Brody are still held at gunpoint by the Nazi Soldier. The Nazi Soldier swings his fist knocking Henry off his seat. Smoke pours from the top of the tank as the turret pops open. Vogel emerges and aims his gun at Indy. Indy and Vogel exchange shots as Indy chases the tank on his horse. Indy pulls the trigger again—his gun is empty. Indy immediately takes the high trail. Now Indy is above the tank twelve feet on a paralleling trail. He moves out of the saddle and leaps from the speeding horse onto the trundling tank. Hatestaring at Indy. Hatestaring back at Vogel. Suddenly from nowhere a German soldier flies into frame tackling Indy. One of the two troop carriers is paralleling the tank and like pirates boarding a galleon. Nazi Soldiers leap over the treads and swarm all over Indy. Indy presses the Luger against his assailant and forces the Nazi to squeeze off a shot into himself. The bullet not only passes through the Nazi but passes through two other Nazis standing directly behind him on the crowded tank top and three bodies fall away leaving Indy to stare at the gun in disbelief."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Elsa and Donovan take cover beside the parked car. Indy and Henry followed by Sallah take cover behind a rock to watch Kazim's Men and the Nazi Troops exchanging fire below them. The Brethren are firing at the Donovan party and are being fired on by the Donovan party. Two Nazi Soldiers throw hand grenades into the cliffs. They explode killing one of Kazim's Brethren. The battle continues with a fierce exchange of gunshots grenades and machine gun fire resulting in losses on both sides. Crouched behind a rock they watch as men on both sides of the battle run amongst camels and horses. They look down at Kazim who lies mortally wounded on the ground at their feet. Elsa looks saddened. Kazim dies. Indy leaps atop a Turkish Soldier on horseback pulling the man and the horse to the ground. Indy immediately takes the high trail. Now Indy is above the tank twelve feet on a paralleling trail. He moves out of the saddle and leaps from the speeding horse onto the trundling tank. Hatestaring at Indy. Hatestaring back at Vogel. Suddenly from nowhere a German soldier flies into frame tackling Indy. One of the two troop carriers is paralleling the tank and like pirates boarding a galleon. Nazi Soldiers leap over the treads and swarm all over Indy. Indy presses the Luger against his assailant and forces the Nazi to squeeze off a shot into himself. The bullet not only passes through the Nazi but passes through two other Nazis standing directly behind him on the crowded tank top and three bodies fall away leaving Indy to stare at the gun in disbelief."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Elsa and Donovan take cover beside the parked car. Indy and Henry followed by Sallah take cover behind a rock to watch Kazim's Men and the Nazi Troops exchanging fire below them. The Brethren are firing at the Donovan party and are being fired on by the Donovan party. Two Nazi Soldiers throw hand grenades into the cliffs. They explode killing one of Kazim's Brethren. One of the two troop carriers is paralleling the tank and like pirates boarding a galleon. Nazi Soldiers leap over the treads and swarm all over Indy. Indy presses the Luger against his assailant and forces the Nazi to squeeze off a shot into himself. The bullet not only passes through the Nazi but passes through two other Nazis standing directly behind him on the crowded tank top and three bodies fall away leaving Indy to stare at the gun in disbelief."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Martha and Simon hide beneath the frozen tree. Bella and Kevin, tailed by Hudson, conceal themselves behind a boulder to observe Trevor's Crew and the Viking Warriors hurling stones above them. The Guild are tossing pies at the Simon group and are being pelted by the Simon group. Two Viking Knights lob tomatoes onto the hilltops. They burst, squishing one of Trevor's Guild. The skirmish persists with a wild swap of arrows, pies, and cheese wheels, resulting in mishaps on both clans. Squatting behind a boulder, they witness as warriors from both factions dash among llamas and llamas. They peer down at Trevor, who rests critically perplexed on the ground at their toes. Martha appears cheerful. Trevor faints. Bella jumps atop a Spanish Knight on a unicorn, dragging the fellow and the unicorn to the turf. A second Spaniard arrives to aid his ally; Bella climbs onto the unicorn, toppling both Spaniards to the earth. Benny has been deserted inside the carriage. Kevin descends into the carriage and pats Benny on the elbow, surprising him. Benny then pulls his eyelids, shakes his legs, and pats his chin. They swap a high-five. The Viking Knights aim their arrows at Kevin and Benny. Clark removes a shoe and thumps Kevin with it. He thumps Kevin again. Yet another thump. Clark reaches out to thump Kevin once more, but Kevin catches his wrist, halting him. Simon emerges at the hatch cover. Bella and Hudson sprint ahead, guiding their llamas and llamas. Then Clark directs the Carriage Captain to pursue. Clark yells to the Carriage Captain. Kevin and Benny remain restrained at arrowpoint by the Viking Knight. The Viking Knight swings his leg, toppling Kevin off his perch. Mist streams from the peak of the carriage as the hatch springs open. Clark surfaces and directs his arrow at Bella. Bella and Clark swap darts as Bella chases the carriage on his unicorn. Bella pulls the lever again—his bow is jammed! Bella instantly picks the upper path. Now Bella is above the carriage, fifteen stories on an adjoining path. He steps off the unicorn and jumps from the racing unicorn onto the rattling carriage. Glare-peering at Bella. Glare-peering back at Clark. Suddenly, from the ether, a French runner crashes into view, seizing Bella. One of the two supply wagons is running beside the carriage, and like knights boarding a caravan, Viking Knights vault over the wheels and crowd all over Bella. Bella presses the musket against his attacker and compels the Viking to discharge a dart into himself. The dart not only pierces the Viking, but also pierces two other Vikings standing directly behind him on the cramped carriage roof, and three figures tumble away, leaving Bella to gaze at the musket in amazement."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Elsa and Donovan hide by a car while Indy, Henry, and Sallah watch Kazim's men and Nazi troops exchange fire. The intense battle involves grenades and machine guns, leading to casualties on both sides. They find Kazim mortally wounded, and he dies as Elsa looks on sadly. Indy jumps onto a Turkish soldier's horse, unseats two Turks, and mounts the horse. Meanwhile, Brody is alone in a tank until Henry joins him, startling him. Henry and Brody exchange gestures before Nazi soldiers point guns at them. Vogel slaps Henry repeatedly until Henry stops him. Indy and Sallah lead an advance on horses and camels. Vogel orders the tank to pursue them. Despite being held at gunpoint, Henry is knocked from his seat. Smoke billows as Vogel emerges from the tank to shoot at Indy, who is now out of ammunition. Indy rides above the tank and jumps onto it, engaging in a fight. A German soldier tackles Indy, leading to a fight on the tank. Indy forces an assailant to shoot himself, with the bullet passing through him and hitting two other Nazis, leaving Indy shocked."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The bullet not only passes through the Nazi but passes through two other Nazis standing directly behind him on the crowded tank top and three bodies fall away leaving Indy to stare at the gun in disbelief Indy presses the Luger against his assailant and forces the Nazi to squeeze off a shot into himself Nazi Soldiers leap over the treads and swarm all over Indy One of the two troop carriers is paralleling the tank and like pirates boarding a galleon Suddenly from nowhere a German soldier flies into frame tackling Indy Hatestaring back at Vogel Hatestaring at Indy He moves out of the saddle and leaps from the speeding horse onto the trundling tank Now Indy is above the tank twelve feet on a paralleling trail Indy immediately takes the high trail Indy pulls the trigger again—his gun is empty Indy and Vogel exchange shots as Indy chases the tank on his horse Vogel emerges and aims his gun at Indy Smoke pours from the top of the tank as the turret pops open The Nazi Soldier swings his fist knocking Henry off his seat Henry and Brody are still held at gunpoint by the Nazi Soldier Vogel shouts to the Tank Driver Then Vogel commands the Tank Driver to give chase Indy and Sallah charge forward leading their horses and camels Donovan appears at the turret cover Vogel reaches out to slap Henry yet again but Henry grabs his arm stopping him Another slap He slaps Henry again Vogel removes a glove and slaps Henry with it The Nazi Soldiers point their guns at Henry and Brody They exchange a handshake Brody then tugs his ears flaps his arms and touches his head Henry climbs down into the tank and taps Brody on the shoulder startling him Brody has been left alone in the tank Indy mounts the horse knocking both Turks to the ground A second Turk comes to assist his comrade Indy leaps atop a Turkish Soldier on horseback pulling the man and the horse to the ground Kazim dies Elsa looks saddened They look down at Kazim who lies mortally wounded on the ground at their feet Crouched behind a rock they watch as men on both sides of the battle run amongst camels and horses The battle continues with a fierce exchange of gunshots grenades and machine gun fire resulting in losses on both sides They explode killing one of Kazim's Brethren Two Nazi Soldiers throw hand grenades into the cliffs The Brethren are firing at the Donovan party and are being fired on by the Donovan party Indy and Henry followed by Sallah take cover behind a rock to watch Kazim's Men and the Nazi Troops exchanging fire below them Elsa and Donovan take cover beside the parked car"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Indy and Henry followed by Sallah take cover behind a rock to watch Kazim's Men and the Nazi Troops exchanging fire below them Elsa and Donovan take cover beside the parked car Two Nazi Soldiers throw hand grenades into the cliffs The Brethren are firing at the Donovan party and are being fired on by the Donovan party The battle continues with a fierce exchange of gunshots grenades and machine gun fire resulting in losses on both sides They explode killing one of Kazim's Brethren They look down at Kazim who lies mortally wounded on the ground at their feet Crouched behind a rock they watch as men on both sides of the battle run amongst camels and horses Kazim dies Elsa looks saddened A second Turk comes to assist his comrade Indy leaps atop a Turkish Soldier on horseback pulling the man and the horse to the ground Brody has been left alone in the tank Indy mounts the horse knocking both Turks to the ground Brody then tugs his ears flaps his arms and touches his head Henry climbs down into the tank and taps Brody on the shoulder startling him The Nazi Soldiers point their guns at Henry and Brody They exchange a handshake He slaps Henry again Vogel removes a glove and slaps Henry with it Vogel reaches out to slap Henry yet again but Henry grabs his arm stopping him Another slap Indy and Sallah charge forward leading their horses and camels Donovan appears at the turret cover Vogel shouts to the Tank Driver Then Vogel commands the Tank Driver to give chase The Nazi Soldier swings his fist knocking Henry off his seat Henry and Brody are still held at gunpoint by the Nazi Soldier Vogel emerges and aims his gun at Indy Smoke pours from the top of the tank as the turret pops open Indy pulls the trigger again—his gun is empty Indy and Vogel exchange shots as Indy chases the tank on his horse Now Indy is above the tank twelve feet on a paralleling trail Indy immediately takes the high trail Hatestaring at Indy He moves out of the saddle and leaps from the speeding horse onto the trundling tank Suddenly from nowhere a German soldier flies into frame tackling Indy Hatestaring back at Vogel Nazi Soldiers leap over the treads and swarm all over Indy One of the two troop carriers is paralleling the tank and like pirates boarding a galleon The bullet not only passes through the Nazi but passes through two other Nazis standing directly behind him on the crowded tank top and three bodies fall away leaving Indy to stare at the gun in disbelief Indy presses the Luger against his assailant and forces the Nazi to squeeze off a shot into himself"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Vogel reaches out to slap Henry yet again but Henry grabs his arm stopping him Donovan appears at the turret cover Indy and Sallah charge forward leading their horses and camels Then Vogel commands the Tank Driver to give chase Vogel shouts to the Tank Driver Henry and Brody are still held at gunpoint by the Nazi Soldier The Nazi Soldier swings his fist knocking Henry off his seat Smoke pours from the top of the tank as the turret pops open Vogel emerges and aims his gun at Indy Indy and Vogel exchange shots as Indy chases the tank on his horse Indy pulls the trigger again—his gun is empty Indy immediately takes the high trail Now Indy is above the tank twelve feet on a paralleling trail He moves out of the saddle and leaps from the speeding horse onto the trundling tank Hatestaring at Indy Hatestaring back at Vogel Suddenly from nowhere a German soldier flies into frame tackling Indy One of the two troop carriers is paralleling the tank and like pirates boarding a galleon Nazi Soldiers leap over the treads and swarm all over Indy Indy presses the Luger against his assailant and forces the Nazi to squeeze off a shot into himself The bullet not only passes through the Nazi but passes through two other Nazis standing directly behind him on the crowded tank top and three bodies fall away leaving Indy to stare at the gun in disbelief Elsa and Donovan take cover beside the parked car Indy and Henry followed by Sallah take cover behind a rock to watch Kazim's Men and the Nazi Troops exchanging fire below them The Brethren are firing at the Donovan party and are being fired on by the Donovan party Two Nazi Soldiers throw hand grenades into the cliffs They explode killing one of Kazim's Brethren The battle continues with a fierce exchange of gunshots grenades and machine gun fire resulting in losses on both sides Crouched behind a rock they watch as men on both sides of the battle run amongst camels and horses They look down at Kazim who lies mortally wounded on the ground at their feet Elsa looks saddened Kazim dies Indy leaps atop a Turkish Soldier on horseback pulling the man and the horse to the ground A second Turk comes to assist his comrade Indy mounts the horse knocking both Turks to the ground Brody has been left alone in the tank Henry climbs down into the tank and taps Brody on the shoulder startling him Brody then tugs his ears flaps his arms and touches his head They exchange a handshake The Nazi Soldiers point their guns at Henry and Brody Vogel removes a glove and slaps Henry with it He slaps Henry again Another slap"
        }
      ]
    }
  ]
}