{
  "ground_truth": "But the horse moves exactly at the wrong moment and Indy lands flat on his feet in a standing position. Indy stands up and successfully mounts his horse. Fedora and his men arrive at the roof's edge in time to see Indy climb into the saddle and gallop off. Fedora puts two fingers in his mouth and whistles, and a vintage truck and automobile come roaring out from behind the Pueblo, driven by two more gang members. The passenger in the car has his face concealed by the hat's wide brim, but his arm is out the window, and we see an olive-colored hand protruding from the sleeve of an expensive white linen suit. Indy spurs his mount on to greater speeds, but the autos not only keep pace with his horse. Indy veers off in a new direction toward a railroad track. The train is barreling down the track. Indy rides up beside it and he leaps from horse to train. He clings to the side of a boxcar as Halfbreed and Rough Rider leap from the truck onto the train. Halfbreed tries to grab Indy, but Indy leaps onto another boxcar. Halfbreed runs after him, but Indy leaps from the boxcar onto some covered boxes stacked on a flatcar. Indy loses his balance but regains it. With Halfbreed and Rough Rider still running after him, Indy enters the trap door of and finds himself crawling on a catwalk suspended from the car's ceiling. Several feet below are numerous vats containing all manner of reptiles: alligators, crocodiles, giant lizards, etc. Then, Halfbreed enters through the trap door, followed by Rough Rider. Halfbreed grabs hold of Indy's feet, but Indy kicks at him and he loses his grasp. Indy crawls away toward an opening on the opposite side. Halfbreed grabs at Indy's feet again; Indy rolls away and we see large bins of squirming snakes. The combined weight of the three people is more than the catwalk was intended for, and the bolts begin to rip from. Several bolts tear free, but it's Indy's end of the catwalk that drops down. He lands hard, with a splash into a vat of water where he finds himself eye-to-eye with an enormous anaconda. The head of this snake is so damn big, it looks more like a Tyrannosaurus Rex. Roscoe appears atop the reptile car and manages to grab Indy. Indy kicks at him. Roscoe grabs onto the side of the reptile car as Indy moves on to. Indy climbs over canvas-covered circus equipment. Roscoe follows, grabbing a long stick with a hook on it. He reaches forward and trips Indy, who falls onto the roof of the rhino boxcar. As a lamp falls from the ceiling with the impact of Indy's fall, hitting a huge black rhinoceros.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "However, the steed shifts accurately at the incorrect instant and Indy descends flat on his soles in an upright stance. Indy rises and successfully mounts his steed. Fedora and his group arrive at the roof's border in time to witness Indy climb into the saddle and gallop away. Fedora places two digits in his mouth and whistles, and an antique lorry and automobile come roaring out from behind the Pueblo, driven by two additional gang members. The passenger in the car has his visage concealed by the hat's broad brim, but his limb is out the window, and we observe an olive-colored hand protruding from the sleeve of an expensive white linen suit. Indy spurs his mount on to greater velocity, but the autos not only keep pace with his steed. Indy veers off in a new direction toward a railroad track. The train is barreling down the track. Indy rides up beside it and he leaps from steed to train. He clings to the side of a boxcar as Halfbreed and Rough Rider leap from the lorry onto the train. Halfbreed attempts to grab Indy, but Indy leaps onto another boxcar. Halfbreed runs after him, but Indy leaps from the boxcar onto some covered crates stacked on a flatcar. Indy loses his balance but regains it. With Halfbreed and Rough Rider still pursuing him, Indy enters the trap door and finds himself crawling on a catwalk suspended from the car's ceiling. Several feet below are numerous vats containing all kinds of reptiles: alligators, crocodiles, giant lizards, etc. Then, Halfbreed enters through the trap door, followed by Rough Rider. Halfbreed grabs hold of Indy's feet, but Indy kicks at him and he loses his grip. Indy crawls away toward an opening on the opposite side. Halfbreed grabs at Indy's feet again; Indy rolls away and we see large bins of writhing serpents. The combined weight of the three individuals is more than the catwalk was intended for, and the bolts begin to rip from. Several bolts tear free, but it's Indy's end of the catwalk that drops down. He lands hard, with a splash into a vat of water where he finds himself eye-to-eye with a gigantic anaconda. The head of this serpent is so damn large, it looks more like a Tyrannosaurus Rex. Roscoe appears atop the reptile car and manages to grab Indy. Indy kicks at him. Roscoe grabs onto the side of the reptile car as Indy moves on to. Indy climbs over canvas-covered circus equipment. Roscoe follows, grabbing a long stick with a hook on it. He reaches forward and trips Indy, who falls onto the roof of the rhinoceros boxcar. As a lamp falls from the ceiling with the impact of Indy's fall, hitting a huge black rhinoceros."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "But exactly at the wrong moment, the horse is moved, and Indy is landed flat on his feet in a standing position. Indy is stood up by himself and his horse is successfully mounted. At the roof's edge, Fedora and his men arrive in time to see Indy as he is climbed into the saddle and is galloped off. Two fingers are put into his mouth by Fedora, and he whistles, and from behind the Pueblo, a vintage truck and an automobile are roared out by two more gang members. The face of the passenger in the car is concealed by the hat's wide brim, but the arm is out the window, protruding from the sleeve of an expensive white linen suit, which we see as olive-colored. Indy's mount is spurred on to greater speeds by him, but not only is the pace kept by the autos with his horse. In a new direction toward a railroad track, Indy is veered off. Down the track, the train is barreling. Beside it, Indy is ridden up, and from horse to train, he is leaped by him. To the side of a boxcar, he is clung to as Halfbreed and Rough Rider are leaped from the truck onto the train. Halfbreed tries to grab Indy, but onto another boxcar, he is leaped. After him, Halfbreed runs, but from the boxcar onto some covered boxes stacked on a flatcar, Indy is leaped. His balance is lost but regained by him. While Halfbreed and Rough Rider are still running after him, through the trap door, Indy enters and finds himself crawling on a catwalk suspended from the car's ceiling. Containing all manner of reptiles: alligators, crocodiles, giant lizards, etc., several feet below are numerous vats. Then, through the trap door, Halfbreed is entered, followed by Rough Rider. Indy's feet are grabbed hold of by Halfbreed, but at him, Indy kicks and his grasp is lost. Toward an opening on the opposite side, Indy crawls away. At Indy's feet, Halfbreed grabs again; Indy rolls away, and large bins of squirming snakes are seen by us. More than intended for, the combined weight of the three people is for the catwalk, and from the car, the bolts begin to rip. Free, several bolts are torn, but down, Indy's end of the catwalk is dropped. Hard, with a splash into a vat of water, he lands where eye-to-eye, with an enormous anaconda, he finds himself. So damn big, this snake's head is, like a Tyrannosaurus Rex, it looks. Atop the reptile car, Roscoe appears and manages to grab Indy. At him, Indy kicks. Onto the side of the reptile car, Roscoe grabs as Indy is moved on. Over canvas-covered circus equipment, Indy is climbed. With a long stick with a hook on it, Roscoe follows, grabbing it. Forward, he reaches and Indy is tripped, who falls onto the roof of the rhino boxcar. From the ceiling, with the impact of Indy's fall, a lamp falls, hitting a huge black rhinoceros."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Indy lands on his feet as the horse moves unexpectedly, quickly remounting. Fedora and his men reach the roof's edge just in time to see Indy gallop away. Fedora whistles, summoning a vintage truck and car driven by more gang members. The car's passenger hides under a hat, with an olive hand in a white suit sleeve visible. Indy drives his horse faster, pursued by the vehicles, and turns toward a railroad track. He rides beside the train, leaping onto it and clinging to a boxcar. Halfbreed and Rough Rider jump from the truck to the train, chasing Indy. Indy evades Halfbreed by leaping to another boxcar, ultimately reaching a catwalk above vats of reptiles. Halfbreed grabs Indy's feet but loses his hold after being kicked. Indy crawls toward an opening, surrounded by snakes. The catwalk collapses under their combined weight, dropping Indy into a water vat with an enormous anaconda. Roscoe appears, grabbing Indy, who kicks back and escapes, climbing over circus equipment. Roscoe follows, tripping Indy with a hooked stick, causing him to fall onto the rhino boxcar's roof, dislodging a lamp that impacts a huge black rhinoceros."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Indy lands on his feet as the horse moves at the wrong moment. He stands and mounts his horse. Fedora and his men reach the roof's edge just in time to see Indy gallop off. Fedora whistles, signaling a vintage truck and car, driven by gang members, to emerge. The passenger's hat conceals his face, but his arm, in an expensive white linen suit, shows an olive-colored hand. Indy spurs the horse faster, and the vehicles keep pace. He veers toward a railroad track, leaps onto a train, and clings to a boxcar as Halfbreed and Rough Rider leap onto the train. Halfbreed tries to grab Indy, who jumps onto another boxcar, then onto covered boxes on a flatcar, losing and regaining balance. Halfbreed and Rough Rider pursue Indy into a trap door, crawling on a catwalk above vats of reptiles. Halfbreed grabs Indy's feet, but Indy kicks him off. The catwalk's bolts begin to tear under the trio's combined weight, and Indy's end drops, landing him in a vat of water eye-to-eye with a giant anaconda. Roscoe appears on the reptile car, grabs Indy, who kicks him. Roscoe clings to the car as Indy climbs over circus equipment. Roscoe follows with a hooked stick, trips Indy, who falls onto a rhino boxcar, causing a lamp to fall and hit a black rhinoceros."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "However, just at the very moment when it is least expected, the horse decides to move unpredictably, causing Indy to land firmly and awkwardly on his feet, standing. Despite this unexpected turn of events, Indy quickly recovers, stands up, and with agility, successfully mounts his horse once more. At this point, Fedora and his men reach the edge of the roof, arriving just in time to witness Indy climb into the saddle and hastily gallop off into the distance. Fedora, taking swift action, places two fingers in his mouth and emits a sharp whistle. In response, a vintage truck and automobile come roaring out from their hidden position behind the Pueblo, driven by two more gang members with apparent urgency. The passenger seated in the car has his face obscured by the wide brim of a hat, adding an air of mystery, but an arm extends out of the window, revealing an olive-colored hand emerging from the sleeve of an expensive, pristine white linen suit. Indy, determined to escape, spurs his mount to achieve even greater speeds. Yet, the autos not only manage to keep pace with his galloping horse, but they also continue to close in on him. In a strategic move, Indy veers off in an entirely new direction, aiming toward the railroad track. As the train barrels down the track with force, Indy rides up alongside it and makes a daring leap from the horse to the train itself. He clings tenaciously to the side of a boxcar as Halfbreed and Rough Rider swiftly leap from the truck onto the moving train. Halfbreed attempts to grab hold of Indy, but Indy skillfully leaps onto another boxcar to evade capture. Halfbreed persistently runs after him, but Indy once again leaps, this time landing on some covered boxes stacked upon a flatcar. Despite briefly losing his balance, Indy quickly regains it, continuing with Halfbreed and Rough Rider hot on his trail. Indy enters through a trap door, finding himself crawling along a narrow catwalk suspended from the ceiling of the car. Below him, several feet down, are numerous vats filled with all manner of reptiles: alligators, crocodiles, giant lizards, and more. Before long, Halfbreed enters through the same trap door, with Rough Rider close behind him. Halfbreed manages to grab hold of Indy's feet, but Indy, with swift kicks, breaks free from his grasp. Indy then crawls away toward an opening on the opposite side of the car. Once more, Halfbreed reaches to grab Indy's feet, but Indy rolls away, revealing large bins filled with writhing snakes. The combined weight of the three people is more than the fragile catwalk is designed to hold, and the bolts begin to tear away under the strain. Several bolts break free, causing Indy's end of the catwalk to drop suddenly. He lands with a hard splash into a vat of water, where he finds himself eye-to-eye with an enormous anaconda. The head of this massive snake is so large that it appears more like a Tyrannosaurus Rex. Meanwhile, Roscoe climbs up atop the reptile car and manages to grab hold of Indy. In response, Indy kicks at him defiantly. Roscoe clings to the side of the reptile car as Indy moves on to his next challenge. Indy climbs over canvas-covered circus equipment, with Roscoe determinedly following behind. Roscoe grabs a long stick with a hook on the end and uses it to trip Indy, causing him to fall onto the roof of the rhino boxcar. As Indy impacts the roof, a lamp falls from the ceiling, landing with force and provoking a huge black rhinoceros below."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "At the precise moment when it is least expected and seemingly out of nowhere, the horse makes an unpredictable decision to move erratically. This sudden movement causes Indy to land heavily and awkwardly on his feet, standing up rather suddenly. Despite this unforeseen turn of events, Indy quickly gathers himself, stands upright with determination, and with remarkable agility, manages to mount his horse once again. Just as this unfolds, Fedora and his men reach the roof's edge, arriving just in time to observe Indy's swift climb into the saddle before he promptly gallops away into the distance. Acting with urgency, Fedora places two fingers in his mouth and emits a sharp, piercing whistle. In immediate response to this signal, a vintage truck along with an automobile come roaring out with great speed from their concealed position behind the Pueblo, driven by another two gang members who display apparent urgency and determination. The passenger in the car remains shrouded in mystery; his face is hidden by the wide brim of a large hat. However, an arm extends outward from the car's window, revealing a glimpse of an olive-hued hand emerging through the sleeve of an immaculate, expensive white linen suit. Indy, resolute and determined to make his escape, spurs his horse to achieve even greater speeds. Despite his efforts, the vehicles not only manage to keep pace with his galloping horse, they also continue closing the gap between them and Indy. In a strategic and bold move, Indy veers off in an entirely new direction, aiming purposefully toward the railroad track. As a powerful train barrels down the track with force and momentum, Indy rides up alongside it, executing a daring leap from his horse to the train itself. He clings tenaciously to the side of a boxcar as both Halfbreed and Rough Rider leap from the truck onto the train in pursuit of him. Halfbreed makes an attempt to seize Indy, but Indy skillfully avoids capture by leaping onto a different boxcar. Undeterred, Halfbreed continues to chase after him, but Indy once again leaps, this time landing on some covered boxes that are stacked atop a flatcar. Although he briefly loses his balance, Indy quickly regains it and continues onward, with Halfbreed and Rough Rider persistently hot on his trail. Indy enters through a trap door, finding himself scrambling along a narrow catwalk that is suspended from the ceiling of the car. Below him, several feet down, are numerous vats filled with various reptiles: alligators, crocodiles, giant lizards, and more. Before long, Halfbreed enters through the same trap door, with Rough Rider following closely behind. Halfbreed manages to grab hold of Indy's feet, but Indy, through rapid kicks, breaks free from his grasp. Indy then swiftly crawls away toward an opening on the opposite side of the car. Once again, Halfbreed reaches out to grab Indy's feet, but Indy rolls away, revealing large bins filled with writhing snakes. The combined weight of the three people is more than the fragile catwalk is able to hold, and soon the bolts begin to tear away under the mounting strain. Several bolts break free, causing Indy's end of the catwalk to drop abruptly. He lands with a hard splash into a vat of water, only to find himself suddenly eye-to-eye with an enormous anaconda. The head of this massive snake is so large that it looks as formidable as a Tyrannosaurus Rex. Meanwhile, Roscoe climbs up to the top of the reptile car and manages to grab hold of Indy. In response, Indy kicks at him defiantly. Roscoe clings to the side of the reptile car as Indy advances toward his next challenge. Indy climbs over canvas-covered circus equipment, with Roscoe determinedly following in pursuit. Roscoe seizes a long stick with a hook on the end and uses it to trip Indy, causing him to fall onto the roof of the rhino boxcar. As Indy impacts the roof with a thud, a lamp falls from the ceiling, landing with force and provoking a huge black rhinoceros below."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "At the precise moment when the horse beneath him makes a sudden, unexpected movement, Indy is thrown off balance but manages to land on his feet, firmly in a standing position. He quickly regains his composure, straightens up, and skillfully mounts his horse. Meanwhile, Fedora and his men rush to the edge of the roof just in time to witness Indy settling into the saddle and urging his horse forward into a gallop. In response, Fedora swiftly brings two fingers to his mouth and emits a sharp whistle, signaling a vintage truck and automobile to burst forth from behind the Pueblo, both driven by additional gang members. The passenger in the car keeps his face hidden beneath the broad brim of his hat, yet he extends his arm out of the window, revealing an olive-colored hand emerging from the sleeve of an expensive white linen suit. Determined to outpace his pursuers, Indy urges his horse to gallop even faster, but the autos match the horse's speed with ease. As the chase continues, Indy abruptly changes course, heading toward a railroad track where a train is thundering along. Galloping alongside the train, Indy matches its speed before making a daring leap from his horse onto the moving train, clinging tightly to the side of a boxcar. In hot pursuit, Halfbreed and Rough Rider jump from the truck onto the train, with Halfbreed making an attempt to grab Indy, who quickly evades capture by leaping onto another boxcar. Not giving up, Halfbreed chases after him, forcing Indy to leap once more, this time onto a stack of covered boxes on a flatcar. Momentarily losing his balance, Indy manages to steady himself and, with Halfbreed and Rough Rider still in pursuit, he spots a trap door and quickly enters it, finding himself crawling along a catwalk suspended from the ceiling of a train car. Below him are several feet of space filled with vats that house a variety of reptiles: alligators, crocodiles, giant lizards, and more. With urgency, Halfbreed follows Indy through the trap door, closely followed by Rough Rider. As Halfbreed catches hold of Indy's feet, Indy kicks out, causing Halfbreed to lose his grip. Seizing the opportunity, Indy crawls away toward an opening at the opposite end of the car, but not before Halfbreed makes another attempt to grab his feet. Indy rolls aside, narrowly avoiding the grasp, revealing large bins teeming with writhing snakes beneath him. The combined weight of the three men moving on the catwalk exceeds its capacity, and the supporting bolts begin to tear free from their moorings. In a sudden, catastrophic failure, the bolts at Indy's end of the catwalk give way, causing him to drop forcefully with a splash into a vat of water where he comes face-to-face with an enormous anaconda, its head so massive that it resembles that of a Tyrannosaurus Rex. Just then, Roscoe makes his appearance atop the reptile car and reaches down to grab Indy. Indy, fighting desperately, kicks at Roscoe, who then struggles to maintain his grip on the side of the reptile car as Indy continues. Indy scrambles over canvas-covered circus equipment, with Roscoe in relentless pursuit, grabbing a long stick equipped with a hook to trip Indy, sending him sprawling onto the roof of the rhino boxcar below. As Indy hits the car with considerable force, a lamp dislodges from the ceiling, crashing down and striking a huge black rhinoceros inside."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Indy lands on his feet and quickly mounts his horse as Fedora and his men reach the roof's edge, witnessing Indy gallop away. Fedora whistles, summoning a vintage truck and automobile driven by gang members. The passenger in the car, partially concealed by a hat, has an olive-colored hand emerging from a tailored suit sleeve. Indy urges his horse to greater speeds, veering toward a railroad track. As the train rushes by, Indy rides alongside and leaps onto it, clinging to a boxcar's side. Pursued by Halfbreed and Rough Rider, who jump from the truck onto the train, Indy evades capture by moving car to car. After regaining his balance on some covered boxes, Indy enters a trap door and crawls along a catwalk above vats teeming with reptiles. Halfbreed and Rough Rider follow, with Halfbreed briefly grabbing Indy's feet before losing his grip. As the structure strains under their weight, bolts give way and Indy plunges into a water-filled vat, facing a massive anaconda. Roscoe appears and grabs Indy, who kicks back and continues climbing over circus equipment. Roscoe follows, using a hooked stick to trip Indy, causing him to fall onto a rhino boxcar as a lamp crashes down, startling a large black rhinoceros."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "But the horse, startled by the sudden commotion, moves exactly at the wrong moment and Indy lands flat on his feet in a standing position. Indy, drawing on years of horseback riding experience dating back to his childhood in Utah, stands up and successfully mounts his horse. Fedora and his men arrive at the roof's edge in time to see Indy climb into the saddle and gallop off. Fedora puts two fingers in his mouth and whistles, a technique often used by ranchers to call for assistance, and a vintage truck and automobile, relics from the 1930s bootlegging era, come roaring out from behind the Pueblo, a historic village known for its adobe structures built by Native American tribes. The passenger in the car has his face concealed by the hat's wide brim, but his arm is out the window, and we see an olive-colored hand protruding from the sleeve of an expensive white linen suit, a style popularized by 1920s film stars. Indy spurs his mount on to greater speeds, but the autos not only keep pace with his horse, a testament to their finely-tuned engines. Indy veers off in a new direction toward a railroad track. The train is barreling down the track, its steam whistle echoing across the plains. Indy rides up beside it and he leaps from horse to train with the agility of a seasoned daredevil. He clings to the side of a boxcar as Halfbreed and Rough Rider, notorious henchmen with a reputation for ruthlessness, leap from the truck onto the train. Halfbreed tries to grab Indy, but Indy leaps onto another boxcar. Halfbreed runs after him, but Indy leaps from the boxcar onto some covered boxes stacked on a flatcar. Indy loses his balance but regains it, demonstrating his survival instincts. With Halfbreed and Rough Rider still running after him, Indy enters the trap door, a relic of old freight car designs, and finds himself crawling on a catwalk suspended from the car's ceiling. Several feet below are numerous vats containing all manner of reptiles: alligators, crocodiles, giant lizards, etc., reminiscent of the exotic animal collections often transported for circus shows in the early 20th century. Then, Halfbreed enters through the trap door, followed by Rough Rider. Halfbreed grabs hold of Indy's feet, but Indy kicks at him and he loses his grasp. Indy crawls away toward an opening on the opposite side. Halfbreed grabs at Indy's feet again; Indy rolls away and we see large bins of squirming snakes, echoing his long-standing phobia of serpents. The combined weight of the three people is more than the catwalk was intended for, and the bolts begin to rip from their aged holdings. Several bolts tear free, but it's Indy's end of the catwalk that drops down. He lands hard, with a splash into a vat of water where he finds himself eye-to-eye with an enormous anaconda, reminiscent of the legendary giant snakes of the Amazon. The head of this snake is so damn big, it looks more like a prehistoric creature, a Tyrannosaurus Rex. Roscoe, known for his agile movements, appears atop the reptile car and manages to grab Indy. Indy kicks at him. Roscoe grabs onto the side of the reptile car as Indy moves on to. Indy climbs over canvas-covered circus equipment, likely bound for a traveling show. Roscoe follows, grabbing a long stick with a hook on it, commonly used by animal handlers. He reaches forward and trips Indy, who falls onto the roof of the rhino boxcar. As a lamp falls from the ceiling with the impact of Indy's fall, hitting a huge black rhinoceros, the powerful creature lets out a defiant snort, showcasing its strength."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "But the horse moves exactly at the wrong moment and Indy lands flat on his feet in a standing position. Indy stands up and successfully mounts his horse. Fedora and his men arrive at the roof's edge in time to see Indy climb into the saddle and gallop off. Fedora puts two fingers in his mouth and whistles and a vintage truck and automobile come roaring out from behind the Pueblo driven by two more gang members. The passenger in the car has his face concealed by the hat's wide brim but his arm is out the window and we see an olivecolored hand protruding from the sleeve of an expensive white linen suit. Indy spurs his mount on to greater speeds but the autos not only keep pace with his horse. Indy veers off in a new direction toward a railroad track. The train is barreling down the track. Indy rides up beside it and he leaps from horse to train. He clings to the side of a boxcar as Halfbreed and Rough Rider leap from the truck onto the train. Halfbreed tries to grab Indy but Indy leaps onto another boxcar. Halfbreed runs after him but Indy leaps from the boxcar onto some covered boxes stacked on a flatcar. Indy loses his balance but regains it. With Halfbreed and Rough Rider still running after him. Indy enters the trap door of and finds himself crawling on a catwalk suspended from the car's ceiling. Several feet below are numerous vats containing all manner of reptiles alligators crocodiles giant lizards etc. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Then Halfbreed enters through the trap door followed by Rough Rider. Halfbreed grabs hold of Indy's feet but Indy kicks at him and he loses his grasp. Indy crawls away toward an opening on the opposite side. Halfbreed grabs at Indy's feet again. Indy rolls away and we see large bins of squirming snakes. The combined weight of the three people is more than the catwalk was intended for and the bolts begin to rip from. Several bolts tear free but it is Indy's end of the catwalk that drops down. He lands hard with a splash into a vat of water where he finds himself eyetoeye with an enormous anaconda. The head of this snake is so damn big it looks more like a Tyrannosaurus Rex. Roscoe appears atop the reptile car and manages to grab Indy. Indy kicks at him. Roscoe grabs onto the side of the reptile car as Indy moves on to. Indy climbs over canvascovered circus equipment. Roscoe follows grabbing a long stick with a hook on it. He reaches forward and trips Indy who falls onto the roof of the rhino boxcar. As a lamp falls from the ceiling with the impact of Indy's fall hitting a huge black rhinoceros."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "But the horse moves exactly at the wrong moment and Indy lands flat on his feet in a standing position. Indy stands up and successfully mounts his horse. Fedora and his men arrive at the roof's edge in time to see Indy climb into the saddle and gallop off. Fedora puts two fingers in his mouth and whistles and a vintage truck and automobile come roaring out from behind the Pueblo driven by two more gang members. The passenger in the car has his face concealed by the hat's wide brim but his arm is out the window and we see an olivecolored hand protruding from the sleeve of an expensive white linen suit. Indy spurs his mount on to greater speeds but the autos not only keep pace with his horse. Indy veers off in a new direction toward a railroad track. The train is barreling down the track. Indy rides up beside it and he leaps from horse to train. He clings to the side of a boxcar as Halfbreed and Rough Rider leap from the truck onto the train. Halfbreed tries to grab Indy but Indy leaps onto another boxcar. Halfbreed runs after him but Indy leaps from the boxcar onto some covered boxes stacked on a flatcar. Indy loses his balance but regains it. With Halfbreed and Rough Rider still running after him. Indy enters the trap door of and finds himself crawling on a catwalk suspended from the car's ceiling. Several feet below are numerous vats containing all manner of reptiles alligators crocodiles giant lizards etc. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Then Halfbreed enters through the trap door followed by Rough Rider. Halfbreed grabs hold of Indy's feet but Indy kicks at him and he loses his grasp. Indy crawls away toward an opening on the opposite side. Halfbreed grabs at Indy's feet again. Indy rolls away and we see large bins of squirming snakes. The combined weight of the three people is more than the catwalk was intended for and the bolts begin to rip from. Several bolts tear free but it is Indy's end of the catwalk that drops down. He lands hard with a splash into a vat of water where he finds himself eyetoeye with an enormous anaconda. The head of this snake is so damn big it looks more like a Tyrannosaurus Rex. Roscoe appears atop the reptile car and manages to grab Indy. Indy kicks at him. Roscoe grabs onto the side of the reptile car as Indy moves on to. Indy climbs over canvascovered circus equipment. Roscoe follows grabbing a long stick with a hook on it. He reaches forward and trips Indy who falls onto the roof of the rhino boxcar. As a lamp falls from the ceiling with the impact of Indy's fall hitting a huge black rhinoceros."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "But the horse moves exactly at the wrong moment and Indy lands flat on his feet in a standing position. Indy stands up and successfully mounts his horse. Fedora and his men arrive at the roof's edge in time to see Indy climb into the saddle and gallop off. Fedora puts two fingers in his mouth and whistles and a vintage truck and automobile come roaring out from behind the Pueblo driven by two more gang members. The passenger in the car has his face concealed by the hat's wide brim but his arm is out the window and we see an olivecolored hand protruding from the sleeve of an expensive white linen suit. Indy spurs his mount on to greater speeds but the autos not only keep pace with his horse. Indy veers off in a new direction toward a railroad track. The train is barreling down the track. The head of this snake is so damn big it looks more like a Tyrannosaurus Rex. Roscoe appears atop the reptile car and manages to grab Indy. Indy kicks at him. Roscoe grabs onto the side of the reptile car as Indy moves on to. Indy climbs over canvascovered circus equipment. Roscoe follows grabbing a long stick with a hook on it. He reaches forward and trips Indy who falls onto the roof of the rhino boxcar. As a lamp falls from the ceiling with the impact of Indy's fall hitting a huge black rhinoceros."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "But the horse moves exactly at the wrong moment and Indy lands flat on his feet in a standing position. Indy stands up and successfully mounts his horse. Fedora and his men arrive at the roof's edge in time to see Indy climb into the saddle and gallop off. Fedora puts two fingers in his mouth and whistles and a vintage truck and automobile come roaring out from behind the Pueblo driven by two more gang members. Roscoe follows grabbing a long stick with a hook on it. He reaches forward and trips Indy who falls onto the roof of the rhino boxcar. As a lamp falls from the ceiling with the impact of Indy's fall hitting a huge black rhinoceros."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "But the drone buzzes exactly at the right moment and Alex stumbles flat on his knees in a crouching stance. Alex hops up and awkwardly boards his skateboard. Clover and her team show up at the cliff's edge just in time to watch Alex hop onto the scooter and zoom away. Clover snaps two fingers in her glove and snaps, and a modern helicopter and jet roar in from beyond the canyon, piloted by two additional squad members. The copilot in the jet has their face obscured by the helmet's dark visor, but their foot is out the hatch, and we spot a turquoise-colored boot stretching from the leg of a flashy orange leather suit. Alex kicks his board for higher velocity, but the aircraft not only match strides with his skateboard. Alex veers off onto a new path toward a highway bridge. The convoy is cruising along the bridge. Alex rides nearby and he vaults from skateboard to truck. He clutches the side of a trailer as Flash and Sprinter leap from the helicopter onto the trailer. Flash attempts to seize Alex, but Alex vaults onto another trailer. Flash dashes after him, but Alex vaults from the trailer onto some open crates stacked on a platform. Alex loses his footing but regains it. With Flash and Sprinter still chasing after him, Alex drops through the hatch and finds himself crawling on a beam suspended from the trailer's roof. Several feet below are countless containers holding all types of birds: parrots, hawks, giant pelicans, etc. Then, Flash descends through the hatch, followed by Sprinter. Flash seizes hold of Alex's knees, but Alex wriggles at him and he loses his grip. Alex scrambles toward an exit on the far side. Flash reaches for Alex's knees again; Alex tumbles aside and we observe large crates of fluttering pigeons. The combined weight of the three individuals is more than the beam was designed to bear, and the screws begin to pop from. Several screws break free, but it's Alex's end of the beam that collapses downward. He tumbles heavily, with a thud into a carton of hay where he finds himself nose-to-nose with an enormous ostrich. The beak of this bird is so damn big, it resembles more like a Velociraptor. Benny emerges atop the avian trailer and strives to seize Alex. Alex kicks at him. Benny grips onto the side of the avian trailer as Alex moves forward. Alex scales over tarp-covered carnival tents. Benny pursues, grasping a lengthy pole with a net on it. He extends forward and trips Alex, who tumbles onto the top of the hippo wagon. As a rope falls from the rafter with the force of Alex's tumble, striking a massive gray hippopotamus."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Indy tries to mount his horse but lands on his feet. He quickly mounts and gallops away as Fedora and his gang appear. Fedora whistles, signaling a vintage truck and car to pursue Indy. Despite spurring his horse, the vehicles keep pace, so Indy heads toward a train track. He leaps from the horse to the train, clinging to a boxcar. As Halfbreed and Rough Rider jump aboard, Indy escapes onto another boxcar. They chase him, but Indy enters a trap door and crawls on a catwalk over vats of reptiles. Halfbreed follows and grabs Indy, but Indy kicks him off and moves toward another exit, encountering snakes below. The catwalk collapses under their weight, dropping Indy into a vat with a massive anaconda. Roscoe grabs Indy from above, but Indy kicks him away and climbs over circus equipment. Roscoe uses a hooked stick to trip Indy, causing him to fall onto the roof of the rhino boxcar, disturbing a huge black rhinoceros."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As a lamp falls from the ceiling with the impact of Indy's fall hitting a huge black rhinoceros He reaches forward and trips Indy who falls onto the roof of the rhino boxcar Roscoe follows grabbing a long stick with a hook on it Indy climbs over canvascovered circus equipment Roscoe grabs onto the side of the reptile car as Indy moves on to Indy kicks at him Roscoe appears atop the reptile car and manages to grab Indy The head of this snake is so damn big it looks more like a Tyrannosaurus Rex He lands hard with a splash into a vat of water where he finds himself eyetoeye with an enormous anaconda Several bolts tear free but it is Indy's end of the catwalk that drops down The combined weight of the three people is more than the catwalk was intended for and the bolts begin to rip from Indy rolls away and we see large bins of squirming snakes Halfbreed grabs at Indy's feet again Indy crawls away toward an opening on the opposite side Halfbreed grabs hold of Indy's feet but Indy kicks at him and he loses his grasp Then Halfbreed enters through the trap door followed by Rough Rider Several feet below are numerous vats containing all manner of reptiles alligators crocodiles giant lizards etc Indy enters the trap door of and finds himself crawling on a catwalk suspended from the car's ceiling With Halfbreed and Rough Rider still running after him Indy loses his balance but regains it Halfbreed runs after him but Indy leaps from the boxcar onto some covered boxes stacked on a flatcar Halfbreed tries to grab Indy but Indy leaps onto another boxcar He clings to the side of a boxcar as Halfbreed and Rough Rider leap from the truck onto the train Indy rides up beside it and he leaps from horse to train The train is barreling down the track Indy veers off in a new direction toward a railroad track Indy spurs his mount on to greater speeds but the autos not only keep pace with his horse The passenger in the car has his face concealed by the hat's wide brim but his arm is out the window and we see an olivecolored hand protruding from the sleeve of an expensive white linen suit Fedora puts two fingers in his mouth and whistles and a vintage truck and automobile come roaring out from behind the Pueblo driven by two more gang members Fedora and his men arrive at the roof's edge in time to see Indy climb into the saddle and gallop off Indy stands up and successfully mounts his horse But the horse moves exactly at the wrong moment and Indy lands flat on his feet in a standing position"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Indy stands up and successfully mounts his horse But the horse moves exactly at the wrong moment and Indy lands flat on his feet in a standing position Fedora puts two fingers in his mouth and whistles and a vintage truck and automobile come roaring out from behind the Pueblo driven by two more gang members Fedora and his men arrive at the roof's edge in time to see Indy climb into the saddle and gallop off Indy spurs his mount on to greater speeds but the autos not only keep pace with his horse The passenger in the car has his face concealed by the hat's wide brim but his arm is out the window and we see an olivecolored hand protruding from the sleeve of an expensive white linen suit The train is barreling down the track Indy veers off in a new direction toward a railroad track He clings to the side of a boxcar as Halfbreed and Rough Rider leap from the truck onto the train Indy rides up beside it and he leaps from horse to train Halfbreed runs after him but Indy leaps from the boxcar onto some covered boxes stacked on a flatcar Halfbreed tries to grab Indy but Indy leaps onto another boxcar With Halfbreed and Rough Rider still running after him Indy loses his balance but regains it Several feet below are numerous vats containing all manner of reptiles alligators crocodiles giant lizards etc Indy enters the trap door of and finds himself crawling on a catwalk suspended from the car's ceiling Halfbreed grabs hold of Indy's feet but Indy kicks at him and he loses his grasp Then Halfbreed enters through the trap door followed by Rough Rider Halfbreed grabs at Indy's feet again Indy crawls away toward an opening on the opposite side The combined weight of the three people is more than the catwalk was intended for and the bolts begin to rip from Indy rolls away and we see large bins of squirming snakes He lands hard with a splash into a vat of water where he finds himself eyetoeye with an enormous anaconda Several bolts tear free but it is Indy's end of the catwalk that drops down Roscoe appears atop the reptile car and manages to grab Indy The head of this snake is so damn big it looks more like a Tyrannosaurus Rex Roscoe grabs onto the side of the reptile car as Indy moves on to Indy kicks at him Roscoe follows grabbing a long stick with a hook on it Indy climbs over canvascovered circus equipment As a lamp falls from the ceiling with the impact of Indy's fall hitting a huge black rhinoceros He reaches forward and trips Indy who falls onto the roof of the rhino boxcar"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Then Halfbreed enters through the trap door followed by Rough Rider Halfbreed grabs hold of Indy's feet but Indy kicks at him and he loses his grasp Indy crawls away toward an opening on the opposite side Halfbreed grabs at Indy's feet again Indy rolls away and we see large bins of squirming snakes The combined weight of the three people is more than the catwalk was intended for and the bolts begin to rip from Several bolts tear free but it is Indy's end of the catwalk that drops down He lands hard with a splash into a vat of water where he finds himself eyetoeye with an enormous anaconda The head of this snake is so damn big it looks more like a Tyrannosaurus Rex Roscoe appears atop the reptile car and manages to grab Indy Indy kicks at him Roscoe grabs onto the side of the reptile car as Indy moves on to Indy climbs over canvascovered circus equipment Roscoe follows grabbing a long stick with a hook on it He reaches forward and trips Indy who falls onto the roof of the rhino boxcar As a lamp falls from the ceiling with the impact of Indy's fall hitting a huge black rhinoceros But the horse moves exactly at the wrong moment and Indy lands flat on his feet in a standing position Indy stands up and successfully mounts his horse Fedora and his men arrive at the roof's edge in time to see Indy climb into the saddle and gallop off Fedora puts two fingers in his mouth and whistles and a vintage truck and automobile come roaring out from behind the Pueblo driven by two more gang members The passenger in the car has his face concealed by the hat's wide brim but his arm is out the window and we see an olivecolored hand protruding from the sleeve of an expensive white linen suit Indy spurs his mount on to greater speeds but the autos not only keep pace with his horse Indy veers off in a new direction toward a railroad track The train is barreling down the track Indy rides up beside it and he leaps from horse to train He clings to the side of a boxcar as Halfbreed and Rough Rider leap from the truck onto the train Halfbreed tries to grab Indy but Indy leaps onto another boxcar Halfbreed runs after him but Indy leaps from the boxcar onto some covered boxes stacked on a flatcar Indy loses his balance but regains it With Halfbreed and Rough Rider still running after him Indy enters the trap door of and finds himself crawling on a catwalk suspended from the car's ceiling Several feet below are numerous vats containing all manner of reptiles alligators crocodiles giant lizards etc"
        }
      ]
    }
  ]
}