{
  "ground_truth": "Indy carefully walks forward, seeing each letter on the stones, followed by Donovan and Elsa in his footsteps. After a sigh of relief, Indy stands in a small opening leading to a 100-foot drop and a view of a stony cliff wall 100 feet across, with no obvious way to cross. He looks to the Grail Diary for guidance, then notices a lion's head inscribed in the rock above. Indy calls to his son, leaps into space, and hangs in midair. Realizing the ingenious First Crusaders have painted a pathway in forced perspective to blend with the rocks below, Indy throws dirt on the bridge and crosses it like the first Crusader in the painting over Henry's desk. Indy crawls through a small cliff opening and enters a temple with a vast array of chalices in many sizes, shapes, gold, and silver. He notices a man praying at the altar with his back turned, dressed as a Grail Knight, though the knight's face is unseen. The Grail Knight wearily prepares for combat, wielding a two-handed broadsword, but struggles with its weight. Indy dodges the clumsy swings until the exhausted knight collapses. Indy raises the knight's visor, revealing a very ancient man, who reaches for Indy's clothing and offers his sword. At that moment, Donovan and Elsa appear, and Donovan turns to the display of cups while Elsa and Indy exchange looks. Elsa selects a solid gold, emerald-encrusted goblet, which Donovan takes, fills with water, and drinks. Donovan's body then begins to convulse.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Indy meticulously strides ahead, observing each character on the stones, trailed by Donovan and Elsa in his tracks. After a breath of relief, Indy stands in a diminutive aperture leading to a 100-foot plunge and a vista of a rocky escarpment wall 100 feet across, with no evident method to traverse. He glances to the Grail Diary for counsel, then perceives a lion's head etched in the stone above. Indy calls to his offspring, jumps into void, and dangles in midair. Realizing the clever First Crusaders have depicted a walkway in enforced perspective to merge with the rocks below, Indy hurls soil on the overpass and traverses it like the original Crusader in the artwork over Henry's desk. Indy wriggles through a small cliff aperture and enters a sanctuary with a vast assortment of chalices in numerous dimensions, formations, gold, and silver. He observes a man supplicating at the altar with his back turned, clad as a Grail Knight, though the knight's visage is unseen. The Grail Knight tiredly prepares for battle, maneuvering a dual-handed longsword, but struggles with its burden. Indy evades the awkward slices until the fatigued knight collapses. Indy elevates the knight's visor, unveiling a very old man, who reaches for Indy's garments and offers his sword. At that moment, Donovan and Elsa emerge, and Donovan turns to the display of receptacles while Elsa and Indy exchange glances. Elsa chooses a solid gold, emerald-studded chalice, which Donovan seizes, fills with liquid, and consumes. Donovan's body then begins to shudder."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Careful steps are taken by Indy as he walks forward, each letter on the stones being seen, and Donovan and Elsa follow in his footsteps. After a sigh of relief, a small opening leading to a 100-foot drop and a view of a stony cliff wall 100 feet across is stood upon by Indy, with no obvious way to cross. Guidance is sought by him from the Grail Diary, then a lion's head inscribed in the rock above is noticed. His son is called by Indy, and space is leapt into by him, hanging in midair. Indy realizes that the ingenious First Crusaders have painted a pathway in forced perspective to blend with the rocks below, throwing dirt on the bridge and crossing it like the first Crusader in the painting over Henry's desk. A small cliff opening is crawled through by Indy, and a temple with a vast array of chalices in many sizes, shapes, gold, and silver is entered. A man praying at the altar with his back turned, dressed as a Grail Knight, is noticed by him, though the knight's face is unseen. Combat is wearily prepared for by the Grail Knight, wielding a two-handed broadsword, but struggles with its weight. The clumsy swings are dodged by Indy until the exhausted knight collapses. The knight's visor is raised by Indy, revealing a very ancient man, who reaches for Indy's clothing and offers his sword. At that moment, the display of cups is turned to by Donovan and Elsa, and looks are exchanged by Elsa and Indy. A solid gold, emerald-encrusted goblet is selected by Elsa, which is taken by Donovan, filled with water, and drunk. Then, Donovan's body begins to convulse."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Indy carefully walks forward, reading each letter on the stones, followed by Donovan and Elsa. After a sigh, Indy stands at a small opening leading to a 100-foot drop, facing a stony cliff wall 100 feet across, with no visible crossing. Consulting the Grail Diary, he spots a lion's head carved above. Indy calls to his son, leaps, and hangs midair. Realizing the First Crusaders cleverly painted a path in forced perspective, Indy throws dirt on the bridge and crosses it like the Crusader in the painting over Henry's desk. He crawls through a small cliff opening into a temple filled with chalices of various sizes, shapes, gold, and silver. He notices a praying man dressed as a Grail Knight with his back turned. The weary knight, wielding a heavy broadsword, struggles and collapses after clumsy swings. Indy lifts the knight's visor, revealing an ancient man who offers his sword. Donovan and Elsa arrive as Donovan examines the cups, while Elsa and Indy exchange looks. Elsa picks a solid gold, emerald-encrusted goblet, which Donovan fills with water and drinks, causing his body to convulse."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Indy walks forward, reading each stone letter, followed by Donovan and Elsa. After relief, Indy finds a small opening leading to a 100-foot drop and cliff wall, with no clear crossing. Consulting the Grail Diary, he sees a lion's head above. Calling to his son, Indy leaps, hanging in midair. Realizing First Crusaders painted a perspective path, he throws dirt on the bridge, crossing like the Crusader in Henry's painting. Indy climbs through a cliff opening into a temple filled with chalices of various types. A man, dressed as a Grail Knight, prays at the altar with his face hidden. The weary knight prepares for combat, struggling with a broadsword. Indy dodges the swings until the knight collapses. Lifting the visor, Indy sees an ancient man offering his sword. Donovan and Elsa appear; Donovan selects a gold, emerald goblet, drinks, and convulses."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Indy, with utmost caution and precision, takes careful steps forward, his eyes fixed intently on each letter carved into the stones beneath his feet. Behind him, Donovan and Elsa follow cautiously in his footsteps. After breathing a sigh of relief, Indy finds himself standing in a small opening that leads to a daunting 100-foot drop. Before him is a stony cliff wall, standing a full 100 feet across, and tantalizingly there is no clear or visible way to cross it. Seeking guidance, Indy consults the Grail Diary in his possession and then notices a lion's head inscribed in the rock above him. Without hesitation, Indy calls out to his son, takes a daring leap into the apparently empty space, and momentarily hangs there in midair. In this instant, he realizes the brilliant ingenuity of the First Crusaders, who had cleverly painted a pathway using forced perspective to seamlessly blend with the rocks below. Indy scatters dirt over the cleverly disguised bridge and skillfully crosses it, mimicking the actions of the first Crusader in the painting that hangs over Henry's desk. Indy then crawls through a narrow cliff opening and finds himself inside a temple, where he is greeted by an impressive display of chalices in a wide variety of sizes and shapes, crafted from gold and silver. He notices a man, with his back turned, fervently praying at the altar, dressed in the attire of a Grail Knight, though the knight's face remains hidden from view. The Grail Knight, appearing weary, readies himself for battle, wielding a heavy two-handed broadsword, though he struggles with the immense weight of the weapon. Indy deftly evades the cumbersome swings until, finally, the exhausted knight collapses under the strain. Indy carefully raises the knight's visor to reveal the face of a very ancient man, who reaches toward Indy’s clothing, offering him his sword as a gesture of surrender. At that very moment, Donovan and Elsa appear, and Donovan eagerly turns his attention to the array of cups on display, while Elsa and Indy exchange a meaningful look. Elsa makes her choice, selecting a goblet crafted from solid gold and encrusted with shimmering emeralds. Donovan takes the chosen goblet, fills it with water, and drinks from it. Suddenly, Donovan's body begins to convulse uncontrollably."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With utmost caution and an unwavering sense of precision, Indy steps forward with careful deliberation. His eyes remain intently fixed on each intricately carved letter set into the stones beneath his feet. Behind him, Donovan and Elsa, filled with a sense of caution, follow closely in his footsteps, mirroring his every move. After he breathes a sigh of relief, Indy finds himself standing at the edge of a small opening that leads ominously to a daunting 100-foot drop. In front of him looms a stony cliff wall, standing an impressive 100 feet across. Tantalizingly, there appears to be no clear or easily visible way to cross this intimidating expanse. In search of guidance, Indy consults the Grail Diary in his possession and soon notices a lion's head inscribed in the rock positioned above him. Without a moment's hesitation, Indy calls out to his son and bravely takes a daring leap into what appears to be empty space, momentarily hanging there in midair. In this fleeting moment, he recognizes the brilliant ingenuity of the First Crusaders, who had cleverly painted a pathway using forced perspective to blend seamlessly with the rocks below. Indy scatters a handful of dirt over the cleverly disguised bridge and expertly crosses it, imitating the actions depicted by the first Crusader in the painting that hangs prominently over Henry's desk. Indy then crawls through a narrow opening in the cliff and soon finds himself within a temple, where he is greeted by an impressive display of chalices. These cups come in a wide variety of sizes and shapes, crafted meticulously from both gold and silver. He notices a man standing with his back turned, fervently praying at the altar. This man is dressed in the attire of a Grail Knight, though the knight’s face remains shrouded in mystery and hidden from view. The Grail Knight, appearing noticeably weary, prepares himself for battle, wielding a heavy two-handed broadsword, but he visibly struggles with the immense weight of the weapon. Indy skillfully evades the cumbersome swings of the sword until, at long last, the exhausted knight collapses under the overwhelming strain. Indy carefully raises the knight’s visor to gaze upon the face of a very ancient man, who reaches out toward Indy’s clothing, offering him his sword as a gesture of surrender. At that precise moment, Donovan and Elsa make their appearance, and Donovan eagerly turns his attention to the array of cups on display, while Elsa and Indy share a meaningful exchange of looks. Elsa then makes her selection, choosing a goblet crafted from solid gold and encrusted with shimmering emeralds. Donovan takes the chosen goblet into his hands, fills it with water, and drinks from it. Without warning, Donovan's body begins to convulse uncontrollably."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Indy cautiously advances forward, his eyes carefully scanning each letter carved into the stones beneath his feet to ensure accuracy in his steps, with Donovan and Elsa trailing closely behind and mimicking his cautious movements. After releasing a sigh of relief, he finds himself standing at the edge of a small opening that abruptly transitions into a daunting 100-foot drop, presenting him with a view of a sheer stony cliff wall positioned 100 feet across from where he stands, and no apparent route to traverse this gap. He then diverts his attention to the Grail Diary, seeking its wisdom for guidance, before his eyes are drawn to the depiction of a lion's head intricately inscribed into the rock face high above him. Calling out to his son for reassurance, Indy summons his courage, makes a calculated leap into what appears to be empty space, and hangs suspended in midair, defying expectations. It is then that he deduces the clever First Crusaders have ingeniously camouflaged a pathway, designed in forced perspective to merge seamlessly with the pattern of the rocks below. Indy proceeds to throw dirt onto the hidden bridge to reveal its contours and confidently walks across the newly visible passageway in a manner resembling the First Crusader from the painting over Henry's desk. Upon reaching the other side, Indy crawls through a narrow opening in the cliff face and emerges into a temple filled with an extensive collection of chalices varying in size, shape, and composition, including gold and silver. Within the temple, he observes a figure kneeling at the altar in a posture of prayer, clad in garb befitting a Grail Knight, though the knight's face remains concealed from view. This Grail Knight, visibly fatigued, prepares to engage in combat, struggling to manage the weight of a cumbersome two-handed broadsword. Indy deftly dodges the awkward and unsteady swings until the weary knight can no longer sustain the effort and collapses from exhaustion. Taking advantage of the pause, Indy gently lifts the knight's visor to reveal the visage of a very ancient man who, in a gesture of surrender, reaches towards Indy's clothing and offers the sword to him. At this juncture, Donovan and Elsa enter the scene, redirecting the focus as Donovan turns his attention to the array of cups on display, while Elsa and Indy exchange meaningful glances. With careful deliberation, Elsa selects a goblet of solid gold adorned with emeralds, which Donovan eagerly takes in hand, proceeds to fill with water, and then drinks from. Almost immediately, Donovan's body begins to convulse violently in reaction to the choice."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Indy carefully navigates the path marked by letters on the stones, followed closely by Donovan and Elsa. They reach an opening revealing a 100-foot drop with a stony cliff wall ahead and no clear crossing. Consulting the Grail Diary, Indy spots a lion's head inscribed in the rock and, calling to his son, leaps into space, discovering a cleverly painted bridge that blends with the rocks. He throws dirt to reveal the path and crosses it, reminiscent of the first Crusader in the painting over Henry's desk. Indy then crawls through a cliff opening into a temple filled with various chalices. Inside, he notices a man dressed as a Grail Knight praying at the altar. The knight, wielding a heavy broadsword, struggles to attack Indy, who evades until the knight collapses from exhaustion. Indy lifts the knight's visor, revealing an ancient face, who then offers him the sword. Donovan and Elsa arrive, and after exchanging looks with Indy, Elsa chooses a solid gold, emerald-encrusted goblet for Donovan. Donovan fills it with water and drinks, which causes his body to convulse."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Indy carefully walks forward in the ancient chamber, seeing each letter on the stones like those detailed in medieval manuscripts, followed by Donovan and Elsa in his footsteps. After a sigh of relief, Indy stands in a small opening leading to a 100-foot drop and a view of a centuries-old stony cliff wall 100 feet across, with no obvious way to cross. He looks to the Grail Diary, a leather-bound guide passed down through history, for guidance, then notices a lion's head inscribed in the rock above, a common medieval symbol of courage. Indy calls to his son, who is familiar with his father's archaeological adventures, leaps into space, and hangs in midair. Realizing the ingenious First Crusaders have painted a pathway in forced perspective to blend with the rocks below, a technique used by artists to create illusions, Indy throws dirt on the bridge and crosses it with the determination of the first Crusader in the painting over Henry's desk, which depicts a scene from the Crusades. Indy crawls through a small cliff opening and enters a temple, reminiscent of ancient sanctuaries, with a vast array of chalices in many sizes, shapes, gold, and silver, reflecting the wealth of medieval European royalty. He notices a man praying at the altar with his back turned, dressed as a Grail Knight, though the knight's face is unseen, shrouded in mystery like the legends of the Holy Grail. The Grail Knight wearily prepares for combat, wielding a two-handed broadsword, a weapon used by knights in the Middle Ages, but struggles with its weight. Indy dodges the clumsy swings until the exhausted knight collapses. Indy raises the knight's visor, revealing a very ancient man, as if he had witnessed centuries pass, who reaches for Indy's clothing and offers his sword as a symbol of trust. At that moment, Donovan and Elsa appear, and Donovan turns to the display of cups, reminiscent of the Last Supper, while Elsa and Indy exchange looks filled with unspoken understanding. Elsa selects a solid gold, emerald-encrusted goblet, resembling the treasures of ancient kings, which Donovan takes, fills with water, and drinks. Donovan's body then begins to convulse, an indication of the cup's false promise of eternal life."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Indy carefully walks forward seeing each letter on the stones followed by Donovan and Elsa in his footsteps. After a sigh of relief Indy stands in a small opening leading to a 100foot drop and a view of a stony cliff wall 100 feet across with no obvious way to cross. He looks to the Grail Diary for guidance then notices a lion's head inscribed in the rock above. Indy calls to his son leaps into space and hangs in midair. Realizing the ingenious First Crusaders have painted a pathway in forced perspective to blend with the rocks below. Indy throws dirt on the bridge and crosses it like the first Crusader in the painting over Henry's desk. Indy crawls through a small cliff opening and enters a temple with a vast array of chalices in many sizes shapes gold and silver. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. He notices a man praying at the altar with his back turned dressed as a Grail Knight though the knight's face is unseen. The Grail Knight wearily prepares for combat wielding a twohanded broadsword but struggles with its weight. Indy dodges the clumsy swings until the exhausted knight collapses. Indy raises the knight's visor revealing a very ancient man who reaches for Indy's clothing and offers his sword. At that moment Donovan and Elsa appear and Donovan turns to the display of cups. while Elsa and Indy exchange looks. Elsa selects a solid gold emeraldencrusted goblet which Donovan takes fills with water and drinks. Donovan's body then begins to convulse."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Indy carefully walks forward seeing each letter on the stones followed by Donovan and Elsa in his footsteps. After a sigh of relief Indy stands in a small opening leading to a 100foot drop and a view of a stony cliff wall 100 feet across with no obvious way to cross. He looks to the Grail Diary for guidance then notices a lion's head inscribed in the rock above. Indy calls to his son leaps into space and hangs in midair. Realizing the ingenious First Crusaders have painted a pathway in forced perspective to blend with the rocks below. Indy throws dirt on the bridge and crosses it like the first Crusader in the painting over Henry's desk. Indy crawls through a small cliff opening and enters a temple with a vast array of chalices in many sizes shapes gold and silver. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. He notices a man praying at the altar with his back turned dressed as a Grail Knight though the knight's face is unseen. The Grail Knight wearily prepares for combat wielding a twohanded broadsword but struggles with its weight. Indy dodges the clumsy swings until the exhausted knight collapses. Indy raises the knight's visor revealing a very ancient man who reaches for Indy's clothing and offers his sword. At that moment Donovan and Elsa appear and Donovan turns to the display of cups. while Elsa and Indy exchange looks. Elsa selects a solid gold emeraldencrusted goblet which Donovan takes fills with water and drinks. Donovan's body then begins to convulse."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Indy carefully walks forward seeing each letter on the stones followed by Donovan and Elsa in his footsteps. After a sigh of relief Indy stands in a small opening leading to a 100foot drop and a view of a stony cliff wall 100 feet across with no obvious way to cross. He looks to the Grail Diary for guidance then notices a lion's head inscribed in the rock above. Indy calls to his son leaps into space and hangs in midair. At that moment Donovan and Elsa appear and Donovan turns to the display of cups. while Elsa and Indy exchange looks. Elsa selects a solid gold emeraldencrusted goblet which Donovan takes fills with water and drinks. Donovan's body then begins to convulse."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Indy carefully walks forward seeing each letter on the stones followed by Donovan and Elsa in his footsteps. Elsa selects a solid gold emeraldencrusted goblet which Donovan takes fills with water and drinks. Donovan's body then begins to convulse."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Barry reluctantly skips backward, examining every balloon on the paper, trailed by Theodore and Clara in his shadows. After a chuckle of amusement, Barry stands in a tiny closet leading to a 200-foot rise and a sight of a wooden hill wall 200 feet wide, with no apparent route to scale. He glances to the Travel Journal for hints, then spots a dragon's tail carved in the wood below. Barry shouts to his cousin, dances onto the ground, and freezes in time. Discovering the clever Second Knights have taped a ladder in disguised perspective to blend with the trees above, Barry sprinkles flour on the tunnel and climbs it like the second Knight in the photograph under George's rug. Barry slithers through a large hill entrance and arrives at a library with a small collection of scrolls in various colors, textures, copper, and bronze. He observes a woman meditating at the podium with her face concealed, cloaked as a Shield Soldier, though the soldier's hands are invisible. The Shield Soldier eagerly readies for discussion, brandishing a single-handed dagger, but struggles with its balance. Barry sidesteps the awkward stabs until the weary soldier trips. Barry lowers the soldier's hood, revealing an extremely youthful person, who reaches for Barry's footwear and offers her dagger. At that point, Theodore and Clara emerge, and Theodore turns to the shelf of vases while Clara and Barry exchange glances. Clara picks a fragile wooden, sapphire-studded urn, which Theodore grabs, fills with soda, and sips. Theodore's form then begins to pulsate."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Indy cautiously advances, deciphering stone inscriptions, trailed by Donovan and Elsa. Reaching a precipice, Indy consults the Grail Diary and spots a lion's head in the rock. He leaps and discovers a hidden path camouflaged in the cliff, then crosses safely. Entering a temple, he finds numerous chalices and a praying man dressed as a Grail Knight. The knight, wielding a heavy sword, falters and collapses after futile swings at Indy. Indy lifts the knight's visor to reveal an ancient man, who offers his sword. Donovan and Elsa arrive, with Donovan choosing a gold, emerald-encrusted goblet. After drinking from it, Donovan’s body begins to convulse."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Donovan's body then begins to convulse Elsa selects a solid gold emeraldencrusted goblet which Donovan takes fills with water and drinks while Elsa and Indy exchange looks At that moment Donovan and Elsa appear and Donovan turns to the display of cups Indy raises the knight's visor revealing a very ancient man who reaches for Indy's clothing and offers his sword Indy dodges the clumsy swings until the exhausted knight collapses The Grail Knight wearily prepares for combat wielding a twohanded broadsword but struggles with its weight He notices a man praying at the altar with his back turned dressed as a Grail Knight though the knight's face is unseen Indy crawls through a small cliff opening and enters a temple with a vast array of chalices in many sizes shapes gold and silver Indy throws dirt on the bridge and crosses it like the first Crusader in the painting over Henry's desk Realizing the ingenious First Crusaders have painted a pathway in forced perspective to blend with the rocks below Indy calls to his son leaps into space and hangs in midair He looks to the Grail Diary for guidance then notices a lion's head inscribed in the rock above After a sigh of relief Indy stands in a small opening leading to a 100foot drop and a view of a stony cliff wall 100 feet across with no obvious way to cross Indy carefully walks forward seeing each letter on the stones followed by Donovan and Elsa in his footsteps"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "After a sigh of relief Indy stands in a small opening leading to a 100foot drop and a view of a stony cliff wall 100 feet across with no obvious way to cross Indy carefully walks forward seeing each letter on the stones followed by Donovan and Elsa in his footsteps Indy calls to his son leaps into space and hangs in midair He looks to the Grail Diary for guidance then notices a lion's head inscribed in the rock above Indy throws dirt on the bridge and crosses it like the first Crusader in the painting over Henry's desk Realizing the ingenious First Crusaders have painted a pathway in forced perspective to blend with the rocks below He notices a man praying at the altar with his back turned dressed as a Grail Knight though the knight's face is unseen Indy crawls through a small cliff opening and enters a temple with a vast array of chalices in many sizes shapes gold and silver Indy dodges the clumsy swings until the exhausted knight collapses The Grail Knight wearily prepares for combat wielding a twohanded broadsword but struggles with its weight At that moment Donovan and Elsa appear and Donovan turns to the display of cups Indy raises the knight's visor revealing a very ancient man who reaches for Indy's clothing and offers his sword Elsa selects a solid gold emeraldencrusted goblet which Donovan takes fills with water and drinks while Elsa and Indy exchange looks Donovan's body then begins to convulse"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The Grail Knight wearily prepares for combat wielding a twohanded broadsword but struggles with its weight Indy dodges the clumsy swings until the exhausted knight collapses Indy raises the knight's visor revealing a very ancient man who reaches for Indy's clothing and offers his sword At that moment Donovan and Elsa appear and Donovan turns to the display of cups while Elsa and Indy exchange looks Elsa selects a solid gold emeraldencrusted goblet which Donovan takes fills with water and drinks Donovan's body then begins to convulse Indy carefully walks forward seeing each letter on the stones followed by Donovan and Elsa in his footsteps After a sigh of relief Indy stands in a small opening leading to a 100foot drop and a view of a stony cliff wall 100 feet across with no obvious way to cross He looks to the Grail Diary for guidance then notices a lion's head inscribed in the rock above Indy calls to his son leaps into space and hangs in midair Realizing the ingenious First Crusaders have painted a pathway in forced perspective to blend with the rocks below Indy throws dirt on the bridge and crosses it like the first Crusader in the painting over Henry's desk Indy crawls through a small cliff opening and enters a temple with a vast array of chalices in many sizes shapes gold and silver He notices a man praying at the altar with his back turned dressed as a Grail Knight though the knight's face is unseen"
        }
      ]
    }
  ]
}