{
  "ground_truth": "Indy grabs a crowbar and fends off two sailors who attack him from the sides. He sees that the Cross is about to be swept overboard and lunges for it. He snatches up the Cross only to be knocked down to the deck by a giant wave. Indy struggles to his feet, managing to avoid the giant fuel drums sliding across the deck around him as several more drums come his way. Indy turns around and pummels two sailors with one punch, then sees a large Stevedore's hook above him and climbs up on crates to reach it. He grabs hold of the hook and uses it to swing all the way across the deck, narrowly avoiding a huge wave behind him, before jumping into the rollicking ocean, still holding onto the Cross. On the ship, a giant fuel drum rolls wildly, falling directly onto a crate of TNT, causing the entire ship to blow, sending an enormous orange fireball into the sky. As bits of debris fall from the sky like rain, Indy bobs up in the water amid the debris, holding the Cross in his hand. He grabs for something to keep him afloat. Students walk along brick, tree-lined paths, while dressed in professorial tweeds, Indy stands before his class, where there is laughter. Marcus Brody approaches Indy's classroom and peers through the window in the door to see Indy completing his lecture. Brody enters the lecture hall and stands at the rear of the room as Indy stands at his desk and students begin to disperse. A pretty coed puts a note on the desk as Brody approaches, and the last of the students leaves the lecture hall. Indy removes the cloth-wrapped Cross from his desk, places it on the desk, and takes off his glasses as Brody examines the Cross. Indy gathers up his books and makes his way toward the door, turning back toward Brody, now holding the Cross. Indy takes the term papers then turns to enter his private office, where he goes to his desk and finds a thick envelope with a foreign postmark on it. Indy stuffs his mail into his coat pockets, goes to the window, slides it open, and steps out into the garden. He escapes through the garden and walks briskly toward the street, smiling and enjoying his freedom. As he arrives at the curb, a long black Packard sedan pulls up before him and three men step out. Indy is ushered into a large Art Deco apartment and left alone amid numerous museum-quality artifacts displayed around the room. After a moment, Walter Donovan enters from across the room, and during the brief time that the door is open, we hear a cocktail party going on in the next room with voices and soft sounds.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Indy seizes a pry bar and repels two mariners who assault him from the sides. He notices that the Cross is about to be swept overboard and lunges for it. He snatches up the Cross only to be knocked down to the deck by an enormous wave. Indy struggles to his feet, managing to dodge the gigantic fuel barrels sliding across the deck around him as several more barrels come his way. Indy turns around and pummels two mariners with one punch, then sees a large Dockworker's hook above him and climbs up on crates to reach it. He grabs hold of the hook and uses it to swing all the way across the deck, narrowly avoiding a massive wave behind him, before jumping into the tumultuous ocean, still holding onto the Cross. On the ship, a gigantic fuel barrel rolls wildly, falling directly onto a crate of TNT, causing the entire ship to explode, sending an enormous orange fireball into the sky. As bits of wreckage fall from the sky like rain, Indy bobs up in the water amid the wreckage, holding the Cross in his hand. He grabs for something to keep him afloat. Students walk along brick, tree-lined paths, while dressed in professorial tweeds, Indy stands before his class, where there is laughter. Marcus Brody approaches Indy's classroom and peers through the window in the door to see Indy completing his lecture. Brody enters the lecture hall and stands at the rear of the room as Indy stands at his desk and students begin to disperse. A pretty coed puts a note on the desk as Brody approaches, and the last of the students leaves the lecture hall. Indy removes the cloth-wrapped Cross from his desk, places it on the desk, and takes off his spectacles as Brody examines the Cross. Indy gathers up his books and makes his way toward the door, turning back toward Brody, now holding the Cross. Indy takes the term papers then turns to enter his private office, where he goes to his desk and finds a thick envelope with a foreign postmark on it. Indy stuffs his mail into his coat pockets, goes to the window, slides it open, and steps out into the garden. He escapes through the garden and walks briskly toward the street, smiling and enjoying his freedom. As he arrives at the curb, a long black Packard sedan pulls up before him and three men step out. Indy is ushered into a large Art Deco apartment and left alone amid numerous museum-quality artifacts displayed around the room. After a moment, Walter Donovan enters from across the room, and during the brief time that the door is open, we hear a cocktail party going on in the next room with voices and soft sounds."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A crowbar is grabbed by Indy, and two sailors who attack him from the sides are fended off by him. The Cross is seen by him to be about to be swept overboard, and he lunges for it. The Cross is snatched up by him, only to be knocked down to the deck by a giant wave. He struggles to his feet, managing to avoid the giant fuel drums sliding across the deck around him as several more drums come his way. Two sailors are pummeled by Indy with one punch, then he sees a large Stevedore's hook above him and climbs up on crates to reach it. The hook is grabbed by him, and it is used to swing all the way across the deck, narrowly avoiding a huge wave behind him, before he jumps into the rollicking ocean, still holding onto the Cross. On the ship, a giant fuel drum rolls wildly and falls directly onto a crate of TNT, causing an enormous orange fireball to be sent into the sky by the entire ship blowing up. As bits of debris fall from the sky like rain, Indy bobs up in the water amid the debris, holding the Cross in his hand. He grabs for something to keep himself afloat. Brick, tree-lined paths are walked along by students, while dressed in professorial tweeds, he stands before his class, where laughter occurs. Indy's classroom is approached by Marcus Brody, and he peers through the window in the door to see Indy completing his lecture. Brody enters the lecture hall and stands at the rear of the room as his desk is stood at by Indy, and students begin to disperse. A note is put on the desk by a pretty coed as Brody approaches, and the lecture hall is left by the last of the students. The cloth-wrapped Cross is removed from his desk by Indy, who places it on the desk, and his glasses are taken off as the Cross is examined by Brody. His books are gathered up by Indy, and he makes his way toward the door, turning back toward Brody, who now holds the Cross. He takes the term papers, then turns to enter his private office, where his desk is gone to by him and he finds a thick envelope with a foreign postmark on it. His mail is stuffed by Indy into his coat pockets, he goes to the window, slides it open, and steps out into the garden. The garden is escaped through by him, and he walks briskly toward the street, smiling and enjoying his freedom. As the curb is arrived at by him, a long black Packard sedan pulls up before him and three men step out. Indy ushers himself into a large Art Deco apartment and is left alone amid numerous museum-quality artifacts displayed around the room. Walter Donovan enters from across the room after a moment, and during the brief time that the door is open, we hear a cocktail party going on in the next room with voices and soft sounds."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Indy uses a crowbar to fend off two attacking sailors. Spotting the Cross about to go overboard, he lunges for it but is knocked down by a giant wave. Struggling to his feet, he avoids sliding fuel drums and punches two sailors. Indy climbs crates to grab a Stevedore's hook, swinging across the deck to evade a massive wave, then jumps into the ocean with the Cross. A fuel drum falls on TNT, blowing up the ship and creating an orange fireball. Indy emerges in the water, holding the Cross and grabbing debris for flotation. At a university, Indy, dressed in tweeds, teaches a class. Marcus Brody peers in, watching Indy finish his lecture as students leave. A student leaves a note, and Brody examines the Cross Indy unwraps from cloth. Indy collects his books and heads to his office, finding an envelope with a foreign postmark. He stuffs his mail into his coat, steps into the garden through a window, and enjoys his freedom. Reaching the street, a black Packard sedan arrives, and three men emerge. Indy is taken to an Art Deco apartment filled with artifacts. Walter Donovan enters as sounds of a cocktail party are faintly heard from another room."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Indy fends off two sailors with a crowbar and lunges for the Cross about to be swept overboard but gets knocked down by a wave. He avoids sliding fuel drums, punches two sailors, climbs crates to grab a Stevedore's hook, swings across the deck, and jumps into the ocean with the Cross. A fuel drum falls on TNT, blowing up the ship with a fireball. Indy surfaces, holding the Cross amid debris. At the university, students disperse after Indy's lecture. Brody enters, examines the Cross on Indy's desk. Indy gathers his belongings, exits through the garden, reaches the street where a black sedan arrives. He's taken to an Art Deco apartment with valuable artifacts, where Walter Donovan enters amid sounds of a cocktail party."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Indy, armed with a sturdy crowbar, bravely fends off two aggressive sailors attacking him from either side. As he does, he notices with alarm that the precious Cross is on the verge of being swept overboard. Acting quickly, he lunges forward in a desperate attempt to save it. He successfully snatches up the Cross, but is immediately knocked to the deck by a giant wave crashing over him. Struggling against the elements, Indy manages to get back on his feet. He skillfully navigates the deck, avoiding the large fuel drums that are sliding dangerously close to him, and with several more barrels headed his way, he deftly turns around. In a single powerful motion, he delivers a punch that takes down two sailors. His eyes then catch sight of a large Stevedore's hook hanging above and he climbs up onto a stack of crates to reach it. Grabbing hold of the hook, he deftly uses it to swing across the length of the deck, narrowly escaping a massive wave crashing behind him, and finally leaps into the churning ocean below, all the while clutching the Cross securely.\n\nBack on the ship, chaos ensues as a giant fuel drum careens wildly, colliding directly with a crate full of TNT, setting off a catastrophic explosion. The resulting blast sends an enormous orange fireball shooting into the sky. As debris descends from above, raining down like a storm, Indy bobs up from the water amidst the wreckage, the Cross still firmly in his grasp. He reaches out, grabbing onto anything that will help keep him afloat amidst the chaos.\n\nMeanwhile, students stroll leisurely along the picturesque, brick-lined paths shaded by trees, dressed in their stylish, professorial tweeds. In a classroom setting, Indy stands before his attentive students, where laughter fills the air. Marcus Brody, approaching Indy's classroom, peers through the window in the door to observe Indy concluding his lecture. Brody then enters the lecture hall quietly, positioning himself at the back of the room. As Indy stands at his desk, the students begin to disperse. A pretty coed leaves a note on his desk, and as Brody approaches, the last of the students trickle out of the lecture hall.\n\nIndy carefully removes the cloth-wrapped Cross from his desk, placing it meticulously on the surface, and removes his glasses while Brody examines their valuable find. Indy then gathers his assortment of books and heads towards the door, turning to glance back at Brody, who is now holding the Cross. Indy takes possession of the stack of term papers and turns towards his private office. Once inside, he approaches his desk to find a thick envelope with a distinctive foreign postmark sitting there. Indy stuffs the mail into his coat pockets, makes his way to the window, slides it open, and steps out into the serene garden below. He makes his escape through the lush garden, walking briskly towards the bustling street with a smile stretching across his face, relishing the feeling of newfound freedom.\n\nAs Indy reaches the curb, a long, sleek black Packard sedan glides to a stop before him, and three men emerge from the vehicle. Indy is promptly ushered into a spacious, elegantly designed Art Deco apartment, where he finds himself alone among a collection of museum-quality artifacts artfully displayed around the room. After a brief moment of solitude, Walter Donovan enters from across the room. During the short interval when the door is ajar, the sounds of a lively cocktail party—voices mingling with soft music—waft in from the adjacent room."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Indy, wielding a sturdy and reliable crowbar with determination, courageously defends himself against two hostile and aggressive sailors who are attacking him from both sides with fierce intensity. As he engages in this tense struggle, Indy suddenly perceives, with great alarm, that the invaluable Cross is perilously close to being swept away over the side of the ship. Acting swiftly in response to this immediate threat, he lunges forward in a dramatic and desperate attempt to rescue it. With a quick and decisive motion, he successfully seizes the Cross. However, his victory is short-lived as a massive wave crashes over him, knocking him abruptly to the deck. Battling against the powerful forces of nature, Indy manages to rise to his feet once again. With remarkable agility, he navigates the treacherous deck, carefully avoiding the large and heavy fuel drums that are sliding dangerously close to him. As several more barrels threaten him, he adeptly turns around in one fluid movement and delivers a powerful punch that incapacitates the two sailors. His keen eyes then spot a large Stevedore's hook hanging above him. Seizing the opportunity, Indy climbs onto a stack of crates to reach it. Grasping the hook firmly, he skillfully swings himself across the entire length of the deck, narrowly avoiding another massive wave crashing behind him. With strategic precision, he finally leaps into the tumultuous ocean below, all the while clutching the Cross securely in his hands.\n\nAmidst the chaos on the ship, a giant fuel drum careens out of control, colliding directly with a crate filled with TNT and triggering a catastrophic explosion. The resulting blast sends an enormous, vibrant orange fireball shooting high into the sky. In the aftermath, debris rains down from above, descending like a storm upon the scene. Indy, rising to the surface of the water amidst the floating wreckage, still holds the Cross firmly in his grasp. He reaches out desperately, grabbing onto anything within reach to keep him afloat amidst the ongoing chaos.\n\nSimultaneously, students amble leisurely along the scenic, brick-lined pathways shaded by lush trees, dressed in their fashionable, professorial tweeds. In a classroom setting, Indy stands before his attentive and engaged students, where laughter fills the air, creating an energetic atmosphere. Marcus Brody, approaching the classroom, peers through the window in the door to observe Indy as he concludes his lecture. Brody then quietly enters the lecture hall, positioning himself discreetly at the back of the room. As Indy stands at his desk, the students begin to disperse one by one. A pretty coed leaves a note on his desk, and as Brody approaches, the last of the students trickle out of the lecture hall, leaving the room quiet.\n\nIndy carefully removes the cloth-wrapped Cross from his desk, placing it meticulously on the surface, and removes his glasses while Brody examines their precious and valuable find. Indy then gathers his assortment of books with care and heads towards the door, turning to glance back at Brody, who is now holding the Cross. Indy takes possession of the substantial stack of term papers and turns towards his private office. Once inside the office, he approaches his desk to discover a thick envelope with a distinctive and intriguing foreign postmark resting there. Indy stuffs the mail into his coat pockets efficiently, makes his way to the window, slides it open smoothly, and steps out into the serene and peaceful garden below. He makes his escape through the lush garden, walking briskly towards the bustling street, a smile stretching across his face as he relishes the feeling of newfound freedom and liberation.\n\nAs Indy reaches the curb, a long, sleek black Packard sedan glides to a stop before him. Three men emerge from the vehicle, and Indy is promptly ushered into a spacious and elegantly designed Art Deco apartment, where he finds himself standing alone among a collection of museum-quality artifacts that are artfully displayed around the room. After a brief moment of solitude, Walter Donovan enters from across the room. During the short interval when the door is ajar, the lively sounds of a cocktail party—voices mingling harmoniously with the strains of soft music—waft in from the adjacent room, adding a touch of elegance to the atmosphere."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Indy swiftly grabs the crowbar with a determined grip, preparing himself for the impending confrontation, and expertly fends off two sailors who simultaneously attack him from either side with quick, forceful motions. During the scuffle, his eyes catch sight of the Cross teetering dangerously close to the edge of the ship, seemingly ready to be swept overboard by the turbulent sea, prompting him to lunge forward with urgency. He successfully snatches up the Cross, securing it in his grasp, only to be unexpectedly knocked down to the hard deck surface by a giant wave crashing over him. Battling against the deluge, Indy struggles back to his feet, instinctively dodging the massive fuel drums that slide precariously across the deck around him. As several more heavy drums come barreling his way, he deftly maneuvers himself to avoid them. He quickly turns around and, with precise accuracy, lands a powerful punch that simultaneously takes out two sailors obstructing his path. Spotting a large Stevedore's hook hanging overhead, Indy climbs up on stacked crates to reach it, focusing all his strength and agility to grasp the hook. He uses it as an improvised swing, propelling himself fearlessly across the deck and narrowly escaping another enormous wave surging behind him. Timing his release perfectly, he leaps from the hook and plunges into the rollicking ocean below, all the while maintaining his firm hold on the Cross. Onboard the ship, a giant fuel drum continues its chaotic path, rolling wildly and colliding directly into a crate of TNT, which violently explodes, sending an enormous orange fireball bursting into the sky. As fragments of debris rain down from above, reminiscent of a storm, Indy emerges bobbing in the churning water amidst the scattered wreckage, triumphantly clutching the Cross in his hand. In need of support to stay afloat, he grabs onto whatever debris is within his reach. Transitioning to a serene scene, students meander along brick, tree-lined paths, dressed in traditional professorial tweeds. Inside a classroom, Indy stands confidently before his class, where a moment of shared laughter indicates a successful lecture. Marcus Brody, seeking Indy, approaches the classroom, peering through the window in the door to observe Indy as he completes his lecture. Brody quietly enters the lecture hall, positioning himself at the back of the room as Indy stands by his desk, signaling the class's end as students begin to disperse. A pretty coed discreetly places a note on the desk just as Brody approaches, and with the last of the students exiting, the room quiets. Indy carefully unwraps the cloth protecting the Cross, delicately placing it on his desk, then removes his glasses, allowing Brody to closely examine the artifact. As Brody inspects the Cross, Indy gathers his books, signaling the transition to the next part of his day, moving toward the door before momentarily turning back to see Brody now holding the Cross. Taking possession of the collected term papers, Indy enters his private office, where he promptly heads to his desk, discovering a thick envelope marked with a foreign postmark waiting for him. He stuffs the newly received mail into his coat pockets and approaches the window, sliding it open to step out into the inviting garden. Relishing this brief escape, he briskly walks through the garden toward the street, a smile of contentment on his face as he savors his newfound freedom. Arriving at the curb, a sleek, long black Packard sedan pulls up before him with smooth precision, and three men emerge, ushering him into the luxurious confines of a large Art Deco apartment. Left alone amidst the numerous museum-quality artifacts carefully displayed around the opulent room, he takes a moment to absorb his surroundings. Shortly, Walter Donovan enters the room from the opposite side, and as the door briefly opens, the distant, muffled sounds of a cocktail party—voices and soft music—waft in from the adjacent room."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Indy skillfully uses a crowbar to fend off attacking sailors and quickly retrieves the Cross as it's nearly lost overboard. Despite a giant wave knocking him down, he recovers and navigates the dangerous deck, avoiding sliding fuel drums. After dispatching two sailors with a single punch, Indy spots a Stevedore's hook, climbs crates to reach it, and swings across the deck, evading another massive wave. He leaps into the ocean with the Cross just before a fuel drum causes a catastrophic explosion, sending debris skyward. Later, bobbing in the water, Indy clutches the Cross, seeking something to keep him afloat.\n\nBack on land, amid a serene academic setting, Indy concludes a lecture amidst laughter before Marcus Brody enters the room. As students disperse, a note is discreetly placed on Indy's desk. Indy shows Brody the cloth-wrapped Cross, gathers his materials, and heads to his private office, discovering a thick envelope with a foreign postmark. He secures his mail, exits through a window to the garden, and enjoys a brisk walk to the street, relishing his brief freedom. At the curb, a Packard sedan arrives, and Indy is ushered into an Art Deco apartment filled with museum-quality artifacts. Soon, Walter Donovan enters, with the sounds of a nearby cocktail party faintly audible."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Indy, renowned for his daring exploits in archaeology, grabs a crowbar and fends off two sailors known for their notorious behavior on rough seas who attack him from the sides. He sees that the Cross, a historic artifact believed to be from the early Crusades, is about to be swept overboard and lunges for it. He snatches up the Cross only to be knocked down to the deck by a giant wave generated by the fierce storm surrounding the ship. Indy struggles to his feet, managing to avoid the giant fuel drums that were standard cargo on 20th-century freight ships, sliding across the deck around him as several more drums come his way. Indy turns around and pummels two sailors with one punch, a feat showcasing his years of boxing training, then sees a large Stevedore's hook used for loading heavy cargo above him and climbs up on crates of supplies to reach it. He grabs hold of the hook and uses it to swing all the way across the deck, narrowly avoiding a huge wave behind him, before jumping into the rollicking ocean, still holding onto the Cross, determined to preserve its historical significance. On the ship, a giant fuel drum rolls wildly, falling directly onto a crate of TNT, the volatile explosive material, causing the entire ship to blow, sending an enormous orange fireball into the sky. As bits of debris fall from the sky like rain, reminiscent of a fiery meteor shower, Indy bobs up in the water amid the debris, holding the Cross in his hand. He grabs for a floating plank, a remnant of the ship's deck, to keep him afloat.\n\nStudents walk along brick, tree-lined paths on the historic university campus, while dressed in professorial tweeds, reminiscent of the attire favored in the 1930s, Indy stands before his class, where there is laughter. Marcus Brody, the museum curator and Indy's longtime friend, approaches Indy's classroom and peers through the window in the door to see Indy completing his lecture. Brody enters the lecture hall and stands at the rear of the room as Indy stands at his desk and students begin to disperse. A pretty coed, a student with an apparent admiration for Indy's intellect, puts a note on the desk as Brody approaches, and the last of the students leaves the lecture hall. Indy removes the cloth-wrapped Cross from his desk, a relic he has just returned from recovering, places it on the desk, and takes off his glasses as Brody examines the Cross, admiring its historical value. Indy gathers up his books and makes his way toward the door, turning back toward Brody, now holding the Cross, ensuring his friend understands the magnitude of its discovery. Indy takes the term papers then turns to enter his private office, where he goes to his desk and finds a thick envelope with a foreign postmark, indicating correspondence from a colleague overseas, on it. Indy stuffs his mail into his coat pockets, goes to the window, slides it open, and steps out into the garden, a secluded spot he often escapes to for a moment of peace. He escapes through the garden and walks briskly toward the street, smiling and enjoying his freedom. As he arrives at the curb, a long black Packard sedan, a symbol of luxury during that era, pulls up before him and three men step out, displaying a sense of urgency. Indy is ushered into a large Art Deco apartment, a style popular in the 1920s and 30s, and left alone amid numerous museum-quality artifacts displayed around the room, showcasing the wealth and taste of the apartment's owner. After a moment, Walter Donovan, a prominent businessman known for his interest in antiquities, enters from across the room, and during the brief time that the door is open, we hear a cocktail party going on in the next room with voices and soft sounds, indicative of Donovan's social prowess and his well-connected status."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Indy grabs a crowbar and fends off two sailors who attack him from the sides. He sees that the Cross is about to be swept overboard and lunges for it. He snatches up the Cross only to be knocked down to the deck by a giant wave. Indy struggles to his feet managing to avoid the giant fuel drums sliding across the deck around him. as several more drums come his way Indy turns around and pummels two sailors with one punch then sees a large Stevedore's hook above him and climbs up on crates to reach it. He grabs hold of the hook and uses it to swing all the way across the deck narrowly avoiding a huge wave behind him before jumping into the rollicking ocean still holding onto the Cross. On the ship a giant fuel drum rolls wildly falling directly onto a crate of TNT causing the entire ship to blow sending an enormous orange fireball into the sky. As bits of debris fall from the sky like rain Indy bobs up in the water amid the debris holding the Cross in his hand. He grabs for something to keep him afloat. Students walk along brick treelined paths while dressed in professorial tweeds. Indy stands before his class where there is laughter. Marcus Brody approaches Indy's classroom and peers through the window in the door to see Indy completing his lecture. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Brody enters the lecture hall and stands at the rear of the room as Indy stands at his desk and students begin to disperse. A pretty coed puts a note on the desk. as Brody approaches and the last of the students leaves the lecture hall. Indy removes the clothwrapped Cross from his desk places it on the desk and takes off his glasses. as Brody examines the Cross. Indy gathers up his books and makes his way toward the door turning back toward Brody now holding the Cross. Indy takes the term papers then turns to enter his private office where he goes to his desk and finds a thick envelope with a foreign postmark on it. Indy stuffs his mail into his coat pockets goes to the window slides it open and steps out into the garden. He escapes through the garden and walks briskly toward the street smiling and enjoying his freedom. As he arrives at the curb a long black Packard sedan pulls up before him and three men step out. Indy is ushered into a large Art Deco apartment and left alone amid numerous museumquality artifacts displayed around the room. After a moment Walter Donovan enters from across the room and during the brief time that the door is open we hear a cocktail party going on in the next room with voices and soft sounds."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Indy grabs a crowbar and fends off two sailors who attack him from the sides. He sees that the Cross is about to be swept overboard and lunges for it. He snatches up the Cross only to be knocked down to the deck by a giant wave. Indy struggles to his feet managing to avoid the giant fuel drums sliding across the deck around him. as several more drums come his way Indy turns around and pummels two sailors with one punch then sees a large Stevedore's hook above him and climbs up on crates to reach it. He grabs hold of the hook and uses it to swing all the way across the deck narrowly avoiding a huge wave behind him before jumping into the rollicking ocean still holding onto the Cross. On the ship a giant fuel drum rolls wildly falling directly onto a crate of TNT causing the entire ship to blow sending an enormous orange fireball into the sky. As bits of debris fall from the sky like rain Indy bobs up in the water amid the debris holding the Cross in his hand. He grabs for something to keep him afloat. Students walk along brick treelined paths while dressed in professorial tweeds. Indy stands before his class where there is laughter. Marcus Brody approaches Indy's classroom and peers through the window in the door to see Indy completing his lecture. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Brody enters the lecture hall and stands at the rear of the room as Indy stands at his desk and students begin to disperse. A pretty coed puts a note on the desk. as Brody approaches and the last of the students leaves the lecture hall. Indy removes the clothwrapped Cross from his desk places it on the desk and takes off his glasses. as Brody examines the Cross. Indy gathers up his books and makes his way toward the door turning back toward Brody now holding the Cross. Indy takes the term papers then turns to enter his private office where he goes to his desk and finds a thick envelope with a foreign postmark on it. Indy stuffs his mail into his coat pockets goes to the window slides it open and steps out into the garden. He escapes through the garden and walks briskly toward the street smiling and enjoying his freedom. As he arrives at the curb a long black Packard sedan pulls up before him and three men step out. Indy is ushered into a large Art Deco apartment and left alone amid numerous museumquality artifacts displayed around the room. After a moment Walter Donovan enters from across the room and during the brief time that the door is open we hear a cocktail party going on in the next room with voices and soft sounds."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Indy grabs a crowbar and fends off two sailors who attack him from the sides. He sees that the Cross is about to be swept overboard and lunges for it. He snatches up the Cross only to be knocked down to the deck by a giant wave. Indy struggles to his feet managing to avoid the giant fuel drums sliding across the deck around him. as several more drums come his way Indy turns around and pummels two sailors with one punch then sees a large Stevedore's hook above him and climbs up on crates to reach it. He grabs hold of the hook and uses it to swing all the way across the deck narrowly avoiding a huge wave behind him before jumping into the rollicking ocean still holding onto the Cross. Indy takes the term papers then turns to enter his private office where he goes to his desk and finds a thick envelope with a foreign postmark on it. Indy stuffs his mail into his coat pockets goes to the window slides it open and steps out into the garden. He escapes through the garden and walks briskly toward the street smiling and enjoying his freedom. As he arrives at the curb a long black Packard sedan pulls up before him and three men step out. Indy is ushered into a large Art Deco apartment and left alone amid numerous museumquality artifacts displayed around the room. After a moment Walter Donovan enters from across the room and during the brief time that the door is open we hear a cocktail party going on in the next room with voices and soft sounds."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Indy grabs a crowbar and fends off two sailors who attack him from the sides. He sees that the Cross is about to be swept overboard and lunges for it. He snatches up the Cross only to be knocked down to the deck by a giant wave. Indy is ushered into a large Art Deco apartment and left alone amid numerous museumquality artifacts displayed around the room. After a moment Walter Donovan enters from across the room and during the brief time that the door is open we hear a cocktail party going on in the next room with voices and soft sounds."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Bozo grasps a spatula and shoos away two astronauts who charm him from the ceilings. He notices that the Sandwich is about to be tossed into the bonfire and dives for it. He catches hold of the Sandwich only to be lifted up to the roof by a massive balloon. Bozo wobbles to his knees, managing to ignore the massive rubber ducks floating across the roof around him as several more ducks float his way. Bozo spins around and tickles two astronauts with one feather, then spots a tiny Acrobat’s ladder above him and climbs up on cushions to touch it. He clutches the ladder and uses it to slide all the way across the roof, narrowly missing a small kite behind him, before plunging into the bubbling lava, still gripping the Sandwich. On the spaceship, a tiny rubber duck flutters serenely, plummeting directly onto a pillow of marshmallows, causing the entire spaceship to dissolve, sending a gigantic purple cloud into the stratosphere. As pieces of cotton candy drift from the atmosphere like snow, Bozo floats up in the lava amid the cotton candy, clutching the Sandwich in his claw. He reaches for something to keep him airborne. Butterflies flutter along stone, flower-lined avenues, while clad in pirate suits, Bozo sits before his picnic, where there is humming. Marvin Bard enters Bozo’s campsite and watches through the telescope in the fence to see Bozo polishing his marshmallows. Bard wanders into the campsite and sits at the fringes of the field as Bozo sits on his throne and butterflies begin to vanish. A glamorous moth leaves a map on the throne as Bard surprises, and the last of the butterflies exits the campsite. Bozo unveils the velvet-wrapped Sandwich from his throne, places it on the throne, and removes his monocle as Bard surveys the Sandwich. Bozo collects up his balloons and glides toward the meadow, spinning back toward Bard, now holding the Sandwich. Bozo grabs the love letters then whirls to enter his hidden shed, where he dashes to his throne and finds a thin box with a mysterious stamp on it. Bozo packs his chocolates into his scarf pockets, dances to the door, hinges it ajar, and leaps out into the forest. He flees through the forest and dances leisurely toward the mountain, laughing and savoring his journey. As he reaches the ledge, a short blue hovercraft glides up before him and six owls flap out. Bozo is herded into a tiny Gothic greenhouse and left alone amid numerous statue-quality trinkets arrayed around the space. After a second, Harold Dingle saunters in from beyond the space, and during the brief time that the window is open, we catch a fireworks display happening in the adjacent space with music and gentle tunes."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Indy fends off two sailors with a crowbar as a giant wave knocks him down. He grabs the Cross, avoids sliding fuel drums, and swings across the deck using a Stevedore's hook. He leaps into the ocean before the ship explodes, holding the Cross amidst debris. Later, Indy is in a classroom, finishing a lecture before Marcus Brody approaches. Indy reveals the Cross to Brody, then heads to his office, finding a foreign postmarked envelope. He enjoys his newfound freedom by stepping into the garden, but is soon pulled into a long black Packard sedan and taken to a lavish Art Deco apartment filled with museum-quality artifacts. Walter Donovan enters, with hints of a cocktail party heard nearby."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "After a moment Walter Donovan enters from across the room and during the brief time that the door is open we hear a cocktail party going on in the next room with voices and soft sounds Indy is ushered into a large Art Deco apartment and left alone amid numerous museumquality artifacts displayed around the room As he arrives at the curb a long black Packard sedan pulls up before him and three men step out He escapes through the garden and walks briskly toward the street smiling and enjoying his freedom Indy stuffs his mail into his coat pockets goes to the window slides it open and steps out into the garden Indy takes the term papers then turns to enter his private office where he goes to his desk and finds a thick envelope with a foreign postmark on it Indy gathers up his books and makes his way toward the door turning back toward Brody now holding the Cross as Brody examines the Cross Indy removes the clothwrapped Cross from his desk places it on the desk and takes off his glasses as Brody approaches and the last of the students leaves the lecture hall A pretty coed puts a note on the desk Brody enters the lecture hall and stands at the rear of the room as Indy stands at his desk and students begin to disperse Marcus Brody approaches Indy's classroom and peers through the window in the door to see Indy completing his lecture Indy stands before his class where there is laughter Students walk along brick treelined paths while dressed in professorial tweeds He grabs for something to keep him afloat As bits of debris fall from the sky like rain Indy bobs up in the water amid the debris holding the Cross in his hand On the ship a giant fuel drum rolls wildly falling directly onto a crate of TNT causing the entire ship to blow sending an enormous orange fireball into the sky He grabs hold of the hook and uses it to swing all the way across the deck narrowly avoiding a huge wave behind him before jumping into the rollicking ocean still holding onto the Cross as several more drums come his way Indy turns around and pummels two sailors with one punch then sees a large Stevedore's hook above him and climbs up on crates to reach it Indy struggles to his feet managing to avoid the giant fuel drums sliding across the deck around him He snatches up the Cross only to be knocked down to the deck by a giant wave He sees that the Cross is about to be swept overboard and lunges for it Indy grabs a crowbar and fends off two sailors who attack him from the sides"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He sees that the Cross is about to be swept overboard and lunges for it Indy grabs a crowbar and fends off two sailors who attack him from the sides Indy struggles to his feet managing to avoid the giant fuel drums sliding across the deck around him He snatches up the Cross only to be knocked down to the deck by a giant wave He grabs hold of the hook and uses it to swing all the way across the deck narrowly avoiding a huge wave behind him before jumping into the rollicking ocean still holding onto the Cross as several more drums come his way Indy turns around and pummels two sailors with one punch then sees a large Stevedore's hook above him and climbs up on crates to reach it As bits of debris fall from the sky like rain Indy bobs up in the water amid the debris holding the Cross in his hand On the ship a giant fuel drum rolls wildly falling directly onto a crate of TNT causing the entire ship to blow sending an enormous orange fireball into the sky Students walk along brick treelined paths while dressed in professorial tweeds He grabs for something to keep him afloat Marcus Brody approaches Indy's classroom and peers through the window in the door to see Indy completing his lecture Indy stands before his class where there is laughter A pretty coed puts a note on the desk Brody enters the lecture hall and stands at the rear of the room as Indy stands at his desk and students begin to disperse Indy removes the clothwrapped Cross from his desk places it on the desk and takes off his glasses as Brody approaches and the last of the students leaves the lecture hall Indy gathers up his books and makes his way toward the door turning back toward Brody now holding the Cross as Brody examines the Cross Indy stuffs his mail into his coat pockets goes to the window slides it open and steps out into the garden Indy takes the term papers then turns to enter his private office where he goes to his desk and finds a thick envelope with a foreign postmark on it As he arrives at the curb a long black Packard sedan pulls up before him and three men step out He escapes through the garden and walks briskly toward the street smiling and enjoying his freedom After a moment Walter Donovan enters from across the room and during the brief time that the door is open we hear a cocktail party going on in the next room with voices and soft sounds Indy is ushered into a large Art Deco apartment and left alone amid numerous museumquality artifacts displayed around the room"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Brody enters the lecture hall and stands at the rear of the room as Indy stands at his desk and students begin to disperse A pretty coed puts a note on the desk as Brody approaches and the last of the students leaves the lecture hall Indy removes the clothwrapped Cross from his desk places it on the desk and takes off his glasses as Brody examines the Cross Indy gathers up his books and makes his way toward the door turning back toward Brody now holding the Cross Indy takes the term papers then turns to enter his private office where he goes to his desk and finds a thick envelope with a foreign postmark on it Indy stuffs his mail into his coat pockets goes to the window slides it open and steps out into the garden He escapes through the garden and walks briskly toward the street smiling and enjoying his freedom As he arrives at the curb a long black Packard sedan pulls up before him and three men step out Indy is ushered into a large Art Deco apartment and left alone amid numerous museumquality artifacts displayed around the room After a moment Walter Donovan enters from across the room and during the brief time that the door is open we hear a cocktail party going on in the next room with voices and soft sounds Indy grabs a crowbar and fends off two sailors who attack him from the sides He sees that the Cross is about to be swept overboard and lunges for it He snatches up the Cross only to be knocked down to the deck by a giant wave Indy struggles to his feet managing to avoid the giant fuel drums sliding across the deck around him as several more drums come his way Indy turns around and pummels two sailors with one punch then sees a large Stevedore's hook above him and climbs up on crates to reach it He grabs hold of the hook and uses it to swing all the way across the deck narrowly avoiding a huge wave behind him before jumping into the rollicking ocean still holding onto the Cross On the ship a giant fuel drum rolls wildly falling directly onto a crate of TNT causing the entire ship to blow sending an enormous orange fireball into the sky As bits of debris fall from the sky like rain Indy bobs up in the water amid the debris holding the Cross in his hand He grabs for something to keep him afloat Students walk along brick treelined paths while dressed in professorial tweeds Indy stands before his class where there is laughter Marcus Brody approaches Indy's classroom and peers through the window in the door to see Indy completing his lecture"
        }
      ]
    }
  ]
}