{
  "ground_truth": "Indy blows dust away from the tile and tries to pry it up but cannot. He then rushes past Brody to a cordon held by a brass stand underneath the stained-glass window. Indy raises the brass stand and, timing his actions, hits the tile precisely as the Librarian stamps a book. The Librarian regards the stamper curiously while Indy continues to pound at the tile as the Librarian resumes his stamping, still puzzled by the sound echoing through the library. Finally, Indy breaks the tile. As he bends to remove the pieces of broken tile, a two-foot square hole is revealed. Indy is impressed with Elsa's spirit and cooperates agreeably, holding her by the hands and lowering her into the hole. When her feet finally touch ground below, Indy releases his grip on her and slips the Grail Diary to Brody. Then Indy disappears into the hole and jumps down a steep step. He reaches back to help Elsa, and they glance around, noticing the dark and dank surroundings. Elsa removes a cigarette lighter with a unique ivory four-leaf clover design, and Indy and Elsa inspect markings carved onto the walls. Indy takes the lighter from her and lights their way down a dark passageway. Three men carrying guns make their way down the spiral staircase toward an unsuspecting Brody, and one of the men, Kazim, raises his gun and brings it down hard on Brody's head. Indy only has to give it a quick glance to know and holds the lighter up as he and Elsa enter another dark passageway. Indy steps to the wall and runs his hand over the stone, then Elsa holds the lighter as Indy rams his shoulder into the wall. The wall collapses on impact, and Indy falls through into another room onto rocks surrounded by bubbling, green, slimy liquid. More skeletons surround him, resting in their carved niches, as Elsa holds the lighter and peers in at him through the hole in the wall. Indy reaches up, tears a piece of cloth from one of the skeletons, which breaks apart and falls into the oil-slick water. He uses the scrap of cloth and a bone to fashion a crude torch, which he then dips into the oily water. Using the cloth-wrapped bone torch to guide their way, Indy and Elsa come upon a narrow passageway with water knee-deep and teeming with rats, thousands of them crawling on one another's backs and thrashing in the water. Elsa gasps as the rats scamper between her legs, and Indy moves forward through the rat-infested water as Elsa follows, still gasping in horror. Suddenly, Indy slips into a hole, and recovering his balance, he reaches out to Elsa.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Indy exhales particles away from the slab and attempts to lever it up but cannot. He then dashes past Brody to a barrier held by a bronze post beneath the stained-glass pane. Indy lifts the bronze post and, synchronizing his movements, strikes the slab precisely as the Librarian imprints a volume. The Librarian observes the stamper inquisitively while Indy continues to hammer at the slab as the Librarian resumes his imprinting, still perplexed by the noise resonating through the library. Ultimately, Indy fractures the slab. As he bends to remove the fragments of shattered slab, a two-foot square opening is exposed. Indy is impressed with Elsa's mettle and collaborates agreeably, holding her by the hands and lowering her into the opening. When her feet finally make contact with the surface below, Indy relinquishes his grasp on her and passes the Grail Diary to Brody. Then Indy vanishes into the opening and leaps down a steep descent. He reaches back to assist Elsa, and they glance around, noticing the shadowy and damp surroundings. Elsa produces a cigarette igniter with an unusual ivory four-leaf clover motif, and Indy and Elsa examine symbols etched onto the walls. Indy takes the igniter from her and illuminates their path down a dim corridor. Three men wielding firearms make their way down the spiral staircase toward an unknowing Brody, and one of the men, Kazim, lifts his firearm and brings it down forcefully on Brody's head. Indy only has to give it a brief look to understand and holds the igniter aloft as he and Elsa enter another dim corridor. Indy steps to the wall and runs his hand over the stone, then Elsa holds the igniter as Indy thrusts his shoulder into the wall. The wall crumbles on contact, and Indy tumbles through into another chamber onto stones encircled by bubbling, green, viscous liquid. More skeletons surround him, resting in their sculpted alcoves, as Elsa holds the igniter and peers in at him through the gap in the wall. Indy reaches up, rips a piece of fabric from one of the skeletons, which disintegrates and falls into the slick liquid. He uses the scrap of fabric and a bone to create a rudimentary torch, which he then dips into the slick liquid. Using the fabric-wrapped bone torch to navigate their path, Indy and Elsa come upon a narrow corridor with liquid knee-deep and brimming with rodents, thousands of them crawling on one another's backs and flailing in the liquid. Elsa gasps as the rodents scurry between her legs, and Indy advances through the rodent-infested liquid as Elsa follows, still gasping in dread. Abruptly, Indy slips into an opening, and regaining his stability, he reaches out to Elsa."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Dust is blown away from the tile by Indy, and an attempt is made to pry it up by him, but the tile cannot be pried up. The cordon held by a brass stand underneath the stained-glass window is then rushed to by Indy past Brody. The brass stand is raised by Indy, and, with precise timing of his actions, the tile is hit by him exactly as a book is stamped by the Librarian. The stamper is regarded curiously by the Librarian while the tile is continued to be pounded at by Indy as the stamping is resumed by the Librarian, still puzzled by the sound which echoes through the library. Finally, the tile is broken by Indy. As he bends to remove the pieces of broken tile, he reveals a two-foot square hole. Elsa's spirit impresses Indy, and she is cooperatively held by him by the hands and lowered into the hole. When her feet finally touch the ground below, she is released from his grip, and the Grail Diary is slipped to Brody by Indy. Then the hole is disappeared into by Indy, who jumps down a steep step. Elsa is helped by him as he reaches back, and the dark and dank surroundings are noticed by them. A cigarette lighter with a unique ivory four-leaf clover design is removed by Elsa, and the markings carved onto the walls are inspected by Indy and Elsa. The lighter is taken from her by Indy, and their way is lit down a dark passageway. The spiral staircase is made their way down by three men carrying guns toward an unsuspecting Brody, and Brody's head is brought down on hard by Kazim, one of the men, who raises his gun. A quick glance is given by Indy to know, and the lighter is held up by him as another dark passageway is entered by him and Elsa. The wall is stepped to by Indy, and his hand is run over the stone by him, then the lighter is held by Elsa as the wall is rammed by Indy with his shoulder. The wall collapses on impact, and through it, Indy falls into another room onto rocks surrounded by bubbling, green, slimy liquid. More skeletons are surrounded by him, resting in their carved niches, as the lighter is held by Elsa and she peers in at him through the hole in the wall. A piece of cloth is reached up for by Indy, torn from one of the skeletons, which breaks apart and falls into the oil-slick water. A crude torch is fashioned by him using the scrap of cloth and a bone, then it is dipped into the oily water by him. Using the cloth-wrapped bone torch to guide their way, a narrow passageway is come upon by Indy and Elsa with water knee-deep and teeming with rats, thousands of them crawling on one another's backs and thrashing in the water. A gasp is let out by Elsa as the rats scamper between her legs, and the rat-infested water is moved forward through by Indy as she follows, still gasping in horror. Suddenly, a hole is slipped into by Indy, and, recovering his balance, he reaches out to her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Indy blows dust from the tile and tries to pry it up but fails. He rushes past Brody to a cordon with a brass stand under the stained-glass window. Timing his actions, Indy hits the tile as the Librarian stamps a book. The Librarian is puzzled by the echoing sound as Indy breaks the tile, revealing a two-foot square hole. Impressed with Elsa's spirit, Indy lowers her into the hole, then slips the Grail Diary to Brody and jumps down. He helps Elsa, and they notice the dark surroundings. Elsa uses a cigarette lighter with an ivory clover design to inspect wall markings. Indy takes the lighter and leads them down a dark passage. Three armed men descend a spiral staircase toward Brody, and Kazim strikes Brody with a gun. Indy glances back, then holds the lighter as they enter another passage. Indy runs his hand over the stone wall, rams it, and falls into a room with bubbling, green liquid and skeletons. Elsa peers through the hole as Indy tears cloth from a skeleton, making a torch with a bone. Using the torch, they find a narrow passage with knee-deep water and thousands of rats. Elsa gasps as rats scurry between her legs, and Indy moves forward through the rat-infested water, with Elsa following in horror. Indy slips into a hole, recovers, and reaches for Elsa."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Indy blows dust from the tile, tries to pry it up, but fails. He rushes past Brody to a cordon under the stained-glass window, raises the brass stand, and times his hit with the Librarian's book stamp. The Librarian is puzzled by the echoing sound as Indy breaks the tile, revealing a two-foot square hole. Impressed with Elsa's spirit, Indy lowers her into the hole, slips the Grail Diary to Brody, and jumps down. He helps Elsa, and they notice the dark surroundings. Elsa uses a cigarette lighter with an ivory clover design to inspect wall markings. Indy takes the lighter, leading them down a passageway. Three armed men approach Brody, and Kazim knocks him out. Indy and Elsa enter another passageway, where Indy collapses a wall, falling into a room with bubbling green liquid and skeletons. Elsa peers through the hole as Indy makes a torch from cloth and bone. They navigate a narrow, rat-infested passageway, with Elsa gasping as rats scurry around. Indy slips into a hole, regains balance, and reaches for Elsa."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Indy carefully blows the dust away from the ancient tile, attempting to pry it up with determination, but finds himself unable to do so. Frustrated yet undeterred, he quickly rushes past Brody, making his way to a cordon that is held by a brass stand situated beneath the colorful stained-glass window. With precision and timing, Indy raises the brass stand and, in a calculated move, strikes the tile at the exact moment the Librarian stamps a book. The Librarian, intrigued by the unexpected noise, regards the stamper with curiosity while Indy continues to pound persistently at the tile. The Librarian, still puzzled by the echoing sound resonating throughout the library, resumes his stamping. Finally, Indy succeeds in breaking the tile. As he bends down to remove the shattered pieces, a two-foot square hole is revealed beneath. Indy, impressed by Elsa's adventurous spirit, cooperates willingly, holding her securely by the hands and gently lowering her into the newly uncovered hole. Once her feet make contact with the ground below, Indy releases his grip on her and discreetly hands the Grail Diary to Brody. Without hesitation, Indy disappears into the hole, jumping down a steep step. He reaches back to assist Elsa, and together they glance around, taking in the dark and dank surroundings. Elsa retrieves a cigarette lighter, notable for its unique ivory four-leaf clover design, and together, Indy and Elsa examine the markings carved onto the ancient walls. Indy takes the lighter from her, using it to illuminate their path as they venture down a shadowy passageway. Meanwhile, three men armed with guns descend the spiral staircase toward an unsuspecting Brody. One of the men, Kazim, raises his gun and forcefully strikes Brody on the head. Indy, with a quick glance, assesses the situation and holds the lighter aloft as he and Elsa enter yet another dark passageway. Indy steps closer to the wall, running his hand over the cold stone surface, and then Elsa holds the lighter as Indy forcefully rams his shoulder into the wall. The wall collapses upon impact, and Indy tumbles through into another room, landing on rocks surrounded by bubbling, green, slimy liquid. Skeletons, resting in their carved niches, surround him as Elsa peers in through the hole in the wall, holding the lighter. Indy reaches up, tearing a piece of cloth from one of the skeletons, which disintegrates and falls into the oil-slick water below. He ingeniously uses the scrap of cloth and a bone to fashion a makeshift torch, which he then dips into the oily water. With the cloth-wrapped bone torch lighting their way, Indy and Elsa navigate a narrow passageway where the water is knee-deep and teeming with rats, thousands of them crawling over one another and thrashing in the water. Elsa gasps in shock as the rats scurry between her legs, and Indy presses forward through the rat-infested water, with Elsa following closely behind, still gasping in horror. Suddenly, Indy slips into a hidden hole, but quickly regains his balance and reaches out to steady Elsa."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Indy, with meticulous care and focus, gently blows away the fine layer of dust that has settled over the ancient tile, attempting with determination and resolve to pry it up. However, he soon discovers that his efforts are futile, as the tile remains stubbornly in place. Frustrated by his initial attempt, yet not willing to give up, Indy swiftly rushes past Brody, making his way purposefully to a cordon held in place by an ornate, brass stand, which is strategically positioned beneath a brilliantly colorful stained-glass window. With great precision and impeccable timing, Indy raises the brass stand and executes a calculated move, striking the tile precisely at the same moment the Librarian stamps a book. The Librarian, intrigued and somewhat bewildered by the unexpected noise, pauses to regard the stamper with curiosity, while Indy, undeterred and persistent, continues to pound relentlessly at the obstinate tile. The Librarian, still puzzled by the echoing sound resonating throughout the quiet library, eventually resumes his rhythmic stamping. Finally, after several attempts, Indy succeeds in shattering the rugged tile. As he kneels down to carefully remove the fragmented pieces, a sizable two-foot square hole is revealed beneath the now broken surface. Indy, visibly impressed by Elsa's adventurous and daring spirit, willingly cooperates by holding her securely by the hands and gently lowering her into the newly exposed hole. Once her feet firmly make contact with the ground below, Indy releases his grip on her and discreetly hands the Grail Diary to Brody. Without a moment's hesitation, Indy disappears into the cavernous hole, jumping down a steep step with agility. He reaches back to assist Elsa, and together they glance around, taking in the dark, damp, and foreboding surroundings. Elsa retrieves a cigarette lighter, which is notable for its uniquely designed ivory four-leaf clover, and together, Indy and Elsa examine the aged and intricate markings meticulously carved onto the ancient walls. Indy takes the lighter from her, using its flickering flame to illuminate their path as they venture cautiously down a shadowy and mysterious passageway. Meanwhile, three men, all armed with guns, descend the spiral staircase toward an unsuspecting Brody. One of the men, Kazim, aggressively raises his gun and forcefully strikes Brody on the head. Indy, with a swift and discerning glance, assesses the situation and holds the lighter aloft as he and Elsa enter yet another dark and ominous passageway. Indy steps closer to the wall, running his hand gently over the cold, hard stone surface, and then Elsa holds the lighter as Indy forcefully rams his shoulder into the barrier. The wall collapses dramatically upon impact, and Indy tumbles through into another room, landing amidst an array of rocks surrounded by bubbling, green, and slimy liquid. Skeletons, resting eerily in their carved niches, ominously surround him as Elsa peers cautiously through the hole in the wall, holding the lighter to provide illumination. Indy reaches up, tearing a piece of cloth from one of the skeletons, which disintegrates and falls into the oil-slick water below. Ingeniously, he uses the tattered scrap of cloth and a bone to fashion a makeshift torch, which he then dips into the oily water. With the newly fashioned cloth-wrapped bone torch lighting their way, Indy and Elsa navigate a narrow, constricted passageway where the water is knee-deep and teeming with rats—thousands of them crawling over one another and thrashing in the water. Elsa gasps in shock and horror as the rats scurry frantically between her legs, while Indy presses forward through the rat-infested water, with Elsa following closely behind, still gasping in a mixture of disbelief and fear. Suddenly, Indy inadvertently slips into a concealed hole but quickly regains his balance and promptly reaches out to steady Elsa, ensuring their continued progress through the treacherous passageway."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Indy carefully leans forward and gently blows the dust away from the tile, watching as the particles scatter into the air. He then attempts to pry the tile up with his fingers, but despite his efforts, it remains firmly in place. Determined, he quickly moves past Brody, making his way to a cordon held by a brass stand situated beneath the stained-glass window. With a calculated motion, Indy lifts the brass stand, aligning his actions with precision, and strikes the tile at the exact moment the Librarian stamps a book. The Librarian pauses, looking at the stamper with curiosity, while Indy continues to pound on the tile, undeterred by the echoing sound that fills the library. As the Librarian resumes his stamping, still puzzled by the noise, Indy finally succeeds in breaking the tile. He bends down, carefully removing the pieces of broken tile, revealing a two-foot square hole beneath. Impressed by Elsa's adventurous spirit, Indy cooperates willingly, taking her hands and gently lowering her into the hole. Once her feet make contact with the ground below, Indy releases his hold on her and discreetly hands the Grail Diary to Brody. Without hesitation, Indy follows Elsa into the hole, jumping down a steep step. He reaches back to assist Elsa, and together they take in their dark and dank surroundings. Elsa retrieves a cigarette lighter, notable for its unique ivory four-leaf clover design, and she and Indy examine the markings carved into the walls. Indy takes the lighter from her, using it to illuminate their path down a shadowy passageway. Meanwhile, three men armed with guns descend the spiral staircase toward an unsuspecting Brody, and one of them, Kazim, raises his gun and strikes Brody on the head. Indy, with a quick glance, assesses the situation and holds the lighter aloft as he and Elsa enter another dimly lit passageway. Indy approaches the wall, running his hand over the stone surface, and then Elsa holds the lighter as Indy forcefully rams his shoulder into the wall. The wall gives way under the impact, and Indy tumbles through into another room, landing on rocks surrounded by bubbling, green, slimy liquid. Skeletons rest in their carved niches around him, and Elsa, holding the lighter, peers in at him through the hole in the wall. Indy reaches up, tearing a piece of cloth from one of the skeletons, which disintegrates and falls into the oil-slick water. He uses the scrap of cloth and a bone to create a makeshift torch, which he dips into the oily water. With the cloth-wrapped bone torch lighting their way, Indy and Elsa navigate a narrow passageway where the water reaches knee-deep and is swarming with rats, thousands of them crawling over each other and thrashing in the water. Elsa gasps as the rats scurry between her legs, and Indy presses forward through the rat-infested water, with Elsa following, still gasping in horror. Suddenly, Indy loses his footing and slips into a hole, but quickly regains his balance and reaches out to steady Elsa."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Indy attempts to pry up a tile but fails, then cleverly uses a brass stand to break it in sync with the Librarian's stamping, revealing a hole. He assists Elsa into the hole, hands the Grail Diary to Brody, and follows her down. In the dark, dank surroundings, Elsa uses a unique lighter to inspect wall markings. Indy takes the lighter to illuminate their path, while three armed men approach Brody above. Indy and Elsa enter another passageway, where Indy collapses a wall, falling into a room with bubbling, green liquid and skeletons. He fashions a torch from a skeleton's cloth and bone, lighting their way through a rat-infested, knee-deep water passage. Elsa gasps as rats swarm around them, and Indy, after slipping, regains his balance and reaches out to her."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Indy, who is also known as Indiana Jones and is a seasoned archaeologist and adventurer, blows dust away from the tile and tries to pry it up but cannot. He then rushes past Brody, his trusted colleague who is well-versed in ancient artifacts, to a cordon held by a brass stand underneath the stained-glass window that depicts a historical scene from the Crusades. Indy raises the brass stand and, timing his actions with the precision of someone who has navigated many dangerous situations, hits the tile precisely as the Librarian stamps a book, a routine task in this grand, old library known for its rare collections. The Librarian regards the stamper curiously, a device used for decades to mark the library's books, while Indy continues to pound at the tile as the Librarian resumes his stamping, still puzzled by the sound echoing through the library's ancient stone halls. Finally, Indy breaks the tile. As he bends to remove the pieces of broken tile, a two-foot square hole is revealed, leading to one of the many secret passages rumored to be in this historic building. Indy is impressed with Elsa's spirit, a colleague known for her fearless pursuit of knowledge, and cooperates agreeably, holding her by the hands and lowering her into the hole. When her feet finally touch ground below, Indy releases his grip on her and slips the Grail Diary, an invaluable journal containing clues to the Holy Grail's location, to Brody. Then Indy disappears into the hole and jumps down a steep step into what was once an ancient burial chamber. He reaches back to help Elsa, and they glance around, noticing the dark and dank surroundings reminiscent of medieval crypts. Elsa removes a cigarette lighter with a unique ivory four-leaf clover design, symbolizing good luck, and Indy and Elsa inspect markings carved onto the walls, which may hold the key to the next step in their quest. Indy takes the lighter from her and lights their way down a dark passageway, the shadows casting eerie figures on the centuries-old stone. Three men carrying guns, part of a secretive order protecting the Grail's secrets, make their way down the spiral staircase toward an unsuspecting Brody, and one of the men, Kazim, a fierce guardian devoted to the cause, raises his gun and brings it down hard on Brody's head. Indy only has to give it a quick glance to know where they are headed and holds the lighter up as he and Elsa enter another dark passageway. Indy steps to the wall and runs his hand over the stone, worn smooth by time, then Elsa holds the lighter as Indy rams his shoulder into the wall. The wall collapses on impact, revealing a hidden chamber, and Indy falls through into another room onto rocks surrounded by bubbling, green, slimy liquid, an ancient alchemist's concoction preserved through the years. More skeletons surround him, resting in their carved niches, remnants of a bygone era, as Elsa holds the lighter and peers in at him through the hole in the wall. Indy reaches up, tears a piece of cloth from one of the skeletons, which breaks apart and falls into the oil-slick water, originally used to preserve the bodies. He uses the scrap of cloth and a bone to fashion a crude torch, which he then dips into the oily water, igniting it to create a light that flickers off the walls. Using the cloth-wrapped bone torch to guide their way, Indy and Elsa come upon a narrow passageway with water knee-deep, leftover from ancient flooding, and teeming with rats, thousands of them crawling on one another's backs and thrashing in the water, a survival mechanism in the confined space. Elsa gasps as the rats scamper between her legs, and Indy, accustomed to such dangers, moves forward through the rat-infested water as Elsa follows, still gasping in horror. Suddenly, Indy slips into a hole, a trap laid long ago, and recovering his balance, he reaches out to Elsa, ensuring her safety."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Indy blows dust away from the tile and tries to pry it up but cannot. He then rushes past Brody to a cordon held by a brass stand underneath the stainedglass window. Indy raises the brass stand and timing his actions hits the tile precisely as the Librarian stamps a book. The Librarian regards the stamper curiously while Indy continues to pound at the tile. as the Librarian resumes his stamping still puzzled by the sound echoing through the library. Finally Indy breaks the tile. As he bends to remove the pieces of broken tile a twofoot square hole is revealed. Indy is impressed with Elsa's spirit and cooperates agreeably holding her by the hands and lowering her into the hole. When her feet finally touch ground below Indy releases his grip on her and slips the Grail Diary to Brody. Then Indy disappears into the hole and jumps down a steep step. He reaches back to help Elsa and they glance around noticing the dark and dank surroundings. Elsa removes a cigarette lighter with a unique ivory fourleaf clover design and Indy and Elsa inspect markings carved onto the walls. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Indy takes the lighter from her and lights their way down a dark passageway. Three men carrying guns make their way down the spiral staircase toward an unsuspecting Brody and one of the men Kazim raises his gun and brings it down hard on Brody's head. Indy only has to give it a quick glance to know and holds the lighter up as he and Elsa enter another dark passageway. Indy steps to the wall and runs his hand over the stone. then Elsa holds the lighter as Indy rams his shoulder into the wall. The wall collapses on impact and Indy falls through into another room onto rocks surrounded by bubbling green slimy liquid. More skeletons surround him resting in their carved niches as Elsa holds the lighter and peers in at him through the hole in the wall. Indy reaches up tears a piece of cloth from one of the skeletons which breaks apart and falls into the oilslick water. He uses the scrap of cloth and a bone to fashion a crude torch which he then dips into the oily water. Using the clothwrapped bone torch to guide their way Indy and Elsa come upon a narrow passageway with water kneedeep and teeming with rats thousands of them crawling on one another's backs and thrashing in the water. Elsa gasps as the rats scamper between her legs and Indy moves forward through the ratinfested water as Elsa follows still gasping in horror. Suddenly Indy slips into a hole and recovering his balance. he reaches out to Elsa."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Indy blows dust away from the tile and tries to pry it up but cannot. He then rushes past Brody to a cordon held by a brass stand underneath the stainedglass window. Indy raises the brass stand and timing his actions hits the tile precisely as the Librarian stamps a book. The Librarian regards the stamper curiously while Indy continues to pound at the tile. as the Librarian resumes his stamping still puzzled by the sound echoing through the library. Finally Indy breaks the tile. As he bends to remove the pieces of broken tile a twofoot square hole is revealed. Indy is impressed with Elsa's spirit and cooperates agreeably holding her by the hands and lowering her into the hole. When her feet finally touch ground below Indy releases his grip on her and slips the Grail Diary to Brody. Then Indy disappears into the hole and jumps down a steep step. He reaches back to help Elsa and they glance around noticing the dark and dank surroundings. Elsa removes a cigarette lighter with a unique ivory fourleaf clover design and Indy and Elsa inspect markings carved onto the walls. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Indy takes the lighter from her and lights their way down a dark passageway. Three men carrying guns make their way down the spiral staircase toward an unsuspecting Brody and one of the men Kazim raises his gun and brings it down hard on Brody's head. Indy only has to give it a quick glance to know and holds the lighter up as he and Elsa enter another dark passageway. Indy steps to the wall and runs his hand over the stone. then Elsa holds the lighter as Indy rams his shoulder into the wall. The wall collapses on impact and Indy falls through into another room onto rocks surrounded by bubbling green slimy liquid. More skeletons surround him resting in their carved niches as Elsa holds the lighter and peers in at him through the hole in the wall. Indy reaches up tears a piece of cloth from one of the skeletons which breaks apart and falls into the oilslick water. He uses the scrap of cloth and a bone to fashion a crude torch which he then dips into the oily water. Using the clothwrapped bone torch to guide their way Indy and Elsa come upon a narrow passageway with water kneedeep and teeming with rats thousands of them crawling on one another's backs and thrashing in the water. Elsa gasps as the rats scamper between her legs and Indy moves forward through the ratinfested water as Elsa follows still gasping in horror. Suddenly Indy slips into a hole and recovering his balance. he reaches out to Elsa."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Indy blows dust away from the tile and tries to pry it up but cannot. He then rushes past Brody to a cordon held by a brass stand underneath the stainedglass window. Indy raises the brass stand and timing his actions hits the tile precisely as the Librarian stamps a book. The Librarian regards the stamper curiously while Indy continues to pound at the tile. as the Librarian resumes his stamping still puzzled by the sound echoing through the library. Finally Indy breaks the tile. More skeletons surround him resting in their carved niches as Elsa holds the lighter and peers in at him through the hole in the wall. Indy reaches up tears a piece of cloth from one of the skeletons which breaks apart and falls into the oilslick water. He uses the scrap of cloth and a bone to fashion a crude torch which he then dips into the oily water. Using the clothwrapped bone torch to guide their way Indy and Elsa come upon a narrow passageway with water kneedeep and teeming with rats thousands of them crawling on one another's backs and thrashing in the water. Elsa gasps as the rats scamper between her legs and Indy moves forward through the ratinfested water as Elsa follows still gasping in horror. Suddenly Indy slips into a hole and recovering his balance. he reaches out to Elsa."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Indy blows dust away from the tile and tries to pry it up but cannot. He then rushes past Brody to a cordon held by a brass stand underneath the stainedglass window. Elsa gasps as the rats scamper between her legs and Indy moves forward through the ratinfested water as Elsa follows still gasping in horror. Suddenly Indy slips into a hole and recovering his balance. he reaches out to Elsa."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Toby flicks sand away from the cookie and tries to nudge it aside but cannot. He then dashes past Charlie to a ribbon secured by a silver lantern beneath the mosaic ceiling. Toby lifts the silver lantern and, timing his actions, taps the cookie precisely as the Florist stickers a gift. The Florist observes the sticker quizzically while Toby persists in thumping at the cookie as the Florist resumes his sticker placement, still perplexed by the noise resonating through the shop. Finally, Toby cracks the cookie. As he crouches to pull away the pieces of shattered cookie, a two-foot square gap is unveiled. Toby is impressed with Lucy's tenacity and agrees willingly, gripping her by the elbows and lowering her into the gap. When her shoes finally make contact with the surface below, Toby releases his hold on her and hands the Treasure Map to Charlie. Then Toby vanishes into the gap and leaps down a deep stair. He extends a hand back to assist Lucy, and they peer around, noticing the dim and musty environment. Lucy extracts a candle holder with a distinctive ebony three-leaf clover motif, and Toby and Lucy examine symbols etched onto the surfaces. Toby takes the candle holder from her and illuminates their path down a shadowy corridor. Three men wielding mallets journey down the winding ladder toward an oblivious Charlie, and one of the men, Marvin, brandishes his mallet and brings it down sharply on Charlie's shoulder. Toby only has to give it a swift look to know and lifts the candle holder as he and Lucy proceed into another shadowy corridor. Toby steps to the panel and glides his hand over the brick, then Lucy holds the candle holder as Toby thrusts his elbow into the panel. The panel shatters on contact, and Toby tumbles through into another chamber onto rubble encircled by steaming, blue, sticky gel. More statues encircle him, resting in their sculpted alcoves, as Lucy clutches the candle holder and gazes in at him through the breach in the panel. Toby reaches up, rips a piece from one of the statues, which disintegrates and drops into the greasy goo. He employs the fragment and a twig to construct a basic lantern, which he then dips into the greasy goo. Utilizing the fabric-tied twig lantern to navigate, Toby and Lucy encounter a cramped corridor with goo knee-deep and swarming with insects, countless of them skittering on one another's shells and flailing in the goo. Lucy shrieks as the insects dart between her calves, and Toby advances through the insect-saturated goo as Lucy follows, still shrieking in fear. Suddenly, Toby tumbles into an opening, and regaining his stance, he extends a hand to Lucy."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Indy attempts to pry up a tile but can't, so he times his actions with the Librarian's stamping to break it, revealing a hole. He collaborates with Elsa, lowering her into the hole and then slips the Grail Diary to Brody. Indy jumps down after her, and they light a path using Elsa's lighter. Meanwhile, three armed men approach Brody, and Kazim knocks him out. Indy lights their way through a dark passage, eventually collapsing a wall, falling onto rocks surrounded by green, slimy liquid. Surrounded by skeletons, Indy creates a torch from a cloth and bone, leading them through a knee-deep water passage filled with rats. Elsa gasps as rats swarm around her before Indy slips and recovers, reaching for her."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "he reaches out to Elsa Suddenly Indy slips into a hole and recovering his balance  Elsa gasps as the rats scamper between her legs and Indy moves forward through the ratinfested water as Elsa follows still gasping in horror  Using the clothwrapped bone torch to guide their way Indy and Elsa come upon a narrow passageway with water kneedeep and teeming with rats thousands of them crawling on one another's backs and thrashing in the water  He uses the scrap of cloth and a bone to fashion a crude torch which he then dips into the oily water  Indy reaches up tears a piece of cloth from one of the skeletons which breaks apart and falls into the oilslick water  More skeletons surround him resting in their carved niches as Elsa holds the lighter and peers in at him through the hole in the wall  The wall collapses on impact and Indy falls through into another room onto rocks surrounded by bubbling green slimy liquid  then Elsa holds the lighter as Indy rams his shoulder into the wall  Indy steps to the wall and runs his hand over the stone  Indy only has to give it a quick glance to know and holds the lighter up as he and Elsa enter another dark passageway  Three men carrying guns make their way down the spiral staircase toward an unsuspecting Brody and one of the men Kazim raises his gun and brings it down hard on Brody's head  Indy takes the lighter from her and lights their way down a dark passageway  Elsa removes a cigarette lighter with a unique ivory fourleaf clover design and Indy and Elsa inspect markings carved onto the walls  He reaches back to help Elsa and they glance around noticing the dark and dank surroundings  Then Indy disappears into the hole and jumps down a steep step  When her feet finally touch ground below Indy releases his grip on her and slips the Grail Diary to Brody  Indy is impressed with Elsa's spirit and cooperates agreeably holding her by the hands and lowering her into the hole  As he bends to remove the pieces of broken tile a twofoot square hole is revealed  Finally Indy breaks the tile  as the Librarian resumes his stamping still puzzled by the sound echoing through the library  The Librarian regards the stamper curiously while Indy continues to pound at the tile  Indy raises the brass stand and timing his actions hits the tile precisely as the Librarian stamps a book  He then rushes past Brody to a cordon held by a brass stand underneath the stainedglass window  Indy blows dust away from the tile and tries to pry it up but cannot "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He then rushes past Brody to a cordon held by a brass stand underneath the stainedglass window Indy blows dust away from the tile and tries to pry it up but cannot The Librarian regards the stamper curiously while Indy continues to pound at the tile Indy raises the brass stand and timing his actions hits the tile precisely as the Librarian stamps a book Finally Indy breaks the tile as the Librarian resumes his stamping still puzzled by the sound echoing through the library Indy is impressed with Elsa's spirit and cooperates agreeably holding her by the hands and lowering her into the hole As he bends to remove the pieces of broken tile a twofoot square hole is revealed Then Indy disappears into the hole and jumps down a steep step When her feet finally touch ground below Indy releases his grip on her and slips the Grail Diary to Brody Elsa removes a cigarette lighter with a unique ivory fourleaf clover design and Indy and Elsa inspect markings carved onto the walls He reaches back to help Elsa and they glance around noticing the dark and dank surroundings Three men carrying guns make their way down the spiral staircase toward an unsuspecting Brody and one of the men Kazim raises his gun and brings it down hard on Brody's head Indy takes the lighter from her and lights their way down a dark passageway Indy steps to the wall and runs his hand over the stone Indy only has to give it a quick glance to know and holds the lighter up as he and Elsa enter another dark passageway The wall collapses on impact and Indy falls through into another room onto rocks surrounded by bubbling green slimy liquid then Elsa holds the lighter as Indy rams his shoulder into the wall Indy reaches up tears a piece of cloth from one of the skeletons which breaks apart and falls into the oilslick water More skeletons surround him resting in their carved niches as Elsa holds the lighter and peers in at him through the hole in the wall Using the clothwrapped bone torch to guide their way Indy and Elsa come upon a narrow passageway with water kneedeep and teeming with rats thousands of them crawling on one another's backs and thrashing in the water He uses the scrap of cloth and a bone to fashion a crude torch which he then dips into the oily water Suddenly Indy slips into a hole and recovering his balance Elsa gasps as the rats scamper between her legs and Indy moves forward through the ratinfested water as Elsa follows still gasping in horror he reaches out to Elsa"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Three men carrying guns make their way down the spiral staircase toward an unsuspecting Brody and one of the men Kazim raises his gun and brings it down hard on Brody's head  Indy only has to give it a quick glance to know and holds the lighter up as he and Elsa enter another dark passageway  Indy steps to the wall and runs his hand over the stone  then Elsa holds the lighter as Indy rams his shoulder into the wall  The wall collapses on impact and Indy falls through into another room onto rocks surrounded by bubbling green slimy liquid  More skeletons surround him resting in their carved niches as Elsa holds the lighter and peers in at him through the hole in the wall  Indy reaches up tears a piece of cloth from one of the skeletons which breaks apart and falls into the oilslick water  He uses the scrap of cloth and a bone to fashion a crude torch which he then dips into the oily water  Using the clothwrapped bone torch to guide their way Indy and Elsa come upon a narrow passageway with water kneedeep and teeming with rats thousands of them crawling on one another's backs and thrashing in the water  Elsa gasps as the rats scamper between her legs and Indy moves forward through the ratinfested water as Elsa follows still gasping in horror  Suddenly Indy slips into a hole and recovering his balance  he reaches out to Elsa Indy blows dust away from the tile and tries to pry it up but cannot  He then rushes past Brody to a cordon held by a brass stand underneath the stainedglass window  Indy raises the brass stand and timing his actions hits the tile precisely as the Librarian stamps a book  The Librarian regards the stamper curiously while Indy continues to pound at the tile  as the Librarian resumes his stamping still puzzled by the sound echoing through the library  Finally Indy breaks the tile  As he bends to remove the pieces of broken tile a twofoot square hole is revealed  Indy is impressed with Elsa's spirit and cooperates agreeably holding her by the hands and lowering her into the hole  When her feet finally touch ground below Indy releases his grip on her and slips the Grail Diary to Brody  Then Indy disappears into the hole and jumps down a steep step  He reaches back to help Elsa and they glance around noticing the dark and dank surroundings  Elsa removes a cigarette lighter with a unique ivory fourleaf clover design and Indy and Elsa inspect markings carved onto the walls  Indy takes the lighter from her and lights their way down a dark passageway "
        }
      ]
    }
  ]
}