{
  "ground_truth": "She gasps once again, terrified, as Indy lifts her and carries Elsa forward. Kazim and his men step to the opening Indy made earlier and shine their flashlights through to the rat-infested water. More rat-infested water appears as Elsa, now walking again, follows Indy through another passageway lined with skulls and bones. Indy reaches for a wall to steady himself and inadvertently grabs a skeleton, causing a bone to come loose in his hand as rats scurry about and leap at him from all directions. He takes a moment to compose himself, then steps across the water to Elsa's side and helps her into the water. The chamber is flooded with black, briny water as they move toward the altar. Indy and Elsa begin to inspect the ornately carved coffins like the scholars of antiquity that they are, noting the big oak caskets held together by straps of etched brass. One coffin is elevated above the others, and together they begin to push on the lid, straining and groaning until it slides away and bangs against the stone platform, revealing the decomposed remains of a knight in armor. Indy and Elsa look in, and Indy unfolds a piece of paper and holds it over the shield, completing the missing portion of the rubbing. Indy laughs, lights a match, and drops the lighted match into the oil-slick water as Elsa holds the torch. Indy looks around and then sees the glow of firelight dancing across the Catacomb walls. Thousands of rats flee from around the corner of the narrow passageway, stampeding toward Elsa and Indy, shrieking and squealing as they approach. The rats wash over them like a rodent tidal wave in their efforts to escape. Elsa screams, and Indy braces his back against the altar, toppling the coffin with his feet. It crashes against the stone platform and splashes into the water. They jump into the water beside the bobbing, overturned coffin. Indy literally dunks her and pushes her underneath as Elsa surfaces into the air pocket created by the coffin, sputtering and spitting. Indy then pops up into the air pocket and looks at Elsa; they are both soaking wet. Indy disappears under the water and swims out from under the coffin, looking for an escape route, while the rats begin to force their way inside, swimming through the water and climbing on Elsa, who squirms and screams in terror. Indy pops back up through the water, and Elsa groans. They take a deep breath and both dive under the water. The perfect picture postcard of St. Mark's Square and the Grand Canal beyond comes into view.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She breathes once more, frightened, as Indy hoists her and bears Elsa onward. Kazim and his crew stride to the entrance Indy created previously and illuminate their torches through to the vermin-infested liquid. Additional vermin-infested liquid emerges as Elsa, now strolling afresh, trails Indy through another corridor bordered with skulls and bones. Indy reaches for a surface to support himself and unintentionally seizes a skeleton, causing a bone to detach in his grasp as rodents skitter about and spring at him from every direction. He takes an instant to steady himself, then steps across the liquid to Elsa's side and aids her into the liquid. The chamber is inundated with dark, saline liquid as they advance toward the altar. Indy and Elsa commence to examine the elaborately carved sarcophagi like the academics of antiquity that they are, observing the large oak chests secured by bands of engraved brass. One sarcophagus is elevated above the others, and together they commence to shove on the cover, straining and groaning until it slides away and crashes against the stone platform, revealing the decayed remains of a knight in armor. Indy and Elsa gaze in, and Indy unfolds a scrap of paper and holds it over the shield, completing the absent portion of the rubbing. Indy chuckles, ignites a match, and drops the ignited match into the oily liquid as Elsa holds the torch. Indy glances around and then perceives the glow of firelight flickering across the Catacomb walls. Thousands of rodents flee from around the bend of the narrow corridor, stampeding toward Elsa and Indy, shrieking and squealing as they near. The rodents wash over them like a vermin tidal surge in their attempts to flee. Elsa shrieks, and Indy braces his spine against the altar, toppling the sarcophagus with his feet. It crashes against the stone platform and splashes into the liquid. They leap into the liquid beside the bobbing, overturned sarcophagus. Indy literally immerses her and pushes her beneath as Elsa emerges into the air void formed by the sarcophagus, sputtering and spitting. Indy then pops up into the air void and looks at Elsa; they are both drenched. Indy vanishes beneath the liquid and swims out from beneath the sarcophagus, searching for an escape path, while the rodents start to force their way inside, swimming through the liquid and climbing on Elsa, who writhes and shrieks in fright. Indy pops back up through the liquid, and Elsa moans. They take a deep breath and both plunge beneath the liquid. The perfect image postcard of St. Mark's Square and the Grand Canal beyond comes into view."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She gasps once again, terrified, as Elsa is lifted by Indy and carried forward by him. The opening earlier made by Indy is stepped to by Kazim and his men, and their flashlights are shone through to the rat-infested water. More rat-infested water appears as Indy, now walking again, is followed by Elsa through another passageway lined with skulls and bones. A wall is reached for by Indy to steady himself, and a skeleton is inadvertently grabbed by him, causing a bone to come loose in his hand as rats scurry about and leap at him from all directions. A moment is taken by him to compose himself, then Elsa's side is stepped across the water to by him, and she is helped into the water. Black, briny water floods the chamber as the altar is moved toward by them. The ornately carved coffins are inspected by Indy and Elsa like the scholars of antiquity that they are, noting the big oak caskets held together by straps of etched brass. Above the others, one coffin is elevated, and the lid is began to be pushed on together by them, straining and groaning until it slides away and bangs against the stone platform, revealing the decomposed remains of a knight in armor. In is looked by Indy and Elsa, and a piece of paper is unfolded by Indy and held over the shield, completing the missing portion of the rubbing. Indy laughs, lights a match, and the oil-slick water is dropped into by the lighted match as the torch is held by Elsa. Indy looks around and then the glow of firelight is seen by him dancing across the Catacomb walls. From around the corner of the narrow passageway, thousands of rats flee, stampeding toward Elsa and Indy, shrieking and squealing as they approach. They are washed over by the rats like a rodent tidal wave in their efforts to escape. A scream is let out by Elsa, and his back is braced against the altar by Indy, toppling the coffin with his feet. Against the stone platform, it crashes and splashes into the water. Beside the bobbing, overturned coffin, they jump into the water. She is literally dunked and pushed underneath by Indy as the air pocket created by the coffin is surfaced into by Elsa, sputtering and spitting. Indy then pops up into the air pocket and looks at Elsa; they are both soaking wet. Under the water, Indy disappears and swims out from under the coffin, looking for an escape route, while their way inside is begun to be forced by the rats, swimming through the water and climbing on Elsa, who squirms and screams in terror. Through the water, Indy pops back up, and Elsa groans. A deep breath is taken by them, and under the water, they both dive. The perfect picture postcard of St. Mark's Square and the Grand Canal beyond come into view."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Terrified, she gasps as Indy lifts her and carries Elsa forward. Kazim and his men reach the opening Indy made and shine flashlights on the rat-infested water. As more of the water appears, Elsa follows Indy through a passageway lined with skulls. Indy steadies himself on a wall, accidentally pulling a skeleton's bone loose as rats leap. Composing himself, he crosses to Elsa, helping her into the water. The chamber is flooded as they approach the altar, inspecting ornately carved coffins, noting oak caskets with etched brass straps. One elevated coffin is pushed open, revealing a knight's remains. Indy unfolds a paper, completing the rubbing, and lights a match, dropping it into the oily water. Firelight illuminates the Catacomb walls as rats flee, stampeding toward them. Elsa screams, and Indy topples the coffin, splashing into the water. They jump beside it, with Indy dunking Elsa under. She surfaces in an air pocket, sputtering. Indy joins her, both soaking wet. He searches underwater for an escape, as rats swim through and climb on Elsa, who squirms. Indy resurfaces, they breathe deeply, and dive. St. Mark's Square and the Grand Canal come into view."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Terrified, Elsa gasps as Indy carries her forward. Kazim and his men reach the opening Indy made, flashlights revealing rat-infested water. Elsa follows Indy, passing skulls, while Indy steadies himself against a skeleton, accidentally grabbing a bone. Composing himself, Indy helps Elsa into the black, briny water toward an altar. They inspect ornate coffins, noticing oak caskets with etched brass. One elevated coffin's lid slides away, revealing a knight's remains. Indy completes a rubbing with paper, laughs, lights a match, and drops it into the oily water. Firelight dances on the walls as thousands of rats stampede toward them. Elsa screams as Indy topples the coffin into the water. They dive beside it, Elsa surfaces into the air pocket, sputtering. Indy swims out, searching for escape while rats invade, causing Elsa to scream. Indy resurfaces; they both dive underwater. St. Mark's Square and the Grand Canal come into view."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As fear grips her once more, she gasps in terror as Indy lifts her effortlessly and carries Elsa forward, his determination unwavering. Meanwhile, Kazim and his men advance to the opening that Indy had previously created and aim their bright flashlights into the murky depths of the water teeming with rats. The unpleasant sight of even more rat-infested water confronts them as Elsa, now walking with renewed resolve, trails behind Indy through a chilling passageway, its walls grotesquely adorned with skulls and bones. In an attempt to steady himself, Indy reaches for a wall and inadvertently grips a skeleton, carelessly causing a bone to detach and remain in his grasp, while rats scurry about and leap toward him from every conceivable direction. He pauses briefly to regain his composure, then decisively steps across the water to join Elsa, assisting her into the murky liquid. As they move in the direction of the altar, the chamber becomes engulfed in an inundation of dark, salty water. Acting like scholars of ancient times, Indy and Elsa commence their careful examination of the ornately carved coffins, noting with keen interest the large oak caskets held together by intricately etched straps of brass. A notable coffin, elevated above the rest, captures their attention, prompting them to push mightily against its lid. Straining with effort and groaning under the weight, they finally manage to slide it away, allowing it to crash against the stone platform, thereby revealing the decayed remains of a knight clad in armor. Indy unfolds a piece of paper, holding it over the shield to complete the missing portion of the rubbing, a look of satisfaction on his face. He chuckles softly, lights a match, and allows it to fall into the oil-slicked water as Elsa stands by with the torch. Indy surveys their surroundings and soon notices the warm glow of firelight flickering across the Catacomb walls. Suddenly, hordes of rats, driven by panic, come racing around the corner of the narrow passage, hurtling towards Elsa and Indy with frantic energy, their shrieks and squeals echoing ominously. The rats surge over them in a chaotic wave, desperately seeking escape. Elsa's scream pierces the air, while Indy braces himself against the altar with his back, forcefully toppling the coffin with his feet. The coffin crashes heavily against the stone platform before plunging into the water with a loud splash. In an instant, they leap into the water alongside the overturned coffin. Indy urgently submerges Elsa, guiding her beneath the surface until she emerges into the air pocket created by the coffin, sputtering and spitting water. Indy soon surfaces beside her in the air pocket, both drenched to the bone. Without hesitation, Indy dives beneath the water again, swimming out from under the coffin in search of an escape route, while the tenacious rats begin to infiltrate, swimming through the water and climbing onto Elsa, who writhes and screams in terror. Indy returns through the water, and Elsa groans in distress. They inhale deeply and both plunge beneath the water once more. As they emerge, the perfect postcard scene of St. Mark's Square and the majestic Grand Canal beyond comes into view, offering a moment of breathtaking beauty amidst their ordeal."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As fear once again takes hold of her, she gasps in terror, her heart pounding in her chest, as Indy, with unwavering determination, effortlessly lifts her and carries Elsa forward. Meanwhile, at the same time, Kazim and his men move purposefully toward the opening that Indy had previously created, and they direct their bright, beaming flashlights into the murky depths of the water teeming with rats below. The sight of the even more unpleasant, rat-infested water confronts them in a disagreeable manner as Elsa, now walking with a sense of renewed resolve and determination, follows closely behind Indy through a chilling, foreboding passageway, its walls grotesquely and hauntingly adorned with skulls and bones. In an attempt to steady himself, Indy reaches out to the wall for support and inadvertently grips a skeleton, carelessly causing a bone to detach and remain in his grasp, while rats scurry about and leap toward him from every conceivable direction, creating a scene of chaos. He pauses briefly to regain his composure, taking a moment to collect himself, then decisively steps across the water to join Elsa, assisting her into the murky, unwelcoming liquid. As they move purposefully in the direction of the altar, the chamber becomes engulfed in an inundation of dark, salty water. Acting like scholars of ancient times, Indy and Elsa begin their careful, methodical examination of the ornately carved coffins, noting with keen interest and scholarly curiosity the large oak caskets that are held together by intricately etched straps of brass. A notable coffin, elevated above the rest and more prominent than the others, captures their attention, prompting them to push mightily against its lid. Straining with tremendous effort and groaning under the considerable weight, they finally manage to slide it away, allowing it to crash thunderously against the stone platform, thereby revealing the decayed, ancient remains of a knight clad in armor. Indy unfolds a piece of paper and holds it over the shield to complete the missing portion of the rubbing, a look of satisfaction spreading across his face. He chuckles softly to himself, lighting a match and allowing it to fall into the oil-slicked water as Elsa stands by attentively with the torch. Indy surveys their surroundings with a sharp eye and soon notices the warm, flickering glow of firelight dancing across the Catacomb walls. Suddenly, seemingly out of nowhere, hordes of rats, driven by panic, come racing around the corner of the narrow passage with frantic energy, their shrieks and squeals echoing ominously as they hurtle towards Elsa and Indy. The rats surge over them in a chaotic, overwhelming wave, desperately seeking escape from whatever threat they perceive. Elsa's high-pitched scream pierces the air, while Indy braces himself firmly against the altar with his back, forcefully toppling the coffin with a powerful push of his feet. The coffin crashes heavily against the stone platform before plunging into the water with a loud, resounding splash. In an instant, they leap into the water alongside the overturned coffin. Indy urgently submerges Elsa beneath the surface, guiding her until she emerges into the air pocket created by the coffin, sputtering and spitting water as she catches her breath. Indy soon surfaces beside her in the confined air pocket, both of them drenched to the bone and gasping for air. Without hesitation or delay, Indy dives beneath the water again, swimming out from under the coffin in a determined search for an escape route, while the tenacious rats steadily begin to infiltrate, swimming through the water and climbing onto Elsa, who writhes and screams in terror. Indy returns quickly through the water, and Elsa groans in distress. They both inhale deeply in preparation and once again plunge beneath the water. As they emerge from below, the perfect postcard scene of St. Mark's Square and the majestic, iconic Grand Canal beyond comes into view, offering a moment of breathtaking beauty and serene respite amidst their harrowing ordeal."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She inhales sharply, filled with terror, as Indy scoops her up with a firm motion and carries Elsa forward through the dimly lit space. In the meantime, Kazim and his men, maintaining a cautious stance, approach the opening that Indy had previously created and, with deliberate movements, direct their flashlights into the murky, rat-infested water below. As more of this rodent-populated water becomes visible, Elsa regains her footing, now walking alongside Indy, as they progress through another passageway bordered by skulls and bones, adding an eerie atmosphere to their surroundings. Indy extends his hand, seeking stability, and inadvertently grips a skeleton, unexpectedly finding a bone coming loose in his grasp, as the rats scuttle and leap around him from various directions. Momentarily pausing to regain composure, he then carefully steps across the water to reach Elsa’s side, gently assisting her into the water with him. The chamber is soon engulfed in dark, briny water as they steadily advance toward the altar. Together, Indy and Elsa, akin to scholars from antiquity, commence a detailed examination of the ornately carved coffins, observing the large oak caskets that are fastened with straps of beautifully etched brass. Their attention focuses on one particular coffin that is notably elevated above the others, and with combined effort, they begin to push against the lid, straining and emitting groans until it finally slides away with a loud crash against the stone platform, unveiling the decomposed remains of a knight clad in armor. Peering inside, Indy unfolds a piece of paper, carefully positioning it over the shield and thereby completing the missing section of the rubbing. With a chuckle, he lights a match, allowing a brief flicker of amusement to cross his face, before dropping the lit match into the oil-slicked water while Elsa holds the torch aloft. Observing his surroundings, Indy soon notices the firelight’s warm glow dancing across the ancient Catacomb walls. Suddenly, the air is filled with the frantic sound of thousands of rats, fleeing from around the narrow passageway’s corner, stampeding toward Elsa and Indy, their shrieks and squeals growing louder as they draw near. The rats surge over them like a living tidal wave in their frenzied attempt to escape, prompting Elsa to scream in horror. Indy, with quick reflexes, braces his back against the altar, using his feet to topple the coffin with a powerful push. The coffin crashes down onto the stone platform and splashes into the water. With urgency, they jump into the water beside the now bobbing and overturned coffin. In a swift, deliberate motion, Indy submerges Elsa, pushing her beneath the surface, and she emerges into an air pocket created by the coffin, gasping and sputtering. Indy follows suit, appearing into the same air space, where they both find themselves thoroughly soaked. Without delay, Indy disappears once more beneath the water, searching keenly for a possible escape route as the rats begin forcing their way into the water, swimming with determination and clambering onto Elsa, who writhes and shrieks in terror. Moments later, Indy resurfaces through the water, aware of Elsa’s groan of distress. Taking a synchronized deep breath, they both dive beneath the water, their movements blending seamlessly with the perfect picture postcard view of St. Mark's Square and the Grand Canal beyond coming into focus."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Indy lifts Elsa, and they move forward as Kazim and his men investigate the opening Indy previously uncovered, their flashlights illuminating the rat-infested water. Indy and Elsa, now on foot, navigate through a passage lined with skulls and bones. Indy steadies himself against a wall, accidentally pulling a loose bone from a skeleton, while rats scurry and leap around them. After regaining composure, he helps Elsa into the water beside him as they advance towards an altar. Together, they examine the ornately carved coffins, noting the large oak caskets with etched brass straps. They focus on an elevated coffin, pushing the lid until it slides open, revealing a knight’s decomposed remains. Indy matches a piece of paper to the knight's shield, completing a rubbing. He laughs, lights a match, and drops it into the oil-slick water. As Elsa holds the torch, they notice the glow of firelight illuminating the Catacomb walls. Thousands of rats rush toward them, prompting Elsa's scream as Indy topples the coffin with his feet, causing it to splash into the water. They jump in after it, using the coffin for air. Indy ducks underwater, searching for an escape route, while rats begin to infiltrate the air pocket, causing Elsa to squirm. Indy resurfaces momentarily, they both take a deep breath, and then dive underwater as the scene transitions to the picturesque view of St. Mark's Square and the Grand Canal."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She gasps once again, terrified, as Indy, the renowned archaeologist Indiana Jones known for his daring adventures, lifts her and carries Elsa forward. Kazim and his men, members of a secretive order dedicated to protecting ancient relics, step to the opening Indy made earlier and shine their flashlights through to the rat-infested water, reminiscent of the labyrinthine canals of Venice, a city renowned for its intricate waterway system. More rat-infested water appears as Elsa, now walking again, follows Indy through another passageway lined with skulls and bones, a sobering reminder of the catacombs beneath Paris where countless remains of the dead reside. Indy reaches for a wall to steady himself and inadvertently grabs a skeleton, causing a bone to come loose in his hand as rats scurry about, reminiscent of the infamous scenes from horror films, and leap at him from all directions. He takes a moment to compose himself, then steps across the water to Elsa's side and helps her into the water. The chamber is flooded with black, briny water, much like the waters of Venice's canals, as they move toward the altar. Indy and Elsa begin to inspect the ornately carved coffins like the scholars of antiquity that they are, noting the big oak caskets held together by straps of etched brass, similar to those used during the medieval period for knights. One coffin is elevated above the others, possibly signifying its importance, and together they begin to push on the lid, straining and groaning until it slides away and bangs against the stone platform, revealing the decomposed remains of a knight in armor, an echo of the legendary Knights Templar. Indy and Elsa look in, and Indy unfolds a piece of paper and holds it over the shield, completing the missing portion of the rubbing as if solving a puzzle from ancient times. Indy laughs, lights a match, and drops the lighted match into the oil-slick water, which catches fire reminiscent of dramatic Hollywood stunts, as Elsa holds the torch. Indy looks around and then sees the glow of firelight dancing across the Catacomb walls, a scene resembling the flickering shadows in Michelangelo's Sistine Chapel. Thousands of rats flee from around the corner of the narrow passageway, stampeding toward Elsa and Indy, shrieking and squealing as they approach, a veritable rodent exodus akin to the plagues of ancient Egypt. The rats wash over them like a rodent tidal wave in their efforts to escape. Elsa screams, and Indy braces his back against the altar, toppling the coffin with his feet. It crashes against the stone platform and splashes into the water, echoing the chaos of nature facing human disturbance. They jump into the water beside the bobbing, overturned coffin. Indy literally dunks her and pushes her underneath as Elsa surfaces into the air pocket created by the coffin, sputtering and spitting in the manner of those escaping a perilous situation. Indy then pops up into the air pocket and looks at Elsa; they are both soaking wet. Indy disappears under the water and swims out from under the coffin, looking for an escape route, while the rats begin to force their way inside, swimming through the water and climbing on Elsa, who squirms and screams in terror as if in a scene from an Edgar Allan Poe story. Indy pops back up through the water, and Elsa groans. They take a deep breath and both dive under the water. The perfect picture postcard of St. Mark's Square and the Grand Canal beyond comes into view, capturing the serene beauty of Venice's historic heart, known for its stunning architecture and vibrant culture."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She gasps once again terrified as Indy lifts her and carries Elsa forward. Kazim and his men step to the opening Indy made earlier and shine their flashlights through to the ratinfested water. More ratinfested water appears as Elsa now walking again follows Indy through another passageway lined with skulls and bones. Indy reaches for a wall to steady himself and inadvertently grabs a skeleton causing a bone to come loose in his hand as rats scurry about and leap at him from all directions. He takes a moment to compose himself then steps across the water to Elsa's side and helps her into the water. The chamber is flooded with black briny water as they move toward the altar. Indy and Elsa begin to inspect the ornately carved coffins like the scholars of antiquity that they are noting the big oak caskets held together by straps of etched brass. One coffin is elevated above the others and together they begin to push on the lid straining and groaning until it slides away and bangs against the stone platform revealing the decomposed remains of a knight in armor. Indy and Elsa look in and Indy unfolds a piece of paper and holds it over the shield completing the missing portion of the rubbing. Indy laughs lights a match and drops the lighted match into the oilslick water as Elsa holds the torch. Indy looks around and then sees the glow of firelight dancing across the Catacomb walls. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Thousands of rats flee from around the corner of the narrow passageway stampeding toward Elsa and Indy shrieking and squealing as they approach. The rats wash over them like a rodent tidal wave in their efforts to escape. Elsa screams and Indy braces his back against the altar toppling the coffin with his feet. It crashes against the stone platform and splashes into the water. They jump into the water beside the bobbing overturned coffin. Indy literally dunks her and pushes her underneath as Elsa surfaces into the air pocket created by the coffin sputtering and spitting. Indy then pops up into the air pocket and looks at Elsa. they are both soaking wet. Indy disappears under the water and swims out from under the coffin looking for an escape route while the rats begin to force their way inside swimming through the water and climbing on Elsa who squirms and screams in terror. Indy pops back up through the water and Elsa groans. They take a deep breath and both dive under the water. The perfect picture postcard of St Mark's Square and the Grand Canal beyond comes into view."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She gasps once again terrified as Indy lifts her and carries Elsa forward. Kazim and his men step to the opening Indy made earlier and shine their flashlights through to the ratinfested water. More ratinfested water appears as Elsa now walking again follows Indy through another passageway lined with skulls and bones. Indy reaches for a wall to steady himself and inadvertently grabs a skeleton causing a bone to come loose in his hand as rats scurry about and leap at him from all directions. He takes a moment to compose himself then steps across the water to Elsa's side and helps her into the water. The chamber is flooded with black briny water as they move toward the altar. Indy and Elsa begin to inspect the ornately carved coffins like the scholars of antiquity that they are noting the big oak caskets held together by straps of etched brass. One coffin is elevated above the others and together they begin to push on the lid straining and groaning until it slides away and bangs against the stone platform revealing the decomposed remains of a knight in armor. Indy and Elsa look in and Indy unfolds a piece of paper and holds it over the shield completing the missing portion of the rubbing. Indy laughs lights a match and drops the lighted match into the oilslick water as Elsa holds the torch. Indy looks around and then sees the glow of firelight dancing across the Catacomb walls. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Thousands of rats flee from around the corner of the narrow passageway stampeding toward Elsa and Indy shrieking and squealing as they approach. The rats wash over them like a rodent tidal wave in their efforts to escape. Elsa screams and Indy braces his back against the altar toppling the coffin with his feet. It crashes against the stone platform and splashes into the water. They jump into the water beside the bobbing overturned coffin. Indy literally dunks her and pushes her underneath as Elsa surfaces into the air pocket created by the coffin sputtering and spitting. Indy then pops up into the air pocket and looks at Elsa. they are both soaking wet. Indy disappears under the water and swims out from under the coffin looking for an escape route while the rats begin to force their way inside swimming through the water and climbing on Elsa who squirms and screams in terror. Indy pops back up through the water and Elsa groans. They take a deep breath and both dive under the water. The perfect picture postcard of St Mark's Square and the Grand Canal beyond comes into view."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She gasps once again terrified as Indy lifts her and carries Elsa forward. Kazim and his men step to the opening Indy made earlier and shine their flashlights through to the ratinfested water. More ratinfested water appears as Elsa now walking again follows Indy through another passageway lined with skulls and bones. Indy reaches for a wall to steady himself and inadvertently grabs a skeleton causing a bone to come loose in his hand as rats scurry about and leap at him from all directions. He takes a moment to compose himself then steps across the water to Elsa's side and helps her into the water. The chamber is flooded with black briny water as they move toward the altar. Indy then pops up into the air pocket and looks at Elsa. they are both soaking wet. Indy disappears under the water and swims out from under the coffin looking for an escape route while the rats begin to force their way inside swimming through the water and climbing on Elsa who squirms and screams in terror. Indy pops back up through the water and Elsa groans. They take a deep breath and both dive under the water. The perfect picture postcard of St Mark's Square and the Grand Canal beyond comes into view."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She gasps once again terrified as Indy lifts her and carries Elsa forward. Kazim and his men step to the opening Indy made earlier and shine their flashlights through to the ratinfested water. Indy pops back up through the water and Elsa groans. They take a deep breath and both dive under the water. The perfect picture postcard of St Mark's Square and the Grand Canal beyond comes into view."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "She giggles once more, exhilarated, as Max hoists her and transports Lily backward. Diego and his felines stride to the barrier Max constructed earlier and wave their lanterns over to the snake-filled ground. More snake-filled ground emerges as Lily, now running again, trails Max through a corridor lined with feathers and shells. Max reaches for a branch to balance himself and accidentally snatches a vine, causing a fruit to detach in his hand as snakes slither around and pounce at him from all sides. He pauses to gather his thoughts, then hops across the ground to Lily's side and guides her onto the ground. The arena is filled with white, sandy earth as they proceed toward the stage. Max and Lily begin to survey the ornately painted barrels like the poets of old that they are, marveling at the tiny tin containers clasped together by strips of carved silver. One barrel is raised above the rest, and together they attempt to tug on the cover, grunting and groaning until it slides open and clangs against the wooden platform, unveiling the ancient leftovers of a bard in garb. Max and Lily peer inside, and Max unfurls a scroll and waves it over the shield, completing the absent section of the etching. Max chuckles, strikes a flare, and drops the burning flare into the wine-soaked ground as Lily hoists the lantern. Max gazes around and then notices the shimmer of lamplight flickering against the Gallery walls. Hundreds of snakes rush from beyond the bend of the narrow corridor, stampeding toward Lily and Max, hissing and thrashing as they near. The snakes flood over them like a reptile tsunami in their eagerness to flee. Lily shouts, and Max presses his back against the stage, tipping the barrel with his legs. It clatters against the wooden platform and crashes into the ground. They plunge onto the ground beside the floating, upturned barrel. Max literally submerges her and nudges her beneath as Lily emerges into the air pocket formed by the barrel, coughing and gasping. Max then surfaces into the air pocket and glances at Lily; they are both drenched. Max vanishes under the ground and paddles out from under the barrel, searching for an exit, while the snakes begin to force their way inside, slithering through the ground and crawling on Lily, who wriggles and shrieks in fear. Max resurfaces through the ground, and Lily groans. They inhale deeply and both dive under the ground. The vivid imagery of Cloud City and the Diamond River past comes into focus."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Indy lifts Elsa and carries her forward, while Kazim and his men use flashlights to illuminate the rat-infested water. Elsa follows Indy through a passage lined with bones. Indy accidentally grabs a skeleton, steadies himself, and helps Elsa into the water as they approach an altar. They examine ornately carved coffins, noting one elevated above the others. Together, they push the lid away, revealing a knight's decomposed remains. Indy completes a rubbing with a paper piece, laughs, lights a match, and drops it into the oily water. Firelight reflects on the Catacomb walls, prompting thousands of rats to flee, swarming over Indy and Elsa. Elsa screams as Indy overturns a coffin into the water, creating an air pocket they use to breathe. Indy searches underwater for an escape route while rats swarm Elsa. They both dive underwater, emerging into a picturesque view of St. Mark's Square and the Grand Canal."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The perfect picture postcard of St Mark's Square and the Grand Canal beyond comes into view They take a deep breath and both dive under the water Indy pops back up through the water and Elsa groans Indy disappears under the water and swims out from under the coffin looking for an escape route while the rats begin to force their way inside swimming through the water and climbing on Elsa who squirms and screams in terror they are both soaking wet Indy then pops up into the air pocket and looks at Elsa Indy literally dunks her and pushes her underneath as Elsa surfaces into the air pocket created by the coffin sputtering and spitting They jump into the water beside the bobbing overturned coffin It crashes against the stone platform and splashes into the water Elsa screams and Indy braces his back against the altar toppling the coffin with his feet The rats wash over them like a rodent tidal wave in their efforts to escape Thousands of rats flee from around the corner of the narrow passageway stampeding toward Elsa and Indy shrieking and squealing as they approach Indy looks around and then sees the glow of firelight dancing across the Catacomb walls Indy laughs lights a match and drops the lighted match into the oilslick water as Elsa holds the torch Indy and Elsa look in and Indy unfolds a piece of paper and holds it over the shield completing the missing portion of the rubbing One coffin is elevated above the others and together they begin to push on the lid straining and groaning until it slides away and bangs against the stone platform revealing the decomposed remains of a knight in armor Indy and Elsa begin to inspect the ornately carved coffins like the scholars of antiquity that they are noting the big oak caskets held together by straps of etched brass The chamber is flooded with black briny water as they move toward the altar He takes a moment to compose himself then steps across the water to Elsa's side and helps her into the water Indy reaches for a wall to steady himself and inadvertently grabs a skeleton causing a bone to come loose in his hand as rats scurry about and leap at him from all directions More ratinfested water appears as Elsa now walking again follows Indy through another passageway lined with skulls and bones Kazim and his men step to the opening Indy made earlier and shine their flashlights through to the ratinfested water She gasps once again terrified as Indy lifts her and carries Elsa forward"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Kazim and his men step to the opening Indy made earlier and shine their flashlights through to the ratinfested water She gasps once again terrified as Indy lifts her and carries Elsa forward Indy reaches for a wall to steady himself and inadvertently grabs a skeleton causing a bone to come loose in his hand as rats scurry about and leap at him from all directions More ratinfested water appears as Elsa now walking again follows Indy through another passageway lined with skulls and bones The chamber is flooded with black briny water as they move toward the altar He takes a moment to compose himself then steps across the water to Elsa's side and helps her into the water One coffin is elevated above the others and together they begin to push on the lid straining and groaning until it slides away and bangs against the stone platform revealing the decomposed remains of a knight in armor Indy and Elsa begin to inspect the ornately carved coffins like the scholars of antiquity that they are noting the big oak caskets held together by straps of etched brass Indy laughs lights a match and drops the lighted match into the oilslick water as Elsa holds the torch Indy and Elsa look in and Indy unfolds a piece of paper and holds it over the shield completing the missing portion of the rubbing Thousands of rats flee from around the corner of the narrow passageway stampeding toward Elsa and Indy shrieking and squealing as they approach Indy looks around and then sees the glow of firelight dancing across the Catacomb walls Elsa screams and Indy braces his back against the altar toppling the coffin with his feet The rats wash over them like a rodent tidal wave in their efforts to escape They jump into the water beside the bobbing overturned coffin It crashes against the stone platform and splashes into the water Indy then pops up into the air pocket and looks at Elsa Indy literally dunks her and pushes her underneath as Elsa surfaces into the air pocket created by the coffin sputtering and spitting Indy disappears under the water and swims out from under the coffin looking for an escape route while the rats begin to force their way inside swimming through the water and climbing on Elsa who squirms and screams in terror they are both soaking wet They take a deep breath and both dive under the water Indy pops back up through the water and Elsa groans The perfect picture postcard of St Mark's Square and the Grand Canal beyond comes into view"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The rats wash over them like a rodent tidal wave in their efforts to escape Elsa screams and Indy braces his back against the altar toppling the coffin with his feet It crashes against the stone platform and splashes into the water They jump into the water beside the bobbing overturned coffin Indy literally dunks her and pushes her underneath as Elsa surfaces into the air pocket created by the coffin sputtering and spitting Indy then pops up into the air pocket and looks at Elsa they are both soaking wet Indy disappears under the water and swims out from under the coffin looking for an escape route while the rats begin to force their way inside swimming through the water and climbing on Elsa who squirms and screams in terror Indy pops back up through the water and Elsa groans They take a deep breath and both dive under the water The perfect picture postcard of St Mark's Square and the Grand Canal beyond comes into view She gasps once again terrified as Indy lifts her and carries Elsa forward Kazim and his men step to the opening Indy made earlier and shine their flashlights through to the ratinfested water More ratinfested water appears as Elsa now walking again follows Indy through another passageway lined with skulls and bones Indy reaches for a wall to steady himself and inadvertently grabs a skeleton causing a bone to come loose in his hand as rats scurry about and leap at him from all directions He takes a moment to compose himself then steps across the water to Elsa's side and helps her into the water The chamber is flooded with black briny water as they move toward the altar Indy and Elsa begin to inspect the ornately carved coffins like the scholars of antiquity that they are noting the big oak caskets held together by straps of etched brass One coffin is elevated above the others and together they begin to push on the lid straining and groaning until it slides away and bangs against the stone platform revealing the decomposed remains of a knight in armor Indy and Elsa look in and Indy unfolds a piece of paper and holds it over the shield completing the missing portion of the rubbing Indy laughs lights a match and drops the lighted match into the oilslick water as Elsa holds the torch Indy looks around and then sees the glow of firelight dancing across the Catacomb walls Thousands of rats flee from around the corner of the narrow passageway stampeding toward Elsa and Indy shrieking and squealing as they approach"
        }
      ]
    }
  ]
}