{
  "ground_truth": "EDGAR shoves LAUREL out through the driver's door and follows behind her, still holding his weapon on her. Behind him, abandoned on the front seat of the cab, we finally see the front of the postcard he's been carrying around. Jay flips back the plastic cover and jams his finger down on the red flashing button. As the LTD rockets toward the traffic jam up ahead, it begins to evolve, its shape actually changing. It becomes a larger, wirier machine, held together by an elaborate series of mechanical muscles and metallic tendons. Kay's car hurtles toward certain death in the traffic jam, but at the last possible moment, it swerves off to the side, a sucking sound coming from underneath it. Instead of banging off the wall of the tunnel, the LTD actually clings to it. It swerves up, onto the wall and hangs there, racing by the traffic below. It keeps going, turning all the way over and driving upside down, wheels clinging to the roof of the tunnel. Jay falls from his seat with a clunk, onto the upside-down ceiling of the car. Balled up on the back of his neck, he peers out the window as they tear through the tunnel, zooming over the bottlenecked traffic underneath. He reels, momentarily losing his grip on her. She takes advantage of the moment and flings herself out, into the air. Edgar flails, but she is beyond his reach. She falls, tumbling through the air and lands in the branches of a tree. She hits hard, the branches rattling, and reaches out and hangs on for dear life, high above the ground. Above, Edgar just keeps climbing. Over at the fence, the LTD comes to a looooong, skidding stop at the fairgrounds. At the trunk, Jay and Kay flip open the trunk and scarf up whatever weapons look most dangerous. Kay grabs a black box, unsnaps a row of latches, and opens it, revealing the most wicked-looking shotgun on the planet—three feet long, triple-barreled, over and under and under, plus a pump action reloader on top of a storage clip for a dozen more shells. The shells themselves are solid, glistening like polished steel. Kay loads up the clip. But then, there is a vacuum whump, like all the air in the immediate area being sucked into a space the size of a dime, and a tremendous shock wave rolls out from the barrel of the guns. Jay and Kay are sucked to the ground by the bizarre force, thudding to their stomachs like magnets to a refrigerator. The shock waves wrinkle across the open space between them and the ship, then it hits the ship, and it too is sucked back down.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "EDGAR pushes LAUREL out through the driver's door and trails behind her, still gripping his firearm on her. Behind him, deserted on the front seat of the taxi, we finally notice the front of the card he's been hauling around. Jay flicks back the plastic lid and presses his digit down on the crimson blinking button. As the LTD shoots toward the traffic jam up ahead, it commences to transform, its form actually altering. It becomes a larger, wirier apparatus, held together by an intricate sequence of mechanical sinews and metallic ligaments. Kay's vehicle dashes toward certain demise in the traffic jam, but at the last feasible instant, it veers off to the flank, a whooshing noise originating from beneath it. Instead of colliding off the side of the tunnel, the LTD actually adheres to it. It veers up, onto the side and clings there, speeding by the traffic below. It keeps proceeding, rotating completely over and traveling inverted, tires clinging to the ceiling of the tunnel. Jay drops from his seat with a thud, onto the inverted roof of the vehicle. Curled up on the back of his neck, he gazes out the window as they race through the tunnel, zooming over the bottlenecked traffic beneath. He reels, briefly losing his hold on her. She takes advantage of the opportunity and hurls herself out, into the atmosphere. Edgar thrashes, but she is beyond his grasp. She descends, flipping through the air and lands in the limbs of a tree. She impacts hard, the branches shaking, and extends out and clings on for dear life, high above the surface. Above, Edgar just keeps ascending. Over at the fence, the LTD halts to a looooong, sliding stop at the fairgrounds. At the trunk, Jay and Kay flip open the trunk and scoop up whatever armaments appear most menacing. Kay snatches a black case, unsnaps a row of clasps, and opens it, disclosing the most sinister-looking shotgun on the globe—three feet long, triple-barreled, over and under and under, plus a pump-action reloader on top of a storage magazine for a dozen more rounds. The rounds themselves are solid, gleaming like polished steel. Kay loads up the magazine. But then, there is a vacuum whump, like all the air in the immediate vicinity being sucked into a space the size of a dime, and a colossal shock wave rolls out from the barrel of the firearms. Jay and Kay are pulled to the ground by the peculiar force, thumping to their stomachs like magnets to a refrigerator. The shockwaves ripple across the open area between them and the vessel, then it strikes the vessel, and it too is drawn back down."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "EDGAR shoves LAUREL out through the driver's door and follows behind her, still holding his weapon on her. Behind him, left abandoned on the front seat of the cab by him, the front of the postcard he's been carrying around is finally seen. Jay flips back the plastic cover and jams his finger down on the red flashing button. As the traffic jam up ahead is approached by the LTD, it begins to evolve, its shape actually being changed. It becomes a larger, wirier machine, held together by an elaborate series of mechanical muscles and metallic tendons. Certain death in the traffic jam is hurtled toward by Kay's car, but at the last possible moment, it swerves off to the side, and a sucking sound comes from underneath it. Instead of being banged off the wall of the tunnel by the LTD, it clings to it. It is swerved up, onto the wall and hung there, racing by the traffic below. It keeps going, turning all the way over and driving upside down, wheels clinging to the roof of the tunnel. Jay clunks from his seat, onto the upside-down ceiling of the car. Balled up on the back of his neck, the window is peered out by him as they tear through the tunnel, zooming over the bottlenecked traffic underneath. He reels, losing his grip on her momentarily. She takes advantage of the moment and flings herself out, into the air. Edgar flails, but she is beyond his reach. She falls, tumbling through the air, and the branches of a tree catch her. She hits hard, the branches are rattled, and she reaches out and hangs on for dear life, high above the ground. Above, Edgar just keeps climbing. Over at the fence, a looooong, skidding stop at the fairgrounds is come to by the LTD. At the trunk, Jay and Kay flip open the trunk and scarf up whatever weapons look most dangerous. Kay grabs a black box, unsnaps a row of latches, and opens it, revealing the most wicked-looking shotgun on the planet—three feet long, triple-barreled, over and under and under, plus a pump action reloader on top of a storage clip for a dozen more shells. The shells themselves are solid, glistening like polished steel. The clip is loaded up by Kay. But then, a vacuum whump is created, like all the air in the immediate area being sucked into a space the size of a dime, and a tremendous shock wave rolls out from the barrel of the guns. The bizarre force sucks Jay and Kay to the ground, thudding to their stomachs like magnets to a refrigerator. The shock waves wrinkle across the open space between them and the ship; then, it is hit by them, and the ship is sucked back down."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "EDGAR pushes LAUREL out the driver's door, following with his weapon drawn. Abandoned on the cab's front seat, the postcard's front is finally visible. Jay flips the plastic cover and presses the red flashing button. As the LTD speeds toward the traffic jam, it transforms into a larger, wirier machine with mechanical muscles and metallic tendons. Kay's car races toward the jam but swerves at the last moment, clinging to the tunnel wall instead of crashing. It drives upside down, wheels gripping the tunnel roof. Jay falls onto the car's ceiling, peering out as they speed over the traffic. He loses his grip on her momentarily, and she leaps out, landing in a tree. She clings to the branches, high above the ground, while Edgar climbs. The LTD skids to a stop at the fairgrounds. Jay and Kay open the trunk, grabbing dangerous weapons. Kay selects a black box, revealing a three-foot, triple-barreled shotgun with a pump action reloader and a dozen polished steel shells. Kay loads the clip. A vacuum whump occurs, creating a shock wave that pulls Jay and Kay to the ground. The shock wave hits the ship, pulling it down as well."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "EDGAR pushes LAUREL out the driver's door, following with his weapon drawn. The postcard he's carried is left on the cab's front seat. Jay flips a plastic cover and presses a red button. The LTD speeds toward a traffic jam, evolving into a larger machine with mechanical muscles. Kay's car swerves at the last moment, clinging to the tunnel wall, then drives upside down on the roof. Jay falls onto the car's ceiling, watching traffic below. Edgar loses grip on her, and she jumps, landing in a tree. Edgar climbs higher. The LTD skids to a stop at the fairgrounds. Jay and Kay open the trunk, grabbing dangerous weapons. Kay selects a triple-barreled shotgun, loading it with polished steel shells. A vacuum whump occurs, and a shock wave knocks Jay and Kay to the ground. The wave hits the ship, pulling it down."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "EDGAR forcefully shoves LAUREL out through the driver's door, following closely behind her while still keeping his weapon trained on her. Behind him, left abandoned on the front seat of the cab, we finally catch a glimpse of the front of the postcard he has been carrying around all this time. Meanwhile, Jay flips back the plastic cover and decisively jams his finger down on the red flashing button. As the LTD rockets forward toward the looming traffic jam up ahead, it begins to undergo a remarkable transformation, its shape actually changing before our eyes. It morphs into a larger, more wiry machine, held together by an intricate series of mechanical muscles and metallic tendons. Kay's car hurtles toward what seems like certain doom in the traffic jam, but at the very last possible moment, it swerves off to the side, a peculiar sucking sound emanating from underneath it. Instead of crashing into the wall of the tunnel, the LTD astonishingly clings to it. It swerves upward, onto the wall, and hangs there, racing past the traffic below. It continues on its path, turning completely over and driving upside down, with its wheels clinging to the roof of the tunnel. Jay falls from his seat with a clunk, landing on the upside-down ceiling of the car. Balled up on the back of his neck, he peers out the window as they speed through the tunnel, zooming over the bottlenecked traffic beneath them. He reels, momentarily losing his grip on her. She seizes the opportunity and flings herself out into the open air. Edgar flails desperately, but she is already beyond his reach. She falls, tumbling through the air, and lands in the branches of a tree. She hits hard, the branches rattling, and reaches out to hang on for dear life, high above the ground. Above her, Edgar just keeps climbing. Over at the fence, the LTD comes to a looooong, skidding stop at the fairgrounds. At the trunk, Jay and Kay flip open the trunk and quickly grab whatever weapons appear most dangerous. Kay seizes a black box, unsnaps a row of latches, and opens it, revealing the most wicked-looking shotgun on the planet—three feet long, triple-barreled, over and under and under, with a pump action reloader on top of a storage clip for a dozen more shells. The shells themselves are solid, glistening like polished steel. Kay loads up the clip. But then, there is a vacuum whump, like all the air in the immediate vicinity being sucked into a space the size of a dime, and a tremendous shock wave rolls out from the barrel of the guns. Jay and Kay are pulled to the ground by the bizarre force, thudding to their stomachs like magnets to a refrigerator. The shock waves ripple across the open space between them and the ship, and then it hits the ship, which is also sucked back down."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Edgar, with a firm and unyielding motion, forcefully pushes Laurel out through the driver's side door, following her closely while he maintains his intense focus, keeping his weapon aimed steadily at her. Behind Edgar, left neglected on the front seat of the cab, we eventually notice the front of a postcard, revealing a glimpse of what he has been carrying with him all this time. Meanwhile, with determination, Jay flips back the plastic cover and decisively presses his finger down on the red, flashing button. As the LTD accelerates forward at an incredible speed toward the oncoming traffic jam that looms ahead, it undergoes a truly remarkable transformation. Before our very eyes, its shape actually begins to change, morphing into a larger, more wiry machine, held together by an intricate network of mechanical muscles and metallic tendons. Kay's car races toward what appears to be inevitable destruction in the traffic jam, but at the very last possible second, it suddenly veers off to the side, producing an odd sucking noise emanating from underneath it. Instead of smashing into the wall of the tunnel as expected, the LTD astonishingly clings to it. The car swerves upward, maneuvering onto the wall, and persists there, speeding past the congested traffic below. It continues on its path, making a full rotation and driving upside down, its wheels gripping the tunnel's ceiling. Jay falls unceremoniously from his seat with a clunk, landing on the now upside-down ceiling of the vehicle. Balled up awkwardly on the back of his neck, he peers out the window as they continue to speed through the tunnel, zooming above the bottlenecked traffic beneath them. He reels in his position, momentarily losing his grip on her. Seizing this fleeting opportunity, she flings herself out into the open air. Edgar flails desperately in a futile attempt to catch her, but she is already out of his reach. She falls, tumbling through the air, and lands amidst the branches of a tree. She hits the branches hard, causing them to rattle as she reaches out, grabbing on for dear life, high above the ground below. Above her, Edgar keeps climbing upward. Over at the fence, the LTD finally comes to a long, skidding halt at the fairgrounds. At the trunk, Jay and Kay swiftly flip it open, quickly grabbing whatever weapons they deem most dangerous. Kay seizes a black box, unsnapping a row of latches, and opens it, revealing the most wicked-looking shotgun imaginable—three feet long, triple-barreled, over and under and under, complete with a pump action reloader on top of a storage clip designed to hold a dozen more shells. The shells themselves gleam, solid and shiny like polished steel. Kay loads the clip efficiently. But then, there is a powerful vacuum whump, as if all the air in the immediate vicinity is being forcefully sucked into a space no larger than a dime, and a tremendous shock wave explodes out from the barrel of the guns. Jay and Kay are pulled down to the ground by the bizarre and overpowering force, thudding onto their stomachs like magnets to a refrigerator. The shock waves ripple across the open space between them and the ship, and then, astonishingly, it hits the ship, which is also dragged back down in response."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "EDGAR forcefully pushes LAUREL out through the driver's door, ensuring she exits first, and then he quickly follows her, maintaining a firm grip on his weapon, keeping it trained on her to ensure compliance. As he exits, the front seat of the cab is left behind, revealing the front of the postcard he has been carrying, which is now visible to anyone who might glance inside. Meanwhile, Jay decisively flips back the plastic cover, exposing the red flashing button beneath, and with a sense of urgency, he presses his finger down firmly on it. As a result, the LTD accelerates rapidly toward the traffic jam ahead, and during this high-speed approach, it begins to transform, its structure morphing into a larger, more intricate machine composed of mechanical muscles and metallic tendons that interlock seamlessly. As Kay's car speeds toward what seems like an inevitable collision with the traffic jam, it suddenly veers off to the side at the last possible moment, accompanied by a distinctive sucking sound emanating from beneath it. Instead of crashing into the tunnel wall, the LTD astonishingly adheres to it, maneuvering upward onto the wall and maintaining its grip as it races past the congested traffic below. The car continues its daring maneuver, completing a full rotation to drive upside down, with its wheels securely gripping the tunnel's roof. Inside, Jay loses his balance and falls with a thud onto the car's ceiling, now serving as the floor, and from this new vantage point, he peers out the window, observing the tunnel as they speed over the traffic jam below. In the midst of this chaos, he momentarily loses his grip on her, providing her with a fleeting opportunity. Seizing the moment, she propels herself out into the open air, escaping his reach as Edgar desperately tries to grab her but fails. She plummets through the air, eventually landing in the branches of a tree, where she hits with considerable force, causing the branches to shake violently. Despite the impact, she manages to grab hold of the branches, clinging tightly to them high above the ground. Meanwhile, Edgar continues his ascent, undeterred. At the fairgrounds, the LTD comes to an extended, skidding halt near the fence. At the trunk, Jay and Kay swiftly open it and quickly select the most formidable-looking weapons available. Kay selects a black box, deftly unsnaps a series of latches, and opens it to reveal an intimidating shotgun, three feet in length, with triple barrels arranged over and under, and equipped with a pump-action reloader atop a storage clip capable of holding a dozen more shells. The shells themselves are solid and gleam like polished steel. Kay efficiently loads the clip with these shells. Suddenly, a vacuum-like whump occurs, as if all the air in the vicinity is being compressed into a space the size of a dime, followed by a powerful shock wave emanating from the gun barrels. This force pulls Jay and Kay to the ground, causing them to land on their stomachs with a thud, as if they were magnets drawn to a refrigerator. The shock waves ripple across the open space between them and the ship, eventually reaching the ship and pulling it back down as well."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "EDGAR forces LAUREL out through the driver's door, following her with his weapon drawn. Inside the cab, the front of the postcard he's been carrying is visible. Meanwhile, Jay activates a red flashing button, causing the LTD to transform into a larger, more complex machine with mechanical muscles and metallic tendons. As it speeds toward a traffic jam, the car swerves at the last moment, clinging to the tunnel wall and then the ceiling, racing upside down over the traffic. Jay falls onto the car's ceiling and watches as they zoom through the tunnel. In the chaos, Laurel escapes Edgar's grip and leaps into the air, landing in a tree and clinging to the branches. Edgar continues climbing. At the fairgrounds, the LTD skids to a stop, and Jay and Kay quickly arm themselves with weapons from the trunk. Kay selects a formidable triple-barreled shotgun, loads it, and fires, creating a vacuum effect that pulls them to the ground and sends shock waves toward the ship, which is also drawn back down."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "EDGAR, a former military operative known for his tactical skills, shoves LAUREL out through the driver's door and follows behind her, still holding his weapon on her. Just behind him, abandoned on the front seat of the cab, we finally see the front of the postcard he's been carrying around—a faded image of the iconic Empire State Building, symbolizing the hope and dreams of New York City. Jay flips back the plastic cover of the high-tech control panel and jams his finger down on the red flashing button, which is an emergency override used only in critical situations. As the LTD, a vehicle known for its advanced alien technology integrations, rockets toward the traffic jam up ahead, it begins to evolve, its shape actually changing. It becomes a larger, wirier machine, held together by an elaborate series of mechanical muscles and metallic tendons made from an alloy not found on Earth. Kay's car, designed by extraterrestrial engineers for extreme maneuvers, hurtles toward certain death in the traffic jam, but at the last possible moment, it swerves off to the side, a sucking sound coming from underneath it, produced by a gravitational manipulation device. Instead of banging off the wall of the tunnel, the LTD actually clings to it, using an anti-gravity drive. It swerves up, onto the wall and hangs there, racing by the traffic below. It keeps going, turning all the way over and driving upside down, wheels clinging to the roof of the tunnel, using its unique traction control system. Jay falls from his seat with a clunk, onto the upside-down ceiling of the car. Balled up on the back of his neck, he peers out the window as they tear through the tunnel, zooming over the bottlenecked traffic underneath. He reels, momentarily losing his grip on her, Laurel, who was a former gymnast, quickly assesses the situation. She takes advantage of the moment and flings herself out, into the air. Edgar flails, but she is beyond his reach. She falls, tumbling through the air and lands in the branches of a tree known as a century-old oak. She hits hard, the branches rattling, and reaches out and hangs on for dear life, high above the ground. Above, Edgar just keeps climbing. Over at the fence of the historic city fairgrounds, the LTD comes to a looooong, skidding stop. At the trunk, Jay and Kay flip open the trunk and scarf up whatever weapons look most dangerous. Kay grabs a black box, unsnaps a row of latches, and opens it, revealing the most wicked-looking shotgun on the planet—three feet long, triple-barreled, over and under and under, plus a pump action reloader on top of a storage clip for a dozen more shells, designed by a top-secret weapons manufacturer known for its cutting-edge armaments. The shells themselves are solid, glistening like polished steel, made from an extraterrestrial metal. Kay loads up the clip. But then, there is a vacuum whump, like all the air in the immediate area being sucked into a space the size of a dime, and a tremendous shock wave rolls out from the barrel of the guns. Jay and Kay are sucked to the ground by the bizarre force, thudding to their stomachs like magnets to a refrigerator. The shock waves wrinkle across the open space between them and the ship, then it hits the ship, a rogue alien craft, and it too is sucked back down."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "EDGAR shoves LAUREL out through the driver's door and follows behind her still holding his weapon on her. Behind him abandoned on the front seat of the cab we finally see the front of the postcard he is been carrying around. Jay flips back the plastic cover and jams his finger down on the red flashing button. As the LTD rockets toward the traffic jam up ahead it begins to evolve its shape actually changing. It becomes a larger wirier machine held together by an elaborate series of mechanical muscles and metallic tendons. Kay's car hurtles toward certain death in the traffic jam but at the last possible moment it swerves off to the side a sucking sound coming from underneath it. Instead of banging off the wall of the tunnel the LTD actually clings to it. It swerves up onto the wall and hangs there racing by the traffic below. It keeps going turning all the way over and driving upside down wheels clinging to the roof of the tunnel. Jay falls from his seat with a clunk onto the upsidedown ceiling of the car. Balled up on the back of his neck he peers out the window as they tear through the tunnel zooming over the bottlenecked traffic underneath. He reels momentarily losing his grip on her. She takes advantage of the moment and flings herself out into the air. Edgar flails but she is beyond his reach. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. She falls tumbling through the air and lands in the branches of a tree. She hits hard the branches rattling and reaches out and hangs on for dear life high above the ground. Above. Edgar just keeps climbing. Over at the fence. the LTD comes to a looooong skidding stop at the fairgrounds. At the trunk Jay and Kay flip open the trunk and scarf up whatever weapons look most dangerous. Kay grabs a black box unsnaps a row of latches and opens it revealing the most wickedlooking shotgun on the planet—three feet long triplebarreled over and under and under plus a pump action reloader on top of a storage clip for a dozen more shells. The shells themselves are solid glistening like polished steel. Kay loads up the clip. But then there is a vacuum whump like all the air in the immediate area being sucked into a space the size of a dime and a tremendous shock wave rolls out from the barrel of the guns. Jay and Kay are sucked to the ground by the bizarre force thudding to their stomachs like magnets to a refrigerator. The shock waves wrinkle across the open space between them and the ship. then it hits the ship and it too is sucked back down."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "EDGAR shoves LAUREL out through the driver's door and follows behind her still holding his weapon on her. Behind him abandoned on the front seat of the cab we finally see the front of the postcard he is been carrying around. Jay flips back the plastic cover and jams his finger down on the red flashing button. As the LTD rockets toward the traffic jam up ahead it begins to evolve its shape actually changing. It becomes a larger wirier machine held together by an elaborate series of mechanical muscles and metallic tendons. Kay's car hurtles toward certain death in the traffic jam but at the last possible moment it swerves off to the side a sucking sound coming from underneath it. Instead of banging off the wall of the tunnel the LTD actually clings to it. It swerves up onto the wall and hangs there racing by the traffic below. It keeps going turning all the way over and driving upside down wheels clinging to the roof of the tunnel. Jay falls from his seat with a clunk onto the upsidedown ceiling of the car. Balled up on the back of his neck he peers out the window as they tear through the tunnel zooming over the bottlenecked traffic underneath. He reels momentarily losing his grip on her. She takes advantage of the moment and flings herself out into the air. Edgar flails but she is beyond his reach. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. She falls tumbling through the air and lands in the branches of a tree. She hits hard the branches rattling and reaches out and hangs on for dear life high above the ground. Above. Edgar just keeps climbing. Over at the fence. the LTD comes to a looooong skidding stop at the fairgrounds. At the trunk Jay and Kay flip open the trunk and scarf up whatever weapons look most dangerous. Kay grabs a black box unsnaps a row of latches and opens it revealing the most wickedlooking shotgun on the planet—three feet long triplebarreled over and under and under plus a pump action reloader on top of a storage clip for a dozen more shells. The shells themselves are solid glistening like polished steel. Kay loads up the clip. But then there is a vacuum whump like all the air in the immediate area being sucked into a space the size of a dime and a tremendous shock wave rolls out from the barrel of the guns. Jay and Kay are sucked to the ground by the bizarre force thudding to their stomachs like magnets to a refrigerator. The shock waves wrinkle across the open space between them and the ship. then it hits the ship and it too is sucked back down."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "EDGAR shoves LAUREL out through the driver's door and follows behind her still holding his weapon on her. Behind him abandoned on the front seat of the cab we finally see the front of the postcard he is been carrying around. Jay flips back the plastic cover and jams his finger down on the red flashing button. As the LTD rockets toward the traffic jam up ahead it begins to evolve its shape actually changing. It becomes a larger wirier machine held together by an elaborate series of mechanical muscles and metallic tendons. Kay's car hurtles toward certain death in the traffic jam but at the last possible moment it swerves off to the side a sucking sound coming from underneath it. Instead of banging off the wall of the tunnel the LTD actually clings to it. Kay grabs a black box unsnaps a row of latches and opens it revealing the most wickedlooking shotgun on the planet—three feet long triplebarreled over and under and under plus a pump action reloader on top of a storage clip for a dozen more shells. The shells themselves are solid glistening like polished steel. Kay loads up the clip. But then there is a vacuum whump like all the air in the immediate area being sucked into a space the size of a dime and a tremendous shock wave rolls out from the barrel of the guns. Jay and Kay are sucked to the ground by the bizarre force thudding to their stomachs like magnets to a refrigerator. The shock waves wrinkle across the open space between them and the ship. then it hits the ship and it too is sucked back down."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "EDGAR shoves LAUREL out through the driver's door and follows behind her still holding his weapon on her. Behind him abandoned on the front seat of the cab we finally see the front of the postcard he is been carrying around. Jay flips back the plastic cover and jams his finger down on the red flashing button. Jay and Kay are sucked to the ground by the bizarre force thudding to their stomachs like magnets to a refrigerator. The shock waves wrinkle across the open space between them and the ship. then it hits the ship and it too is sucked back down."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "HENRY nudges VIOLET over through the passenger's window and slides after her, still clutching his umbrella on her. Beside him, discarded on the back cushion of the sofa, we eventually notice the back of the notecard he's been dragging around. Max snaps back the rubber lid and smacks his knuckle down on the green blinking switch. As the RAV charges toward the construction zone ahead, it starts to transform, its outline actually shifting. It becomes a bulkier, stockier contraption, held together by a complex network of electronic sinews and aluminum tendrils. Dan's van speeds toward inevitable doom in the construction zone, but at the final conceivable second, it veers off to the corner, a hissing sound emanating from above it. Instead of crashing off the edge of the corridor, the RAV actually adheres to it. It veers up, onto the ceiling and sticks there, gliding by the obstacles below. It continues moving, flipping entirely over and driving right-side up, tires gripping the floor of the corridor. Max slips from his perch with a thud, onto the right-side-up floor of the van. Curled up on the base of his knee, he gawks out the screen as they whiz through the corridor, soaring past the congested bottleneck overhead. He stumbles, temporarily losing his clasp on her. She capitalizes on the occasion and hurls herself inward, onto the ground. Henry thrashes, but she is out of his grasp. She rises, floating through the ground and settles on the leaves of a shrub. She lands softly, the leaves rustling, and grasps out and clamps on for dear existence, low beneath the ceiling. Beneath, Henry just keeps jumping. Near the ladder, the RAV reaches a brief, bouncing pause at the playground. At the handle, Max and Dan pry wide the handle and gulp up whatever tools appear least harmless. Dan snatches a white case, unclasps a row of buttons, and pries it open, exposing the least intimidating-looking broom on the planet—six inches short, single-bristled, behind and next to and next to, plus a lever action retriever under a storage pouch for a dozen fewer nails. The nails themselves are hollow, shimmering like dull copper. Dan unloads the pouch. But then, there is a gusting whoosh, like none of the wind in the distant region being blown out into a void the size of a marble, and a mild whisper stirs out from the muzzle of the sticks. Max and Dan are blown from the ceiling by the ordinary breeze, floating to their backs like paper to a bulletin board. The whispers flutter across the twisted path between them and the wagon, then it strikes the wagon, and it too is blown up."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Edgar pushes Laurel out of the driver's seat, keeping his weapon trained on her while leaving a postcard behind. Jay hits a red button, causing the LTD to transform into a larger machine that clings to the tunnel walls and ceiling, avoiding a traffic jam. Jay tumbles onto the car's ceiling as they speed through the tunnel. Laurel escapes Edgar's grasp, landing in a tree and clinging to the branches. Meanwhile, the LTD stops at the fairgrounds. Jay and Kay open the trunk, grabbing an array of weapons, including a powerful triple-barreled shotgun. Kay loads the shells, and a massive shock wave from the guns' firing pulls them to the ground and impacts the ship."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "then it hits the ship and it too is sucked back down The shock waves wrinkle across the open space between them and the ship  Jay and Kay are sucked to the ground by the bizarre force thudding to their stomachs like magnets to a refrigerator  But then there is a vacuum whump like all the air in the immediate area being sucked into a space the size of a dime and a tremendous shock wave rolls out from the barrel of the guns  Kay loads up the clip  The shells themselves are solid glistening like polished steel  Kay grabs a black box unsnaps a row of latches and opens it revealing the most wickedlooking shotgun on the planet—three feet long triplebarreled over and under and under plus a pump action reloader on top of a storage clip for a dozen more shells  At the trunk Jay and Kay flip open the trunk and scarf up whatever weapons look most dangerous  the LTD comes to a looooong skidding stop at the fairgrounds  Over at the fence  Edgar just keeps climbing  Above  She hits hard the branches rattling and reaches out and hangs on for dear life high above the ground  She falls tumbling through the air and lands in the branches of a tree  Edgar flails but she is beyond his reach  She takes advantage of the moment and flings herself out into the air  He reels momentarily losing his grip on her  Balled up on the back of his neck he peers out the window as they tear through the tunnel zooming over the bottlenecked traffic underneath  Jay falls from his seat with a clunk onto the upsidedown ceiling of the car  It keeps going turning all the way over and driving upside down wheels clinging to the roof of the tunnel  It swerves up onto the wall and hangs there racing by the traffic below  Instead of banging off the wall of the tunnel the LTD actually clings to it  Kay's car hurtles toward certain death in the traffic jam but at the last possible moment it swerves off to the side a sucking sound coming from underneath it  It becomes a larger wirier machine held together by an elaborate series of mechanical muscles and metallic tendons  As the LTD rockets toward the traffic jam up ahead it begins to evolve its shape actually changing  Jay flips back the plastic cover and jams his finger down on the red flashing button  Behind him abandoned on the front seat of the cab we finally see the front of the postcard he's been carrying around  EDGAR shoves LAUREL out through the driver's door and follows behind her still holding his weapon on her "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Behind him abandoned on the front seat of the cab we finally see the front of the postcard he is been carrying around EDGAR shoves LAUREL out through the driver's door and follows behind her still holding his weapon on her As the LTD rockets toward the traffic jam up ahead it begins to evolve its shape actually changing Jay flips back the plastic cover and jams his finger down on the red flashing button Kay's car hurtles toward certain death in the traffic jam but at the last possible moment it swerves off to the side a sucking sound coming from underneath it It becomes a larger wirier machine held together by an elaborate series of mechanical muscles and metallic tendons It swerves up onto the wall and hangs there racing by the traffic below Instead of banging off the wall of the tunnel the LTD actually clings to it Jay falls from his seat with a clunk onto the upsidedown ceiling of the car It keeps going turning all the way over and driving upside down wheels clinging to the roof of the tunnel He reels momentarily losing his grip on her Balled up on the back of his neck he peers out the window as they tear through the tunnel zooming over the bottlenecked traffic underneath Edgar flails but she is beyond his reach She takes advantage of the moment and flings herself out into the air She hits hard the branches rattling and reaches out and hangs on for dear life high above the ground She falls tumbling through the air and lands in the branches of a tree Edgar just keeps climbing Above the LTD comes to a looooong skidding stop at the fairgrounds Over at the fence Kay grabs a black box unsnaps a row of latches and opens it revealing the most wickedlooking shotgun on the planet—three feet long triplebarreled over and under and under plus a pump action reloader on top of a storage clip for a dozen more shells At the trunk Jay and Kay flip open the trunk and scarf up whatever weapons look most dangerous Kay loads up the clip The shells themselves are solid glistening like polished steel Jay and Kay are sucked to the ground by the bizarre force thudding to their stomachs like magnets to a refrigerator But then there is a vacuum whump like all the air in the immediate area being sucked into a space the size of a dime and a tremendous shock wave rolls out from the barrel of the guns then it hits the ship and it too is sucked back down The shock waves wrinkle across the open space between them and the ship"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She falls tumbling through the air and lands in the branches of a tree  She hits hard the branches rattling and reaches out and hangs on for dear life high above the ground  Above  Edgar just keeps climbing  Over at the fence  the LTD comes to a looooong skidding stop at the fairgrounds  At the trunk Jay and Kay flip open the trunk and scarf up whatever weapons look most dangerous  Kay grabs a black box unsnaps a row of latches and opens it revealing the most wickedlooking shotgun on the planet—three feet long triplebarreled over and under and under plus a pump action reloader on top of a storage clip for a dozen more shells  The shells themselves are solid glistening like polished steel  Kay loads up the clip  But then there is a vacuum whump like all the air in the immediate area being sucked into a space the size of a dime and a tremendous shock wave rolls out from the barrel of the guns  Jay and Kay are sucked to the ground by the bizarre force thudding to their stomachs like magnets to a refrigerator  The shock waves wrinkle across the open space between them and the ship  then it hits the ship and it too is sucked back down EDGAR shoves LAUREL out through the driver's door and follows behind her still holding his weapon on her  Behind him abandoned on the front seat of the cab we finally see the front of the postcard he's been carrying around  Jay flips back the plastic cover and jams his finger down on the red flashing button  As the LTD rockets toward the traffic jam up ahead it begins to evolve its shape actually changing  It becomes a larger wirier machine held together by an elaborate series of mechanical muscles and metallic tendons  Kay's car hurtles toward certain death in the traffic jam but at the last possible moment it swerves off to the side a sucking sound coming from underneath it  Instead of banging off the wall of the tunnel the LTD actually clings to it  It swerves up onto the wall and hangs there racing by the traffic below  It keeps going turning all the way over and driving upside down wheels clinging to the roof of the tunnel  Jay falls from his seat with a clunk onto the upsidedown ceiling of the car  Balled up on the back of his neck he peers out the window as they tear through the tunnel zooming over the bottlenecked traffic underneath  He reels momentarily losing his grip on her  She takes advantage of the moment and flings herself out into the air  Edgar flails but she is beyond his reach "
        }
      ]
    }
  ]
}