{
  "ground_truth": "Behind him, six more men in black, all wearing black suits and sunglasses, come over the hill, and Kay barks a few orders to them. He holds up the neuralyzer, and the agents peer closely at it. Kay reaches into his pocket, puts on his own black sunglasses, and pushes a button on the side of the neuralyzer. A blinding flash, a tenth of a second long, sears the agents' eyeballs, and they stare blankly. Kay gestures behind him, where the men in black are now using fire extinguishers to douse the flames they themselves started, and the agents look around, confused. Dee has moved away from them all and is sitting on a rock, staring up at the night sky, his sunglasses dangling idly from one hand. Kay steps away from the group and finds him, sitting down next to him. He looks up at the million stars shining overhead and pulls his neuralyzer from his pocket, looking down at it. These belong to James Edwards, a NYC cop in undercover street clothes. In the background, about ten feet behind, are two other cops trying to keep up, but Edwards is a lot faster. A pair of feet running belongs to a man we will know as the perpetrator. A new set of feet comes into frame as they run down the bridge that traverses Park Avenue in the low forties. The Perp veers to the left and, seemingly oblivious to the fact that it's a thirty-foot drop, he hurdles the guard rail and drops to Forty-first Street below. Edwards is surprised by this maneuver but doesn't waste a second. A double-decker bus, one of those cheesy sightseers that hold up midtown traffic, appears as he too hurdles the guard rail and lands on it. The bus, of course, is completely filled with Japanese tourists, and it seems like every single one of them has a video camera. Edwards pushes through the crowd and pulls out his badge that hangs from a chain under his shirt. Edwards is about to slap the cuffs on the Perp when the Perp blinks. Edwards is thrown for a moment, which is all the time the Perp needs to pull out his weapon, which is the strangest-looking gun you've ever seen. Reacting quickly, Edwards bats it out of the Perp's hand, and the weapon smashes into the stone wall surrounding Central Park and shatters into a million pieces. WHOMP! The Perp kicks him in the nuts, then scrambles to his feet and takes off again. Edwards staggers after him, in pain. The Perp leaps over a moving car towards the Guggenheim Museum; Edwards tries to follow, but a bus pulls in front of him. After it passes, the Perp is gone.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Behind him, six additional males in black, all attired in dark suits and sunglasses, approach over the hill, and Kay shouts a few commands to them. He raises up the neuralyzer, and the operatives peer closely at it. Kay reaches into his pocket, dons his own dark sunglasses, and presses a button on the side of the neuralyzer. A dazzling flash, a tenth of a second long, scorches the operatives' eyeballs, and they gaze blankly. Kay signals behind him, where the males in dark are now using fire suppressors to extinguish the flames they themselves initiated, and the operatives look around, perplexed. Dee has moved away from them all and is sitting on a boulder, gazing up at the night sky, his sunglasses hanging idly from one hand. Kay steps away from the group and discovers him, sitting down adjacent to him. He looks up at the million stars gleaming overhead and draws his neuralyzer from his pocket, gazing down at it. These belong to James Edwards, a NYC officer in undercover street attire. In the background, about ten feet behind, are two additional officers attempting to keep up, but Edwards is far quicker. A pair of feet sprinting belongs to a male we will know as the offender. A new set of feet enters frame as they run down the bridge that spans Park Avenue in the low forties. The Offender swerves to the left and, seemingly unaware of the fact that it's a thirty-foot descent, he leaps the guard rail and descends to Forty-first Street below. Edwards is astonished by this maneuver but doesn't squander a second. A double-decker bus, one of those cheesy sightseers that halt midtown traffic, emerges as he too leaps the guard rail and lands on it. The bus, of course, is completely filled with Japanese sightseers, and it seems like every single one of them has a video camera. Edwards pushes through the throng and pulls out his badge that hangs from a chain under his shirt. Edwards is about to slap the shackles on the Offender when the Offender blinks. Edwards is thrown for a moment, which is all the time the Offender needs to draw out his armament, which is the oddest-looking firearm you've ever seen. Reacting swiftly, Edwards bats it out of the Offender's hand, and the armament crashes into the stone barricade surrounding Central Park and fragments into a million pieces. WHOMP! The Offender kicks him in the groin, then scrambles to his feet and departs again. Edwards staggers after him, in agony. The Offender vaults over a moving vehicle towards the Guggenheim Museum; Edwards attempts to pursue, but a bus pulls in front of him. After it passes, the Offender is vanished."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Behind him, the hill is crossed by six more men in black, all wearing black suits and sunglasses, and a few orders are barked by Kay to them. The neuralyzer is held up by him, and it is closely peered at by the agents. Into his pocket reaches Kay, his own black sunglasses are put on by him, and the side of the neuralyzer is where a button is pushed by him. A blinding flash, a tenth of a second long, sears the agents' eyeballs, and blank stares are given by them. A gesture is made by Kay behind him, where the flames started by the men in black are being doused with fire extinguishers, and confused looks are given around by the agents. From them all, Dee has moved away and is sitting on a rock, with his sunglasses dangling idly from one hand, gazing up at the night sky. The group is stepped away from by Kay, and he finds him, sitting down next to him. The million stars shining overhead are looked up at by him, and his neuralyzer is pulled from his pocket as he looks down at it. James Edwards, a NYC cop in undercover street clothes, owns these. In the background, about ten feet behind, two other cops try to keep up, but Edwards's speed is superior. The perpetrator's identity is known by a man whose feet are running. A new set of feet enters the frame as they run down the bridge traversing Park Avenue in the low forties. To the left veers the Perp, and, seemingly oblivious to the fact that it's a thirty-foot drop, the guard rail is hurdled by him, dropping to Forty-first Street below. This maneuver surprises Edwards, but he doesn't waste a second. A cheesy sightseer double-decker bus, which holds up midtown traffic, appears as the guard rail is hurdled by him too, landing on it. The bus, of course, is filled completely with Japanese tourists, and it seems like every single one of them has a video camera. Through the crowd pushes Edwards and from a chain under his shirt, his badge is pulled out by him. The cuffs are about to be slapped by Edwards on the Perp when a blink is done by the Perp. Edwards is thrown for a moment, which provides the Perp all the time needed to pull out the strangest-looking gun you've ever seen. Reacting quickly, it is batted out of the Perp's hand by Edwards, and the weapon smashes into the stone wall surrounding Central Park and shatters into a million pieces. WHOMP! Edwards is kicked in the nuts by the Perp, who scrambles to his feet and takes off again. The Perp is staggered after by Edwards, in pain. Over a moving car towards the Guggenheim Museum leaps the Perp; following is attempted by Edwards, but in front of him, a bus pulls. After it passes, the Perp has disappeared."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Behind him, six men in black suits and sunglasses come over the hill as Kay gives orders. He holds up the neuralyzer, and the agents examine it. Kay dons his sunglasses, presses a button on the neuralyzer, and a blinding flash leaves the agents staring blankly. Behind him, the men in black extinguish the flames they started, confusing the agents. Dee sits on a rock, gazing at the night sky, sunglasses in hand. Kay joins him, looking at the stars and his neuralyzer. James Edwards, a NYC cop in undercover clothes, runs ahead of two slower cops. The perpetrator, running down a bridge over Park Avenue, veers left and jumps a thirty-foot drop to Forty-first Street. Edwards follows, landing on a double-decker bus filled with Japanese tourists with cameras. He pushes through, showing his badge, and nearly cuffs the Perp, who blinks, distracting Edwards. The Perp pulls a strange gun, but Edwards knocks it away, shattering it against Central Park's stone wall. WHOMP! The Perp kicks Edwards and escapes. Edwards, in pain, chases him as the Perp leaps over a car toward the Guggenheim Museum. A bus blocks Edwards, and the Perp vanishes."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Behind him, six men in black suits and sunglasses come over the hill. Kay gives orders, holds up the neuralyzer, and the agents peer at it. Kay dons his sunglasses, presses a button, and a blinding flash leaves the agents staring blankly. Behind him, men in black extinguish flames they started, confusing the agents. Dee sits on a rock, gazing at the night sky, sunglasses in hand. Kay joins him, looking at the stars and his neuralyzer. James Edwards, a NYC cop in street clothes, runs ahead of two slower cops. The perpetrator veers left, jumps a thirty-foot drop, and Edwards follows, landing on a tourist-filled bus. Edwards pushes through, shows his badge, and is about to cuff the Perp when the Perp blinks. Edwards hesitates, and the Perp draws a strange gun. Edwards knocks it away, shattering it against a stone wall. The Perp kicks Edwards and escapes. Edwards, in pain, chases him, but a bus blocks his path, and the Perp vanishes."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Behind him, a group of six additional men, all clad in identical black suits and wearing dark sunglasses, make their way over the hill. Kay, with authority in his voice, barks a series of orders to them. He then raises the neuralyzer, prompting the agents to peer intently at the device. Kay reaches into his pocket, retrieves his own pair of black sunglasses, and carefully puts them on. With a deliberate motion, he presses a button on the side of the neuralyzer. A blinding flash, lasting only a tenth of a second, sears the agents' eyeballs, leaving them staring blankly into space. Kay gestures behind him, where the men in black are now actively using fire extinguishers to put out the flames they had previously ignited, and the agents look around, bewildered and confused. Meanwhile, Dee has distanced himself from the group and is now sitting on a rock, gazing up at the vast night sky, his sunglasses dangling idly from one hand. Kay steps away from the group and approaches Dee, sitting down beside him. He looks up at the millions of stars twinkling overhead and pulls his neuralyzer from his pocket, contemplating it. These events are connected to James Edwards, a New York City cop dressed in undercover street clothes. In the background, approximately ten feet behind him, are two other police officers struggling to keep up, but Edwards is significantly faster. A pair of feet running belongs to a man we will come to know as the perpetrator. A new set of feet enters the frame as they sprint down the bridge that spans Park Avenue in the low forties. The Perp veers sharply to the left and, seemingly unaware of the thirty-foot drop, he leaps over the guard rail and plummets to Forty-first Street below. Edwards is momentarily taken aback by this daring move but doesn't hesitate for a second. A double-decker bus, one of those touristy sightseers that often clog midtown traffic, appears just as he too vaults over the guard rail and lands on it. The bus, naturally, is packed with Japanese tourists, each seemingly equipped with a video camera. Edwards pushes his way through the crowd and pulls out his badge, which hangs from a chain beneath his shirt. Just as Edwards is about to slap the cuffs on the Perp, the Perp blinks. Edwards is momentarily thrown off, which is all the time the Perp needs to draw his weapon, an incredibly strange-looking gun unlike anything you've ever seen. Reacting with lightning speed, Edwards bats the weapon out of the Perp's hand, and it crashes into the stone wall surrounding Central Park, shattering into countless pieces. WHOMP! The Perp delivers a swift kick to Edwards' groin, then scrambles to his feet and takes off running once more. Edwards, in pain, staggers after him. The Perp leaps over a moving car in the direction of the Guggenheim Museum; Edwards attempts to follow, but a bus pulls in front of him, blocking his path. By the time it passes, the Perp has vanished."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the backdrop, there is a group of six additional men, each one dressed in identical black suits, complete with dark sunglasses, as they make their way over the hill with synchronized precision. Kay, with a tone of undeniable authority, issues a series of sharp commands to these men. Subsequently, he raises the neuralyzer, causing the agents to gaze intently at the peculiar device. Reaching into his pocket, Kay retrieves his own pair of sleek black sunglasses and meticulously puts them on. With a deliberate action, he presses a button on the side of the neuralyzer. A blinding flash, so intense yet lasting just a mere tenth of a second, sears the agents’ eyeballs, leaving them momentarily staring blankly into the void. Kay gestures behind him where the men clad in black are now actively engaged in extinguishing the flames they had previously set ablaze, using fire extinguishers with diligence, and the agents look around, utterly bewildered and confused by the unfolding events. Meanwhile, Dee has distanced himself from the core group and now sits on a rock, gazing contemplatively at the vast expanse of the night sky, his sunglasses casually dangling from one hand. Kay steps away from the group’s hustle and approaches Dee, settling down beside him. Together, they look up at the millions of stars twinkling brilliantly overhead, as Kay pulls his neuralyzer from his pocket, contemplating its significance in the grand scheme of things. These events intertwine with James Edwards, a diligent New York City cop dressed in undercover street clothes. In the background, approximately ten feet behind him, two other police officers are seen struggling to maintain pace, but Edwards is appreciably faster, outpacing them with ease. The running feet belong to a man we will later identify as the perpetrator. Another pair of feet enters the frame as they sprint across the bridge that spans Park Avenue in the low forties. The Perp, without warning, veers sharply to the left and, seemingly oblivious to the thirty-foot drop, vaults over the guard rail and plummets to Forty-first Street below. Edwards is momentarily taken aback by this audacious move, yet he doesn’t hesitate for more than a second. A double-decker bus, one of those touristy sightseers that often congest midtown traffic, appears just in time for him to vault over the guard rail and land squarely on it. The bus, unsurprisingly, is filled to capacity with Japanese tourists, each seemingly armed with a video camera. Edwards pushes his way through the throng and pulls out his badge, which hangs conspicuously from a chain beneath his shirt. Just when Edwards is poised to slap the cuffs on the Perp, the Perp blinks unexpectedly. Edwards is momentarily thrown off by the blink, which is all the time the Perp needs to draw a weapon, an unusually strange-looking gun unlike anything one might have ever seen before. Reacting with lightning-quick speed, Edwards skillfully bats the weapon out of the Perp's grasp, sending it crashing into the stone wall lining Central Park, where it shatters into countless fragments. WHOMP! The Perp delivers a swift and punishing kick to Edwards' groin, then scrambles to his feet and resumes running frantically. Edwards, albeit in pain, gamely staggers after him. The Perp leaps effortlessly over a moving car in the direction of the Guggenheim Museum, while Edwards attempts to follow in hot pursuit, but a bus suddenly pulls in front of him, effectively blocking his path. By the time the obstruction passes, the Perp has vanished into the night."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Behind him, six more men in black, all clad in identical black suits and sunglasses, make their way over the hill, moving in unison as Kay, with a commanding presence, barks a series of concise orders to them. As they gather around, Kay raises the neuralyzer, holding it up for the agents to examine closely, their eyes narrowing in curiosity. With a deliberate motion, Kay reaches into his pocket, retrieves his own pair of black sunglasses, and carefully places them over his eyes. He then extends his finger to press a button on the side of the neuralyzer, triggering a blinding flash that lasts only a tenth of a second, yet is intense enough to sear the agents' eyeballs, leaving them staring blankly into space. Kay gestures behind him, directing attention to the men in black who are now actively using fire extinguishers to put out the flames they had previously ignited, while the agents, still disoriented, look around in confusion. Meanwhile, Dee has distanced himself from the group, finding a solitary spot on a rock where he sits, gazing up at the vast expanse of the night sky, his sunglasses dangling idly from one hand. Observing this, Kay steps away from the group, making his way over to Dee, and settles down beside him. Together, they look up at the million stars twinkling overhead, as Kay pulls his neuralyzer from his pocket once more, contemplating it thoughtfully. In a different scene, James Edwards, a NYC cop dressed in undercover street clothes, is in pursuit, his feet pounding the pavement as he races ahead, with two other cops trailing about ten feet behind, struggling to keep up with his superior speed. The sound of running feet belongs to a man known as the perpetrator, who is sprinting down the bridge that spans Park Avenue in the low forties. As the Perp veers sharply to the left, he appears oblivious to the thirty-foot drop ahead and boldly hurdles the guard rail, plummeting to Forty-first Street below. Edwards, momentarily taken aback by this daring move, quickly regains his composure and doesn't hesitate to follow suit. A double-decker bus, one of those tourist-laden sightseers notorious for clogging midtown traffic, comes into view just as Edwards also hurdles the guard rail, landing deftly on the bus. The bus is packed with Japanese tourists, each seemingly equipped with a video camera, capturing the unfolding drama. Edwards pushes his way through the crowd, reaching for his badge that hangs from a chain beneath his shirt, ready to apprehend the Perp. Just as he is about to slap the cuffs on, the Perp blinks, momentarily throwing Edwards off guard. This brief distraction is all the Perp needs to draw his weapon, an oddly designed gun unlike any other. Reacting with lightning speed, Edwards bats the weapon out of the Perp's hand, sending it hurtling into the stone wall surrounding Central Park, where it shatters into countless pieces. WHOMP! The Perp retaliates with a swift kick to Edwards' groin, causing him to stagger in pain as the Perp scrambles to his feet and takes off once more. Despite the agony, Edwards forces himself to pursue, his determination undeterred. The Perp executes a daring leap over a moving car, heading towards the Guggenheim Museum, while Edwards attempts to follow, only to be thwarted by a bus that pulls in front of him. As the bus moves on, Edwards scans the area, but the Perp has vanished, leaving him momentarily at a loss."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Behind him, six men in black suits and sunglasses appear over the hill as Kay issues orders. He dons his sunglasses, activates the neuralyzer, and the agents are momentarily blinded and disoriented. Meanwhile, the men in black extinguish the flames they started. Dee sits apart, gazing at the night sky with his sunglasses in hand. Kay joins him, contemplating the stars and the neuralyzer.\n\nElsewhere, James Edwards, a NYC cop in undercover attire, races ahead of two fellow officers. The chase leads to a bridge over Park Avenue, where the perpetrator unexpectedly leaps over the guard rail, dropping thirty feet to Forty-first Street. Edwards follows suit, landing on a double-decker bus filled with Japanese tourists, all filming the scene. He navigates through the crowd, displaying his badge, and nearly apprehends the perpetrator. However, the perpetrator draws a bizarre weapon, which Edwards swiftly disarms, shattering it against a stone wall. The perpetrator retaliates with a kick, escaping as Edwards, in pain, pursues him. The chase continues with the perpetrator leaping over a car near the Guggenheim Museum, but a bus obstructs Edwards, allowing the perpetrator to vanish."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Behind him, six more men in black, all wearing black suits and sunglasses reminiscent of the iconic Men in Black uniform from the popular science fiction franchise, come over the hill, and Kay barks a few orders to them. He holds up the neuralyzer, a fictional device used to erase memories in the Men in Black universe, and the agents peer closely at it. Kay reaches into his pocket, puts on his own black sunglasses, which are designed to protect his eyes from the effects of the neuralyzer, and pushes a button on the side of the neuralyzer. A blinding flash, a tenth of a second long, sears the agents' eyeballs, and they stare blankly. Kay gestures behind him, where the men in black are now using fire extinguishers typically found in emergency situations to douse the flames they themselves started, and the agents look around, confused. Dee has moved away from them all and is sitting on a rock, part of the natural landscape, staring up at the night sky, his sunglasses dangling idly from one hand. Kay steps away from the group and finds him, sitting down next to him. He looks up at the million stars shining overhead, part of the vast Milky Way galaxy, and pulls his neuralyzer from his pocket, looking down at it. These belong to James Edwards, a NYC cop known for his quick reflexes, in undercover street clothes. In the background, about ten feet behind, are two other cops trying to keep up, but Edwards is a lot faster, thanks to his athletic prowess. A pair of feet running belongs to a man we will know as the perpetrator, a suspect in a recent series of thefts. A new set of feet comes into frame as they run down the bridge that traverses Park Avenue in the low forties, a busy section of Manhattan. The Perp veers to the left and, seemingly oblivious to the fact that it's a thirty-foot drop, he hurdles the guard rail and drops to Forty-first Street below. Edwards is surprised by this daring maneuver but doesn't waste a second. A double-decker bus, one of those cheesy sightseers that hold up midtown traffic and often crowded with tourists, appears as he too hurdles the guard rail and lands on it. The bus, of course, is completely filled with Japanese tourists, often seen capturing their New York experiences, and it seems like every single one of them has a video camera. Edwards pushes through the crowd and pulls out his badge that hangs from a chain under his shirt, identifying him as a member of the NYPD. Edwards is about to slap the cuffs on the Perp when the Perp blinks, revealing a moment of deceit. Edwards is thrown for a moment, which is all the time the Perp needs to pull out his weapon, which is the strangest-looking gun you've ever seen, resembling futuristic technology. Reacting quickly, Edwards bats it out of the Perp's hand, and the weapon smashes into the stone wall surrounding Central Park, New York's iconic urban park, and shatters into a million pieces. WHOMP! The Perp kicks him in the nuts, then scrambles to his feet and takes off again. Edwards staggers after him, in pain. The Perp leaps over a moving car towards the Guggenheim Museum, a world-renowned museum of modern art; Edwards tries to follow, but a bus pulls in front of him. After it passes, the Perp is gone, blending into the bustling city streets."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Behind him six more men in black all wearing black suits and sunglasses come over the hill and Kay barks a few orders to them. He holds up the neuralyzer and the agents peer closely at it. Kay reaches into his pocket puts on his own black sunglasses and pushes a button on the side of the neuralyzer. A blinding flash a tenth of a second long sears the agents' eyeballs and they stare blankly. Kay gestures behind him where the men in black are now using fire extinguishers to douse the flames they themselves started and the agents look around confused. Dee has moved away from them all and is sitting on a rock staring up at the night sky his sunglasses dangling idly from one hand. Kay steps away from the group and finds him sitting down next to him. He looks up at the million stars shining overhead and pulls his neuralyzer from his pocket looking down at it. These belong to James Edwards a NYC cop in undercover street clothes. In the background about ten feet behind are two other cops trying to keep up but Edwards is a lot faster. A pair of feet running belongs to a man we will know as the perpetrator. A new set of feet comes into frame as they run down the bridge that traverses Park Avenue in the low forties. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. The Perp veers to the left and seemingly oblivious to the fact that it is a thirtyfoot drop he hurdles the guard rail and drops to Fortyfirst Street below. Edwards is surprised by this maneuver but does not waste a second. A doubledecker bus one of those cheesy sightseers that hold up midtown traffic appears as he too hurdles the guard rail and lands on it. The bus of course is completely filled with Japanese tourists and it seems like every single one of them has a video camera. Edwards pushes through the crowd and pulls out his badge that hangs from a chain under his shirt. Edwards is about to slap the cuffs on the Perp when the Perp blinks. Edwards is thrown for a moment which is all the time the Perp needs to pull out his weapon which is the strangestlooking gun you have ever seen. Reacting quickly Edwards bats it out of the Perp's hand and the weapon smashes into the stone wall surrounding Central Park and shatters into a million pieces. WHOMP. The Perp kicks him in the nuts then scrambles to his feet and takes off again Edwards staggers after him in pain. The Perp leaps over a moving car towards the Guggenheim Museum. Edwards tries to follow but a bus pulls in front of him. After it passes the Perp is gone."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Behind him six more men in black all wearing black suits and sunglasses come over the hill and Kay barks a few orders to them. He holds up the neuralyzer and the agents peer closely at it. Kay reaches into his pocket puts on his own black sunglasses and pushes a button on the side of the neuralyzer. A blinding flash a tenth of a second long sears the agents' eyeballs and they stare blankly. Kay gestures behind him where the men in black are now using fire extinguishers to douse the flames they themselves started and the agents look around confused. Dee has moved away from them all and is sitting on a rock staring up at the night sky his sunglasses dangling idly from one hand. Kay steps away from the group and finds him sitting down next to him. He looks up at the million stars shining overhead and pulls his neuralyzer from his pocket looking down at it. These belong to James Edwards a NYC cop in undercover street clothes. In the background about ten feet behind are two other cops trying to keep up but Edwards is a lot faster. A pair of feet running belongs to a man we will know as the perpetrator. A new set of feet comes into frame as they run down the bridge that traverses Park Avenue in the low forties. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. The Perp veers to the left and seemingly oblivious to the fact that it is a thirtyfoot drop he hurdles the guard rail and drops to Fortyfirst Street below. Edwards is surprised by this maneuver but does not waste a second. A doubledecker bus one of those cheesy sightseers that hold up midtown traffic appears as he too hurdles the guard rail and lands on it. The bus of course is completely filled with Japanese tourists and it seems like every single one of them has a video camera. Edwards pushes through the crowd and pulls out his badge that hangs from a chain under his shirt. Edwards is about to slap the cuffs on the Perp when the Perp blinks. Edwards is thrown for a moment which is all the time the Perp needs to pull out his weapon which is the strangestlooking gun you have ever seen. Reacting quickly Edwards bats it out of the Perp's hand and the weapon smashes into the stone wall surrounding Central Park and shatters into a million pieces. WHOMP. The Perp kicks him in the nuts then scrambles to his feet and takes off again Edwards staggers after him in pain. The Perp leaps over a moving car towards the Guggenheim Museum. Edwards tries to follow but a bus pulls in front of him. After it passes the Perp is gone."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Behind him six more men in black all wearing black suits and sunglasses come over the hill and Kay barks a few orders to them. He holds up the neuralyzer and the agents peer closely at it. Kay reaches into his pocket puts on his own black sunglasses and pushes a button on the side of the neuralyzer. A blinding flash a tenth of a second long sears the agents' eyeballs and they stare blankly. Kay gestures behind him where the men in black are now using fire extinguishers to douse the flames they themselves started and the agents look around confused. Dee has moved away from them all and is sitting on a rock staring up at the night sky his sunglasses dangling idly from one hand. Edwards is thrown for a moment which is all the time the Perp needs to pull out his weapon which is the strangestlooking gun you have ever seen. Reacting quickly Edwards bats it out of the Perp's hand and the weapon smashes into the stone wall surrounding Central Park and shatters into a million pieces. WHOMP. The Perp kicks him in the nuts then scrambles to his feet and takes off again Edwards staggers after him in pain. The Perp leaps over a moving car towards the Guggenheim Museum. Edwards tries to follow but a bus pulls in front of him. After it passes the Perp is gone."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Behind him six more men in black all wearing black suits and sunglasses come over the hill and Kay barks a few orders to them. He holds up the neuralyzer and the agents peer closely at it. The Perp leaps over a moving car towards the Guggenheim Museum. Edwards tries to follow but a bus pulls in front of him. After it passes the Perp is gone."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Behind the creature, four more giraffes in blue, all wearing blue hats and sandals, glide under the bridge, and Zed meows a few questions to them. He drops down the megaphone, and the dancers sniff gently at it. Zed leaps into his bag, puts on his own blue sandals, and twists a knob on the edge of the megaphone. A dazzling spark, a twentieth of a minute long, tickles the dancers' knees, and they grin widely. Zed flaps behind him, where the giraffes in blue are now using garden hoses to water the daisies they themselves planted, and the dancers hop around, elated. Bee has jumped toward them all and is lying on a pillow, whistling at the morning breeze, his sandals resting calmly under one ear. Zed stumbles toward the herd and locates him, lying down next to him. He whistles at the thousand kites flying nearby and drops his megaphone into his bag, glancing up at it. These belong to John Smith, a Miami chef in casual beach attire. In the foreground, about twelve miles ahead, are two other chefs attempting to slow down, but Smith is much slower. A pair of hands clapping belongs to a woman we will call the observer. A fresh set of hands comes into view as they hop up the tunnel that ascends Lake View in the high thirties. The Observer skips to the right and, seemingly oblivious to the idea that it's a twenty-foot rise, she tiptoes the curtain rail and climbs to Sixty-second Avenue above. Smith is baffled by this strategy but doesn't waste a moment. A single-decker train, one of those fancy diners that rush through uptown traffic, emerges as he too tiptoes the curtain rail and bounces on it. The train, of course, is completely filled with German painters, and it feels like every single one of them has a sketchpad. Smith slides through the throng and yanks out his whistle that dangles from a string over his jacket. Smith is about to pet the Observer when the Observer yawns. Smith is puzzled for a second, which is all the moment the Observer requires to bring out her tool, which is the oddest-looking spoon you've ever seen. Reacting slowly, Smith flicks it out of the Observer's grasp, and the tool bounces into the wooden bench surrounding Lincoln Park and dissolves into a thousand grains. CRASH! The Observer elbows him in the ribs, then rolls to her hands and skips away again. Smith shambles behind her, in shock. The Observer skates past a parked boat towards the Met Museum; Smith attempts to catch, but a train crawls behind him. After it halts, the Observer is vanished."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Kay, with six men in black suits and sunglasses, uses a neuralyzer, causing a blinding flash that leaves the agents dazed. Meanwhile, Dee sits apart, gazing at the stars. Kay joins him, contemplating the neuralyzer. Elsewhere, NYC cop James Edwards, dressed in undercover street clothes, chases a perpetrator. Despite being faster than his fellow officers, Edwards is surprised when the Perp leaps a thirty-foot drop to Forty-first Street. Edwards follows, landing on a double-decker bus filled with video-taping tourists. He attempts to arrest the Perp, who pulls a strange gun. Edwards knocks it away, shattering it against a stone wall, but the Perp kicks him and escapes. Edwards, in pain, pursues but loses sight of the Perp after a bus passes."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "After it passes the Perp is gone Edwards tries to follow but a bus pulls in front of him  The Perp leaps over a moving car towards the Guggenheim Museum  The Perp kicks him in the nuts then scrambles to his feet and takes off again Edwards staggers after him in pain  WHOMP  Reacting quickly Edwards bats it out of the Perp's hand and the weapon smashes into the stone wall surrounding Central Park and shatters into a million pieces  Edwards is thrown for a moment which is all the time the Perp needs to pull out his weapon which is the strangestlooking gun you've ever seen  Edwards is about to slap the cuffs on the Perp when the Perp blinks  Edwards pushes through the crowd and pulls out his badge that hangs from a chain under his shirt  The bus of course is completely filled with Japanese tourists and it seems like every single one of them has a video camera  A doubledecker bus one of those cheesy sightseers that hold up midtown traffic appears as he too hurdles the guard rail and lands on it  Edwards is surprised by this maneuver but doesn't waste a second  The Perp veers to the left and seemingly oblivious to the fact that it's a thirtyfoot drop he hurdles the guard rail and drops to Fortyfirst Street below  A new set of feet comes into frame as they run down the bridge that traverses Park Avenue in the low forties  A pair of feet running belongs to a man we will know as the perpetrator  In the background about ten feet behind are two other cops trying to keep up but Edwards is a lot faster  These belong to James Edwards a NYC cop in undercover street clothes  He looks up at the million stars shining overhead and pulls his neuralyzer from his pocket looking down at it  Kay steps away from the group and finds him sitting down next to him  Dee has moved away from them all and is sitting on a rock staring up at the night sky his sunglasses dangling idly from one hand  Kay gestures behind him where the men in black are now using fire extinguishers to douse the flames they themselves started and the agents look around confused  A blinding flash a tenth of a second long sears the agents' eyeballs and they stare blankly  Kay reaches into his pocket puts on his own black sunglasses and pushes a button on the side of the neuralyzer  He holds up the neuralyzer and the agents peer closely at it  Behind him six more men in black all wearing black suits and sunglasses come over the hill and Kay barks a few orders to them "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He holds up the neuralyzer and the agents peer closely at it Behind him six more men in black all wearing black suits and sunglasses come over the hill and Kay barks a few orders to them A blinding flash a tenth of a second long sears the agents' eyeballs and they stare blankly Kay reaches into his pocket puts on his own black sunglasses and pushes a button on the side of the neuralyzer Dee has moved away from them all and is sitting on a rock staring up at the night sky his sunglasses dangling idly from one hand Kay gestures behind him where the men in black are now using fire extinguishers to douse the flames they themselves started and the agents look around confused He looks up at the million stars shining overhead and pulls his neuralyzer from his pocket looking down at it Kay steps away from the group and finds him sitting down next to him In the background about ten feet behind are two other cops trying to keep up but Edwards is a lot faster These belong to James Edwards a NYC cop in undercover street clothes A new set of feet comes into frame as they run down the bridge that traverses Park Avenue in the low forties A pair of feet running belongs to a man we will know as the perpetrator Edwards is surprised by this maneuver but does not waste a second The Perp veers to the left and seemingly oblivious to the fact that it is a thirtyfoot drop he hurdles the guard rail and drops to Fortyfirst Street below The bus of course is completely filled with Japanese tourists and it seems like every single one of them has a video camera A doubledecker bus one of those cheesy sightseers that hold up midtown traffic appears as he too hurdles the guard rail and lands on it Edwards is about to slap the cuffs on the Perp when the Perp blinks Edwards pushes through the crowd and pulls out his badge that hangs from a chain under his shirt Reacting quickly Edwards bats it out of the Perp's hand and the weapon smashes into the stone wall surrounding Central Park and shatters into a million pieces Edwards is thrown for a moment which is all the time the Perp needs to pull out his weapon which is the strangestlooking gun you have ever seen The Perp kicks him in the nuts then scrambles to his feet and takes off again Edwards staggers after him in pain WHOMP Edwards tries to follow but a bus pulls in front of him The Perp leaps over a moving car towards the Guggenheim Museum After it passes the Perp is gone"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Edwards is surprised by this maneuver but doesn't waste a second  A doubledecker bus one of those cheesy sightseers that hold up midtown traffic appears as he too hurdles the guard rail and lands on it  The bus of course is completely filled with Japanese tourists and it seems like every single one of them has a video camera  Edwards pushes through the crowd and pulls out his badge that hangs from a chain under his shirt  Edwards is about to slap the cuffs on the Perp when the Perp blinks  Edwards is thrown for a moment which is all the time the Perp needs to pull out his weapon which is the strangestlooking gun you've ever seen  Reacting quickly Edwards bats it out of the Perp's hand and the weapon smashes into the stone wall surrounding Central Park and shatters into a million pieces  WHOMP  The Perp kicks him in the nuts then scrambles to his feet and takes off again Edwards staggers after him in pain  The Perp leaps over a moving car towards the Guggenheim Museum  Edwards tries to follow but a bus pulls in front of him  After it passes the Perp is gone Behind him six more men in black all wearing black suits and sunglasses come over the hill and Kay barks a few orders to them  He holds up the neuralyzer and the agents peer closely at it  Kay reaches into his pocket puts on his own black sunglasses and pushes a button on the side of the neuralyzer  A blinding flash a tenth of a second long sears the agents' eyeballs and they stare blankly  Kay gestures behind him where the men in black are now using fire extinguishers to douse the flames they themselves started and the agents look around confused  Dee has moved away from them all and is sitting on a rock staring up at the night sky his sunglasses dangling idly from one hand  Kay steps away from the group and finds him sitting down next to him  He looks up at the million stars shining overhead and pulls his neuralyzer from his pocket looking down at it  These belong to James Edwards a NYC cop in undercover street clothes  In the background about ten feet behind are two other cops trying to keep up but Edwards is a lot faster  A pair of feet running belongs to a man we will know as the perpetrator  A new set of feet comes into frame as they run down the bridge that traverses Park Avenue in the low forties  The Perp veers to the left and seemingly oblivious to the fact that it's a thirtyfoot drop he hurdles the guard rail and drops to Fortyfirst Street below "
        }
      ]
    }
  ]
}