{
  "ground_truth": "Edwards is shocked and pulls his own weapon, pointing it at Kay's head, then whirls around to see Jeebs' body growing another head, which takes only four or five seconds. Kay raises the weapon again, threatening, and Jeebs nods, the point taken. Edwards, still dazed by Jeebs' regrown head, glances down at all the weapons as Kay leaves. The flash dims on Edwards and Kay, sitting at a table in a Chinese restaurant where Edwards takes the remaining chair. Zed continues addressing the recruits, who all turn and regard Edwards a little smugly while Edwards's hand is indeed up. Then one of the young recruits eagerly raises his hand, and Zed calls on him. Edwards tries to stifle a laugh but can't while Zed looks into the gallery. Most obvious in the frozen tableau of creatures is a lunging, snarling beast with three bullet holes in its chest, next to a massively deformed humanoid creature with a large hook for a head with three holes in it. In the back corner of the gallery, there is a single bullet hole in a pretty eight-year-old girl, and Zed sighs, with sideways glances from the other recruits. Zed and Kay stand behind smoked glass, staring at the recruits still in the shooting gallery, waiting for a decision. Zed turns and walks away, and Kay stares through the glass at Edwards, who stands alone on one side of the room, apart from the rest of the group. Zed reappears on the other side of the glass, coming through a door and into the shooting gallery. The recruits follow Zed out of the shooting gallery into a long hallway, where Zed motions them off to the left. Edwards is the last one out of the room, but he stops as he steps into the hallway where Kay is outside the door, waiting for him. Edwards recognizes him from last night. As they pass an alcove, Edwards notices the six other recruits herded into a corner while Zed pulls a neuralyzer from his pocket, holding it up in front of them as the recruits stare obediently at it and Zed slips on a pair of black sunglasses. Alien shapes are visible within a photograph where Dee and Zed are much younger, and in another photograph, a young Kay, in a shirt and tie, holds a bouquet of flowers, staring at the open door of a landed flying saucer. Kay steers Edwards to the right down another corridor, just as long as the first, and another picture shows the 1964 World's Fair grounds still under construction, with giant models of rockets marking the Fair's theme of space travel, most prominently the two tall towers with the flying saucers now mounted at the top of each.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Edwards is astonished and withdraws his own firearm, aiming it at Kay's cranium, then twirls around to observe Jeebs' form developing another cranium, which requires only four or five moments. Kay elevates the firearm again, menacingly, and Jeebs acknowledges, the point comprehended. Edwards, still bewildered by Jeebs' regenerated cranium, gazes down at all the firearms as Kay departs. The flash dims on Edwards and Kay, sitting at a table in a Chinese eatery where Edwards occupies the remaining seat. Zed persists in addressing the trainees, who all pivot and regard Edwards a bit smugly while Edwards's hand is indeed raised. Then one of the youthful trainees eagerly lifts his hand, and Zed calls on him. Edwards attempts to suppress a chuckle but can't while Zed looks into the gallery. Most evident in the frozen tableau of entities is a leaping, snarling brute with three bullet perforations in its thorax, next to a massively deformed humanoid being with a large hook for a cranium with three perforations in it. In the rear corner of the gallery, there is a single bullet perforation in a pretty eight-year-old girl, and Zed exhales, with sidelong looks from the other trainees. Zed and Kay stand behind smoked glass, gazing at the trainees still in the firing gallery, awaiting a determination. Zed turns and strides away, and Kay peers through the glass at Edwards, who stands solitary on one side of the room, separate from the remainder of the cluster. Zed reappears on the other side of the glass, entering through a portal and into the firing gallery. The trainees follow Zed out of the firing gallery into an extended corridor, where Zed gestures them off to the left. Edwards is the last one out of the space, but he halts as he steps into the corridor where Kay is outside the portal, anticipating him. Edwards identifies him from last night. As they traverse an alcove, Edwards observes the six other trainees clustered into a corner while Zed extracts a neuralyzer from his pocket, holding it up in front of them as the trainees gaze obediently at it and Zed dons a pair of black shades. Extraterrestrial shapes are apparent within a photograph where Dee and Zed are much younger, and in another photograph, a young Kay, in a shirt and tie, holds a bouquet of blossoms, gazing at the open portal of a landed flying disk. Kay guides Edwards to the right down another passageway, just as lengthy as the first, and another picture reveals the 1964 World's Fair grounds still under construction, with giant models of projectiles marking the Fair's theme of cosmic travel, most prominently the two tall towers with the flying disks now mounted at the top of each."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Edwards is shocked, and his own weapon is pulled by him, with it being pointed at Kay's head, then he whirls around and sees Jeebs' body grow another head, which takes only four or five seconds. The weapon is raised again by Kay, threatening, and Jeebs nods, the point being taken. Still dazed by Jeebs' regrown head, Edwards glances down at all the weapons as Kay leaves. Edwards and Kay are dimmed on by the flash, sitting at a table in a Chinese restaurant where the remaining chair is taken by Edwards. The recruits are addressed by Zed, who all turn and regard Edwards a little smugly while his hand is indeed up. Then one of the young recruits eagerly raises his hand, and Zed calls on him. Edwards tries to stifle a laugh but can’t, while the gallery is looked into by Zed. Most obvious in the frozen tableau of creatures is a lunging, snarling beast with three bullet holes in its chest, next to a massively deformed humanoid creature having a large hook for a head with three holes in it. In the back corner of the gallery, a single bullet hole is in a pretty eight-year-old girl, and Zed sighs, with sideways glances being given by the other recruits. Behind smoked glass stand Zed and Kay, staring at the recruits still in the shooting gallery, waiting for a decision. Zed turns and walks away, and Edwards is stared at by Kay through the glass, standing alone on one side of the room, apart from the rest of the group. On the other side of the glass, Zed reappears, coming through a door and into the shooting gallery. Out of the shooting gallery and into a long hallway, Zed is followed by the recruits, who are motioned off to the left by him. Edwards is the last one out of the room, but he stops as the hallway is stepped into by him, where Kay is waiting for him outside the door. Him from last night is recognized by Edwards. As an alcove is passed, the six other recruits are noticed by Edwards, herded into a corner while a neuralyzer is pulled from his pocket by Zed, holding it up in front of them as they stare obediently at it, and a pair of black sunglasses is slipped on by Zed. Within a photograph, alien shapes are visible where Dee and Zed are much younger, and in another photograph, a bouquet of flowers is held by a young Kay, in a shirt and tie, staring at the open door of a landed flying saucer. Edwards is steered to the right down another corridor by Kay, just as long as the first, and another picture shows the 1964 World's Fair grounds still under construction, with giant models of rockets marking the Fair's theme of space travel, most prominently the two tall towers with the flying saucers now mounted at their top."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Edwards is shocked and draws his weapon, aiming at Kay, then spins to see Jeebs' body regenerating a head in four or five seconds. Kay raises his weapon threateningly, and Jeebs nods in understanding. Edwards, still stunned by Jeebs' regrown head, looks at the weapons as Kay exits. The scene shifts to a Chinese restaurant where Edwards joins Kay at a table. Zed addresses recruits, who smugly turn towards Edwards, whose hand is raised. A young recruit eagerly raises his hand, and Zed calls on him. Edwards tries to suppress laughter but fails as Zed surveys the gallery. In the gallery, a lunging beast with bullet wounds stands next to a deformed humanoid with a hooked head. In the back, a pretty girl has a bullet hole, and Zed sighs as other recruits glance sideways. Zed and Kay observe behind smoked glass, waiting for a decision. Zed exits, and Kay watches Edwards, isolated from the group. Zed returns through a door, leading recruits from the gallery into a hallway, directing them left. Edwards is last to leave, stopping as Kay waits outside, recognizing him from last night. Passing an alcove, Edwards sees six recruits cornered as Zed uses a neuralyzer, putting on sunglasses. Alien shapes appear in a photo of a younger Dee and Zed; another shows a young Kay with flowers near a landed saucer. Kay guides Edwards down another corridor, just as long, with a photo of the 1964 World's Fair, featuring rockets and towers with saucers atop."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Edwards is shocked, draws his weapon at Kay, then sees Jeebs' head regrow in seconds. Kay raises his weapon again, and Jeebs nods. Edwards, confused, looks at the weapons when Kay leaves. The scene shifts to Edwards and Kay at a Chinese restaurant table. Zed addresses recruits, who smugly watch Edwards with his hand up. A recruit raises his hand, Zed calls on him, and Edwards can't suppress a laugh. Zed looks at a gallery with a snarling beast, a deformed humanoid, and a girl with a bullet hole, sighing at recruits' glances. Zed and Kay watch recruits in the gallery from behind smoked glass. Zed exits, Kay stares at Edwards, apart from others. Zed re-enters the gallery, leads recruits down a hallway, and motions left. Edwards exits last, meets Kay, recalls him from the night before. Passing an alcove, Edwards sees other recruits cornered, Zed with a neuralyzer, and they stare at it. Alien figures appear in a photo with young Dee and Zed, and Kay, with flowers, stares at a flying saucer. Kay guides Edwards down another corridor beside a photo of the 1964 World's Fair with rocket models and flying saucers atop towers."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Edwards, utterly taken aback, reacts with shock and instinctively pulls out his own weapon, swiftly aiming it at Kay's head. In a fluid motion, he spins around to witness Jeebs’ body astonishingly growing back another head in a matter of just four to five seconds. Kay, maintaining his composure, raises his weapon once more, conveying a threatening stance, to which Jeebs responds with a nod of understanding, acknowledging the seriousness of the situation. Edwards, still bewildered by the sight of Jeebs' reformed head, momentarily looks down at the array of weapons as Kay makes his departure. \n\nThe scene shifts and the bright flash fades, revealing Edwards and Kay now seated at a table within a bustling Chinese restaurant, where Edwards occupies the last available chair. Meanwhile, Zed continues to address the group of recruits, who collectively turn their heads to regard Edwards with a noticeably smug expression, as Edwards indeed has his hand raised. Observing the scene, one of the young recruits eagerly raises his hand, capturing Zed's attention, who promptly calls on him. Edwards, attempting to suppress his amusement, finds himself unable to hold back a laugh while Zed's gaze sweeps through the gallery.\n\nIn this gallery, the scene captures the most prominent figures, including a menacing, lunging beast that bears three bullet holes in its chest, standing beside a grotesquely deformed humanoid creature with an oversized hook for a head featuring three noticeable holes. Positioned at the far corner of the gallery, a single bullet hole is visible in a seemingly innocent, pretty eight-year-old girl, prompting Zed to let out a deep sigh, as he receives sideways glances from the assembled recruits. \n\nBeyond the glass partition, Zed and Kay scrutinize the recruits who remain in the shooting gallery, awaiting the final decision. Zed then decisively turns away and exits, while Kay continues to observe Edwards through the glass, as Edwards stands isolated on one side of the room, distinct from the rest of the group. Zed soon reappears on the opposite side of the glass, entering the shooting gallery through a door. With a sense of authority, Zed leads the recruits out of the shooting gallery into an expansive, lengthy hallway, gesturing for them to proceed to the left.\n\nTrailing behind the group, Edwards is the last to exit the room, but he pauses momentarily as he steps into the hallway, noticing Kay waiting outside the door. Recognizing Kay from the previous night, Edwards acknowledges him. As they move past an alcove, Edwards observes the six other recruits being ushered into a corner, as Zed retrieves a neuralyzer from his pocket, holding it up before the recruits who obediently direct their gaze towards it. Zed, in preparation, slips on a pair of sleek black sunglasses. Alien figures become discernible within a photograph depicting Dee and Zed in their significantly younger years, and in another image, a youthful Kay, dressed in a shirt and tie, clutches a bouquet of flowers, gazing at the open door of a recently landed flying saucer.\n\nGuiding Edwards, Kay directs him to the right, down another corridor equally as lengthy as the first, where another photograph captures the 1964 World's Fair grounds amidst construction, prominently showcasing giant models of rockets highlighting the Fair's space travel theme, with the most striking feature being the two tall towers crowned with flying saucers perched at their summits."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Edwards, completely taken aback and caught off guard, reacts with a look of utter shock and disbelief. Instinctively, he responds by swiftly pulling out his own weapon, quickly and efficiently aiming it directly at Kay's head. In one smooth and effortless motion, he spins around on his heels just in time to witness an astonishing sight: Jeebs’ body miraculously regenerating and growing back another head in a remarkably short span of merely four to five seconds. Maintaining his calm and collected demeanor throughout the unfolding chaos, Kay raises his weapon once more with a sense of purpose, adopting a threatening stance that clearly communicates his intent. In response to this display, Jeebs gives a knowing nod, silently acknowledging the seriousness and gravity of the situation. Meanwhile, Edwards, still bewildered and trying to process the extraordinary sight of Jeebs' newly reformed head, momentarily glances down at the variety of weapons as Kay makes his timely departure from the scene.\n\nThe scene transitions smoothly as the bright flash of light gradually fades away, revealing Edwards and Kay now comfortably seated at a table within the lively atmosphere of a bustling Chinese restaurant. Edwards finds himself occupying the last available chair. As this unfolds, Zed continues to address the attentive group of recruits, who collectively turn their heads, casting their gaze upon Edwards with a noticeably smug expression on their faces, as Edwards indeed has his hand raised high in the air. Observing this unfolding scene, one of the eager young recruits excitedly raises his hand, immediately capturing Zed's attention, who promptly, without hesitation, calls on him to speak. Edwards, attempting to suppress a bubbling sense of amusement, finds himself unable to keep from laughing as Zed's discerning gaze sweeps across the gallery.\n\nWithin this gallery, the scene vividly captures the most prominent figures, featuring a menacing and threatening beast that appears to be lunging forward, with three distinct bullet holes visible in its chest. Standing beside it is a grotesquely deformed humanoid creature characterized by an oversized hook for a head, featuring three noticeable holes. Positioned conspicuously at the far corner of the gallery, a single bullet hole is visible piercing a seemingly innocent and pretty eight-year-old girl, prompting Zed to let out a deep and weary sigh as he receives sideways glances from the assembled recruits, who remain attentive.\n\nBeyond the clear glass partition, Zed and Kay intently scrutinize the recruits who are still present in the shooting gallery, patiently awaiting the final decision. Zed decisively turns away, exiting the scene, while Kay continues to direct his attention towards Edwards through the glass, as Edwards stands isolated on one side of the room, distinct and separate from the rest of the group. Shortly thereafter, Zed reappears on the opposite side of the glass, entering the shooting gallery through a door. Displaying a sense of authority and leadership, Zed proceeds to lead the recruits out of the shooting gallery into an expansive and lengthy hallway, gesturing for them to proceed to the left as they follow his direction.\n\nTrailing behind the group, Edwards is the last to exit the room. He pauses momentarily just as he steps into the hallway, noticing Kay patiently waiting outside the door. Recognizing Kay from the previous night’s encounter, Edwards acknowledges him with a knowing nod. As they move past an alcove, Edwards observes the six other recruits being ushered into a corner, where Zed retrieves a neuralyzer from his pocket, holding it up before the recruits, who obediently direct their gaze towards it. In preparation for what comes next, Zed slips on a pair of sleek, black sunglasses, projecting an air of professionalism and preparedness. In the surrounding photographs, alien figures become discernible, depicting Dee and Zed in their significantly younger years, and in another image, a youthful Kay dressed in a shirt and tie clutches a bouquet of flowers, gazing intently at the open door of a recently landed flying saucer.\n\nGuiding Edwards with a sense of purpose, Kay directs him to the right, down a corridor equally as lengthy as the first, where another photograph captures the 1964 World's Fair grounds amidst its ongoing construction. This photograph prominently showcases the giant models of rockets that highlight the Fair's captivating space travel theme, with the most striking and impressive feature being the two tall towers crowned with flying saucers perched prominently at their summits, illustrating the theme’s grandeur and futuristic vision."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Edwards is suddenly taken aback, his eyes widening in disbelief, as he instinctively reaches for his own weapon, gripping it firmly and swiftly pulling it out. He raises the weapon, his hand steady despite his shock, pointing it directly at Kay's head with a tense expression, only to immediately pivot his body swiftly, turning around to witness the surreal sight of Jeebs' body actively regenerating a new head. He watches in stunned amazement as the new head sprouts, the process taking merely four or five seconds, an incredibly brief yet astonishing transformation. Kay, maintaining a firm stance, elevates his weapon once again, his eyes locked with Jeebs, conveying a silent yet menacing threat. Jeebs, understanding the unspoken warning, acknowledges with a nod, the message clear without a word spoken. Edwards, still in a daze from witnessing Jeebs' miraculous regrowth, lowers his gaze, momentarily distracted by the arsenal of weapons displayed before him, while Kay makes his exit. The scene shifts as the bright flash fades, revealing Edwards and Kay now seated at a small table in a bustling Chinese restaurant. Edwards, feeling the weight of the moment, pulls out the remaining chair and takes his seat. Meanwhile, Zed, who is present, continues his speech to the group of recruits, each one turning to cast slightly smug glances towards Edwards. Subtly, Edwards' hand is indeed raised, signaling his presence and attention. Amid this, a young recruit, filled with enthusiasm, raises his hand energetically, drawing Zed's focus, who then acknowledges and calls on him. Edwards feels a wave of amusement ripple through him, attempting to suppress a chuckle yet failing to contain it, all while Zed directs his gaze towards the gallery, inspecting the scene. Within this gallery, the most striking sight is that of a frozen tableau of creatures, with one prominent figure—a lunging, snarling beast marred by three bullet holes in its chest—positioned beside a grotesquely deformed humanoid creature, its head grotesquely transformed into a large hook, similarly marked by three holes. In the far corner, the unsettling image of a single bullet hole mars the appearance of a seemingly innocent eight-year-old girl, her presence prompting a sigh from Zed, which is accompanied by sideways glances exchanged between the other recruits. Zed and Kay stand together, their forms silhouetted behind a screen of smoked glass, their eyes fixed on the recruits who remain in the shooting gallery, both awaiting a decision. As Zed turns on his heel and strides away, Kay remains, his gaze intent on Edwards, who stands isolated on one side of the room, deliberately separated from the other recruits. Zed soon reappears on the opposite side of the glass, entering the shooting gallery through a door, motioning for the recruits to follow suit as they trail behind him into a long, echoing hallway. As the group moves, Zed guides them with a decisive gesture toward the left. Edwards lingers as the last to exit, his feet pausing as he steps into the hallway, registering Kay's presence just outside the door, waiting patiently. Recognition dawns on Edwards as he recalls their encounter the previous night. As they proceed down the hallway, they pass an alcove, where Edwards observes the other six recruits, now corralled into a corner by Zed. In a moment of subtle showmanship, Zed draws a neuralyzer from his pocket, holding it aloft with a practiced hand, the recruits' eyes transfixed on the device as Zed coolly slips on a pair of sleek black sunglasses. Within these moments, Edwards' attention is captured by a photograph revealing alien silhouettes, a stark contrast to a younger depiction of Dee and Zed. In another photograph, Edwards notes a youthful Kay, clad in a shirt and tie, holding a bouquet of flowers, his eyes fixed on the intriguing sight of an open door of a landed flying saucer. Kay, maintaining a guiding presence, directs Edwards to the right along another corridor, equally as expansive as the previous one, leading them past another picture of historical significance. This photograph captures the 1964 World's Fair grounds, still amidst construction, with imposing models of rockets symbolizing the Fair's space travel theme, most notably featuring the towering pair of structures with flying saucers now prominently perched atop each one."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Edwards is initially shocked as he pulls his weapon and points it at Kay, only to witness Jeebs' body regrowing a head in seconds. As Kay reasserts his threat, Jeebs acknowledges with a nod, and Edwards, still stunned by what he's seen, observes the various weapons as Kay departs. The scene shifts to a Chinese restaurant where Edwards sits with Kay as Zed addresses the recruits, who look at Edwards smugly. During Zed's briefing, a recruit eagerly raises his hand, prompting Edwards to unsuccessfully suppress a laugh, while Zed surveys the gallery. The gallery features a snarling beast with bullet holes and a deformed humanoid. In the distance, a young girl with a bullet wound catches Zed's attention, prompting silent reactions from other recruits. Zed and Kay watch the recruits from behind smoked glass, anticipating a decision. As Zed leaves, Kay keeps an eye on Edwards, who stands isolated. Zed returns and leads the recruits out of the gallery into a hallway, motioning them left. Edwards lags behind but notices Kay waiting outside the door, recognizing him from the previous night. Passing an alcove, they see the other recruits cornered as Zed prepares a neuralyzer while they stare obediently. He dons sunglasses as alien shapes are seen in an old photograph of a younger Dee and Zed, alongside an image of a youthful Kay near a landed flying saucer. Kay guides Edwards down a similar corridor, past a picture of the 1964 World's Fair under construction, marked by rockets and topped with flying saucers."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Edwards, shocked by the unexpected move in the tense standoff, pulls his own weapon, pointing it at Kay's head with a steady hand, then whirls around to see Jeebs' body remarkably regenerating another head, a process that takes only four or five seconds due to the unique physiology of his alien species. Kay raises the weapon again, threatening with the authority of a seasoned operative, and Jeebs nods, the point taken, knowing the consequences from previous encounters. Edwards, still dazed by witnessing Jeebs' miraculous regrowth, glances down at all the advanced, extraterrestrial weapons as Kay leaves. The scene transitions to a dim flash on Edwards and Kay, sitting at a table in a Chinese restaurant known for its authentic Peking duck, where Edwards takes the remaining chair. Zed, head of the covert Men in Black agency, continues addressing the recruits, who all turn and regard Edwards a little smugly, aware of his recent induction, while Edwards's hand is indeed up, a sign of his eagerness to engage. Then one of the young recruits, eager to make an impression in this crucial phase of training, raises his hand, and Zed calls on him. Edwards tries to stifle a laugh but can't, finding humor in the situation, while Zed looks into the gallery, assessing the recruits' reactions. Most obvious in the frozen tableau of alien creatures is a lunging, snarling beast with three bullet holes in its chest, a testament to the recruits' target practice, next to a massively deformed humanoid creature with a large hook for a head with three holes in it, highlighting the bizarre diversity of alien life forms. In the back corner of the gallery, a single bullet hole mars the image of a pretty eight-year-old girl, a common but unsettling feature in their training scenarios, and Zed sighs, with sideways glances from the other recruits, who understand the gravity of their mistakes. Zed and Kay stand behind smoked glass, a common feature in secure facilities, staring at the recruits still in the shooting gallery, waiting for a decision that will affect their futures. Zed turns and walks away, leaving an air of uncertainty, and Kay stares through the glass at Edwards, who stands alone on one side of the room, apart from the rest of the group, reflecting his unique potential. Zed reappears on the other side of the glass, coming through a door and into the shooting gallery, indicating the next phase of their rigorous training. The recruits follow Zed out of the shooting gallery into a long hallway, where Zed motions them off to the left, directing them towards further training exercises. Edwards is the last one out of the room, but he stops as he steps into the hallway where Kay is outside the door, waiting for him, an indication of his mentor-like role. Edwards recognizes him from last night, the encounter still fresh in his mind. As they pass an alcove, Edwards notices the six other recruits herded into a corner while Zed pulls a neuralyzer from his pocket, a device used by the agency to erase specific memories, holding it up in front of them as the recruits stare obediently at it, aware of its purpose, and Zed slips on a pair of black sunglasses to protect his own vision from the neuralyzer's flash. Alien shapes are visible within a photograph where Dee and Zed are much younger, a glimpse into the agency's storied past, and in another photograph, a young Kay, in a shirt and tie reminiscent of the 1960s style, holds a bouquet of flowers, staring at the open door of a landed flying saucer, a historical encounter that shaped his career. Kay steers Edwards to the right down another corridor, just as long as the first, maintaining the labyrinthine structure of their secret headquarters, and another picture shows the 1964 World's Fair grounds still under construction, with giant models of rockets marking the Fair's theme of space travel, most prominently the two tall towers with the now-iconic flying saucers mounted at the top of each, a hidden reminder of the agency's longstanding presence on Earth."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "the two tall towers with the flying saucers now mounted at the top of each Edwards is shocked and pulls his own weapon pointing it at Kay's head then whirls around to see Jeebs' body growing another head which takes only four or five seconds Edwards still dazed by Jeebs' regrown head glances down at all the weapons as Kay leaves Most obvious in the frozen tableau of creatures is a lunging snarling beast with three bullet holes in its chest next to a massively deformed humanoid creature with a large hook for a head with three holes in it Kay raises the weapon again threatening and Jeebs nods the point taken The flash dims on Edwards and Kay sitting at a table in a Chinese restaurant where Edwards takes the remaining chair Zed reappears on the other side of the glass coming through a door and into the shooting gallery Kay raises the weapon again threatening and Jeebs nods the point taken Edwards still dazed by Jeebs' regrown head glances down at all the weapons as Kay leaves The flash dims on Edwards and Kay sitting at a table in a Chinese restaurant where Edwards takes the remaining chair Zed continues addressing the recruits who all turn and regard Edwards a little smugly while Edwards's hand is indeed up Then one of the young recruits eagerly raises his hand and Zed calls on him Edwards tries to stifle a laugh but cannot while Zed looks into the gallery Most obvious in the frozen tableau of creatures is a lunging snarling beast with three bullet holes in its chest next to a massively deformed humanoid creature with a large hook for a head with three holes in it In the back corner of the gallery there is a single bullet hole in a pretty eightyearold girl and Zed sighs with sideways glances from the other recruits Zed and Kay stand behind smoked glass staring at the recruits still in the shooting gallery waiting for a decision Zed turns and walks away and Kay stares through the glass at Edwards who stands alone on one side of the room apart from the rest of the group Zed turns and walks away and Kay stares through the glass at Edwards who stands alone on one side of the room apart from the rest of the group Zed reappears on the other side of the glass coming through a door and into the shooting gallery Alien shapes are visible within a photograph where Dee and Zed are much younger and in another photograph a young Kay in a shirt and tie holds a bouquet of flowers staring at the open door of a landed flying saucer In the back corner of the gallery there is a single bullet hole in a pretty eightyearold girl and Zed sighs with sideways glances from the other recruits The recruits follow Zed out of the shooting gallery into a long hallway where Zed motions them off to the left Edwards is the last one out of the room but he stops as he steps into the hallway where Kay is outside the door waiting for him Edwards recognizes him from last night As they pass an alcove Edwards notices the six other recruits herded into a corner while Zed pulls a neuralyzer from his pocket holding it up in front of them as the recruits stare obediently at it and Zed slips on a pair of black sunglasses Alien shapes are visible within a photograph where Dee and Zed are much younger and in another photograph a young Kay in a shirt and tie holds a bouquet of flowers staring at the open door of a landed flying saucer Edwards is shocked and pulls his own weapon pointing it at Kay's head then whirls around to see Jeebs' body growing another head which takes only four or five seconds Kay steers Edwards to the right down another corridor just as long as the first and another picture shows the 1964 World's Fair grounds still under construction with giant models of rockets marking the Fair's theme of space travel most prominently the two tall towers with the flying saucers now mounted at the top of each"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Edwards is shocked and pulls his own weapon pointing it at Kay's head then whirls around to see Jeebs' body growing another head which takes only four or five seconds. Kay raises the weapon again threatening and Jeebs nods the point taken. Edwards still dazed by Jeebs' regrown head glances down at all the weapons as Kay leaves. The flash dims on Edwards and Kay sitting at a table in a Chinese restaurant where Edwards takes the remaining chair. Zed continues addressing the recruits who all turn and regard Edwards a little smugly while Edwards's hand is indeed up. Then one of the young recruits eagerly raises his hand and Zed calls on him. Edwards tries to stifle a laugh but cannot while Zed looks into the gallery. Most obvious in the frozen tableau of creatures is a lunging snarling beast with three bullet holes in its chest next to a massively deformed humanoid creature with a large hook for a head with three holes in it. In the back corner of the gallery there is a single bullet hole in a pretty eightyearold girl and Zed sighs with sideways glances from the other recruits. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Zed and Kay stand behind smoked glass staring at the recruits still in the shooting gallery waiting for a decision. Zed turns and walks away and Kay stares through the glass at Edwards who stands alone on one side of the room apart from the rest of the group. Zed reappears on the other side of the glass coming through a door and into the shooting gallery. The recruits follow Zed out of the shooting gallery into a long hallway where Zed motions them off to the left. Edwards is the last one out of the room but he stops as he steps into the hallway where Kay is outside the door waiting for him. Edwards recognizes him from last night. As they pass an alcove Edwards notices the six other recruits herded into a corner while Zed pulls a neuralyzer from his pocket holding it up in front of them as the recruits stare obediently at it and Zed slips on a pair of black sunglasses. Alien shapes are visible within a photograph where Dee and Zed are much younger and in another photograph a young Kay in a shirt and tie holds a bouquet of flowers staring at the open door of a landed flying saucer. Kay steers Edwards to the right down another corridor just as long as the first and another picture shows the 1964 World's Fair grounds still under construction with giant models of rockets marking the Fair's theme of space travel most prominently. the two tall towers with the flying saucers now mounted at the top of each."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Edwards is shocked and pulls his own weapon pointing it at Kay's head then whirls around to see Jeebs' body growing another head which takes only four or five seconds. Kay raises the weapon again threatening and Jeebs nods the point taken. Edwards still dazed by Jeebs' regrown head glances down at all the weapons as Kay leaves. The flash dims on Edwards and Kay sitting at a table in a Chinese restaurant where Edwards takes the remaining chair. Zed continues addressing the recruits who all turn and regard Edwards a little smugly while Edwards's hand is indeed up. Then one of the young recruits eagerly raises his hand and Zed calls on him. Edwards tries to stifle a laugh but cannot while Zed looks into the gallery. Most obvious in the frozen tableau of creatures is a lunging snarling beast with three bullet holes in its chest next to a massively deformed humanoid creature with a large hook for a head with three holes in it. In the back corner of the gallery there is a single bullet hole in a pretty eightyearold girl and Zed sighs with sideways glances from the other recruits. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Zed and Kay stand behind smoked glass staring at the recruits still in the shooting gallery waiting for a decision. Zed turns and walks away and Kay stares through the glass at Edwards who stands alone on one side of the room apart from the rest of the group. Zed reappears on the other side of the glass coming through a door and into the shooting gallery. The recruits follow Zed out of the shooting gallery into a long hallway where Zed motions them off to the left. Edwards is the last one out of the room but he stops as he steps into the hallway where Kay is outside the door waiting for him. Edwards recognizes him from last night. As they pass an alcove Edwards notices the six other recruits herded into a corner while Zed pulls a neuralyzer from his pocket holding it up in front of them as the recruits stare obediently at it and Zed slips on a pair of black sunglasses. Alien shapes are visible within a photograph where Dee and Zed are much younger and in another photograph a young Kay in a shirt and tie holds a bouquet of flowers staring at the open door of a landed flying saucer. Kay steers Edwards to the right down another corridor just as long as the first and another picture shows the 1964 World's Fair grounds still under construction with giant models of rockets marking the Fair's theme of space travel most prominently. the two tall towers with the flying saucers now mounted at the top of each."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Edwards is shocked and pulls his own weapon pointing it at Kay's head then whirls around to see Jeebs' body growing another head which takes only four or five seconds. Kay raises the weapon again threatening and Jeebs nods the point taken. Edwards still dazed by Jeebs' regrown head glances down at all the weapons as Kay leaves. The flash dims on Edwards and Kay sitting at a table in a Chinese restaurant where Edwards takes the remaining chair. Zed continues addressing the recruits who all turn and regard Edwards a little smugly while Edwards's hand is indeed up. Edwards recognizes him from last night. As they pass an alcove Edwards notices the six other recruits herded into a corner while Zed pulls a neuralyzer from his pocket holding it up in front of them as the recruits stare obediently at it and Zed slips on a pair of black sunglasses. Alien shapes are visible within a photograph where Dee and Zed are much younger and in another photograph a young Kay in a shirt and tie holds a bouquet of flowers staring at the open door of a landed flying saucer. Kay steers Edwards to the right down another corridor just as long as the first and another picture shows the 1964 World's Fair grounds still under construction with giant models of rockets marking the Fair's theme of space travel most prominently. the two tall towers with the flying saucers now mounted at the top of each."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Edwards is shocked and pulls his own weapon pointing it at Kay's head then whirls around to see Jeebs' body growing another head which takes only four or five seconds. Kay raises the weapon again threatening and Jeebs nods the point taken. Kay steers Edwards to the right down another corridor just as long as the first and another picture shows the 1964 World's Fair grounds still under construction with giant models of rockets marking the Fair's theme of space travel most prominently. the two tall towers with the flying saucers now mounted at the top of each."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog is shocked and pulls its own weapon, pointing it at the tiger's head, then whirls around to see the rabbit's body growing another head, which takes only four or five seconds. The tiger raises the weapon again, threatening, and the rabbit nods, the point taken. The dog, still dazed by the rabbit's regrown head, glances down at all the weapons as the tiger leaves. The flash dims on the dog and the tiger, sitting at a table in a Chinese restaurant where the dog takes the remaining chair. The elephant continues addressing the recruits, who all turn and regard the dog a little smugly while the dog's hand is indeed up. Then one of the young recruits eagerly raises his hand, and the elephant calls on him. The dog tries to stifle a laugh but can't while the elephant looks into the gallery. Most obvious in the frozen tableau of creatures is a lunging, snarling beast with three bullet holes in its chest, next to a massively deformed humanoid creature with a large hook for a head with three holes in it. In the back corner of the gallery, there is a single bullet hole in a pretty eight-year-old girl, and the elephant sighs, with sideways glances from the other recruits. The elephant and the tiger stand behind smoked glass, staring at the recruits still in the shooting gallery, waiting for a decision. The elephant turns and walks away, and the tiger stares through the glass at the dog, who stands alone on one side of the room, apart from the rest of the group. The elephant reappears on the other side of the glass, coming through a door and into the shooting gallery. The recruits follow the elephant out of the shooting gallery into a long hallway, where the elephant motions them off to the left. The dog is the last one out of the room, but it stops as it steps into the hallway where the tiger is outside the door, waiting for it. The dog recognizes it from last night. As they pass an alcove, the dog notices the six other recruits herded into a corner while the elephant pulls a neuralyzer from its pocket, holding it up in front of them as the recruits stare obediently at it and the elephant slips on a pair of black sunglasses. Alien shapes are visible within a photograph where the cat and the elephant are much younger, and in another photograph, a young tiger, in a shirt and tie, holds a bouquet of flowers, staring at the open door of a landed flying saucer. The tiger steers the dog to the right down another corridor, just as long as the first, and another picture shows the 1964 World's Fair grounds still under construction, with giant models of rockets marking the Fair's theme of space travel, most prominently the two tall towers with the flying saucers now mounted at the top of each."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Edwards is shocked and pulls his own umbrella, pointing it at Kay's shoulder, then whirls around to see Jeebs' body growing another nose, which takes only four or five seconds. Kay raises the umbrella again, threatening, and Jeebs nods, the point taken. Edwards, still dazed by Jeebs' regrown nose, glances down at all the umbrellas as Kay leaves. The flashlight dims on Edwards and Kay, sitting at a table in a French bakery where Edwards takes the remaining stool. Zed continues addressing the recruits, who all turn and regard Edwards a little smugly while Edwards's foot is indeed up. Then one of the young recruits eagerly raises his foot, and Zed calls on him. Edwards tries to stifle a sneeze but can't while Zed looks into the wardrobe. Most obvious in the frozen tableau of creatures is a lunging, snarling beast with three pencil holes in its chest, next to a massively deformed humanoid creature with a large spoon for a head with three holes in it. In the back corner of the wardrobe, there is a single pen mark on a pretty eight-year-old girl, and Zed sighs, with sideways glances from the other recruits. Zed and Kay stand behind frosted glass, staring at the recruits still in the dance hall, waiting for a decision. Zed turns and walks away, and Kay stares through the glass at Edwards, who stands alone on one side of the runway, apart from the rest of the group. Zed reappears on the other side of the glass, coming through a window and into the dance hall. The recruits follow Zed out of the dance hall into a long tunnel, where Zed motions them off to the left. Edwards is the last one out of the runway, but he stops as he steps into the tunnel where Kay is outside the window, waiting for him. Edwards recognizes him from last week. As they pass an amphitheater, Edwards notices the six other recruits herded into a corner while Zed pulls a telescope from his pocket, holding it up in front of them as the recruits stare obediently at it and Zed slips on a pair of red earmuffs. Alien shapes are visible within a postcard where Dee and Zed are much younger, and in another postcard, a young Kay, in a jacket and bowtie, holds a string of pearls, staring at the open window of a landed hot air balloon. Kay steers Edwards to the right down another passageway, just as long as the first, and another postcard shows the 1964 World's Fair grounds still under construction, with giant models of trains marking the Fair's theme of transportation, most prominently the two tall towers with the hot air balloons now mounted at the top of each."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Edwards is surprised and drops his own weapon, waving it in Kay's direction, then spins around to notice Jeebs' body developing another arm, which takes only four or five seconds. Kay lowers the weapon again, gesturing, and Jeebs shrugs, the message received. Edwards, still puzzled by Jeebs' newly grown arm, peers up at all the weapons as Kay exits. The flash brightens on Edwards and Kay, lounging at a table in a Chinese restaurant where Edwards pushes the remaining chair. Zed pauses addressing the recruits, who all turn and eye Edwards a little smugly while Edwards's hand is indeed down. Then one of the young recruits shyly lowers his hand, and Zed glances at him. Edwards tries to hide a sneeze but fails while Zed peers into the gallery. Most clear in the frozen tableau of creatures is a crouching, grinning beast with three stitches on its chest, next to a massively deformed humanoid creature with a large hook for a leg with three stitches on it. In the back corner of the gallery, there is a single patch on a pretty eight-year-old girl, and Zed smiles, with sideways glances to the other recruits. Zed and Kay stand behind smoked glass, examining the recruits still in the shooting gallery, waiting for an action. Zed pivots and strides away, and Kay peers through the glass at Edwards, who sits alone on one side of the room, apart from the rest of the group. Zed reappears on the other side of the glass, slipping through a door and out of the shooting gallery. The recruits trail Zed out of the shooting gallery into a long hallway, where Zed directs them off to the right. Edwards is the last one out of the room, but he hesitates as he steps into the hallway where Kay is inside the door, waiting for him. Edwards remembers him from last night. As they pass an alcove, Edwards notices the six other recruits organized into a line while Zed retrieves a notebook from his pocket, waving it up in front of them as the recruits glance curiously at it and Zed puts on a pair of red sunglasses. Alien shapes are visible within a painting where Dee and Zed are much older, and in another painting, a young Kay, in a jacket and hat, holds a stack of books, staring at the closed door of a landed flying saucer. Kay guides Edwards to the left down another corridor, just as long as the first, and another picture shows the 1964 World's Fair grounds still under demolition, with giant models of submarines marking the Fair's theme of underwater exploration, most prominently the two short towers with the flying saucers now mounted at the base of each."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Harrison is startled and pulls his own flashlight, pointing it at Leo's shoulder, then twirls around to see Marvin's shoes growing another shoulder, which takes only four or five minutes. Leo raises the flashlight again, threatening, and Marvin nods, the point taken. Harrison, still bewildered by Marvin's regrown shoulder, glances down at all the flashlights as Leo exits. The light dims on Harrison and Leo, sitting at a bench in a French buffet where Harrison takes the remaining stool. Beth continues discussing the tourists, who all turn and regard Harrison a little smugly while Harrison's foot is indeed up. Then one of the older tourists eagerly raises his foot, and Beth calls on him. Harrison tries to suppress a cough but can't while Beth looks into the museum. Most notable in the frozen scene of machines is a jumping, growling statue with three paint splatters on its leg, next to a massively deformed robotic statue with a large hook for a shoulder with three splatters on it. In the back corner of the museum, there is a single paint splatter on a cheerful eight-year-old statue, and Beth sighs, with sideways glances from the other tourists. Beth and Leo stand behind tinted glass, staring at the tourists still in the art gallery, waiting for a decision. Beth turns and walks away, and Leo stares through the glass at Harrison, who stands alone on one side of the park, apart from the rest of the group. Beth reappears on the other side of the glass, coming through a gate and into the art gallery. The tourists follow Beth out of the art gallery into a wide avenue, where Beth motions them off to the right. Harrison is the last one out of the park, but he stops as he steps into the avenue where Leo is outside the gate, waiting for him. Harrison recognizes him from last week. As they pass a niche, Harrison notices the six other tourists herded into a corner while Beth pulls a camera from his backpack, holding it up in front of them as the tourists stare obediently at it and Beth slips on a pair of white gloves. Robot models are visible within a painting where Dee and Beth are much younger, and in another painting, a young Leo, in a sweater and scarf, holds a box of chocolates, staring at the open passage of a landed yacht. Leo guides Harrison to the left down another corridor, just as wide as the first, and another painting shows the 1964 Science Expo grounds still under construction, with giant models of rockets marking the Expo's theme of ocean travel, most prominently the two tall masts with the yachts now mounted at the top of each."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Anderson is bewildered and drops his own hat, tossing it at Zack's feet, then pirouettes around to witness Jeebs' body shrinking another arm, which consumes only four or five seconds. Zack lowers the hat again, threatening, and Jeebs shrugs, the message received. Anderson, still baffled by Jeebs' shrunk arm, peers down at all the hats as Zack departs. The light dims on Anderson and Zack, sitting at a booth in a Mexican restaurant where Anderson picks up the additional napkin. Max continues observing the trainees, who all turn and approach Anderson a little slyly while Anderson's foot is indeed tapping. Then one of the senior trainees hastily waves his hand, and Max glances at him. Anderson attempts to stifle a cough but fails while Max glances into the room. Most prominent in the static display of creatures is a creeping, calm creature with three bite marks in its tail, beside a hugely reshaped aquatic creature with a giant fin for a face with three dots on it. In the far edge of the room, there is a single paint splatter on a lovely eight-year-old boy, and Max groans, with sidelong glances from the other trainees. Max and Zack stand behind tinted glass, observing the trainees still in the exhibition room, anticipating a choice. Max turns and strolls away, and Zack gazes through the glass at Anderson, who stands solitary on one side of the space, separate from the rest of the crowd. Max reappears on the opposite side of the glass, entering through a hatch and into the exhibition room. The trainees trail Max out of the exhibition room into a long corridor, where Max gestures them off to the right. Anderson is the last one out of the space, but he pauses as he steps into the corridor where Zack is inside the doorway, expecting him. Anderson recalls him from the previous evening. As they pass a recess, Anderson observes the six additional trainees huddled into a section while Max removes a flashlight from his satchel, lifting it up in front of them as the trainees gaze keenly at it and Max dons a pair of red sunglasses. Alien outlines are discernible within a painting where Lee and Max are much older, and in another painting, an elderly Zack, in a suit and hat, carries a bouquet of vegetables, peering at the closed window of a parked hovercraft. Zack guides Anderson to the left down another walkway, just as lengthy as the first, and another illustration shows the 1964 World's Fair grounds fully completed, with small sculptures of planets marking the Fair's theme of time travel, most prominently the two short spires with the spacecraft now attached at the base of each."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Edwards is startled and tosses his own sandwich, aiming it at Kay's ear, then twirls around to watch Jeebs' arm growing another leg, which takes only four or five minutes. Kay lowers the umbrella again, inviting, and Jeebs agrees, the message understood. Edwards, still stunned by Jeebs' extra leg, gazes down at all the bicycles as Kay departs. The light brightens on Edwards and Kay, sitting at a couch in a French bakery where Edwards occupies the vacant stool. Zed continues lecturing the dancers, who all twist and observe Edwards a little proudly while Edwards's foot is indeed wiggling. Then one of the young dancers excitedly claps his foot, and Zed selects him. Edwards tries to suppress a giggle but can't while Zed peers into the mural. Most noticeable in the painted panorama of landscapes is a leaping, roaring lion with three paint splashes on its mane, next to a massively swollen humanoid sculpture with a large hook for a nose with three lines across it. In the back stretch of the mural, there is a single paint mark on a lovely eight-year-old dolphin, and Zed chuckles, with sideways glances from the other dancers. Zed and Kay stand behind tinted curtains, gazing at the dancers still in the pottery studio, awaiting a question. Zed shifts and skips away, and Kay gazes through the curtains at Edwards, who stands alone on one edge of the studio, separate from the rest of the ensemble. Zed reappears on the other side of the fabric, entering through a window and into the pottery studio. The dancers trail Zed out of the pottery studio into a narrow corridor, where Zed gestures them off to the right. Edwards is the last one out of the studio, but he pauses as he hops into the corridor where Kay is near the window, waiting for him. Edwards remembers him from earlier today. As they approach an elbow in the hallway, Edwards notices the six other dancers gathered into a circle while Zed pulls an eraser from his backpack, raising it in front of them as the dancers gaze curiously at it and Zed slips on a pair of yellow goggles. Alien forms are visible within a painting where Dee and Zed are much older, and in another painting, a young Kay, in a sweater and jeans, holds a box of chocolates, gazing at the closed portal of a submerged submarine. Kay guides Edwards to the left down another passageway, just as narrow as the first, and another picture shows the 1976 Olympics site still being dismantled, with giant models of bicycles marking the event's theme of global unity, most noticeably the two short beams with the kites now soaring at the end of each."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Martinez is astonished and grabs his own umbrella, aiming it at Luna's shoulder, then spins around to see Nibbles' shadow sprouting another arm, which takes only four or five minutes. Luna lifts the umbrella again, menacingly, and Nibbles winks, understanding the message. Martinez, still bewildered by Nibbles' regenerated arm, peeks at all the gadgets as Luna departs. The light fades on Martinez and Luna, lounging at a counter in an Italian bistro where Martinez slides onto the remaining stool. Vlad continues lecturing the cadets, who all pivot and observe Martinez somewhat haughtily while Martinez's finger is indeed raised. Then one of the junior cadets enthusiastically lifts his finger, and Vlad addresses him. Martinez attempts to suppress a chuckle but fails while Vlad peers into the exhibition area. Most prominent in the still scene of critters is a leaping, growling monster with three ink stains on its back, next to a completely misshapen robotic entity with a massive wrench for a face with three dents in it. In the rear section of the exhibition area, there is a single paint stain on a lovely eight-year-old doll, and Vlad groans, with sideward glances from the other cadets. Vlad and Luna stand behind mirrored glass, glaring at the cadets still in the target range, anticipating a choice. Vlad pivots and strides away, and Luna gazes through the glass at Martinez, who lingers alone on one side of the chamber, distinct from the remainder of the bunch. Vlad reappears on the alternate side of the glass, coming through a curtain and into the target range. The cadets trail Vlad out of the target range into an elongated corridor, where Vlad gestures them off to the right. Martinez is the last one out of the chamber, but he halts as he progresses into the corridor where Luna is beside the curtain, anticipating his arrival. Martinez recognizes him from yesterday. As they pass a niche, Martinez observes the six other cadets corralled into a nook while Vlad extracts a harmonica from his satchel, holding it aloft in front of them as the cadets gawk obediently at it and Vlad dons a pair of green spectacles. Mythical figures are apparent within an illustration where Rex and Vlad are much younger, and in another illustration, a young Luna, in a vest and shorts, holds a basket of apples, gazing at the open curtain of a landed hot air balloon. Luna directs Martinez to the left down a different passageway, just as long as the initial one, and another illustration reveals the 1964 Expo Park lands still under assembly, with enormous replicas of skyscrapers indicating the Expo's motif of city life, most notably the two towering spires with the hot air balloons now affixed at the peak of each."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Edwards, shocked by Jeebs' regenerating head, watches as Kay threatens Jeebs to make a point. Later, Edwards joins recruits in a Chinese restaurant where Zed addresses them, witnessing bizarre creatures in a shooting gallery. A young recruit raises his hand eagerly, and Edwards laughs, catching Zed's disapproval. Zed and Kay observe the recruits from behind glass, contemplating a decision. As Zed leaves, Kay remains to scrutinize Edwards, who stands apart. Zed leads recruits from the gallery into a hallway, where he prepares to neuralyze them. Edwards lingers, recognizing Kay, and notices recruits obediently staring at Zed’s neuralyzer. Kay guides Edwards down another hallway filled with photographs depicting alien encounters and the 1964 World's Fair, symbolizing space travel."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "the two tall towers with the flying saucers now mounted at the top of each Kay steers Edwards to the right down another corridor just as long as the first and another picture shows the 1964 World's Fair grounds still under construction with giant models of rockets marking the Fair's theme of space travel most prominently Alien shapes are visible within a photograph where Dee and Zed are much younger and in another photograph a young Kay in a shirt and tie holds a bouquet of flowers staring at the open door of a landed flying saucer As they pass an alcove Edwards notices the six other recruits herded into a corner while Zed pulls a neuralyzer from his pocket holding it up in front of them as the recruits stare obediently at it and Zed slips on a pair of black sunglasses Edwards recognizes him from last night Edwards is the last one out of the room but he stops as he steps into the hallway where Kay is outside the door waiting for him The recruits follow Zed out of the shooting gallery into a long hallway where Zed motions them off to the left Zed reappears on the other side of the glass coming through a door and into the shooting gallery Zed turns and walks away and Kay stares through the glass at Edwards who stands alone on one side of the room apart from the rest of the group Zed and Kay stand behind smoked glass staring at the recruits still in the shooting gallery waiting for a decision In the back corner of the gallery there is a single bullet hole in a pretty eightyearold girl and Zed sighs with sideways glances from the other recruits Most obvious in the frozen tableau of creatures is a lunging snarling beast with three bullet holes in its chest next to a massively deformed humanoid creature with a large hook for a head with three holes in it Edwards tries to stifle a laugh but cannot while Zed looks into the gallery Then one of the young recruits eagerly raises his hand and Zed calls on him Zed continues addressing the recruits who all turn and regard Edwards a little smugly while Edwards's hand is indeed up The flash dims on Edwards and Kay sitting at a table in a Chinese restaurant where Edwards takes the remaining chair Edwards still dazed by Jeebs' regrown head glances down at all the weapons as Kay leaves Kay raises the weapon again threatening and Jeebs nods the point taken Edwards is shocked and pulls his own weapon pointing it at Kay's head then whirls around to see Jeebs' body growing another head which takes only four or five seconds"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Edwards recognizes him from last night Edwards is the last one out of the room but he stops as he steps into the hallway where Kay is outside the door waiting for him Zed continues addressing the recruits who all turn and regard Edwards a little smugly while Edwards's hand is indeed up Zed and Kay stand behind smoked glass staring at the recruits still in the shooting gallery waiting for a decision Then one of the young recruits eagerly raises his hand and Zed calls on him As they pass an alcove Edwards notices the six other recruits herded into a corner while Zed pulls a neuralyzer from his pocket holding it up in front of them as the recruits stare obediently at it and Zed slips on a pair of black sunglasses Kay steers Edwards to the right down another corridor just as long as the first and another picture shows the 1964 World's Fair grounds still under construction with giant models of rockets marking the Fair's theme of space travel most prominently Edwards tries to stifle a laugh but cannot while Zed looks into the gallery The recruits follow Zed out of the shooting gallery into a long hallway where Zed motions them off to the left Alien shapes are visible within a photograph where Dee and Zed are much younger and in another photograph a young Kay in a shirt and tie holds a bouquet of flowers staring at the open door of a landed flying saucer Zed turns and walks away and Kay stares through the glass at Edwards who stands alone on one side of the room apart from the rest of the group Kay raises the weapon again threatening and Jeebs nods the point taken Zed reappears on the other side of the glass coming through a door and into the shooting gallery Edwards still dazed by Jeebs' regrown head glances down at all the weapons as Kay leaves the two tall towers with the flying saucers now mounted at the top of each Most obvious in the frozen tableau of creatures is a lunging snarling beast with three bullet holes in its chest next to a massively deformed humanoid creature with a large hook for a head with three holes in it In the back corner of the gallery there is a single bullet hole in a pretty eightyearold girl and Zed sighs with sideways glances from the other recruits Edwards is shocked and pulls his own weapon pointing it at Kay's head then whirls around to see Jeebs' body growing another head which takes only four or five seconds The flash dims on Edwards and Kay sitting at a table in a Chinese restaurant where Edwards takes the remaining chair"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Zed turns and walks away and Kay stares through the glass at Edwards who stands alone on one side of the room apart from the rest of the group Zed reappears on the other side of the glass coming through a door and into the shooting gallery The recruits follow Zed out of the shooting gallery into a long hallway where Zed motions them off to the left Edwards is the last one out of the room but he stops as he steps into the hallway where Kay is outside the door waiting for him Edwards recognizes him from last night As they pass an alcove Edwards notices the six other recruits herded into a corner while Zed pulls a neuralyzer from his pocket holding it up in front of them as the recruits stare obediently at it and Zed slips on a pair of black sunglasses Alien shapes are visible within a photograph where Dee and Zed are much younger and in another photograph a young Kay in a shirt and tie holds a bouquet of flowers staring at the open door of a landed flying saucer Kay steers Edwards to the right down another corridor just as long as the first and another picture shows the 1964 World's Fair grounds still under construction with giant models of rockets marking the Fair's theme of space travel most prominently the two tall towers with the flying saucers now mounted at the top of each Edwards is shocked and pulls his own weapon pointing it at Kay's head then whirls around to see Jeebs' body growing another head which takes only four or five seconds Kay raises the weapon again threatening and Jeebs nods the point taken Edwards still dazed by Jeebs' regrown head glances down at all the weapons as Kay leaves The flash dims on Edwards and Kay sitting at a table in a Chinese restaurant where Edwards takes the remaining chair Zed continues addressing the recruits who all turn and regard Edwards a little smugly while Edwards's hand is indeed up Then one of the young recruits eagerly raises his hand and Zed calls on him Edwards tries to stifle a laugh but cannot while Zed looks into the gallery Most obvious in the frozen tableau of creatures is a lunging snarling beast with three bullet holes in its chest next to a massively deformed humanoid creature with a large hook for a head with three holes in it In the back corner of the gallery there is a single bullet hole in a pretty eightyearold girl and Zed sighs with sideways glances from the other recruits Zed and Kay stand behind smoked glass staring at the recruits still in the shooting gallery waiting for a decision"
        }
      ]
    }
  ]
}