{
  "ground_truth": "The elevator doors slide open on Men in Black headquarters. One of the Worm Aliens answers him in their native tongue and points to the counter. Edwards just stares, fascinated, but Kay grabs him by the arm and hurries him along. Inside, there are piles of sophisticated-looking devices stacked on shelves and tabletops. Edwards picks up a small yellow ball from one of the shelves. They leave the room. On the main floor, they walk briskly across the room, reaching a giant screen on the far wall. The screen displays a map of the world on which thousands of tiny lights blink in all parts of the globe, log lines of data flashing next to them. On the screens, we see live images of aliens. Bony fingers. Edwards, stunned, looks at Kay as 4-Eyes boots her onto the screen: Mean face, cat glasses. Zed, who was standing up close to the screen, walks over to Edwards, sizing him up. Zed's voice comes over. Edwards reaches out and opens a white locker, revealing a black suit hung from a hanger in the middle. On the bottom, a pair of shiny black shoes. Kay is at a computer terminal. On screen are Edwards's birth certificate, driver's license, social security card, library card, everything. Zed's voice continues. Edwards stands in a cramped white booth. He holds both his hands on a ten-fingered keypad, pressing down hard. The pad glows red, a searing sound comes from his hands, and he grimaces as more lasers instantly and (not at all) painlessly change his fingerprints. One by one, Kay deletes Edwards's identity cards. On the computer screen is Edwards' full name -- James Darrel Edwards III. Kay punches a couple keys, and the cursor begins to sweep from right to left, starting to eliminate the rightmost letters of Edwards's name. More letters are eliminated from his name. A tie pushed up. Looking slick and handsome in his extremely sharp suit, James D Edwards III -- or, rather, Jay -- steps into the doorway from the locker room. He slips on the sunglasses. The older man (Rosenberg) is carrying a cat and an ornate rosewood jewelry box. Carefully, he sets the box down and lovingly places the cat on top of it while he locks all five locks on the door to his distinctive shop. A flap of skin, now getting gray and crusty with age, hangs off Edgar's neck as he sits in the front of his Orkin van. Across the street, Edgar sees a short, older man come out of one of the jewelry shops on Thirty-Fifth Street. That finished, he picks up the cat, then the box, then waddles off down the street, one under each arm.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The lift panels glide ajar at Men in Black headquarters. One of the Worm Extraterrestrials responds to him in their indigenous dialect and gestures to the counter. Edwards merely gazes, captivated, but Kay seizes him by the limb and rushes him onward. Within, there are heaps of advanced-appearing gadgets arrayed on ledges and countertops. Edwards selects a tiny amber orb from one of the ledges. They exit the chamber. On the main level, they stride swiftly across the space, approaching a vast display on the distant partition. The display exhibits a chart of the planet on which innumerable minuscule lights flicker in all regions of the earth, log strings of statistics flickering adjacent to them. On the displays, we observe real-time visuals of extraterrestrials. Angular digits. Edwards, astonished, glances at Kay as 4-Eyes propels her onto the display: Severe visage, feline spectacles. Zed, who was standing near to the display, proceeds over to Edwards, appraising him. Zed's voice echoes over. Edwards extends outward and unseals a pale storage unit, disclosing a dark attire suspended from a hook in the center. On the base, a set of gleaming black footwear. Kay is at a computing station. On display are Edwards's birth record, driving permit, social security identification, library identification, everything. Zed's voice resumes. Edwards stands in a confined white cubicle. He holds both his hands on a ten-digit keypad, pressing down firmly. The pad glows crimson, a scorching noise emanates from his hands, and he winces as more lasers promptly and (not at all) painlessly modify his fingerprints. One by one, Kay erases Edwards's identity identifications. On the computing display is Edwards' complete name -- James Darrel Edwards III. Kay taps a couple keys, and the cursor begins to traverse from right to left, commencing to obliterate the rightmost letters of Edwards's name. More letters are obliterated from his appellation. A necktie shoved upward. Appearing sleek and attractive in his exceedingly sharp attire, James D Edwards III -- or, rather, Jay -- steps into the portal from the storage area. He slips on the shades. The elder gentleman (Rosenberg) is bearing a feline and an elaborate rosewood trinket container. Delicately, he places the container down and affectionately positions the feline atop it while he secures all five bolts on the portal to his unique shop. A fold of epidermis, now becoming gray and crusty with age, suspends from Edgar's throat as he sits in the front of his Orkin vehicle. Across the thoroughfare, Edgar notices a diminutive, older gentleman emerge from one of the trinket shops on Thirty-Fifth Street. That completed, he lifts the feline, then the container, then waddles off down the thoroughfare, one under each limb."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The elevator doors are slid open on Men in Black headquarters. He is answered by one of the Worm Aliens in their native tongue, who points to the counter. Edwards is just stared at, fascinated, but he is grabbed by the arm by Kay and hurried along. Inside, piles of sophisticated-looking devices are stacked on shelves and tabletops. A small yellow ball is picked up by Edwards from one of the shelves. The room is left by them. On the main floor, the room is briskly walked across by them, reaching a giant screen on the far wall. A map of the world is displayed on the screen, on which thousands of tiny lights blink in all parts of the globe, and log lines of data are flashed next to them. Live images of aliens are seen on the screens. Bony fingers. Kay is looked at by Edwards, stunned, as 4-Eyes boots her onto the screen: Mean face, cat glasses. Edwards is walked over to by Zed, who was standing up close to the screen, sizing him up. The voice of Zed comes over. A white locker is reached out to and opened by Edwards, revealing a black suit hung from a hanger in the middle. On the bottom, a pair of shiny black shoes is seen. Edwards's birth certificate, driver's license, social security card, library card, everything are on screen at a computer terminal by Kay. Zed continues his voice. In a cramped white booth, Edwards stands. Both his hands are held on a ten-fingered keypad by him, pressing down hard. The pad is glowed red, a searing sound is made from his hands, and he grimaces as more lasers instantly and (not at all) painlessly change his fingerprints. Edwards's identity cards are deleted one by one by Kay. Edwards' full name -- James Darrel Edwards III is on the computer screen. A couple of keys are punched by Kay, and the cursor begins to sweep from right to left, starting to eliminate the rightmost letters of Edwards's name. More letters are eliminated from his name. A tie is pushed up. Looking slick and handsome in his extremely sharp suit, Jay -- formerly James D Edwards III -- steps into the doorway from the locker room. The sunglasses are slipped on by him. The cat and an ornate rosewood jewelry box are carried by the older man (Rosenberg). The box is set down carefully by him, and the cat is lovingly placed on top of it while all five locks on the door to his distinctive shop are locked by him. A flap of skin, now getting gray and crusty with age, hangs off Edgar's neck as he is sat in the front of his Orkin van. Across the street, a short, older man is seen by Edgar coming out of one of the jewelry shops on Thirty-Fifth Street. That finished, the cat is picked up by him, then the box, then he waddles off down the street, one under each arm."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The elevator doors open at Men in Black headquarters. A Worm Alien speaks in its native tongue, pointing to the counter. Edwards stares, fascinated, while Kay hurries him along. Inside, sophisticated devices are on shelves. Edwards picks up a small yellow ball, and they exit the room. On the main floor, they reach a large screen showing a world map with blinking lights and data. The screen shows live alien images. Edwards looks at Kay as 4-Eyes projects on the screen. Zed approaches Edwards, assessing him. Edwards opens a white locker, revealing a black suit and shiny shoes. Kay is at a terminal displaying Edwards's IDs, including his birth certificate. Zed's voice continues. In a cramped booth, Edwards presses a ten-fingered keypad, grimacing as lasers change his fingerprints. Kay deletes Edwards's identity cards, starting with his full name—James Darrel Edwards III. Kay removes more letters. Dressed sharply, Jay steps from the locker room, slipping on sunglasses. An older man (Rosenberg), carrying a cat and jewelry box, locks his shop's door. Edgar, in an Orkin van, watches the man from across the street on Thirty-Fifth Street as he walks off, carrying the cat and box under each arm."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The elevator doors open at Men in Black headquarters. A Worm Alien points Edwards to the counter in their native tongue. Fascinated, Edwards observes, but Kay hurries him along. Inside, devices stack on shelves. Edwards picks a small yellow ball and they exit. On the main floor, they reach a giant screen showing a world map with blinking lights and alien images. Edwards is stunned as Zed approaches. Edwards opens a locker, revealing a black suit and shiny black shoes. Kay deletes Edwards's identity cards on a computer showing his details, like his birth certificate, as Zed speaks. Edwards stands in a booth, pressing a keypad that sears his fingertips, changing his prints painlessly. Kay deletes Edwards's name, and Jay emerges from the locker room, looking slick in his suit and sunglasses. An older man, Rosenberg, carrying a cat and jewelry box, locks his shop and leaves. Edgar, in his Orkin van, sees the man across the street leave with the cat and box."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The polished metal doors of the elevator slide open smoothly, revealing the bustling hub of Men in Black headquarters. Almost immediately, one of the Worm Aliens responds to him, chattering in their own unique native tongue while gesturing towards the counter. Edwards stands there and just stares, utterly captivated by the scene before him. However, Kay quickly and firmly grabs him by the arm, urging him to move along swiftly. Inside the headquarters, there are towering piles of sophisticated-looking devices carefully stacked on both shelves and various tabletops. Edwards's attention is caught by a small, intriguing yellow ball, which he picks up from one of the overfilled shelves. They exit the room without lingering.\n\nOn the expansive main floor, they walk with purpose across the room and eventually come to a stop in front of a massive screen positioned on the far wall. This screen prominently displays a detailed map of the world, illuminated by thousands of tiny points of light that blink continuously across all parts of the globe. Alongside them, lines of data flash rapidly. The screen also broadcasts live images of aliens with distinctive features, such as bony fingers. Edwards, utterly stunned by this revelation, turns to look at Kay just as 4-Eyes boots her way onto the screen, her mean face framed by cat-eye glasses. Zed, having been standing near the screen, approaches Edwards and begins to size him up with keen interest. Zed's voice resonates in the room. Edwards reaches out and opens a pristine white locker, which reveals a sleek black suit perfectly hung on a hanger in the center. On the bottom of the locker rests a pair of shiny, polished black shoes.\n\nMeanwhile, Kay is stationed at a nearby computer terminal, where a screen displays a comprehensive overview of Edwards's identity, including his birth certificate, driver's license, social security card, library card, and more. Zed's voice continues to fill the space. Edwards then stands inside a cramped white booth, placing both of his hands firmly on a ten-fingered keypad. He presses down with force, causing the pad to glow a bright red, and a searing sound emanates from his hands as he grimaces. Laser beams immediately change his fingerprints, though they promise to be (not at all) painless. Methodically, one by one, Kay deletes each of Edwards's identity cards. On the computer screen, his full name—James Darrel Edwards III—appears in bold letters. Kay taps a couple of keys, and the cursor moves from right to left, beginning the process of eliminating the rightmost letters of Edwards's name. More letters vanish from his name. A tie is pushed up, and now looking slick and handsome in his extremely sharp suit, the man formerly known as James D Edwards III—now simply Jay—steps confidently into the doorway from the locker room. He stylishly slips on a pair of sunglasses.\n\nMeanwhile, an older man known as Rosenberg is seen carrying both a cat and an ornate rosewood jewelry box. With great care, he sets the beautiful box down and gently places the cat on top of it while meticulously locking all five locks on the door to his unique and distinctive shop. Across the street, Edgar, whose neck shows a flap of skin now turning gray and crusty with age, sits in the front seat of his Orkin van. From this vantage point, Edgar observes as a short, older man exits from one of the jewelry shops situated on Thirty-Fifth Street. Having completed his task, the older man picks up the cat and the box once more, then waddles off down the street with one under each arm."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The smooth, polished metal doors of the elevator glide open seamlessly, unveiling the vibrant and bustling hub that is the headquarters of the Men in Black organization. Almost at once, one of the Worm Aliens responds to Edwards, chattering animatedly in their own distinct and unique native language while gesturing enthusiastically towards the counter. Edwards stands frozen, simply staring, utterly captivated by the fascinating scene unfolding before him. However, Kay swiftly and firmly grabs him by the arm, urging him to move forward quickly without delay. Inside the headquarters, there are towering piles of sophisticated-looking devices meticulously stacked on both the shelves and various tabletops. Edwards’s attention is irresistibly drawn to a small, intriguing yellow ball, which he carefully picks up from one of the overfilled shelves. Without lingering, they exit the room.\n\nOn the expansive main floor, they stride purposefully across the room and eventually come to a halt in front of a gigantic screen that is prominently positioned on the far wall. This screen vividly displays a detailed map of the world, illuminated by thousands of tiny points of light that blink continuously across all areas of the globe. Alongside them, lines of data flash rapidly. Additionally, the screen broadcasts live images of aliens possessing distinctive features, such as bony fingers. Edwards, completely astounded by this new revelation, turns to look at Kay, just as 4-Eyes makes her way onto the screen, her mean face framed by stylish cat-eye glasses. Zed, who has been standing near the screen, approaches Edwards with keen interest, beginning to size him up. Zed’s voice resonates throughout the room. Edwards reaches out and opens a pristine white locker, finding a sleek black suit perfectly hung on a hanger in the center. At the bottom of the locker lies a pair of shiny, polished black shoes.\n\nMeanwhile, Kay is stationed at a nearby computer terminal where a screen displays a comprehensive overview of Edwards’s identity, including his birth certificate, driver's license, social security card, library card, and more. Zed's voice continues to fill the space. Edwards then stands inside a cramped white booth, placing his hands firmly on a ten-fingered keypad. He presses down forcefully, causing the pad to glow a bright red, and a searing sound emanates from his hands as he grimaces in discomfort. Laser beams instantly alter his fingerprints, though they assure him it will be (not at all) painless. Methodically, one by one, Kay deletes each of Edwards’s identity cards. On the computer screen, his full name—James Darrel Edwards III—boldly appears. Kay taps a couple of keys, causing the cursor to move from right to left, initiating the process of erasing the rightmost letters of Edwards’s name. More letters continue to vanish from his name. A tie is adjusted, and now, looking slick and handsome in his impeccably sharp suit, the man formerly known as James D Edwards III—now simply Jay—steps confidently into the doorway from the locker room. He effortlessly slips on a pair of stylish sunglasses.\n\nMeanwhile, an older man, known as Rosenberg, is seen carefully carrying both a cat and an ornate rosewood jewelry box. With great care, he sets the beautiful box down and gently places the cat atop it while meticulously locking all five locks on the door to his unique and distinctive shop. Across the street, Edgar, whose neck reveals a flap of skin now turning gray and crusty with age, sits in the front seat of his Orkin van. From this vantage point, he observes as a short, older man exits one of the jewelry shops situated on Thirty-Fifth Street. Having completed his task, the older man picks up the cat and the box once more, then waddles down the street with one under each arm."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the elevator doors glide open at the Men in Black headquarters, revealing the interior to its occupants, one of the Worm Aliens acknowledges Edwards by speaking in their native language and simultaneously gestures towards the counter in a manner that suggests direction. Edwards finds himself captivated by the scene, perhaps caught in the novelty or complexity of the exchange, but his moment of wonder is abruptly cut short as Kay firmly grasps his arm, prompting him to move forward with urgency. Inside the headquarters, they traverse a space cluttered with shelves and tabletops that hold an array of advanced and seemingly complex devices, each exuding an air of sophistication. Within this environment, Edwards reaches out and selects a small yellow ball from one of the shelves, examining it briefly before they proceed to exit the room. Once they reach the main floor, Edwards and Kay maintain a quick pace as they traverse the expanse of the room, their steps purposeful as they make their way towards a towering screen affixed to the far wall. This screen commands attention by displaying a detailed map of the world, with countless minuscule lights blinking persistently across various global locations, accompanied by rapid streams of data. Amidst these visuals, live images of aliens with bony fingers are visible, capturing Edwards's stunned attention as he turns to Kay for understanding. At the same time, 4-Eyes projects her formidable visage, complete with mean expression and distinctive cat glasses, onto the screen. Zed, having been positioned near the screen, approaches Edwards, assessing him with a discerning eye, while his voice echoes in the room. Edwards, responding to an implied or direct instruction, extends his hand to open a white locker, uncovering a meticulously hung black suit and a pair of glossy black shoes beneath it. Meanwhile, Kay is stationed at a computer terminal where the screen displays Edwards's complete array of identity documents, including his birth certificate, driver's license, social security card, and library card, as Zed's narrative continues. Moments later, Edwards finds himself standing in a confined white booth, where he places his hands firmly onto a ten-fingered keypad. He applies pressure as the pad illuminates in red, accompanied by a sharp sound that seems to emanate from his hands, and he winces as lasers swiftly and efficiently alter his fingerprints in a manner that is discomforting, yet devoid of pain. At the computer terminal, Kay systematically deletes each of Edwards's identity cards, while the monitor prominently displays his full name—James Darrel Edwards III. With decisive keystrokes, Kay initiates a process where the cursor methodically erases the letters of Edwards's name from right to left, until the name is progressively reduced. Following this transformation, he adjusts his tie, ensuring it is perfectly aligned to complement his newly acquired, sharply tailored suit, and thereby establishing his fresh identity as Jay. He proceeds confidently from the locker room, completing his look with a pair of sunglasses, which he slides into place. Meanwhile, an older man identified as Rosenberg is depicted carrying both a cat and an ornate rosewood jewelry box. With care and attention, he places the box down and gently positions the cat on top of it, while simultaneously securing his distinctive shop by engaging all five locks on the door. Across the street, Edgar, seated in the front of his Orkin van, is characterized by a flap of skin on his neck, now showing signs of age as it becomes gray and crusty. Edgar's attention is captured by the sight of a short, older man emerging from one of the jewelry shops on Thirty-Fifth Street. Once the man completes his task, he gathers the cat first, followed by the jewelry box, and then waddles down the street, balancing each item under his arms."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The elevator doors slide open at Men in Black headquarters. A Worm Alien responds in its native tongue and gestures toward the counter, prompting Kay to hurry a fascinated Edwards along. Inside, surrounded by sophisticated devices, Edwards picks up a small yellow ball before they leave the room. On the main floor, they briskly cross to a giant screen displaying a global map with data lines and live alien images. As Edwards is transfixed by the screen, Zed assesses him and speaks. Edwards opens a locker, revealing a black suit and shiny shoes. Meanwhile, Kay, at a computer terminal, deletes Edwards's identity cards, as Zed speaks over the intercom. Edwards stands in a white booth, pressing a ten-fingered keypad that alters his fingerprints painlessly. Kay erases Edwards's name on the computer screen until only \"Jay\" remains. Now dressed sharply in his new suit and sunglasses, Jay steps out from the locker room. Elsewhere, Rosenberg, carrying a cat and a rosewood jewelry box, secures his shop and lovingly places the cat on the box before locking up. Edgar, in his Orkin van, watches Rosenberg emerge from a jewelry shop across the street. Rosenberg then picks up the cat and box and waddles off down the street with them."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The elevator doors slide open on Men in Black headquarters, a top-secret agency responsible for monitoring extraterrestrial activity on Earth. One of the Worm Aliens, a species known for its long, slender physique and quick wit, answers him in their native tongue and points to the counter. Edwards just stares, fascinated by the presence of actual aliens, but Kay grabs him by the arm and hurries him along, understanding the urgency of their mission. Inside, there are piles of sophisticated-looking devices stacked on shelves and tabletops, resembling advanced technology from various alien worlds. Edwards picks up a small yellow ball from one of the shelves, a device known to temporarily disrupt gravitational fields. They leave the room. On the main floor, they walk briskly across the room, reaching a giant screen on the far wall. The screen displays a map of the world on which thousands of tiny lights blink in all parts of the globe, representing alien activity, with log lines of data flashing next to them. On the screens, we see live images of aliens, their bony fingers tapping away at mysterious controls. Edwards, stunned, looks at Kay as 4-Eyes, an alien with remarkable ocular abilities, boots her onto the screen: mean face, cat glasses. Zed, the stern and seasoned head of the Men in Black, who was standing up close to the screen, walks over to Edwards, sizing him up with a sharp, discerning gaze. Zed's voice comes over, carrying an authority that demands attention. Edwards reaches out and opens a white locker, revealing a black suit hung from a hanger in the middle, the traditional attire for Men in Black agents. On the bottom, a pair of shiny black shoes, perfectly polished. Kay is at a computer terminal, accessing classified databases. On screen are Edwards's birth certificate, driver's license, social security card, library card, everything that defines his civilian identity. Zed's voice continues, explaining the necessity of shedding his former life. Edwards stands in a cramped white booth, he holds both his hands on a ten-fingered keypad, pressing down hard as the pad glows red. A searing sound comes from his hands, and he grimaces as more lasers instantly and, despite appearances, painlessly change his fingerprints, erasing his past identity. One by one, Kay deletes Edwards's identity cards. On the computer screen is Edwards' full name -- James Darrel Edwards III. Kay punches a couple of keys, and the cursor begins to sweep from right to left, starting to eliminate the rightmost letters of Edwards's name, symbolizing his transformation into a man with no past. More letters are eliminated from his name. A tie pushed up. Looking slick and handsome in his extremely sharp suit, James D Edwards III -- or, rather, Jay, his new identity as an agent -- steps into the doorway from the locker room. He slips on the sunglasses, a signature look for blending in and protecting against neuralyzer flashes. The older man, Rosenberg, a known alien jeweler who maintains ties with various intergalactic factions, is carrying a cat and an ornate rosewood jewelry box, a container likely holding something of great importance. Carefully, he sets the box down and lovingly places the cat on top of it while he locks all five locks on the door to his distinctive shop, a precaution signaling the value of his possessions. A flap of skin, now getting gray and crusty with age, hangs off Edgar's neck as he sits in the front of his Orkin van, a facade for his hidden alien activities. Across the street, Edgar sees a short, older man come out of one of the jewelry shops on Thirty-Fifth Street, an area renowned for its eclectic mix of shops and clandestine dealings. That finished, he picks up the cat, then the box, then waddles off down the street, one under each arm, carrying his secrets with him."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The elevator doors slide open on. Men in Black headquarters. One of the Worm Aliens answers him in their native tongue and points to the counter. Edwards just stares fascinated but Kay grabs him by the arm and hurries him along. Inside there are piles of sophisticatedlooking devices stacked on shelves and tabletops. Edwards picks up a small yellow ball from one of the shelves. They leave the room. On the main floor they walk briskly across the room reaching a giant screen on the far wall. The screen displays a map of the world on which thousands of tiny lights blink in all parts of the globe log lines of data flashing next to them. On the screens we see live images of aliens. Bony fingers. Edwards stunned looks at Kay as 4Eyes boots her onto the screen. Mean face. cat glasses. Zed who was standing up close to the screen walks over to Edwards sizing him up. Zed's voice comes over. Edwards reaches out and opens a white locker revealing a black suit hung from a hanger in the middle. On the bottom a pair of shiny black shoes. Kay is at a computer terminal. On screen are Edwards's birth certificate driver's license social security card library card everything. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Zed's voice continues. Edwards stands in a cramped white booth. He holds both his hands on a tenfingered keypad pressing down hard. The pad glows red. a searing sound comes from his hands and he grimaces as more lasers instantly and not at all painlessly change his fingerprints. One by one Kay deletes Edwards's identity cards. On the computer screen is Edwards' full name. James Darrel Edwards III. Kay punches a couple keys and the cursor begins to sweep from right to left starting to eliminate the rightmost letters of Edwards's name. More letters are eliminated from his name. A tie pushed up. Looking slick and handsome in his extremely sharp suit. James D Edwards III  or rather Jay  steps into the doorway from the locker room. He slips on the sunglasses. The older man Rosenberg is carrying a cat and an ornate rosewood jewelry box. Carefully he sets the box down and lovingly places the cat on top of it while he locks all five locks on the door to his distinctive shop. A flap of skin now getting gray and crusty with age hangs off Edgar's neck as he sits in the front of his Orkin van. Across the street Edgar sees a short older man come out of one of the jewelry shops on ThirtyFifth Street. That finished. he picks up the cat then the box then waddles off down the street one under each arm."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The elevator doors slide open on. Men in Black headquarters. One of the Worm Aliens answers him in their native tongue and points to the counter. Edwards just stares fascinated but Kay grabs him by the arm and hurries him along. Inside there are piles of sophisticatedlooking devices stacked on shelves and tabletops. Edwards picks up a small yellow ball from one of the shelves. They leave the room. On the main floor they walk briskly across the room reaching a giant screen on the far wall. The screen displays a map of the world on which thousands of tiny lights blink in all parts of the globe log lines of data flashing next to them. On the screens we see live images of aliens. Bony fingers. Edwards stunned looks at Kay as 4Eyes boots her onto the screen. Mean face. cat glasses. Zed who was standing up close to the screen walks over to Edwards sizing him up. Zed's voice comes over. Edwards reaches out and opens a white locker revealing a black suit hung from a hanger in the middle. On the bottom a pair of shiny black shoes. Kay is at a computer terminal. On screen are Edwards's birth certificate driver's license social security card library card everything. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Zed's voice continues. Edwards stands in a cramped white booth. He holds both his hands on a tenfingered keypad pressing down hard. The pad glows red. a searing sound comes from his hands and he grimaces as more lasers instantly and not at all painlessly change his fingerprints. One by one Kay deletes Edwards's identity cards. On the computer screen is Edwards' full name. James Darrel Edwards III. Kay punches a couple keys and the cursor begins to sweep from right to left starting to eliminate the rightmost letters of Edwards's name. More letters are eliminated from his name. A tie pushed up. Looking slick and handsome in his extremely sharp suit. James D Edwards III  or rather Jay  steps into the doorway from the locker room. He slips on the sunglasses. The older man Rosenberg is carrying a cat and an ornate rosewood jewelry box. Carefully he sets the box down and lovingly places the cat on top of it while he locks all five locks on the door to his distinctive shop. A flap of skin now getting gray and crusty with age hangs off Edgar's neck as he sits in the front of his Orkin van. Across the street Edgar sees a short older man come out of one of the jewelry shops on ThirtyFifth Street. That finished. he picks up the cat then the box then waddles off down the street one under each arm."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The elevator doors slide open on. Men in Black headquarters. One of the Worm Aliens answers him in their native tongue and points to the counter. Edwards just stares fascinated but Kay grabs him by the arm and hurries him along. Inside there are piles of sophisticatedlooking devices stacked on shelves and tabletops. Edwards picks up a small yellow ball from one of the shelves. They leave the room. On the main floor they walk briskly across the room reaching a giant screen on the far wall. The screen displays a map of the world on which thousands of tiny lights blink in all parts of the globe log lines of data flashing next to them. On the screens we see live images of aliens. A tie pushed up. Looking slick and handsome in his extremely sharp suit. James D Edwards III  or rather Jay  steps into the doorway from the locker room. He slips on the sunglasses. The older man Rosenberg is carrying a cat and an ornate rosewood jewelry box. Carefully he sets the box down and lovingly places the cat on top of it while he locks all five locks on the door to his distinctive shop. A flap of skin now getting gray and crusty with age hangs off Edgar's neck as he sits in the front of his Orkin van. Across the street Edgar sees a short older man come out of one of the jewelry shops on ThirtyFifth Street. That finished. he picks up the cat then the box then waddles off down the street one under each arm."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The elevator doors slide open on. Men in Black headquarters. One of the Worm Aliens answers him in their native tongue and points to the counter. Edwards just stares fascinated but Kay grabs him by the arm and hurries him along. A flap of skin now getting gray and crusty with age hangs off Edgar's neck as he sits in the front of his Orkin van. Across the street Edgar sees a short older man come out of one of the jewelry shops on ThirtyFifth Street. That finished. he picks up the cat then the box then waddles off down the street one under each arm."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The cathedral gates swing wide at Dinosaur Discovery Center. One of the Stone Giants greets her in their ancient chant and gestures to the bookshelf. Marcus simply gapes, intrigued, but Leo tugs her by the scarf and rushes her onward. Outside, there are towers of antique-looking sculptures scattered on benches and floors. Marcus grabs a tiny green cube from one of the benches. They exit the structure. In the front yard, they stroll leisurely across the grass, approaching a massive fountain on the distant edge. The fountain features a mural of the cosmos on which millions of glowing stars twinkle in all corners of the universe, streams of code scrolling above them. On the mural, we see real-time scenes of creatures. Feathered claws. Marcus, amazed, turns to Leo as Bright-Eyes transports him onto the mural: Stern gaze, dog monocle. Yana, who was seated far from the mural, strides over to Marcus, evaluating him. Yana's whisper floats over. Marcus extends an arm and unseals a silver cabinet, uncovering a gray robe hanging from a peg in the center. Below, a set of glossy red boots. Leo is at a hologram console. Displayed are Marcus's graduation diploma, pilot's badge, guild membership card, club pass, everything. Yana's whisper persists. Marcus waits in a tight silver booth. She rests both her feet on a thirteen-toed panel, stomping firmly. The panel glows blue, a humming sound resonates from her feet, and she winces as beams of light quickly and (entirely) comfortably modify her footprints. Gradually, Leo annihilates Marcus's certification papers. In the hologram view is Marcus's complete moniker -- Jonathan George Marcus IV. Leo taps a series of buttons, and the icon begins to glide from left to right, commencing to remove the leftmost letters of Marcus's identity. Additional letters vanish from her identity. A hat tilted down. Appearing sharp and dashing in her incredibly sleek robe, Jonathan G Marcus IV -- or, notably, Elle -- strides into the corridor from the cabinet area. She dons the monocle. The younger woman (Sullivan) is holding a rabbit and a delicate teak music box. Gently, she positions the box down and tenderly places the rabbit atop it while she secures all seven bolts on the door to her peculiar gallery. A patch of silk, now turning purple and smooth with time, drapes around Sullivan's brow as she relaxes in the back of her Rover truck. In the alley, Sullivan observes a tall, younger woman step out of one of the music galleries on Ninety-Seventh Avenue. Afterward, she gathers the rabbit, then the box, then trudges up the avenue, one balanced on each shoulder."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The elevator doors open at Men in Black headquarters, where Edwards is fascinated by Worm Aliens and their gadgets. Kay hurriedly guides him through the sophisticated equipment. On the main floor, they reach a giant screen displaying global activity and live alien images. Zed evaluates Edwards and presents him with a black suit. At a computer terminal, Kay deletes Edwards's identity, turning him into \"Jay,\" while he undergoes a painless fingerprint alteration in a booth. Now slick in his suit, Jay puts on his sunglasses. Meanwhile, an older man named Rosenberg, carrying a cat and a rosewood jewelry box, secures his shop before leaving. Across the street, Edgar, in his Orkin van, observes Rosenberg exiting the shop with the cat and box under each arm."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "he picks up the cat then the box then waddles off down the street one under each arm That finished Across the street Edgar sees a short older man come out of one of the jewelry shops on ThirtyFifth Street A flap of skin now getting gray and crusty with age hangs off Edgar's neck as he sits in the front of his Orkin van Carefully he sets the box down and lovingly places the cat on top of it while he locks all five locks on the door to his distinctive shop The older man Rosenberg is carrying a cat and an ornate rosewood jewelry box He slips on the sunglasses James D Edwards III  or rather Jay  steps into the doorway from the locker room Looking slick and handsome in his extremely sharp suit A tie pushed up More letters are eliminated from his name Kay punches a couple keys and the cursor begins to sweep from right to left starting to eliminate the rightmost letters of Edwards's name James Darrel Edwards III On the computer screen is Edwards' full name One by one Kay deletes Edwards's identity cards a searing sound comes from his hands and he grimaces as more lasers instantly and not at all painlessly change his fingerprints The pad glows red He holds both his hands on a tenfingered keypad pressing down hard Edwards stands in a cramped white booth Zed's voice continues On screen are Edwards's birth certificate driver's license social security card library card everything Kay is at a computer terminal On the bottom a pair of shiny black shoes Edwards reaches out and opens a white locker revealing a black suit hung from a hanger in the middle Zed's voice comes over Zed who was standing up close to the screen walks over to Edwards sizing him up cat glasses Mean face Edwards stunned looks at Kay as 4Eyes boots her onto the screen Bony fingers On the screens we see live images of aliens The screen displays a map of the world on which thousands of tiny lights blink in all parts of the globe log lines of data flashing next to them On the main floor they walk briskly across the room reaching a giant screen on the far wall They leave the room Edwards picks up a small yellow ball from one of the shelves Inside there are piles of sophisticatedlooking devices stacked on shelves and tabletops Edwards just stares fascinated but Kay grabs him by the arm and hurries him along One of the Worm Aliens answers him in their native tongue and points to the counter Men in Black headquarters The elevator doors slide open on"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Men in Black headquarters The elevator doors slide open on Edwards just stares fascinated but Kay grabs him by the arm and hurries him along One of the Worm Aliens answers him in their native tongue and points to the counter Edwards picks up a small yellow ball from one of the shelves Inside there are piles of sophisticatedlooking devices stacked on shelves and tabletops On the main floor they walk briskly across the room reaching a giant screen on the far wall They leave the room On the screens we see live images of aliens The screen displays a map of the world on which thousands of tiny lights blink in all parts of the globe log lines of data flashing next to them Edwards stunned looks at Kay as 4Eyes boots her onto the screen Bony fingers cat glasses Mean face Zed's voice comes over Zed who was standing up close to the screen walks over to Edwards sizing him up On the bottom a pair of shiny black shoes Edwards reaches out and opens a white locker revealing a black suit hung from a hanger in the middle On screen are Edwards's birth certificate driver's license social security card library card everything Kay is at a computer terminal Edwards stands in a cramped white booth Zed's voice continues The pad glows red He holds both his hands on a tenfingered keypad pressing down hard One by one Kay deletes Edwards's identity cards a searing sound comes from his hands and he grimaces as more lasers instantly and not at all painlessly change his fingerprints James Darrel Edwards III On the computer screen is Edwards' full name More letters are eliminated from his name Kay punches a couple keys and the cursor begins to sweep from right to left starting to eliminate the rightmost letters of Edwards's name Looking slick and handsome in his extremely sharp suit A tie pushed up He slips on the sunglasses James D Edwards III  or rather Jay  steps into the doorway from the locker room Carefully he sets the box down and lovingly places the cat on top of it while he locks all five locks on the door to his distinctive shop The older man Rosenberg is carrying a cat and an ornate rosewood jewelry box Across the street Edgar sees a short older man come out of one of the jewelry shops on ThirtyFifth Street A flap of skin now getting gray and crusty with age hangs off Edgar's neck as he sits in the front of his Orkin van he picks up the cat then the box then waddles off down the street one under each arm That finished"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Zed's voice continues Edwards stands in a cramped white booth He holds both his hands on a tenfingered keypad pressing down hard The pad glows red a searing sound comes from his hands and he grimaces as more lasers instantly and not at all painlessly change his fingerprints One by one Kay deletes Edwards's identity cards On the computer screen is Edwards' full name James Darrel Edwards III Kay punches a couple keys and the cursor begins to sweep from right to left starting to eliminate the rightmost letters of Edwards's name More letters are eliminated from his name A tie pushed up Looking slick and handsome in his extremely sharp suit James D Edwards III  or rather Jay  steps into the doorway from the locker room He slips on the sunglasses The older man Rosenberg is carrying a cat and an ornate rosewood jewelry box Carefully he sets the box down and lovingly places the cat on top of it while he locks all five locks on the door to his distinctive shop A flap of skin now getting gray and crusty with age hangs off Edgar's neck as he sits in the front of his Orkin van Across the street Edgar sees a short older man come out of one of the jewelry shops on ThirtyFifth Street That finished he picks up the cat then the box then waddles off down the street one under each arm The elevator doors slide open on Men in Black headquarters One of the Worm Aliens answers him in their native tongue and points to the counter Edwards just stares fascinated but Kay grabs him by the arm and hurries him along Inside there are piles of sophisticatedlooking devices stacked on shelves and tabletops Edwards picks up a small yellow ball from one of the shelves They leave the room On the main floor they walk briskly across the room reaching a giant screen on the far wall The screen displays a map of the world on which thousands of tiny lights blink in all parts of the globe log lines of data flashing next to them On the screens we see live images of aliens Bony fingers Edwards stunned looks at Kay as 4Eyes boots her onto the screen Mean face cat glasses Zed who was standing up close to the screen walks over to Edwards sizing him up Zed's voice comes over Edwards reaches out and opens a white locker revealing a black suit hung from a hanger in the middle On the bottom a pair of shiny black shoes Kay is at a computer terminal On screen are Edwards's birth certificate driver's license social security card library card everything"
        }
      ]
    }
  ]
}