{
  "ground_truth": "Evelyn is breathing very deeply now. She lifts her head and looks up at him. He's genuinely puzzled. Gittes sighs. She begins to cry softly. Gittes looks over to Evelyn. Her hair covers most of her face from him. There is a long moment of silence. She nods. He gets out and slams the car door. The spray is hitting him full on the top of the head. Gittes is so exhausted he's literally holding onto the nozzle as the water pours down. He shuts the shower off, reaches weakly for a towel, dabs his nose lightly with it. Pads around in elegant silk pajamas. He walks over to the window where morning light is streaming in. He closes the curtains, collapses on the bed, on top of the covers, inert. Gittes lets it go on for a moment, then picks it up without saying anything. Gittes slowly rises to one elbow. He hangs up, falls back down. Gittes swears, picks it up. Before Gittes can say anything, the phone clicks dead. It is a bungalow courtyard with a very narrow walkway and sickly green stucco. Gittes is at the front door. It's slightly ajar. He knocks. He opens it and enters. Morning light filters through the half-open blinds. Dust particles in the shafts of light. It's still and empty. Gittes sees something down the hall, under the legs of a telephone table. Gittes moves toward it. It is grotesque. When he gets closer he can see it's a wilted head of lettuce. Just inside the kitchen some radishes and onions lie on the linoleum. Gittes walks on into the kitchen. Clearing the kitchen counter, Gittes sees Ida Sessions lying on her back on the floor, surrounded by the groceries from a broken bag. Ice cream has melted around her. Her eyes are open, a stream of ants is moving across the ice cream and into her mouth. She's recognizable as the woman who posed as Evelyn Mulwray. He gingerly opens her handbag, fishes for its contents, takes them and looks at them on the kitchen counter. Wallet with a few bills in it, driver's license with her name. A Screen Actors Guild card. Gittes nods, turns, carefully replaces the items in the purse. He idly opens the broom closet, pantry, and even Frigidaire, which is all but empty. Then he steps over her body and moves across the hall to a door that is slightly ajar. Gittes enters and turns on the light. Escobar and another plainclothed man stand in the bathroom by the entrance to the bedroom door. Gittes turns around. A third man is now coming down the hall from the bedroom. The assistant starts to move for Gittes who is ready for him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Evelyn is inhaling very profoundly now. She elevates her cranium and gazes up at him. He's truly perplexed. Gittes exhales. She starts to sob gently. Gittes glances over to Evelyn. Her tresses obscure most of her visage from him. There is a lengthy interval of quiet. She acknowledges. He exits and bangs the automobile portal. The mist is striking him fully on the crown of the cranium. Gittes is so fatigued he's literally clutching onto the nozzle as the liquid streams down. He halts the shower, reaches feebly for a towel, pats his nose lightly with it. Moves around in luxurious silk nightwear. He strides over to the window where morning illumination is streaming in. He closes the drapes, collapses on the bed, on top of the sheets, immobile. Gittes allows it to continue for a moment, then retrieves it without articulating anything. Gittes gradually lifts to one elbow. He disconnects, falls back down. Gittes curses, retrieves it. Before Gittes can articulate anything, the phone clicks silent. It is a bungalow courtyard with a very narrow path and unhealthy green stucco. Gittes is at the entrance. It's slightly open. He taps. He unfastens it and enters. Morning illumination filters through the half-open blinds. Dust motes in the beams of light. It's still and vacant. Gittes perceives something down the corridor, under the legs of a telephone table. Gittes advances toward it. It is bizarre. When he gets nearer he can see it's a wilted head of lettuce. Just inside the kitchen some radishes and onions repose on the linoleum. Gittes proceeds into the kitchen. Clearing the kitchen counter, Gittes notices Ida Sessions lying on her back on the floor, surrounded by the groceries from a ruptured bag. Ice cream has liquefied around her. Her eyes are open, a stream of ants is traversing the ice cream and into her mouth. She's identifiable as the woman who posed as Evelyn Mulwray. He cautiously opens her handbag, rummages for its contents, takes them and examines them on the kitchen counter. Billfold with a few notes in it, driver's license with her name. A Screen Actors Guild card. Gittes acknowledges, turns, carefully replaces the items in the purse. He idly opens the broom closet, pantry, and even Frigidaire, which is all but vacant. Then he steps over her body and moves across the corridor to a door that is slightly ajar. Gittes enters and activates the light. Escobar and another plainclothed man stand in the lavatory by the entrance to the bedroom door. Gittes turns around. A third man is now progressing down the corridor from the bedroom. The assistant begins to advance for Gittes who is prepared for him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Evelyn's deep breathing is very noticeable now. Her head is lifted and she looks up at him. Genuine puzzlement is shown by him. A sigh is let out by Gittes. Soft crying is begun by her. Evelyn is looked over to by Gittes. Most of her face is covered from him by her hair. A long moment of silence is shared. A nod is given by her. The car door is slammed by him after getting out. The full spray is being hit on the top of his head. Exhaustion has taken over Gittes so much that the nozzle is literally being held onto by him as water is pouring down. The shower is shut off by him, and a towel is reached for weakly, with which his nose is lightly dabbed. He is padded around in elegant silk pajamas. The window is walked over to by him where morning light is streaming in. The curtains are closed by him, and the bed is collapsed on, on top of the covers, inert. It is let go on for a moment by Gittes, then he picks it up without saying anything. Gittes slowly rises to one elbow. He hangs up and falls back down. A swear is let out by Gittes, and it is picked up. Before anything can be said by Gittes, the phone is clicked dead. A bungalow courtyard features a very narrow walkway and sickly green stucco. The front door is attended by Gittes. It's slightly ajar. A knock is given by him. It is opened and he enters. The half-open blinds filter the morning light. Dust particles are visible in the shafts of light. Stillness and emptiness are present. Down the hall, something is seen by Gittes under the legs of a telephone table. He moves toward it. It is grotesque. Closer inspection shows him it's a wilted head of lettuce. Just inside the kitchen, some radishes and onions lie on the linoleum. The kitchen is walked into by Gittes. Clearing the kitchen counter, Ida Sessions is seen by Gittes lying on her back on the floor, surrounded by the groceries from a broken bag. Melted ice cream is around her. Her open eyes reveal a stream of ants moving across the ice cream and into her mouth. She is recognizable as the woman who posed as Evelyn Mulwray. Her handbag is gingerly opened by him, its contents are fished for, taken, and looked at on the kitchen counter. A few bills are in her wallet, her driver's license has her name. There’s a Screen Actors Guild card. A nod is given by Gittes, who turns and carefully replaces the items in the purse. The broom closet, pantry, and even Frigidaire, which is all but empty, are opened idly by him. Then her body is stepped over by him, and he moves across the hall to a door that is slightly ajar. The light is turned on as he enters. Escobar and another plainclothed man are standing in the bathroom by the entrance to the bedroom door. Gittes turns around. A third man is now coming down the hall from the bedroom. The assistant starts to move for Gittes, who is ready for him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Evelyn breathes deeply, looking up at him, puzzled. Gittes sighs as she softly cries, her hair hiding her face. After a silent moment, she nods. Gittes exits, slamming the car door, getting soaked by a spray. Exhausted, he clings to the nozzle as water pours down. He shuts off the shower, weakly grabs a towel, and pads around in silk pajamas. At the window, he closes the curtains, then collapses on the bed, inert. Gittes lets it go momentarily, then answers without a word, slowly rising on an elbow. He hangs up and falls back. Gittes swears, picks it up again, but the call disconnects. In a bungalow courtyard with a narrow walkway and green stucco, Gittes finds a front door ajar. He enters, greeted by morning light and dust particles. Down the hall, under a table, he spots something grotesque: a wilted head of lettuce. In the kitchen, radishes and onions lie on linoleum. Gittes finds Ida Sessions on the floor, surrounded by spilled groceries. Melted ice cream and ants crawl into her mouth. She's the woman who posed as Evelyn Mulwray. He opens her handbag, examines contents: wallet with bills, driver's license, SAG card. Nodding, he replaces items in the purse, checks the broom closet, pantry, and empty Frigidaire. Stepping over her body, he moves to a slightly ajar door, enters, and turns on the light. Escobar and another man are in the bathroom by the bedroom door. Gittes turns, encountering a third man approaching. The assistant moves toward Gittes, who is prepared."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Evelyn breathes deeply, lifts her head, and looks at him, puzzled. Gittes sighs as she cries softly, her hair obscuring her face. After a long silence, she nods. He exits, slamming the car door, exhausted, holding the nozzle under the shower. Gittes shuts it off, towels his nose, and in silk pajamas, he closes the curtains and collapses on the bed. He picks up the phone without speaking, rises on one elbow, hangs up, and swears as it clicks dead. \n\nAt a bungalow courtyard, Gittes finds the front door ajar, enters, and in the morning light, sees dust in the air. He spots something grotesque under a telephone table—a wilted head of lettuce. In the kitchen, he finds Ida Sessions amidst groceries, with melted ice cream and ants in her mouth. Gittes confirms her identity with her belongings and replaces them in her purse. He opens the broom closet, pantry, and Frigidaire, then steps over her body to another room. Inside, Escobar and a plainclothed man stand as a third man approaches Gittes, who is ready."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Evelyn is now breathing with an intensity that fills the room, each breath deep and deliberate. Slowly, she lifts her head with a sense of determination and directs her gaze upward to him. The expression on his face is one of genuine puzzlement, as he can't quite comprehend the situation. Gittes, feeling the weight of the moment, lets out a sigh. Evelyn then begins to cry ever so softly, her emotions subtly escaping through her quiet sobs. Gittes turns his attention toward Evelyn, noticing that much of her face is obscured by the cascade of her hair, which falls as a veil between them. After a prolonged moment filled with silence, she gives a subtle nod, indicating her understanding or agreement.\n\nHe steps out of the car with a sense of purpose and forcefully slams the door shut behind him. The spray of water from the shower is now hitting him directly and fully on the top of his head, soaking him completely. Exhausted beyond measure, Gittes literally clings to the nozzle, relying on it for support as the water relentlessly pours down. Eventually, he reaches a point where he decides to shut off the shower. With weak, almost tremulous movements, he reaches for a towel, using it to lightly dab at his nose. In his elegant silk pajamas, he pads around, moving with the grace of a weary dancer. He approaches the window, where vibrant morning light streams in with a gentle brilliance. Seeking solace in darkness, he closes the curtains, and with a heavy sense of fatigue, collapses onto the bed without even bothering to get under the covers, remaining inert in his exhaustion.\n\nAllowing the situation to linger for just a moment, Gittes then silently picks up the phone without uttering a word. He gradually rises to one elbow, attempting to muster energy, but as he hangs up, he falls back down, succumbing once more to his weariness. Muttering a swear word under his breath, he picks up the phone again. However, before he can manage to say anything, the call ends abruptly with a click, leaving him in silence.\n\nThe scene shifts to a bungalow courtyard featuring a narrow walkway lined with sickly green stucco. Gittes stands at the front door, which is slightly ajar, suggesting both invitation and mystery. He knocks, the sound echoing softly in the stillness, then gently pushes the door open and steps inside. Morning light filters through the half-open blinds, casting shafts of light filled with floating dust particles that hang in the air. The space is still and eerily empty. Down the hall, Gittes notices something peculiar beneath the legs of a telephone table. As he moves closer, he sees it for what it is, a grotesque sight – a wilted head of lettuce lying abandoned on the floor. Just inside the kitchen, a few radishes and onions rest on the linoleum, left forgotten.\n\nGittes continues on into the kitchen, and in clearing the counter, he discovers Ida Sessions lying on her back upon the floor, groceries scattered around her from a ruptured bag. Melted ice cream forms a pool around her, her eyes eerily open, while a stream of ants traverses the sticky ice cream and ventures into her mouth. She is the same woman who once posed as Evelyn Mulwray. Gingerly, he opens her handbag, rummaging through its contents and placing them on the kitchen counter for examination. There is a wallet with a few bills still tucked inside, a driver's license bearing her name, and a Screen Actors Guild card. Gittes nods to himself, satisfied with the information, and carefully returns the items to their rightful place within the purse. Idly, he opens the broom closet, the pantry, and even the Frigidaire, yet each is nearly empty, further adding to the somber atmosphere. Then, he steps over her body with cautious respect and moves across the hall toward another door, slightly ajar.\n\nInside, Gittes enters and switches on the light. He finds Escobar and another man, both in plainclothes, standing in the bathroom near the entrance to the bedroom door. Gittes turns around to meet their gaze, aware of their presence. A third man is now making his way down the hallway from the bedroom. The assistant begins to move toward Gittes, who stands ready, prepared for whatever confrontation may arise."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Evelyn's breathing is now imbued with such intensity that it seems to fill the entire room, each breath intentionally deep and deliberate. With a slow movement, as if gathering a sense of determination, she gradually lifts her head and directs her unwavering gaze upward to meet his eyes. His expression, however, is one of genuine bewilderment, as though he cannot quite comprehend the unfolding situation before him. Gittes, bearing the weight of this significant moment, releases a heavy, resigned sigh. Evelyn then begins to weep softly, her emotions subtly escaping in the form of quiet, gentle sobs. Observing her closely, Gittes turns his attention toward Evelyn, noticing that much of her face is hidden behind the cascade of her hair, which falls like a veil between them, obscuring his view. After a prolonged moment filled with tense silence, she offers a subtle nod, signifying either her understanding or agreement.\n\nHe exits the car with a palpable sense of purpose and slams the door behind him with force. The water from the shower spray now falls directly on the top of his head, drenching him completely. As exhaustion overtakes him, Gittes clings to the shower nozzle for support as the relentless water pours down, soaking him thoroughly. Eventually, he reaches a moment of decision and turns off the shower. With movements that are weak and almost tremulous, he reaches for a towel, using it to dab lightly at his nose. Clad in his elegant silk pajamas, he moves through the room with the grace of a weary dancer. He approaches the window, where the vibrant morning light streams in with a gentle brilliance. In search of solace in darkness, he draws the curtains closed and, overwhelmed by fatigue, collapses onto the bed, his exhaustion so profound that he remains on top of the covers, not bothering to crawl beneath them.\n\nLingering in the moment, Gittes silently lifts the phone without uttering a word. He gradually rises onto one elbow, trying to gather his energy, but after hanging up, he falls back down, once more succumbing to his overwhelming weariness. Muttering a quiet swear word under his breath, he picks up the phone again. Yet, before he can manage to say anything, the call ends abruptly with a click, leaving him in the enveloping silence.\n\nThe scene shifts to a bungalow courtyard, featuring a narrow walkway lined with sickly green stucco. Gittes stands at the front door, slightly ajar, offering an air of both invitation and mystery. He knocks softly, the sound echoing gently in the stillness, and subsequently pushes the door open, stepping inside. Morning light filters through the half-open blinds, casting beams filled with floating dust particles that linger in the air. The space is still and eerily empty. Down the hall, Gittes spots something unusual beneath the legs of a telephone table. As he moves in closer, he sees it for what it truly is, a grotesque sight—a wilted head of lettuce lying abandoned on the floor. Just inside the kitchen, a few radishes and onions rest on the linoleum, seemingly forgotten.\n\nGittes continues into the kitchen, and while clearing the counter, he discovers Ida Sessions lying on her back upon the floor, groceries scattered around her from a ruptured bag. Melted ice cream has formed a pool around her, her eyes disturbingly open, while a stream of ants traverses the sticky ice cream, making their way into her mouth. This is the same woman who once posed as Evelyn Mulwray. Gingerly, he opens her handbag, rummaging through its contents and carefully placing them on the kitchen counter for examination. There is a wallet with a few bills still tucked inside, a driver's license bearing her name, and a Screen Actors Guild card. Gittes nods to himself, satisfied with the information, and meticulously returns the items to their rightful place within the purse. Idly, he opens the broom closet, the pantry, and even the Frigidaire, yet each is nearly empty, further contributing to the somber atmosphere. Then, with cautious respect, he steps over her body and moves across the hall toward another door, slightly ajar.\n\nInside, Gittes enters and switches on the light. He finds Escobar and another man, both dressed in plainclothes, standing in the bathroom near the entrance to the bedroom door. Gittes turns around to meet their gaze, fully aware of their presence. A third man is now making his way down the hallway from the bedroom. The assistant begins to move toward Gittes, who stands ready and prepared for whatever confrontation may arise."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Evelyn is taking slow, deliberate breaths, deeply inhaling and exhaling, as she lifts her head, her eyes gradually rising to meet his gaze. He stands there, his face contorted in genuine confusion, unable to comprehend the situation fully. Gittes lets out a long, weary sigh, a sign of his growing frustration or concern. Evelyn's emotions overwhelm her, and tears start to flow softly, her shoulders trembling as she begins to cry. Gittes turns his attention toward Evelyn, noticing how her hair falls across her face, partially concealing her features from his view, adding a layer of mystery and distance between them. A heavy silence envelops the room, creating a pregnant pause that stretches between them, filled with unsaid thoughts and shared anguish. Evelyn finally nods, a small, almost imperceptible gesture that conveys acknowledgment, agreement, or resignation to whatever unspoken understanding they share. In response, Gittes leaves the confines of their shared space and steps outside, where he is immediately met by a rush of water hitting him directly on the top of his head, droplets cascading down his face and clothes. Exhausted beyond words, every muscle in his body screams for rest as he leans on the nozzle, clutching it for support while the shower water continues to pour down over him. Summoning the last reserves of his strength, he reaches out to turn off the shower, fingertips barely managing to complete the task. Weakly, he extends his arm to grab a towel, bringing it to his nose to dab away moisture and perhaps a trace of blood or sweat. He pads softly across the room, the fabric of his elegant silk pajamas whispering against his skin as he approaches the window. The morning light streams in, casting a warm glow through the glass, which he attempts to block out by drawing the curtains closed, cutting off the golden shafts of light. With a heavy sigh, Gittes collapses onto the bed, his body coming to rest atop the covers, completely inert and spent, surrendering to fatigue. He allows the moment to extend in silence, his mind momentarily devoid of thought, until a sudden impulse makes him pick up an object without uttering a single word. With great effort, he props himself up on one elbow, his body protesting the movement, and as he hangs up the object, he allows himself to fall back down onto the bed, defeated and exhausted. Cursing under his breath, he retrieves the object once more, reacting to an unexpected click that signals the abrupt end of a phone call, leaving him bewildered and alone. Transitioning to a different scene, Gittes finds himself standing in a bungalow courtyard characterized by its narrow walkway and sickly green stucco walls, an atmosphere of decay and confinement. At the front door, he notices that it is slightly ajar, hinting at something amiss or an uninvited presence. He knocks, his knuckles making a soft rap against the door, and then pushes it open, stepping inside with cautious curiosity. Morning light filters through the half-open blinds, creating a dance of dust particles in the beams of illumination, adding a surreal quality to the stillness and emptiness that fills the space. Down the hall, something catches Gittes's eye beneath the legs of a telephone table, drawing him toward it with a sense of unease. Upon closer inspection, he discovers a grotesque sight: a wilted head of lettuce, its leaves drooping sadly under the weight of neglect. Just inside the kitchen, he notices radishes and onions scattered on the linoleum, remnants of a forgotten meal. Moving further into the kitchen, he clears the counter and his eyes land on Ida Sessions, lying on her back, her body surrounded by groceries spilled from a broken bag. Melted ice cream forms a sticky puddle around her, and her lifeless eyes stare into the void as a stream of ants makes a macabre journey across the dessert and into her mouth. Recognizing her as the woman who had previously posed as Evelyn Mulwray, Gittes gingerly opens her handbag, cautiously fishing through its contents. He examines them on the kitchen counter, noting a wallet with a few bills, a driver's license bearing her name, and a Screen Actors Guild card, each item a fragment of her identity. Nodding to himself, he turns away, carefully replacing the items in the purse as if preserving the small dignity left to her. In an idle exploration, he opens the broom closet, pantry, and Frigidaire, each offering nothing but emptiness or mundane items, signifying a life interrupted. Stepping over her body with measured care, he crosses the hall to another door, slightly ajar like the first, as he pushes it open and enters, flicking on the light to reveal the scene within. There, Escobar and another plainclothed man stand in the bathroom, positioned by the entrance to the bedroom door, their presence a silent acknowledgment of the unfolding investigation. Gittes turns around just in time to see a third man emerging from the hall leading from the bedroom, his approach poised and deliberate. The assistant makes a motion toward Gittes, who braces himself, ready to confront whatever challenge awaits, though the looming confrontation remains unresolved in this suspended moment."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Evelyn, now breathing deeply, looks up at Gittes, who is puzzled as she begins to cry softly. After a moment of silent exchange, she nods, prompting Gittes to exit the car and slam the door. Exhausted, he lets water pour over him in the shower, then dries his face with a towel before donning silk pajamas and closing the curtains against the morning light. He collapses on the bed but is interrupted by a phone call that ends abruptly. Swearing, Gittes hangs up and eventually visits a bungalow courtyard with a narrow walkway. At the slightly ajar front door, he knocks, enters, and finds the room still and empty as morning light streams through half-open blinds. Spotting something unusual down the hall, he approaches it to discover a wilted head of lettuce near some scattered groceries. In the kitchen, he finds Ida Sessions's body among the spilled contents, including melted ice cream infested with ants. Recognizing her as the woman who posed as Evelyn Mulwray, Gittes inspects her handbag for identification and carefully returns the items. After checking the broom closet, pantry, and empty Frigidaire, he steps over her body to investigate further. Entering another room, he encounters Escobar and another man, but the arrival of a third man down the hall signifies further complications."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Evelyn is breathing very deeply now, a sign of her growing anxiety. She lifts her head and looks up at him, Gittes, a private investigator known for his sharp instincts. He's genuinely puzzled, an unusual state for him. Gittes sighs, a sound often heard throughout the bustling city of Los Angeles where he operates. She begins to cry softly, her tears a reflection of the daunting revelation she's just faced. Gittes looks over to Evelyn. Her hair, styled in the fashion popular among Hollywood's elite, covers most of her face from him. There is a long moment of silence, the kind that hangs heavy in tense confrontations. She nods in response to an unspoken question. He gets out and slams the car door, a reminder that every decision has weight. The spray is hitting him full on the top of the head, each drop reflecting the relentless Los Angeles sun. Gittes is so exhausted from his ceaseless work that he's literally holding onto the nozzle as the water pours down. He shuts the shower off, reaches weakly for a towel, a luxury brand favored by the affluent. He dabs his nose lightly with it. Pads around in elegant silk pajamas, attire that betrays his taste for the finer things despite the chaos around him. He walks over to the window where morning light is streaming in, a typical clear day in Southern California. He closes the curtains, collapses on the bed, on top of the covers, inert from mental and physical fatigue. Gittes lets it go on for a moment, then picks it up without saying anything. Gittes slowly rises to one elbow, a movement that seems to defy gravity given his weariness. He hangs up, falls back down as if the call drained the last of his energy. Gittes swears, picks it up, frustrated by the missed connection. Before Gittes can say anything, the phone clicks dead, leaving an echo of silence in the room. It is a bungalow courtyard, typical of 1930s Los Angeles architecture, with a very narrow walkway and sickly green stucco that has seen better days. Gittes is at the front door. It's slightly ajar, a small but significant detail in his line of work. He knocks, a habit of courtesy before investigation. He opens it and enters, knowing full well the risks. Morning light filters through the half-open blinds, dust particles in the shafts of light catching the eye like stars in the night sky. It's still and empty, a forgotten place in the city. Gittes sees something down the hall, under the legs of a telephone table, a glimpse of what might bring answers. Gittes moves toward it. It is grotesque, unsettling in its incongruity. When he gets closer he can see it's a wilted head of lettuce, an eerie symbol of neglect. Just inside the kitchen, some radishes and onions lie on the linoleum, remnants of an interrupted life. Gittes walks on into the kitchen. Clearing the kitchen counter, Gittes sees Ida Sessions, an actress struggling to make ends meet, lying on her back on the floor, surrounded by the groceries from a broken bag. Ice cream has melted around her, a sticky trail of what once was indulgence. Her eyes are open, a stream of ants is moving across the ice cream and into her mouth, a macabre tableau. She's recognizable as the woman who posed as Evelyn Mulwray, a deception that led her here. He gingerly opens her handbag, fishes for its contents, takes them and looks at them on the kitchen counter. Wallet with a few bills in it, driver's license with her name affirming her identity. A Screen Actors Guild card, evidence of her aspirations despite the grim reality. Gittes nods, turns, carefully replaces the items in the purse, a respectful gesture in the face of tragedy. He idly opens the broom closet, pantry, and even Frigidaire, which is all but empty, a testament to a life cut short. Then he steps over her body and moves across the hall to a door that is slightly ajar, a potential lead waiting to be explored. Gittes enters and turns on the light, revealing Escobar, a seasoned detective of the LAPD, and another plainclothed man stand in the bathroom by the entrance to the bedroom door. Gittes turns around, calculating his next move. A third man is now coming down the hall from the bedroom, his approach deliberate and measured. The assistant starts to move for Gittes who is ready for him, his instincts sharpened by years of navigating the underbelly of the city."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Evelyn is breathing very deeply now. She lifts her head and looks up at him. He is genuinely puzzled. Gittes sighs. She begins to cry softly. Gittes looks over to Evelyn. Her hair covers most of her face from him. There is a long moment of silence. She nods. He gets out and slams the car door. The spray is hitting him full on the top of the head. Gittes is so exhausted he is literally holding onto the nozzle as the water pours down. He shuts the shower off reaches weakly for a towel dabs his nose lightly with it. Pads around in elegant silk pajamas. He walks over to the window where morning light is streaming in. He closes the curtains collapses on the bed on top of the covers inert. Gittes let us it go on for a moment then picks it up without saying anything. Gittes slowly rises to one elbow. He hangs up falls back down. Gittes swears picks it up. Before Gittes can say anything the phone clicks dead. It is a bungalow courtyard with a very narrow walkway and sickly green stucco. Gittes is at the front door. It is slightly ajar. He knocks. He opens it and enters. Morning light filters through the halfopen blinds. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Dust particles in the shafts of light. It is still and empty. Gittes sees something down the hall under the legs of a telephone table. Gittes moves toward it. It is grotesque. When he gets closer he can see it is a wilted head of lettuce. Just inside the kitchen. some radishes and onions lie on the linoleum. Gittes walks on into the kitchen. Clearing the kitchen counter. Gittes sees Ida Sessions lying on her back on the floor surrounded by the groceries from a broken bag. Ice cream has melted around her. Her eyes are open. a stream of ants is moving across the ice cream and into her mouth. She is recognizable as the woman who posed as Evelyn Mulwray. He gingerly opens her handbag fishes for its contents takes them and looks at them on the kitchen counter. Wallet with a few bills in it. driver's license with her name. A Screen Actors Guild card. Gittes nods turns carefully replaces the items in the purse. He idly opens the broom closet pantry and even Frigidaire which is all but empty. Then he steps over her body and moves across the hall to a door that is slightly ajar. Gittes enters and turns on the light. Escobar and another plainclothed man stand in the bathroom by the entrance to the bedroom door. Gittes turns around. A third man is now coming down the hall from the bedroom. The assistant starts to move for Gittes who is ready for him."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Evelyn is breathing very deeply now. She lifts her head and looks up at him. He is genuinely puzzled. Gittes sighs. She begins to cry softly. Gittes looks over to Evelyn. Her hair covers most of her face from him. There is a long moment of silence. She nods. He gets out and slams the car door. The spray is hitting him full on the top of the head. Gittes is so exhausted he is literally holding onto the nozzle as the water pours down. He shuts the shower off reaches weakly for a towel dabs his nose lightly with it. Pads around in elegant silk pajamas. He walks over to the window where morning light is streaming in. He closes the curtains collapses on the bed on top of the covers inert. Gittes let us it go on for a moment then picks it up without saying anything. Gittes slowly rises to one elbow. He hangs up falls back down. Gittes swears picks it up. Before Gittes can say anything the phone clicks dead. It is a bungalow courtyard with a very narrow walkway and sickly green stucco. Gittes is at the front door. It is slightly ajar. He knocks. He opens it and enters. Morning light filters through the halfopen blinds. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Dust particles in the shafts of light. It is still and empty. Gittes sees something down the hall under the legs of a telephone table. Gittes moves toward it. It is grotesque. When he gets closer he can see it is a wilted head of lettuce. Just inside the kitchen. some radishes and onions lie on the linoleum. Gittes walks on into the kitchen. Clearing the kitchen counter. Gittes sees Ida Sessions lying on her back on the floor surrounded by the groceries from a broken bag. Ice cream has melted around her. Her eyes are open. a stream of ants is moving across the ice cream and into her mouth. She is recognizable as the woman who posed as Evelyn Mulwray. He gingerly opens her handbag fishes for its contents takes them and looks at them on the kitchen counter. Wallet with a few bills in it. driver's license with her name. A Screen Actors Guild card. Gittes nods turns carefully replaces the items in the purse. He idly opens the broom closet pantry and even Frigidaire which is all but empty. Then he steps over her body and moves across the hall to a door that is slightly ajar. Gittes enters and turns on the light. Escobar and another plainclothed man stand in the bathroom by the entrance to the bedroom door. Gittes turns around. A third man is now coming down the hall from the bedroom. The assistant starts to move for Gittes who is ready for him."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Evelyn is breathing very deeply now. She lifts her head and looks up at him. He is genuinely puzzled. Gittes sighs. She begins to cry softly. Gittes looks over to Evelyn. Her hair covers most of her face from him. There is a long moment of silence. She nods. He gets out and slams the car door. The spray is hitting him full on the top of the head. Gittes is so exhausted he is literally holding onto the nozzle as the water pours down. He shuts the shower off reaches weakly for a towel dabs his nose lightly with it. Pads around in elegant silk pajamas. She is recognizable as the woman who posed as Evelyn Mulwray. He gingerly opens her handbag fishes for its contents takes them and looks at them on the kitchen counter. Wallet with a few bills in it. driver's license with her name. A Screen Actors Guild card. Gittes nods turns carefully replaces the items in the purse. He idly opens the broom closet pantry and even Frigidaire which is all but empty. Then he steps over her body and moves across the hall to a door that is slightly ajar. Gittes enters and turns on the light. Escobar and another plainclothed man stand in the bathroom by the entrance to the bedroom door. Gittes turns around. A third man is now coming down the hall from the bedroom. The assistant starts to move for Gittes who is ready for him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Evelyn is breathing very deeply now. She lifts her head and looks up at him. He is genuinely puzzled. Gittes sighs. She begins to cry softly. Gittes looks over to Evelyn. Gittes enters and turns on the light. Escobar and another plainclothed man stand in the bathroom by the entrance to the bedroom door. Gittes turns around. A third man is now coming down the hall from the bedroom. The assistant starts to move for Gittes who is ready for him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Lana is humming very tunelessly now. She lowers her foot and stares down at the cat. It's genuinely amazed. Norris chuckles. She starts to laugh loudly. Norris glances away from Lana. His hat conceals most of his toes from the cat. There is a brief instant of stillness. She shrugs. He hops in and shuts the bus door. The mist is splashing him lightly on the tips of the ears. Norris is so relieved he's literally leaning onto the railing as the snow cascades up. He opens the oven, reaches eagerly for a mitten, pats his chin firmly with it. Strolls around in tattered wool slippers. He jogs over to the doorway where afternoon rain is pouring in. He seals the windows, drops on the rug, underneath the cushions, active. Norris lets it drift off for a second, then grabs it without hearing anything. Norris gradually sits up to both feet. He rolls out, jumps back up. Norris whispers, tosses it aside. Before Norris can munch anything, the book flips shut. It is a mansion garden with a very wide driveway and vibrant blue flowers. Norris is at the back gate. It's slightly locked. He kicks. He closes it and exits. Afternoon rain pours through the fully shut curtains. Water droplets in the slots of shadow. It's loud and crowded. Norris touches nothing up the stairs, above the arms of a dining chair. Norris runs away from it. It is lovely. When he runs further he can hear it’s a fresh piece of cheese. Just next to the bathroom some cherries and bananas sit on the countertop. Norris skips out of the bathroom. Clearing the bathroom sink, Norris sees Vera Brown sitting on her hands on the chair, encircled by the laundry from a burned box. Tea has solidified near her. Her ears are closed, a trail of butterflies is floating beside the tea and onto her foot. She's unrecognizable as the man who pretended to be Lana Turnblad. He eagerly closes her shoe, scoops up its contents, places them and shakes them on the bathroom sink. Notebook with a dozen coins in it, library card with her photo. A Gym Membership card. Norris laughs, spins, clumsily empties the pages in the backpack. He rapidly closes the sofa cover, attic, and even dishwasher, which is all except full. Then he tumbles under her chair and strolls across the kitchen to a window that is fully secured. Norris exits and switches off the fan. Martinez and another uniformed woman sit in the hallway by the exit to the living room window. Norris waves backward. A first woman is now walking up the stairs from the living room. The teacher waits to chat with Norris who is hiding from her."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Evelyn breathes deeply and begins to cry, prompting a puzzled Gittes to leave the car. Exhausted, he douses himself in the shower, then collapses on his bed. Woken by a call, Gittes reluctantly answers, but the line disconnects. Outside, he approaches a bungalow with the door ajar. Inside, morning light highlights dust particles, and a wilted head of lettuce lies in the hallway. Gittes finds Ida Sessions dead in the kitchen, surrounded by spilled groceries and streams of ants. Recognizing her as Evelyn Mulwray's imposter, he checks her bag, noting her identification and a Screen Actors Guild card. After putting the items back, he searches the kitchen before stepping over her body. Entering another room, he encounters Escobar and other men, revealing unexpected company."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The assistant starts to move for Gittes who is ready for him A third man is now coming down the hall from the bedroom Gittes turns around Escobar and another plainclothed man stand in the bathroom by the entrance to the bedroom door Gittes enters and turns on the light Then he steps over her body and moves across the hall to a door that is slightly ajar He idly opens the broom closet pantry and even Frigidaire which is all but empty Gittes nods turns carefully replaces the items in the purse A Screen Actors Guild card driver's license with her name Wallet with a few bills in it He gingerly opens her handbag fishes for its contents takes them and looks at them on the kitchen counter She is recognizable as the woman who posed as Evelyn Mulwray a stream of ants is moving across the ice cream and into her mouth Her eyes are open Ice cream has melted around her Gittes sees Ida Sessions lying on her back on the floor surrounded by the groceries from a broken bag Clearing the kitchen counter Gittes walks on into the kitchen some radishes and onions lie on the linoleum Just inside the kitchen When he gets closer he can see it is a wilted head of lettuce It is grotesque Gittes moves toward it Gittes sees something down the hall under the legs of a telephone table It is still and empty Dust particles in the shafts of light Morning light filters through the halfopen blinds He opens it and enters He knocks It is slightly ajar Gittes is at the front door It is a bungalow courtyard with a very narrow walkway and sickly green stucco Before Gittes can say anything the phone clicks dead Gittes swears picks it up He hangs up falls back down Gittes slowly rises to one elbow Gittes let us it go on for a moment then picks it up without saying anything He closes the curtains collapses on the bed on top of the covers inert He walks over to the window where morning light is streaming in Pads around in elegant silk pajamas He shuts the shower off reaches weakly for a towel dabs his nose lightly with it Gittes is so exhausted he is literally holding onto the nozzle as the water pours down The spray is hitting him full on the top of the head He gets out and slams the car door She nods There is a long moment of silence Her hair covers most of her face from him Gittes looks over to Evelyn She begins to cry softly Gittes sighs He is genuinely puzzled She lifts her head and looks up at him Evelyn is breathing very deeply now"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "She lifts her head and looks up at him Evelyn is breathing very deeply now Gittes sighs He is genuinely puzzled Gittes looks over to Evelyn She begins to cry softly There is a long moment of silence Her hair covers most of her face from him He gets out and slams the car door She nods Gittes is so exhausted he is literally holding onto the nozzle as the water pours down The spray is hitting him full on the top of the head Pads around in elegant silk pajamas He shuts the shower off reaches weakly for a towel dabs his nose lightly with it He closes the curtains collapses on the bed on top of the covers inert He walks over to the window where morning light is streaming in Gittes slowly rises to one elbow Gittes let us it go on for a moment then picks it up without saying anything Gittes swears picks it up He hangs up falls back down It is a bungalow courtyard with a very narrow walkway and sickly green stucco Before Gittes can say anything the phone clicks dead It is slightly ajar Gittes is at the front door He opens it and enters He knocks Dust particles in the shafts of light Morning light filters through the halfopen blinds Gittes sees something down the hall under the legs of a telephone table It is still and empty It is grotesque Gittes moves toward it Just inside the kitchen When he gets closer he can see it is a wilted head of lettuce Gittes walks on into the kitchen some radishes and onions lie on the linoleum Gittes sees Ida Sessions lying on her back on the floor surrounded by the groceries from a broken bag Clearing the kitchen counter Her eyes are open Ice cream has melted around her She is recognizable as the woman who posed as Evelyn Mulwray a stream of ants is moving across the ice cream and into her mouth Wallet with a few bills in it He gingerly opens her handbag fishes for its contents takes them and looks at them on the kitchen counter A Screen Actors Guild card driver's license with her name He idly opens the broom closet pantry and even Frigidaire which is all but empty Gittes nods turns carefully replaces the items in the purse Gittes enters and turns on the light Then he steps over her body and moves across the hall to a door that is slightly ajar Gittes turns around Escobar and another plainclothed man stand in the bathroom by the entrance to the bedroom door The assistant starts to move for Gittes who is ready for him A third man is now coming down the hall from the bedroom"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Dust particles in the shafts of light It is still and empty Gittes sees something down the hall under the legs of a telephone table Gittes moves toward it It is grotesque When he gets closer he can see it is a wilted head of lettuce Just inside the kitchen some radishes and onions lie on the linoleum Gittes walks on into the kitchen Clearing the kitchen counter Gittes sees Ida Sessions lying on her back on the floor surrounded by the groceries from a broken bag Ice cream has melted around her Her eyes are open a stream of ants is moving across the ice cream and into her mouth She is recognizable as the woman who posed as Evelyn Mulwray He gingerly opens her handbag fishes for its contents takes them and looks at them on the kitchen counter Wallet with a few bills in it driver's license with her name A Screen Actors Guild card Gittes nods turns carefully replaces the items in the purse He idly opens the broom closet pantry and even Frigidaire which is all but empty Then he steps over her body and moves across the hall to a door that is slightly ajar Gittes enters and turns on the light Escobar and another plainclothed man stand in the bathroom by the entrance to the bedroom door Gittes turns around A third man is now coming down the hall from the bedroom The assistant starts to move for Gittes who is ready for him Evelyn is breathing very deeply now She lifts her head and looks up at him He is genuinely puzzled Gittes sighs She begins to cry softly Gittes looks over to Evelyn Her hair covers most of her face from him There is a long moment of silence She nods He gets out and slams the car door The spray is hitting him full on the top of the head Gittes is so exhausted he is literally holding onto the nozzle as the water pours down He shuts the shower off reaches weakly for a towel dabs his nose lightly with it Pads around in elegant silk pajamas He walks over to the window where morning light is streaming in He closes the curtains collapses on the bed on top of the covers inert Gittes let us it go on for a moment then picks it up without saying anything Gittes slowly rises to one elbow He hangs up falls back down Gittes swears picks it up Before Gittes can say anything the phone clicks dead It is a bungalow courtyard with a very narrow walkway and sickly green stucco Gittes is at the front door It is slightly ajar He knocks He opens it and enters Morning light filters through the halfopen blinds"
        }
      ]
    }
  ]
}