{
  "ground_truth": "The Orkin van is parked in an alleyway somewhere downtown, and from inside, throaty wails of frustration can be heard. Inside the van, the ornate rosewood box is now battered and scarred, its various locks holding tight against Edgar's repeated attempts to claw his way into it. He bellows in rage and hurls the box against the side of the van, where it finally cracks a hinge. Inside, there are dozens of precious, glittering diamonds, which he promptly tosses aside as worthless, but the rest of the box is empty. He points up at the screen with a laser pencil, indicating the three stars that make up the belt. Elizabeth looks up, as if she knows she's being watched, but she's just looking at the sky, wondering how many stars will be out tonight. It's more than Kay can bear, so he reaches out and flicks a switch, clicking off the picture of her. The monitor goes blank, except for a data screen. Jay drags a chair and sits down, and together Jay and Kay cross back toward the LAD (Landed Alien Display), where each of the thousand or so aliens who live on Earth are represented by a flickering light. Some lights are starting to go out. Kay looks to his partner, then to the screen, before Kay and Jay walk away. Edgar reaches into the front seat of the van and pulls out his twelve-gauge shotgun, pointing it at the tow truck driver. The tow truck driver looks at him with disdain, and pulling back his shirt reveals a mean-looking gun. There are several photos of a cat on the wall and a pile of bejeweled cat collars. Jay's attention is broken by something through the window, where outside, lumbering straight for the store, is Edgar. Jay fires, shattering the storefront window and blowing up a car on the street. The blast hurls him up and back a good ten feet, slamming him into the wall with tremendous force. Edgar turns and rushes away down the street as Jay picks himself up, leaping through the broken storefront window and after Edgar. Kay gestures to a group of onlookers, drawn by the curious blasts from the store, with smoking rubble everywhere. After gesturing to the back of the Orkin van, where Edgar's spaceship is neatly stowed, Kay pulls out his cell phone. Zed is in his office, looking down to the vast floor below where he sees the four worm guys with suitcases walking across the floor, then looks up at the screen. Edgar gets out and walks away fast, cursing under his breath, ranting and livid, thinking hard. As he passes a newsstand, he grabs the news vendor by the collar.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The Orkin vehicle is stationed in an alleyway somewhere downtown, and from within, guttural cries of exasperation can be perceived. Inside the vehicle, the elaborate rosewood container is now battered and marred, its various latches holding firm against Edgar's repeated endeavors to claw his manner into it. He roars in fury and hurls the container against the side of the vehicle, where it ultimately fractures a hinge. Inside, there are dozens of valuable, glittering gemstones, which he promptly discards as worthless, but the rest of the container is vacant. He points up at the display with a laser implement, indicating the three stars that constitute the belt. Elizabeth glances up, as if she knows she's being observed, but she's just gazing at the sky, pondering how many stars will be visible tonight. It's more than Kay can endure, so he reaches out and switches a lever, switching off the image of her. The monitor goes blank, except for a data display. Jay drags a seat and sits down, and together Jay and Kay cross back toward the LAD (Landed Extraterrestrial Display), where each of the thousand or so extraterrestrials who reside on Earth are represented by a flickering illumination. Some lights are beginning to extinguish. Kay looks to his collaborator, then to the display, before Kay and Jay stroll away. Edgar reaches into the front seat of the vehicle and pulls out his twelve-gauge firearm, aiming it at the tow truck operator. The tow truck operator glances at him with scorn, and pulling back his shirt reveals a fierce-looking weapon. There are several photographs of a feline on the wall and a heap of jeweled feline collars. Jay's attention is interrupted by something through the window, where outside, lumbering straight for the shop, is Edgar. Jay fires, shattering the storefront window and detonating a vehicle on the street. The explosion hurls him up and back a good ten feet, slamming him into the partition with tremendous force. Edgar turns and rushes away down the street as Jay collects himself, leaping through the shattered storefront window and after Edgar. Kay gestures to a gathering of spectators, drawn by the curious detonations from the shop, with smoking debris everywhere. After gesturing to the back of the Orkin vehicle, where Edgar's spacecraft is neatly stored, Kay pulls out his cell phone. Zed is in his office, glancing down to the vast floor below where he sees the four worm guys with luggage walking across the floor, then looks up at the display. Edgar gets out and walks away swiftly, cursing under his breath, ranting and livid, thinking intently. As he passes a newsstand, he grabs the news vendor by the collar."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The Orkin van has been parked in an alleyway somewhere downtown, and from inside, people can hear throaty wails of frustration. Inside the van, the ornate rosewood box has now been battered and scarred, its various locks held tight against Edgar's repeated attempts to claw his way into it. Rage bellows from him, and the box is hurled against the side of the van by him, where a hinge is finally cracked. Inside, Edgar sees dozens of precious, glittering diamonds, which are promptly tossed aside by him as worthless, but the rest of the box is found empty. Up at the screen, he points with a laser pencil, indicating the three stars that make up the belt. Up looks Elizabeth, as if she knows she's being watched, but she's just looking at the sky, wondering how many stars will be out tonight. It's more than Kay can bear, so out a hand is reached by him to flick a switch, clicking off the picture of her. The monitor is left blank, except for a data screen. A chair is dragged by Jay, who sits down, and together the LAD (Landed Alien Display) is crossed back toward by Jay and Kay, where each of the thousand or so aliens who live on Earth is represented by a flickering light. Some lights are starting to go out. His partner and the screen are looked to by Kay before Kay and Jay walk away. Into the front seat of the van, Edgar reaches and pulls out his twelve-gauge shotgun, which is pointed at the tow truck driver by him. At Edgar, the tow truck driver looks with disdain, and a mean-looking gun is revealed as his shirt is pulled back. On the wall there are several photos of a cat and a pile of bejeweled cat collars. Jay's attention is broken by something through the window, through which Edgar is lumbering straight for the store. Jay fires, the storefront window is shattered by him, and he blows up a car on the street. He is hurled up and back a good ten feet by the blast, slamming him into the wall with tremendous force. Down the street, Edgar turns and rushes away as Jay picks himself up, and he leaps through the broken storefront window after Edgar. A group of onlookers is gestured to by Kay, drawn by the curious blasts from the store, with smoking rubble everywhere. After a gesture to the back of the Orkin van, where Edgar's spaceship is neatly stowed, his cell phone is pulled out by Kay. Zed is in his office, looking down to the vast floor below where he sees the four worm guys with suitcases walking across the floor, then he looks up at the screen. Edgar gets out and walks away fast, cursing under his breath, ranting and livid, thinking hard. As he passes a newsstand, the news vendor is grabbed by him by the collar."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The Orkin van sits in a downtown alley, echoing with Edgar's frustrated cries. Inside, a damaged rosewood box resists his attempts to open it. In anger, he throws it, cracking a hinge, revealing glittering diamonds he dismisses as worthless. Using a laser pencil, he points at stars on a screen. Elizabeth looks skyward, unaware she's observed, pondering the night's stars. Overwhelmed, Kay switches off her image, leaving a data screen. Jay, joining Kay, heads to the LAD, a display of Earth's thousand aliens, some lights dimming. As Edgar grabs a shotgun, the tow truck driver reveals his gun. Cat photos and jeweled collars adorn the walls. Jay spots Edgar outside, firing, blowing up a car, and getting slammed into a wall. Edgar flees, Jay pursuing through shattered glass. Kay gestures to onlookers, signaling the Orkin van's hidden spaceship, then uses his phone. Zed observes the worm guys with suitcases on a lower floor. Edgar exits, cursing, and grabs a news vendor as he passes."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The Orkin van, parked in a downtown alley, echoes with Edgar's frustrated wails. Inside, the ornate rosewood box, now damaged, resists his attempts to open it. He finally cracks a hinge, revealing dozens of diamonds, discarding them as worthless. Edgar points a laser pencil at the screen's three stars, while Elizabeth, unaware, gazes at the sky. Kay, unable to bear more, switches off her image, leaving just a data screen. Jay and Kay move to the LAD, noting some alien lights going out. Edgar grabs a shotgun, confronting a disdainful tow truck driver who reveals his own weapon. Photos of a cat and adorned collars line the walls. Jay notices Edgar approaching the store, fires, shattering the window, and blows up a car, crashing into the wall. Edgar flees, with Jay pursuing through the broken window. Kay signals onlookers amidst the debris and checks the Orkin van's hidden spaceship. Zed observes worm guys with suitcases before Edgar exits, cursing and grabbing a news vendor by the collar."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The Orkin van is discreetly parked in an obscure alleyway somewhere in the bustling downtown area, and from within its confines, deeply guttural wails of utter frustration can be distinctly heard echoing. Inside the cramped interior of the van, the once-pristine, ornate rosewood box now appears battered and scarred, its various intricate locks steadfastly holding against Edgar's relentless attempts to claw his way inside. He bellows furiously in rage and forcefully hurls the box against the side of the van with explosive anger, where it finally succumbs, cracking a hinge. Within its depths lie dozens of precious, dazzling diamonds, sparkling brilliantly, which he soon discards as worthless but finds that the remainder of the box is devoid of content. He points with determined precision at the screen using a laser pencil, highlighting the three prominent stars that collectively form the distinctive belt. Elizabeth gazes upward, as if aware that she is under observation, though in reality she is merely looking at the vast night sky, pondering how many stars will grace the night with their twinkling presence. It's more than Kay can emotionally handle, prompting him to reach out and flick a switch, effectively turning off the image of her. The monitor fades to black, leaving only a stark data screen in view. Jay drags a chair across the floor and sits down, and together Jay and Kay make their way back toward the LAD (Landed Alien Display), a remarkable display where each of the thousand or so aliens residing on Earth is symbolized by a flickering light. Some of these lights are ominously starting to extinguish. Kay glances at his partner, then at the screen, before both Kay and Jay walk away with a shared understanding. Edgar reaches into the front seat of the van with determination and pulls out his formidable twelve-gauge shotgun, aiming it menacingly at the tow truck driver, who in turn gazes back at Edgar with unabashed disdain, casually pulling back his shirt to reveal a mean-looking, intimidating gun. Adorning the wall are several photographs of a cat alongside a pile of ornate, bejeweled cat collars. Jay's attention is suddenly diverted by something outside the window, where Edgar strides purposefully toward the store. Jay fires his weapon, shattering the storefront window and causing a car on the street to explode violently. The resulting blast propels him upward and backward a good ten feet, slamming him into the wall with monumental force. Edgar pivots and dashes away down the street as Jay regains his footing, leaping through the shattered storefront window in pursuit. Kay gestures to a growing group of onlookers, who have been drawn to the scene by the curious and thunderous blasts from the store, amidst smoking rubble strewn everywhere. After gesturing toward the back of the Orkin van, where Edgar's spaceship is neatly and inconspicuously stowed, Kay pulls out his cell phone. Meanwhile, Zed is in his office, looking down upon the expansive floor below, where he sees the four worm guys carrying suitcases as they traverse the floor, then shifts his gaze up toward the screen. Edgar exits quickly and walks away with hurried steps, cursing under his breath, ranting furiously and seething with anger, his mind racing with intense thoughts. As he hurriedly passes a newsstand, he aggressively grabs the collar of the news vendor."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The unassuming Orkin van is discreetly stationed in an out-of-the-way alley somewhere within the bustling heart of the downtown area. From its tight quarters, deeply guttural howls of sheer frustration resonate and can be distinctly heard echoing through the narrow passageway. Within the van's confined space, a once-pristine, ornate rosewood box now appears significantly battered and scarred, yet its various intricate locks continue to hold firm against Edgar's relentless efforts to claw his way inside. With a voice filled with fury, he bellows in rage and, in a fit of explosive anger, forcefully hurls the box against the side of the van. Finally, it succumbs to his aggression, cracking a hinge in the process. Within the depths of the box lie dozens of precious, dazzling diamonds that sparkle brilliantly. However, he soon discards them as if they were utterly worthless and finds that the remainder of the box is devoid of any other contents.\n\nWith determined precision, he points at the screen using a laser pencil, highlighting the three prominent stars that together form the distinctive belt. Meanwhile, Elizabeth gazes upward at the vast expanse of the night sky, seemingly aware that she is under observation, though she is merely lost in thought, pondering exactly how many stars will grace the night sky with their delicate, twinkling presence. It quickly becomes more than Kay can emotionally handle, prompting him to reach a decision; he flicks a switch, effectively turning off the image of her. The monitor fades to black, leaving only a stark and emotionless data screen in plain view. Jay drags a chair noisily across the floor, duly sits down, and then both Jay and Kay proceed to make their way back toward the LAD (Landed Alien Display), which is a truly remarkable and captivating display. Here, each of the thousand or so aliens residing on Earth is represented by an individual flickering light, though some of these lights are ominously starting to extinguish. Kay exchanges a glance with his partner, then returns his gaze to the screen before both Kay and Jay walk away with a shared and silent understanding.\n\nMeanwhile, Edgar, with determination etched across his face, reaches into the front seat of the van and pulls out his formidable twelve-gauge shotgun, aiming it menacingly at the tow truck driver. In response, the driver looks back at Edgar with unabashed disdain and casually pulls back his shirt to reveal a mean-looking and intimidating gun. On the wall hang several photographs of a cat accompanied by a pile of ornate, bejeweled cat collars. Suddenly, Jay's attention is diverted by something outside the window. Edgar is seen striding purposefully toward the store, prompting Jay to fire his weapon, which shatters the storefront window and causes a car on the street to explode violently. The resultant blast propels him upward and backward a good ten feet, slamming him into the wall with staggering force. Edgar pivots on his heels and dashes away down the street, even as Jay regains his footing, leaping through the shattered storefront window in hot pursuit. Kay gestures toward a growing group of onlookers, drawn to the scene by the curious and thunderous blasts permeating the store, amidst smoking rubble strewn everywhere. Afterward, he gestures toward the back of the Orkin van, where Edgar's spaceship is neatly and inconspicuously stowed away, then pulls out his cell phone. Meanwhile, Zed, in his office, looks down upon the expansive floor below, observing the four worm guys carrying suitcases as they traverse the space, then shifts his gaze upward toward the screen. Edgar exits with hasty steps and strides away, cursing rancorously under his breath, ranting furiously, and seething with anger as his mind races with a cacophony of intense thoughts. As he rushes past a newsstand, he aggressively seizes the collar of the news vendor."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The Orkin van sits idly in an alleyway somewhere in the heart of downtown; from within its confines, guttural wails of frustration emanate, echoing off the walls. Inside the van, Edgar, consumed by desperation, battles with a now battered and scarred ornate rosewood box, its various locks steadfastly resisting his repeated and feverish attempts to pry it open. As his frustration peaks, Edgar bellows in rage, his voice reverberating in the cramped space of the van, before he seizes the box and hurls it with all his might against the side of the van. The box strikes the wall, and a hinge finally gives, cracking open just enough to reveal its contents. Inside, a dazzling array of dozens of precious, glittering diamonds catches the light momentarily before Edgar, dismissing them as worthless, discards them without a second thought. Beyond the discarded jewels, the rest of the box is empty, offering nothing to appease Edgar's frenzy. Meanwhile, in another part of the van, he picks up a laser pencil and points it up at a display screen, specifically indicating the three stars that form a belt. Simultaneously, elsewhere, Elizabeth stands looking up at the sky, as if stirred by a distant sense of awareness, pondering the number of stars that might grace the night sky. This scene becomes too much for Kay to handle, prompting him to reach out and flick a switch, extinguishing the image of Elizabeth on the monitor and leaving only a data screen in its place. At this moment, Jay decides to drag a chair over and sit down beside Kay, as they both turn their attention back to the LAD (Landed Alien Display), where every flickering light represents one of the thousand or so aliens residing on Earth. They observe as some of the lights begin to extinguish, signaling a crisis. Kay exchanges a meaningful glance with Jay as he looks from his partner to the screen before they make their way back from the display. Meanwhile, Edgar, consumed by his mission, lunges forward to grab his twelve-gauge shotgun from the front seat of the van, directing its menacing barrel towards the tow truck driver. The driver, unfazed, looks back at Edgar with disdain and, in a practiced motion, pulls back his shirt to reveal a mean-looking gun of his own. Nearby, several photos of a cat adorn the wall above a pile of bejeweled cat collars, capturing Jay’s attention until something outside the window seizes it once more. Without warning, Edgar is seen lumbering with determination straight towards the store. Reacting swiftly, Jay fires his weapon, shattering the storefront window and inadvertently blowing up a car stationed on the street. The explosive blast sends Jay careening upwards and backwards, launching him a good ten feet until he slams with tremendous force against the wall. Edgar uses the chaos to his advantage, turning on his heels and sprinting down the street. Jay, not to be outdone, picks himself up from the ground, adrenaline surging, and leaps through the now broken storefront window in hot pursuit of Edgar. In the aftermath, Kay steps forward, gesturing to a group of onlookers drawn to the scene by the peculiar blasts emanating from the store and the resulting smoking rubble scattered everywhere. Kay gestures back towards the Orkin van, hinting at the presence of Edgar's spaceship neatly tucked away, before retrieving his cell phone. Somewhere else, Zed stands in his office, gazing down at the vast floor below, where he observes four worm guys carrying suitcases as they traverse the floor, before returning his gaze to the screen. Elsewhere, Edgar, consumed by agitation, exits and walks away briskly, cursing under his breath, frustration boiling over as he rants and remains deep in thought. As he strides past a newsstand, his simmering anger gets the better of him, and he seizes the news vendor by the collar in a fit of rage."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The Orkin van is parked in a downtown alleyway, echoing with Edgar's frustrated cries as he struggles to open an ornate, battered rosewood box. In a fit of rage, he hurls the box against the van's side, cracking a hinge and revealing dozens of discarded diamonds, though the rest of the box is empty. Meanwhile, Kay switches off a monitor displaying Elizabeth, leaving only a data screen as he and Jay return to the Landed Alien Display, noting some flickering lights going out. Edgar retrieves a twelve-gauge shotgun from the van, threatening a tow truck driver who responds by revealing his own weapon. Amidst this tension, Jay notices Edgar advancing on a store, fires his weapon, and is blasted back into a wall by the explosion, before pursuing Edgar through the shattered storefront. Outside, Kay gestures the onlookers toward the Orkin van, knowing Edgar's spaceship is hidden there, and makes a call on his cell phone. Zed watches the four worm guys with suitcases below his office before focusing back on his screen. Edgar walks away quickly, cursing and ranting, pausing to grab a news vendor by the collar in frustration."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The Orkin van, a pest control vehicle commonly seen in many cities and suburbs, is parked in an alleyway somewhere downtown bustling with evening activity, and from inside, throaty wails of frustration can be heard. Inside the van, the ornate rosewood box, crafted in the style of 18th-century European artistry, is now battered and scarred, its various locks holding tight against Edgar's repeated attempts to claw his way into it. He bellows in rage and hurls the box against the side of the van, where it finally cracks a hinge. Inside, there are dozens of precious, glittering diamonds, likely sourced from a notorious heist last year, which he promptly tosses aside as worthless, but the rest of the box is empty. He points up at the screen with a laser pencil, a tool often used in professional presentations, indicating the three stars that make up Orion's Belt, part of a prominent constellation visible from most parts of the world. Elizabeth looks up, as if she knows she's being watched, but she's just looking at the sky, wondering how many stars will be out tonight, a pastime inspired by her love of astronomy. It's more than Kay, a seasoned agent skilled in advanced surveillance technology, can bear, so he reaches out and flicks a switch, clicking off the picture of her. The monitor goes blank, except for a data screen configured to display critical mission information. Jay drags a chair and sits down, and together Jay and Kay cross back toward the LAD (Landed Alien Display), a sophisticated monitoring system where each of the thousand or so aliens who live on Earth is represented by a flickering light. Some lights are starting to go out, signifying potential unauthorized departures. Kay looks to his partner, then to the screen, before Kay and Jay walk away. Edgar reaches into the front seat of the van and pulls out his twelve-gauge shotgun, a powerful firearm often used in hunting, pointing it at the tow truck driver. The tow truck driver looks at him with disdain, and pulling back his shirt reveals a mean-looking gun, likely a high-caliber handgun. There are several photos of a cat on the wall and a pile of bejeweled cat collars, indicating a possible connection to a recent string of pet thefts. Jay's attention is broken by something through the window, where outside, lumbering straight for the store, is Edgar. Jay fires, shattering the storefront window and blowing up a car on the street, a dramatic escalation that draws in nearby pedestrians. The blast hurls him up and back a good ten feet, slamming him into the wall with tremendous force. Edgar turns and rushes away down the street as Jay picks himself up, leaping through the broken storefront window and after Edgar. Kay gestures to a group of onlookers, drawn by the curious blasts from the store, with smoking rubble everywhere. After gesturing to the back of the Orkin van, where Edgar's spaceship is neatly stowed, an advanced craft likely adapted for disguise, Kay pulls out his cell phone to call for backup. Zed is in his office, the command center for all agency operations, looking down to the vast floor below where he sees the four worm guys, alien entities known for their intelligence and love of coffee, with suitcases walking across the floor, then looks up at the screen. Edgar gets out and walks away fast, cursing under his breath, ranting and livid, thinking hard about his next move. As he passes a newsstand, he grabs the news vendor by the collar, demanding information about local events."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The Orkin van is parked in an alleyway somewhere downtown and from inside throaty wails of frustration can be heard. Inside the van the ornate rosewood box is now battered and scarred its various locks holding tight against Edgar's repeated attempts to claw his way into it. He bellows in rage and hurls the box against the side of the van where it finally cracks a hinge. Inside there are dozens of precious glittering diamonds which he promptly tosses aside as worthless but the rest of the box is empty. He points up at the screen with a laser pencil indicating the three stars that make up the belt. Elizabeth looks up as if she knows she is being watched but she is just looking at the sky wondering how many stars will be out tonight. It is more than Kay can bear so he reaches out and flicks a switch clicking off the picture of her. The monitor goes blank except for a data screen. Jay drags a chair and sits down and together Jay and Kay cross back toward the LAD Landed Alien Display where each of the thousand or so aliens who live on Earth are represented by a flickering light. Some lights are starting to go out. Kay looks to his partner then to the screen before Kay and Jay walk away. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Edgar reaches into the front seat of the van and pulls out his twelvegauge shotgun pointing it at the tow truck driver. The tow truck driver looks at him with disdain and pulling back his shirt reveals a meanlooking gun. There are several photos of a cat on the wall and a pile of bejeweled cat collars. Jay's attention is broken by something through the window where outside lumbering straight for the store is Edgar. Jay fires shattering the storefront window and blowing up a car on the street. The blast hurls him up and back a good ten feet slamming him into the wall with tremendous force. Edgar turns and rushes away down the street as Jay picks himself up leaping through the broken storefront window. and after Edgar Kay gestures to a group of onlookers drawn by the curious blasts from the store with smoking rubble everywhere. After gesturing to the back of the Orkin van where Edgar's spaceship is neatly stowed Kay pulls out his cell phone. Zed is in his office looking down to the vast floor below where he sees the four worm guys with suitcases walking across the floor then looks up at the screen. Edgar gets out and walks away fast cursing under his breath ranting and livid thinking hard. As he passes a newsstand he grabs the news vendor by the collar."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The Orkin van is parked in an alleyway somewhere downtown and from inside throaty wails of frustration can be heard. Inside the van the ornate rosewood box is now battered and scarred its various locks holding tight against Edgar's repeated attempts to claw his way into it. He bellows in rage and hurls the box against the side of the van where it finally cracks a hinge. Inside there are dozens of precious glittering diamonds which he promptly tosses aside as worthless but the rest of the box is empty. He points up at the screen with a laser pencil indicating the three stars that make up the belt. Elizabeth looks up as if she knows she is being watched but she is just looking at the sky wondering how many stars will be out tonight. It is more than Kay can bear so he reaches out and flicks a switch clicking off the picture of her. The monitor goes blank except for a data screen. Jay drags a chair and sits down and together Jay and Kay cross back toward the LAD Landed Alien Display where each of the thousand or so aliens who live on Earth are represented by a flickering light. Some lights are starting to go out. Kay looks to his partner then to the screen before Kay and Jay walk away. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Edgar reaches into the front seat of the van and pulls out his twelvegauge shotgun pointing it at the tow truck driver. The tow truck driver looks at him with disdain and pulling back his shirt reveals a meanlooking gun. There are several photos of a cat on the wall and a pile of bejeweled cat collars. Jay's attention is broken by something through the window where outside lumbering straight for the store is Edgar. Jay fires shattering the storefront window and blowing up a car on the street. The blast hurls him up and back a good ten feet slamming him into the wall with tremendous force. Edgar turns and rushes away down the street as Jay picks himself up leaping through the broken storefront window. and after Edgar Kay gestures to a group of onlookers drawn by the curious blasts from the store with smoking rubble everywhere. After gesturing to the back of the Orkin van where Edgar's spaceship is neatly stowed Kay pulls out his cell phone. Zed is in his office looking down to the vast floor below where he sees the four worm guys with suitcases walking across the floor then looks up at the screen. Edgar gets out and walks away fast cursing under his breath ranting and livid thinking hard. As he passes a newsstand he grabs the news vendor by the collar."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The Orkin van is parked in an alleyway somewhere downtown and from inside throaty wails of frustration can be heard. Inside the van the ornate rosewood box is now battered and scarred its various locks holding tight against Edgar's repeated attempts to claw his way into it. He bellows in rage and hurls the box against the side of the van where it finally cracks a hinge. Inside there are dozens of precious glittering diamonds which he promptly tosses aside as worthless but the rest of the box is empty. He points up at the screen with a laser pencil indicating the three stars that make up the belt. Elizabeth looks up as if she knows she is being watched but she is just looking at the sky wondering how many stars will be out tonight. Edgar turns and rushes away down the street as Jay picks himself up leaping through the broken storefront window. and after Edgar Kay gestures to a group of onlookers drawn by the curious blasts from the store with smoking rubble everywhere. After gesturing to the back of the Orkin van where Edgar's spaceship is neatly stowed Kay pulls out his cell phone. Zed is in his office looking down to the vast floor below where he sees the four worm guys with suitcases walking across the floor then looks up at the screen. Edgar gets out and walks away fast cursing under his breath ranting and livid thinking hard. As he passes a newsstand he grabs the news vendor by the collar."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The Orkin van is parked in an alleyway somewhere downtown and from inside throaty wails of frustration can be heard. Inside the van the ornate rosewood box is now battered and scarred its various locks holding tight against Edgar's repeated attempts to claw his way into it. Zed is in his office looking down to the vast floor below where he sees the four worm guys with suitcases walking across the floor then looks up at the screen. Edgar gets out and walks away fast cursing under his breath ranting and livid thinking hard. As he passes a newsstand he grabs the news vendor by the collar."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The bakery cart is halted in a meadow someplace uptown, and from within, melodic giggles of delight can be perceived. Inside the cart, the ancient bronze vase is now polished and gleaming, its single lid staying firm against Rita's gentle efforts to pry it open. She whispers in surprise and places the vase on the ground, where it eventually opens a seam. Inside, there are dozens of tiny, dull marbles, which she immediately cherishes as invaluable, but the rest of the vase is vacant. She gestures down at the rug with a wooden spatula, highlighting the five seashells that form the circle. Henry gazes down, as if he realizes he's being ignored, but he's merely staring at the ocean, pondering how many waves will crash tonight. It's less than Max can tolerate, so he reaches in and flips a knob, turning on the audio of him. The stereo fills with music, except for a visual graph. Lee drags a table and stands up, and together Lee and Max stroll forward toward the PNP (Pirate Navigator Panel), where each of the dozen or so ships that sail the seas are signified by a steady chime. A few chimes are starting to echo. Max gazes to his companion, then to the graph, before Max and Lee jog quietly. Rita lunges into the back seat of the cart and lifts out her wooden spear, shaking it at the clown car pilot. The clown car pilot stares at her with amusement, and lifting up his pants reveals a comical-looking stick. There are numerous sketches of a fish on the ceiling and a stack of embroidered fish nets. Lee's focus is captured by something behind the curtain, where inside, crawling slowly for the studio, is Rita. Lee dives, smashing the studio curtain and collapsing a tree in the room. The impact rolls him down and forward a good twenty feet, bouncing him off the ceiling with mild force. Rita pivots and jogs toward the forest as Lee steadies himself, sliding past the split studio curtain and after Rita. Max signals to a crew of tourists, drawn by the quiet echoes from the studio, with colorful confetti everywhere. After signaling to the front of the bakery cart, where Rita's balloon is elegantly tucked, Max lifts out his walkie-talkie. Ned is in his cabin, gazing up to the crowded ceiling above where he spots the eight dwarf stars with rucksacks trudging across the ceiling, then glances down at the graph. Rita steps in and strolls toward quickly, singing under her breath, humming and joyful, pondering softly. As she enters a garden, she pinches the gardener by the sleeve."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The Orkin van is parked downtown, echoing with Edgar's frustrated cries as he struggles to open a battered rosewood box. After hurling it against the van's side, it finally cracks open, revealing diamonds he deems worthless. Ignoring the gems, he points to a screen showing three stars. Meanwhile, Jay and Kay are monitoring aliens on Earth, noticing some lights on their display beginning to flicker out. Edgar retrieves a shotgun from the van and confronts a tow truck driver, who reveals his own weapon. Inside, Jay is startled by Edgar approaching the store, leading to an explosive encounter. Jay fires, causing a blast that propels him back. Edgar flees, and Jay pursues him through the shattered window. Kay signals the onlookers toward the van where Edgar's spaceship is hidden, then calls Zed. Edgar angrily departs, grabbing a news vendor by the collar as he passes."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As he passes a newsstand he grabs the news vendor by the collar Edgar gets out and walks away fast cursing under his breath ranting and livid thinking hard Zed is in his office looking down to the vast floor below where he sees the four worm guys with suitcases walking across the floor then looks up at the screen After gesturing to the back of the Orkin van where Edgar's spaceship is neatly stowed Kay pulls out his cell phone and after Edgar Kay gestures to a group of onlookers drawn by the curious blasts from the store with smoking rubble everywhere Edgar turns and rushes away down the street as Jay picks himself up leaping through the broken storefront window The blast hurls him up and back a good ten feet slamming him into the wall with tremendous force Jay fires shattering the storefront window and blowing up a car on the street Jay's attention is broken by something through the window where outside lumbering straight for the store is Edgar There are several photos of a cat on the wall and a pile of bejeweled cat collars The tow truck driver looks at him with disdain and pulling back his shirt reveals a meanlooking gun Edgar reaches into the front seat of the van and pulls out his twelvegauge shotgun pointing it at the tow truck driver Kay looks to his partner then to the screen before Kay and Jay walk away Some lights are starting to go out Jay drags a chair and sits down and together Jay and Kay cross back toward the LAD Landed Alien Display where each of the thousand or so aliens who live on Earth are represented by a flickering light The monitor goes blank except for a data screen It is more than Kay can bear so he reaches out and flicks a switch clicking off the picture of her Elizabeth looks up as if she knows she is being watched but she is just looking at the sky wondering how many stars will be out tonight He points up at the screen with a laser pencil indicating the three stars that make up the belt Inside there are dozens of precious glittering diamonds which he promptly tosses aside as worthless but the rest of the box is empty He bellows in rage and hurls the box against the side of the van where it finally cracks a hinge Inside the van the ornate rosewood box is now battered and scarred its various locks holding tight against Edgar's repeated attempts to claw his way into it The Orkin van is parked in an alleyway somewhere downtown and from inside throaty wails of frustration can be heard"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Inside the van the ornate rosewood box is now battered and scarred its various locks holding tight against Edgar's repeated attempts to claw his way into it The Orkin van is parked in an alleyway somewhere downtown and from inside throaty wails of frustration can be heard Inside there are dozens of precious glittering diamonds which he promptly tosses aside as worthless but the rest of the box is empty He bellows in rage and hurls the box against the side of the van where it finally cracks a hinge Elizabeth looks up as if she knows she is being watched but she is just looking at the sky wondering how many stars will be out tonight He points up at the screen with a laser pencil indicating the three stars that make up the belt The monitor goes blank except for a data screen It is more than Kay can bear so he reaches out and flicks a switch clicking off the picture of her Some lights are starting to go out Jay drags a chair and sits down and together Jay and Kay cross back toward the LAD Landed Alien Display where each of the thousand or so aliens who live on Earth are represented by a flickering light Edgar reaches into the front seat of the van and pulls out his twelvegauge shotgun pointing it at the tow truck driver Kay looks to his partner then to the screen before Kay and Jay walk away There are several photos of a cat on the wall and a pile of bejeweled cat collars The tow truck driver looks at him with disdain and pulling back his shirt reveals a meanlooking gun Jay fires shattering the storefront window and blowing up a car on the street Jay's attention is broken by something through the window where outside lumbering straight for the store is Edgar Edgar turns and rushes away down the street as Jay picks himself up leaping through the broken storefront window The blast hurls him up and back a good ten feet slamming him into the wall with tremendous force After gesturing to the back of the Orkin van where Edgar's spaceship is neatly stowed Kay pulls out his cell phone and after Edgar Kay gestures to a group of onlookers drawn by the curious blasts from the store with smoking rubble everywhere Edgar gets out and walks away fast cursing under his breath ranting and livid thinking hard Zed is in his office looking down to the vast floor below where he sees the four worm guys with suitcases walking across the floor then looks up at the screen As he passes a newsstand he grabs the news vendor by the collar"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The tow truck driver looks at him with disdain and pulling back his shirt reveals a meanlooking gun There are several photos of a cat on the wall and a pile of bejeweled cat collars Jay's attention is broken by something through the window where outside lumbering straight for the store is Edgar Jay fires shattering the storefront window and blowing up a car on the street The blast hurls him up and back a good ten feet slamming him into the wall with tremendous force Edgar turns and rushes away down the street as Jay picks himself up leaping through the broken storefront window and after Edgar Kay gestures to a group of onlookers drawn by the curious blasts from the store with smoking rubble everywhere After gesturing to the back of the Orkin van where Edgar's spaceship is neatly stowed Kay pulls out his cell phone Zed is in his office looking down to the vast floor below where he sees the four worm guys with suitcases walking across the floor then looks up at the screen Edgar gets out and walks away fast cursing under his breath ranting and livid thinking hard As he passes a newsstand he grabs the news vendor by the collar The Orkin van is parked in an alleyway somewhere downtown and from inside throaty wails of frustration can be heard Inside the van the ornate rosewood box is now battered and scarred its various locks holding tight against Edgar's repeated attempts to claw his way into it He bellows in rage and hurls the box against the side of the van where it finally cracks a hinge Inside there are dozens of precious glittering diamonds which he promptly tosses aside as worthless but the rest of the box is empty He points up at the screen with a laser pencil indicating the three stars that make up the belt Elizabeth looks up as if she knows she is being watched but she is just looking at the sky wondering how many stars will be out tonight It is more than Kay can bear so he reaches out and flicks a switch clicking off the picture of her The monitor goes blank except for a data screen Jay drags a chair and sits down and together Jay and Kay cross back toward the LAD Landed Alien Display where each of the thousand or so aliens who live on Earth are represented by a flickering light Some lights are starting to go out Kay looks to his partner then to the screen before Kay and Jay walk away Edgar reaches into the front seat of the van and pulls out his twelvegauge shotgun pointing it at the tow truck driver"
        }
      ]
    }
  ]
}