{
  "ground_truth": "Jay hears a voice, but it's not the Vendor's; it's coming from a dog. Kay approaches, signaling Jay to keep quiet, and grabs the dog, Frank, who yelps like a dog. Passersby glare at Kay as if he's mistreating the dog, and Jay tries to explain. Kay shakes Frank the Pug, trying to get an answer, then shakes him again before letting go. Jay, lost in thought, suddenly notices Frank barking at a cat down the sidewalk. In the morgue, Laurel is at her desk when Rosenberg's cat jumps onto it, startling her. She pets the cat and notices something on its collar: a circular icon made of a strange, beautiful metal with a light green, translucent center. As Laurel peers into the jewel, her face shows amazement, as if she's transported to another universe, with a blank look as she imagines sailing through a starfield at light speed. Meanwhile, in the corridor, a bell rings. Tony quickly snaps a fly swatter at a buzzing fly as Edgar winces, flicking the swatter again to kill another fly, making Edgar grit his teeth. Tony looks down at Edgar's hands on the counter as cockroaches stream out from his sleeve. The scene shifts back to the morgue, where Laurel is slammed into a wall by Edgar, who is furious. He grabs Laurel and drags her toward the equipment, and as they approach, Orion the cat bolts from under it, leaping over cabinets and landing on a tall one. Edgar starts to turn when they hear the bell and a voice outside. Jay looks at Laurel, amazed by his apparent influence over her. Though she seems irritated with him, her tone doesn't match her words. Laurel rolls her eyes and looks down, pointing toward her waist.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Jay perceives a sound, but it's not the Vendor's; it's originating from a canine. Kay advances, indicating Jay to remain silent, and seizes the canine, Frank, who barks like a canine. Bystanders stare at Kay as if he's abusing the canine, and Jay attempts to clarify. Kay rattles Frank the Pug, attempting to obtain a reply, then rattles him once more before releasing. Jay, absorbed in reflection, suddenly observes Frank barking at a feline down the pavement. In the morgue, Laurel is at her desk when Rosenberg's feline leaps onto it, surprising her. She caresses the feline and detects something on its collar: a circular symbol composed of a peculiar, exquisite alloy with a pale green, see-through center. As Laurel gazes into the gem, her visage exhibits wonder, as if she's conveyed to another cosmos, with a vacant expression as she envisions traveling through a starfield at light velocity. Meanwhile, in the hallway, a chime sounds. Tony abruptly strikes a fly swatter at a humming insect as Edgar grimaces, flicking the swatter once more to eliminate another insect, making Edgar clench his jaw. Tony gazes down at Edgar's hands on the counter as roaches pour out from his sleeve. The scene transitions back to the morgue, where Laurel is thrust into a partition by Edgar, who is enraged. He seizes Laurel and hauls her toward the apparatus, and as they advance, Orion the feline dashes from beneath it, vaulting over storage units and landing on a lofty one. Edgar begins to pivot when they perceive the chime and a sound outside. Jay glances at Laurel, astonished by his apparent sway over her. Although she appears annoyed with him, her tone doesn't correspond with her statements. Laurel rolls her eyes and glances down, indicating toward her midriff."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Jay hears a voice, but it's not the Vendor's; it is heard coming from a dog. Kay approaches, signaling Jay to keep quiet, and grabs the dog, Frank, who yelps like a dog. Passersby glare at Kay as if the dog is being mistreated by him, and Jay tries to explain. Frank the Pug is shaken by Kay, who tries to get an answer, then he shakes him again before letting go. Jay, lost in thought, suddenly notices Frank barking at a cat down the sidewalk. In the morgue, Laurel is at her desk when Rosenberg's cat jumps onto it, startling her. She pets the cat and notices something on its collar: a circular icon made of a strange, beautiful metal with a light green, translucent center. As Laurel peers into the jewel, amazement shows on her face, as if she is transported to another universe, with a blank look as she imagines sailing through a starfield at light speed. Meanwhile, in the corridor, a bell rings. Tony quickly snaps a fly swatter at a buzzing fly as Edgar winces and flicks the swatter again to kill another fly, making Edgar grit his teeth. Tony looks down at Edgar's hands on the counter as cockroaches are seen streaming out from his sleeve. The scene shifts back to the morgue, where Edgar furiously slams Laurel into a wall. He grabs Laurel and drags her toward the equipment, and as they approach, Orion the cat bolts from under it, leaping over cabinets and landing on a tall one. Edgar starts to turn when the bell and a voice outside are heard by them. Jay looks at Laurel, who is amazed by his apparent influence over her. Though he seems to irritate her, her tone doesn't match her words. Laurel rolls her eyes and looks down, pointing toward her waist."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Jay hears a voice not from the Vendor but from a dog. Kay signals Jay to stay quiet and grabs Frank the dog, who yelps, drawing glares from passersby. Jay tries to explain as Kay shakes Frank for answers, then lets go. Jay, lost in thought, notices Frank barking at a cat. At the morgue, Laurel is startled by Rosenberg's cat, which jumps on her desk. She pets the cat and sees a circular icon on its collar, made of a strange metal with a green, translucent center. Laurel peers into the jewel, looking amazed as if transported to another universe, imagining herself in a starfield. In the corridor, Tony snaps a fly swatter at a buzzing fly as Edgar winces and grits his teeth, noticing cockroaches streaming from his sleeve. Back in the morgue, Edgar, furious, slams Laurel into a wall, dragging her toward equipment. Orion the cat bolts, leaping over cabinets. Edgar turns as a bell rings and a voice is heard. Jay looks at Laurel, amazed by her reaction to him. Though irritated, her tone is at odds with her words as she rolls her eyes and points toward her waist."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Jay hears a voice, but it's from a dog, not the Vendor. Kay signals Jay to stay quiet, grabs Frank, the dog, who yelps. Passersby glare, thinking Kay mistreats Frank. Jay attempts to explain. Kay shakes Frank twice before releasing him. Jay notices Frank barking at a cat on the sidewalk. In the morgue, Laurel is startled by Rosenberg's cat on her desk. She pets it, finding a circular icon on its collar of strange metal with a light green center. Laurel peers into it, amazed, imagining sailing through a starfield. Meanwhile, in the corridor, a bell rings. Tony snaps a fly swatter at buzzing flies, making Edgar wince. Cockroaches emerge from Edgar's sleeve. Back in the morgue, Edgar slams Laurel into a wall, furious, and drags her towards equipment; Orion the cat escapes. Edgar hears the bell and a voice. Jay looks at Laurel, amazed, but she seems irritated, rolling her eyes and pointing toward her waist."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Jay becomes aware of a voice resonating in the air, but it does not belong to the Vendor; rather, it is coming from a nearby dog. Calmly and with purpose, Kay approaches the scene, subtly signaling Jay to maintain silence. With a firm yet gentle motion, Kay reaches down and takes hold of the dog, named Frank. Frank responds with a yelp that unmistakably sounds like any typical dog's cry. Observers passing by cast disapproving glances toward Kay, as if they believe he is handling the dog roughly, prompting Jay to attempt an explanation. Persistently, Kay shakes Frank the Pug, intent on eliciting a response, and does so a second time before releasing him. Jay, momentarily lost in his own thoughts, suddenly becomes aware of Frank barking energetically at a cat further down the sidewalk.\n\nInside the morgue, Laurel is seated at her desk, focused on her duties, when Rosenberg's cat unexpectedly leaps onto the surface, startling her. She gently pets the feline and then notices an intriguing object on its collar: a circular emblem crafted from an unusual, strikingly beautiful metal, featuring a center that is light green and translucently luminous. As Laurel gazes deeply into the jewel, her expression transforms into one of sheer amazement, almost as if she has been transported to another universe, her face blank as she envisions racing through a starfield with the speed of light. Meanwhile, in the hallway just outside, a bell tolls. Tony, ever alert, quickly snaps a fly swatter at a buzzing fly, causing Edgar to wince. Tony swats again, successfully disposing of another fly, making Edgar grit his teeth with frustration. Tony’s eyes drop to Edgar's hands resting on the counter, where cockroaches begin pouring out from the sleeve of his garment.\n\nThe scene then shifts back to the morgue, where Laurel suddenly finds herself slammed against a wall by an enraged Edgar. With a firm grip, he seizes Laurel and drags her forcefully towards the equipment area. As they near, Orion the cat swiftly darts out from under the equipment, making a graceful leap over the cabinets and landing deftly on a tall one. Edgar starts to make a move when the sound of the bell ringing and a voice from outside capture their attention. Jay regards Laurel with a sense of amazement, impressed by the apparent influence he seems to wield over her. Although she seems somewhat irritated with him, the tone of her voice does not quite match the words she speaks. Laurel rolls her eyes in exasperation and directs her gaze downward, pointing in the direction of her waist."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Jay becomes aware of a peculiar voice that seems to be resonating softly in the air around him. Interestingly, this voice does not originate from the Vendor as one might expect; instead, it mysteriously emanates from a nearby dog whose presence garners attention. Calmly, with a sense of purpose and confidence, Kay strides toward the unfolding scene, subtly signaling Jay to remain silent and not to draw additional attention to the situation. With a firm yet gentle motion, infused with a sense of caution, Kay gracefully reaches down and takes hold of the dog, whose name is Frank. In response, Frank lets out a distinct yelp, which unmistakably sounds like the usual cry of any typical dog. Observers passing by cast disapproving glances directed toward Kay, as if they suspect that he might be handling the dog too roughly, thus prompting Jay to attempt a hasty explanation to alleviate any misunderstanding. Persistently and with unwavering determination, Kay shakes Frank the Pug, intent on eliciting a response, and then proceeds to repeat the action one more time before finally releasing him from his grasp. Jay, who had momentarily become lost in his own thoughts, suddenly snaps back to reality and becomes aware of Frank, who is now barking energetically and enthusiastically at a cat further down the bustling sidewalk.\n\nInside the confines of the morgue, Laurel is seated at her desk, diligently focused on her routine duties, when suddenly, without any warning, Rosenberg's cat makes an unexpected leap onto the surface, startling her momentarily. She gently pets the feline, her touch soft and reassuring, and then her eyes are drawn to an intriguing object on its collar: a circular emblem crafted from an unusual, strikingly beautiful metal, featuring a center that is light green and translucently luminous. As Laurel gazes deeply into this mesmerizing jewel, her expression transforms into one of sheer and utter amazement, almost as if she has been completely transported to another universe. Her face appears blank as she envisions racing through a dazzling starfield with the speed of light. Meanwhile, just outside the room in the hallway, the sound of a bell tolling rings through the air. Tony, ever alert and always on guard, quickly snaps a fly swatter at a buzzing fly, causing Edgar to wince in reaction. Tony swats again, successfully disposing of another fly, making Edgar grit his teeth in frustration, a reaction he struggles to conceal. Tony’s eyes drop down to Edgar's hands resting nonchalantly on the counter, when suddenly, cockroaches begin pouring out from the sleeve of his garment, adding to the unsettling scene.\n\nThe scene then shifts back to the morgue, where Laurel suddenly finds herself being slammed against a wall by an enraged and furious Edgar. With a firm grip, he seizes Laurel and drags her forcefully toward the area where the equipment is stored. As they draw closer, Orion the cat, with calculated agility, swiftly darts out from under the equipment, making a graceful leap over the cabinets and landing deftly on a tall one. Edgar starts to make a move when the sound of the bell ringing and a voice from outside capture their attention, pausing the tense moment. Jay regards Laurel with a sense of amazement and curiosity, impressed by the apparent influence he seems to wield over her. Although she seems somewhat irritated with him, displaying subtle signs of annoyance, the tone of her voice does not quite match the words she speaks, indicating an inner conflict. Laurel rolls her eyes in exasperation and directs her gaze downward, pointing in the direction of her waist in a gesture that suggests she might be hinting at something."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Jay stands in the midst of the busy scene, his ears catch an unexpected sound—a voice not belonging to the Vendor, but seemingly emanating from a dog nearby. In response to this surprising auditory discovery, Kay makes his way toward Jay, subtly signaling him to remain silent. He reaches out and firmly grabs the dog, Frank, who lets out a yelp typical of his canine nature. As spectators pass by, their disapproving glances suggest they perceive Kay's actions as harsh treatment of the dog, prompting Jay to attempt a hurried explanation to clarify the situation. Despite the onlookers' judgmental stares, Kay resolutely shakes Frank the Pug in an effort to elicit a response. He repeats the action, determined to get an answer, before finally releasing the dog from his grip. Meanwhile, Jay is momentarily lost in his own thoughts until his attention is drawn back to Frank, who has shifted his focus and is now barking animatedly at a cat farther down the sidewalk. In a different location entirely, the morgue serves as the setting where Laurel, seated at her desk, experiences an unexpected interruption as Rosenberg's cat leaps onto her workspace, causing her a brief start. Attempting to soothe her startled nerves, Laurel extends a gentle hand to pet the feline and in doing so, she notices an intriguing object on its collar. The object presents itself as a circular icon crafted from a strange and beautiful metal, its center a light green, translucent gem. As Laurel peers curiously into this jewel, her facial expression transforms into one of sheer amazement, as if she is being transported to another realm. Her mind fills with the fantastical imagery of sailing through a starfield at light speed, leaving her with a blank, otherworldly gaze. Concurrently, out in the corridor, the ringing of a bell resonates, capturing attention. Tony, reacting quickly to the sound, wields a fly swatter with precision, aiming and snapping it at a buzzing fly as Edgar, standing nearby, winces in discomfort. Tony continues to flick the swatter with accuracy, managing to eliminate another fly, causing Edgar to grit his teeth in response. As Tony's eyes shift downward to observe Edgar's hands resting on the counter, a disturbing sight unfolds: cockroaches emerging and streaming out from Edgar's sleeve, unsettling the scene further. The narrative returns to the morgue just as Edgar, now furious, forcefully slams Laurel against a wall. With an aggressive grip, he seizes her, dragging her in the direction of the equipment. During their tense progression, Orion the cat makes a sudden appearance, darting out from beneath the equipment, skillfully leaping atop cabinets, and ultimately landing with agility on a tall one. In mid-action, Edgar begins to turn, his movement halted by the simultaneous echo of the bell and a voice emanating from outside. Observing the unfolding drama, Jay casts an amazed look at Laurel, perceiving his influence over her disposition. Despite her seeming irritation towards him, her tone carries a surprising mismatch with her words. In response, Laurel rolls her eyes, diverting her gaze downward, and subtly gestures toward her waist."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jay hears a voice coming from a dog, not the Vendor. Kay signals Jay to stay quiet and approaches the dog, Frank, who yelps, attracting glares from passersby who think Kay is mistreating him. Jay attempts to explain as Kay shakes Frank to get an answer before letting him go. Jay, lost in thought, then notices Frank barking at a cat down the sidewalk. Meanwhile, in the morgue, Laurel is startled by Rosenberg's cat jumping onto her desk. She pets the cat and examines its collar, discovering a circular icon made of strange metal with a translucent green center. As she peers into the jewel, her expression reflects amazement, as if she imagines sailing through a starfield at light speed. In the corridor, a bell rings as Tony snaps a fly swatter at a fly, causing Edgar, wincing, to swat another. Tony notices cockroaches streaming from Edgar's sleeve. Back in the morgue, Edgar, furious, slams Laurel into a wall and drags her toward the equipment. Orion the cat bolts from under it, leaping over cabinets to a tall one. Edgar turns as the bell rings and a voice calls outside. Jay observes Laurel, amazed by her apparent change, as she seems irritated but her tone contradicts her words. Laurel rolls her eyes and points toward her waist."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Jay hears a voice, but it's not the Vendor's; it's coming from a dog, an unusual sight considering dogs aren't known for speech. Kay approaches, signaling Jay to keep quiet, and grabs the dog, Frank, a pug known for its expressive face and sociable personality, who yelps like a dog. Passersby glare at Kay as if he's mistreating the dog, unaware of the unique nature of this particular pug, and Jay tries to explain. Kay shakes Frank the Pug, trying to get an answer, then shakes him again before letting go. Jay, lost in thought, suddenly notices Frank barking at a cat down the sidewalk, a common rivalry in neighborhood streets. In the morgue, Laurel is at her desk when Rosenberg's cat, a symbol of the late scientist's eccentricity, jumps onto it, startling her. She pets the cat and notices something on its collar: a circular icon made of a strange, beautiful metal known to be rare, with a light green, translucent center. As Laurel peers into the jewel, her face shows amazement, as if she's transported to another universe, with a blank look as she imagines sailing through a starfield at light speed, a concept popularized by science fiction. Meanwhile, in the corridor, a bell rings to signal the end of visiting hours. Tony quickly snaps a fly swatter at a buzzing fly as Edgar winces, flicking the swatter again to kill another fly, known pests in the morgue, making Edgar grit his teeth. Tony looks down at Edgar's hands on the counter as cockroaches, insects often associated with unsanitary conditions, stream out from his sleeve. The scene shifts back to the morgue, where Laurel is slammed into a wall by Edgar, who is furious, driven by unknown motives. He grabs Laurel and drags her toward the equipment, and as they approach, Orion the cat bolts from under it, leaping over cabinets and landing on a tall one, displaying the agility typical of felines. Edgar starts to turn when they hear the bell and a voice outside, signaling an unexpected visitor. Jay looks at Laurel, amazed by his apparent influence over her, a connection forged by their shared experiences. Though she seems irritated with him, her tone doesn't match her words, an indication of underlying tension. Laurel rolls her eyes and looks down, pointing toward her waist, perhaps indicating something hidden or unexpected."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Jay hears a voice but it is not the Vendor's it is coming from a dog. Kay approaches signaling Jay to keep quiet and grabs the dog. Frank who yelps like a dog. Passersby glare at Kay as if he is mistreating the dog and Jay tries to explain. Kay shakes Frank the Pug trying to get an answer then shakes him again before letting go. Jay lost in thought suddenly notices Frank barking at a cat down the sidewalk. In the morgue Laurel is at her desk when Rosenberg's cat jumps onto it startling her. She pets the cat and notices something on its collar a circular icon made of a strange beautiful metal with a light green translucent center. As Laurel peers into the jewel her face shows amazement as if she is transported to another universe with a blank look as she imagines sailing through a starfield at light speed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Meanwhile in the corridor a bell rings. Tony quickly snaps a fly swatter at a buzzing fly as Edgar winces flicking the swatter again to kill another fly making Edgar grit his teeth. Tony looks down at Edgar's hands on the counter as cockroaches stream out from his sleeve. The scene shifts back to the morgue where Laurel is slammed into a wall by Edgar who is furious. He grabs Laurel and drags her toward the equipment and as they approach Orion the cat bolts from under it leaping over cabinets and landing on a tall one. Edgar starts to turn when they hear the bell and a voice outside. Jay looks at Laurel amazed by his apparent influence over her. Though she seems irritated with him her tone does not match her words. Laurel rolls her eyes and looks down pointing toward her waist."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Jay hears a voice but it is not the Vendor's it is coming from a dog. Kay approaches signaling Jay to keep quiet and grabs the dog. Frank who yelps like a dog. Passersby glare at Kay as if he is mistreating the dog and Jay tries to explain. Kay shakes Frank the Pug trying to get an answer then shakes him again before letting go. Jay lost in thought suddenly notices Frank barking at a cat down the sidewalk. In the morgue Laurel is at her desk when Rosenberg's cat jumps onto it startling her. She pets the cat and notices something on its collar a circular icon made of a strange beautiful metal with a light green translucent center. As Laurel peers into the jewel her face shows amazement as if she is transported to another universe with a blank look as she imagines sailing through a starfield at light speed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Meanwhile in the corridor a bell rings. Tony quickly snaps a fly swatter at a buzzing fly as Edgar winces flicking the swatter again to kill another fly making Edgar grit his teeth. Tony looks down at Edgar's hands on the counter as cockroaches stream out from his sleeve. The scene shifts back to the morgue where Laurel is slammed into a wall by Edgar who is furious. He grabs Laurel and drags her toward the equipment and as they approach Orion the cat bolts from under it leaping over cabinets and landing on a tall one. Edgar starts to turn when they hear the bell and a voice outside. Jay looks at Laurel amazed by his apparent influence over her. Though she seems irritated with him her tone does not match her words. Laurel rolls her eyes and looks down pointing toward her waist."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Jay hears a voice but it is not the Vendor's it is coming from a dog. Kay approaches signaling Jay to keep quiet and grabs the dog. Frank who yelps like a dog. Passersby glare at Kay as if he is mistreating the dog and Jay tries to explain. Kay shakes Frank the Pug trying to get an answer then shakes him again before letting go. Edgar starts to turn when they hear the bell and a voice outside. Jay looks at Laurel amazed by his apparent influence over her. Though she seems irritated with him her tone does not match her words. Laurel rolls her eyes and looks down pointing toward her waist."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Jay hears a voice but it is not the Vendor's it is coming from a dog. Kay approaches signaling Jay to keep quiet and grabs the dog. Though she seems irritated with him her tone does not match her words. Laurel rolls her eyes and looks down pointing toward her waist."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Pat hears a melody, but it's not the Waiter's; it's coming from a cow. Max approaches, motioning Pat to stay silent, and lifts the cow, Daisy, who moos like a sheep. Bystanders scowl at Max as if he's irritating the cow, and Pat attempts to clarify. Max twirls Daisy the Calf, trying to get a response, then twirls her again before letting go. Pat, deep in daydreams, suddenly notices Daisy mooing at a lizard up the alley. In the workshop, Lucy is at her console when Gregory's lizard jumps onto it, surprising her. She strokes the lizard and notices something on its harness: a hexagonal symbol made of a peculiar, shiny plastic with a soft purple, transparent center. As Lucy gazes into the gem, her expression shows wonder, as if she's transported to another dimension, with a vacant look as she imagines flying through a nebula at warp speed. Meanwhile, in the tunnel, an alarm blares. Sam swiftly swings a broom at a fluttering butterfly as Alex grimaces, swishing the broom again to nab another butterfly, making Alex clench his jaw. Sam peers at Alex's shoes on the table as ants spill out from his pant leg. The scene shifts back to the workshop, where Lucy is hurled into a table by Alex, who is enraged. He grips Lucy and hauls her toward the machinery, and as they near it, Orion the lizard scurries from beneath, gliding over shelves and resting on a high one. Alex begins to pivot when they hear the alarm and a tune outside. Pat gazes at Lucy, astonished by her apparent sway over him. Though she seems annoyed with him, her expression doesn't match her gaze. Lucy sighs and glances down, gesturing toward her pocket."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jay hears a voice coming from a dog named Frank, not the Vendor. Kay signals Jay to be quiet and grabs Frank, shaking him for answers despite passersby glaring in suspicion. In the morgue, Laurel is startled by Rosenberg's cat and notices a mysterious metal and jewel on its collar. The jewel's beauty captivates her, making her imagine traveling through space. Meanwhile, Tony swats flies in the corridor, leading to cockroaches emerging from Edgar's sleeve. Back in the morgue, Edgar angrily slams Laurel into a wall and drags her towards the equipment, but Orion the cat escapes. A bell and voice outside distract Edgar, while Jay is amazed by his influence over Laurel, who seems annoyed despite her actions suggesting otherwise."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Laurel rolls her eyes and looks down pointing toward her waist Though she seems irritated with him her tone does not match her words Jay looks at Laurel amazed by his apparent influence over her Edgar starts to turn when they hear the bell and a voice outside He grabs Laurel and drags her toward the equipment and as they approach Orion the cat bolts from under it leaping over cabinets and landing on a tall one The scene shifts back to the morgue where Laurel is slammed into a wall by Edgar who is furious Tony looks down at Edgar's hands on the counter as cockroaches stream out from his sleeve Tony quickly snaps a fly swatter at a buzzing fly as Edgar winces flicking the swatter again to kill another fly making Edgar grit his teeth Meanwhile in the corridor a bell rings As Laurel peers into the jewel her face shows amazement as if she is transported to another universe with a blank look as she imagines sailing through a starfield at light speed She pets the cat and notices something on its collar a circular icon made of a strange beautiful metal with a light green translucent center In the morgue Laurel is at her desk when Rosenberg's cat jumps onto it startling her Jay lost in thought suddenly notices Frank barking at a cat down the sidewalk Kay shakes Frank the Pug trying to get an answer then shakes him again before letting go Passersby glare at Kay as if he is mistreating the dog and Jay tries to explain Frank who yelps like a dog Kay approaches signaling Jay to keep quiet and grabs the dog Jay hears a voice but it is not the Vendor's it is coming from a dog"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Kay approaches signaling Jay to keep quiet and grabs the dog Jay hears a voice but it is not the Vendor's it is coming from a dog Passersby glare at Kay as if he is mistreating the dog and Jay tries to explain Frank who yelps like a dog Jay lost in thought suddenly notices Frank barking at a cat down the sidewalk Kay shakes Frank the Pug trying to get an answer then shakes him again before letting go She pets the cat and notices something on its collar a circular icon made of a strange beautiful metal with a light green translucent center In the morgue Laurel is at her desk when Rosenberg's cat jumps onto it startling her Meanwhile in the corridor a bell rings As Laurel peers into the jewel her face shows amazement as if she is transported to another universe with a blank look as she imagines sailing through a starfield at light speed Tony looks down at Edgar's hands on the counter as cockroaches stream out from his sleeve Tony quickly snaps a fly swatter at a buzzing fly as Edgar winces flicking the swatter again to kill another fly making Edgar grit his teeth He grabs Laurel and drags her toward the equipment and as they approach Orion the cat bolts from under it leaping over cabinets and landing on a tall one The scene shifts back to the morgue where Laurel is slammed into a wall by Edgar who is furious Jay looks at Laurel amazed by his apparent influence over her Edgar starts to turn when they hear the bell and a voice outside Laurel rolls her eyes and looks down pointing toward her waist Though she seems irritated with him her tone does not match her words"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Meanwhile in the corridor a bell rings Tony quickly snaps a fly swatter at a buzzing fly as Edgar winces flicking the swatter again to kill another fly making Edgar grit his teeth Tony looks down at Edgar's hands on the counter as cockroaches stream out from his sleeve The scene shifts back to the morgue where Laurel is slammed into a wall by Edgar who is furious He grabs Laurel and drags her toward the equipment and as they approach Orion the cat bolts from under it leaping over cabinets and landing on a tall one Edgar starts to turn when they hear the bell and a voice outside Jay looks at Laurel amazed by his apparent influence over her Though she seems irritated with him her tone does not match her words Laurel rolls her eyes and looks down pointing toward her waist Jay hears a voice but it is not the Vendor's it is coming from a dog Kay approaches signaling Jay to keep quiet and grabs the dog Frank who yelps like a dog Passersby glare at Kay as if he is mistreating the dog and Jay tries to explain Kay shakes Frank the Pug trying to get an answer then shakes him again before letting go Jay lost in thought suddenly notices Frank barking at a cat down the sidewalk In the morgue Laurel is at her desk when Rosenberg's cat jumps onto it startling her She pets the cat and notices something on its collar a circular icon made of a strange beautiful metal with a light green translucent center As Laurel peers into the jewel her face shows amazement as if she is transported to another universe with a blank look as she imagines sailing through a starfield at light speed"
        }
      ]
    }
  ]
}