{
  "ground_truth": "Parrish blinks uncertainly, unsure if he has heard something, and releases his arm as his pain subsides. He soon realizes that he has indeed heard a voice—not the wind—and looks around, finding no one. Unable to finish peeing, he returns to his bedroom, bewildered, trying to trace the source of the sound. Climbing back into bed, he pulls the covers up and attempts to close his eyes, but then sits up again, frightened and indecisive. He finally closes his eyes again, glances at the ceiling, and falls asleep, exhausted. Outside, workmen on the great lawn plant stakes, unroll a canvas tent, and set up platforms, speakers, and lights, while gardeners fashion topiary and add landscaping. Allison, Parrish's older daughter, manages the foremen and relishes the attention. A painter approaches as Parrish, groomed for the day, trots downstairs, observing the intensified activity through the windows. He grins and pours coffee, fidgeting as Susan observes. The sound of a helicopter chopping overhead is heard, and Parrish, leading his family, hurries toward it as the butler and May carry their bags. Drew kisses a woman, glancing at Parrish over her shoulder, while Quince approaches. Drew ushers everyone onto the helicopter, starting with Parrish, then Susan and Quince, before climbing in himself and shutting the door as Allison hurries away. Meanwhile, the Young Man sits at a counter with a plate of food, eating with relish while Susan watches him, captivated. He notices her gaze, swallows awkwardly, and Susan laughs as the Young Man smiles, prompting Susan to look into her coffee. Drew follows Parrish until the open door, where Parrish reminds him that he cannot proceed further without an invitation. Parrish disappears into his office, and Drew glides past Jennifer's desk on his way out. He leans against the back of a couch, surveying the Manhattan skyline through floor-to-ceiling windows, lost in thought.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Parrish blinks hesitantly, uncertain if he has perceived something, and frees his arm as his agony subsides. He soon comprehends that he has indeed detected a voice—not the breeze—and glances around, finding no one. Unable to finish urinating, he retreats to his chamber, perplexed, trying to trace the origin of the noise. Climbing back into bed, he pulls the blankets up and endeavors to close his eyes, but then sits up again, scared and indecisive. He finally closes his eyes again, gazes at the ceiling, and falls asleep, fatigued. Outside, laborers on the vast lawn plant stakes, unroll a canvas canopy, and set up platforms, speakers, and lights, while landscapers fashion topiary and add landscaping. Allison, Parrish's elder daughter, manages the overseers and savors the notice. An artist approaches as Parrish, groomed for the day, trots downstairs, observing the heightened activity through the windows. He beams and pours coffee, fidgeting as Susan observes. The sound of a helicopter chopping overhead is heard, and Parrish, leading his family, rushes toward it as the butler and May carry their cases. Drew kisses a woman, glancing at Parrish over her shoulder, while Quince approaches. Drew ushers everyone onto the helicopter, starting with Parrish, then Susan and Quince, before climbing in himself and closing the door as Allison hurries away. Meanwhile, the Young Man sits at a counter with a dish of food, eating with relish while Susan watches him, captivated. He notices her stare, swallows awkwardly, and Susan laughs as the Young Man smiles, prompting Susan to look into her coffee. Drew follows Parrish until the open door, where Parrish reminds him that he cannot proceed further without an invitation. Parrish disappears into his study, and Drew glides past Jennifer's desk on his way out. He leans against the back of a couch, surveying the Manhattan skyline through floor-to-ceiling windows, lost in contemplation."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Uncertainly, Parrish is blinked at by himself, unsure if something has been heard, and his arm is released as the subsiding of his pain is felt. He soon realizes that a voice has indeed been heard by him—not the wind—and around is looked by him, finding no one. Unable to finish peeing, his return to the bedroom is made by him, bewildered, trying to trace the source of the sound. Back into bed, he is climbed by himself, and the covers are pulled up by him as attempts to close his eyes are made, but he is then sat up again, frightened and indecisive. His eyes are finally closed again by him, the ceiling is glanced at, and exhaustion causes sleep to be fallen into by him. Outside, stakes are planted by workmen on the great lawn, a canvas tent is unrolled, and platforms, speakers, and lights are set up, while topiary is fashioned, and landscaping is added by gardeners. The foremen are managed by Allison, Parrish's older daughter, and the attention is relished by her. As Parrish is groomed for the day and trots downstairs, a painter approaches, and the intensified activity is observed by him through the windows. A grin is given by him, and coffee is poured, while his fidgeting is observed by Susan. The chopping of a helicopter is heard overhead, and his family is led by Parrish as he hurries toward it, while the butler and May carry their bags. A woman is kissed by Drew, and over her shoulder, Parrish is glanced at by him, while Quince's approach is made. Everyone is ushered onto the helicopter by Drew, starting with Parrish, then Susan and Quince, before climbing in himself and shutting the door as Allison hurries away. Meanwhile, the Young Man sits at a counter with a plate of food, eating with relish as Susan watches him, captivated. Her gaze is noticed by him, and an awkward swallow is made by him, and a laugh is given by Susan as the Young Man smiles, prompting the coffee to be looked into by Susan. Parrish is followed by Drew until the open door, where a reminder is given by Parrish that further proceeding cannot be done without an invitation. Parrish disappears into his office, and Jennifer's desk is glided past by Drew on his way out. He leans against the back of a couch, the Manhattan skyline is surveyed through floor-to-ceiling windows by him, lost in thought."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Parrish hesitates, unsure if he heard a voice as his pain eases, and finds no one around. Unable to finish peeing, he returns to his bed, puzzled by the sound. Climbing back under the covers, he tries to sleep, but sits up, indecisive. Finally, he falls asleep, glancing at the ceiling. Outside, workmen on the lawn set up for an event while gardeners prepare the landscape. Allison, Parrish's older daughter, manages the activity, enjoying the attention. A painter arrives as Parrish, ready for the day, observes through windows, grinning and pouring coffee. He fidgets under Susan's gaze as a helicopter approaches. Parrish leads his family toward it, with the butler and May carrying bags. Drew kisses a woman, glances at Parrish, and ushers everyone onto the helicopter, starting with Parrish. Susan and Quince follow, and Drew boards last, shutting the door as Allison leaves. Meanwhile, the Young Man eats at a counter, catching Susan's eye, making her laugh when he smiles. Drew follows Parrish to an open door, reminded he needs an invitation to proceed. Parrish goes to his office, and Drew passes Jennifer's desk, leaning against a couch and gazing thoughtfully at the Manhattan skyline through large windows."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Parrish blinks, unsure if he heard something, releases his arm as pain subsides, and realizes he indeed heard a voice. Unable to finish peeing, he returns to bed, bewildered by the sound, then falls asleep exhausted. Outside, workmen set up for an event while Allison manages them. A painter arrives as Parrish, ready for the day, observes the activity, grins, and pours coffee. A helicopter chops overhead, and Parrish, with his family and bags carried by May and a butler, hurries to it. Drew kisses a woman, glances at Parrish, ushers everyone onto the helicopter, and shuts the door as Allison hurries away. Meanwhile, the Young Man eats at a counter, captivates Susan, and smiles, prompting her laughter. Drew follows Parrish to an office, reminded he can't enter without an invitation. Parrish disappears into his office, and Drew exits past Jennifer's desk, then leans against a couch, lost in thought, overlooking the Manhattan skyline."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Parrish blinks with uncertainty, feeling unsure whether he has indeed heard a sound, and releases his grip on his arm as the intense pain gradually subsides. He soon comes to the realization that what he heard was indeed a voice—it was not merely the whispering wind—and he looks around the room with curiosity, only to find himself alone. Unable to complete the task of relieving himself, he retraces his steps back to his bedroom, feeling bewildered as he tries to pinpoint the origin of the mysterious sound. Once back in bed, he pulls the soft covers up around himself and makes an effort to close his eyes and relax, but quickly finds himself sitting up again, feeling frightened and indecisive about what to do next. Eventually, he finally manages to close his eyes again, casting a brief glance up at the ceiling before falling into an exhausted sleep. Meanwhile, outside on the expansive great lawn, workmen are busy planting stakes, unfurling a large canvas tent, and setting up various platforms, speakers, and lights. At the same time, gardeners are creatively shaping topiary and enhancing the landscape. Allison, who is Parrish's older daughter, oversees the work with keen attention and enjoys the spotlight. A painter approaches just as Parrish, now groomed and ready for the day, makes his way downstairs, taking in the flurry of increased activity through the windows. He grins, reaching for the coffee pot to pour himself a cup, and starts to fidget as Susan watches him closely. The distinct sound of a helicopter chopping through the air is heard, prompting Parrish to lead his family hastily toward it, accompanied by the butler and May carrying their bags. Drew shares a kiss with a woman, shooting a glance at Parrish over her shoulder, as Quince makes his approach. Drew shepherds everyone onto the helicopter, beginning with Parrish, followed by Susan and Quince, and then climbs aboard himself, shutting the door swiftly as Allison hurries away. Meanwhile, the Young Man sits at a counter with a plate full of food, eating with visible relish while Susan watches him, clearly captivated. He becomes aware of her gaze, swallows awkwardly, and Susan bursts into laughter as the Young Man smiles, prompting her to look down into her coffee cup. Drew trails behind Parrish all the way to the open door, where Parrish reminds him that he cannot go any further without receiving an official invitation. Parrish then disappears into his office, while Drew glides smoothly past Jennifer's desk on his way out. He pauses to lean against the back of a couch, contemplating as he surveys the breathtaking Manhattan skyline through the large floor-to-ceiling windows, lost in thought."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Parrish, feeling a sense of uncertainty, blinks repeatedly as he tries to discern whether he has actually heard a sound. This uncertainty lingers in his mind as he slowly releases his grip on his arm, where the intense, searing pain gradually begins to subside. Soon, he comes to the realization that what he thought he heard was, in fact, a voice—the sound was not simply the wind whispering through the air. With curiosity piqued, he looks around the room, only to discover that he is entirely alone. Unable to complete the task he originally set out to do, he retraces his steps back to his bedroom, feeling utterly bewildered as he struggles to pinpoint the origin of the mysterious sound. Once he is back in bed, he pulls the soft, comforting covers up around himself and makes an earnest effort to close his eyes and calm his racing thoughts. However, despite his attempts to relax, he quickly finds himself sitting up again, feeling frightened and uncertain about what action to take next. Eventually, he manages to close his eyes once more, casting a brief but meaningful glance up at the ceiling before allowing himself to fall into an exhausted sleep.\n\nMeanwhile, outside on the expansive great lawn, workmen are energetically planting stakes into the ground, unfurling a large canvas tent, and diligently setting up various platforms, speakers, and lights. At the same time, gardeners are creatively shaping topiary and enhancing the landscape with their skilled hands. Allison, Parrish's older daughter, oversees all the ongoing work with keen attention to detail and radiates a sense of confidence as she enjoys being in the spotlight. As a painter approaches the scene, Parrish, now freshly groomed and ready to face the day, descends the stairs, taking in the flurry of increased activity through the windows with interest. A wide grin spreads across his face as he reaches for the coffee pot, preparing to pour himself a steaming cup, and he starts to fidget slightly as Susan watches him intently from a distance. The distinct, unmistakable sound of a helicopter chopping through the air reaches their ears, prompting Parrish to lead his family hastily toward it, accompanied by the butler and May, who carry their bags.\n\nDrew shares a fleeting kiss with a woman, casting a quick glance at Parrish over her shoulder, as Quince approaches the scene. Drew then shepherds everyone onto the waiting helicopter, beginning with Parrish, followed closely by Susan and Quince, before climbing aboard himself and swiftly shutting the door as Allison hurries away. Meanwhile, the Young Man sits at a counter with a plate full of delicious food, eating with visible relish while Susan watches him, clearly captivated by his presence. He becomes aware of her gaze, swallows awkwardly, and Susan bursts into laughter as the Young Man smiles warmly, prompting her to look down into her coffee cup with a sense of amusement.\n\nDrew trails behind Parrish, shadowing him all the way to the open door, where Parrish reminds him that he cannot proceed any further without receiving an official invitation. With that, Parrish disappears into his office, while Drew glides smoothly past Jennifer's desk on his way out. He pauses momentarily to lean against the back of a couch, contemplating deeply as he surveys the breathtaking, expansive Manhattan skyline through the large floor-to-ceiling windows, lost in thought and reflection."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Parrish blinks several times with uncertainty, attempting to discern whether he has heard a sound, and slowly releases his grip on his arm as he notices the pain diminishing. He gradually comprehends that the sound he heard was indeed a voice, distinctly not the wind, prompting him to look around intently, only to find no one present. Frustrated by his inability to finish peeing, he makes his way back to his bedroom, consumed by bewilderment as his mind tries to trace the mysterious source of the sound. Once in his bedroom, he carefully climbs back into his bed, pulling the covers up to his chin and initially tries to close his eyes, but his fear and indecision cause him to sit up again abruptly. He finally manages to close his eyes once more, glancing briefly at the ceiling before exhaustion overtakes him, and he falls asleep. Outside, the scene is bustling with activity as workmen efficiently plant stakes into the great lawn, methodically unroll a large canvas tent, and skillfully set up platforms, speakers, and lights. Meanwhile, gardeners meticulously shape topiary and enhance the landscaping. Allison, Parrish's older daughter, diligently oversees and manages the foremen, enjoying the attention her role commands. As a painter approaches, Parrish, who is now groomed and ready for the day, trots downstairs, keenly observing the intensified activity unfolding through the windows. He grins widely as he pours himself a cup of coffee, unable to keep still under Susan's watchful gaze as she observes him. The distinct sound of a helicopter chopping overhead cuts through the air, prompting Parrish to take charge, swiftly leading his family toward the helicopter while the butler and May dutifully carry their bags. Drew shares a quick, affectionate kiss with a woman, casting a glance back at Parrish over the woman's shoulder, while Quince makes his approach. Taking charge, Drew ushers everyone onto the helicopter, ensuring Parrish boards first, followed by Susan and Quince, before he climbs in himself and securely shuts the door, all while Allison rushes away to continue her duties. In a different scene, the Young Man sits comfortably at a counter with a plate of food, eating with evident enjoyment as Susan watches him with captivation. Her gaze catches his attention, causing him to swallow awkwardly, which makes Susan laugh, and her laughter draws a smile from the Young Man, prompting Susan to shift her focus back to her coffee. Meanwhile, Drew follows Parrish up to the threshold of an open door, facing a reminder from Parrish that he cannot proceed further without an explicit invitation. Parrish exits into his office, leaving Drew to glide past Jennifer's desk on his way out. Drew then leans casually against the back of a couch, his eyes drawn to the breathtaking view of the Manhattan skyline through the floor-to-ceiling windows, where he stands, lost in deep thought."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Parrish, unsure if he heard something, releases his arm as his pain subsides and soon realizes he has indeed heard a voice. Finding no one around, he returns to his bedroom, bewildered, trying to trace the sound's source. After an uneasy attempt to sleep, he finally closes his eyes, glances at the ceiling, and falls asleep. Outside, workmen and gardeners prepare the great lawn for an event under Allison's supervision, while a painter arrives. Observing the commotion, Parrish, ready for the day, grins as he pours coffee, with Susan watching him fidget. With the sound of a helicopter overhead, Parrish leads his family toward it, as the butler and May carry their bags. Drew kisses a woman, exchanging a glance with Parrish before ushering everyone onto the helicopter and closing the door as Allison departs. Meanwhile, the Young Man enjoys a meal under Susan's captivated watch; he notices her gaze, swallows awkwardly, and they share a moment of laughter before Susan looks into her coffee. Drew follows Parrish to an open door, where Parrish reminds him that he cannot proceed without an invitation. Parrish then enters his office, while Drew, lost in thought, surveys the Manhattan skyline through the windows after passing Jennifer's desk."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Parrish blinks uncertainly, unsure if he has heard something, and releases his arm as his pain subsides. He soon realizes that he has indeed heard a voice—not the wind, which often howls through the old mansion's corridors—and looks around, finding no one. Unable to finish peeing, he returns to his bedroom, bewildered, trying to trace the source of the sound. Climbing back into bed, he pulls the covers up and attempts to close his eyes, but then sits up again, frightened and indecisive. He finally closes his eyes again, glances at the ceiling, where an ornate chandelier hangs, and falls asleep, exhausted. Outside, workmen on the great lawn, which spans several acres and is known for hosting extravagant events, plant stakes, unroll a canvas tent, and set up platforms, speakers, and lights, while gardeners fashion topiary in the shape of fantastic beasts and add landscaping. Allison, Parrish's older daughter, known for her keen organizational skills, manages the foremen and relishes the attention. A painter, hoping to capture the day's vibrant scene on canvas, approaches as Parrish, groomed for the day in his tailored suit, trots downstairs, observing the intensified activity through the windows. He grins and pours coffee from a freshly brewed pot, fidgeting as Susan observes, her gaze lingering on the bustling preparations outside. The sound of a helicopter chopping overhead is heard, signaling the arrival of an expected guest, and Parrish, leading his family with the precision of a seasoned host, hurries toward it as the butler and May, the family's trusted housekeeper, carry their bags. Drew kisses a woman, whose identity remains a mystery to others, glancing at Parrish over her shoulder, while Quince, known for his quick wit and sharp observations, approaches. Drew ushers everyone onto the helicopter, starting with Parrish, then Susan and Quince, before climbing in himself and shutting the door as Allison hurries away to manage last-minute details. Meanwhile, the Young Man, an enigmatic figure whose presence has piqued everyone's curiosity, sits at a counter with a plate of food, eating with relish while Susan watches him, captivated by his youthful charm. He notices her gaze, swallows awkwardly, and Susan laughs as the Young Man smiles, prompting Susan to look into her coffee, a moment of light-hearted distraction amid the day's tension. Drew follows Parrish until the open door, where Parrish reminds him that he cannot proceed further without an invitation to the exclusive meeting. Parrish disappears into his office, filled with antique furniture and shelves lined with leather-bound books, and Drew glides past Jennifer's desk on his way out. He leans against the back of a couch, upholstered in fine leather, surveying the Manhattan skyline through floor-to-ceiling windows, lost in thought as he contemplates the day's unfolding events."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He notices her gaze swallows awkwardly and Susan laughs as the Young Man smiles prompting Susan to look into her coffee Parrish blinks uncertainly unsure if he has heard something and releases his arm as his pain subsides Unable to finish peeing he returns to his bedroom bewildered trying to trace the source of the sound He leans against the back of a couch surveying the Manhattan skyline through floortoceiling windows lost in thought He soon realizes that he has indeed heard a voice—not the wind—and looks around finding no one Climbing back into bed he pulls the covers up and attempts to close his eyes but then sits up again frightened and indecisive Drew ushers everyone onto the helicopter starting with Parrish He soon realizes that he has indeed heard a voice—not the wind—and looks around finding no one Unable to finish peeing he returns to his bedroom bewildered trying to trace the source of the sound Climbing back into bed he pulls the covers up and attempts to close his eyes but then sits up again frightened and indecisive He finally closes his eyes again glances at the ceiling and falls asleep exhausted Outside workmen on the great lawn plant stakes unroll a canvas tent and set up platforms speakers and lights while gardeners fashion topiary and add landscaping Allison Parrish's older daughter manages the foremen and relishes the attention A painter approaches as Parrish groomed for the day trots downstairs observing the intensified activity through the windows He grins and pours coffee fidgeting as Susan observes The sound of a helicopter chopping overhead is heard and Parrish leading his family hurries toward it as the butler and May carry their bags Drew follows Parrish until the open door where Parrish reminds him that he cannot proceed further without an invitation Drew kisses a woman glancing at Parrish over her shoulder while Quince approaches Drew ushers everyone onto the helicopter starting with Parrish He grins and pours coffee fidgeting as Susan observes then Susan and Quince before climbing in himself and shutting the door as Allison hurries away Meanwhile the Young Man sits at a counter with a plate of food eating with relish while Susan watches him captivated He notices her gaze swallows awkwardly and Susan laughs as the Young Man smiles prompting Susan to look into her coffee Drew follows Parrish until the open door where Parrish reminds him that he cannot proceed further without an invitation Parrish disappears into his office and Drew glides past Jennifer's desk on his way out Parrish blinks uncertainly unsure if he has heard something and releases his arm as his pain subsides He leans against the back of a couch surveying the Manhattan skyline through floortoceiling windows lost in thought"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Parrish blinks uncertainly unsure if he has heard something and releases his arm as his pain subsides. He soon realizes that he has indeed heard a voice—not the wind—and looks around finding no one. Unable to finish peeing he returns to his bedroom bewildered trying to trace the source of the sound. Climbing back into bed he pulls the covers up and attempts to close his eyes but then sits up again frightened and indecisive. He finally closes his eyes again glances at the ceiling and falls asleep exhausted. Outside workmen on the great lawn plant stakes unroll a canvas tent and set up platforms speakers and lights while gardeners fashion topiary and add landscaping. Allison Parrish's older daughter manages the foremen and relishes the attention. A painter approaches as Parrish groomed for the day trots downstairs observing the intensified activity through the windows. He grins and pours coffee fidgeting as Susan observes. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. The sound of a helicopter chopping overhead is heard and Parrish leading his family hurries toward it as the butler and May carry their bags. Drew kisses a woman glancing at Parrish over her shoulder while Quince approaches. Drew ushers everyone onto the helicopter starting with Parrish. then Susan and Quince before climbing in himself and shutting the door as Allison hurries away. Meanwhile the Young Man sits at a counter with a plate of food eating with relish while Susan watches him captivated. He notices her gaze swallows awkwardly and Susan laughs as the Young Man smiles prompting Susan to look into her coffee. Drew follows Parrish until the open door where Parrish reminds him that he cannot proceed further without an invitation. Parrish disappears into his office and Drew glides past Jennifer's desk on his way out. He leans against the back of a couch surveying the Manhattan skyline through floortoceiling windows lost in thought."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Parrish blinks uncertainly unsure if he has heard something and releases his arm as his pain subsides. He soon realizes that he has indeed heard a voice—not the wind—and looks around finding no one. Unable to finish peeing he returns to his bedroom bewildered trying to trace the source of the sound. Climbing back into bed he pulls the covers up and attempts to close his eyes but then sits up again frightened and indecisive. He finally closes his eyes again glances at the ceiling and falls asleep exhausted. Outside workmen on the great lawn plant stakes unroll a canvas tent and set up platforms speakers and lights while gardeners fashion topiary and add landscaping. Allison Parrish's older daughter manages the foremen and relishes the attention. A painter approaches as Parrish groomed for the day trots downstairs observing the intensified activity through the windows. He grins and pours coffee fidgeting as Susan observes. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. The sound of a helicopter chopping overhead is heard and Parrish leading his family hurries toward it as the butler and May carry their bags. Drew kisses a woman glancing at Parrish over her shoulder while Quince approaches. Drew ushers everyone onto the helicopter starting with Parrish. then Susan and Quince before climbing in himself and shutting the door as Allison hurries away. Meanwhile the Young Man sits at a counter with a plate of food eating with relish while Susan watches him captivated. He notices her gaze swallows awkwardly and Susan laughs as the Young Man smiles prompting Susan to look into her coffee. Drew follows Parrish until the open door where Parrish reminds him that he cannot proceed further without an invitation. Parrish disappears into his office and Drew glides past Jennifer's desk on his way out. He leans against the back of a couch surveying the Manhattan skyline through floortoceiling windows lost in thought."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Parrish blinks uncertainly unsure if he has heard something and releases his arm as his pain subsides. He soon realizes that he has indeed heard a voice—not the wind—and looks around finding no one. Unable to finish peeing he returns to his bedroom bewildered trying to trace the source of the sound. Climbing back into bed he pulls the covers up and attempts to close his eyes but then sits up again frightened and indecisive. He finally closes his eyes again glances at the ceiling and falls asleep exhausted. He notices her gaze swallows awkwardly and Susan laughs as the Young Man smiles prompting Susan to look into her coffee. Drew follows Parrish until the open door where Parrish reminds him that he cannot proceed further without an invitation. Parrish disappears into his office and Drew glides past Jennifer's desk on his way out. He leans against the back of a couch surveying the Manhattan skyline through floortoceiling windows lost in thought."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Parrish blinks uncertainly unsure if he has heard something and releases his arm as his pain subsides. He soon realizes that he has indeed heard a voice—not the wind—and looks around finding no one. Parrish disappears into his office and Drew glides past Jennifer's desk on his way out. He leans against the back of a couch surveying the Manhattan skyline through floortoceiling windows lost in thought."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Parrish blinks uncertainly, unsure if he has heard something, and releases his arm as his pain subsides. He soon realizes that he has indeed heard a voice—not the wind—and looks around, finding no one. Unable to finish peeing, the cat returns to his bedroom, bewildered, trying to trace the source of the sound. Climbing back into bed, the squirrel pulls the covers up and attempts to close his eyes, but then sits up again, frightened and indecisive. The dog finally closes his eyes again, glances at the ceiling, and falls asleep, exhausted. Outside, robots on the great lawn plant stakes, unroll a canvas tent, and set up platforms, speakers, and lights, while dolphins fashion topiary and add landscaping. Allison, the tree's older daughter, manages the foremen and relishes the attention. A kangaroo approaches as the lamp, groomed for the day, trots downstairs, observing the intensified activity through the windows. The rabbit grins and pours coffee, fidgeting as Susan observes. The sound of a helicopter chopping overhead is heard, and the book, leading his family, hurries toward it as the butler and May carry their bags. Drew kisses a horse, glancing at the toaster over her shoulder, while the clock approaches. Drew ushers everyone onto the helicopter, starting with the mirror, then Susan and Quince, before climbing in himself and shutting the door as Allison hurries away. Meanwhile, the bicycle sits at a counter with a plate of food, eating with relish while Susan watches him, captivated. The refrigerator notices her gaze, swallows awkwardly, and Susan laughs as the chair smiles, prompting Susan to look into her coffee. The pencil follows the table until the open door, where the light reminds him that he cannot proceed further without an invitation. The spoon disappears into his office, and the cloud glides past Jennifer's desk on his way out. He leans against the back of a couch, surveying the Manhattan skyline through floor-to-ceiling windows, lost in thought."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Parrish blinks uncertainly, unsure if he has heard something, and releases his arm as his pain subsides. He soon realizes that he has indeed heard a voice—not the rain—and looks around, finding no one. Unable to finish brushing his teeth, he returns to his living room, bewildered, trying to trace the source of the sound. Climbing back into the recliner, he pulls the throw blanket up and attempts to close his eyes, but then sits up again, frightened and indecisive. He finally closes his eyes again, glances at the lamp, and falls asleep, exhausted. Outside, workmen on the small patio plant lanterns, unroll an awning, and set up benches, microphones, and lanterns, while gardeners arrange pebbles and add sculptures. Allison, Parrish's older daughter, manages the electricians and relishes the attention. A sculptor approaches as Parrish, groomed for the day, trots downstairs, observing the intensified activity through the windows. He grins and pours tea, fidgeting as Susan observes. The sound of a balloon floating overhead is heard, and Parrish, leading his family, hurries toward it as the butler and May carry their baskets. Drew kisses a woman, glancing at Parrish over her shoulder, while Quince approaches. Drew ushers everyone onto the balloon, starting with Parrish, then Susan and Quince, before climbing in himself and shutting the flap as Allison hurries away. Meanwhile, the Young Man sits at a bar with a bowl of fruit, eating with relish while Susan watches him, captivated. He notices her gaze, swallows awkwardly, and Susan laughs as the Young Man smiles, prompting Susan to look into her tea. Drew follows Parrish until the open archway, where Parrish reminds him that he cannot proceed further without an invitation. Parrish disappears into his study, and Drew glides past Jennifer's chair on his way out. He leans against the back of a bookshelf, surveying the Chicago skyline through floor-to-ceiling windows, lost in thought."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Parrish squints uncertainly, unsure if he has touched something, and shakes his arm as his pain diminishes. He soon realizes that he has indeed felt a breeze—not a gust—and peers around, finding no one. Unable to finish stretching, he returns to his bedroom, puzzled, trying to trace the source of the sound. Rolling back into bed, he tosses the covers aside and attempts to open his eyes, but then lies down again, startled and hesitant. He finally opens his eyes again, peers at the ceiling, and wakes up, refreshed. Outside, workmen on the great lawn pull weeds, roll up a canvas tent, and dismantle platforms, speakers, and lights, while gardeners dismantle topiary and remove landscaping. Allison, Parrish's older daughter, distracts the foremen and basks in the attention. A painter retreats as Parrish, dressed for the day, jumps downstairs, ignoring the intensified activity through the windows. He frowns and spills coffee, trembling as Susan monitors. The sound of a helicopter hovering overhead is heard, and Parrish, distancing his family, pauses near it as the butler and May drag their bags. Drew embraces a woman, frowning at Parrish over her shoulder, while Quince withdraws. Drew pulls everyone from the helicopter, starting with Parrish, then Susan and Quince, before climbing out himself and swinging the door open as Allison strolls away. Meanwhile, the Young Man stands at a counter with a plate of food, ignoring it while Susan watches him, disinterested. He notices her gaze, nods awkwardly, and Susan cries as the Young Man frowns, prompting Susan to peer into her coffee. Drew chases Parrish until the closed door, where Parrish reminds him that he cannot advance further without an invitation. Parrish emerges into his office, and Drew flies past Jennifer's desk on his way in. He sits on the back of a couch, ignoring the Manhattan skyline through floor-to-ceiling windows, lost in conversation."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Plum twitches uncertainly, unsure if it has heard something, and releases its branch as its tension subsides. It soon realizes that it has indeed heard a whistle—not the breeze—and looks around, finding no one. Unable to finish singing, it returns to its cupboard, bewildered, trying to trace the source of the noise. Climbing back into its drawer, it pulls the curtains up and attempts to close its eyes, but then sits up again, frightened and indecisive. It finally closes its eyes again, glances at the lamp, and falls asleep, exhausted. Outside, acrobats on the vast stage plant banners, unroll a velvet carpet, and set up statues, projectors, and speakers, while bakers fashion pastries and add displays. Catherine, Plum's older sibling, manages the acrobats and relishes the attention. A sculptor approaches as Plum, polished for the day, skips downstairs, observing the intensified activity through the mirrors. It grins and pours juice, fidgeting as Emily observes. The sound of a dragon roaring overhead is heard, and Plum, leading its band, hurries toward it as the gardener and Mia carry their instruments. Alex kisses a swan, glancing at Plum over its wing, while Leo approaches. Alex ushers everyone onto the dragon, starting with Plum, then Emily and Leo, before climbing in itself and shutting the door as Catherine hurries away. Meanwhile, the Old Woman sits at a crate with a book of poems, reading with interest while Emily watches her, captivated. She notices the gaze, closes her book awkwardly, and Emily laughs as the Old Woman smiles, prompting Emily to look into her juice. Alex follows Plum until the open gate, where Plum reminds it that it cannot proceed further without an invitation. Plum disappears into its attic, and Alex glides past Rachel's chair on its way out. It leans against the back of a fence, surveying the Paris skyline through floor-to-ceiling mirrors, lost in thought."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Clara squints hesitantly, unsure if she has smelled something, and releases her grip as her discomfort eases. She soon realizes that she has indeed noticed an aroma—not the rain—and glances around, finding nothing. Unable to continue reading, she returns to her kitchen, perplexed, trying to identify the source of the scent. Climbing back onto her chair, she pulls the blanket up and attempts to open her book, but then stands up again, alarmed and hesitant. She finally opens her book again, glances at the walls, and starts reading, absorbed. Outside, performers on the large patio string lights, unroll a red carpet, and set up cameras, microphones, and decorations, while artists create murals and add sculptures. Ben, Clara's younger son, guides the technicians and enjoys the spotlight. A photographer arrives as Clara, dressed for the occasion, skips downstairs, observing the heightened preparations through the windows. She beams and stirs tea, pacing as Nancy observes. The sound of fireworks bursting overhead is heard, and Clara, leading her friends, rushes toward it as the chef and Lisa carry their supplies. Bill hugs a man, glancing at Clara over his shoulder, while Mike approaches. Bill guides the group onto the stage, starting with Clara, then Nancy and Mike, before stepping up himself and drawing the curtain as Ben walks away. Meanwhile, the Old Woman sits at a table with a book, reading with focus while Nancy watches her, intrigued. She senses her attention, nods awkwardly, and Nancy chuckles as the Old Woman grins, prompting Nancy to sip her tea. Bill follows Clara until the closed window, where Clara reminds him that he cannot enter further without permission. Clara vanishes into her library, and Bill glides past Tom's door on his way in. He leans against the side of a chair, gazing at the Paris skyline through the wide-open windows, deep in thought."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Parrish squints uncertainly, unsure if he has smelled something, and drops his hat as his discomfort dissipates. He soon realizes that he has indeed smelled a fragrance—not the sea—and gazes around, finding nothing. Unable to finish humming, he returns to his kitchen, bewildered, trying to trace the source of the aroma. Crawling back onto the couch, he pulls the cushions up and attempts to open his eyes, but then lies down again, nervous and hesitant. He finally opens his eyes again, stares at the painting, and falls awake, alert. Outside, workmen on the vast balcony erect poles, roll up a silk banner, and disassemble tables, chairs, and lanterns, while gardeners dismantle hedges and remove plants. Allison, Parrish's older daughter, instructs the foremen and savors the chaos. A musician approaches as Parrish, combed for the night, skips upstairs, ignoring the decreasing activity through the windows. He frowns and grabs juice, pacing as Susan listens. The sound of a motorcycle rumbling nearby is heard, and Parrish, trailing his family, strolls away from it as the cook and May drag their luggage. Drew embraces a woman, peering at Parrish from around her arm, while Quince departs. Drew guides everyone off the motorcycle, ending with Parrish, then Susan and Quince, before jumping off himself and opening the gate as Allison walks toward. Meanwhile, the Young Man stands at a bench with a bowl of soup, sipping with gusto while Susan listens to him, intrigued. He senses her presence, gulps loudly, and Susan giggles as the Young Man grins, prompting Susan to glance into her tea. Drew follows Parrish until the closed door, where Parrish warns him that he cannot advance further without a password. Parrish reappears from his garage, and Drew drifts past Jennifer's chair on his way in. He leans against the front of a table, inspecting the Manhattan skyline through tiny windows, deep in contemplation."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Gizmo twitches hesitantly, uncertain if he has smelled something, and drops his pen as his curiosity wanes. He soon realizes that he has indeed smelled a scent—not the flowers—and glances around, spotting nothing. Unable to finish reading, he heads back to his den, perplexed, trying to identify the origin of the aroma. Clambering back onto the chair, he adjusts the pillows and tries to open his mouth, but then stands up again, startled and indecisive. He finally opens his mouth again, peeks at the wallpaper, and drifts into a nap, weary. Nearby, sailors on the sandy shore erect signs, fold a woolen blanket, and assemble chairs, tents, and lanterns, while sculptors craft statues and enhance the scenery. Terry, Gizmo's younger uncle, guides the captains and enjoys the admiration. A chef approaches as Gizmo, dressed for the party, skips upstairs, noticing the increased commotion through the doorways. He chuckles and sips juice, squirming as Lisa watches. The noise of a blimp soaring overhead is heard, and Gizmo, ushering his team, rushes toward it as the maid and Leo haul their baskets. Max embraces a man, peering at Gizmo over his chin, while Finn saunters over. Max escorts everyone onto the blimp, beginning with Gizmo, then Lisa and Finn, before climbing in himself and latching the window as Terry scampers off. In the meantime, the Elder Squirrel lounges at a bar with a bowl of soup, sipping with delight while Lisa observes him, intrigued. He catches her stare, gulps awkwardly, and Lisa giggles as the Elder Squirrel beams, causing Lisa to glance into her tea. Max follows Gizmo until the closed gate, where Gizmo reminds him that he cannot advance further without a password. Gizmo vanishes into his workshop, and Max strolls past Claire's nook on his way in. He perches against the side of a table, admiring the Paris skyline through open shutters, lost in reverie."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Parrish, uncertain and bewildered by a mysterious voice, returns to bed but struggles with fear and exhaustion before sleeping. Outside, workmen prepare for an event as Allison, Parrish's daughter, organizes. The next morning, as Parrish observes the activity, he and his family rush to a helicopter, assisted by the butler and May. Drew, after a brief interaction with Parrish, guides everyone into the helicopter before its departure. Meanwhile, a captivated Susan watches a Young Man eat at a counter, sharing a smile with him. Drew follows Parrish to his office door, where Parrish reminds him he needs an invitation to continue. Drew then pauses to contemplate the Manhattan skyline."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He leans against the back of a couch surveying the Manhattan skyline through floortoceiling windows lost in thought Parrish disappears into his office and Drew glides past Jennifer's desk on his way out Drew follows Parrish until the open door where Parrish reminds him that he cannot proceed further without an invitation He notices her gaze swallows awkwardly and Susan laughs as the Young Man smiles prompting Susan to look into her coffee Meanwhile the Young Man sits at a counter with a plate of food eating with relish while Susan watches him captivated then Susan and Quince before climbing in himself and shutting the door as Allison hurries away Drew ushers everyone onto the helicopter starting with Parrish Drew kisses a woman glancing at Parrish over her shoulder while Quince approaches The sound of a helicopter chopping overhead is heard and Parrish leading his family hurries toward it as the butler and May carry their bags He grins and pours coffee fidgeting as Susan observes A painter approaches as Parrish groomed for the day trots downstairs observing the intensified activity through the windows Allison Parrish's older daughter manages the foremen and relishes the attention Outside workmen on the great lawn plant stakes unroll a canvas tent and set up platforms speakers and lights while gardeners fashion topiary and add landscaping He finally closes his eyes again glances at the ceiling and falls asleep exhausted Climbing back into bed he pulls the covers up and attempts to close his eyes but then sits up again frightened and indecisive Unable to finish peeing he returns to his bedroom bewildered trying to trace the source of the sound He soon realizes that he has indeed heard a voice—not the wind—and looks around finding no one Parrish blinks uncertainly unsure if he has heard something and releases his arm as his pain subsides"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Meanwhile the Young Man sits at a counter with a plate of food eating with relish while Susan watches him captivated then Susan and Quince before climbing in himself and shutting the door as Allison hurries away He finally closes his eyes again glances at the ceiling and falls asleep exhausted The sound of a helicopter chopping overhead is heard and Parrish leading his family hurries toward it as the butler and May carry their bags Outside workmen on the great lawn plant stakes unroll a canvas tent and set up platforms speakers and lights while gardeners fashion topiary and add landscaping A painter approaches as Parrish groomed for the day trots downstairs observing the intensified activity through the windows Parrish disappears into his office and Drew glides past Jennifer's desk on his way out Allison Parrish's older daughter manages the foremen and relishes the attention Drew kisses a woman glancing at Parrish over her shoulder while Quince approaches Drew follows Parrish until the open door where Parrish reminds him that he cannot proceed further without an invitation He soon realizes that he has indeed heard a voice—not the wind—and looks around finding no one Drew ushers everyone onto the helicopter starting with Parrish Unable to finish peeing he returns to his bedroom bewildered trying to trace the source of the sound He notices her gaze swallows awkwardly and Susan laughs as the Young Man smiles prompting Susan to look into her coffee He leans against the back of a couch surveying the Manhattan skyline through floortoceiling windows lost in thought He grins and pours coffee fidgeting as Susan observes Parrish blinks uncertainly unsure if he has heard something and releases his arm as his pain subsides Climbing back into bed he pulls the covers up and attempts to close his eyes but then sits up again frightened and indecisive"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The sound of a helicopter chopping overhead is heard and Parrish leading his family hurries toward it as the butler and May carry their bags Drew kisses a woman glancing at Parrish over her shoulder while Quince approaches Drew ushers everyone onto the helicopter starting with Parrish then Susan and Quince before climbing in himself and shutting the door as Allison hurries away Meanwhile the Young Man sits at a counter with a plate of food eating with relish while Susan watches him captivated He notices her gaze swallows awkwardly and Susan laughs as the Young Man smiles prompting Susan to look into her coffee Drew follows Parrish until the open door where Parrish reminds him that he cannot proceed further without an invitation Parrish disappears into his office and Drew glides past Jennifer's desk on his way out He leans against the back of a couch surveying the Manhattan skyline through floortoceiling windows lost in thought Parrish blinks uncertainly unsure if he has heard something and releases his arm as his pain subsides He soon realizes that he has indeed heard a voice—not the wind—and looks around finding no one Unable to finish peeing he returns to his bedroom bewildered trying to trace the source of the sound Climbing back into bed he pulls the covers up and attempts to close his eyes but then sits up again frightened and indecisive He finally closes his eyes again glances at the ceiling and falls asleep exhausted Outside workmen on the great lawn plant stakes unroll a canvas tent and set up platforms speakers and lights while gardeners fashion topiary and add landscaping Allison Parrish's older daughter manages the foremen and relishes the attention A painter approaches as Parrish groomed for the day trots downstairs observing the intensified activity through the windows He grins and pours coffee fidgeting as Susan observes"
        }
      ]
    }
  ]
}