{
  "ground_truth": "A flicker of a shadow appears from behind the corner of the obscured glass at the section of the room most distant from Parrish, indicating a shape is there. Parrish falls silent, the sound and tone of the voice rendering him mute. He takes a step backward and struggles to make sense of what he is hearing. After a moment, the figure, who is the source of the voice, steps forward, revealing himself to be the young man seen previously in the coffee shop, but with a change; he seems odd, off-center, not handsome but terrifyingly beautiful. A moment passes with Parrish beside himself as the young man steps closer to him, his face inches from Parrish's, daring him to identify him. Parrish turns away, but the young man reappears in front of him, spectacularly. Stunned and terrified by the realization, Parrish surveys the young man, who now seems bewildered by his own effect. A hopelessly confused Parrish does not respond for a moment, then a sound at the door causes him to look at Luisa and then at the young man, verifying the young man's presence has been acknowledged by Luisa. Luisa nods perfunctorily and exits, leaving Parrish frozen, dumbfounded, and frightened by the response. Hesitant, Parrish then obediently leads the young man out of the library, down a long hallway, and across the foyer. As they enter, Allison's voice is heard in the background. Parrish and the young man appear at the table, and an awkward pause ensues as the unannounced guest’s presence at a family dinner is noted, with the guest himself being carefully surveyed. Horribly uncomfortable, Parrish watches as the young man looks at each person as if discovering a face for the first time, leading to another awkward pause, with the group waiting patiently. Parrish desperately searches for a last name, with a furtive glance at Joe, and a name tumbles from his lips as Luisa sets a plate in front of Joe and returns Parrish's plate, which was taken to the kitchen to be warmed. Joe looks over at the other guests, picks up his utensils gingerly, tries to copy the others, and stops, staring at his food. Parrish falls silent again, searching for an answer, as Susan kisses Drew in a light, humorous way, their heads bobbing like plastic water toys, lips meeting mid-air, and at the kiss's conclusion, Susan suddenly notices Joe is present and has been watching.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A glimmer of a silhouette emerges from beyond the edge of the concealed pane at the part of the chamber most remote from Parrish, signaling a form is there. Parrish becomes quiet, the noise and pitch of the voice rendering him speechless. He takes a stride backward and grapples to comprehend what he is perceiving. After a moment, the figure, who is the origin of the voice, steps forward, unveiling himself to be the youthful male observed earlier in the café, but with an alteration; he seems strange, unbalanced, not attractive but alarmingly exquisite. An instant passes with Parrish beside himself as the youthful male steps nearer to him, his visage inches from Parrish's, challenging him to recognize him. Parrish turns away, but the youthful male reappears in front of him, magnificently. Astonished and petrified by the epiphany, Parrish examines the youthful male, who now seems perplexed by his own influence. A hopelessly baffled Parrish does not react for a moment, then a noise at the entrance causes him to glance at Luisa and then at the youthful male, verifying the youthful male's presence has been recognized by Luisa. Luisa nods briefly and departs, leaving Parrish immobile, bewildered, and alarmed by the reaction. Reluctant, Parrish then dutifully guides the youthful male out of the library, down a lengthy corridor, and across the vestibule. As they enter, Allison's voice is audible in the distance. Parrish and the youthful male appear at the table, and an uncomfortable pause follows as the unexpected visitor’s presence at a kin dinner is noted, with the visitor himself being meticulously examined. Awfully uneasy, Parrish observes as the youthful male gazes at each individual as if encountering a visage for the first time, leading to another uncomfortable pause, with the group waiting serenely. Parrish frantically searches for a surname, with a secretive glance at Joe, and a name spills from his lips as Luisa places a dish in front of Joe and returns Parrish's dish, which was taken to the scullery to be heated. Joe looks over at the other visitors, picks up his cutlery cautiously, tries to imitate the others, and halts, staring at his meal. Parrish becomes quiet again, hunting for a solution, as Susan pecks Drew in a light, jovial way, their heads bobbing like plastic aqua toys, lips meeting mid-air, and at the kiss's end, Susan suddenly discerns Joe is present and has been observing."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A flicker of a shadow is seen from behind the corner of the obscured glass at the section of the room most distant from Parrish, indicating a shape is there. Silence is adopted by Parrish, as the sound and tone of the voice render him mute. A step is taken backward by him, and he struggles to make sense of what he is hearing. After a moment, the figure, the source of the voice, steps forward, revealing himself to be the young man Parrish had previously seen in the coffee shop, but with a change; he seems odd, off-center, not handsome but terrifyingly beautiful. A moment passes with Parrish beside himself as the young man steps closer to him, his face inches from Parrish's, daring Parrish to identify him. Turning away occurs on Parrish's part, but the young man appears in front of Parrish spectacularly. Stunned and terrified by the realization, Parrish surveys the young man, who now seems bewildered by his own effect. A hopelessly confused Parrish does not respond for a moment; then a sound at the door causes Luisa to be looked at by Parrish and then at the young man, verifying that his presence has been acknowledged by Luisa. A perfunctory nod is given by Luisa, and she exits, leaving Parrish frozen, dumbfounded, and frightened by the response. Hesitation grips Parrish, who then obediently leads the young man out of the library, down a long hallway, and across the foyer. As they enter, the background fills with the sound of Allison's voice. The table is approached by Parrish and the young man, and an awkward pause ensues as the unannounced guest’s presence at a family dinner is noted; they carefully survey the guest himself. Horribly uncomfortable, Parrish watches as the young man looks at each person as if discovering a face for the first time, leading to another awkward pause, with the group waiting patiently. Desperate, Parrish searches for a last name, with a furtive glance at Joe, and a name tumbles from his lips as Luisa sets a plate in front of Joe and returns Parrish's plate, having taken it to the kitchen to be warmed. Other guests are looked over by Joe, he picks up his utensils gingerly, tries to copy the others, and stops, staring at his food. Silence is again adopted by Parrish, searching for an answer, as Susan kisses Drew in a light, humorous way, their heads bobbing like plastic water toys, lips meeting mid-air, and at the kiss's conclusion, Susan suddenly notices Joe is present and has been watching."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A shadow flickers from behind the obscured glass at the room's farthest corner from Parrish, signaling a presence. Parrish falls silent, startled by the voice. He steps back, trying to understand it. The figure steps forward, revealing the young man seen earlier in the coffee shop; he's oddly beautiful, not quite handsome. Parrish is stunned as the young man approaches closely. Parrish turns away, but the young man appears before him again. Frightened, Parrish observes the man, who seems confused by his own impact. A noise at the door prompts Parrish to look at Luisa, confirming she's seen the young man too. Luisa nods and leaves, leaving Parrish frozen and scared. Hesitant, Parrish leads the young man out of the library. They enter the foyer with Allison's voice in the background. At the table, the young man, an unannounced guest at dinner, is carefully observed, causing awkwardness. Parrish searches for a last name, glancing at Joe, and a name slips out. Luisa sets a plate for Joe and returns Parrish's plate. Joe cautiously picks up utensils, mimicking the others, then stares at his food. Parrish falls silent as Susan kisses Drew playfully, their heads bobbing. Susan then notices Joe watching."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A shadow flickers behind obscured glass farthest from Parrish, indicating a shape. Parrish goes silent, stepping back, confused by a voice. The figure, a previously seen young man from the coffee shop, emerges, now unsettlingly beautiful. As he steps closer, Parrish turns away, but the young man spectacularly reappears. Stunned, Parrish realizes others see him as Luisa exits, acknowledging his presence. Parrish leads the young man out, overhearing Allison's voice. At the family dinner table, the unexpected guest causes awkwardness as he surveys everyone anew. Parrish glances at Joe, blurting out a name while Luisa returns his plate. Joe mimics others with utensils, then stares at his food. Silent, Parrish watches Susan humorously kiss Drew, their heads bobbing, until Susan notices Joe watching."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A faint flicker of a shadow emerges from behind the corner of the obscured, clouded glass situated at the part of the room that is most distant from where Parrish is standing, suggesting that a form or shape is indeed present. Parrish abruptly falls silent, rendered mute by the sound and compelling tone of the voice that reaches him. As he takes a step backward, he grapples to comprehend and make sense of the peculiar things he is hearing. After a brief moment, the figure, who turns out to be the source of the mysterious voice, steps forward—revealing himself as the young man Parrish had previously encountered in the bustling coffee shop. However, there is a noticeable change; this time the young man appears strangely off-center, not classically handsome but rather possessing a terrifyingly exquisite beauty. \n\nA moment lingers with Parrish utterly beside himself as the young man advances closer, so near that his face is merely inches from Parrish's own, almost daring him to recognize or identify him. Parrish turns away instinctively, but the young man appears before him once more, in a manner nothing short of spectacular. Stunned and terrified by this realization, Parrish surveys the young man, who now appears bewildered by the impact he has caused. Hopelessly confused, Parrish does not immediately respond, and then a sudden sound at the door draws his attention. He glances at Luisa and back at the young man, confirming that Luisa has indeed acknowledged the young man's perplexing presence. With a curt nod, Luisa exits the scene, leaving Parrish frozen, dumbfounded, and filled with an overwhelming fear due to this unexpected turn of events.\n\nHesitant yet compliant, Parrish obediently leads the young man out of the confines of the library, down a long, echoing hallway, and across the expansive foyer. As they make their way forward, the sound of Allison's voice can be heard resonating in the background. Parrish and the enigmatic young man appear at the dining table, and an awkward pause hovers in the air as the unheralded guest’s presence at the family dinner is noted, with the guest himself being meticulously scrutinized by all. Feeling horribly uncomfortable, Parrish watches intently as the young man examines each person around the table as though he is discovering each face for the very first time, leading to yet another awkward pause, with the group waiting patiently for something to break the tension. \n\nParrish desperately searches his mind for a last name, casting a furtive glance in Joe's direction, and finally, a name tumbles out of his mouth just as Luisa places a plate in front of Joe and returns Parrish's own plate, which had been taken away to the kitchen to be warmed. Joe surveys the other guests gathered around, gingerly picking up his utensils in a manner of trying to mimic their actions, but then stops, staring blankly at his food. Parrish is rendered silent once more, fervently searching for an explanation, as Susan kisses Drew in a light, playful manner. Their heads bounce like plastic water toys, their lips meeting fleetingly in mid-air, and as the kiss comes to an end, Susan suddenly notices Joe's presence and realizes he has been attentively watching the entire time."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A faint flicker, a subtle shadow, begins to emerge from behind the corner of the obscured, clouded glass situated at the part of the room farthest from the spot where Parrish is standing. This faint movement suggests that there is indeed a form or shape present in that hidden corner. Parrish, who is engaged in his own thoughts, abruptly falls silent, his voice rendered mute by the compelling tone and mysterious sound of the voice that has reached his ears. As he instinctively takes a step backward, he grapples to comprehend and make sense of the peculiar things he is hearing in this unsettling moment. After a brief moment of confusion, the figure, who turns out to be the source of this enigmatic voice, steps forward into the light—revealing himself to be the young man Parrish had previously encountered in a bustling coffee shop. However, there is a noticeable change; this time, the young man appears strangely off-center, not classically handsome, but rather possessing a terrifyingly exquisite beauty that is difficult to describe.\n\nA moment lingers, with Parrish utterly beside himself as the young man advances even closer, so near that his face is just inches from Parrish's own, almost daring him to recognize or identify him. Parrish, acting on instinct, turns away, but the young man appears before him once more in a manner nothing short of spectacular. Stunned and deeply terrified by this realization, Parrish surveys the young man, who now seems bewildered by the dramatic impact he has caused. Hopelessly confused, Parrish does not immediately respond, and then a sudden sound at the door draws his attention away. He glances at Luisa and then back at the young man, confirming that Luisa has indeed acknowledged the young man's perplexing presence in the room. With a curt nod, Luisa exits the scene, leaving Parrish frozen in place, dumbfounded, and filled with an overwhelming sense of fear due to this unexpected turn of events.\n\nHesitant yet compliant, Parrish obediently leads the young man out of the confines of the library. They move down a long, echoing hallway and then across the expansive foyer. As they continue moving forward, the sound of Allison's voice can be distinctly heard resonating in the background. Parrish and the enigmatic young man appear together at the dining table, and an awkward pause hovers heavily in the air as the unheralded guest’s presence at the family dinner is noted by everyone at the table. The guest himself is meticulously scrutinized, watched by all with intense curiosity. Feeling horribly uncomfortable, Parrish watches intently as the young man examines each person seated around the table, as though he is discovering each face for the very first time. This action leads to yet another awkward pause, with the group waiting patiently for something, anything, to break the mounting tension.\n\nParrish desperately searches his mind for a last name, casting a furtive glance in Joe's direction, and finally, a name tumbles out of his mouth just as Luisa places a plate in front of Joe and then returns Parrish's own plate, which had been taken away to the kitchen to be warmed. Joe surveys the other guests gathered around, gingerly picking up his utensils in an attempt to mimic their actions, but then stops, staring blankly at his food. Parrish is rendered silent once more, fervently searching for an explanation, as Susan kisses Drew in a light, playful manner. Their heads bounce like plastic water toys, their lips meeting fleetingly in mid-air. As the kiss comes to an end, Susan suddenly notices Joe's presence and realizes he has been attentively watching the entire time, his gaze unwavering."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A flicker of a shadow emerges subtly from behind the corner of the obscured glass in the section of the room furthest from Parrish, suggesting the presence of a shape. Instantly, Parrish's words fade away, the peculiar sound and mysterious tone of the voice rendering him mute. He instinctively takes a cautious step backward while grappling with the perplexing noises, trying desperately to comprehend what he is hearing. Moments later, the figure responsible for the enigmatic voice steps forward, gradually revealing himself to be the same young man Parrish had noticed previously in the coffee shop, yet now altered, appearing oddly off, with a beauty that is strangely terrifying rather than alluring. As a moment passes, Parrish finds himself overwhelmed by confusion as the young man edges closer, allowing his face to come within mere inches of Parrish's, silently challenging him to recognize him. Overcome with a mix of emotions, Parrish turns away, but the young man astonishingly appears in front of him once more, as if by magic. Stunned and gripped by fear, Parrish begins to assess the young man, who now seems perplexed by the impact he has on those around him. Lost and bewildered, Parrish stands motionless for a moment until a sound from the door grabs his attention, prompting him to glance at both Luisa and the young man to confirm that Luisa has acknowledged the young man's existence. Luisa gives a brief nod, acknowledging the situation, and exits the scene, leaving Parrish paralyzed, caught in a web of confusion and fear. Tentatively, Parrish then follows an unspoken directive, leading the young man out of the library, traversing a long hallway, and eventually crossing the foyer. Allison's voice echoes softly in the background as they make their entrance. Upon arriving at the dinner table, an awkward silence settles over the group as they take in the unexpected presence of the guest, who is scrutinized with quiet curiosity. Overcome with discomfort, Parrish watches the young man meticulously survey each face at the table as if he were seeing them for the very first time, creating another pause filled with awkward anticipation while the group waits with bated breath. Desperately seeking to provide an identity for the young man, Parrish darts a quick glance toward Joe, and a name clumsily escapes his lips just as Luisa places a plate in front of Joe and returns Parrish's own plate, which had been taken away for reheating. Joe, feeling the weight of the room's attention, cautiously picks up his utensils, attempts to mimic the actions of those around him, but then halts, staring intently at his food, unsure of how to proceed. Once again, Parrish finds himself at a loss for words, searching for an elusive answer, as Susan playfully kisses Drew, their heads humorously bobbing like plastic water toys and lips meeting in mid-air, until at the kiss's end, Susan suddenly becomes aware that Joe is present and has observed the entire scene unfold before him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A shadow flickers from behind obscured glass in a distant corner of the room, signaling a presence that leaves Parrish momentarily speechless. As he steps back, trying to comprehend the voice he hears, the figure steps forward—revealed to be the young man from the coffee shop, now appearing unsettlingly beautiful. Parrish, bewildered, watches as the young man approaches, daring a recognition that leaves Parrish turning away. In a spectacular move, the young man reappears in front of Parrish, who, stunned and terrified, observes the young man's own bewilderment at his effect. A noise at the door prompts Parrish to verify with Luisa the young man's acknowledged presence; she nods and exits, leaving Parrish frozen in fear. Hesitantly, he leads the young man out of the library, through a hallway, and across the foyer, entering to the sound of Allison's voice. At the family dinner table, the young man's unannounced presence creates an awkward pause as everyone surveys him carefully. Parrish, horribly uncomfortable, watches the young man study each person as if seeing their faces for the first time, while the group waits patiently. Desperately, Parrish searches for and blurts out a last name after exchanging a glance with Joe, as Luisa sets a plate before Joe and returns Parrish's warmed plate. Joe, observing the other guests, gingerly picks up his utensils, imitates them briefly, then pauses to stare at his food. As Parrish falls silent, searching for answers, Susan shares a light, humorous kiss with Drew, their heads bobbing playfully. The kiss ends with Susan suddenly noticing Joe's presence and his watchful gaze."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A flicker of a shadow appears from behind the corner of the obscured glass at the section of the library most distant from Parrish, indicating a shape is there. The library, known for its quiet sanctity and rows of ancient tomes, suddenly feels ominous. Parrish falls silent, the sound and tone of the voice rendering him mute. He takes a step backward and struggles to make sense of what he is hearing. After a moment, the figure, who is the source of the voice, steps forward, revealing himself to be the young man seen previously in the local coffee shop, but with a change; he seems odd, off-center, not handsome but terrifyingly beautiful in a way that recalls mythological stories of sirens. A moment passes with Parrish beside himself as the young man steps closer to him, his face inches from Parrish's, daring him to identify him. Parrish turns away, but the young man reappears in front of him, spectacularly, as if defying the laws of physics. Stunned and terrified by the realization, Parrish surveys the young man, who now seems bewildered by his own effect as though he is suddenly aware of his own transformation. A hopelessly confused Parrish does not respond for a moment, then a sound at the grand oak door, a testament to the building's Victorian architecture, causes him to look at Luisa and then at the young man, verifying the young man's presence has been acknowledged by Luisa. Luisa nods perfunctorily, accustomed to odd occurrences, and exits, leaving Parrish frozen, dumbfounded, and frightened by the response. Hesitant, Parrish then obediently leads the young man out of the library, down a long hallway adorned with portraits of stern ancestors, and across the foyer. As they enter, Allison's voice, known for its melodic yet piercing quality, is heard in the background. Parrish and the young man appear at the table, and an awkward pause ensues as the unannounced guest’s presence at a family dinner is noted, with the guest himself being carefully surveyed as though he were an artifact in a museum. Horribly uncomfortable, Parrish watches as the young man looks at each person as if discovering a face for the first time, reminiscent of a child seeing the world anew, leading to another awkward pause, with the group waiting patiently. Parrish desperately searches for a last name, with a furtive glance at Joe, a distant cousin notorious for his cluelessness, and a name tumbles from his lips as Luisa sets a plate in front of Joe and returns Parrish's plate, which was taken to the kitchen to be warmed in the old-fashioned oven. Joe looks over at the other guests, picks up his utensils gingerly, tries to copy the others, and stops, staring at his food, which includes an unusual dish that seems almost alien to him. Parrish falls silent again, searching for an answer, as Susan kisses Drew in a light, humorous way, their heads bobbing like plastic water toys often found in the nearby amusement park, lips meeting mid-air, and at the kiss's conclusion, Susan suddenly notices Joe is present and has been watching with the same kind of puzzled expression he wore when trying to decipher his food."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A flicker of a shadow appears from behind the corner of the obscured glass at the section of the room most distant from Parrish indicating a shape is there. Parrish falls silent the sound and tone of the voice rendering him mute. He takes a step backward and struggles to make sense of what he is hearing. After a moment the figure who is the source of the voice steps forward revealing himself to be the young man seen previously in the coffee shop but with a change he seems odd offcenter not handsome but terrifyingly beautiful. A moment passes with Parrish beside himself as the young man steps closer to him his face inches from Parrish's daring him to identify him. Parrish turns away but the young man reappears in front of him spectacularly. Stunned and terrified by the realization Parrish surveys the young man who now seems bewildered by his own effect. A hopelessly confused Parrish does not respond for a moment. then a sound at the door causes him to look at Luisa and then at the young man verifying the young man's presence has been acknowledged by Luisa. Luisa nods perfunctorily and exits leaving Parrish frozen dumbfounded and frightened by the response. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Hesitant Parrish then obediently leads the young man out of the library down a long hallway and across the foyer. As they enter Allison's voice is heard in the background. Parrish and the young man appear at the table and an awkward pause ensues as the unannounced guest’s presence at a family dinner is noted with the guest himself being carefully surveyed. Horribly uncomfortable. Parrish watches as the young man looks at each person as if discovering a face for the first time leading to another awkward pause with the group waiting patiently. Parrish desperately searches for a last name with a furtive glance at Joe and a name tumbles from his lips as Luisa sets a plate in front of Joe and returns Parrish's plate which was taken to the kitchen to be warmed. Joe looks over at the other guests picks up his utensils gingerly tries to copy the others and stops staring at his food. Parrish falls silent again searching for an answer. as Susan kisses Drew in a light humorous way their heads bobbing like plastic water toys lips meeting midair and at the kiss's conclusion. Susan suddenly notices Joe is present and has been watching."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A flicker of a shadow appears from behind the corner of the obscured glass at the section of the room most distant from Parrish indicating a shape is there. Parrish falls silent the sound and tone of the voice rendering him mute. He takes a step backward and struggles to make sense of what he is hearing. After a moment the figure who is the source of the voice steps forward revealing himself to be the young man seen previously in the coffee shop but with a change he seems odd offcenter not handsome but terrifyingly beautiful. A moment passes with Parrish beside himself as the young man steps closer to him his face inches from Parrish's daring him to identify him. Parrish turns away but the young man reappears in front of him spectacularly. Stunned and terrified by the realization Parrish surveys the young man who now seems bewildered by his own effect. A hopelessly confused Parrish does not respond for a moment. then a sound at the door causes him to look at Luisa and then at the young man verifying the young man's presence has been acknowledged by Luisa. Luisa nods perfunctorily and exits leaving Parrish frozen dumbfounded and frightened by the response. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Hesitant Parrish then obediently leads the young man out of the library down a long hallway and across the foyer. As they enter Allison's voice is heard in the background. Parrish and the young man appear at the table and an awkward pause ensues as the unannounced guest’s presence at a family dinner is noted with the guest himself being carefully surveyed. Horribly uncomfortable. Parrish watches as the young man looks at each person as if discovering a face for the first time leading to another awkward pause with the group waiting patiently. Parrish desperately searches for a last name with a furtive glance at Joe and a name tumbles from his lips as Luisa sets a plate in front of Joe and returns Parrish's plate which was taken to the kitchen to be warmed. Joe looks over at the other guests picks up his utensils gingerly tries to copy the others and stops staring at his food. Parrish falls silent again searching for an answer. as Susan kisses Drew in a light humorous way their heads bobbing like plastic water toys lips meeting midair and at the kiss's conclusion. Susan suddenly notices Joe is present and has been watching."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A flicker of a shadow appears from behind the corner of the obscured glass at the section of the room most distant from Parrish indicating a shape is there. Parrish falls silent the sound and tone of the voice rendering him mute. He takes a step backward and struggles to make sense of what he is hearing. After a moment the figure who is the source of the voice steps forward revealing himself to be the young man seen previously in the coffee shop but with a change he seems odd offcenter not handsome but terrifyingly beautiful. A moment passes with Parrish beside himself as the young man steps closer to him his face inches from Parrish's daring him to identify him. Parrish desperately searches for a last name with a furtive glance at Joe and a name tumbles from his lips as Luisa sets a plate in front of Joe and returns Parrish's plate which was taken to the kitchen to be warmed. Joe looks over at the other guests picks up his utensils gingerly tries to copy the others and stops staring at his food. Parrish falls silent again searching for an answer. as Susan kisses Drew in a light humorous way their heads bobbing like plastic water toys lips meeting midair and at the kiss's conclusion. Susan suddenly notices Joe is present and has been watching."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A flicker of a shadow appears from behind the corner of the obscured glass at the section of the room most distant from Parrish indicating a shape is there. Parrish falls silent the sound and tone of the voice rendering him mute. as Susan kisses Drew in a light humorous way their heads bobbing like plastic water toys lips meeting midair and at the kiss's conclusion. Susan suddenly notices Joe is present and has been watching."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A glimmer of a silhouette emerges from behind the edge of the frosted door at the spot of the garden closest to Marvin, suggesting an object is lurking. Marvin stays quiet, the color and texture of the music rendering him still. He stumbles forward and struggles to comprehend what he is listening to. After a few seconds, the animal, which is the cause of the music, moves backward, revealing itself to be the elderly bird spotted earlier in the bakery, but with a difference; it appears normal, centered, not elegant but terrifically plain. Another moment passes with Marvin beyond himself as the elderly bird drifts away from him, its beak millimeters from Marvin's, challenging him to classify it. Marvin turns to face, but the elderly bird vanishes behind him, quietly. Shocked and thrilled by the discovery, Marvin examines the elderly bird, which now seems intrigued by its own absence. A hopelessly baffled Marvin does not act for a while, then a flash at the window makes him glance at Maria and then at the elderly bird, confirming the elderly bird's appearance has been ignored by Maria. Maria winks briefly and enters, leaving Marvin mobile, enlightened, and relaxed by the inaction. Boldly, Marvin then reluctantly follows the elderly bird into the attic, up a short staircase, and through the basement. As they exit, Erica's melody is felt in the foreground. Marvin and the elderly bird vanish at the counter, and a pleasant silence occurs as the expected host's absence at a public concert is forgotten, with the host herself being consistently ignored. Perfectly relaxed, Marvin listens as the elderly bird stares at everything as if recognizing a song for the last time, causing yet another pleasant silence, with the crowd talking softly. Marvin tirelessly waits for a first word, with an overt look at Frank, and a note escapes from his hand as Maria places a glass in front of Frank and retrieves Marvin's glass, which had been taken to the lounge to be chilled. Frank gazes past at the absent hosts, sets down his napkin lightly, tries to ignore the others, and continues, gazing at his drink. Marvin speaks loudly again, hoping for a question, as Angie claps Liam in a soft, serious manner, their eyes blinking like mechanical wind-up toys, fingers meeting mid-air, and at the clapping's start, Angie abruptly realizes Frank is absent and hasn't listened."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A shadow emerges from behind an obscured glass, and Parrish falls silent at the voice's tone. The figure, a young man previously seen at a coffee shop, steps forward, appearing not handsome but terrifyingly beautiful. As the young man gets closer, Parrish is stunned and terrified. A sound at the door reveals Luisa, who acknowledges the young man's presence before exiting, leaving Parrish frightened. Hesitantly, Parrish leads the young man out of the library to a family dinner, where the unannounced guest causes an awkward pause. The young man surveys each person, creating further discomfort, as Parrish searches for a last name to offer. Joe tries to mimic the other guests but stares at his food. As Susan and Drew share a humorous kiss, Susan notices Joe watching, emphasizing the young man's unsettling presence."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Susan suddenly notices Joe is present and has been watching as Susan kisses Drew in a light humorous way their heads bobbing like plastic water toys lips meeting midair and at the kiss's conclusion Parrish falls silent again searching for an answer Joe looks over at the other guests picks up his utensils gingerly tries to copy the others and stops staring at his food Parrish desperately searches for a last name with a furtive glance at Joe and a name tumbles from his lips as Luisa sets a plate in front of Joe and returns Parrish's plate which was taken to the kitchen to be warmed Parrish watches as the young man looks at each person as if discovering a face for the first time leading to another awkward pause with the group waiting patiently Horribly uncomfortable Parrish and the young man appear at the table and an awkward pause ensues as the unannounced guest’s presence at a family dinner is noted with the guest himself being carefully surveyed As they enter Allison's voice is heard in the background Hesitant Parrish then obediently leads the young man out of the library down a long hallway and across the foyer Luisa nods perfunctorily and exits leaving Parrish frozen dumbfounded and frightened by the response then a sound at the door causes him to look at Luisa and then at the young man verifying the young man's presence has been acknowledged by Luisa A hopelessly confused Parrish does not respond for a moment Stunned and terrified by the realization Parrish surveys the young man who now seems bewildered by his own effect Parrish turns away but the young man reappears in front of him spectacularly A moment passes with Parrish beside himself as the young man steps closer to him his face inches from Parrish's daring him to identify him After a moment the figure who is the source of the voice steps forward revealing himself to be the young man seen previously in the coffee shop but with a change he seems odd offcenter not handsome but terrifyingly beautiful He takes a step backward and struggles to make sense of what he is hearing Parrish falls silent the sound and tone of the voice rendering him mute A flicker of a shadow appears from behind the corner of the obscured glass at the section of the room most distant from Parrish indicating a shape is there"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Parrish falls silent the sound and tone of the voice rendering him mute A flicker of a shadow appears from behind the corner of the obscured glass at the section of the room most distant from Parrish indicating a shape is there After a moment the figure who is the source of the voice steps forward revealing himself to be the young man seen previously in the coffee shop but with a change he seems odd offcenter not handsome but terrifyingly beautiful He takes a step backward and struggles to make sense of what he is hearing Parrish turns away but the young man reappears in front of him spectacularly A moment passes with Parrish beside himself as the young man steps closer to him his face inches from Parrish's daring him to identify him A hopelessly confused Parrish does not respond for a moment Stunned and terrified by the realization Parrish surveys the young man who now seems bewildered by his own effect Luisa nods perfunctorily and exits leaving Parrish frozen dumbfounded and frightened by the response then a sound at the door causes him to look at Luisa and then at the young man verifying the young man's presence has been acknowledged by Luisa As they enter Allison's voice is heard in the background Hesitant Parrish then obediently leads the young man out of the library down a long hallway and across the foyer Horribly uncomfortable Parrish and the young man appear at the table and an awkward pause ensues as the unannounced guest’s presence at a family dinner is noted with the guest himself being carefully surveyed Parrish desperately searches for a last name with a furtive glance at Joe and a name tumbles from his lips as Luisa sets a plate in front of Joe and returns Parrish's plate which was taken to the kitchen to be warmed Parrish watches as the young man looks at each person as if discovering a face for the first time leading to another awkward pause with the group waiting patiently Parrish falls silent again searching for an answer Joe looks over at the other guests picks up his utensils gingerly tries to copy the others and stops staring at his food Susan suddenly notices Joe is present and has been watching as Susan kisses Drew in a light humorous way their heads bobbing like plastic water toys lips meeting midair and at the kiss's conclusion"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Hesitant Parrish then obediently leads the young man out of the library down a long hallway and across the foyer As they enter Allison's voice is heard in the background Parrish and the young man appear at the table and an awkward pause ensues as the unannounced guest’s presence at a family dinner is noted with the guest himself being carefully surveyed Horribly uncomfortable Parrish watches as the young man looks at each person as if discovering a face for the first time leading to another awkward pause with the group waiting patiently Parrish desperately searches for a last name with a furtive glance at Joe and a name tumbles from his lips as Luisa sets a plate in front of Joe and returns Parrish's plate which was taken to the kitchen to be warmed Joe looks over at the other guests picks up his utensils gingerly tries to copy the others and stops staring at his food Parrish falls silent again searching for an answer as Susan kisses Drew in a light humorous way their heads bobbing like plastic water toys lips meeting midair and at the kiss's conclusion Susan suddenly notices Joe is present and has been watching A flicker of a shadow appears from behind the corner of the obscured glass at the section of the room most distant from Parrish indicating a shape is there Parrish falls silent the sound and tone of the voice rendering him mute He takes a step backward and struggles to make sense of what he is hearing After a moment the figure who is the source of the voice steps forward revealing himself to be the young man seen previously in the coffee shop but with a change he seems odd offcenter not handsome but terrifyingly beautiful A moment passes with Parrish beside himself as the young man steps closer to him his face inches from Parrish's daring him to identify him Parrish turns away but the young man reappears in front of him spectacularly Stunned and terrified by the realization Parrish surveys the young man who now seems bewildered by his own effect A hopelessly confused Parrish does not respond for a moment then a sound at the door causes him to look at Luisa and then at the young man verifying the young man's presence has been acknowledged by Luisa Luisa nods perfunctorily and exits leaving Parrish frozen dumbfounded and frightened by the response"
        }
      ]
    }
  ]
}