{
  "ground_truth": "She is shocked, embarrassed, pleased, and conflicted, experiencing an instant and wide spectrum of emotions. Joe is happily confounded by all the interaction. Joe hears Susan's question but, as he studies her, doesn't answer. Drew reacts to this allusion of intimacy. Joe rises, follows Parrish to the door, and stops, then pivots and follows Parrish out the proper door. Parrish turns back to the bedroom. Joe tests the springs. Coyle regards his peanut butter sheepishly, and Joe raises the spoonful of peanut butter in a kind of toast to the staff. A spectacular indoor Olympic pool with a window commands views of the skyline. Susan is swimming laps, looking very professional in a black Speedo suit, and Joe wanders in, still licking his peanut butter. He observes her, but she is unaware of him; however, as she makes a barrel turn, his shadow falls over a reflection from a window, and she aborts her lap, looking up to see who it is. Susan climbs out of the pool, gets halfway up the ladder, and points to a stack of towels. Joe turns to the towels, but one hand is occupied with the spoonful of peanut butter; he shifts it to the other hand, can't manage the huge Turkish towel one-handed, so he implants the spoon in his mouth, lifts the towel with both hands, and presents it to Susan. Joe continues to nibble at his peanut butter until he finishes the spoonful. He shifts the spoon from hand to hand, starts to stick it in his pocket, and realizes this is inappropriate. Susan holds her hand out to him, he places the spoon in it, and she sets the spoon on the table with the towels. She watches, fascinated, as Joe licks his gums, enjoying every last bit of his spoonful. Parrish regards Joe, noticing the tie is a sorry mess now, a batwing of silk stretching across his collarbone. Parrish is startled and regards Joe carefully. Silence follows as Joe considers the point, and Parrish quickly crosses to him, undoes the tie, and begins tying it for him. He completes the tying of Joe's tie with some difficulty, adjusts it beautifully on Joe's collar, then spins him around in front of a mirror. Joe, catching sight of his own appearance, rises to the balls of his feet, quite taken. They stride on, cutting through the crowd, with Joe all at home in his new surroundings, but Parrish just the opposite, uncharacteristically uncomfortable, phrases forming on his lips but unspoken, then suddenly he blurts out. Jennifer wheels and heads right back to the office as Parrish arrives at the door to the Board Room. Parrish hesitates, nods, conceding the point, reaches for the doorknob, and enters, with Joe following right behind him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She is astonished, mortified, delighted, and torn, undergoing an immediate and broad range of feelings. Joe is cheerfully perplexed by all the exchange. Joe detects Susan's inquiry but, as he examines her, doesn't respond. Drew reacts to this implication of closeness. Joe ascends, trails Parrish to the portal, and halts, then turns and trails Parrish out the proper portal. Parrish turns back to the chamber. Joe tests the coils. Coyle regards his peanut butter bashfully, and Joe elevates the spoonful of peanut butter in a kind of salute to the staff. A magnificent indoor Olympic basin with a pane commands views of the horizon. Susan is swimming circuits, looking very proficient in a black Speedo suit, and Joe roams in, still savoring his peanut butter. He watches her, but she is oblivious to him; however, as she executes a pivot turn, his silhouette falls over a reflection from a pane, and she halts her circuit, looking up to see who it is. Susan climbs out of the basin, gets halfway up the ladder, and points to a pile of towels. Joe turns to the towels, but one hand is occupied with the spoonful of peanut butter; he transfers it to the other hand, can't handle the enormous Turkish towel single-handed, so he implants the spoon in his mouth, lifts the towel with both hands, and offers it to Susan. Joe continues to nibble at his peanut butter until he finishes the spoonful. He shifts the spoon from hand to hand, starts to place it in his pocket, and realizes this is improper. Susan extends her hand out to him, he places the spoon in it, and she sets the spoon on the table with the towels. She observes, captivated, as Joe licks his gums, relishing every final morsel of his spoonful. Parrish observes Joe, noting the tie is a pitiful jumble now, a batwing of silk stretching across his clavicle. Parrish is taken aback and observes Joe intently. Silence ensues as Joe contemplates the point, and Parrish swiftly crosses to him, undoes the tie, and begins tying it for him. He completes the tying of Joe's tie with some effort, adjusts it elegantly on Joe's collar, then spins him around in front of a mirror. Joe, catching sight of his own reflection, rises to the balls of his feet, quite captivated. They stride on, slicing through the crowd, with Joe all at ease in his new environment, but Parrish just the reverse, uncharacteristically uneasy, expressions forming on his lips but unspoken, then suddenly he blurts out. Jennifer wheels and heads right back to the workplace as Parrish arrives at the portal to the Board Room. Parrish hesitates, nods, accepting the point, reaches for the doorknob, and enters, with Joe following right behind him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Sure, here is the transformed text with the voice of each sentence changed accordingly:\n\nA wide spectrum of emotions is experienced by her instantly, including shock, embarrassment, pleasure, and conflict. All the interaction happily confounds Joe. Susan's question is heard by Joe, but as he studies her, he doesn't answer. This allusion of intimacy is reacted to by Drew. Joe rises, follows Parrish to the door, and is stopped, then is pivoted and followed by him out the proper door. The bedroom is turned back to by Parrish. The springs are tested by Joe. Coyle sheepishly regards his peanut butter, and the spoonful of peanut butter is raised by Joe in a kind of toast to the staff. The skyline is commanded by a spectacular indoor Olympic pool with a window view. Laps are being swum by Susan, looking very professional in a black Speedo suit, while Joe wanders in, still licking his peanut butter. She is observed by him, but he is unaware of her; however, as a barrel turn is made by her, his shadow falls over a reflection from a window, and her lap is aborted by her, looking up to see who he is. Susan climbs out of the pool, halfway up the ladder, and a stack of towels is pointed to by her. Joe turns to the towels, but the spoonful of peanut butter occupies one hand; it is shifted by him to the other hand, the huge Turkish towel can't be managed one-handed, so the spoon is implanted by him in his mouth, the towel is lifted with both hands, and it is presented to Susan. The spoonful of peanut butter is nibbled at by Joe until it is finished by him. The spoon is shifted by him from hand to hand, he starts to stick it in his pocket, and the inappropriateness is realized by him. Her hand is held out to him by Susan, the spoon is placed in it by him, and it is set on the table with the towels by her. She is fascinated as Joe licks his gums, enjoying every last bit of his spoonful. Joe is regarded by Parrish, noticing the tie is a sorry mess now, a batwing of silk stretching across his collarbone. Joe startles Parrish and he is regarded carefully. The point is considered by Joe in silence, and Parrish quickly crosses to him, the tie is undone, and it is tied for him. The tying of Joe's tie is completed with some difficulty, it is adjusted beautifully on Joe's collar, then he is spun around in front of a mirror. Catching sight of his own appearance, Joe rises to the balls of his feet, quite taken. They stride on, cutting through the crowd, as Joe feels all at home in his new surroundings, but Parrish, just the opposite, uncharacteristically uncomfortable, has phrases forming on his lips but unspoken, then suddenly blurts out. Jennifer wheels and heads right back to the office as Parrish arrives at the door to the Board Room. Parrish hesitates, he nods, conceding the point, reaches for the doorknob, and it is entered with Joe following right behind him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She feels shocked, embarrassed, pleased, and conflicted, experiencing a wide range of emotions. Joe is confused by the interaction and hears Susan's question, but doesn't answer. Drew reacts to this sense of intimacy. Joe follows Parrish to the door, then pivots to leave. Parrish returns to the bedroom as Joe tests the springs. Coyle sheepishly regards his peanut butter, and Joe raises a spoonful in a toast to the staff. An indoor Olympic pool with a window offers skyline views. Susan swims laps professionally in a black Speedo suit while Joe wanders in, licking peanut butter. He watches her unaware, but his shadow causes her to look up. Susan climbs out, gestures to towels, and Joe shifts the spoon to grab one. He juggles the spoon, realizes it's not appropriate for his pocket, and hands it to Susan, who sets it with the towels. She is fascinated as Joe licks his gums, savoring every bit. Parrish notices Joe's messy tie and is startled. He unties and reties it for Joe, then spins him to face a mirror. Joe, seeing his appearance, rises to the balls of his feet, pleased. They move through the crowd with Joe comfortable and Parrish uncharacteristically uneasy. Parrish hesitates, nods, and enters the Board Room, with Joe right behind him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She is shocked, embarrassed, pleased, and conflicted, experiencing a wide range of emotions. Joe is happily confused by the interaction. He hears Susan's question but doesn't answer as he studies her, prompting Drew to react. Joe follows Parrish to the door, hesitates, then exits properly. Parrish returns to the bedroom; Joe tests the springs. Coyle sheepishly regards his peanut butter, and Joe raises a spoonful in a toast to the staff. In a stunning indoor Olympic pool with skyline views, Susan swims laps in a black Speedo, unaware of Joe watching while licking peanut butter. Her lap stops when his shadow reflects in a window. Susan climbs the ladder, points to towels. Joe, holding peanut butter, shifts and manages a large towel, handing it to Susan. He finishes nibbling, realizing the spoon is inappropriate for the pocket. Susan takes it, placing it on a table. She is intrigued as Joe enjoys the last of his spoonful. Parrish notes Joe's messy tie, carefully reties it, spins Joe to the mirror. Joe, admiring himself, rises confidently. They move through the crowd with Joe feeling at home, while Parrish is unusually uneasy, forming unspoken words before blurting out. Jennifer returns to the office as Parrish enters the Board Room, with Joe following."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She is utterly shocked, deeply embarrassed, genuinely pleased, and profoundly conflicted, experiencing an instant and comprehensive range of diverse emotions all at once. Meanwhile, Joe finds himself happily bewildered by the entirety of the interaction unfolding before him. As Joe listens to Susan's question, he remains silent, choosing instead to study her, leaving the question unanswered. Drew, witnessing this silent exchange, reacts to the perceived suggestion of intimacy. Joe stands, follows Parrish to the door, pauses momentarily, pivots, and finally accompanies Parrish out through the correct door. Parrish turns his attention back to the bedroom, while Joe tests the resilience of the springs. Coyle looks at his peanut butter sheepishly, and Joe raises his spoonful of peanut butter in a sort of toast to the staff members. \n\nA magnificent indoor Olympic pool, complete with a large window, offers commanding views of the impressive skyline. Susan, dressed in a sleek black Speedo suit, swims laps with the air of a professional, while Joe meanders into the space, still preoccupied with licking his beloved peanut butter. He watches her intently, but she remains oblivious to his presence; however, as she executes a barrel turn, his shadow is cast over her reflection, causing her to halt her lap and look up to identify the intruder. Susan climbs out of the pool, making it halfway up the ladder, and gestures toward a neat stack of towels. Joe turns his attention to the towels, but with one hand occupied by the spoonful of peanut butter, he shifts it to his other hand, struggles to manage the large Turkish towel with just one hand, and finally plants the spoon in his mouth to free both hands to lift the towel and present it to Susan.\n\nJoe continues to savor his peanut butter, nibbling away until he finishes the entire spoonful. He transfers the spoon from hand to hand, momentarily considers putting it in his pocket, realizes the inappropriateness of such an action, and then hands it over to Susan when she extends her hand. She places the spoon on the table with the towels. Fascinated, she watches as Joe licks his gums, relishing every residual bit of his peanut butter treat. Parrish observes Joe, noticing that his tie has become quite disheveled—a batwing of silk draped awkwardly across his collarbone. Surprised, Parrish regards Joe with careful attention. Silence ensues as Joe contemplates the situation, prompting Parrish to quickly approach him, untie and then retie the tie for him with some difficulty, adjusting it to perfection on Joe's collar before turning him to face a mirror. Joe, catching sight of his own transformed appearance, rises slightly to the balls of his feet, clearly impressed. \n\nThey stride forward with confidence, cutting through the bustling crowd, with Joe appearing completely at ease in his newfound surroundings. Parrish, however, is the opposite, uncharacteristically uncomfortable, with unspoken phrases forming on his lips until he suddenly blurts them out. Jennifer spins around and heads directly back to the office just as Parrish reaches the door of the Board Room. Parrish pauses, nods in acknowledgment, concedes the point, reaches for the doorknob, and then enters, with Joe following close behind him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She finds herself in a state of utter shock, feeling deeply embarrassed yet genuinely pleased while simultaneously experiencing a profound sense of internal conflict. In a flash, she undergoes a comprehensive and instant rush of diverse emotions, all hitting her at once. Meanwhile, Joe finds himself in a state of happy bewilderment, thoroughly bemused by the entire interaction that is unfolding before him. As Joe listens intently to Susan's question, he chooses to remain silent, electing instead to observe her closely, which leaves her query hanging in the air, unanswered. Drew, who is witnessing this silent exchange, reacts to what he perceives as an implied suggestion of intimacy. Joe rises to his feet and follows Parrish to the door, where he pauses momentarily, thoughtfully pivots, and finally accompanies Parrish as they exit through the correct door. Parrish then turns his focus back to the bedroom, while Joe tests the resilience of the springs with some curiosity. Coyle glances at his peanut butter with a sheepish expression, and Joe raises his spoonful of peanut butter in a sort of playful toast to the staff members nearby.\n\nThere is a magnificent indoor Olympic pool, an awe-inspiring sight complete with a large window that offers commanding views of the impressive city skyline. Susan, wearing a sleek black Speedo suit, moves through the water with the practiced and confident air of a professional swimmer, while Joe meanders into the space, still preoccupied with licking his beloved peanut butter from the spoon. He watches her with intent concentration, yet she remains oblivious to his presence in the room. However, as she executes a flawless barrel turn, his shadow looms over her reflection, prompting her to halt her lap and look up to identify the unexpected intruder. Susan climbs out of the pool, reaching halfway up the ladder, and gestures towards a neat stack of towels nearby. Joe diverts his focus to the towels, but with one hand occupied by the spoonful of peanut butter, he shifts the spoon to his other hand, struggles momentarily to manage the large Turkish towel with just one hand, and eventually plants the spoon in his mouth to free both hands. He then lifts the towel and presents it to Susan with a small flourish.\n\nJoe continues to savor his peanut butter, methodically nibbling away until he has completely finished the entire spoonful. He transfers the spoon from one hand to the other, briefly contemplating whether to put it in his pocket, but quickly realizes such an action would be inappropriate. He then hands it over to Susan when she extends her hand towards him. She takes the spoon and places it on the table alongside the towels. Fascinated, she watches as Joe licks his gums, clearly relishing every residual bit of his peanut butter treat. Parrish observes Joe closely, noticing that his tie has become quite disheveled—a batwing of silk awkwardly draping across his collarbone. Surprised, Parrish regards Joe with careful attention and deliberation. Silence ensues as Joe contemplates the situation, prompting Parrish to quickly approach him. With some difficulty, Parrish unties and then reties the tie for Joe, adjusting it to perfection on his collar. He then turns Joe to face a mirror. Upon catching sight of his own transformed appearance, Joe rises slightly to the balls of his feet, clearly impressed by the change.\n\nThey stride forward with a sense of confidence, skillfully cutting through the bustling crowd, with Joe appearing completely at ease in his newfound surroundings. Parrish, however, is the opposite; he is uncharacteristically uncomfortable, with unspoken phrases forming on his lips until he suddenly blurts them out. Jennifer spins around and heads directly back to the office just as Parrish reaches the door of the Board Room. Parrish pauses for a moment, nods in acknowledgment, concedes the point, reaches out for the doorknob, and then enters, with Joe following close behind him, ready to face whatever awaits them beyond the threshold."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She experiences a whirlwind of emotions, starting with shock that momentarily paralyzes her, followed rapidly by embarrassment that causes a flush of color to rise to her cheeks. This embarrassment softens into a feeling of pleasure, leaving her with an inner warmth. However, this quickly gives way to conflict, as a mess of thoughts rush through her mind. Meanwhile, Joe stands nearby, caught in a state of joyful confusion, his mind struggling to process the unfolding interactions. Despite hearing Susan's question, Joe remains silent, focusing intently on her with a contemplative gaze, causing Drew to react visibly, picking up on the intimate nature of the moment. Joe soon rises from his seat with purpose, follows Parrish to the door with deliberate footsteps, only to pause momentarily. He then pivots on his heel, realigning his direction to follow Parrish out of the door that leads outside. Parrish then makes a quick turn back towards the entrance of the bedroom, leaving Joe behind to test the firmness of the springs with a curious bounce. Coyle, feeling somewhat self-conscious, glances at his spoon laden with peanut butter. In response, Joe lifts his own spoonful of peanut butter, raising it as if in a toast, acknowledging the presence of the staff. They then encounter a stunning indoor Olympic pool, its large windows offering breathtaking views of the city skyline beyond. Susan, dressed in a sleek black Speedo swimsuit, glides effortlessly through the water, moving with the precision and grace of a seasoned swimmer as she completes her laps. Joe enters the pool area, still savoring his peanut butter with small, contented licks. He stands there, observing Susan's movements, while remaining unnoticed by her. However, as she executes a swift barrel turn, Joe's shadow inadvertently casts over a reflected patch of light from the window, causing Susan to halt her lap suddenly and look upwards to identify her observer. Susan then begins to climb out of the pool, ascends halfway up the ladder, and gestures towards a nearby stack of towels. Joe turns to comply but realizes he is hindered by the spoonful of peanut butter in one hand. He deftly transfers the spoon to his other hand, but when he finds he cannot pick up the large Turkish towel with only one hand, he places the spoon in his mouth. Using both hands, he lifts the towel and presents it to Susan. As she accepts it, Joe continues to enjoy his peanut butter until every last bit is gone. Finishing, he shifts the empty spoon between his hands, contemplates placing it in his pocket, but reconsiders the appropriateness of such an action. As Susan reaches out, Joe places the spoon in her hand, and she subsequently sets it down on the table where the towels are neatly stacked. She becomes captivated, observing as Joe savors every bit of flavor from his gums. Parrish's attention is drawn to Joe's tie, now a disheveled batwing of silk hanging across his collarbone. Parrish, slightly taken aback, scrutinizes Joe with careful consideration. A silence follows as Joe mulls over a point in his mind, prompting Parrish to approach swiftly, expertly unfasten Joe's tie, and begin the process of retieing it. He completes the task with some effort, adjusting the tie meticulously so that it rests perfectly aligned on Joe's collar. Turning Joe towards a mirror, Parrish allows him to admire his reflection. Joe raises himself onto the balls of his feet, visibly impressed by his newfound appearance. They proceed through a bustling crowd, with Joe appearing at ease and acclimated to his surroundings, whereas Parrish exhibits an uncharacteristic discomfort. Words form and dissolve on Parrish's lips, his thoughts unvoiced until an abrupt outburst escapes him. Jennifer, in response, turns on her heel and makes her way back towards the office just as Parrish arrives at the threshold of the Board Room. He hesitates momentarily, offers a nod in concession, reaches out to grasp the doorknob, and enters the room, with Joe closely following behind him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Susan experiences a whirlwind of emotions—shock, embarrassment, pleasure, and conflict—as Joe, happily confounded, interacts with her without immediately answering her question, drawing a reaction from Drew. Joe rises to leave with Parrish but has a moment of uncertainty before following him out correctly. Parrish returns to the bedroom, where Joe tests the springs. Coyle sheepishly acknowledges his peanut butter, prompting Joe to toast the staff with it. In a stunning indoor Olympic pool area with skyline views, Susan swims laps in a professional black Speedo suit as Joe, still enjoying his peanut butter, observes her unnoticed until his shadow alerts her mid-turn. Susan climbs out of the pool and gestures toward the towels. Joe, balancing his peanut butter, eventually manages to present a towel to Susan after some maneuvering. He continues savoring his peanut butter until finished, awkwardly shifting the spoon before handing it to Susan, who places it on a table. She watches, fascinated, as Joe enjoys every last bit. Parrish, noticing Joe's disheveled tie, is taken aback and helps him retie it with some difficulty before spinning Joe toward a mirror, where Joe admires his improved appearance. They move confidently through the crowd, with Joe at ease but Parrish uncomfortable and hesitant until he suddenly blurts out. Jennifer promptly returns to the office as Parrish reaches the Board Room door, hesitates, acknowledges a point, and enters, with Joe right behind him."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She is shocked, embarrassed, pleased, and conflicted, experiencing an instant and wide spectrum of emotions akin to the tumultuous feelings often explored in classic literature, where characters grapple with complex internal struggles. Joe, who recently moved to this bustling city known for its fast-paced lifestyle, is happily confounded by all the interaction. Joe hears Susan's question, a common inquiry in office settings where clarity is crucial, but, as he studies her, doesn't answer. Drew reacts to this allusion of intimacy, reminiscent of scenes in romantic dramas where unspoken connections are palpable. Joe rises, follows Parrish, who is known for his meticulous attention to detail, to the door, and stops, then pivots and follows Parrish out the proper door. Parrish, a long-time resident fond of his morning routines, turns back to the bedroom. Joe tests the springs, similar to the way a quality control inspector would ensure the durability of a product. Coyle regards his peanut butter sheepishly, feeling a universal embarrassment over simple pleasures, and Joe raises the spoonful of peanut butter in a kind of toast to the staff, echoing the way celebratory toasts are made at social gatherings. A spectacular indoor Olympic pool, built as part of the facility's recent renovations to encourage employee wellness, with a window commands views of the skyline. Susan is swimming laps, looking very professional in a black Speedo suit, the preferred choice for competitive swimmers, and Joe wanders in, still licking his peanut butter. He observes her, but she is unaware of him; however, as she makes a barrel turn, a maneuver often used by experienced swimmers to maintain speed, his shadow falls over a reflection from a window, and she aborts her lap, looking up to see who it is. Susan climbs out of the pool, her training evident in her movements, gets halfway up the ladder, and points to a stack of luxurious towels provided by the management. Joe turns to the towels, but one hand is occupied with the spoonful of peanut butter; he shifts it to the other hand, can't manage the huge Turkish towel, known for its absorbency, one-handed, so he implants the spoon in his mouth, lifts the towel with both hands, and presents it to Susan. Joe continues to nibble at his peanut butter until he finishes the spoonful, reminiscent of a child savoring a favorite treat. He shifts the spoon from hand to hand, starts to stick it in his pocket, and realizes this is inappropriate, just as one might reconsider such an action in a formal setting. Susan holds her hand out to him, he places the spoon in it, and she sets the spoon on the table with the towels, a gesture of casual assistance common among colleagues. She watches, fascinated, as Joe licks his gums, enjoying every last bit of his spoonful, much like a gourmet savoring a delicate dessert. Parrish regards Joe, noticing the tie is a sorry mess now, a batwing of silk stretching across his collarbone, similar to the way a disheveled character might appear in a comedy. Parrish is startled and regards Joe carefully, a reaction akin to that of a mentor ensuring a protégé looks presentable. Silence follows as Joe considers the point, and Parrish quickly crosses to him, undoes the tie, and begins tying it for him, reminiscent of a father helping a son prepare for an important event. He completes the tying of Joe's tie with some difficulty, adjusts it beautifully on Joe's collar, then spins him around in front of a mirror, just as a stylist might do after a successful makeover. Joe, catching sight of his own appearance, rises to the balls of his feet, quite taken, as if seeing a new version of himself. They stride on, cutting through the crowd, with Joe all at home in his new surroundings, but Parrish just the opposite, uncharacteristically uncomfortable, phrases forming on his lips but unspoken, then suddenly he blurts out. Jennifer wheels and heads right back to the office, moving with the haste of someone on a tight schedule, as Parrish arrives at the door to the Board Room. Parrish hesitates, nods, conceding the point, a gesture often seen in diplomatic negotiations, reaches for the doorknob, and enters, with Joe following right behind him, ready for whatever unfolds next."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Joe hears Susan's question but as he studies her does not answer She is shocked embarrassed pleased and conflicted experiencing an instant and wide spectrum of emotions A spectacular indoor Olympic pool with a window commands views of the skyline Joe is happily confounded by all the interaction Parrish is startled and regards Joe carefully Joe hears Susan's question but as he studies her does not answer Drew reacts to this allusion of intimacy Joe rises follows Parrish to the door and stops then pivots and follows Parrish out the proper door Drew reacts to this allusion of intimacy She is shocked embarrassed pleased and conflicted experiencing an instant and wide spectrum of emotions he shifts it to the other hand cannot manage the huge Turkish towel onehanded so he implants the spoon in his mouth lifts the towel with both hands and presents it to Susan Parrish turns back to the bedroom Joe tests the springs Coyle regards his peanut butter sheepishly and Joe raises the spoonful of peanut butter in a kind of toast to the staff Coyle regards his peanut butter sheepishly and Joe raises the spoonful of peanut butter in a kind of toast to the staff A spectacular indoor Olympic pool with a window commands views of the skyline Joe rises follows Parrish to the door and stops then pivots and follows Parrish out the proper door Susan is swimming laps looking very professional in a black Speedo suit and Joe wanders in still licking his peanut butter He observes her but she is unaware of him however as she makes a barrel turn his shadow falls over a reflection from a window and she aborts her lap looking up to see who it is he places the spoon in it and she sets the spoon on the table with the towels Susan climbs out of the pool gets halfway up the ladder and points to a stack of towels Joe continues to nibble at his peanut butter until he finishes the spoonful Joe turns to the towels but one hand is occupied with the spoonful of peanut butter Joe catching sight of his own appearance rises to the balls of his feet quite taken he shifts it to the other hand cannot manage the huge Turkish towel onehanded so he implants the spoon in his mouth lifts the towel with both hands and presents it to Susan Joe continues to nibble at his peanut butter until he finishes the spoonful He shifts the spoon from hand to hand starts to stick it in his pocket and realizes this is inappropriate Susan holds her hand out to him They stride on cutting through the crowd with Joe all at home in his new surroundings but Parrish just the opposite uncharacteristically uncomfortable phrases forming on his lips but unspoken then suddenly he blurts out he places the spoon in it and she sets the spoon on the table with the towels She watches fascinated as Joe licks his gums enjoying every last bit of his spoonful Parrish regards Joe noticing the tie is a sorry mess now a batwing of silk stretching across his collarbone Silence follows as Joe considers the point and Parrish quickly crosses to him undoes the tie and begins tying it for him Jennifer wheels and heads right back to the office as Parrish arrives at the door to the Board Room Parrish is startled and regards Joe carefully Silence follows as Joe considers the point and Parrish quickly crosses to him undoes the tie and begins tying it for him He completes the tying of Joe's tie with some difficulty adjusts it beautifully on Joe's collar then spins him around in front of a mirror Joe catching sight of his own appearance rises to the balls of his feet quite taken They stride on cutting through the crowd with Joe all at home in his new surroundings but Parrish just the opposite uncharacteristically uncomfortable phrases forming on his lips but unspoken then suddenly he blurts out Jennifer wheels and heads right back to the office as Parrish arrives at the door to the Board Room Parrish hesitates nods conceding the point reaches for the doorknob and enters with Joe following right behind him"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She is shocked embarrassed pleased and conflicted experiencing an instant and wide spectrum of emotions. Joe is happily confounded by all the interaction. Joe hears Susan's question but as he studies her does not answer. Drew reacts to this allusion of intimacy. Joe rises follows Parrish to the door and stops then pivots and follows Parrish out the proper door. Parrish turns back to the bedroom. Joe tests the springs. Coyle regards his peanut butter sheepishly and Joe raises the spoonful of peanut butter in a kind of toast to the staff. A spectacular indoor Olympic pool with a window commands views of the skyline. Susan is swimming laps looking very professional in a black Speedo suit and Joe wanders in still licking his peanut butter. He observes her but she is unaware of him however as she makes a barrel turn his shadow falls over a reflection from a window and she aborts her lap looking up to see who it is. Susan climbs out of the pool gets halfway up the ladder and points to a stack of towels. Joe turns to the towels but one hand is occupied with the spoonful of peanut butter. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. he shifts it to the other hand cannot manage the huge Turkish towel onehanded so he implants the spoon in his mouth lifts the towel with both hands and presents it to Susan. Joe continues to nibble at his peanut butter until he finishes the spoonful. He shifts the spoon from hand to hand starts to stick it in his pocket and realizes this is inappropriate. Susan holds her hand out to him. he places the spoon in it and she sets the spoon on the table with the towels. She watches fascinated as Joe licks his gums enjoying every last bit of his spoonful. Parrish regards Joe noticing the tie is a sorry mess now a batwing of silk stretching across his collarbone. Parrish is startled and regards Joe carefully. Silence follows as Joe considers the point and Parrish quickly crosses to him undoes the tie and begins tying it for him. He completes the tying of Joe's tie with some difficulty adjusts it beautifully on Joe's collar then spins him around in front of a mirror. Joe catching sight of his own appearance rises to the balls of his feet quite taken. They stride on cutting through the crowd with Joe all at home in his new surroundings but Parrish just the opposite uncharacteristically uncomfortable phrases forming on his lips but unspoken then suddenly he blurts out. Jennifer wheels and heads right back to the office as Parrish arrives at the door to the Board Room. Parrish hesitates nods conceding the point reaches for the doorknob and enters with Joe following right behind him."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She is shocked embarrassed pleased and conflicted experiencing an instant and wide spectrum of emotions. Joe is happily confounded by all the interaction. Joe hears Susan's question but as he studies her does not answer. Drew reacts to this allusion of intimacy. Joe rises follows Parrish to the door and stops then pivots and follows Parrish out the proper door. Parrish turns back to the bedroom. Joe tests the springs. Coyle regards his peanut butter sheepishly and Joe raises the spoonful of peanut butter in a kind of toast to the staff. A spectacular indoor Olympic pool with a window commands views of the skyline. Susan is swimming laps looking very professional in a black Speedo suit and Joe wanders in still licking his peanut butter. He observes her but she is unaware of him however as she makes a barrel turn his shadow falls over a reflection from a window and she aborts her lap looking up to see who it is. Susan climbs out of the pool gets halfway up the ladder and points to a stack of towels. Joe turns to the towels but one hand is occupied with the spoonful of peanut butter. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. he shifts it to the other hand cannot manage the huge Turkish towel onehanded so he implants the spoon in his mouth lifts the towel with both hands and presents it to Susan. Joe continues to nibble at his peanut butter until he finishes the spoonful. He shifts the spoon from hand to hand starts to stick it in his pocket and realizes this is inappropriate. Susan holds her hand out to him. he places the spoon in it and she sets the spoon on the table with the towels. She watches fascinated as Joe licks his gums enjoying every last bit of his spoonful. Parrish regards Joe noticing the tie is a sorry mess now a batwing of silk stretching across his collarbone. Parrish is startled and regards Joe carefully. Silence follows as Joe considers the point and Parrish quickly crosses to him undoes the tie and begins tying it for him. He completes the tying of Joe's tie with some difficulty adjusts it beautifully on Joe's collar then spins him around in front of a mirror. Joe catching sight of his own appearance rises to the balls of his feet quite taken. They stride on cutting through the crowd with Joe all at home in his new surroundings but Parrish just the opposite uncharacteristically uncomfortable phrases forming on his lips but unspoken then suddenly he blurts out. Jennifer wheels and heads right back to the office as Parrish arrives at the door to the Board Room. Parrish hesitates nods conceding the point reaches for the doorknob and enters with Joe following right behind him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She is shocked embarrassed pleased and conflicted experiencing an instant and wide spectrum of emotions. Joe is happily confounded by all the interaction. Joe hears Susan's question but as he studies her does not answer. Drew reacts to this allusion of intimacy. Joe rises follows Parrish to the door and stops then pivots and follows Parrish out the proper door. Parrish turns back to the bedroom. Joe tests the springs. Parrish is startled and regards Joe carefully. Silence follows as Joe considers the point and Parrish quickly crosses to him undoes the tie and begins tying it for him. He completes the tying of Joe's tie with some difficulty adjusts it beautifully on Joe's collar then spins him around in front of a mirror. Joe catching sight of his own appearance rises to the balls of his feet quite taken. They stride on cutting through the crowd with Joe all at home in his new surroundings but Parrish just the opposite uncharacteristically uncomfortable phrases forming on his lips but unspoken then suddenly he blurts out. Jennifer wheels and heads right back to the office as Parrish arrives at the door to the Board Room. Parrish hesitates nods conceding the point reaches for the doorknob and enters with Joe following right behind him."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She is shocked embarrassed pleased and conflicted experiencing an instant and wide spectrum of emotions. Joe is happily confounded by all the interaction. Joe hears Susan's question but as he studies her does not answer. They stride on cutting through the crowd with Joe all at home in his new surroundings but Parrish just the opposite uncharacteristically uncomfortable phrases forming on his lips but unspoken then suddenly he blurts out. Jennifer wheels and heads right back to the office as Parrish arrives at the door to the Board Room. Parrish hesitates nods conceding the point reaches for the doorknob and enters with Joe following right behind him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She is shocked, embarrassed, pleased, and conflicted, experiencing an instant and wide spectrum of emotions. The cat is happily confounded by all the interaction. The cat hears Susan's question but, as the dog studies her, doesn't answer. The bird reacts to this allusion of intimacy. The cat rises, follows the rabbit to the door, and stops, then pivots and follows the rabbit out the proper door. The rabbit turns back to the bedroom. The cat tests the springs. The horse regards his peanut butter sheepishly, and the cat raises the spoonful of peanut butter in a kind of toast to the staff. A spectacular indoor Olympic pool with a window commands views of the skyline. Susan is swimming laps, looking very professional in a black Speedo suit, and the cat wanders in, still licking his peanut butter. The cat observes her, but she is unaware of him; however, as she makes a barrel turn, his shadow falls over a reflection from a window, and she aborts her lap, looking up to see who it is. Susan climbs out of the pool, gets halfway up the ladder, and points to a stack of towels. The cat turns to the towels, but one hand is occupied with the spoonful of peanut butter; the cat shifts it to the other hand, can't manage the huge Turkish towel one-handed, so the cat implants the spoon in his mouth, lifts the towel with both hands, and presents it to Susan. The cat continues to nibble at his peanut butter until he finishes the spoonful. He shifts the spoon from hand to hand, starts to stick it in his pocket, and realizes this is inappropriate. Susan holds her hand out to him, he places the spoon in it, and she sets the spoon on the table with the towels. She watches, fascinated, as the cat licks his gums, enjoying every last bit of his spoonful. The rabbit regards the cat, noticing the tie is a sorry mess now, a batwing of silk stretching across his collarbone. The rabbit is startled and regards the cat carefully. Silence follows as the cat considers the point, and the rabbit quickly crosses to him, undoes the tie, and begins tying it for him. He completes the tying of the cat's tie with some difficulty, adjusts it beautifully on the cat's collar, then spins the cat around in front of a mirror. The cat, catching sight of his own appearance, rises to the balls of his feet, quite taken. They stride on, cutting through the crowd, with the cat all at home in his new surroundings, but the rabbit just the opposite, uncharacteristically uncomfortable, phrases forming on his lips but unspoken, then suddenly he blurts out. The fox wheels and heads right back to the office as the rabbit arrives at the door to the Board Room. The rabbit hesitates, nods, conceding the point, reaches for the doorknob, and enters, with the cat following right behind him."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She is shocked, embarrassed, pleased, and conflicted, experiencing an instant and wide spectrum of emotions. Joe is happily confounded by all the interaction. Joe hears Susan's question but, as he studies her, doesn't answer. Drew reacts to this allusion of intimacy. Joe rises, follows Parrish to the window, and stops, then pivots and follows Parrish out the proper portal. Parrish turns back to the attic. Joe tests the cushions. Coyle regards his jelly sheepishly, and Joe raises the bowl of jelly in a kind of toast to the staff. A spectacular indoor tennis court with a skylight commands views of the hills. Susan is jogging laps, looking very professional in a black Adidas tracksuit, and Joe wanders in, still licking his jelly. He observes her, but she is unaware of him; however, as she makes a spin turn, his shadow falls over a reflection from a mirror, and she aborts her lap, looking up to see who it is. Susan climbs out of the court, gets halfway up the steps, and points to a stack of jerseys. Joe turns to the jerseys, but one hand is occupied with the bowl of jelly; he shifts it to the other hand, can't manage the huge woolen jersey one-handed, so he implants the bowl in his mouth, lifts the jersey with both hands, and presents it to Susan. Joe continues to nibble at his jelly until he finishes the bowl. He shifts the bowl from hand to hand, starts to stick it in his pocket, and realizes this is inappropriate. Susan holds her hand out to him, he places the bowl in it, and she sets the bowl on the shelf with the jerseys. She watches, fascinated, as Joe licks his gums, enjoying every last bit of his bowlful. Parrish regards Joe, noticing the belt is a sorry mess now, a batwing of leather stretching across his collarbone. Parrish is startled and regards Joe carefully. Silence follows as Joe considers the point, and Parrish quickly crosses to him, undoes the belt, and begins tying it for him. He completes the tying of Joe's belt with some difficulty, adjusts it beautifully on Joe's waist, then spins him around in front of a mirror. Joe, catching sight of his own appearance, rises to the balls of his feet, quite taken. They stride on, cutting through the vegetation, with Joe all at home in his new surroundings, but Parrish just the opposite, uncharacteristically uncomfortable, phrases forming on his lips but unspoken, then suddenly he blurts out. Jennifer wheels and heads right back to the cafeteria as Parrish arrives at the door to the Library. Parrish hesitates, nods, conceding the point, reaches for the handle, and enters, with Joe following right behind him."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She is shocked, embarrassed, pleased, and conflicted, experiencing an instant and wide spectrum of emotions. Joe is happily perplexed by all the interaction. Joe overhears Susan's question but, as he examines her, doesn't respond. Drew reacts to this suggestion of closeness. Joe stands, trails Parrish to the door, and pauses, then swivels and chases Parrish through the appropriate door. Parrish returns to the bedroom. Joe checks the springs. Coyle stares at his peanut butter sheepishly, and Joe lifts the spoonful of peanut butter in a kind of salute to the staff. A spectacular indoor Olympic pool with a window dominates views of the skyline. Susan is floating laps, looking very professional in a black Speedo suit, and Joe strolls in, still savoring his peanut butter. He watches her, but she is oblivious to him; however, as she performs a barrel turn, his silhouette casts over a reflection from a window, and she halts her lap, glancing up to see who it is. Susan climbs out of the pool, gets halfway up the ladder, and gestures to a stack of towels. Joe glances at the towels, but one hand is engaged with the spoonful of peanut butter; he shifts it to the other hand, can't manage the huge Turkish towel one-handed, so he positions the spoon in his mouth, hoists the towel with both hands, and offers it to Susan. Joe continues to nibble at his peanut butter until he finishes the spoonful. He transfers the spoon from hand to hand, starts to tuck it in his pocket, and realizes this is unsuitable. Susan extends her hand to him, he places the spoon in it, and she lays the spoon on the table with the towels. She observes, fascinated, as Joe licks his gums, savoring every last bit of his spoonful. Parrish observes Joe, noticing the tie is a sorry mess now, a batwing of silk stretching across his collarbone. Parrish is surprised and examines Joe carefully. Silence ensues as Joe ponders the point, and Parrish swiftly approaches him, removes the tie, and begins tying it for him. He completes the tying of Joe's tie with some difficulty, arranges it neatly on Joe's collar, then twirls him around in front of a mirror. Joe, seeing his own reflection, rises to the tips of his toes, quite impressed. They walk on, weaving through the crowd, with Joe feeling at home in his new environment, but Parrish just the opposite, uncharacteristically uneasy, expressions forming on his lips but unvoiced, then suddenly he blurts out. Jennifer pivots and heads directly back to the office as Parrish reaches the door to the Board Room. Parrish dithers, acknowledges, conceding the point, reaches for the doorknob, and steps in, with Joe trailing right behind him."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The mailbox is shocked, embarrassed, pleased, and conflicted, experiencing an instant and wide spectrum of emotions. The umbrella is happily confounded by all the interaction. The umbrella hears the stapler's question but, as it studies the stapler, doesn't answer. The telescope reacts to this allusion of intimacy. The umbrella rises, follows the suitcase to the door, and stops, then pivots and follows the suitcase out the proper door. The suitcase turns back to the bedroom. The umbrella tests the springs. The pencil regards its jelly sheepishly, and the umbrella raises the spoonful of jelly in a kind of toast to the backpack. A spectacular indoor Olympic garden with a chair commands views of the skyline. The stapler is swimming laps, looking very professional in a black Speedo suit, and the umbrella wanders in, still licking its jelly. It observes the stapler, but the stapler is unaware of it; however, as the stapler makes a barrel turn, its shadow falls over a reflection from a chair, and the stapler aborts its lap, looking up to see who it is. The stapler climbs out of the garden, gets halfway up the ladder, and points to a stack of books. The umbrella turns to the books, but one hand is occupied with the spoonful of jelly; it shifts it to the other hand, can't manage the huge Turkish book one-handed, so it implants the spoon in its mouth, lifts the book with both hands, and presents it to the stapler. The umbrella continues to nibble at its jelly until it finishes the spoonful. It shifts the spoon from hand to hand, starts to stick it in its pocket, and realizes this is inappropriate. The stapler holds its hand out to it, it places the spoon in it, and the stapler sets the spoon on the table with the books. The stapler watches, fascinated, as the umbrella licks its gums, enjoying every last bit of its spoonful. The suitcase regards the umbrella, noticing the pancake is a sorry mess now, a batwing of silk stretching across its collarbone. The suitcase is startled and regards the umbrella carefully. Silence follows as the umbrella considers the point, and the suitcase quickly crosses to it, undoes the pancake, and begins tying it for it. It completes the tying of the umbrella's pancake with some difficulty, adjusts it beautifully on the umbrella's collar, then spins it around in front of a mirror. The umbrella, catching sight of its own appearance, rises to the balls of its feet, quite taken. They stride on, cutting through the crowd, with the umbrella all at home in its new surroundings, but the suitcase just the opposite, uncharacteristically uncomfortable, phrases forming on its lips but unspoken, then suddenly it blurts out. The couch wheels and heads right back to the garage as the suitcase arrives at the door to the Board Room. The suitcase hesitates, nods, conceding the point, reaches for the doorknob, and enters, with the umbrella following right behind it."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She is bewildered, flustered, amused, and uncertain, experiencing a swift and broad array of feelings. Tom is joyfully mystified by all the engagement. Tom detects Lily's inquiry but, as he examines her, doesn't reply. Alex responds to this hint of closeness. Tom ascends, trails after Riley to the doorway, and halts, then rotates and accompanies Riley out the designated exit. Riley returns back to the living room. Tom inspects the hinges. Morgan observes his jelly sheepishly, and Tom elevates the spoonful of jelly in a sort of salute to the team. A striking indoor Olympic pool with a window showcases views of the cityscape. Lily is diving expertly, looking very adept in a red Speedo suit, and Tom meanders in, still savoring his jelly. He watches her, but she is oblivious to him; however, as she performs a flip turn, his outline falls over a reflection from a window, and she halts her dive, glancing up to see who it is. Lily ascends from the pool, gets halfway up the ladder, and gestures to a pile of towels. Tom moves to the towels, but one hand is occupied with the spoonful of jelly; he transfers it to the other hand, can't handle the vast Turkish towel single-handedly, so he places the spoon in his mouth, lifts the towel with both hands, and hands it to Lily. Tom continues to nibble at his jelly until he consumes the spoonful. He transfers the spoon from hand to hand, starts to tuck it in his pocket, and realizes this is unsuitable. Lily extends her hand out to him, he places the spoon in it, and she places the spoon on the table with the towels. She observes, intrigued, as Tom licks his teeth, savoring every last trace of his spoonful. Riley regards Tom, noticing the tie is a disheveled mess now, a strip of fabric draping across his neck. Riley is taken aback and examines Tom carefully. Quiet ensues as Tom ponders the notion, and Riley swiftly approaches him, loosens the tie, and starts fixing it for him. He completes the knotting of Tom's tie with some effort, arranges it neatly on Tom's neck, then spins him around in front of a mirror. Tom, glimpsing his own reflection, rises to the tips of his toes, quite impressed. They march on, weaving through the throng, with Tom completely at ease in his new environment, but Riley just the opposite, unexpectedly uneasy, words forming on his lips but left unspoken, then suddenly he exclaims. Melissa spins and heads directly back to the office as Riley reaches the entrance to the Conference Room. Riley pauses, nods, acknowledging the idea, reaches for the knob, and steps in, with Tom trailing closely behind him."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She is startled, mortified, delighted, and puzzled, experiencing a sudden and wide range of sensations. Joe is joyfully bewildered by all the commotion. Joe notices Susan's inquiry but, as he gazes at her, doesn't respond. Drew flinches at this suggestion of closeness. Joe ascends, trails Parrish to the window, and pauses, then swivels and trails Parrish out the correct window. Parrish rotates back to the bathroom. Joe inspects the cushions. Coyle regards his jelly sheepishly, and Joe hoists the scoop of jelly in a kind of salute to the staff. A magnificent indoor bowling alley with a mirror offers views of the horizon. Susan is jogging circles, looking very professional in a black Nike suit, and Joe ambles in, still tasting his jelly. He watches her, but she is unaware of him; however, as she executes a sharp turn, his shadow falls over a reflection from a mirror, and she abandons her track, glancing up to see who it is. Susan leaps out of the track, gets halfway up the ladder, and gestures to a stack of napkins. Joe turns to the napkins, but one hand is occupied with the scoop of jelly; he transfers it to the other hand, can't grasp the massive cotton napkin one-handed, so he places the scoop in his mouth, lifts the napkin with both hands, and offers it to Susan. Joe continues to savor his jelly until he empties the scoop. He moves the scoop from hand to hand, starts to tuck it in his pocket, and realizes this is inappropriate. Susan extends her hand to him, he places the scoop in it, and she sets the scoop on the table with the napkins. She observes, intrigued, as Joe licks his lips, relishing every last bit of his scoop. Parrish regards Joe, noticing the scarf is a sorry mess now, a ribbon of satin stretching across his neckline. Parrish is astonished and scrutinizes Joe attentively. Quiet follows as Joe considers the matter, and Parrish quickly strides to him, removes the scarf, and begins wrapping it for him. He completes the wrapping of Joe's scarf with some difficulty, adjusts it perfectly on Joe's neckline, then twirls him around in front of a painting. Joe, catching sight of his own reflection, stands on the tips of his toes, quite impressed. They march on, weaving through the assembly, with Joe completely at ease in his new environment, but Parrish just the reverse, unusually awkward, words forming on his lips but left unsaid, then suddenly he exclaims. Jennifer spins and heads right back to the workshop as Parrish approaches the entrance to the Conference Room. Parrish pauses, nods, admitting the point, reaches for the handle, and enters, with Joe trailing right behind him."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "He is astonished, mortified, thrilled, and torn, undergoing a sudden and broad range of sensations. Mark is joyfully bewildered by all the commotion. Mark notices Linda's inquiry but, as he examines her, doesn't respond. Alex reacts to this hint of closeness. Mark ascends, trails Spencer to the window, and pauses, then spins and trails Spencer out the correct window. Spencer rotates back to the kitchen. Mark tests the cushions. Taylor regards his jelly bashfully, and Mark lifts the forkful of jelly in a kind of salute to the team. A magnificent indoor bowling alley with a curtain offers views of the harbor. Linda is jogging laps, looking very athletic in a red Nike suit, and Mark meanders in, still biting his jelly. He watches her, but she is oblivious to him; however, as she makes a twirl turn, his silhouette falls over a reflection from a curtain, and she halts her jog, looking down to see who it is. Linda climbs out of the alley, gets halfway up the stairs, and gestures to a pile of napkins. Mark turns to the napkins, but one hand is engaged with the forkful of jelly; he switches it to the other hand, can't handle the giant Egyptian napkin one-handed, so he embeds the fork in his mouth, lifts the napkin with both hands, and offers it to Linda. Mark continues to munch at his jelly until he finishes the forkful. He shifts the fork from hand to hand, starts to tuck it in his shoe, and realizes this is unsuitable. Linda extends her hand to him, he places the fork in it, and she sets the fork on the chair with the napkins. She observes, intrigued, as Mark licks his teeth, savoring every last bit of his forkful. Spencer regards Mark, noting the scarf is a pitiful mess now, a ribbon of wool stretching across his shoulder. Spencer is surprised and regards Mark intently. Quiet ensues as Mark ponders the issue, and Spencer swiftly crosses to him, untangles the scarf, and starts adjusting it for him. He completes the adjusting of Mark's scarf with some challenge, arranges it neatly on Mark's shoulder, then twirls him around in front of a picture. Mark, glimpsing his own reflection, stands on the tips of his shoes, quite charmed. They march on, weaving through the throng, with Mark all settled in his new environment, but Spencer quite the contrary, atypically ill at ease, phrases forming on his tongue but unspoken, then abruptly he exclaims. Rachel rolls and heads left back to the classroom as Spencer arrives at the entrance to the Lounge. Spencer stalls, nods, yielding the argument, reaches for the handle, and steps in, with Mark trailing right after him."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The narrative unfolds with a blend of emotions as Joe and Susan interact, leading to moments of personal revelation and connection. Joe is intrigued yet bemused by their interaction, particularly when Susan, swimming in an Olympic pool, notices his presence through his reflection. They share a brief yet telling moment over a towel, revealing their subtle bond. Joe's awkwardness with a spoonful of peanut butter adds a humorous touch, balanced by Parrish's careful assistance in fixing Joe's tie, adjusting it expertly. Amidst a bustling environment, Joe appears at ease, in contrast to Parrish's discomfort. As they approach the Board Room, Parrish seems hesitant but ultimately enters, with Joe following confidently."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Parrish hesitates nods conceding the point reaches for the doorknob and enters with Joe following right behind him Jennifer wheels and heads right back to the office as Parrish arrives at the door to the Board Room They stride on cutting through the crowd with Joe all at home in his new surroundings but Parrish just the opposite uncharacteristically uncomfortable phrases forming on his lips but unspoken then suddenly he blurts out Joe catching sight of his own appearance rises to the balls of his feet quite taken He completes the tying of Joe's tie with some difficulty adjusts it beautifully on Joe's collar then spins him around in front of a mirror Silence follows as Joe considers the point and Parrish quickly crosses to him undoes the tie and begins tying it for him Parrish is startled and regards Joe carefully Parrish regards Joe noticing the tie is a sorry mess now a batwing of silk stretching across his collarbone She watches fascinated as Joe licks his gums enjoying every last bit of his spoonful he places the spoon in it and she sets the spoon on the table with the towels Susan holds her hand out to him He shifts the spoon from hand to hand starts to stick it in his pocket and realizes this is inappropriate Joe continues to nibble at his peanut butter until he finishes the spoonful he shifts it to the other hand cannot manage the huge Turkish towel onehanded so he implants the spoon in his mouth lifts the towel with both hands and presents it to Susan Joe turns to the towels but one hand is occupied with the spoonful of peanut butter Susan climbs out of the pool gets halfway up the ladder and points to a stack of towels He observes her but she is unaware of him however as she makes a barrel turn his shadow falls over a reflection from a window and she aborts her lap looking up to see who it is Susan is swimming laps looking very professional in a black Speedo suit and Joe wanders in still licking his peanut butter A spectacular indoor Olympic pool with a window commands views of the skyline Coyle regards his peanut butter sheepishly and Joe raises the spoonful of peanut butter in a kind of toast to the staff Joe tests the springs Parrish turns back to the bedroom Joe rises follows Parrish to the door and stops then pivots and follows Parrish out the proper door Drew reacts to this allusion of intimacy Joe hears Susan's question but as he studies her does not answer Joe is happily confounded by all the interaction She is shocked embarrassed pleased and conflicted experiencing an instant and wide spectrum of emotions"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Susan holds her hand out to him Joe turns to the towels but one hand is occupied with the spoonful of peanut butter Susan is swimming laps looking very professional in a black Speedo suit and Joe wanders in still licking his peanut butter Parrish hesitates nods conceding the point reaches for the doorknob and enters with Joe following right behind him Parrish regards Joe noticing the tie is a sorry mess now a batwing of silk stretching across his collarbone Joe tests the springs Parrish turns back to the bedroom He observes her but she is unaware of him however as she makes a barrel turn his shadow falls over a reflection from a window and she aborts her lap looking up to see who it is He shifts the spoon from hand to hand starts to stick it in his pocket and realizes this is inappropriate He completes the tying of Joe's tie with some difficulty adjusts it beautifully on Joe's collar then spins him around in front of a mirror Susan climbs out of the pool gets halfway up the ladder and points to a stack of towels She watches fascinated as Joe licks his gums enjoying every last bit of his spoonful Joe is happily confounded by all the interaction Joe continues to nibble at his peanut butter until he finishes the spoonful They stride on cutting through the crowd with Joe all at home in his new surroundings but Parrish just the opposite uncharacteristically uncomfortable phrases forming on his lips but unspoken then suddenly he blurts out he shifts it to the other hand cannot manage the huge Turkish towel onehanded so he implants the spoon in his mouth lifts the towel with both hands and presents it to Susan Joe hears Susan's question but as he studies her does not answer he places the spoon in it and she sets the spoon on the table with the towels Jennifer wheels and heads right back to the office as Parrish arrives at the door to the Board Room Joe rises follows Parrish to the door and stops then pivots and follows Parrish out the proper door Silence follows as Joe considers the point and Parrish quickly crosses to him undoes the tie and begins tying it for him Coyle regards his peanut butter sheepishly and Joe raises the spoonful of peanut butter in a kind of toast to the staff A spectacular indoor Olympic pool with a window commands views of the skyline Joe catching sight of his own appearance rises to the balls of his feet quite taken She is shocked embarrassed pleased and conflicted experiencing an instant and wide spectrum of emotions Drew reacts to this allusion of intimacy Parrish is startled and regards Joe carefully"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Joe continues to nibble at his peanut butter until he finishes the spoonful He shifts the spoon from hand to hand starts to stick it in his pocket and realizes this is inappropriate Susan holds her hand out to him he places the spoon in it and she sets the spoon on the table with the towels She watches fascinated as Joe licks his gums enjoying every last bit of his spoonful Parrish regards Joe noticing the tie is a sorry mess now a batwing of silk stretching across his collarbone Parrish is startled and regards Joe carefully Silence follows as Joe considers the point and Parrish quickly crosses to him undoes the tie and begins tying it for him He completes the tying of Joe's tie with some difficulty adjusts it beautifully on Joe's collar then spins him around in front of a mirror Joe catching sight of his own appearance rises to the balls of his feet quite taken They stride on cutting through the crowd with Joe all at home in his new surroundings but Parrish just the opposite uncharacteristically uncomfortable phrases forming on his lips but unspoken then suddenly he blurts out Jennifer wheels and heads right back to the office as Parrish arrives at the door to the Board Room Parrish hesitates nods conceding the point reaches for the doorknob and enters with Joe following right behind him She is shocked embarrassed pleased and conflicted experiencing an instant and wide spectrum of emotions Joe is happily confounded by all the interaction Joe hears Susan's question but as he studies her does not answer Drew reacts to this allusion of intimacy Joe rises follows Parrish to the door and stops then pivots and follows Parrish out the proper door Parrish turns back to the bedroom Joe tests the springs Coyle regards his peanut butter sheepishly and Joe raises the spoonful of peanut butter in a kind of toast to the staff A spectacular indoor Olympic pool with a window commands views of the skyline Susan is swimming laps looking very professional in a black Speedo suit and Joe wanders in still licking his peanut butter He observes her but she is unaware of him however as she makes a barrel turn his shadow falls over a reflection from a window and she aborts her lap looking up to see who it is Susan climbs out of the pool gets halfway up the ladder and points to a stack of towels Joe turns to the towels but one hand is occupied with the spoonful of peanut butter he shifts it to the other hand cannot manage the huge Turkish towel onehanded so he implants the spoon in his mouth lifts the towel with both hands and presents it to Susan"
        }
      ]
    }
  ]
}