{
  "ground_truth": "Escobar steps between the two, while Gittes takes a deep breath. The scene widens to include Escobar, Gittes, and two plainclothesmen, who are staring at the empty pipe as if expecting it to speak, as a trickle of water drops into the ocean. A third assistant runs down the side of the cliff over to Escobar. Escobar turns to Gittes and stares at him for a long moment with hatred. Gittes rings the doorbell and, scarcely waiting for an answer, tries the door, but it is locked. He reaches into his pocket, pulls out his cigarette case, takes a pick out of the side, and starts to manipulate the lock. The maid opens the door abruptly and stares in surprise at Gittes. Gittes, in Mulwray's Buick, whips into the driveway and pushes past. Evelyn, looking a little worn but glad to see him, hurries to the door, takes his arm, and stares at him, searching his face. Gittes looks around and sees clothes laid out for packing in a bedroom off the living room. He goes to the phone and dials, then takes the handkerchief out of his breast pocket, unfolding it on a coffee table to reveal the bifocal glasses, one lens still intact. Evelyn stares dumbly at them, trembling, and gets up as Gittes, charged with anger, shakes her. As his anger explodes, Gittes smiles and hits her full in the face. Evelyn stares back at him; the blow forces tears from her eyes, but she doesn't move or defend herself. Gittes slaps her repeatedly, finally knocking her into a cheap Chinese vase that shatters as she collapses on the sofa, sobbing. Kyo comes running down the stairs, momentarily stares at Gittes, then turns and goes back upstairs. Gittes picks up the glasses and, momentarily lost in them, stares at the lens. From the stairs, Evelyn, with her arm around Katherine, hurries the girl toward the bedroom while talking in Spanish. Evelyn re-emerges, and he nods slowly. Gittes hangs up and goes to the door, opens it, and finds Escobar and his minions appearing from either side of the doorway. A steep hill overlooks part of the harbor, where Escobar's unmarked car pulls up to a stop in front of a Spanish duplex perched on the steep hillside. Escobar shakes his head as Gittes gets out of the car, glances around, and goes up the stairs.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Escobar steps among the two, while Gittes takes a deep inhalation. The scene enlarges to incorporate Escobar, Gittes, and two plainclothesmen, who are staring at the vacant conduit as if anticipating it to speak, as a rivulet of liquid drips into the ocean. A third aide runs down the side of the precipice over to Escobar. Escobar turns to Gittes and glares at him for a lengthy instant with animosity. Gittes rings the chime and, scarcely awaiting a reply, tries the entrance, but it is barred. He reaches into his pocket, extracts his cigarette case, takes a pick out of the side, and starts to manipulate the lock. The servant opens the door abruptly and stares in astonishment at Gittes. Gittes, in Mulwray's Buick, whips into the driveway and pushes past. Evelyn, appearing a little worn but glad to see him, hurries to the door, takes his arm, and stares at him, searching his face. Gittes looks around and sees garments laid out for packing in a bedroom off the living room. He goes to the phone and dials, then takes the handkerchief out of his breast pocket, unfolding it on a coffee table to reveal the bifocal spectacles, one lens still intact. Evelyn stares dumbly at them, trembling, and gets up as Gittes, charged with fury, shakes her. As his ire explodes, Gittes smiles and hits her full in the visage. Evelyn stares back at him; the strike forces tears from her eyes, but she doesn't move or defend herself. Gittes slaps her repeatedly, finally knocking her into a cheap Chinese urn that shatters as she collapses on the sofa, sobbing. Kyo comes sprinting down the stairs, momentarily stares at Gittes, then turns and goes back upstairs. Gittes picks up the spectacles and, momentarily lost in them, stares at the lens. From the stairs, Evelyn, with her arm around Katherine, hurries the girl toward the bedroom while speaking in Spanish. Evelyn re-emerges, and he nods slowly. Gittes hangs up and goes to the door, opens it, and finds Escobar and his minions appearing from either side of the threshold. A steep hill overlooks part of the harbor, where Escobar's unmarked vehicle pulls up to a halt in front of a Spanish duplex perched on the steep hillside. Escobar shakes his head as Gittes gets out of the vehicle, glances around, and goes up the stairs."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Escobar steps between the two, while a deep breath is taken by Gittes. The scene is widened to include Escobar, Gittes, and two plainclothesmen, who stare at the empty pipe as if expecting it to speak, as a trickle of water is dropped into the ocean. A third assistant runs down the side of the cliff over to Escobar. Gittes is turned to by Escobar and stared at for a long moment with hatred. The doorbell is rung by Gittes and, scarcely waiting for an answer, the door is tried by him, but it is locked. A pick is taken out of the side by him after reaching into his pocket, pulling out his cigarette case, and he starts to manipulate the lock. The maid opens the door abruptly and stares in surprise at him. In Mulwray's Buick, the driveway is whipped into by Gittes, and past is pushed by him. Evelyn, looking a little worn but glad to see him, hurries to the door, takes his arm, and searches his face with a stare. Clothes laid out for packing in a bedroom off the living room are seen by Gittes as he looks around. The phone is gone to by him and dialed, then the handkerchief is taken out of his breast pocket and unfolded on a coffee table to reveal the bifocal glasses, with one lens still intact. Evelyn stares dumbly at them, trembling, and gets up as she is shaken by Gittes, charged with anger. As his anger explodes, a smile forms on Gittes' face, and she is hit full in the face by him. Evelyn stares back at him; the blow forces tears from her eyes, but she doesn't move or defend herself. She is slapped repeatedly by Gittes, finally knocked into a cheap Chinese vase that is shattered as she collapses on the sofa, sobbing. Kyo comes running down the stairs, stares momentarily at Gittes, then turns and goes back upstairs. The glasses are picked up by Gittes and stared at the lens momentarily, lost in them. From the stairs, Evelyn, with her arm around Katherine, hurries the girl toward the bedroom while talking in Spanish. Evelyn re-emerges, and he nods slowly. The phone is hung up by Gittes, and he goes to the door, opens it, and finds Escobar and his minions appearing from either side of the doorway. A steep hill overlooks part of the harbor, where Escobar pulls up his unmarked car to a stop in front of a Spanish duplex perched on the steep hillside. Gittes gets out of the car, glances around, and goes up the stairs, as his head is shaken by Escobar."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Escobar positions himself between the two as Gittes breathes deeply. The scene expands to include Escobar, Gittes, and two detectives staring at an empty pipe, anticipating a message, as water trickles into the ocean. A third assistant approaches Escobar. Escobar glares hatefully at Gittes. Gittes rings a doorbell and attempts the locked door. He retrieves a pick from his cigarette case to unlock it. The maid opens the door and is surprised to see him. Gittes hurriedly parks Mulwray's Buick and enters. Evelyn, looking tired but pleased, welcomes him, searching his face. Gittes notices clothes in a bedroom off the living room. He dials the phone and unveils bifocal glasses from his pocket. Evelyn, trembling, stares at the glasses as Gittes, angry, shakes her. Gittes smirks and hits her, tears streaming from her eyes. He slaps her until she falls into a vase, breaking it as she collapses, sobbing. Kyo briefly looks at Gittes, then retreats upstairs. Gittes picks up the glasses, lost in thought. Evelyn, with Katherine, hurries toward the bedroom speaking Spanish. Evelyn returns, and Gittes nods. Gittes opens the door, finding Escobar and his men at the entrance. A steep hill overlooks the harbor where Escobar's car stops in front of a Spanish duplex. Escobar shakes his head as Gittes exits and ascends the stairs."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Escobar steps between Gittes and two plainclothesmen, who stare at an empty pipe with dripping water. A third assistant runs to Escobar, who glares at Gittes. Gittes rings the doorbell, tries the locked door, uses a pick from his cigarette case, but the maid opens it abruptly, surprised. In Mulwray's Buick, Gittes arrives, Evelyn greets him, and he sees clothes laid out. Gittes dials the phone, reveals bifocal glasses on a table, angering Evelyn. Gittes angrily shakes and slaps her, knocking her into a vase. Kyo runs downstairs, sees Gittes, then retreats. Gittes picks up the glasses, lost in thought, as Evelyn ushers Katherine upstairs. Gittes opens the door, finding Escobar and his men. Escobar's car stops at a Spanish duplex; he shakes his head as Gittes exits and climbs the stairs."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Escobar decisively steps in between the two individuals, as Gittes takes a deep, steadying breath. The camera angle widens to capture the presence of Escobar, Gittes, and two other men dressed in plainclothes, who are intently staring at the empty pipe, almost as if they expect it to start speaking, as they watch a trickle of water drop down into the vast ocean below. A third assistant hurriedly makes his way down the side of the steep cliff over to where Escobar is standing. Escobar shifts his focus to Gittes, fixing him with a long, unwavering stare filled with visible hatred. With determination, Gittes approaches a doorbell and rings it, scarcely waiting for any response, before attempting to open the door himself, only to find it securely locked. Not deterred, he reaches into his pocket, retrieves his elegant cigarette case, and skillfully extracts a pick from its side, beginning to manipulate the lock with practiced precision. Suddenly, the door swings open abruptly, revealing a maid who stares at Gittes with surprise etched on her face.  \n\nIn Mulwray's grand Buick, Gittes expertly whips into the driveway and pushes his way forward. Evelyn appears, looking somewhat worn out, yet she is visibly pleased to see him. She hurries to the door, takes his arm with familiarity, and gazes intently at him, searching his face for clues. As Gittes surveys his surroundings, he notices clothes neatly laid out for packing in a bedroom that branches off from the living room. He moves to the telephone, dials a number, and then takes a handkerchief from his breast pocket, carefully unfolding it on a nearby coffee table to reveal a pair of bifocal glasses, with one lens still intact. Evelyn stares at them dumbly, trembling as Gittes, his anger simmering, roughly shakes her. As his anger reaches a boiling point, he forces a smile and strikes her full in the face. Evelyn meets his gaze; the impact of the blow forces tears from her eyes, yet she does not move to defend herself. Gittes slaps her repeatedly, finally sending her reeling into a cheap Chinese vase, which shatters as she collapses onto the sofa, sobbing uncontrollably. Upstairs, Kyo comes running down, pausing briefly to stare at Gittes before turning to retreat back up the stairs. \n\nGittes methodically picks up the glasses, momentarily losing himself as he stares intently at the lens. From the staircase, Evelyn, with her arm protectively around Katherine, hurriedly escorts the girl toward the bedroom, speaking in Spanish. Evelyn re-emerges moments later, and Gittes nods slowly in response. He hangs up the phone and heads toward the door, opening it to find Escobar and his group of minions emerging from either side of the doorway, as if converging on him. A steep hill offers a vantage point overlooking part of the bustling harbor, where Escobar's unmarked vehicle pulls to a halt in front of a Spanish-style duplex precariously perched on the steep hillside. Escobar shakes his head disapprovingly as Gittes exits the car, takes a quick glance around at his surroundings, and resolutely makes his way up the stairs."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Escobar, with a sense of urgency and authority, decisively steps in between the two individuals, interrupting the tension-filled moment, while Gittes takes a deep, steadying breath to compose himself. The camera angle then widens dramatically to fully capture the scene, revealing the presence of Escobar, Gittes, and two other men dressed in plainclothes. These men are intently staring at the empty pipe with a look of expectation, almost as if they anticipate it to start speaking at any moment. Their gaze is fixed on the trickle of water as it drops down into the vast ocean below. Meanwhile, a third assistant hurriedly makes his way down the side of the steep, rocky cliff to where Escobar is resolutely standing. Escobar then shifts his intense focus to Gittes, fixing him with a long, unwavering stare that is filled with visible and palpable hatred. Determined and resolute, Gittes approaches a doorbell and rings it with purpose, scarcely waiting for any sort of response, before attempting to open the door himself, only to discover it securely locked. Not one to be easily deterred, he reaches into his pocket, retrieves his elegant cigarette case, and skillfully extracts a pick from its side. With practiced precision and stealth, he begins to manipulate the lock. Suddenly, the door swings open abruptly, revealing a maid who stares at Gittes with complete surprise etched across her face.\n\nIn the grand and imposing presence of Mulwray's luxurious Buick, Gittes expertly navigates into the driveway, pushing his way forward with determination. Evelyn appears on the scene, looking somewhat worn out and weary, yet she is visibly pleased to see him. She hurries to the door with urgency, takes his arm with a sense of familiarity, and gazes intently at him, searching his face for any clues or signs. As Gittes surveys his surroundings carefully, his attention is drawn to clothes that are neatly laid out for packing in a bedroom that branches off from the living room. He quickly moves to the telephone, dials a number, and then takes a handkerchief from his breast pocket. He carefully unfolds it on a nearby coffee table, revealing a pair of bifocal glasses with one lens still intact. Evelyn, watching the scene unfold, stares at them dumbly, trembling as Gittes, his anger simmering beneath the surface, roughly shakes her. As his anger reaches a boiling point, he forces a strained smile and strikes her full in the face. Evelyn meets his intense gaze; the impact of the blow forces tears from her eyes, yet she does not move to defend herself against the assault. Gittes slaps her repeatedly, finally sending her reeling into a cheap Chinese vase, which shatters noisily as she collapses onto the sofa, sobbing uncontrollably. Upstairs, Kyo comes running down the staircase, pausing briefly to stare at Gittes in shock before quickly turning to retreat back up the stairs.\n\nGittes methodically picks up the glasses from the coffee table, momentarily losing himself as he stares intently at the lens, as if searching for answers. From the staircase, Evelyn, with her arm protectively wrapped around Katherine, hurriedly escorts the girl toward the bedroom, speaking softly in Spanish. Evelyn then re-emerges moments later, and Gittes nods slowly in response, acknowledging the situation. He hangs up the phone and resolutely heads toward the door, opening it to find Escobar and his group of minions emerging ominously from either side of the doorway, as if converging on him with a sense of purpose. A steep hill offers a vantage point that overlooks part of the bustling harbor, where Escobar's unmarked vehicle pulls to a halt in front of a Spanish-style duplex precariously perched on the steep hillside. Escobar shakes his head disapprovingly, his expression stern, as Gittes exits the car, takes a quick glance around at his surroundings, and resolutely makes his determined way up the stairs."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Escobar positions himself between the two individuals as Gittes draws in a deep breath to steady himself. The perspective shifts, broadening to reveal the inclusion of Escobar, Gittes, and two plainclothesmen whose fixed gaze on the empty pipe suggests an anticipation of words, all while a single trickle of water quietly drips into the ocean below. Suddenly, a third assistant appears, descending rapidly down the side of the cliff to reach Escobar. With a slow turn, Escobar directs a long, hatred-filled stare at Gittes. Gittes proceeds to ring the doorbell, but with impatience clearly visible, he doesn’t linger for a response and instead tests the door, only to find it securely locked. With a calculated motion, he slides his hand into his pocket, retrieves a cigarette case, and skillfully extracts a pick from its side, using it to deftly manipulate the lock. At that instant, the door swings open abruptly, and the maid stands there, frozen in surprise at Gittes's presence. Driving Mulwray's Buick with practiced ease, Gittes swiftly maneuvers into the driveway and strides quickly ahead, brushing past obstacles. Evelyn appears, somewhat weary yet noticeably pleased to see him, hastily moves to the door, clasps his arm, and examines his face attentively. Observant, Gittes glances around, noticing clothes laid out for packing in an adjacent bedroom off the living room. He strides over to the phone, dials a number, then reaches into his breast pocket to withdraw a handkerchief, carefully unfolding it on the coffee table to expose the bifocal glasses, with one lens notably still intact. Evelyn, now trembling, stares at the glasses in stunned silence and rises to her feet just as Gittes, fueled by a rising anger, seizes her and shakes her vigorously. As his fury peaks, Gittes unexpectedly smiles before striking her hard across the face. Evelyn returns his gaze; the impact draws tears from her eyes, yet she remains motionless and does not attempt to defend herself. Gittes continues to slap her repeatedly until the force of the blows causes her to stumble against a delicate Chinese vase, which shatters upon impact as she collapses onto the sofa, sobbing. Kyo appears, descending the stairs in haste, pausing momentarily to stare at Gittes before deciding to retreat back upstairs. Gittes, meanwhile, picks up the glasses once more and becomes momentarily entranced by the intact lens. From the stairs, Evelyn, now accompanied by Katherine with her arm protectively around the girl, hastens toward the bedroom while speaking rapidly in Spanish. Evelyn then reappears, and Gittes acknowledges her with a slow nod. After concluding his call, Gittes crosses the room to the door, opens it, and finds himself face-to-face with Escobar and his men, who emerge from either side of the entrance. A steep hill offers a view over part of the harbor where, below, Escobar's unmarked car draws to a halt in front of a Spanish duplex precariously perched on the hillside’s edge. With a slight shake of his head, Escobar watches as Gittes exits the car, surveys his surroundings, and ascends the stairs with measured steps."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Escobar steps between the two men, as Gittes takes a moment to compose himself. The scene reveals Escobar, Gittes, and two plainclothesmen observing an empty pipe, with a third assistant hurrying over to Escobar. Escobar glares at Gittes with hatred. Gittes approaches a house, rings the doorbell, and attempts to unlock the door using a tool from his cigarette case, but is interrupted when the maid opens it, surprised. In Mulwray's Buick, Gittes arrives at a driveway and pushes past, where Evelyn, appearing worn yet relieved to see him, meets him at the door. She takes his arm, looking intently at him. Gittes notices clothes prepared for packing in a nearby bedroom and makes a call, displaying bifocal glasses with one intact lens from his handkerchief. Evelyn, visibly shaken, stands while Gittes, filled with anger, confronts her and physically assaults her until she falls into a vase, collapsing on the sofa in tears. Kyo briefly comes downstairs, observes, then retreats. Gittes, momentarily captivated by the glasses, watches Evelyn take Katherine upstairs while speaking in Spanish. Evelyn returns, and Gittes acknowledges her. He ends the call and opens the door to find Escobar and his men waiting. At a steep hill overlooking the harbor, Escobar's unmarked car arrives at a Spanish duplex, where Escobar disapprovingly shakes his head as Gittes exits the car, surveys the area, and ascends the stairs."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Escobar steps between the two, while Gittes, a private detective known for his unconventional methods, takes a deep breath. The scene widens to include Escobar, Gittes, and two plainclothesmen, who are staring at the empty pipe, a remnant of the Los Angeles water infrastructure that many suspect was manipulated for personal gain, as if expecting it to speak, as a trickle of water drops into the Pacific Ocean below. A third assistant, often tasked with delivering urgent messages, runs down the side of the cliff over to Escobar. Escobar turns to Gittes and stares at him for a long moment with hatred, a sentiment stemming from their previous confrontations over corruption cases. Gittes rings the doorbell of the grand old mansion and, scarcely waiting for an answer, tries the door, but it is locked. He reaches into his pocket, pulls out his cigarette case, a tool he often uses for unexpected purposes, takes a pick out of the side, and starts to manipulate the lock. The maid, accustomed to wealthy visitors but not to such audacious behavior, opens the door abruptly and stares in surprise at Gittes. Gittes, in Mulwray's Buick, a classic car that often draws attention, whips into the driveway and pushes past. Evelyn, whose family has been embroiled in a series of scandals, looking a little worn but glad to see him, hurries to the door, takes his arm, and stares at him, searching his face for reassurance. Gittes looks around and sees clothes laid out for packing in a bedroom off the living room, suggesting a hurried departure. He goes to the phone and dials, then takes the handkerchief out of his breast pocket, unfolding it on a coffee table to reveal the bifocal glasses, an incriminating piece of evidence in the ongoing investigation, one lens still intact. Evelyn stares dumbly at them, trembling, and gets up as Gittes, charged with anger over deceit and betrayal, shakes her. As his anger explodes, Gittes, uncharacteristically losing his composure, smiles and hits her full in the face. Evelyn, caught in a web of secrets and lies, stares back at him; the blow forces tears from her eyes, but she doesn't move or defend herself. Gittes slaps her repeatedly, finally knocking her into a cheap Chinese vase, a fragile decoration contrasting the wealth around them, that shatters as she collapses on the sofa, sobbing. Kyo, perhaps a family servant who is protective of Evelyn, comes running down the stairs, momentarily stares at Gittes, then turns and goes back upstairs. Gittes picks up the glasses and, momentarily lost in them as he contemplates the case's complexities, stares at the lens. From the stairs, Evelyn, with her arm around Katherine, a key figure in the family mystery, hurries the girl toward the bedroom while talking in Spanish, using the language to maintain privacy. Evelyn re-emerges, and he nods slowly, acknowledging the gravity of the situation. Gittes hangs up and goes to the door, opens it, and finds Escobar and his minions, officers loyal to his cause, appearing from either side of the doorway. A steep hill overlooks part of the harbor, the bustling hub of the city's trade, where Escobar's unmarked car pulls up to a stop in front of a Spanish duplex perched on the steep hillside. Escobar shakes his head as Gittes gets out of the car, glances around, and goes up the stairs, his mind already piecing together the next steps in the investigation."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Gittes rings the doorbell and scarcely waiting for an answer tries the door but it is locked Evelyn reemerges and he nods slowly Escobar steps between the two while Gittes takes a deep breath Escobar turns to Gittes and stares at him for a long moment with hatred The scene widens to include Escobar Gittes and two plainclothesmen who are staring at the empty pipe as if expecting it to speak as a trickle of water drops into the ocean A third assistant runs down the side of the cliff over to Escobar Escobar turns to Gittes and stares at him for a long moment with hatred Escobar steps between the two while Gittes takes a deep breath Evelyn looking a little worn but glad to see him hurries to the door takes his arm and stares at him searching his face Gittes rings the doorbell and scarcely waiting for an answer tries the door but it is locked He reaches into his pocket pulls out his cigarette case takes a pick out of the side and starts to manipulate the lock The maid opens the door abruptly and stares in surprise at Gittes A steep hill overlooks part of the harbor where Escobar's unmarked car pulls up to a stop in front of a Spanish duplex perched on the steep hillside Gittes in Mulwray's Buick whips into the driveway and pushes past Gittes looks around and sees clothes laid out for packing in a bedroom off the living room Evelyn looking a little worn but glad to see him hurries to the door takes his arm and stares at him searching his face Gittes looks around and sees clothes laid out for packing in a bedroom off the living room Gittes hangs up and goes to the door opens it and finds Escobar and his minions appearing from either side of the doorway He goes to the phone and dials then takes the handkerchief out of his breast pocket unfolding it on a coffee table to reveal the bifocal glasses one lens still intact Evelyn stares dumbly at them trembling and gets up as Gittes charged with anger shakes her Gittes in Mulwray's Buick whips into the driveway and pushes past As his anger explodes Gittes smiles and hits her full in the face Evelyn stares back at him Katherine hurries the girl toward the bedroom while talking in Spanish the blow forces tears from her eyes but she does not move or defend herself Gittes slaps her repeatedly finally knocking her into a cheap Chinese vase that shatters as she collapses on the sofa sobbing Kyo comes running down the stairs momentarily stares at Gittes then turns and goes back upstairs Gittes picks up the glasses and momentarily lost in them stares at the lens A third assistant runs down the side of the cliff over to Escobar The maid opens the door abruptly and stares in surprise at Gittes From the stairs Evelyn with her arm around Katherine hurries the girl toward the bedroom while talking in Spanish Evelyn reemerges and he nods slowly Gittes hangs up and goes to the door opens it and finds Escobar and his minions appearing from either side of the doorway A steep hill overlooks part of the harbor where Escobar's unmarked car pulls up to a stop in front of a Spanish duplex perched on the steep hillside Escobar shakes his head as Gittes gets out of the car glances around and goes up the stairs"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Escobar steps between the two while Gittes takes a deep breath. The scene widens to include Escobar Gittes and two plainclothesmen who are staring at the empty pipe as if expecting it to speak as a trickle of water drops into the ocean. A third assistant runs down the side of the cliff over to Escobar. Escobar turns to Gittes and stares at him for a long moment with hatred. Gittes rings the doorbell and scarcely waiting for an answer tries the door but it is locked. He reaches into his pocket pulls out his cigarette case takes a pick out of the side and starts to manipulate the lock. The maid opens the door abruptly and stares in surprise at Gittes. Gittes in Mulwray's Buick whips into the driveway and pushes past. Evelyn looking a little worn but glad to see him hurries to the door takes his arm and stares at him searching his face. Gittes looks around and sees clothes laid out for packing in a bedroom off the living room. He goes to the phone and dials then takes the handkerchief out of his breast pocket unfolding it on a coffee table to reveal the bifocal glasses one lens still intact. Evelyn stares dumbly at them trembling and gets up as Gittes charged with anger shakes her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. As his anger explodes Gittes smiles and hits her full in the face. Evelyn stares back at him. the blow forces tears from her eyes but she does not move or defend herself. Gittes slaps her repeatedly finally knocking her into a cheap Chinese vase that shatters as she collapses on the sofa sobbing. Kyo comes running down the stairs momentarily stares at Gittes then turns and goes back upstairs. Gittes picks up the glasses and momentarily lost in them stares at the lens. From the stairs Evelyn with her arm around. Katherine hurries the girl toward the bedroom while talking in Spanish. Evelyn reemerges and he nods slowly. Gittes hangs up and goes to the door opens it and finds Escobar and his minions appearing from either side of the doorway. A steep hill overlooks part of the harbor where Escobar's unmarked car pulls up to a stop in front of a Spanish duplex perched on the steep hillside. Escobar shakes his head as Gittes gets out of the car glances around and goes up the stairs."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Escobar steps between the two while Gittes takes a deep breath. The scene widens to include Escobar Gittes and two plainclothesmen who are staring at the empty pipe as if expecting it to speak as a trickle of water drops into the ocean. A third assistant runs down the side of the cliff over to Escobar. Escobar turns to Gittes and stares at him for a long moment with hatred. Gittes rings the doorbell and scarcely waiting for an answer tries the door but it is locked. He reaches into his pocket pulls out his cigarette case takes a pick out of the side and starts to manipulate the lock. The maid opens the door abruptly and stares in surprise at Gittes. Gittes in Mulwray's Buick whips into the driveway and pushes past. Evelyn looking a little worn but glad to see him hurries to the door takes his arm and stares at him searching his face. Gittes looks around and sees clothes laid out for packing in a bedroom off the living room. He goes to the phone and dials then takes the handkerchief out of his breast pocket unfolding it on a coffee table to reveal the bifocal glasses one lens still intact. Evelyn stares dumbly at them trembling and gets up as Gittes charged with anger shakes her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. As his anger explodes Gittes smiles and hits her full in the face. Evelyn stares back at him. the blow forces tears from her eyes but she does not move or defend herself. Gittes slaps her repeatedly finally knocking her into a cheap Chinese vase that shatters as she collapses on the sofa sobbing. Kyo comes running down the stairs momentarily stares at Gittes then turns and goes back upstairs. Gittes picks up the glasses and momentarily lost in them stares at the lens. From the stairs Evelyn with her arm around. Katherine hurries the girl toward the bedroom while talking in Spanish. Evelyn reemerges and he nods slowly. Gittes hangs up and goes to the door opens it and finds Escobar and his minions appearing from either side of the doorway. A steep hill overlooks part of the harbor where Escobar's unmarked car pulls up to a stop in front of a Spanish duplex perched on the steep hillside. Escobar shakes his head as Gittes gets out of the car glances around and goes up the stairs."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Escobar steps between the two while Gittes takes a deep breath. The scene widens to include Escobar Gittes and two plainclothesmen who are staring at the empty pipe as if expecting it to speak as a trickle of water drops into the ocean. A third assistant runs down the side of the cliff over to Escobar. Escobar turns to Gittes and stares at him for a long moment with hatred. Gittes rings the doorbell and scarcely waiting for an answer tries the door but it is locked. He reaches into his pocket pulls out his cigarette case takes a pick out of the side and starts to manipulate the lock. From the stairs Evelyn with her arm around. Katherine hurries the girl toward the bedroom while talking in Spanish. Evelyn reemerges and he nods slowly. Gittes hangs up and goes to the door opens it and finds Escobar and his minions appearing from either side of the doorway. A steep hill overlooks part of the harbor where Escobar's unmarked car pulls up to a stop in front of a Spanish duplex perched on the steep hillside. Escobar shakes his head as Gittes gets out of the car glances around and goes up the stairs."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Escobar steps between the two while Gittes takes a deep breath. The scene widens to include Escobar Gittes and two plainclothesmen who are staring at the empty pipe as if expecting it to speak as a trickle of water drops into the ocean. A third assistant runs down the side of the cliff over to Escobar. A steep hill overlooks part of the harbor where Escobar's unmarked car pulls up to a stop in front of a Spanish duplex perched on the steep hillside. Escobar shakes his head as Gittes gets out of the car glances around and goes up the stairs."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Griffin steps between the two, while Harper takes a deep breath. The scene widens to include Griffin, Harper, and two plainclothesmen, who are staring at the empty pipe as if expecting it to speak, as a trickle of water drops into the ocean. A third assistant runs down the side of the cliff over to Griffin. Griffin turns to Harper and stares at him for a long moment with hatred. Harper rings the doorbell and, scarcely waiting for an answer, tries the door, but it is locked. He reaches into his pocket, pulls out his cigarette case, takes a pick out of the side, and starts to manipulate the lock. The janitor opens the door abruptly and stares in surprise at Harper. Harper, in Mulwray's Buick, whips into the driveway and pushes past. Clara, looking a little worn but glad to see him, hurries to the door, takes his arm, and stares at him, searching his face. Harper looks around and sees clothes laid out for packing in a bedroom off the living room. He goes to the phone and dials, then takes the handkerchief out of his breast pocket, unfolding it on a coffee table to reveal the bifocal glasses, one lens still intact. Clara stares dumbly at them, trembling, and gets up as Harper, charged with anger, shakes her. As his anger explodes, Harper smiles and hits her full in the face. Clara stares back at him; the blow forces tears from her eyes, but she doesn't move or defend herself. Harper slaps her repeatedly, finally knocking her into a cheap Chinese vase that shatters as she collapses on the sofa, sobbing. Mia comes running down the stairs, momentarily stares at Harper, then turns and goes back upstairs. Harper picks up the glasses and, momentarily lost in them, stares at the lens. From the stairs, Clara, with her arm around Lily, hurries the girl toward the bedroom while talking in Spanish. Clara re-emerges, and he nods slowly. Harper hangs up and goes to the door, opens it, and finds Griffin and his minions appearing from either side of the doorway. A steep hill overlooks part of the harbor, where Griffin's unmarked car pulls up to a stop in front of a Spanish duplex perched on the steep hillside. Griffin shakes his head as Harper gets out of the car, glances around, and goes up the stairs."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Escobar steps between the two, while Gittes takes a deep breath. The scene widens to include Escobar, Gittes, and two plainclothesmen, who are staring at the empty bucket as if expecting it to speak, as a trickle of water drops into the pond. A third assistant runs down the side of the meadow over to Escobar. Escobar turns to Gittes and stares at him for a long moment with hatred. Gittes rings the wind chime and, scarcely waiting for an answer, tries the door, but it is locked. He reaches into his pocket, pulls out his pillbox, takes a match out of the side, and starts to manipulate the lock. The gardener opens the door abruptly and stares in surprise at Gittes. Gittes, in Mulwray's Ford, whips into the alley and pushes past. Evelyn, looking a little worn but glad to see him, hurries to the door, takes his arm, and stares at him, searching his face. Gittes looks around and sees books laid out for packing in a pantry off the dining room. He goes to the intercom and dials, then takes the scarf out of his breast pocket, unfolding it on a footstool to reveal the broken spectacles, one lens still intact. Evelyn stares dumbly at them, trembling, and gets up as Gittes, charged with anger, shakes her. As his anger explodes, Gittes smiles and hits her full in the face. Evelyn stares back at him; the blow forces tears from her eyes, but she doesn't move or defend herself. Gittes slaps her repeatedly, finally knocking her into a cheap Italian statue that shatters as she collapses on the armchair, sobbing. Kyo comes running down the hallway, momentarily stares at Gittes, then turns and goes back upstairs. Gittes picks up the spectacles and, momentarily lost in them, stares at the lens. From the hallway, Evelyn, with her arm around Katherine, hurries the girl toward the basement while talking in French. Evelyn re-emerges, and he nods slowly. Gittes hangs up and goes to the door, opens it, and finds Escobar and his minions appearing from either side of the archway. A steep dune overlooks part of the valley, where Escobar's unmarked wagon pulls up to a stop in front of a Spanish villa perched on the steep hillside. Escobar shakes his head as Gittes gets out of the wagon, glances around, and goes up the steps."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Escobar dances between the two, while Gittes sighs deeply. The scene narrows to include Escobar, Gittes, and two plainclothesmen, who are blinking at the empty pipe as if expecting it to dance, as a trickle of water splashes into the ocean. A third assistant skips down the side of the cliff over to Escobar. Escobar turns to Gittes and grins at him for a long moment with hatred. Gittes kicks the doorbell and, scarcely pausing for an answer, taps the door, but it is locked. He reaches into his pocket, pulls out his cigarette case, takes a brush out of the side, and starts to massage the lock. The maid swings the door open abruptly and winks in surprise at Gittes. Gittes, in Mulwray's Buick, leaps into the driveway and strolls past. Evelyn, looking a little worn but glad to see him, skips to the door, grabs his arm, and grins at him, scanning his face. Gittes glances around and sees clothes tossed for packing in a bedroom off the living room. He goes to the phone and taps, then takes the handkerchief out of his breast pocket, unfolding it on a coffee table to hide the bifocal glasses, one lens still intact. Evelyn smiles dumbly at them, giggling, and stands up as Gittes, charged with anger, hugs her. As his anger explodes, Gittes laughs and taps her lightly on the nose. Evelyn grins back at him; the tap brings tears of laughter to her eyes, but she doesn't flinch or dodge. Gittes tickles her repeatedly, finally sending her into a cheap Chinese vase that shatters as she lands on the sofa, giggling. Kyo comes jogging down the stairs, momentarily waves at Gittes, then turns and hops back upstairs. Gittes picks up the glasses and, momentarily lost in them, hums at the lens. From the stairs, Evelyn, with her arm around Katherine, nudges the girl toward the bedroom while chatting in Spanish. Evelyn re-emerges, and he bows slowly. Gittes hangs up and marches to the door, closes it, and finds Escobar and his crew emerging from either side of the doorway. A steep hill mocks part of the harbor, where Escobar's unmarked car bounces to a stop in front of a Spanish duplex perched on the steep hillside. Escobar shakes his head as Gittes jumps out of the car, nods around, and dances up the stairs."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Cucumber steps between the two, while Tomato takes a deep breath. The scene widens to include Cucumber, Tomato, and two astronauts, who are staring at the empty shoe as if expecting it to speak, as a trickle of paint drops into the bucket. A third sunflower runs down the side of the mountain over to Cucumber. Cucumber turns to Tomato and stares at it for a long moment with hatred. Tomato rings the elevator button and, scarcely waiting for an answer, tries the elevator, but it is locked. It reaches into its basket, pulls out its candy wrapper, takes a spoon out of the side, and starts to manipulate the lock. The chef opens the elevator abruptly and stares in surprise at Tomato. Tomato, in Mulwray's yacht, whips into the garage and pushes past. Daisy, looking a little worn but glad to see it, hurries to the elevator, takes its arm, and stares at it, searching its face. Tomato looks around and sees lamps laid out for packing in a bathroom off the dining room. It goes to the radio and dials, then takes the napkin out of its shoe pocket, unfolding it on a dining table to reveal the monocle, one lens still intact. Daisy stares dumbly at them, trembling, and gets up as Tomato, charged with anger, shakes her. As its anger explodes, Tomato smiles and hits her full in the face. Daisy stares back at it; the blow forces tears from her eyes, but she doesn't move or defend herself. Tomato slaps her repeatedly, finally knocking her into a cheap Italian painting that shatters as she collapses on the couch, sobbing. Kite comes running down the ladder, momentarily stares at Tomato, then turns and goes back upstairs. Tomato picks up the monocle and, momentarily lost in them, stares at the lens. From the ladder, Daisy, with her arm around Lily, hurries the dragonfly toward the bathroom while talking in French. Daisy re-emerges, and it nods slowly. Tomato hangs up and goes to the elevator, opens it, and finds Cucumber and its minions appearing from either side of the elevator frame. A steep bridge overlooks part of the river, where Cucumber's unmarked bicycle pulls up to a stop in front of a French gazebo perched on the steep mountainside. Cucumber shakes its head as Tomato gets out of the bicycle, glances around, and goes up the ladder."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Driscoll dances between the two, while Monroe lets out a loud sneeze. The scene expands to include Driscoll, Monroe, and two detectives, who are glaring at the empty pipe as if expecting it to sing, as a trickle of water splashes into the ocean. A third observer skips down the side of the cliff over to Driscoll. Driscoll turns to Monroe and glares at him for a long moment with disgust. Monroe knocks on the window and, scarcely waiting for an answer, yanks the door, but it is locked. He reaches into his pocket, pulls out his wallet, takes a pick out of the side, and begins to jab at the lock. The chef opens the door abruptly and gapes in surprise at Monroe. Monroe, in Mulwray's Cadillac, speeds into the driveway and sneaks past. Clara, looking a little tired but pleased to see him, rushes to the door, takes his hand, and glares at him, examining his expression. Monroe glances around and sees clothes scattered for travel in a bedroom off the living room. He moves to the phone and dials, then takes the hanky out of his back pocket, unfolding it on a coffee table to reveal the monocle, one lens still intact. Clara gapes silently at them, trembling, and stands up as Monroe, filled with irritation, winks at her. As his frustration peaks, Monroe giggles and taps her lightly on the cheek. Clara glares back at him; the tap forces tears from her eyes, but she doesn't react or protect herself. Monroe nudges her repeatedly, finally pushing her into a cheap Chinese pot that cracks as she collapses on the sofa, weeping. Leo comes strolling down the stairs, momentarily glares at Monroe, then turns and saunters back upstairs. Monroe picks up the monocle and, momentarily lost in thought, glares at the lens. From the stairs, Clara, with her arm around Jasmine, shuffles the girl toward the bedroom while muttering in French. Clara emerges again, and he nods slowly. Monroe hangs up and jumps to the door, opens it, and finds Driscoll and his entourage appearing from either side of the entrance. A rugged hill overlooks part of the harbor, where Driscoll's flashy car screeches to a halt in front of a Spanish duplex perched on the steep hillside. Driscoll shrugs as Monroe climbs out of the car, glances around, and leaps up the stairs."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Escobar shuffles between the two, while Gittes holds his breath. The scene expands to include Escobar, Gittes, and two plainclothesmen, who are peering at the vacant teacup as if expecting it to sing, as a trickle of milk drips into the pond. A third assistant saunters down the side of the hill over to Escobar. Escobar swivels to Gittes and glares at him for a long moment with disdain. Gittes taps on the window and, barely waiting for an answer, tugs the handle, but it is sealed. He reaches into his pocket, pulls out his comb, takes a pen out of the side, and starts to doodle on the lock. The maid swings the window open abruptly and gapes in confusion at Gittes. Gittes, in Mulwray's convertible, zooms into the alley and nudges past. Evelyn, looking a little frazzled but pleased to see him, rushes to the window, takes his hand, and peers at him, analyzing his expression. Gittes surveys the area and notices books laid out for wrapping in a den off the hallway. He goes to the radio and tunes in, then takes the notebook out of his sleeve pocket, unfolding it on a dining table to reveal the binoculars, one lens still cracked. Evelyn gapes silently at them, shuddering, and stands as Gittes, filled with frustration, grins and hugs her tightly. As his frustration peaks, Gittes chuckles and pats her gently on the shoulder. Evelyn gazes back at him; the patting forces a smile from her lips, but she doesn't flinch or retreat. Gittes nudges her repeatedly, finally easing her into a delicate Japanese figurine that tips over as she reclines on the armchair, laughing. Kyo comes skipping down the stairs, momentarily glances at Gittes, then spins and skips back upstairs. Gittes picks up the binoculars and, momentarily absorbed in them, gazes at the lens. From the stairs, Evelyn, with her arm around Katherine, ushers the girl toward the balcony while whispering in Italian. Evelyn re-emerges, and he grins slowly. Gittes puts the radio down and goes to the window, pushes it open, and finds Escobar and his companions materializing from either side of the opening. A grassy knoll overlooks part of the bay, where Escobar's discreet van rolls to a halt in front of a Spanish villa perched on the grassy knoll. Escobar shrugs as Gittes hops out of the van, surveys the scene, and heads up the path."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Martinez glides among the sculptures, while Jensen inhales a spicy aroma. The storyline expands to include Martinez, Jensen, and two clowns, who are juggling the invisible suitcase as if expecting it to dance, as a stream of marbles trickles into the lake. A fourth acrobat leaps over the top of the mountain towards Martinez. Martinez glares at Jensen and gazes at him for a long moment with envy. Jensen rings the gong and, barely hesitating for a reaction, yanks the lever, but it is jammed. He reaches into his shoe, pulls out his candy wrapper, extracts a needle from its edge, and begins to tickle the latch. The chef blasts the gate open swiftly and gazes in bewilderment at Jensen. Jensen, in Thompson's tricycle, zooms into the carousel and crawls forward. Amelia, looking quite lively but pleased to see him, skips to the fence, seizes his hand, and examines him, searching his sneakers. Jensen peeks around and spots toys piled up for delivery in a closet near the family room. He strolls to the radio and tunes in, then pulls the string out of his hat, unraveling it on a stool to reveal the monocle, one lens still shining. Amelia gawks blankly at them, shivering, and jumps up as Jensen, brimming with joy, twirls her. As his joy amplifies, Jensen chuckles and tickles her knee. Amelia glares back at him; the tickle causes laughter from her lips, but she doesn’t flinch or protest. Jensen tickles her repeatedly, finally bumping her into a rusty Italian urn that crumbles as she collapses on the hammock, giggling. Niko skips down the ladder, momentarily gazes at Jensen, then spins and skips back up. Jensen picks up the monocle and, momentarily absorbed in it, stares at the lens. From the ladder, Amelia, with her arm around Sylvia, nudges the cat toward the closet while chirping in French. Amelia returns, and she shakes her head slowly. Jensen hangs up and hops to the gate, swings it open, and discovers Martinez and his jesters appearing from either side of the archway. A grassy knoll hovers over part of the meadow, where Martinez's painted wagon rolls to a halt in front of a Mexican igloo perched on the grassy bluff. Martinez nods as Jensen steps out of the wagon, scans the surroundings, and ascends the ladder."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Escobar steps between the men as Gittes inhales deeply. The scene reveals Escobar, Gittes, and two plainclothesmen eyeing an empty pipe. A third assistant approaches Escobar, who glares at Gittes with hatred. Gittes rings the doorbell, tries the locked door, and uses a pick from his cigarette case to manipulate the lock. Startled, the maid opens the door. Gittes, driving Mulwray's Buick, arrives at the driveway. Evelyn, worn but relieved, meets him and they enter. Gittes finds packing clothes in a bedroom and reveals bifocal glasses from a handkerchief. Evelyn, trembling, watches as Gittes, angry, strikes her. Despite tears, she remains passive, and Gittes slaps her until she collapses, breaking a vase. Kyo briefly observes then retreats upstairs. Gittes, focused on the glasses, watches Evelyn escort Katherine to a bedroom while speaking Spanish. Evelyn returns, and Gittes nods. Exiting, Gittes encounters Escobar at the doorway. Escobar's unmarked car halts before a Spanish duplex on a hillside, and after surveying the area, Gittes ascends the stairs."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Escobar shakes his head as Gittes gets out of the car glances around and goes up the stairs A steep hill overlooks part of the harbor where Escobar's unmarked car pulls up to a stop in front of a Spanish duplex perched on the steep hillside Gittes hangs up and goes to the door opens it and finds Escobar and his minions appearing from either side of the doorway Evelyn reemerges and he nods slowly Katherine hurries the girl toward the bedroom while talking in Spanish From the stairs Evelyn with her arm around Gittes picks up the glasses and momentarily lost in them stares at the lens Kyo comes running down the stairs momentarily stares at Gittes then turns and goes back upstairs Gittes slaps her repeatedly finally knocking her into a cheap Chinese vase that shatters as she collapses on the sofa sobbing the blow forces tears from her eyes but she does not move or defend herself Evelyn stares back at him As his anger explodes Gittes smiles and hits her full in the face Evelyn stares dumbly at them trembling and gets up as Gittes charged with anger shakes her He goes to the phone and dials then takes the handkerchief out of his breast pocket unfolding it on a coffee table to reveal the bifocal glasses one lens still intact Gittes looks around and sees clothes laid out for packing in a bedroom off the living room Evelyn looking a little worn but glad to see him hurries to the door takes his arm and stares at him searching his face Gittes in Mulwray's Buick whips into the driveway and pushes past The maid opens the door abruptly and stares in surprise at Gittes He reaches into his pocket pulls out his cigarette case takes a pick out of the side and starts to manipulate the lock Gittes rings the doorbell and scarcely waiting for an answer tries the door but it is locked Escobar turns to Gittes and stares at him for a long moment with hatred A third assistant runs down the side of the cliff over to Escobar The scene widens to include Escobar Gittes and two plainclothesmen who are staring at the empty pipe as if expecting it to speak as a trickle of water drops into the ocean Escobar steps between the two while Gittes takes a deep breath"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Gittes slaps her repeatedly finally knocking her into a cheap Chinese vase that shatters as she collapses on the sofa sobbing He reaches into his pocket pulls out his cigarette case takes a pick out of the side and starts to manipulate the lock From the stairs Evelyn with her arm around Escobar shakes his head as Gittes gets out of the car glances around and goes up the stairs Evelyn stares back at him He goes to the phone and dials then takes the handkerchief out of his breast pocket unfolding it on a coffee table to reveal the bifocal glasses one lens still intact Gittes picks up the glasses and momentarily lost in them stares at the lens Evelyn stares dumbly at them trembling and gets up as Gittes charged with anger shakes her the blow forces tears from her eyes but she does not move or defend herself Kyo comes running down the stairs momentarily stares at Gittes then turns and goes back upstairs The scene widens to include Escobar Gittes and two plainclothesmen who are staring at the empty pipe as if expecting it to speak as a trickle of water drops into the ocean As his anger explodes Gittes smiles and hits her full in the face Gittes hangs up and goes to the door opens it and finds Escobar and his minions appearing from either side of the doorway The maid opens the door abruptly and stares in surprise at Gittes Gittes looks around and sees clothes laid out for packing in a bedroom off the living room A third assistant runs down the side of the cliff over to Escobar A steep hill overlooks part of the harbor where Escobar's unmarked car pulls up to a stop in front of a Spanish duplex perched on the steep hillside Gittes rings the doorbell and scarcely waiting for an answer tries the door but it is locked Katherine hurries the girl toward the bedroom while talking in Spanish Gittes in Mulwray's Buick whips into the driveway and pushes past Evelyn looking a little worn but glad to see him hurries to the door takes his arm and stares at him searching his face Escobar steps between the two while Gittes takes a deep breath Escobar turns to Gittes and stares at him for a long moment with hatred Evelyn reemerges and he nods slowly"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "As his anger explodes Gittes smiles and hits her full in the face Evelyn stares back at him the blow forces tears from her eyes but she does not move or defend herself Gittes slaps her repeatedly finally knocking her into a cheap Chinese vase that shatters as she collapses on the sofa sobbing Kyo comes running down the stairs momentarily stares at Gittes then turns and goes back upstairs Gittes picks up the glasses and momentarily lost in them stares at the lens From the stairs Evelyn with her arm around Katherine hurries the girl toward the bedroom while talking in Spanish Evelyn reemerges and he nods slowly Gittes hangs up and goes to the door opens it and finds Escobar and his minions appearing from either side of the doorway A steep hill overlooks part of the harbor where Escobar's unmarked car pulls up to a stop in front of a Spanish duplex perched on the steep hillside Escobar shakes his head as Gittes gets out of the car glances around and goes up the stairs Escobar steps between the two while Gittes takes a deep breath The scene widens to include Escobar Gittes and two plainclothesmen who are staring at the empty pipe as if expecting it to speak as a trickle of water drops into the ocean A third assistant runs down the side of the cliff over to Escobar Escobar turns to Gittes and stares at him for a long moment with hatred Gittes rings the doorbell and scarcely waiting for an answer tries the door but it is locked He reaches into his pocket pulls out his cigarette case takes a pick out of the side and starts to manipulate the lock The maid opens the door abruptly and stares in surprise at Gittes Gittes in Mulwray's Buick whips into the driveway and pushes past Evelyn looking a little worn but glad to see him hurries to the door takes his arm and stares at him searching his face Gittes looks around and sees clothes laid out for packing in a bedroom off the living room He goes to the phone and dials then takes the handkerchief out of his breast pocket unfolding it on a coffee table to reveal the bifocal glasses one lens still intact Evelyn stares dumbly at them trembling and gets up as Gittes charged with anger shakes her"
        }
      ]
    }
  ]
}