{
  "ground_truth": "Parrish, in a state of shock, doesn't answer for a moment, and then he starts up the stairs. Joe waits guardedly at the bottom as Parrish descends, sensing Parrish's tone, but doesn't answer. Parrish measures Joe, his jaw sets, while Susan seems distracted. Parrish blinks and stares down at his cards, realizing that something in Susan's tone lets him know not a word has sunk in. Quince, meanwhile, sips wine, pouring some red and white into one glass, smiles, nods embarrassedly, and drains his glass. Joe regards Quince, who drains one more glass, then heads out as Parrish and Joe fall silent. Joe is silent too, cogitating, as Parrish begins to reach him. Joe then makes his way down the path from Parrish's study, a weight on his shoulders, until he is hit by the lights, laughter, and music of the party, blinking and at a loss. Susan waits, and Joe kisses her, falling into a deep embrace. Joe struggles with a response and eventually drifts into a long silence; Susan, beside herself and her emotions tossed, is steadied by Joe. She smiles wanly as Joe leaves her. Parrish is seated by the window, with party lights flashing past, the music and laughter audible but muted, lost in thought. Joe enters, and Parrish looks up, waiting and regarding him sympathetically. A knock on the door breaks the silence, and Quince appears, flushed with excitement. Parrish weighs the information for a moment; Quince exits, and Parrish presses the speakerphone button. Quince leads the way through the lights and music as Drew makes an imperial entrance, hailing partygoers, with Quince enjoying the irony. Parrish sits at his desk, while Joe stands in a distant corner. Drew enters with Quince, who nods, excuses himself, and closes the door, while Drew takes a seat. Joe can no longer control himself, and Parrish is struck dumb, looking at Joe pleadingly and shaking his head imperceptibly. Joe nods blithely and commandingly; Drew is all attention as Joe steps forward, and Parrish clicks the speakerphone off. Drew stares at Joe, shaking his head, as Parrish hesitates, waves, and steps away to applause and cheers. The music resumes with another dance tune as Quince grabs Parrish, pumps his hand, and claps him on the back. Parrish spots Allison and wraps her in a tight embrace, but they are separated by guests. Finally, Parrish sees Susan, who smiles with a tinge of sadness.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Parrish, in a condition of stupefaction, doesn't respond for a moment, and then he commences up the steps. Joe waits cautiously at the base as Parrish descends, perceiving Parrish's attitude, but doesn't reply. Parrish assesses Joe, his mandible sets, while Susan seems preoccupied. Parrish blinks and gazes down at his cards, realizing that something in Susan's inflection lets him know not a word has penetrated. Quince, meanwhile, sips wine, pouring some crimson and pale into one glass, smiles, nods self-consciously, and empties his glass. Joe observes Quince, who empties one more glass, then heads out as Parrish and Joe remain silent. Joe is quiet too, pondering, as Parrish starts to approach him. Joe then makes his way down the path from Parrish's study, a burden on his shoulders, until he is struck by the lights, mirth, and melody of the party, blinking and perplexed. Susan waits, and Joe kisses her, falling into a profound embrace. Joe grapples with a reply and ultimately drifts into a prolonged silence; Susan, beside herself and her emotions tossed, is steadied by Joe. She smiles faintly as Joe departs from her. Parrish is seated by the window, with party lights flashing past, the melody and laughter audible but muffled, lost in contemplation. Joe arrives, and Parrish glances up, waiting and observing him compassionately. A rap on the door breaks the silence, and Quince materializes, flushed with exhilaration. Parrish considers the information for a moment; Quince departs, and Parrish presses the speakerphone button. Quince leads the way through the lights and melody as Drew makes an imperial entrance, hailing revelers, with Quince savoring the irony. Parrish sits at his desk, while Joe stands in a remote corner. Drew enters with Quince, who nods, excuses himself, and closes the door, while Drew takes a seat. Joe can no longer restrain himself, and Parrish is rendered speechless, looking at Joe imploringly and shaking his head imperceptibly. Joe nods blithely and authoritatively; Drew is all concentration as Joe steps forward, and Parrish clicks the speakerphone off. Drew stares at Joe, shaking his head, as Parrish falters, gestures, and steps away to applause and cheers. The melody resumes with another dance tune as Quince grabs Parrish, pumps his hand, and claps him on the back. Parrish spots Allison and enfolds her in a tight embrace, but they are separated by attendees. Finally, Parrish sees Susan, who smiles with a hint of melancholy."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Parrish, in a state of shock, isn't answered for a moment, and then the stairs are started up by him. The bottom is waited at guardedly by Joe as Parrish descends, but Parrish's tone is sensed by Joe, and Joe doesn't answer. Joe is measured by Parrish, his jaw is set, while Susan seems distracted. Parrish blinks and cards are stared down at by him, realizing that something in Susan's tone lets him know not a word has sunk in. Meanwhile, wine is sipped by Quince, who pours some red and white into one glass, smiles, nods embarrassedly, and drains his glass. Quince is regarded by Joe, who drains one more glass, then heads out as silence falls between Parrish and Joe. Silence is present with Joe too, who cogitates, as Parrish begins to reach him. The path from Parrish's study is then made down by Joe, with a weight on his shoulders, until he is hit by the lights, laughter, and music of the party, blinking and at a loss. Susan waits, and she is kissed by Joe, falling into a deep embrace. A struggle with a response is experienced by Joe, who eventually drifts into a long silence; Susan, beside herself and her emotions tossed, is steadied by Joe. A wan smile is given by her as she is left by Joe.\n\nBy the window, Parrish is seated, with party lights flashing past, the music and laughter audible but muted, lost in thought. Joe enters, and Parrish looks up, waiting and regarding him sympathetically. A knock on the door breaks the silence, and Quince appears, flushed with excitement. The information is weighed by Parrish for a moment; Quince exits, and the speakerphone button is pressed by Parrish. The way through the lights and music is led by Quince as an imperial entrance is made by Drew, who hails partygoers, with Quince enjoying the irony. At his desk, Parrish sits, while a distant corner is stood in by Joe. Drew enters with Quince, who nods, excuses himself, and closes the door, while a seat is taken by Drew. Control can no longer be maintained by Joe, and Parrish is struck dumb, looking at Joe pleadingly and shaking his head imperceptibly. A blithe and commanding nod is given by Joe; all attention is paid by Drew as Joe steps forward, and the speakerphone is clicked off by Parrish. Joe is stared at by Drew, shaking his head, as Parrish hesitates, waves, and steps away to applause and cheers. The music resumes with another dance tune as Quince grabs, pumps Parrish's hand, and claps him on the back. Allison is spotted by Parrish and a tight embrace is wrapped around her by him, but they are separated by guests. Finally, Susan is seen by Parrish, who smiles with a tinge of sadness."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Parrish, shocked, pauses before heading upstairs. Joe waits warily below as Parrish descends, sensing Parrish's tone but remains silent. Parrish assesses Joe, while Susan seems distracted. Parrish realizes Susan’s tone indicates nothing has registered. Quince drinks wine, mixing red and white in one glass, smiles, nods embarrassedly, and finishes his drink. Joe watches Quince, who leaves as Parrish and Joe remain silent. Joe silently contemplates, feeling burdened, until he reaches the party's lights, laughter, and music, blinking in confusion. Susan waits, and Joe kisses her, embracing deeply. Joe struggles to respond, eventually lapsing into silence; Susan, emotional, is steadied by Joe. She smiles wanly as he departs. Parrish sits by the window, party lights flashing, music and laughter muted, lost in thought. Joe enters, and Parrish looks up, waiting sympathetically. A knock interrupts, and an excited Quince appears. Parrish ponders briefly; Quince exits, and Parrish presses speakerphone. Quince leads through lights and music as Drew enters, greeting partygoers, with Quince enjoying the irony. Parrish sits at his desk, Joe in a corner. Drew enters with Quince, who excuses himself, closing the door as Drew sits. Joe, unable to control himself, prompts Parrish to look at him pleadingly, shaking his head slightly. Joe nods confidently; Drew pays attention as Joe steps forward, and Parrish turns off the speakerphone. Drew observes Joe, shaking his head, while Parrish hesitates, waves, and steps away to applause and cheers. Music resumes with another dance tune as Quince grabs and congratulates Parrish. Parrish embraces Allison tightly but is separated by guests. Finally, Parrish spots Susan, who smiles with a hint of sadness."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Parrish, shocked, pauses before ascending the stairs. Joe waits watchfully below as Parrish descends, observing Parrish's mood. Susan appears distracted while Parrish realizes Susan's tone indicates nothing has registered. Quince, meanwhile, mixes red and white wine, smiles awkwardly, and drains his glass. Joe notices Quince, who drinks again, then leaves as Parrish and Joe fall silent. Joe reflects as Parrish approaches, and he leaves Parrish's study, burdened until party lights, laughter, and music surprise him. He joins Susan, sharing a deep kiss, struggling to respond, and eventually becomes silent; Susan finds comfort in him, smiling weakly as Joe departs. Parrish, seated by the window, lost in thought, hears muted party sounds. Joe arrives, and Parrish looks at him compassionately. A knock breaks the silence, revealing an excited Quince. Parrish considers briefly; Quince exits, and Parrish activates the speakerphone. Quince leads through lights and music as Drew enters grandly, amusing Quince. Parrish sits, Joe at a distance. Drew arrives with Quince, who leaves as Drew sits. Joe loses control, and Parrish, struck, looks at him pleadingly, then Joe asserts himself while Drew focuses on him. Parrish turns off the speakerphone, as Drew stares at Joe, and Parrish hesitates before stepping away to applause. Music swells as Quince congratulates Parrish, who embraces Allison but is separated by guests. Parrish finally sees Susan, who smiles sadly."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Parrish, enveloped in a state of shock and unable to process his emotions, remains silent for a brief moment before finally mustering his resolve and slowly making his way up the stairs. Meanwhile, Joe stands watchfully at the bottom, carefully observing Parrish's descent. He senses the tension in Parrish's demeanor but chooses to maintain his silence. Parrish, scrutinizing Joe intently, firmly sets his jaw as he evaluates him. Nearby, Susan appears somewhat distracted and lost in her thoughts. Parrish blinks and gazes down at his cards, coming to the realization that Susan's tone has made it clear to him that not a single word has registered with her. Meanwhile, Quince indulges in a glass of wine, mixing both red and white into a single glass. With a sheepish smile, he nods in slight embarrassment, then proceeds to drain his glass. Joe turns his attention to Quince, who heartily drains yet another glass before making his exit, leaving Parrish and Joe enveloped in silence. Joe, too, remains wordless, deep in thought, as Parrish gradually draws near to him. As Joe eventually makes his way down the path leading away from Parrish's study, he carries a palpable weight on his shoulders until he is suddenly enveloped by the dazzling lights, raucous laughter, and lively music of the party, causing him to blink in confusion and feel momentarily at a loss. Susan waits expectantly, and Joe, caught up in the moment, gently kisses her, falling into a profound embrace. Joe struggles internally with forming a response and ultimately drifts into a prolonged silence; Susan, overwhelmed by her own emotions and feeling unsteady, finds stability and reassurance in Joe's presence. She offers him a faint, fleeting smile as he departs from her side. Parrish sits pensively by the window, as the party's vibrant lights flash by, and the sounds of music and laughter are heard, though muted and distant, while he remains lost in contemplation. Joe enters the room, prompting Parrish to look up, awaiting Joe's approach with a sympathetic gaze. Suddenly, a knock on the door disrupts the quiet, and Quince bursts in, visibly flushed with excitement. Parrish contemplates the information Quince provides for a moment; after Quince exits, Parrish presses the button for the speakerphone. Quince guides the way through the lively lights and infectious music as Drew makes a grand, imperial entrance, cheerfully greeting the partygoers, with Quince finding amusement in the irony of it all. Parrish remains seated at his desk, a picture of contemplation, while Joe stands quietly in a remote corner of the room. Drew enters, accompanied by Quince, who nods his acknowledgment, excuses himself, and discreetly closes the door behind him as Drew takes a seat. Joe finds himself unable to restrain his emotions any longer, and Parrish, rendered speechless, looks at him with pleading eyes, shaking his head ever so slightly in silent communication. Joe, however, nods with confidence and authority; Drew is fully attentive as Joe steps forward, prompting Parrish to turn off the speakerphone. Drew fixes his gaze on Joe, shaking his head in disbelief, as Parrish momentarily hesitates, then waves and steps away to a chorus of applause and cheers. The music resumes with another lively dance tune as Quince enthusiastically grips Parrish's hand, pumping it with gusto, and gives him an encouraging clap on the back. Amidst the crowd, Parrish spots Allison and pulls her into a warm, tight embrace, although they are quickly separated by the throng of guests. Finally, Parrish catches sight of Susan, who greets him with a smile tinged with a touch of sadness."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Parrish, enveloped in a profound state of shock and unable to fully process or articulate his swirling emotions, remains completely silent for a brief moment before finally mustering his resolve and making the decision to slowly, almost reluctantly, make his way up the stairs. Meanwhile, down below, Joe stands watchfully at the bottom of the staircase, carefully and attentively observing Parrish's deliberate ascent. He senses the palpable tension in Parrish's demeanor and posture, yet he chooses, for reasons known only to him, to maintain his silence. Parrish, meanwhile, scrutinizes Joe intently, fixing him with an assessing gaze, and firmly sets his jaw in determination as he evaluates him. Nearby, Susan appears somewhat distracted, her thoughts seemingly elsewhere, as if lost in her own private world. Parrish blinks and gazes down at his cards, coming to the sudden realization that Susan's tone has made it unmistakably clear to him that not a single word he has spoken has registered with her. Meanwhile, Quince indulges himself in a glass of wine, an unusual blend of both red and white poured into a single glass. With a sheepish smile, he nods in slight embarrassment, then proceeds to drain his entire glass. Joe shifts his attention to Quince, who, exhibiting a hearty appetite for drink, drains yet another glass before making his somewhat unsteady exit, leaving Parrish and Joe enveloped in a profound silence. Joe, too, remains wordless, lost in his own deep thoughts, as Parrish gradually draws near to him. As Joe eventually makes his way down the winding path leading away from Parrish's study, he carries with him a palpable weight on his shoulders, an emotional burden, until he is suddenly enveloped by the dazzling lights, raucous laughter, and lively, pulsating music of the party. The sudden change in atmosphere causes him to blink in confusion and feel momentarily at a loss. Susan waits expectantly, and Joe, caught up in the moment, gently leans in to kiss her, falling into a profound embrace that speaks volumes. Joe struggles internally with forming a response and ultimately drifts into a prolonged silence; Susan, overwhelmed by her own cascading emotions and feeling unsteady, finds much-needed stability and reassurance in Joe's calming presence. She offers him a faint, fleeting smile as he finally departs from her side. Parrish sits pensively by the window, as the party's vibrant lights flash by, and the distant sounds of music and laughter are heard, although muted and distant, while he remains lost in deep contemplation. Joe enters the room, prompting Parrish to look up, awaiting Joe's approach with a sympathetic, understanding gaze. Suddenly, a sharp knock on the door disrupts the quiet, and Quince bursts in, visibly flushed with excitement and enthusiasm. Parrish contemplates the information Quince provides for a moment; after Quince exits, Parrish presses the button for the speakerphone. Quince confidently guides the way through the lively lights and infectious, dynamic music as Drew makes a grand, imperial entrance, cheerfully greeting the partygoers, with Quince finding quiet amusement in the irony of it all. Parrish remains seated at his desk, a picture of contemplation, while Joe stands quietly in a remote corner of the room. Drew enters, accompanied by Quince, who nods his acknowledgment, excuses himself courteously, and discreetly closes the door behind him as Drew takes a seat. Joe finds himself unable to restrain his emotions any longer, and Parrish, rendered speechless, looks at him with pleading eyes, shaking his head ever so slightly in silent communication. Joe, however, nods with confidence and authority; Drew is fully attentive and focused as Joe steps forward, prompting Parrish to turn off the speakerphone. Drew fixes his gaze on Joe, shaking his head in disbelief, as Parrish momentarily hesitates, then waves and steps away to a chorus of applause and cheers. The music resumes with another lively dance tune as Quince enthusiastically grips Parrish's hand, pumping it with gusto, and gives him an encouraging clap on the back. Amidst the crowd, Parrish spots Allison and pulls her into a warm, tight embrace, although they are quickly separated by the swirling throng of guests. Finally, Parrish catches sight of Susan, who greets him with a smile tinged with a touch of sadness."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Parrish stands momentarily frozen in a state of shock, his mind reeling and unable to react immediately. After a brief pause, he starts making his way up the stairs with deliberate steps, leaving Joe at the bottom, who remains alert and cautious, watching Parrish with a keen sense of anticipation. As Parrish descends back down, he feels the weight of the moment in Joe's unspoken understanding, yet Joe chooses to remain silent. Parrish takes a moment to assess Joe, his jaw setting in determination, while Susan appears somewhere else, her thoughts seemingly distracted. Parrish blinks slowly and lowers his gaze to the cards in his hand, coming to the realization that Susan's voice has conveyed something important, yet its significance is completely lost on him. Meanwhile, Quince enjoys a sip of wine, playfully mixing red and white into one glass, offering a sheepish smile as he nods to those around him before confidently draining the glass. Joe's eyes follow Quince's movements as he consumes yet another glass, and then leaves the scene, leaving an unspoken tension hanging in the air between Parrish and Joe, who both lapse into silence. Joe finds himself absorbed in his thoughts as Parrish begins to close the distance toward him. Afterward, Joe slowly proceeds along the path that leads away from Parrish's study, a heavy sense of duty pressing down on his shoulders, until he suddenly emerges into an entirely different world, illuminated by party lights, filled with laughter and vibrant music. Momentarily blinded by the brightness and noise, he blinks, feeling momentarily disoriented. In the midst of this lively chaos, Susan waits expectantly, and Joe approaches her, planting a gentle kiss on her lips as they melt into a deep embrace. Joe grapples internally with finding the right words, and eventually succumbs to a prolonged silence. Beside him, Susan battles with her own swirling emotions, eventually finding stability in Joe's presence. She manages a faint, somewhat sad smile as Joe prepares to leave her side. Meanwhile, Parrish is seated by a window, the party's colorful lights flashing intermittently against his face, with the sounds of music and laughter muted in the background, absorbed in his own introspection. Joe enters the room, and Parrish lifts his gaze, offering Joe a look filled with quiet understanding and sympathy. The silence is abruptly shattered by a knock at the door, revealing Quince, who bursts in, eyes alight with excitement. Parrish takes a moment to consider the information presented to him; once Quince departs, Parrish decisively presses the speakerphone button. Quince confidently navigates through the vibrant environment of lights and music as Drew makes his grand appearance, greeting partygoers with a regal air that Quince finds amusingly ironic. Back inside, Parrish settles into his seat at the desk while Joe maintains a distance, standing pensively in a corner. Drew enters accompanied by Quince, who offers a courteous nod, excuses himself gracefully, and closes the door behind him, leaving Drew to settle into a chair. As Joe reaches the end of his composure, his emotions brim over uncontrollably, leaving Parrish momentarily speechless, as he looks towards Joe with pleading eyes, subtly shaking his head in disapproval. In response, Joe acknowledges this with a confident and knowing nod as he steps forward assertively, capturing Drew's full attention. Parrish quietly switches off the speakerphone, bringing the conversation to a close. Drew regards Joe with a look of disbelief, shaking his own head slowly as Parrish hesitates momentarily, waves farewell, and withdraws from the room to the sound of applause and cheers from the partygoers. The music swells with the onset of another energetic dance number as Quince energetically approaches Parrish, enthusiastically shaking his hand and giving him a hearty pat on the back. In the midst of the celebration, Parrish catches sight of Allison and draws her into a warm, tight embrace, only for them to be momentarily separated by the throng of guests. Eventually, Parrish's eyes find Susan, who returns his gaze with a smile touched by a hint of melancholy."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Parrish pauses in shock before ascending the stairs, while Joe waits at the bottom, aware of a change in Parrish's tone. As Parrish confronts Joe, Susan seems distracted, and Parrish realizes he's missed the substance of her words. Quince, meanwhile, mixes red and white wine in one glass, smiles sheepishly, drains it, and exits, leaving Joe and Parrish in silence. Joe, lost in thought, departs from Parrish's study, burdened, until he encounters the vibrant atmosphere of the party. Reaching Susan, he shares a deep embrace with her. Struggling with his emotions, Joe eventually falls silent. Susan, though unsettled, finds solace in Joe's presence and smiles faintly as he leaves. Parrish, by the window, is lost in thought amidst the muted party lights and sounds. As Joe arrives, Parrish regards him sympathetically. A knock introduces Quince, brimming with excitement. Parrish processes the situation, then activates the speakerphone. Quince leads the way, and Drew makes a grand entrance, enjoying the scene. Parrish sits at his desk while Joe stands apart. Drew enters with Quince, who excuses himself as Drew takes a seat. Unable to contain himself, Joe steps forward, with Parrish looking on pleadingly. Joe confidently nods as Drew listens intently, and Parrish turns off the speakerphone. Drew, confused, watches as Parrish steps aside to applause. The music restarts with a dance tune as Quince congratulates Parrish. Parrish embraces Allison but is quickly separated by guests. Finally, he spots Susan, who greets him with a bittersweet smile."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Parrish, in a state of shock reminiscent of someone who has just received unexpected news, doesn't answer for a moment, and then he starts up the stairs decorated with an elaborate runner that echoes the opulence of the house. Joe, who is known for his perceptive nature, waits guardedly at the bottom as Parrish descends, sensing Parrish's tone, but doesn't answer. Parrish, an astute businessman renowned for his strategic thinking, measures Joe, his jaw sets, while Susan seems distracted, possibly by a recent turn of events affecting her mood. Parrish blinks and stares down at his cards, realizing that something in Susan's tone lets him know not a word has sunk in, a common experience when one's mind is elsewhere. Quince, meanwhile, sips wine from a renowned vineyard known for its unique blends, pouring some red and white into one glass, smiles, nods embarrassedly, and drains his glass. Joe regards Quince, who drains one more glass, then heads out as Parrish and Joe fall silent. Joe is silent too, cogitating deeply about recent developments, as Parrish begins to reach him. Joe then makes his way down the path from Parrish's study, a weight on his shoulders reminiscent of a heavy burden, until he is hit by the lights, laughter, and music of the party, blinking and at a loss in the vibrant atmosphere. Susan waits, and Joe kisses her, falling into a deep embrace that speaks volumes of their shared history. Joe struggles with a response and eventually drifts into a long silence; Susan, beside herself and her emotions tossed like a ship in rough seas, is steadied by Joe's calm presence. She smiles wanly as Joe leaves her, her expression betraying a mix of hope and uncertainty. Parrish is seated by the window, with party lights flashing past in a kaleidoscope of colors, the music and laughter audible but muted, lost in thought. Joe enters, and Parrish looks up, waiting and regarding him sympathetically as if sensing Joe's internal conflict. A knock on the door breaks the silence, and Quince appears, flushed with excitement like someone who has just achieved a small victory. Parrish weighs the information for a moment; Quince exits, and Parrish presses the speakerphone button, a habitual gesture from countless business meetings. Quince leads the way through the lights and music as Drew makes an imperial entrance, hailing partygoers with the charisma of a seasoned socialite, with Quince enjoying the irony of the situation. Parrish, amid the grandeur of his study, sits at his desk, while Joe stands in a distant corner, embodying the tension in the room. Drew enters with Quince, who nods, excuses himself, and closes the door with the practiced grace of a butler, while Drew takes a seat. Joe can no longer control himself, and Parrish is struck dumb, looking at Joe pleadingly and shaking his head imperceptibly, a silent plea for discretion. Joe nods blithely and commandingly; Drew is all attention as Joe steps forward, and Parrish clicks the speakerphone off, ending the external connection to the outside world. Drew stares at Joe, shaking his head in disbelief, as Parrish hesitates, waves, and steps away to applause and cheers from an unseen audience. The music resumes with another dance tune, a familiar party anthem, as Quince grabs Parrish, pumps his hand, and claps him on the back in a gesture of camaraderie. Parrish spots Allison, a dear friend from college days, and wraps her in a tight embrace, but they are separated by guests as if by a bustling tide. Finally, Parrish sees Susan, who smiles with a tinge of sadness that hints at unresolved emotions."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Parrish in a state of shock does not answer for a moment and then he starts up the stairs. Joe waits guardedly at the bottom as Parrish descends sensing Parrish's tone but does not answer. Parrish measures Joe his jaw sets while Susan seems distracted. Parrish blinks and stares down at his cards realizing that something in Susan's tone let us him know. not a word has sunk in. Quince meanwhile sips wine pouring some red and white into one glass smiles nods embarrassedly and drains his glass. Joe regards Quince who drains one more glass then heads out as Parrish and Joe fall silent. Joe is silent too cogitating as Parrish begins to reach him. Joe then makes his way down the path from Parrish's study a weight on his shoulders until he is hit by the lights laughter and music of the party blinking and at a loss. Susan waits and Joe kisses her falling into a deep embrace. Joe struggles with a response and eventually drifts into a long silence. Susan beside herself and her emotions tossed is steadied by Joe. She smiles wanly as Joe leaves her. Parrish is seated by the window with party lights flashing past the music and laughter audible but muted lost in thought. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Joe enters and Parrish looks up waiting and regarding him sympathetically. A knock on the door breaks the silence and Quince appears flushed with excitement. Parrish weighs the information for a moment. Quince exits and Parrish presses the speakerphone button. Quince leads the way through the lights and music as Drew makes an imperial entrance hailing partygoers with Quince enjoying the irony. Parrish sits at his desk while Joe stands in a distant corner. Drew enters with Quince who nods excuses himself and closes the door while Drew takes a seat. Joe can no longer control himself and Parrish is struck dumb looking at Joe pleadingly and shaking his head imperceptibly. Joe nods blithely and commandingly. Drew is all attention as Joe steps forward and Parrish clicks the speakerphone off. Drew stares at Joe shaking his head as Parrish hesitates waves and steps away to applause and cheers. The music resumes with another dance tune as Quince grabs Parrish pumps his hand and claps him on the back. Parrish spots Allison and wraps her in a tight embrace but they are separated by guests. Finally Parrish sees Susan who smiles with a tinge of sadness."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Parrish in a state of shock does not answer for a moment and then he starts up the stairs. Joe waits guardedly at the bottom as Parrish descends sensing Parrish's tone but does not answer. Parrish measures Joe his jaw sets while Susan seems distracted. Parrish blinks and stares down at his cards realizing that something in Susan's tone let us him know. not a word has sunk in. Quince meanwhile sips wine pouring some red and white into one glass smiles nods embarrassedly and drains his glass. Joe regards Quince who drains one more glass then heads out as Parrish and Joe fall silent. Joe is silent too cogitating as Parrish begins to reach him. Joe then makes his way down the path from Parrish's study a weight on his shoulders until he is hit by the lights laughter and music of the party blinking and at a loss. Susan waits and Joe kisses her falling into a deep embrace. Joe struggles with a response and eventually drifts into a long silence. Susan beside herself and her emotions tossed is steadied by Joe. She smiles wanly as Joe leaves her. Parrish is seated by the window with party lights flashing past the music and laughter audible but muted lost in thought. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Joe enters and Parrish looks up waiting and regarding him sympathetically. A knock on the door breaks the silence and Quince appears flushed with excitement. Parrish weighs the information for a moment. Quince exits and Parrish presses the speakerphone button. Quince leads the way through the lights and music as Drew makes an imperial entrance hailing partygoers with Quince enjoying the irony. Parrish sits at his desk while Joe stands in a distant corner. Drew enters with Quince who nods excuses himself and closes the door while Drew takes a seat. Joe can no longer control himself and Parrish is struck dumb looking at Joe pleadingly and shaking his head imperceptibly. Joe nods blithely and commandingly. Drew is all attention as Joe steps forward and Parrish clicks the speakerphone off. Drew stares at Joe shaking his head as Parrish hesitates waves and steps away to applause and cheers. The music resumes with another dance tune as Quince grabs Parrish pumps his hand and claps him on the back. Parrish spots Allison and wraps her in a tight embrace but they are separated by guests. Finally Parrish sees Susan who smiles with a tinge of sadness."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Parrish in a state of shock does not answer for a moment and then he starts up the stairs. Joe waits guardedly at the bottom as Parrish descends sensing Parrish's tone but does not answer. Parrish measures Joe his jaw sets while Susan seems distracted. Parrish blinks and stares down at his cards realizing that something in Susan's tone let us him know. not a word has sunk in. Quince meanwhile sips wine pouring some red and white into one glass smiles nods embarrassedly and drains his glass. Joe regards Quince who drains one more glass then heads out as Parrish and Joe fall silent. Joe can no longer control himself and Parrish is struck dumb looking at Joe pleadingly and shaking his head imperceptibly. Joe nods blithely and commandingly. Drew is all attention as Joe steps forward and Parrish clicks the speakerphone off. Drew stares at Joe shaking his head as Parrish hesitates waves and steps away to applause and cheers. The music resumes with another dance tune as Quince grabs Parrish pumps his hand and claps him on the back. Parrish spots Allison and wraps her in a tight embrace but they are separated by guests. Finally Parrish sees Susan who smiles with a tinge of sadness."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Parrish in a state of shock does not answer for a moment and then he starts up the stairs. Joe waits guardedly at the bottom as Parrish descends sensing Parrish's tone but does not answer. Parrish measures Joe his jaw sets while Susan seems distracted. The music resumes with another dance tune as Quince grabs Parrish pumps his hand and claps him on the back. Parrish spots Allison and wraps her in a tight embrace but they are separated by guests. Finally Parrish sees Susan who smiles with a tinge of sadness."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Blanche, in a state of euphoria, doesn't respond for a moment, and then she jumps onto the trampoline. Oliver crouches nervously at the edge as Blanche leaps, sensing Blanche's rhythm, but doesn't react. Blanche examines Oliver, her eyes squint, while Gina seems attentive. Blanche giggles and gazes up at her books, realizing that something in Gina's demeanor lets her know not a sound has echoed out. Carter, meanwhile, sips tea, pouring some green and black into one cup, chuckles, nods confidently, and sips his cup. Oliver observes Carter, who fills one more cup, then skips out as Blanche and Oliver stay mute. Oliver is mute too, pondering, as Blanche starts to approach him. Oliver then wanders along the trail from Blanche's library, a shadow on her mind, until she is startled by the shadows, whispers, and silence of the meadow, squinting and at a loss. Gina waits, and Oliver embraces her, falling into a light slumber. Oliver wrestles with words and eventually drifts into a short silence; Gina, beside herself and her emotions swirling, is anchored by Oliver. She grins brightly as Oliver departs from her. Blanche is perched by the balcony, with meadow shadows drifting by, the whispers and silence audible but muffled, lost in vision. Oliver arrives, and Blanche peers up, waiting and assessing him warmly. A chime on the clock breaks the hush, and Carter appears, shimmering with joy. Blanche considers the whispers for a moment; Carter vanishes, and Blanche taps the intercom switch. Carter guides the way through the shadows and silence as Mark makes a regal exit, greeting passersby, with Carter appreciating the jest. Blanche perches at her table, while Oliver stands in a remote alcove. Mark arrives with Carter, who bows, excuses himself, and closes the curtain, while Mark reclines. Oliver can no longer restrain himself, and Blanche is struck speechless, gazing at Oliver imploringly and tilting her head slightly. Oliver grins whimsically and authoritatively; Mark is all ears as Oliver glides forward, and Blanche taps the intercom off. Mark glances at Oliver, tilting his head, as Blanche pauses, gestures, and dances away to cheers and applause. The silence resumes with another lullaby as Carter reaches Blanche, shakes her hand, and pats her on the shoulder. Blanche notices Amelia and wraps her in a gentle hug, but they are parted by shadows. Finally, Blanche notices Gina, who grins with a hint of joy."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Parrish, shocked, hesitates on the stairs while Joe waits below, sensing tension. Susan seems distracted, and Quince drinks wine, nodding embarrassedly. As Parrish and Joe fall silent, Joe contemplates as he leaves Parrish's study, feeling burdened. Amidst the party's lights and laughter, Joe shares a deep embrace with Susan, who is emotionally steadied by him. Parrish sits by the window, lost in thought, as Joe enters. A knock interrupts; Quince enters excitedly, and Parrish presses the speakerphone. Quince leads Drew, who makes a grand entrance, to enjoy the irony. Parrish sits at his desk, Joe stands apart, and Drew joins. Joe, unable to contain himself, moves forward as Parrish shakes his head. Joe nods confidently, and Parrish turns off the speakerphone. Drew watches Joe, and as Parrish steps away, applause erupts. The music resumes, Quince celebrates with Parrish, who then embraces Allison. Separated by guests, Parrish finally finds Susan, who smiles sadly."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Finally Parrish sees Susan who smiles with a tinge of sadness Parrish spots Allison and wraps her in a tight embrace but they are separated by guests The music resumes with another dance tune as Quince grabs Parrish pumps his hand and claps him on the back Drew stares at Joe shaking his head as Parrish hesitates waves and steps away to applause and cheers Drew is all attention as Joe steps forward and Parrish clicks the speakerphone off Joe nods blithely and commandingly Joe can no longer control himself and Parrish is struck dumb looking at Joe pleadingly and shaking his head imperceptibly Drew enters with Quince who nods excuses himself and closes the door while Drew takes a seat Parrish sits at his desk while Joe stands in a distant corner Quince leads the way through the lights and music as Drew makes an imperial entrance hailing partygoers with Quince enjoying the irony Quince exits and Parrish presses the speakerphone button Parrish weighs the information for a moment A knock on the door breaks the silence and Quince appears flushed with excitement Joe enters and Parrish looks up waiting and regarding him sympathetically Parrish is seated by the window with party lights flashing past the music and laughter audible but muted lost in thought She smiles wanly as Joe leaves her Susan beside herself and her emotions tossed is steadied by Joe Joe struggles with a response and eventually drifts into a long silence Susan waits and Joe kisses her falling into a deep embrace Joe then makes his way down the path from Parrish's study a weight on his shoulders until he is hit by the lights laughter and music of the party blinking and at a loss Joe is silent too cogitating as Parrish begins to reach him Joe regards Quince who drains one more glass then heads out as Parrish and Joe fall silent Quince meanwhile sips wine pouring some red and white into one glass smiles nods embarrassedly and drains his glass not a word has sunk in Parrish blinks and stares down at his cards realizing that something in Susan's tone let us him know Parrish measures Joe his jaw sets while Susan seems distracted Joe waits guardedly at the bottom as Parrish descends sensing Parrish's tone but does not answer Parrish in a state of shock does not answer for a moment and then he starts up the stairs"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Joe waits guardedly at the bottom as Parrish descends sensing Parrish's tone but does not answer Parrish in a state of shock does not answer for a moment and then he starts up the stairs Parrish blinks and stares down at his cards realizing that something in Susan's tone let us him know Parrish measures Joe his jaw sets while Susan seems distracted Quince meanwhile sips wine pouring some red and white into one glass smiles nods embarrassedly and drains his glass not a word has sunk in Joe is silent too cogitating as Parrish begins to reach him Joe regards Quince who drains one more glass then heads out as Parrish and Joe fall silent Susan waits and Joe kisses her falling into a deep embrace Joe then makes his way down the path from Parrish's study a weight on his shoulders until he is hit by the lights laughter and music of the party blinking and at a loss Susan beside herself and her emotions tossed is steadied by Joe Joe struggles with a response and eventually drifts into a long silence Parrish is seated by the window with party lights flashing past the music and laughter audible but muted lost in thought She smiles wanly as Joe leaves her A knock on the door breaks the silence and Quince appears flushed with excitement Joe enters and Parrish looks up waiting and regarding him sympathetically Quince exits and Parrish presses the speakerphone button Parrish weighs the information for a moment Parrish sits at his desk while Joe stands in a distant corner Quince leads the way through the lights and music as Drew makes an imperial entrance hailing partygoers with Quince enjoying the irony Joe can no longer control himself and Parrish is struck dumb looking at Joe pleadingly and shaking his head imperceptibly Drew enters with Quince who nods excuses himself and closes the door while Drew takes a seat Drew is all attention as Joe steps forward and Parrish clicks the speakerphone off Joe nods blithely and commandingly The music resumes with another dance tune as Quince grabs Parrish pumps his hand and claps him on the back Drew stares at Joe shaking his head as Parrish hesitates waves and steps away to applause and cheers Finally Parrish sees Susan who smiles with a tinge of sadness Parrish spots Allison and wraps her in a tight embrace but they are separated by guests"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Joe enters and Parrish looks up waiting and regarding him sympathetically A knock on the door breaks the silence and Quince appears flushed with excitement Parrish weighs the information for a moment Quince exits and Parrish presses the speakerphone button Quince leads the way through the lights and music as Drew makes an imperial entrance hailing partygoers with Quince enjoying the irony Parrish sits at his desk while Joe stands in a distant corner Drew enters with Quince who nods excuses himself and closes the door while Drew takes a seat Joe can no longer control himself and Parrish is struck dumb looking at Joe pleadingly and shaking his head imperceptibly Joe nods blithely and commandingly Drew is all attention as Joe steps forward and Parrish clicks the speakerphone off Drew stares at Joe shaking his head as Parrish hesitates waves and steps away to applause and cheers The music resumes with another dance tune as Quince grabs Parrish pumps his hand and claps him on the back Parrish spots Allison and wraps her in a tight embrace but they are separated by guests Finally Parrish sees Susan who smiles with a tinge of sadness Parrish in a state of shock does not answer for a moment and then he starts up the stairs Joe waits guardedly at the bottom as Parrish descends sensing Parrish's tone but does not answer Parrish measures Joe his jaw sets while Susan seems distracted Parrish blinks and stares down at his cards realizing that something in Susan's tone let us him know not a word has sunk in Quince meanwhile sips wine pouring some red and white into one glass smiles nods embarrassedly and drains his glass Joe regards Quince who drains one more glass then heads out as Parrish and Joe fall silent Joe is silent too cogitating as Parrish begins to reach him Joe then makes his way down the path from Parrish's study a weight on his shoulders until he is hit by the lights laughter and music of the party blinking and at a loss Susan waits and Joe kisses her falling into a deep embrace Joe struggles with a response and eventually drifts into a long silence Susan beside herself and her emotions tossed is steadied by Joe She smiles wanly as Joe leaves her Parrish is seated by the window with party lights flashing past the music and laughter audible but muted lost in thought"
        }
      ]
    }
  ]
}