{
  "ground_truth": "Trina smiles and looks at the passengers from her jump seat. Whip takes the phone. Nicole gets out of the car and runs up to the second floor of a small run-down apartment complex. She pulls out a key as she reaches the door, only to discover it is slightly open. She smiles at him. He stands in the doorway. She kicks the door closed. She flings her bag on a table, and it hits a box which falls and scatters its contents. She spots a syringe. Whip speaks into the intercom. He pours the contents of a small vodka bottle into a juice container hidden from the passengers' view. He tosses three miniature bottles as he grabs the spiked orange juice. He takes a long drink as Margaret exits the toilet and he goes in. In Nicole's apartment, framed photographs on the table show a younger, smiling Nicole with her mother. Nicole lightly taps the syringe. Then pushes out a small drop that slides down the needle. She tightens a tourniquet around her arm and holds the end securely in her mouth. She positions the needle and injects. Her arms relax and she lets go of the syringe. She leans back, eyes closed. The strap falls from her mouth. Her head lulls to her shoulder. Her dilated pupils shrink to tiny dots. She grabs the packet of cocaine that Kip gave her and falls on her side. The packet falls inches from her hand. Her fingers reach out, but only push it away. Her hand goes still as feet appear under the door. In the cockpit, Whip sleeps with paper covering his eyes and his sunglasses over the paper. Ken's yoke jerks away. The yoke slips out of Ken's hands as Whip struggles to gain control and the plane begins to dive. The wheels of the aircraft unfold. In the galley, Margaret grabs the phone. Margaret unbuckles her seat belt. Alarmed passengers grasp the seat in front of them as a flight attendant tries to assist someone. Cammie falls and hits her head. Cammie lies still. Whip banks to the left. The plane turns upside down. She slides the side-stick forward. One wheel gets stuck while retracting. Inside the cabin, Cammie comes to a rest on the ceiling. Trina sees a young boy slip out of his seat. Outside Georgian Gardens, a medical aide wheels Nicole beside Fran as the upside down plane flies past. Trina crawls to the boy and straps him back in his seat. A light flashes on the control panel in the cockpit. The plane turns upright, and the still-unconscious Cammie falls on some passengers. Trina loses her hold and falls against the bulkhead. Fire and smoke billow from the left engine.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Trina beams and glances at the travelers from her jump seat. Whip seizes the telephone. Nicole exits the automobile and dashes up to the second level of a modest dilapidated dwelling complex. She draws out a key as she approaches the portal, only to realize it is slightly ajar. She beams at him. He stands in the threshold. She kicks the portal shut. She hurls her satchel onto a table, and it strikes a box which tumbles and scatters its contents. She notices a needle. Whip speaks into the intercom. He pours the contents of a small vodka bottle into a juice vessel concealed from the travelers' sight. He tosses three miniature bottles as he grabs the spiked orange nectar. He takes a lengthy sip as Margaret leaves the lavatory and he enters. In Nicole's dwelling, framed pictures on the table display a younger, beaming Nicole with her mother. Nicole gently taps the needle. Then pushes out a small droplet that slides down the needle. She tightens a tourniquet around her limb and grips the end securely in her mouth. She positions the needle and injects. Her limbs relax and she releases the needle. She reclines, eyes shut. The strap drops from her mouth. Her head lolls to her shoulder. Her dilated pupils shrink to tiny dots. She grasps the packet of cocaine that Kip gave her and falls on her side. The packet lands inches from her hand. Her fingers extend, but only push it away. Her hand becomes motionless as feet materialize under the portal. In the cockpit, Whip dozes with paper covering his eyes and his sunglasses over the paper. Ken's yoke jerks away. The yoke slips out of Ken's hands as Whip struggles to regain control and the aircraft begins to plummet. The wheels of the aircraft unfold. In the galley, Margaret grabs the telephone. Margaret unbuckles her seat belt. Alarmed travelers clutch the seat in front of them as a flight attendant attempts to aid someone. Cammie falls and strikes her head. Cammie lies motionless. Whip banks to the left. The aircraft rotates upside down. She slides the side-stick forward. One wheel becomes jammed while retracting. Inside the cabin, Cammie comes to a rest on the ceiling. Trina observes a young lad slip out of his seat. Outside Georgian Gardens, a medical aide wheels Nicole beside Fran as the inverted aircraft flies past. Trina crawls to the lad and secures him back in his seat. A light blinks on the control panel in the cockpit. The aircraft turns upright, and the still-unconscious Cammie falls on some travelers. Trina loses her grip and falls against the bulkhead. Fire and smoke billow from the left engine."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The passengers are smiled at by Trina from her jump seat. The phone is taken by Whip. The car is exited by Nicole, who runs up to the second floor of a small run-down apartment complex. A key is pulled out by her as she reaches the door, only to discover it is slightly open. He is smiled at by her. The doorway is stood in by him. The door is kicked closed by her. Her bag is flung by her on a table, and it hits a box which is knocked over and whose contents are scattered. A syringe is spotted by her. Into the intercom, Whip speaks. The contents of a small vodka bottle are poured by him into a juice container hidden from the passengers' view. Three miniature bottles are tossed by him as the spiked orange juice is grabbed. A long drink is taken by him as Margaret exits the toilet and he enters. In Nicole's apartment, framed photographs on the table show a younger, smiling Nicole with her mother. The syringe is lightly tapped by Nicole. Then a small drop is pushed out by her that slides down the needle. A tourniquet is tightened around her arm, and the end is held securely in her mouth by her. The needle is positioned by her and she injects. Her arms are relaxed and the syringe is let go of by her. She leans back, eyes closed. The strap falls from her mouth. Her head lulls to her shoulder. Her dilated pupils shrink to tiny dots. The packet of cocaine that Kip gave her is grabbed by her and she falls on her side. The packet falls inches from her hand. Her fingers reach out, but only push it away. Her hand goes still as feet appear under the door. Whip sleeps in the cockpit with paper covering his eyes and his sunglasses over the paper. Ken jerks the yoke. Ken's hands let the yoke slip as Whip struggles to gain control and the plane begins to dive. The aircraft's wheels are unfolded. In the galley, the phone is grabbed by Margaret. Her seat belt is unbuckled by Margaret. The seat in front of them is grasped by alarmed passengers as someone is assisted by a flight attendant. Cammie falls and hits her head. Cammie lies still. To the left, Whip banks. The plane is turned upside down. The side-stick is slid forward by her. One wheel gets stuck while it retracts. Inside the cabin, Cammie comes to a rest on the ceiling. A young boy is seen by Trina as he slips out of his seat. Outside Georgian Gardens, Nicole is wheeled by a medical aide beside Fran as the upside-down plane flies past. To the boy, Trina crawls and straps him back in his seat. On the control panel in the cockpit, a light flashes. Upright, the plane turns, and the still-unconscious Cammie falls on some passengers. Her hold is lost by Trina and she falls against the bulkhead. Fire and smoke billow from the left engine."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Trina smiles at passengers from her jump seat. Whip takes the phone as Nicole exits the car, running up to her shabby apartment's second floor. She discovers the door slightly open, kicks it closed, and accidentally knocks over a box. She finds a syringe, checks it, and injects. Relaxing, her pupils contract. She attempts to grab Kip's cocaine, but her hand goes still. Feet appear under the door. In the cockpit, Whip naps with paper over his eyes. Ken loses control of the plane, causing it to dive. Margaret unbuckles as passengers brace for impact. Cammie falls and lies motionless. Whip turns the plane upside down; a wheel gets stuck. Cammie lands on the ceiling. Trina secures a young boy. Outside Georgian Gardens, medics wheel Nicole past as the plane flies overhead. Trina loses grip and hits the bulkhead. Fire and smoke come from the left engine."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Trina smiles at passengers from her jump seat. Whip takes the phone. Nicole runs to her apartment and finds the door slightly open. She smiles at a man, kicks the door closed, and accidentally scatters a box's contents. She sees a syringe, taps it, tightens a tourniquet, injects, and relaxes. Her pupils shrink, she reaches for cocaine, but her hand goes still as feet appear under the door. In the cockpit, Whip naps with paper and sunglasses over his eyes. Ken loses control of the yoke, and the plane dives. Passengers panic; Cammie falls, hits her head, and lies still. Whip banks left, the plane flips upside down, and one wheel sticks. Trina straps a boy back in his seat as a medical aide wheels Nicole outside Georgian Gardens. The plane turns upright, Cammie falls on passengers, and Trina hits the bulkhead. Fire and smoke erupt from the left engine."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Trina, seated comfortably in her jump seat, beams a warm smile and surveys the array of passengers in the cabin. Meanwhile, Whip reaches for the phone with a deliberate motion. Elsewhere, Nicole exits the car with urgency and swiftly ascends to the second floor of a weathered and dilapidated apartment complex. As she approaches the door, she retrieves a key from her bag, only to find that the door is already slightly ajar, which surprises her. She offers him a smile. He remains standing in the doorway. With a decisive kick, she shuts the door behind her. She energetically flings her bag onto a table, inadvertently knocking over a box, which consequently spills its contents across the floor. Her eyes catch sight of a syringe. At this point, Whip speaks clearly into the intercom. He discreetly pours the contents of a small vodka bottle into a juice container, keeping it concealed from the passengers. He casually tosses aside three miniature bottles as he reaches for the now-spiked orange juice. Taking a long, satisfying drink, he makes room as Margaret emerges from the toilet and he enters in her place. In the intimate space of Nicole's apartment, framed photographs decorate the table, displaying images of a younger, radiant Nicole alongside her mother. Nicole gently taps the syringe with a practiced hand. She then carefully pushes out a small drop of liquid that slowly drips down the needle. She wraps a tourniquet tightly around her arm, securing the end with her mouth. With precision, she positions the needle and administers the injection. Her arm releases its tension, and she lets the syringe fall from her grasp. She leans back, her eyes drifting closed, as the strap slips from her mouth. Her head tilts softly to her shoulder, and her dilated pupils begin to constrict into minuscule dots. She reaches for the packet of cocaine that Kip had earlier provided, collapsing onto her side. The packet lands mere inches from her outstretched hand. Her fingers extend towards it, but only manage to push it further away. Her hand comes to a halt, lifeless, as footsteps become visible under the door. In the aircraft's cockpit, Whip is dozing with papers draped over his eyes, sunglasses perched on top of the papers. Ken's grip on the yoke falters as it jerks away unexpectedly. The yoke slips from Ken's hands, prompting Whip to wrest control as the plane embarks on a rapid descent. The aircraft’s wheels visibly extend outwards. In the galley, Margaret urgently grabs the phone. She swiftly unbuckles her seat belt. Passengers, alarmed and growing ever more anxious, clutch the seats in front of them while a flight attendant attempts to assist a fellow traveler. Cammie loses her footing and strikes her head in the chaos, falling motionless. Whip maneuvers the plane to bank sharply to the left. The entire aircraft flips upside down. She slides the side-stick forward. One wheel becomes stuck, refusing to retract properly. Inside the cabin, Cammie comes to a rest on what is now the ceiling. Trina observes a young boy slipping out of his seat amidst the pandemonium. Outside at Georgian Gardens, a medical aide wheels Nicole beside Fran as, astonishingly, the inverted plane roars overhead. Trina crawls over to the boy, skillfully strapping him securely back into his seat. A warning light flickers ominously on the control panel within the cockpit. The plane rights itself, rolling to an upright position, and the still-unconscious Cammie drops onto several passengers. Trina loses her grip and falls against the hard bulkhead. To add to the harrowing situation, fire and thick smoke pour forth from the plane's left engine."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Trina, seated comfortably and contentedly in her jump seat, beams a warm and welcoming smile as she surveys the diverse array of passengers occupying the cabin. Meanwhile, Whip reaches for the phone with a deliberate and measured motion. In another part of the city, Nicole, with a sense of urgency, exits the car and swiftly ascends to the second floor of a weathered and dilapidated apartment complex. As she approaches the door, she retrieves a key from her bag, only to be surprised to find the door already slightly ajar. She offers him a smile, but he remains standing in the doorway. With a decisive kick, she shuts the door behind her. Energetically, she flings her bag onto a table, inadvertently knocking over a box, which consequently spills its contents across the floor. Her eyes catch sight of a syringe among the scattered items. At this critical point, Whip speaks clearly and audibly into the intercom. He discreetly pours the contents of a small bottle of vodka into a juice container, carefully concealing this action from the passengers. He casually tosses aside three miniature bottles as he reaches for the now-spiked orange juice. Taking a long, satisfying drink, he makes room for Margaret, who emerges from the toilet, allowing him to enter in her place. Inside the intimate space of Nicole's apartment, framed photographs decorate the table, displaying cherished images of a younger, radiant Nicole alongside her mother. With a practiced hand, Nicole gently taps the syringe, then carefully pushes out a small drop of liquid that slowly drips down the needle. She wraps a tourniquet tightly around her arm, securing the end with her mouth. With precision, she positions the needle and administers the injection. Her arm releases its tension, and she lets the syringe fall from her grasp. Leaning back, her eyes drift closed, as the strap slips from her mouth. Her head softly tilts to her shoulder, while her dilated pupils begin to constrict into minuscule dots. She reaches for the packet of cocaine that Kip had earlier provided, but collapses onto her side. The packet lands mere inches from her outstretched hand. Her fingers extend towards it but manage only to push it further away. Her hand comes to a halt, lifeless, just as footsteps become visible under the door. In the aircraft's cockpit, Whip is dozing, with papers draped over his eyes and sunglasses perched on top. Ken's grip on the yoke falters as it unexpectedly jerks away. The yoke slips from his hands, prompting Whip to wrest control as the plane embarks on a rapid and sudden descent. The aircraft’s wheels visibly extend outwards. In the galley, Margaret urgently grabs the phone, swiftly unbuckling her seat belt. Passengers, alarmed and growing ever more anxious, clutch the seats in front of them, while a flight attendant attempts to assist a fellow traveler. Amidst the chaos, Cammie loses her footing and strikes her head, falling motionless. Whip maneuvers the plane to bank sharply to the left, and the entire aircraft flips upside down. She slides the side-stick forward. One wheel becomes stuck, stubbornly refusing to retract properly. Inside the cabin, Cammie comes to a rest on what is now the ceiling. Trina observes a young boy slipping out of his seat amidst the pandemonium. Outside at Georgian Gardens, a medical aide wheels Nicole beside Fran as, astonishingly, the inverted plane roars overhead. Trina crawls over to the boy, skillfully strapping him securely back into his seat. A warning light ominously flickers on the control panel within the cockpit. The plane rights itself, rolling to an upright position, and the still-unconscious Cammie drops onto several passengers. Trina loses her grip and falls against the hard bulkhead. To add to the already harrowing situation, fire and thick smoke pour forth from the plane's left engine."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Trina, seated securely in her jump seat, allows a warm smile to spread across her face as she casts her gaze over the passengers, absorbing the ambiance around her. Meanwhile, Whip reaches out deliberately to take hold of the phone, executing this task with intentional focus. Elsewhere, Nicole, after stepping out of the car, moves quickly—nearly sprinting—toward a slightly dilapidated apartment complex, making her way up to the second floor. Her intent is clear as she reaches into her pocket to retrieve a key, naturally expecting to unlock the door, but she pauses abruptly upon noticing that it is already ajar. She directs a smile at him, projecting a mix of recognition and affection, while he remains standing stationary within the frame of the doorway. With a swift, assertive motion, she kicks the door shut, signaling her possession of the space. Tossing her bag with casual force, it lands on a table and inadvertently knocks over a box, which disastrously spills its contents across the surface. Her attention is caught and held by the sight of a syringe among the scattered items. Concurrently, Whip, still engaged with his duties, speaks into the intercom with practiced ease, and then discreetly empties the contents of a small vodka bottle into a juice container, making sure to keep this action hidden from the passengers' view. He skillfully discards three miniature bottles, moving with efficiency as he retrieves the now-spiked orange juice, relishing a long drink. As Margaret emerges from the toilet, Whip decisively moves into the small space. In the contrasting silence of Nicole's apartment, framed photographs sit prominently on a table, depicting a younger, joy-filled Nicole alongside her mother. Amid this backdrop, Nicole taps the syringe lightly, flicking a finger against it to dislodge any air bubbles, then expelling a tiny drop of liquid that trails down the needle. With precision and care, she winds a tourniquet tightly around her arm, holding one end firmly in her mouth. Carefully angling the needle, she administers the injection, her muscles gradually relaxing as she finishes, allowing the syringe to drop from her grasp. Leaning back into a state of detachment, her eyes drift closed, the strap falling away from her mouth as her head gently settles onto her shoulder. Her pupils, once wide and dilated, contract to minute pinpricks. In her languor, she reaches for the packet of cocaine given to her by Kip, collapsing onto her side, inadvertently causing the packet to fall just out of reach. Her fingers stretch towards it, brushing against it only to nudge it further away, before going completely still as footsteps become visible under the door. In the cockpit, Whip settles into a fitful slumber with sheets of paper laid over his eyes and sunglasses perched above them, creating a makeshift blindfold. A sudden, unexpected jerk disrupts Ken's hold on the yoke, which slips out of his hands as Whip is jarred awake, striving desperately to regain control of the aircraft as it begins to plummet. The aircraft wheels unfold, preparing for an emergency landing. In the galley, Margaret, sensing urgency, grabs the phone, swiftly unbuckling her seat belt to brace for impact. Alarm sweeps through the cabin, where passengers, gripped by panic, clutch desperately at the seats in front of them, while a flight attendant rushes to aid someone in distress. Amid the chaos, Cammie loses her balance and strikes her head, coming to rest motionless. Struggling to stabilize the aircraft, Whip banks it sharply left, flipping the plane upside down. Margret executes a controlled maneuver by sliding the side-stick forward, though one wheel stubbornly remains stuck while retracting. Within the inverted cabin, Cammie ends up lying on the ceiling, the shift rendering up and down meaningless. Trina, in a valiant effort, sees a young boy slipping from his seat and crawls over to secure him back with the seatbelt. As the upside-down plane careens above, outside Georgian Gardens, a medical aide swiftly wheels Nicole alongside Fran, adding to the bizarre scene. Despite the disarray, Trina manages an act of heroism by securing the boy, but a flashing light on the cockpit's control panel demands immediate attention. The plane rights itself, careening back to an upright position, causing the still-unconscious Cammie to tumble onto a cluster of passengers. Yet, momentum and gravity betray Trina, sending her sprawling against the bulkhead just as fire and smoke begin to spew ominously from the left engine, painting a dire picture of the scene's escalating intensity."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Trina smiles at the passengers from her jump seat as Whip takes the phone. Meanwhile, Nicole exits her car and rushes to her apartment, key in hand, only to find the door slightly ajar. After exchanging a smile with a man, she kicks the door shut, tosses her bag onto a table, inadvertently knocking over a box and revealing a syringe. In the cockpit, Whip discreetly pours vodka into a juice container and drinks before entering the toilet as Margaret exits. Back in Nicole's apartment, framed photographs reveal memories with her mother. Nicole prepares the syringe, injects herself, and falls back as her pupils contract. She reaches for a cocaine packet, but it slips from her grasp as feet appear under the door. \n\nIn the cockpit, Whip dozes with paper and sunglasses over his eyes. Suddenly, Ken loses control, and the plane starts diving. Margaret grabs the phone as the passengers brace themselves. Cammie is knocked unconscious as the plane flips upside down. Trina secures a young boy back into his seat. Outside, medics wheel Nicole past as the inverted plane flies overhead. Trina loses her grip and is thrown against the bulkhead. The plane regains an upright position while Cammie falls onto passengers, and fire erupts from the left engine."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Trina, a seasoned flight attendant with years of experience ensuring passenger safety, smiles and looks at the passengers from her jump seat at the rear of the aircraft. Whip, an experienced pilot who has navigated numerous challenging flights, takes the phone. Nicole exits the car and swiftly runs up to the second floor of a small run-down apartment complex known for its affordability and history of disrepair in the city. She pulls out a key as she reaches the door, only to discover it is slightly open, a potential sign of either neglect or an unwelcome visitor. She smiles at him, a neighbor she often encounters. He stands in the doorway, offering a nod of familiarity. She kicks the door closed behind her, securing the entrance. She flings her bag on a table, and it hits a fragile cardboard box which falls and scatters its contents, revealing old photographs and personal effects. She spots a syringe, a troubling item in a familiar place. Whip, maintaining an air of authority in the cockpit, speaks into the intercom. He discreetly pours the contents of a small vodka bottle into a juice container hidden from the passengers' view, a risky behavior that belies professional decorum. He tosses three miniature bottles into a trash bin as he grabs the spiked orange juice. He takes a long drink as Margaret, a fellow flight attendant known for her calm demeanor, exits the toilet and he goes in. In Nicole's apartment, framed photographs on the table show a younger, smiling Nicole with her mother, depicting happier times. Nicole lightly taps the syringe, a habitual action to eliminate air bubbles. Then pushes out a small drop that slides down the needle. She tightens a tourniquet around her arm and holds the end securely in her mouth, a practiced yet dangerous ritual. She positions the needle and injects, seeking escape from current troubles. Her arms relax and she lets go of the syringe. She leans back, eyes closed, as the effects take hold. The strap falls from her mouth. Her head lulls to her shoulder, succumbing to the substance. Her dilated pupils shrink to tiny dots. She grabs the packet of cocaine that Kip, a local dealer known for his frequent encounters with law enforcement, gave her and falls on her side. The packet falls inches from her hand. Her fingers reach out, but only push it away, indicating a loss of coordination. Her hand goes still as feet appear under the door, suggesting an imminent entry. In the cockpit, Whip sleeps with paper covering his eyes and his sunglasses over the paper, a makeshift shield against the glaring sun. Ken's yoke jerks away, a sign of the aircraft's instability. The yoke slips out of Ken's hands as Whip struggles to gain control and the plane begins to dive. The wheels of the aircraft unfold, part of an emergency landing procedure. In the galley, Margaret grabs the phone to call for assistance. Margaret unbuckles her seat belt, preparing to aid passengers. Alarmed passengers grasp the seat in front of them, bracing for impact, as a flight attendant tries to assist someone who appears injured. Cammie, a fellow crew member, falls and hits her head in the chaos. Cammie lies still, temporarily unconscious. Whip banks to the left, attempting to stabilize the aircraft. The plane turns upside down, a rare and perilous maneuver. She slides the side-stick forward, striving to regain control. One wheel gets stuck while retracting, adding to the technical challenges. Inside the cabin, Cammie comes to a rest on the ceiling, highlighting the disorienting inversion. Trina sees a young boy slip out of his seat, a situation requiring urgent action. Outside Georgian Gardens, a local medical facility noted for emergency care, a medical aide wheels Nicole beside Fran, her concerned friend, as the upside-down plane flies past above them. Trina crawls to the boy and straps him back in his seat, demonstrating her dedication to safety. A light flashes on the control panel in the cockpit, warning of a critical issue. The plane turns upright, and the still-unconscious Cammie falls on some passengers, adding to the onboard turmoil. Trina loses her hold and falls against the bulkhead, experiencing the physical toll of the emergency. Fire and smoke billow from the left engine, signaling a serious mechanical failure."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "She spots a syringe Trina smiles and looks at the passengers from her jump seat Whip takes the phone Nicole gets out of the car and runs up to the second floor of a small rundown apartment complex She pulls out a key as she reaches the door only to discover it is slightly open The wheels of the aircraft unfold She smiles at him He stands in the doorway She kicks the door closed She flings her bag on a table and it hits a box which falls and scatters its contents She spots a syringe He stands in the doorway Cammie falls and hits her head Inside the cabin Whip speaks into the intercom He pours the contents of a small vodka bottle into a juice container hidden from the passengers' view Margaret grabs the phone He tosses three miniature bottles as he grabs the spiked orange juice He takes a long drink as Margaret exits the toilet and he goes in In Nicole's apartment framed photographs on the table show a younger smiling Nicole with her mother She flings her bag on a table and it hits a box which falls and scatters its contents Nicole lightly taps the syringe Then pushes out a small drop that slides down the needle Fire and smoke billow from the left engine She positions the needle and injects She tightens a tourniquet around her arm and holds the end securely in her mouth She positions the needle and injects Her arms relax and she let us go of the syringe She leans back eyes closed The strap falls from her mouth Her head lulls to her shoulder In Nicole's apartment framed photographs on the table show a younger smiling Nicole with her mother Her dilated pupils shrink to tiny dots She grabs the packet of cocaine that Kip gave her and falls on her side Ken's yoke jerks away The packet falls inches from her hand Her fingers reach out but only push it away She slides the sidestick forward Whip takes the phone Her hand goes still as feet appear under the door In the cockpit Whip sleeps with paper covering his eyes and his sunglasses over the paper Ken's yoke jerks away The plane turns upright and the stillunconscious Cammie falls on some passengers The yoke slips out of Ken's hands as Whip struggles to gain control and the plane begins to dive The wheels of the aircraft unfold In the galley The strap falls from her mouth Margaret grabs the phone Her dilated pupils shrink to tiny dots Margaret unbuckles her seat belt Trina sees a young boy slip out of his seat A light flashes on the control panel in the cockpit Alarmed passengers grasp the seat in front of them Trina crawls to the boy and straps him back in his seat as a flight attendant tries to assist someone Nicole gets out of the car and runs up to the second floor of a small rundown apartment complex Cammie falls and hits her head Cammie lies still Cammie lies still Whip banks to the left The plane turns upside down She slides the sidestick forward One wheel gets stuck while retracting She kicks the door closed Inside the cabin Cammie comes to a rest on the ceiling Alarmed passengers grasp the seat in front of them In the cockpit Whip sleeps with paper covering his eyes and his sunglasses over the paper Trina sees a young boy slip out of his seat Outside Georgian Gardens a medical aide wheels Nicole beside Fran as the upside down plane flies past Then pushes out a small drop that slides down the needle Trina crawls to the boy and straps him back in his seat A light flashes on the control panel in the cockpit The plane turns upright and the stillunconscious Cammie falls on some passengers Nicole lightly taps the syringe Trina loses her hold and falls against the bulkhead Fire and smoke billow from the left engine"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Trina smiles and looks at the passengers from her jump seat. Whip takes the phone. Nicole gets out of the car and runs up to the second floor of a small rundown apartment complex. She pulls out a key as she reaches the door only to discover it is slightly open. She smiles at him. He stands in the doorway. She kicks the door closed. She flings her bag on a table and it hits a box which falls and scatters its contents. She spots a syringe. Whip speaks into the intercom. He pours the contents of a small vodka bottle into a juice container hidden from the passengers' view. He tosses three miniature bottles as he grabs the spiked orange juice. He takes a long drink as Margaret exits the toilet and he goes in. In Nicole's apartment framed photographs on the table show a younger smiling Nicole with her mother. Nicole lightly taps the syringe. Then pushes out a small drop that slides down the needle. She tightens a tourniquet around her arm and holds the end securely in her mouth. She positions the needle and injects. Her arms relax and she let us go of the syringe. She leans back eyes closed. The strap falls from her mouth. Her head lulls to her shoulder. Her dilated pupils shrink to tiny dots. She grabs the packet of cocaine that Kip gave her and falls on her side. The packet falls inches from her hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Her fingers reach out but only push it away. Her hand goes still as feet appear under the door. In the cockpit Whip sleeps with paper covering his eyes and his sunglasses over the paper. Ken's yoke jerks away. The yoke slips out of Ken's hands as Whip struggles to gain control and the plane begins to dive. The wheels of the aircraft unfold. In the galley. Margaret grabs the phone. Margaret unbuckles her seat belt. Alarmed passengers grasp the seat in front of them. as a flight attendant tries to assist someone. Cammie falls and hits her head. Cammie lies still. Whip banks to the left. The plane turns upside down. She slides the sidestick forward. One wheel gets stuck while retracting. Inside the cabin. Cammie comes to a rest on the ceiling. Trina sees a young boy slip out of his seat. Outside Georgian Gardens a medical aide wheels Nicole beside Fran as the upside down plane flies past. Trina crawls to the boy and straps him back in his seat. A light flashes on the control panel in the cockpit. The plane turns upright and the stillunconscious Cammie falls on some passengers. Trina loses her hold and falls against the bulkhead. Fire and smoke billow from the left engine."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Trina smiles and looks at the passengers from her jump seat. Whip takes the phone. Nicole gets out of the car and runs up to the second floor of a small rundown apartment complex. She pulls out a key as she reaches the door only to discover it is slightly open. She smiles at him. He stands in the doorway. She kicks the door closed. She flings her bag on a table and it hits a box which falls and scatters its contents. She spots a syringe. Whip speaks into the intercom. He pours the contents of a small vodka bottle into a juice container hidden from the passengers' view. He tosses three miniature bottles as he grabs the spiked orange juice. He takes a long drink as Margaret exits the toilet and he goes in. In Nicole's apartment framed photographs on the table show a younger smiling Nicole with her mother. Nicole lightly taps the syringe. Then pushes out a small drop that slides down the needle. She tightens a tourniquet around her arm and holds the end securely in her mouth. She positions the needle and injects. Her arms relax and she let us go of the syringe. She leans back eyes closed. The strap falls from her mouth. Her head lulls to her shoulder. Her dilated pupils shrink to tiny dots. She grabs the packet of cocaine that Kip gave her and falls on her side. The packet falls inches from her hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Her fingers reach out but only push it away. Her hand goes still as feet appear under the door. In the cockpit Whip sleeps with paper covering his eyes and his sunglasses over the paper. Ken's yoke jerks away. The yoke slips out of Ken's hands as Whip struggles to gain control and the plane begins to dive. The wheels of the aircraft unfold. In the galley. Margaret grabs the phone. Margaret unbuckles her seat belt. Alarmed passengers grasp the seat in front of them. as a flight attendant tries to assist someone. Cammie falls and hits her head. Cammie lies still. Whip banks to the left. The plane turns upside down. She slides the sidestick forward. One wheel gets stuck while retracting. Inside the cabin. Cammie comes to a rest on the ceiling. Trina sees a young boy slip out of his seat. Outside Georgian Gardens a medical aide wheels Nicole beside Fran as the upside down plane flies past. Trina crawls to the boy and straps him back in his seat. A light flashes on the control panel in the cockpit. The plane turns upright and the stillunconscious Cammie falls on some passengers. Trina loses her hold and falls against the bulkhead. Fire and smoke billow from the left engine."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Trina smiles and looks at the passengers from her jump seat. Whip takes the phone. Nicole gets out of the car and runs up to the second floor of a small rundown apartment complex. She pulls out a key as she reaches the door only to discover it is slightly open. She smiles at him. He stands in the doorway. She kicks the door closed. She flings her bag on a table and it hits a box which falls and scatters its contents. She spots a syringe. Whip speaks into the intercom. He pours the contents of a small vodka bottle into a juice container hidden from the passengers' view. He tosses three miniature bottles as he grabs the spiked orange juice. He takes a long drink as Margaret exits the toilet and he goes in. Whip banks to the left. The plane turns upside down. She slides the sidestick forward. One wheel gets stuck while retracting. Inside the cabin. Cammie comes to a rest on the ceiling. Trina sees a young boy slip out of his seat. Outside Georgian Gardens a medical aide wheels Nicole beside Fran as the upside down plane flies past. Trina crawls to the boy and straps him back in his seat. A light flashes on the control panel in the cockpit. The plane turns upright and the stillunconscious Cammie falls on some passengers. Trina loses her hold and falls against the bulkhead. Fire and smoke billow from the left engine."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Trina smiles and looks at the passengers from her jump seat. Whip takes the phone. Nicole gets out of the car and runs up to the second floor of a small rundown apartment complex. She pulls out a key as she reaches the door only to discover it is slightly open. She smiles at him. Outside Georgian Gardens a medical aide wheels Nicole beside Fran as the upside down plane flies past. Trina crawls to the boy and straps him back in his seat. A light flashes on the control panel in the cockpit. The plane turns upright and the stillunconscious Cammie falls on some passengers. Trina loses her hold and falls against the bulkhead. Fire and smoke billow from the left engine."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Benny smiles and looks at the passengers from her jump seat. The cat takes the phone. The dog gets out of the car and runs up to the second floor of a small run-down apartment complex. The dog pulls out a key as it reaches the door, only to discover it is slightly open. The dog smiles at the frog. The frog stands in the doorway. The dog kicks the door closed. The dog flings its bag on a table, and it hits a box which falls and scatters its contents. The dog spots a syringe. The cat speaks into the intercom. The cat pours the contents of a small vodka bottle into a juice container hidden from the passengers' view. The cat tosses three miniature bottles as it grabs the spiked orange juice. The cat takes a long drink as the eagle exits the toilet and the cat goes in. In the dog's apartment, framed photographs on the table show a younger, smiling dog with its mother. The dog lightly taps the syringe. Then pushes out a small drop that slides down the needle. The dog tightens a tourniquet around its arm and holds the end securely in its mouth. The dog positions the needle and injects. Its arms relax and it lets go of the syringe. It leans back, eyes closed. The strap falls from its mouth. Its head lulls to its shoulder. Its dilated pupils shrink to tiny dots. It grabs the packet of cocaine that the fish gave it and falls on its side. The packet falls inches from its hand. Its fingers reach out, but only push it away. Its hand goes still as feet appear under the door. In the cockpit, the cat sleeps with paper covering its eyes and its sunglasses over the paper. The rabbit's yoke jerks away. The yoke slips out of the rabbit's hands as the cat struggles to gain control and the plane begins to dive. The wheels of the aircraft unfold. In the galley, the eagle grabs the phone. The eagle unbuckles its seat belt. Alarmed passengers grasp the seat in front of them as a lion tries to assist someone. The mouse falls and hits its head. The mouse lies still. The cat banks to the left. The plane turns upside down. The bear slides the side-stick forward. One wheel gets stuck while retracting. Inside the cabin, the mouse comes to a rest on the ceiling. Benny sees a young boy slip out of his seat. Outside Georgian Gardens, a medical aide wheels the dog beside the owl as the upside down plane flies past. Benny crawls to the boy and straps him back in his seat. A light flashes on the control panel in the cockpit. The plane turns upright, and the still-unconscious mouse falls on some passengers. Benny loses its hold and falls against the bulkhead. Fire and smoke billow from the left engine."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Trina smiles and looks at the passengers from her swing seat. Whip takes the remote control. Nicole gets out of the tram and runs up to the second floor of a small run-down motel. She pulls out a pen as she reaches the window, only to discover it is slightly open. She smiles at him. He stands in the window frame. She kicks the window closed. She flings her backpack on a bench, and it hits a crate which falls and scatters its contents. She spots a toothbrush. Whip speaks into the megaphone. He pours the contents of a small olive oil bottle into a teapot hidden from the passengers' view. He tosses three miniature cartons as he grabs the spiked apple juice. He takes a long drink as Margaret exits the broom closet and he goes in. In Nicole's motel room, framed paintings on the bench show a younger, smiling Nicole with her mother. Nicole lightly taps the toothbrush. Then pushes out a small drop that slides down the bristles. She tightens a belt around her arm and holds the end securely in her mouth. She positions the bristles and brushes. Her arms relax and she lets go of the toothbrush. She leans back, eyes closed. The belt falls from her mouth. Her head lulls to her shoulder. Her dilated pupils shrink to tiny dots. She grabs the packet of flour that Kip gave her and falls on her side. The packet falls inches from her hand. Her fingers reach out, but only push it away. Her hand goes still as feet appear under the window. In the cockpit, Whip sleeps with napkins covering his eyes and his sunglasses over the napkins. Ken's wheel jerks away. The wheel slips out of Ken's hands as Whip struggles to gain control and the balloon begins to dive. The wheels of the glider unfold. In the kitchen, Margaret grabs the mirror. Margaret unbuckles her harness. Alarmed passengers grasp the tray in front of them as a flight attendant tries to assist someone. Cammie falls and hits her elbow. Cammie lies still. Whip banks to the left. The glider turns upside down. She slides the joystick forward. One wheel gets stuck while retracting. Inside the cabin, Cammie comes to a rest on the ceiling. Trina sees a young boy slip out of his harness. Outside Georgian Meadows, a medical aide wheels Nicole beside Fran as the upside-down glider flies past. Trina crawls to the boy and straps him back in his harness. A light flashes on the control panel in the cockpit. The glider turns upright, and the still-unconscious Cammie falls on some passengers. Trina loses her hold and falls against the wall. Fire and smoke billow from the left propeller."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Trina waves and nods at the passengers from her jump seat. Whip picks up the phone. Nicole steps out of the car and climbs up to the second floor of a small run-down apartment complex. She fishes out a key as she approaches the door, only to discover it is slightly open. She waves at him. He waits in the doorway. She pushes the door closed. She drops her bag on a table, and it strikes a box which tips over and spills its contents. She notices a syringe. Whip whispers into the intercom. He mixes the contents of a small vodka bottle into a juice container hidden from the passengers' view. He discards three miniature bottles as he seizes the spiked orange juice. He sips it as Margaret exits the toilet and he steps in. In Nicole's apartment, framed photographs on the table display a younger, smiling Nicole with her mother. Nicole gently shakes the syringe. Then squirts out a small drop that drips down the needle. She loosens a tourniquet around her arm and secures the end in her mouth. She aligns the needle and administers. Her arms slacken and she releases the syringe. She reclines, eyes closed. The strap slips from her mouth. Her head tilts to her shoulder. Her dilated pupils constrict to tiny dots. She clutches the packet of cocaine that Kip gave her and tumbles on her side. The packet lands inches from her hand. Her fingers stretch out, but merely nudge it away. Her hand remains still as feet materialize under the door. In the cockpit, Whip dozes with paper covering his eyes and his sunglasses over the paper. Ken's yoke shifts away. The yoke slides out of Ken's hands as Whip grapples to gain control and the plane begins to dive. The wheels of the aircraft unfold. In the galley, Margaret snatches the phone. Margaret releases her seat belt. Alarmed passengers hold onto the seat in front of them as a flight attendant attempts to assist someone. Cammie stumbles and knocks her head. Cammie rests still. Whip veers to the left. The plane flips upside down. She nudges the side-stick forward. One wheel gets stuck while retracting. Inside the cabin, Cammie settles on the ceiling. Trina observes a young boy slide out of his seat. Outside Georgian Gardens, a medical aide rolls Nicole beside Fran as the upside-down plane flies past. Trina inches to the boy and secures him back in his seat. A light blinks on the control panel in the cockpit. The plane turns upright, and the still-unconscious Cammie drops on some passengers. Trina loses her grip and tumbles against the bulkhead. Fire and smoke erupt from the left engine."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Baxter laughs and glances at the athletes from his hammock. Rusty grabs the calendar. Michele climbs out of the boat and sprints up to the third story of a large pristine mansion. He pulls out a map as he arrives at the gate, only to find it is slightly ajar. He laughs at it. She stands in the hallway. He slams the door shut. He tosses his hat on a chair, and it strikes a vase which topples over and scatters its components. He notices a pencil. Rusty talks into the microphone. She empties the contents of a small tea kettle into a milk carton concealed from the athletes' view. She flings three tiny spoons as she snatches the spiked apple juice. She takes a deep gulp as Lindsey exits the pantry and she enters. In Michele's mansion, framed sketches on the chair show an older, frowning Michele with his uncle. Michele gently taps the pencil. Then dribbles out a small bead that drips down the tip. He loosens a ribbon around his ankle and grips the end firmly in his hand. He aligns the tip and punctures. His ankle relaxes and he releases the pencil. He leans forward, eyes open. The cord slips from his hand. His head droops to his chest. His wide pupils swell to large circles. He seizes the bundle of sugar that Leo handed her and collapses on his back. The bundle lands inches from his foot. His toes stretch out, but merely nudge it away. His foot remains still as wheels appear beneath the archway. In the office, Rusty dozes with pillows covering his ears and his headphones over the pillows. Max's joystick yanks aside. The joystick slides out of Max's fingers as Rusty struggles to regain command and the helicopter starts to plummet. The blades of the rotor unfurl. In the kitchen, Lindsey snatches the calendar. Lindsey unclips his helmet. Frightened athletes clutch the bar in back of them as an usher attempts to help someone. Tammy trips and bumps her elbow. Tammy remains motionless. Rusty veers to the right. The helicopter spins sideways. He pushes the joystick downward. One blade gets jammed while extending. Inside the cabin, Tammy comes to a stop on the floor. Baxter observes an old man tumble out of his chair. Outside Oceanic Plaza, a transport aide pushes Michele next to Tony as the sideways helicopter hovers past. Baxter crawls to the man and buckles him back in his chair. A bulb flashes on the dashboard in the office. The helicopter rotates upright, and the still-motionless Tammy tumbles on a few athletes. Baxter loses his grip and bumps against the railing. Ashes and fog puff from the right rotor."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Gina nods and gazes at the tourists from her lounge chair. Flip grasps the remote. Nora hops out of the boat and dashes up to the third floor of a small pristine apartment complex. She fishes out a map as she arrives at the window, only to find it is slightly ajar. She nods at him. He lounges in the window frame. She nudges the window shut. She tosses her hat on a shelf, and it dislodges a lamp which topples and scatters its bulbs. She notices a candle. Flip murmurs into the walkie-talkie. He drizzles the contents of a small olive oil bottle into a coffee mug hidden from the tourists' view. He flings three tiny bottles as he grabs the infused apple juice. He takes a swift gulp as Lisa exits the closet and he steps in. In Nora's apartment, framed drawings on the shelf show a younger, grinning Nora with her father. Nora gently flicks the candle. Then squeezes out a small flicker that glides down the wick. She loosens a ribbon around her wrist and holds the edge loosely in her mouth. She aligns the matchstick and lights it. Her hands drop and she releases the candle. She reclines, eyes shut. The ribbon slips from her mouth. Her head slumps to her elbow. Her wide eyes narrow to tiny slits. She snatches the envelope of sugar that Kip handed her and rolls onto her back. The envelope rests inches from her foot. Her toes stretch out, but merely nudge it away. Her foot stays still as shadows appear under the window. In the control room, Flip naps with books shielding his eyes and his hat over the books. Dan's pedal jerks away. The pedal slips out of Dan's grip as Flip fights to gain stability and the vehicle starts to plummet. The gears of the vehicle deploy. In the kitchen, Lisa reaches for the remote. Lisa detaches her watch. Anxious tourists clutch the rail in front of them as a guide attempts to help someone. Tammy trips and bashes her elbow. Tammy rests motionless. Flip veers to the right. The vehicle flips sideways. She pushes the stick backward. One gear gets jammed while folding. Inside the lounge, Tammy lands on the wall. Gina notices a young girl slide out of her bed. Outside Marina Gardens, a rescue worker rolls Nora beside Sue as the sideways vehicle speeds past. Gina slides to the girl and fastens her back in her bed. A button blinks on the control panel in the control room. The vehicle flips upright, and the still-motionless Tammy cascades onto some tourists. Gina loses her grip and slams into the partition. Flames and ash pour from the right gear."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Trina chuckles and gazes at the crew from her hammock. Whip grabs the remote. Nicole leaves the bicycle and sprints up to the second tier of a tiny abandoned warehouse. She retrieves a spoon as she reaches the gate, only to find it is slightly ajar. She grins at him. He kneels in the archway. She nudges the gate shut. She hurls her jacket on a couch, and it strikes a lamp which tumbles and scatters its bulbs. She notices a paintbrush. Whip whispers into the megaphone. He empties the contents of a small water bottle into a soda can hidden from the crew's sight. He flings three small towels as he snatches the laced lemonade. He takes a long sip as Margaret exits the closet, and he goes in. In Nicole's warehouse, framed portraits on the couch display a younger, grinning Nicole with her brother. Nicole gently flicks the paintbrush. Then presses out a small splash that spills down the bristles. She fastens a bracelet around her wrist and holds the end securely in her teeth. She aligns the brush and paints. Her fingers relax and she releases the paintbrush. She reclines, eyes shut. The bracelet drapes from her teeth. Her head droops to her shoulder. Her wide pupils contract to tiny points. She grabs the packet of glitter that Kip gave her and collapses on her back. The packet lands inches from her fingertips. Her fingers extend, but only nudge it further. Her hand remains still as shadows appear under the archway. In the control room, Whip naps with a magazine covering his eyes and his goggles over the magazine. Ken's lever jolts away. The lever slips out of Ken's grip as Whip struggles to regain balance and the vessel begins to descend. The sails of the yacht unfurl. In the kitchen, Margaret snatches the walkie-talkie. Margaret unfastens the rope around her waist. Alarmed crew members clutch the railing in front of them as a deckhand tries to help someone. Cammie stumbles and bumps her head. Cammie remains motionless. Whip steers to the right. The vessel turns on its side. She nudges the joystick backward. One sail gets stuck while unfurling. Inside the cabin, Cammie comes to a rest on the floor. Trina notices a young girl slip off her hammock. Outside Eastern Meadows, a paramedic rolls Nicole alongside Fran as the tilted yacht sails by. Trina crawls to the girl and secures her back in her hammock. A light blinks on the dashboard in the control room. The vessel rights itself, and the still-unconscious Cammie tumbles onto some crew. Trina loses her grip and tumbles against the railing. Fog and mist billow from the right sail."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Milo giggles and glances at the tourists from his swing chair. Blaze grabs the camera. Lily hops out of the truck and darts up to the third level of a spacious, pristine mansion. She fishes out a pen as she approaches the window, only to notice it is slightly ajar. She giggles at him. He leans in the archway. She nudges the window shut. She slings her jacket on a couch, and it nudges a vase which tips over and scatters its petals. She notices a comb. Blaze whispers into the loudspeaker. He empties the contents of a small soap box into a bowl concealed from the tourists' sight. He hurls three tiny boxes as he grabs the mixed cereal bowl. He gulps down a large bite as Laura exits the shower and he steps in. In Lily's mansion, framed paintings on the wall display a younger, joyful Lily with her father. Lily gently taps the comb. Then squeezes out a bit of gel that drips off the bristles. She wraps a scarf around her leg and holds the end firmly in her teeth. She aligns the comb and brushes. Her legs ease and she releases the comb. She sinks back, eyes shut. The scarf slips from her teeth. Her head tilts to her arm. Her wide eyes contract to small dots. She snatches the pouch of flour that Tim handed her and rolls onto her back. The pouch drops inches from her foot. Her toes stretch out but only nudge it away. Her foot remains still as shadows appear under the window. In the workshop, Blaze snoozes with cloth covering his forehead and his cap over the cloth. Ian's lever twists aside. The lever slides out of Ian's grip as Blaze wrestles to regain command and the train starts to descend. The wheels of the locomotive unfold. In the corridor, Laura seizes the camera. Laura releases her harness. Nervous tourists clutch the barrier in front of them as a tour guide tries to aid someone. Tammy stumbles and bumps her elbow. Tammy rests motionless. Blaze steers to the right. The train flips upside down. She nudges the joystick forward. One wheel becomes jammed while retracting. Inside the compartment, Tammy comes to a halt on the roof. Milo notices a young girl tumble out of her seat. Outside Clover Courtyards, a health worker rolls Lily beside Sam as the inverted train speeds past. Milo scrambles to the girl and fastens her back in her seat. A sign blinks on the control console in the workshop. The train rotates upright, and the still-unmoving Tammy tumbles onto some tourists. Milo loses his grip and collides with the barrier. Flames and mist surge from the right chimney."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Trina observes passengers from her jump seat. Meanwhile, Whip discreetly spikes orange juice with vodka during a flight. Nicole enters her apartment to find a syringe amid scattered possessions, uses it, and succumbs to drugs. In the cockpit, Whip sleeps as Ken struggles to control the plane. The aircraft starts to dive, causing chaos among passengers and crew. Cammie is injured, and Trina assists a slipping boy back into his seat. Outside, an upside-down plane flies past while Nicole is wheeled by medical aides. The plane turns upright, Cammie falls onto passengers, and Trina is thrown against the bulkhead as fire and smoke engulf an engine."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Fire and smoke billow from the left engine Trina loses her hold and falls against the bulkhead The plane turns upright and the stillunconscious Cammie falls on some passengers A light flashes on the control panel in the cockpit Trina crawls to the boy and straps him back in his seat Outside Georgian Gardens a medical aide wheels Nicole beside Fran as the upside down plane flies past Trina sees a young boy slip out of his seat Cammie comes to a rest on the ceiling Inside the cabin One wheel gets stuck while retracting She slides the sidestick forward The plane turns upside down Whip banks to the left Cammie lies still Cammie falls and hits her head as a flight attendant tries to assist someone Alarmed passengers grasp the seat in front of them Margaret unbuckles her seat belt Margaret grabs the phone In the galley The wheels of the aircraft unfold The yoke slips out of Ken's hands as Whip struggles to gain control and the plane begins to dive Ken's yoke jerks away In the cockpit Whip sleeps with paper covering his eyes and his sunglasses over the paper Her hand goes still as feet appear under the door Her fingers reach out but only push it away The packet falls inches from her hand She grabs the packet of cocaine that Kip gave her and falls on her side Her dilated pupils shrink to tiny dots Her head lulls to her shoulder The strap falls from her mouth She leans back eyes closed Her arms relax and she let us go of the syringe She positions the needle and injects She tightens a tourniquet around her arm and holds the end securely in her mouth Then pushes out a small drop that slides down the needle Nicole lightly taps the syringe In Nicole's apartment framed photographs on the table show a younger smiling Nicole with her mother He takes a long drink as Margaret exits the toilet and he goes in He tosses three miniature bottles as he grabs the spiked orange juice He pours the contents of a small vodka bottle into a juice container hidden from the passengers' view Whip speaks into the intercom She spots a syringe She flings her bag on a table and it hits a box which falls and scatters its contents She kicks the door closed He stands in the doorway She smiles at him She pulls out a key as she reaches the door only to discover it is slightly open Nicole gets out of the car and runs up to the second floor of a small rundown apartment complex Whip takes the phone Trina smiles and looks at the passengers from her jump seat"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Her fingers reach out but only push it away She grabs the packet of cocaine that Kip gave her and falls on her side She leans back eyes closed He tosses three miniature bottles as he grabs the spiked orange juice She smiles at him Outside Georgian Gardens a medical aide wheels Nicole beside Fran as the upside down plane flies past Her hand goes still as feet appear under the door Whip speaks into the intercom The yoke slips out of Ken's hands as Whip struggles to gain control and the plane begins to dive She tightens a tourniquet around her arm and holds the end securely in her mouth In the galley Her head lulls to her shoulder He takes a long drink as Margaret exits the toilet and he goes in She pulls out a key as she reaches the door only to discover it is slightly open The plane turns upside down Whip banks to the left He pours the contents of a small vodka bottle into a juice container hidden from the passengers' view The packet falls inches from her hand as a flight attendant tries to assist someone Trina smiles and looks at the passengers from her jump seat Cammie comes to a rest on the ceiling Her arms relax and she let us go of the syringe Margaret unbuckles her seat belt Trina loses her hold and falls against the bulkhead One wheel gets stuck while retracting The wheels of the aircraft unfold Ken's yoke jerks away The strap falls from her mouth Her dilated pupils shrink to tiny dots Inside the cabin Trina crawls to the boy and straps him back in his seat Cammie falls and hits her head Margaret grabs the phone Trina sees a young boy slip out of his seat In Nicole's apartment framed photographs on the table show a younger smiling Nicole with her mother Fire and smoke billow from the left engine The plane turns upright and the stillunconscious Cammie falls on some passengers Nicole gets out of the car and runs up to the second floor of a small rundown apartment complex In the cockpit Whip sleeps with paper covering his eyes and his sunglasses over the paper Cammie lies still He stands in the doorway Alarmed passengers grasp the seat in front of them She kicks the door closed She spots a syringe Nicole lightly taps the syringe Then pushes out a small drop that slides down the needle She positions the needle and injects A light flashes on the control panel in the cockpit Whip takes the phone She flings her bag on a table and it hits a box which falls and scatters its contents She slides the sidestick forward"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Her hand goes still as feet appear under the door In the cockpit Whip sleeps with paper covering his eyes and his sunglasses over the paper Ken's yoke jerks away The yoke slips out of Ken's hands as Whip struggles to gain control and the plane begins to dive The wheels of the aircraft unfold In the galley Margaret grabs the phone Margaret unbuckles her seat belt Alarmed passengers grasp the seat in front of them as a flight attendant tries to assist someone Cammie falls and hits her head Cammie lies still Whip banks to the left The plane turns upside down She slides the sidestick forward One wheel gets stuck while retracting Inside the cabin Cammie comes to a rest on the ceiling Trina sees a young boy slip out of his seat Outside Georgian Gardens a medical aide wheels Nicole beside Fran as the upside down plane flies past Trina crawls to the boy and straps him back in his seat A light flashes on the control panel in the cockpit The plane turns upright and the stillunconscious Cammie falls on some passengers Trina loses her hold and falls against the bulkhead Fire and smoke billow from the left engine Trina smiles and looks at the passengers from her jump seat Whip takes the phone Nicole gets out of the car and runs up to the second floor of a small rundown apartment complex She pulls out a key as she reaches the door only to discover it is slightly open She smiles at him He stands in the doorway She kicks the door closed She flings her bag on a table and it hits a box which falls and scatters its contents She spots a syringe Whip speaks into the intercom He pours the contents of a small vodka bottle into a juice container hidden from the passengers' view He tosses three miniature bottles as he grabs the spiked orange juice He takes a long drink as Margaret exits the toilet and he goes in In Nicole's apartment framed photographs on the table show a younger smiling Nicole with her mother Nicole lightly taps the syringe Then pushes out a small drop that slides down the needle She tightens a tourniquet around her arm and holds the end securely in her mouth She positions the needle and injects Her arms relax and she let us go of the syringe She leans back eyes closed The strap falls from her mouth Her head lulls to her shoulder Her dilated pupils shrink to tiny dots She grabs the packet of cocaine that Kip gave her and falls on her side The packet falls inches from her hand Her fingers reach out but only push it away"
        }
      ]
    }
  ]
}