{
  "ground_truth": "He reads the letter using the light from a nearby window and then picks up the bottle, throwing it hard across the room, which explodes against the hanging photo of his son, staring at it motionless. Rain falls steadily as Whip sits in the car, pouring alcohol into a bottle of juice and taking a drink, before exiting the car and entering a large hangar where the crashed South Jet Aircraft stands almost completely assembled with parts strewn around beside it, alongside cabinets and shelves lining one side of the building. Hugh follows Charlie out of the plane as Whip cocks his head, then Hugh turns and walks away. Whip speeds down the mud road, splashing slush to the side and brakes when he sees news crews outside the farmhouse. Some reporters spot him, so he reverses and drives back onto the main road, stopping opposite a house in a quiet neighborhood, pulling up on a curb barely missing a fire hydrant and chugs on the bottle of juice. He steps out of the car and walks up a footpath to a house where a man watches him from a parked car, speaking into his cell phone. Whip's ex-wife opens the door, but her smile fades as Whip hugs the struggling Will and turns off the news. Whip lifts his arms and walks down a hotel corridor with Charlie holding a can of Coca-cola, approaching a burly man. Hugh emerges from a room, and Whip enters the room where they shake hands and hug. Whip looks around the spacious room, picks up a can of Coke, and goes over to the fridge, finding it stocked with juices and nonalcoholic beverages. Later, he eats a meal alone in his room, lies in bed surfing channels on the TV, shaves, then tries to open the thick file Hugh left for him, which spreads like an accordion, and he abandons it. He sits over the toilet smoking as the bath fills, and the clock shows 2.08 AM as he hangs a suit in a wardrobe. He looks around for the source of the knocking and, lying in bed, he's awakened by the same sound. He gets out of bed, goes to a side door, holds his ear to it, then pulls it open, revealing the extended lock on a door leading to an adjoining room bumping repeatedly against the doorjamb. Whip enters the room, feeling a gentle breeze blow through the balcony doors ruffling drawn curtains. He walks over, gazes at the skyline, and sees a plane's beacon lights flash in the night sky. Whip turns around, and his eyes fall on a fridge. He opens the door to reveal rows of miniature bottles of alcohol on the shelves.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He peruses the note utilizing the glow from a nearby casement and then lifts the flask, flinging it forcefully across the chamber, which shatters against the suspended image of his offspring, gazing at it immobile. Precipitation descends continuously as Whip reclines in the automobile, decanting liquor into a container of nectar and taking a sip, prior to exiting the vehicle and entering a vast depot where the wrecked South Jet Aircraft remains nearly entirely reassembled with pieces scattered around beside it, alongside cupboards and racks lining one flank of the structure. Hugh trails Charlie out of the aircraft as Whip tilts his head, then Hugh pivots and strides away. Whip accelerates down the mire route, splattering sludge to the flank and halts when he perceives press crews outside the cottage. Some journalists notice him, so he reverses and navigates back onto the primary route, pausing opposite a residence in a serene district, pulling up on a side barely missing a fire plug and swigs on the flask of nectar. He steps out of the automobile and ambles up a pathway to a dwelling where a man observes him from a stationed car, speaking into his mobile phone. Whip's former spouse opens the entrance, but her grin diminishes as Whip embraces the struggling Will and switches off the broadcast. Whip raises his limbs and ambles down a hostel hallway with Charlie grasping a container of Coca-cola, nearing a hefty man. Hugh appears from a chamber, and Whip enters the space where they clasp hands and embrace. Whip glances around the ample space, lifts a container of Coke, and proceeds over to the refrigerator, discovering it stocked with nectars and nonalcoholic refreshments. Later, he consumes a repast alone in his room, reclines in bed surfing stations on the TV, shaves, then attempts to open the dense dossier Hugh left for him, which spreads like an accordion, and he forsakes it. He sits over the lavatory smoking as the bath fills, and the clock displays 2.08 AM as he suspends a suit in a closet. He glances around for the origin of the rapping and, lying in bed, he's roused by the identical noise. He rises from bed, proceeds to a lateral door, holds his ear to it, then pulls it ajar, disclosing the extended latch on a door leading to an adjoining chamber bumping repeatedly against the frame. Whip enters the room, sensing a gentle zephyr blow through the balcony portals ruffling drawn draperies. He strides over, gazes at the horizon, and discerns a plane's signal lights flicker in the nocturnal sky. Whip pivots around, and his sight falls on a refrigerator. He opens the entrance to reveal rows of diminutive vessels of liquor on the racks."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The letter is read by him using the light from a nearby window, and then the bottle is picked up by him, thrown hard across the room, which is exploded by it against the hanging photo of his son, who is stared at motionlessly. The rain falls steadily as alcohol is poured by Whip into a bottle of juice while sitting in the car, and a drink is taken by him before he exits the car and enters a large hangar where the crashed South Jet Aircraft is stood almost completely assembled with parts strewn around beside it, alongside cabinets and shelves that line one side of the building. Charlie is followed out of the plane by Hugh as Whip cocks his head, then Hugh turns and walks away. The mud road is sped down by Whip, slush is splashed to the side, and the brakes are applied by him when news crews are seen by him outside the farmhouse. He is spotted by some reporters, so the car is reversed by him and driven back onto the main road, where he stops opposite a house in a quiet neighborhood, pulling up on a curb barely missing a fire hydrant, and chugs on the bottle of juice. The car is exited by him, and he walks up a footpath to a house where he is watched by a man from a parked car, speaking into his cell phone. The door is opened by Whip's ex-wife, but her smile is faded as Will is hugged by Whip and the news is turned off by him. Whip's arms are lifted by him, and he walks down a hotel corridor with Charlie holding a can of Coca-cola, approaching a burly man. A room is emerged from by Hugh, and a handshake and hug are exchanged by Whip and him as Whip enters the room. The spacious room is looked around by Whip, a can of Coke is picked up, and he goes over to the fridge to find it stocked with juices and nonalcoholic beverages. Later, a meal is eaten by him alone in his room, the bed is laid on as channels are surfed on the TV, shaving is done, then the thick file left for him by Hugh is tried to open, which spreads like an accordion, and it is abandoned by him. He sits over the toilet smoking as the bath is filled, and the clock shows 2.08 AM as a suit is hung by him in a wardrobe. The source of the knocking is looked around for by him, and as he lies in bed, he is awakened by the same sound. The bed is gotten out of by him, a side door is gone to, his ear is held to it, then it is pulled open by him, revealing the extended lock on a door leading to an adjoining room bumping repeatedly against the doorjamb. The room is entered by Whip, and a gentle breeze is felt blowing through the balcony doors, ruffling drawn curtains. He walks over, the skyline is gazed at by him, and a plane's beacon lights are seen flashing in the night sky. Whip turns around, and his eyes fall on a fridge. The door is opened by him to reveal rows of miniature bottles of alcohol on the shelves."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He reads the letter by a window’s light, then hurls the bottle across the room, shattering it against his son's photo and stares motionless. As rain falls, Whip sits in the car, spikes juice with alcohol, drinks, then heads into a hangar where the almost-reassembled South Jet Aircraft stands among scattered parts and shelving. Hugh follows Charlie out as Whip watches, then Hugh departs. Whip speeds down a muddy road, braking at the news crews outside a farmhouse, reverses, and returns to the main road. He stops in a quiet neighborhood, narrowly avoids a fire hydrant, and drinks the juice bottle. Exiting the car, he approaches a house where a man in a parked car speaks on his phone. Whip’s ex-wife greets him but her smile fades when Whip embraces the resistant Will and turns off the news. Whip enters a hotel corridor with Charlie, carrying Coca-Cola, heading toward a burly man. Hugh exits a room, and Whip follows, greeting with a handshake and hug. Whip surveys the room, grabs a Coke, checks the fridge stocked with nonalcoholic drinks, eats alone, changes channels in bed, shaves, and attempts to open Hugh’s thick file, giving up as it unfolds. At 2:08 AM, he smokes over the toilet, fills the bath, and hangs a suit before investigating a knocking sound. He opens the side door to find an adjoining room door repeatedly hitting the doorjamb. Entering, he feels a breeze through open balcony doors, surveys the skyline, and spots a plane's beacon lights. Turning, he notices a fridge, opens it, and sees rows of miniature alcohol bottles."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He reads the letter by window light, throws a bottle at a photo of his son, and sits in the car drinking alcohol from a juice bottle. Whip enters a hangar with the crashed jet and parts scattered around. Hugh leaves the plane as Whip watches. Whip speeds down a muddy road, spots news crews, and reverses. He stops at a quiet neighborhood house, drinks juice, and approaches where his ex-wife lives. She opens the door, smiles at first but changes as he hugs Will and turns off the news. In a hotel corridor with Charlie, Whip meets a burly man. Inside, Whip holds a can of Coke, checks a fridge full of nonalcoholic drinks, and later eats alone, watches TV, and shaves. He attempts to open Hugh's thick file, gives up, and smokes in the bathroom. At 2:08 AM, he hangs a suit, hears knocking, checks a door, and finds it caused by an adjoining door lock. Entering the room, he feels a breeze through balcony doors, sees a skyline and plane lights, turns, and finds a fridge stocked with mini alcohol bottles."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He carefully reads the letter, utilizing the soft illumination provided by a nearby window to see the words clearly. Once finished, he picks up the bottle with a decisive motion and hurls it forcefully across the room. The bottle shatters spectacularly against a wall, right where a photo of his son is hanging. Staring at the broken glass and the image of his son, he remains utterly still. Meanwhile, outside, rain continues to fall steadily, creating a rhythmic patter. Inside his car, Whip pours alcohol into a convenient bottle of juice, takes a deliberate sip, and then steps out into the rain. He walks purposefully into a large hangar where the crashed South Jet Aircraft stands nearly reconstructed. Parts are scattered around it haphazardly, while orderly cabinets and shelves line one side of the expansive building. Hugh is seen trailing Charlie as they descend from the plane, catching Whip's eye as he tilts his head to watch them. Hugh then turns deliberately and walks away. Whip accelerates quickly down the mud-covered road, sending slush splashing to the side. He abruptly stops when he notices a group of eager news crews gathered outside the farmhouse. Some reporters catch sight of him, prompting him to reverse quickly and maneuver back onto the main road. He eventually stops opposite a house nestled in a quiet neighborhood, skillfully pulling up onto a curb, narrowly avoiding a fire hydrant. He takes another swig from the juice bottle before stepping out of the car. As he approaches a house using a narrow footpath, he notices a man from a parked car intently watching him and speaking into a cell phone. When Whip's ex-wife opens the door, her initial welcoming smile quickly fades as Whip embraces the struggling Will and switches off the broadcasting news. Later, Whip raises his arms and makes his way down a hotel corridor with Charlie, who is holding a can of Coca-Cola. They approach a large, muscular man. Hugh steps out from a nearby room as Whip enters, greeting him with a handshake and an embrace. Surveying the spacious room, Whip picks up a can of Coke and heads to the fridge, discovering it well-stocked with juices and nonalcoholic drinks. Later, he sits alone in his room, eating a meal in solitude. He subsequently lies in bed, mindlessly surfing through the channels on the TV. He shaves, then attempts to open the thick file that Hugh left for him. The file unfolds like an accordion, overwhelming him, and he gives up on it. Sitting on the toilet, he smokes as the bathtub fills with steaming water. The clock on the wall shows 2:08 AM as he hangs a neatly pressed suit in the wardrobe. Hearing a persistent knock, he looks around to find the source. While lying in bed, he is roused from sleep by the same sound. Rising, he walks to a side door, listens intently with his ear pressed against it, and then cautiously opens the door. It reveals an extended lock on a door leading to an adjoining room, repeatedly knocking against the doorjamb. Whip enters the adjoining room, feeling a gentle breeze blowing in through the open balcony doors, causing the drawn curtains to flutter softly. He walks over to the balcony, gazes thoughtfully at the distant skyline, and spots the beacon lights of a plane flashing in the vast night sky. Turning back, his eyes are drawn to a fridge. Opening the fridge door, he finds rows of miniature bottles of alcohol neatly arranged on the shelves."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He meticulously reads the letter, taking advantage of the gentle illumination streaming through a nearby window to clearly and effectively discern the words on the paper. Upon finishing, he reaches out, picking up the bottle with a decisive and deliberate motion, and forcefully hurls it across the room. The bottle shatters with an impressive and dramatic explosion against a wall, precisely where a photo of his son is prominently hanging. He stands there, transfixed, staring at the broken shards of glass and the image of his son, remaining utterly motionless. Meanwhile, outside, the rain continues to fall steadily and persistently, creating a rhythmic and soothing patter. Inside his car, Whip pours alcohol into a bottle of juice he finds conveniently at hand, takes a deliberate and measured sip, and then steps out into the relentless rain. Walking with purpose, he enters a vast hangar where the crashed South Jet Aircraft stands almost fully reconstructed. Various parts are scattered around it in a somewhat haphazard manner, while orderly cabinets and neatly arranged shelves line one side of the expansive building. Hugh is seen trailing behind Charlie as they descend from the plane, catching Whip's attention as he tilts his head to watch them. Hugh then turns deliberately and walks away. Whip accelerates swiftly down the mud-covered road, sending wet slush splashing to the sides. He comes to an abrupt halt when he notices a cluster of eager and attentive news crews gathered outside a nearby farmhouse. As some reporters catch sight of him, he quickly reverses and maneuvers his vehicle back onto the main road. He eventually comes to a stop across from a house nestled in a serene and quiet neighborhood, skillfully pulling up onto the curb, narrowly avoiding a nearby fire hydrant. Taking another swig from the juice bottle, he steps out of the car. As he approaches the house via a narrow footpath, he notices a man sitting in a parked car, intently watching him while speaking into a cell phone. When Whip's ex-wife opens the door, her initial welcoming smile quickly fades as Whip embraces the struggling Will and turns off the news broadcast on the TV. Later on, Whip raises his arms and walks down a hotel corridor alongside Charlie, who is carrying a can of Coca-Cola. They approach a large, muscular man, and Hugh emerges from a nearby room as Whip enters, greeting him warmly with a handshake and an embrace. Surveying the spacious room, Whip picks up a can of Coke and heads over to the fridge, discovering it well-stocked with an assortment of juices and nonalcoholic beverages. Later, he sits alone in his room, eating a meal in solitude and contemplation. He then lies in bed, aimlessly surfing through the channels on the television. He takes the time to shave and then attempts to open the thick file that Hugh left for him. The file unfolds like an unwieldy accordion, overwhelming him, and he ultimately gives up on it. Seated on the toilet, he smokes as the bathtub fills with steaming water. The clock on the wall shows 2:08 AM as he carefully hangs a neatly pressed suit in the wardrobe. Hearing a persistent and repetitive knock, he looks around to locate the source. While lying in bed, he is roused from sleep by the same sound. Rising slowly, he walks to a side door, pressing his ear against it to listen intently, then cautiously opens the door. It reveals an extended lock on a door leading to an adjoining room, repeatedly knocking against the doorjamb. Whip enters the adjoining room, feeling a gentle breeze coming in through the open balcony doors, causing the drawn curtains to softly flutter. He walks over to the balcony, gazing thoughtfully at the expansive and distant skyline, spotting the flashing beacon lights of a plane in the vast night sky. Turning back, his eyes are drawn to a fridge. Opening the fridge door, he finds rows of miniature alcohol bottles meticulously and neatly arranged on the shelves."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He positions himself near the window, using the available light to carefully read through the letter, his eyes scanning each word with intent focus. Upon finishing, he decisively reaches for the bottle, gripping it firmly before launching it forcefully across the room. The bottle arcs through the air, colliding with a hanging photo of his son, which then shatters dramatically. He stands motionless, staring at the aftermath. Outside, rain steadily taps against the car's surface as Whip sits inside. He skillfully pours alcohol into a bottle of juice, blending the liquids, and takes a contemplative drink before exiting the car. Once outside, he walks with purpose toward a large hangar, its vast entrance presenting the scene of the crashed South Jet Aircraft. The aircraft sits nearly whole, surrounded by scattered parts, with cabinets and shelves lining one side of the building's interior. Observing this, Hugh follows Charlie out of an adjacent plane while Whip cocks his head to the side, watching them. Hugh then turns his back and strides away. Whip enters his car, revving the engine and speeding down the mud-laden road, sending slush splashing aside. He presses the brakes on spotting news crews gathered outside a farmhouse. A few reporters recognize him, prompting him to reverse, and with urgency, he drives back to the main road. He brings the car to a halt opposite a house in a serene neighborhood, aligning it with the curb and narrowly avoiding a fire hydrant, before taking a swig from the bottle of juice. Pushing open the car door, he steps out, advancing along the footpath toward a house. A man, observing from a parked car, speaks into his cell phone as Whip approaches. The door opens to reveal his ex-wife, whose initial smile fades when Whip embraces the struggling Will, simultaneously reaching to turn off the news broadcast. Later, Whip raises his arms, striding with a confident demeanor down a hotel corridor while Charlie accompanies him, holding a can of Coca-Cola. They approach a burly man, and as Hugh emerges from a room, Whip enters, and they exchange greetings with a handshake and hug. Whip then surveys the expansive room, picking up a can of Coke, and makes his way to the fridge, discovering it stocked with juices and nonalcoholic drinks, a sight that momentarily captures his attention. Later, he sits alone, consuming a meal in his room, before lying in bed and channel-surfing on the TV. He rises to shave and attempts to open the thick file left by Hugh. As he struggles with the file that unfolds like an accordion, he gives up and shifts his focus. He perches himself over the toilet, smoking as he watches the bathtub filling with water. The clock shows 2:08 AM when he carefully hangs a suit inside a wardrobe. He attentively listens for the source of a persistent knocking sound and, while lying in bed, is eventually awakened by the same noise. Reluctantly getting out of bed, he approaches a side door, pressing his ear against it to discern the sound. He then pulls open the door, revealing an extended lock on a door leading to an adjoining room, tapping repeatedly against the doorjamb. Entering the adjoining room, a gentle breeze flows in from the partially open balcony doors, rustling the drawn curtains. He walks over, gazing out at the skyline where he notices a plane's beacon lights flickering in the night sky. As he turns back, his glance lands on a fridge, compelling him to open it, exposing shelves lined with rows of miniature alcohol bottles, and he stands there, taking in the sight."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Whip reads the letter by the window's light, then angrily hurls a bottle across the room, shattering it against a photo of his son. As rain falls, he sits in his car, mixes alcohol into juice, drinks it, and heads into a large hangar housing the reassembled South Jet Aircraft, surrounded by parts and shelving. After Hugh follows Charlie out of the plane, Whip notices and then speeds down a muddy road. He stops upon encountering news crews at a farmhouse, quickly reverses, and drives to a quiet neighborhood, stopping near a house, narrowly avoiding a fire hydrant, and drinks more from his juice bottle. Approaching the house, a man observes him from a car while speaking on the phone. Whip's ex-wife opens the door; her smile fades as he enters to embrace Will and turn off the news. Later, in a hotel corridor, Whip walks with Charlie to meet a burly man, exchanges greetings with Hugh, and enters a room. He notices a fridge stocked with nonalcoholic beverages, picks up a Coke, and later dines alone, surfs TV channels, shaves, but abandons Hugh's thick file after attempting to open it. He smokes over the toilet, fills the bath, and hangs a suit in the wardrobe at 2:08 AM. Awakened by knocking, he discovers the adjoining room's door bumping against the doorjamb due to a locked security chain. Entering the room, a breeze from the open balcony doors greets him. He gazes at the skyline, noticing a plane's beacon lights, then turns to find a fridge filled with miniature bottles of alcohol."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He reads the letter using the light from a nearby window, the large Victorian-style panes letting in the soft glow of the street lamps, and then picks up the bottle, throwing it hard across the room, which explodes against the hanging photo of his son, taken during his first Little League game, staring at it motionless. Rain, a common occurrence during the autumn months in this region, falls steadily as Whip sits in the car, pouring alcohol into a bottle of juice, a frequent habit of those trying to conceal drinking, and taking a drink, before exiting the car and entering a large hangar where the crashed South Jet Aircraft stands almost completely assembled with parts strewn around beside it, products of the ongoing investigation, alongside cabinets and shelves lining one side of the building. Hugh, an experienced co-pilot known for his calm demeanor, follows Charlie out of the plane as Whip cocks his head, then Hugh turns and walks away. Whip speeds down the mud road, splashing slush to the side, a hazard on these poorly maintained country roads, and brakes when he sees news crews outside the farmhouse, likely there due to the high-profile crash. Some reporters, part of the relentless media following the story, spot him, so he reverses and drives back onto the main road, stopping opposite a house in a quiet neighborhood, pulling up on a curb barely missing a fire hydrant, a municipal property often damaged in such maneuvers, and chugs on the bottle of juice. He steps out of the car and walks up a footpath to a house where a man, likely a private investigator or curious neighbor, watches him from a parked car, speaking into his cell phone. Whip's ex-wife opens the door, but her smile fades as Whip hugs the struggling Will, their teenage son who is dealing with the aftermath of the divorce, and turns off the news, tired of the coverage. Whip lifts his arms and walks down a hotel corridor, part of a chain known for discreet service, with Charlie holding a can of Coca-Cola, a common choice for those abstaining from alcohol, approaching a burly man, likely a security guard or bouncer. Hugh emerges from a room, and Whip enters the room where they shake hands and hug, a gesture of camaraderie in their stressful times. Whip looks around the spacious room, reserved for meetings or unwinding, picks up a can of Coke, and goes over to the fridge, finding it stocked with juices and nonalcoholic beverages, a precautionary measure for his sobriety. Later, he eats a meal alone in his room, lies in bed surfing channels on the TV, a distraction often used to cope with anxiety, shaves, then tries to open the thick file Hugh left for him, containing documents related to the crash, which spreads like an accordion, and he abandons it. He sits over the toilet smoking an old habit from his more stressful flying days, as the bath fills, and the clock shows 2:08 AM as he hangs a suit, freshly pressed for the upcoming investigation hearing, in a wardrobe. He looks around for the source of the knocking and, lying in bed, he's awakened by the same sound. He gets out of bed, goes to a side door, holds his ear to it, then pulls it open, revealing the extended lock on a door leading to an adjoining room, a common feature in hotels for convenience, bumping repeatedly against the doorjamb. Whip enters the room, feeling a gentle breeze blow through the balcony doors, left ajar by a previous occupant, ruffling drawn curtains. He walks over, gazes at the skyline, and sees a plane's beacon lights flash in the night sky, a familiar sight fostering reflection on his career. Whip turns around, and his eyes fall on a fridge. He opens the door to reveal rows of miniature bottles of alcohol on the shelves, a temptation purposely avoided."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He opens the door to reveal rows of miniature bottles of alcohol on the shelves He reads the letter using the light from a nearby window and then picks up the bottle throwing it hard across the room which explodes against the hanging photo of his son staring at it motionless Hugh follows Charlie out of the plane as Whip cocks his head Whip's exwife opens the door but her smile fades as Whip hugs the struggling Will and turns off the news Rain falls steadily as Whip sits in the car pouring alcohol into a bottle of juice and taking a drink before exiting the car and entering a large hangar where the crashed South Jet Aircraft stands almost completely assembled with parts strewn around beside it alongside cabinets and shelves lining one side of the building then Hugh turns and walks away Later he eats a meal alone in his room lies in bed surfing channels on the TV shaves then tries to open the thick file Hugh left for him which spreads like an accordion and he abandons it Rain falls steadily as Whip sits in the car pouring alcohol into a bottle of juice and taking a drink before exiting the car and entering a large hangar where the crashed South Jet Aircraft stands almost completely assembled with parts strewn around beside it alongside cabinets and shelves lining one side of the building Hugh follows Charlie out of the plane as Whip cocks his head then Hugh turns and walks away Whip speeds down the mud road splashing slush to the side and brakes when he sees news crews outside the farmhouse Some reporters spot him so he reverses and drives back onto the main road stopping opposite a house in a quiet neighborhood pulling up on a curb barely missing a fire hydrant and chugs on the bottle of juice He steps out of the car and walks up a footpath to a house where a man watches him from a parked car speaking into his cell phone Whip's exwife opens the door but her smile fades as Whip hugs the struggling Will and turns off the news Whip lifts his arms and walks down a hotel corridor with Charlie holding a can of Cocacola approaching a burly man Hugh emerges from a room and Whip enters the room where they shake hands and hug Whip looks around the spacious room picks up a can of Coke and goes over to the fridge finding it stocked with juices and nonalcoholic beverages Whip looks around the spacious room picks up a can of Coke and goes over to the fridge finding it stocked with juices and nonalcoholic beverages Later he eats a meal alone in his room lies in bed surfing channels on the TV shaves then tries to open the thick file Hugh left for him which spreads like an accordion and he abandons it He walks over gazes at the skyline and sees a plane's beacon lights flash in the night sky Whip lifts his arms and walks down a hotel corridor with Charlie holding a can of Cocacola approaching a burly man He sits over the toilet smoking as the bath fills and the clock shows 208 AM as he hangs a suit in a wardrobe He looks around for the source of the knocking and lying in bed he is awakened by the same sound He gets out of bed goes to a side door holds his ear to it then pulls it open revealing the extended lock on a door leading to an adjoining room bumping repeatedly against the doorjamb Whip enters the room feeling a gentle breeze blow through the balcony doors ruffling drawn curtains He walks over gazes at the skyline and sees a plane's beacon lights flash in the night sky He reads the letter using the light from a nearby window and then picks up the bottle throwing it hard across the room which explodes against the hanging photo of his son staring at it motionless Whip turns around and his eyes fall on a fridge He opens the door to reveal rows of miniature bottles of alcohol on the shelves"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He reads the letter using the light from a nearby window and then picks up the bottle throwing it hard across the room which explodes against the hanging photo of his son staring at it motionless. Rain falls steadily as Whip sits in the car pouring alcohol into a bottle of juice and taking a drink before exiting the car and entering a large hangar where the crashed South Jet Aircraft stands almost completely assembled with parts strewn around beside it alongside cabinets and shelves lining one side of the building. Hugh follows Charlie out of the plane as Whip cocks his head. then Hugh turns and walks away. Whip speeds down the mud road splashing slush to the side and brakes when he sees news crews outside the farmhouse. Some reporters spot him so he reverses and drives back onto the main road stopping opposite a house in a quiet neighborhood pulling up on a curb barely missing a fire hydrant and chugs on the bottle of juice. He steps out of the car and walks up a footpath to a house where a man watches him from a parked car speaking into his cell phone. Whip's exwife opens the door but her smile fades as Whip hugs the struggling Will and turns off the news. Whip lifts his arms and walks down a hotel corridor with Charlie holding a can of Cocacola approaching a burly man. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Hugh emerges from a room and Whip enters the room where they shake hands and hug. Whip looks around the spacious room picks up a can of Coke and goes over to the fridge finding it stocked with juices and nonalcoholic beverages. Later he eats a meal alone in his room lies in bed surfing channels on the TV shaves then tries to open the thick file Hugh left for him which spreads like an accordion and he abandons it. He sits over the toilet smoking as the bath fills and the clock shows 208 AM as he hangs a suit in a wardrobe. He looks around for the source of the knocking and lying in bed he is awakened by the same sound. He gets out of bed goes to a side door holds his ear to it then pulls it open revealing the extended lock on a door leading to an adjoining room bumping repeatedly against the doorjamb. Whip enters the room feeling a gentle breeze blow through the balcony doors ruffling drawn curtains. He walks over gazes at the skyline and sees a plane's beacon lights flash in the night sky. Whip turns around and his eyes fall on a fridge. He opens the door to reveal rows of miniature bottles of alcohol on the shelves."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He reads the letter using the light from a nearby window and then picks up the bottle throwing it hard across the room which explodes against the hanging photo of his son staring at it motionless. Rain falls steadily as Whip sits in the car pouring alcohol into a bottle of juice and taking a drink before exiting the car and entering a large hangar where the crashed South Jet Aircraft stands almost completely assembled with parts strewn around beside it alongside cabinets and shelves lining one side of the building. Hugh follows Charlie out of the plane as Whip cocks his head. then Hugh turns and walks away. Whip speeds down the mud road splashing slush to the side and brakes when he sees news crews outside the farmhouse. Some reporters spot him so he reverses and drives back onto the main road stopping opposite a house in a quiet neighborhood pulling up on a curb barely missing a fire hydrant and chugs on the bottle of juice. He steps out of the car and walks up a footpath to a house where a man watches him from a parked car speaking into his cell phone. Whip's exwife opens the door but her smile fades as Whip hugs the struggling Will and turns off the news. Whip lifts his arms and walks down a hotel corridor with Charlie holding a can of Cocacola approaching a burly man. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Hugh emerges from a room and Whip enters the room where they shake hands and hug. Whip looks around the spacious room picks up a can of Coke and goes over to the fridge finding it stocked with juices and nonalcoholic beverages. Later he eats a meal alone in his room lies in bed surfing channels on the TV shaves then tries to open the thick file Hugh left for him which spreads like an accordion and he abandons it. He sits over the toilet smoking as the bath fills and the clock shows 208 AM as he hangs a suit in a wardrobe. He looks around for the source of the knocking and lying in bed he is awakened by the same sound. He gets out of bed goes to a side door holds his ear to it then pulls it open revealing the extended lock on a door leading to an adjoining room bumping repeatedly against the doorjamb. Whip enters the room feeling a gentle breeze blow through the balcony doors ruffling drawn curtains. He walks over gazes at the skyline and sees a plane's beacon lights flash in the night sky. Whip turns around and his eyes fall on a fridge. He opens the door to reveal rows of miniature bottles of alcohol on the shelves."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He reads the letter using the light from a nearby window and then picks up the bottle throwing it hard across the room which explodes against the hanging photo of his son staring at it motionless. Rain falls steadily as Whip sits in the car pouring alcohol into a bottle of juice and taking a drink before exiting the car and entering a large hangar where the crashed South Jet Aircraft stands almost completely assembled with parts strewn around beside it alongside cabinets and shelves lining one side of the building. Hugh follows Charlie out of the plane as Whip cocks his head. then Hugh turns and walks away. Whip speeds down the mud road splashing slush to the side and brakes when he sees news crews outside the farmhouse. He gets out of bed goes to a side door holds his ear to it then pulls it open revealing the extended lock on a door leading to an adjoining room bumping repeatedly against the doorjamb. Whip enters the room feeling a gentle breeze blow through the balcony doors ruffling drawn curtains. He walks over gazes at the skyline and sees a plane's beacon lights flash in the night sky. Whip turns around and his eyes fall on a fridge. He opens the door to reveal rows of miniature bottles of alcohol on the shelves."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He reads the letter using the light from a nearby window and then picks up the bottle throwing it hard across the room which explodes against the hanging photo of his son staring at it motionless. Rain falls steadily as Whip sits in the car pouring alcohol into a bottle of juice and taking a drink before exiting the car and entering a large hangar where the crashed South Jet Aircraft stands almost completely assembled with parts strewn around beside it alongside cabinets and shelves lining one side of the building. Whip turns around and his eyes fall on a fridge. He opens the door to reveal rows of miniature bottles of alcohol on the shelves."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The raccoon reads the letter using the light from a nearby window and then picks up the bottle, throwing it hard across the room, which explodes against the hanging photo of its son, staring at it motionless. Rain falls steadily as the eagle sits in the car, pouring alcohol into a bottle of juice and taking a drink, before exiting the car and entering a large hangar where the crashed South Jet Aircraft stands almost completely assembled with parts strewn around beside it, alongside cabinets and shelves lining one side of the building. The fox follows the turtle out of the plane as the eagle cocks its head, then the fox turns and walks away. The eagle speeds down the mud road, splashing slush to the side and brakes when it sees news crews outside the farmhouse. Some reporters spot it, so it reverses and drives back onto the main road, stopping opposite a house in a quiet neighborhood, pulling up on a curb barely missing a fire hydrant and chugs on the bottle of juice. The eagle steps out of the car and walks up a footpath to a house where a ninja watches it from a parked car, speaking into its cell phone. The eagle's ex-wife opens the door, but her smile fades as the eagle hugs the struggling kangaroo and turns off the news. The eagle lifts its arms and walks down a hotel corridor with the turtle holding a can of Coca-cola, approaching a burly man. The fox emerges from a room, and the eagle enters the room where they shake hands and hug. The eagle looks around the spacious room, picks up a can of Coke, and goes over to the fridge, finding it stocked with juices and nonalcoholic beverages. Later, it eats a meal alone in its room, lies in bed surfing channels on the TV, shaves, then tries to open the thick file the fox left for it, which spreads like an accordion, and it abandons it. It sits over the toilet smoking as the bath fills, and the clock shows 2.08 AM as it hangs a suit in a wardrobe. It looks around for the source of the knocking and, lying in bed, it's awakened by the same sound. It gets out of bed, goes to a side door, holds its ear to it, then pulls it open, revealing the extended lock on a door leading to an adjoining room bumping repeatedly against the doorjamb. The eagle enters the room, feeling a gentle breeze blow through the balcony doors ruffling drawn curtains. It walks over, gazes at the skyline, and sees a plane's beacon lights flash in the night sky. The eagle turns around, and its eyes fall on a fridge. It opens the door to reveal rows of miniature bottles of alcohol on the shelves."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He reads the brochure using the glow from a nearby lantern and then picks up the stone, throwing it hard across the meadow, which shatters against the hanging lantern of his friend, staring at it motionless. Snow falls steadily as Whip sits in the bus, pouring lemonade into a carton of milk and taking a sip, before exiting the bus and entering a large barn where the overturned Mountain Sky Train stands almost completely restored with tools scattered around beside it, alongside benches and racks lining one side of the structure. Hugh follows Charlie out of the train as Whip nods his head, then Hugh turns and strolls away. Whip speeds down the gravel path, splashing dust to the side and stops when he sees film crews outside the cabin. Some cameramen spot him, so he reverses and drives back onto the main avenue, stopping opposite a mansion in a sleepy suburb, pulling up on a sidewalk barely missing a mailbox and chugs on the carton of milk. He steps out of the bus and walks up a pathway to a bungalow where a woman watches him from a parked motorcycle, speaking into her walkie-talkie. Whip's ex-girlfriend opens the door, but her smile fades as Whip hugs the struggling Tom and switches off the radio. Whip lifts his arms and walks down a motel corridor with Charlie holding a can of ginger ale, approaching a lanky woman. Hugh emerges from a cabin, and Whip enters the cabin where they shake hands and embrace. Whip looks around the compact cabin, picks up a can of ginger ale, and goes over to the cooler, finding it stocked with teas and herbal drinks. Later, he eats a sandwich alone in his cabin, lies in bed flipping channels on the radio, trims his beard, then tries to open the thick binder Hugh left for him, which unfolds like an accordion, and he discards it. He sits over the sink smoking as the shower fills, and the clock shows 2.08 PM as he hangs a jacket in a dresser. He looks around for the source of the tapping and, lying in bed, he's awakened by the same noise. He gets out of bed, goes to a side entrance, holds his ear to it, then pulls it open, revealing the extended chain on an entrance leading to a connecting cabin bumping repeatedly against the frame. Whip enters the cabin, feeling a gentle current blow through the patio doors ruffling drawn blinds. He walks over, gazes at the landscape, and sees a boat’s beacon lights flash in the night sky. Whip turns around, and his eyes fall on a chest. He opens the lid to reveal rows of miniature bottles of soda on the racks."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He scans the letter using the light from a nearby window and then lifts the bottle, placing it gently on the table across the room, which slides against the hanging photo of his son, glancing at it motionless. Rain taps steadily as Whip sits in the car, sipping water from a bottle of juice and taking a breath, before entering the car and exiting a large hangar where the crashed South Jet Aircraft rests almost completely repaired with parts scattered around beside it, alongside cabinets and shelves lining one side of the building. Hugh watches Charlie leave the plane as Whip tilts his head, then Hugh turns and walks back. Whip strolls down the mud road, kicking slush to the side and accelerates when he notices news crews outside the farmhouse. Some reporters wave at him, so he circles and drives back onto the main road, pausing opposite a house in a quiet neighborhood, parking on a curb barely avoiding a fire hydrant and sips on the bottle of juice. He leaps out of the car and strides up a footpath to a house where a man observes him from a parked car, typing into his cell phone. Whip's ex-wife opens the door, but her smile fades as Whip nudges the struggling Will and switches off the news. Whip lowers his arms and strolls down a hotel corridor with Charlie holding a can of Coca-cola, heading towards a burly man. Hugh steps out of a room, and Whip enters the room where they exchange glances and laugh. Whip scans around the spacious room, lifts a can of Coke, and approaches the fridge, finding it filled with juices and nonalcoholic beverages. Later, he prepares a meal alone in his room, rests in bed changing channels on the TV, trims his beard, then struggles to open the thick file Hugh left for him, which expands like an accordion, and he overlooks it. He hovers over the toilet humming as the bath drains, and the clock shows 2.08 AM as he folds a suit in a wardrobe. He glances around for the source of the knocking and, lying in bed, he's stirred by the same sound. He rises from bed, heads to a side door, presses his ear against it, then pushes it open, revealing the extended lock on a door leading to an adjoining room tapping repeatedly against the doorjamb. Whip enters the room, sensing a gentle breeze sweep through the balcony doors ruffling drawn curtains. He paces over, gazes at the skyline, and spots a plane's beacon lights flicker in the night sky. Whip turns around, and his eyes land on a fridge. He closes the door to reveal rows of miniature bottles of alcohol on the shelves."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The bear sketches the diary using the glow from a distant lantern and then lifts up the helmet, launching it hard across the cave, which shatters against the dangling painting of its frog, glaring at it motionless. Snow drifts steadily as Feather perches in the wagon, pouring milk into a bucket of syrup and taking a sip, before departing the wagon and entering a tiny tent where the broken North Train Locomotive stands almost entirely reconstructed with items scattered around beside it, alongside crates and bins lining one side of the shelter. Oscar trails Betty out of the train as Feather tilts its beak, then Oscar pivots and strides away. Feather zooms down the sandy path, splashing dust to the side and halts when it spots journalists outside the lighthouse. Several photographers notice it, so it reverses and maneuvers back onto the main avenue, stopping opposite a farm in a tranquil district, pulling up on a sidewalk barely missing a lamp post and gulps on the bucket of syrup. It leaps out of the wagon and strolls up a trail to a farm where a rabbit observes it from a stationed wagon, chatting into its megaphone. Feather's old neighbor unlatches the gate, but its grin diminishes as Feather embraces the squirming Jack and switches off the radio. Feather raises its wings and wanders down an airport hallway with Betty clutching a jug of lemonade, nearing a slender rabbit. Oscar exits a chamber, and Feather steps into the chamber where they exchange greetings and embrace. Feather glances around the vast chamber, grabs a jug of lemonade, and saunters over to the oven, discovering it packed with pastries and herbal drinks. Later, it savors a dessert alone in its hideout, reclines in a hammock flipping through stations on the stereo, trims its feathers, then attempts to open the heavy manuscript Oscar left for it, which spreads like a fan, and it dismisses it. It perches over the fireplace puffing as the tub fills, and the clock displays 4:19 PM as it dangles a jacket in a cupboard. It scans for the source of the tapping and, dozing in the hammock, it's stirred by the identical noise. It rises from the hammock, proceeds to a back gate, places its ear to it, then yanks it open, disclosing the elongated latch on a gate leading to a neighboring chamber tapping repeatedly against the frame. Feather enters the chamber, sensing a gentle draft sweep through the terrace gates fluttering drawn drapes. It strides over, stares at the horizon, and witnesses a helicopter's signal beams twinkle in the evening air. Feather pivots around, and its gaze rests on an oven. It unlatches the gate to uncover rows of miniature sculptures of fruit on the counters."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The cat deciphers the map using the glow from a nearby lantern and then lifts the shoe, hurling it softly across the forest, which shatters against the suspended portrait of his dog, glaring at it motionless. Snow drifts gently as Panther lounges in the boat, mixing tea into a cup of water and sipping it, before leaving the boat and entering a small barn where the repaired North Star Sled rests almost fully intact with gear scattered around beside it, along with tables and benches lining one side of the building. Jack trails Oliver out of the sled as Panther tilts his nose, then Jack spins and dances away. Panther dashes along the gravel path, spraying gravel to the side and halts when he sees photographers outside the cabin. Some hikers notice him, so he retreats and jogs back onto the main path, pausing opposite a cabin in a lively neighborhood, parking on a pavement narrowly avoiding a lamppost and glugs on the cup of water. He hops out of the boat and strolls up a trail to a cabin where a woman observes him from a parked bicycle, chatting into her walkie-talkie. Panther's sister opens the door, but her grin vanishes as Panther embraces the hiding Max and switches off the radio. Panther stretches his legs and glides down a corridor in a mansion with Oliver carrying a mug of lemonade, meeting a slender woman. Jack steps out of a closet, and Panther enters the closet where they nod and wave. Panther glances around the wide room, grabs a bottle of lemonade, and saunters over to the pantry, discovering it filled with coffees and herbal teas. Later, he prepares a feast alone in his living room, reclines on a couch flipping channels on the projector, trims his hair, then attempts to read the thick manual Jack left for him, which unfolds like a fan, and he ignores it. He crouches over the basin knitting as the sink overflows, and the clock shines 4:15 PM as he hangs a scarf on a wall hook. He scans around for the source of the chiming and, resting on the recliner, he's stirred by the same chime. He leaps out of the recliner, strides to a side window, presses his hand to it, then swings it open, revealing the straightened latch on a window leading to an adjacent balcony tapping repeatedly against the casement. Panther steps onto the balcony, sensing a gentle wind blowing through the patio doors billowing drawn blinds. He paces over, gazes at the horizon, and spots a boat's mast light twinkle in the morning sky. Panther spins around, and his gaze lands on a cabinet. He swings open the drawer to reveal rows of tiny boxes of cookies on the shelves."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He scans the note using the glow from a nearby lamp and then grabs the vase, launching it furiously across the space, which shatters against the hanging painting of his son, glaring at it silently. Snow falls gently as Whip lounges in the van, mixing lemonade into a bottle of cola and taking a sip, before leaving the van and entering a vast warehouse where the disassembled South Jet Bicycle stands almost fully constructed with tools scattered around beside it, alongside sofas and tables lining one side of the structure. Hugh trails Charlie out of the bicycle as Whip tilts his head, then Hugh pivots and strides away. Whip races down the gravel path, kicking dust to the side and halts when he notices film crews outside the barn. Some journalists notice him, so he reverses and maneuvers back onto the main street, parking opposite a cottage in a bustling district, pulling up on a patch barely missing a lamppost and gulps on the cola bottle. He climbs out of the van and strolls up a trail to a house where a person observes him from a stationary motorcycle, murmuring into his walkie-talkie. Whip's former spouse opens the door, but her grin diminishes as Whip embraces the squirming Will and switches off the radio. Whip raises his hands and ambles down a ship corridor with Charlie clutching a cup of tea, approaching a lean figure. Hugh steps out of a cabin, and Whip enters the cabin where they exchange fist bumps and embrace. Whip surveys the spacious cabin, snatches a can of Fanta, and heads to the cabinet, finding it packed with sodas and sparkling waters. Later, he savors a feast alone in his cabin, reclines on a hammock flipping through magazines, trims his beard, then attempts to unfold the thick binder Hugh left for him, which expands like a slinky, and he discards it. He sits over the sink puffing as the shower fills, and the clock shows 2.08 PM as he hangs a jacket in a closet. He glances around for the origin of the tapping and, lying on the sofa, he's stirred by the same noise. He gets off the sofa, heads to a side window, presses his ear to it, then slides it open, revealing the extended chain on a gate leading to an adjacent patio knocking repeatedly against the railing. Whip steps into the patio, feeling a soft zephyr drift through the garden doors rustling closed blinds. He strolls over, surveys the horizon, and notices a boat's signal lights blink in the twilight. Whip pivots, and his gaze lands on a pantry. He slides the door to discover rows of miniature cans of soda on the racks."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The turtle narrates the postcard using the glow from a distant lamp and then lifts the vase, catapulting it softly through the meadow, which implodes against the floating kite of her neighbor, gazing at it joyfully. Snow drifts lightly as Sally hops in the boat, mixing lemonade into a jar of milk and sipping a taste, before abandoning the boat and entering a grand pavilion where the dented Vintage Train Carriage stands nearly fully dismantled with gears spread around beneath it, alongside benches and desks lining one wall of the arena. Larry trails Wendy out of the truck as Sally tilts her chin, then Larry twirls and skips away. Sally zooms down the sandy lane, flinging pebbles to the side and halts when she spots campers outside the lighthouse. Some adventurers notice her, so she crawls and strolls back onto the main path, pausing beside a mansion in a bustling plaza, pulling up on a sidewalk barely grazing a water fountain and gulps on the jar of milk. She leaps out of the boat and strolls up a trail to a cabin where a lady observes her from a stationary bike, talking into her radio. Sally's old teacher closes the window, but her frown brightens as Sally pats the yawning Tom and tunes in the music. Sally raises her fingers and skips down a theater hallway with Wendy carrying a box of cereal, approaching a slender woman. Larry peeks from a closet, and Sally steps into the closet where they pat backs and laugh. Sally scans the tiny closet, lifts a box of cereal, and moves over to the freezer, discovering it filled with pastries and iced coffees. Afterward, she prepares a snack alone in her closet, curls in a hammock flipping channels on the screen, brushes teeth, then attempts to crack open the thin envelope Larry left for her, which curls like a ribbon, and she forgets it. She kneels over the sink whistling as the shower drips, and the timepiece displays 6:23 PM as she dangles a shirt in a suitcase. She scans around for the source of the buzzing and, reclining in the hammock, she's startled by the identical noise. She leaps out of the hammock, rushes to a back gate, presses her nose to it, then swings it wide, exposing the retracted chain on a gate leading to a neighboring closet tapping endlessly against the wall. Sally steps into the closet, sensing a gentle gust drift through the window screens fluttering open blinds. She strides across, peers at the horizon, and notices a balloon's twinkling lanterns glow in the dusk. Sally spins around, and her focus lands on a freezer. She swings the lid to uncover stacks of small boxes of candy on the trays."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Whip reads a letter by a window, then hurls a bottle at his son's photo, shattering it. Sitting in his car, he mixes alcohol with juice before heading to a hangar housing the crashed South Jet Aircraft. As Hugh and Charlie exit the plane, Whip watches them and later speeds away, avoiding reporters by returning to the main road and stopping near a quiet house. There, he meets his ex-wife and son, turning off the news as tensions arise. Later, Whip and Charlie meet Hugh at a hotel. Inside, Whip finds nonalcoholic drinks, eats alone, and struggles with a thick file left by Hugh. As night falls, he's awakened by a knocking sound from an adjoining room. Investigating, he feels a breeze from an open balcony, sees city lights, and spots a plane's beacon in the sky. Whip discovers a fridge filled with miniature bottles of alcohol, tempting him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He opens the door to reveal rows of miniature bottles of alcohol on the shelves Whip turns around and his eyes fall on a fridge He walks over gazes at the skyline and sees a plane's beacon lights flash in the night sky Whip enters the room feeling a gentle breeze blow through the balcony doors ruffling drawn curtains He gets out of bed goes to a side door holds his ear to it then pulls it open revealing the extended lock on a door leading to an adjoining room bumping repeatedly against the doorjamb He looks around for the source of the knocking and lying in bed he is awakened by the same sound He sits over the toilet smoking as the bath fills and the clock shows 208 AM as he hangs a suit in a wardrobe Later he eats a meal alone in his room lies in bed surfing channels on the TV shaves then tries to open the thick file Hugh left for him which spreads like an accordion and he abandons it Whip looks around the spacious room picks up a can of Coke and goes over to the fridge finding it stocked with juices and nonalcoholic beverages Hugh emerges from a room and Whip enters the room where they shake hands and hug Whip lifts his arms and walks down a hotel corridor with Charlie holding a can of Cocacola approaching a burly man Whip's exwife opens the door but her smile fades as Whip hugs the struggling Will and turns off the news He steps out of the car and walks up a footpath to a house where a man watches him from a parked car speaking into his cell phone Some reporters spot him so he reverses and drives back onto the main road stopping opposite a house in a quiet neighborhood pulling up on a curb barely missing a fire hydrant and chugs on the bottle of juice Whip speeds down the mud road splashing slush to the side and brakes when he sees news crews outside the farmhouse then Hugh turns and walks away Hugh follows Charlie out of the plane as Whip cocks his head Rain falls steadily as Whip sits in the car pouring alcohol into a bottle of juice and taking a drink before exiting the car and entering a large hangar where the crashed South Jet Aircraft stands almost completely assembled with parts strewn around beside it alongside cabinets and shelves lining one side of the building He reads the letter using the light from a nearby window and then picks up the bottle throwing it hard across the room which explodes against the hanging photo of his son staring at it motionless"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He gets out of bed goes to a side door holds his ear to it then pulls it open revealing the extended lock on a door leading to an adjoining room bumping repeatedly against the doorjamb He looks around for the source of the knocking and lying in bed he is awakened by the same sound Whip speeds down the mud road splashing slush to the side and brakes when he sees news crews outside the farmhouse Hugh emerges from a room and Whip enters the room where they shake hands and hug Some reporters spot him so he reverses and drives back onto the main road stopping opposite a house in a quiet neighborhood pulling up on a curb barely missing a fire hydrant and chugs on the bottle of juice Whip enters the room feeling a gentle breeze blow through the balcony doors ruffling drawn curtains Whip turns around and his eyes fall on a fridge He steps out of the car and walks up a footpath to a house where a man watches him from a parked car speaking into his cell phone He sits over the toilet smoking as the bath fills and the clock shows 208 AM as he hangs a suit in a wardrobe He walks over gazes at the skyline and sees a plane's beacon lights flash in the night sky Whip looks around the spacious room picks up a can of Coke and goes over to the fridge finding it stocked with juices and nonalcoholic beverages Rain falls steadily as Whip sits in the car pouring alcohol into a bottle of juice and taking a drink before exiting the car and entering a large hangar where the crashed South Jet Aircraft stands almost completely assembled with parts strewn around beside it alongside cabinets and shelves lining one side of the building Later he eats a meal alone in his room lies in bed surfing channels on the TV shaves then tries to open the thick file Hugh left for him which spreads like an accordion and he abandons it Hugh follows Charlie out of the plane as Whip cocks his head He opens the door to reveal rows of miniature bottles of alcohol on the shelves Whip's exwife opens the door but her smile fades as Whip hugs the struggling Will and turns off the news Whip lifts his arms and walks down a hotel corridor with Charlie holding a can of Cocacola approaching a burly man He reads the letter using the light from a nearby window and then picks up the bottle throwing it hard across the room which explodes against the hanging photo of his son staring at it motionless then Hugh turns and walks away"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Whip looks around the spacious room picks up a can of Coke and goes over to the fridge finding it stocked with juices and nonalcoholic beverages Later he eats a meal alone in his room lies in bed surfing channels on the TV shaves then tries to open the thick file Hugh left for him which spreads like an accordion and he abandons it He sits over the toilet smoking as the bath fills and the clock shows 208 AM as he hangs a suit in a wardrobe He looks around for the source of the knocking and lying in bed he is awakened by the same sound He gets out of bed goes to a side door holds his ear to it then pulls it open revealing the extended lock on a door leading to an adjoining room bumping repeatedly against the doorjamb Whip enters the room feeling a gentle breeze blow through the balcony doors ruffling drawn curtains He walks over gazes at the skyline and sees a plane's beacon lights flash in the night sky Whip turns around and his eyes fall on a fridge He opens the door to reveal rows of miniature bottles of alcohol on the shelves He reads the letter using the light from a nearby window and then picks up the bottle throwing it hard across the room which explodes against the hanging photo of his son staring at it motionless Rain falls steadily as Whip sits in the car pouring alcohol into a bottle of juice and taking a drink before exiting the car and entering a large hangar where the crashed South Jet Aircraft stands almost completely assembled with parts strewn around beside it alongside cabinets and shelves lining one side of the building Hugh follows Charlie out of the plane as Whip cocks his head then Hugh turns and walks away Whip speeds down the mud road splashing slush to the side and brakes when he sees news crews outside the farmhouse Some reporters spot him so he reverses and drives back onto the main road stopping opposite a house in a quiet neighborhood pulling up on a curb barely missing a fire hydrant and chugs on the bottle of juice He steps out of the car and walks up a footpath to a house where a man watches him from a parked car speaking into his cell phone Whip's exwife opens the door but her smile fades as Whip hugs the struggling Will and turns off the news Whip lifts his arms and walks down a hotel corridor with Charlie holding a can of Cocacola approaching a burly man Hugh emerges from a room and Whip enters the room where they shake hands and hug"
        }
      ]
    }
  ]
}