{
  "ground_truth": "The figure is tall with a thin face and beard. He stops and smiles menacingly. Harry appears behind Ginny and raises his wand. Greyback deflects the spell. He flies up in a spiral of black smoke. Ginny and Harry turn in circles, but can see no sign of him. They take refuge on a small island of sand. Bellatrix spots them. Remus and Tonks are still searching. On their tiny island, Ginny and Harry fend off attacks with their wands. Tonks, Remus, and Mr. Weasley join them on the island. They form a circle, back-to-back, wands poised. Bellatrix watches them. Greyback glances at Bellatrix. They change form, and shoot into the sky, the cloud of black spell. They attack the Weasley house, which bursts into flames. Mr. Weasley sprints off. He finds his family safe, watching their house burn. He puts an arm around his wife. The others join them. And they all watch helplessly, as the Weasley house is engulfed in flames. Lavender puts a heart pendant round Ron's neck. Hermione watches Lavender simpering over Ron. She heads back the way they came. Harry nods to Ron, then walks along the corridor. Lavender leaps on Ron's back and he staggers away with her. Professor Dumbledore's cabinet of vials. Harry plunges his face into the pensive. Teenage Tom Riddle at a Slughorn tea party. Slughorn smiles uneasily. Tom taps the hourglass. The memory stops. Harry straightens up. Dumbledore dips his hand into the pensive. Harry stands solemnly in front of Dumbledore, and nods. The Potions class leave. Slughorn turns and sees Harry. Slughorn shifts uneasily. On his way out, Slughorn stops, spins round and stares at Harry, who doesn't flinch. He stomps out. Slughorn closes the spyhole and locks the door. Harry finds Ron in the boy's dormitory. He's sitting on the floor, gazing dreamily out of the window. Ron holds a gift box. Harry moves away, as Ron leans closer. Ron throws down the box, which has a heart on it. Harry stares at Ron, who smiles inanely, a far away look in his eyes. As Ron sits on the floor and gazes up at the moon, Harry reads the card which came with the chocolates. He grins and crosses to Ron. Little hearts float from it. Ron embraces Slughorn. Harry prises him off. Ron sits on the back of the sofa and falls off. Slughorn gives him a potion. Ron drinks. The inane, fixed smile fades. He looks quizzically up at Harry. He fills three glasses. Ron drinks and collapses, foaming at the mouth. Harry runs to Slughorn's potion cabinet, as Ron convulses on the floor. He puts one in Ron's mouth. He leans over Ron, who lies on his back, no longer breathing.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The silhouette is lofty with a slender visage and whiskers. He halts and grins threateningly. Harry emerges behind Ginny and elevates his wand. Greyback parries the incantation. He ascends in a helix of ebony vapor. Ginny and Harry whirl in circles, but can discern no trace of him. They seek sanctuary on a petite islet of sand. Bellatrix notices them. Remus and Tonks are yet searching. On their diminutive islet, Ginny and Harry ward off assaults with their wands. Tonks, Remus, and Mr. Weasley join them on the islet. They establish a ring, back-to-back, wands ready. Bellatrix observes them. Greyback glances at Bellatrix. They transform, and soar into the heavens, the haze of black charm. They assail the Weasley dwelling, which bursts into inferno. Mr. Weasley dashes off. He finds his kin safe, witnessing their abode burn. He places an arm around his spouse. The others join them. And they all observe powerlessly, as the Weasley home is consumed in flames. Lavender places a heart locket round Ron's neck. Hermione observes Lavender smirking over Ron. She heads back the way they came. Harry acknowledges Ron, then ambles along the hallway. Lavender jumps on Ron's back and he staggers away with her. Professor Dumbledore's cabinet of phials. Harry plunges his visage into the pensive. Adolescent Tom Riddle at a Slughorn tea gathering. Slughorn grins uneasily. Tom taps the hourglass. The recollection ceases. Harry straightens up. Dumbledore dips his hand into the pensive. Harry stands gravely in front of Dumbledore, and acknowledges. The Potions class departs. Slughorn turns and perceives Harry. Slughorn shifts uneasily. On his way out, Slughorn halts, spins around and stares at Harry, who doesn’t flinch. He stomps out. Slughorn closes the spyhole and locks the portal. Harry finds Ron in the boy's dormitory. He's sitting on the floor, gazing wistfully out of the window. Ron holds a present box. Harry moves away, as Ron leans closer. Ron throws down the box, which has a heart on it. Harry stares at Ron, who grins inanely, a distant look in his eyes. As Ron sits on the floor and gazes up at the moon, Harry reads the card which came with the sweets. He grins and crosses to Ron. Little hearts drift from it. Ron embraces Slughorn. Harry forces him off. Ron sits on the back of the couch and tumbles off. Slughorn gives him a potion. Ron drinks. The inane, fixed grin diminishes. He looks quizzically up at Harry. He fills three tumblers. Ron drinks and collapses, foaming at the mouth. Harry rushes to Slughorn's potion cabinet, as Ron convulses on the floor. He places one in Ron’s mouth. He leans over Ron, who lies on his back, no longer inhaling."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The figure, who is tall with a thin face and beard, is stopped and smiled at menacingly by him. Harry is appeared behind by Ginny and a wand is raised by him. The spell is deflected by Greyback. He is flown up by himself in a spiral of black smoke. Circles are turned in by Ginny and Harry, but no sign of him can be seen by them. Refuge is taken by them on a small island of sand. They are spotted by Bellatrix. Remus and Tonks search still. On their tiny island, attacks are fended off by Ginny and Harry with their wands. Joined on the island are they by Tonks, Remus, and Mr. Weasley. A circle, back-to-back, is formed by them, with their wands poised. They are watched by Bellatrix. Bellatrix is glanced at by Greyback. Form is changed by them, and they are shot into the sky, the cloud of black spell. The Weasley house is attacked by them, and it bursts into flames. Mr. Weasley sprints off. His family, safe and watching their house burn, is found by him. An arm is put around his wife by him. They are joined by the others. And they helplessly watch as the Weasley house is engulfed in flames. A heart pendant is put round Ron's neck by Lavender. Lavender simpers over Ron, and Hermione watches her. The way they came is headed back by her. Ron is nodded to by Harry, then the corridor is walked along by him. Lavender is leaped onto Ron's back by her, and he staggers away with her. Professor Dumbledore's cabinet of vials. Harry's face is plunged into the pensive by him. Teenage Tom Riddle is at a Slughorn tea party. Slughorn is smiled at uneasily by him. The hourglass is tapped by Tom. The memory is stopped. Harry is straightened up by himself. Dumbledore's hand is dipped into the pensive by him. Harry stands solemnly in front of Dumbledore, and a nod is given by him. The Potions class leaves. Harry is seen by Slughorn, who turns. Slughorn shifts uneasily. On his way out, Harry is stopped by Slughorn, who spins round and stares at him, without a flinch from Harry. The room is stomped out by him. The spyhole is closed by Slughorn and the door is locked. Ron is found by Harry in the boy's dormitory. The floor is sat on by him, as he gazes dreamily out of the window. Ron holds a gift box. Away is moved by Harry, as closer is leaned by Ron. A box with a heart on it is thrown down by Ron. Ron is stared at by Harry, who smiles inanely, a faraway look in his eyes. As the floor is sat on by Ron and the moon is gazed up at by him, the card which came with the chocolates is read by Harry. A grin is given by him and Ron is crossed to. From it, little hearts float. Slughorn is embraced by Ron. Slughorn is reluctantly let go by Harry. The back of the sofa is sat on by Ron and he falls off. A potion is given to him by Slughorn. It is drunk by Ron. The inane, fixed smile fades. Quizzically up at Harry, he looks. Three glasses are filled by him. He drinks and collapses, foam at the mouth. Slughorn's potion cabinet is run to by Harry, as Ron convulses on the floor. One is put in Ron's mouth by him. Over Ron, who lies on his back, no longer breathing, he leans."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The tall figure with a thin face and beard stops and smiles menacingly. Harry appears behind Ginny and raises his wand, but Greyback deflects the spell, spiraling into black smoke. Ginny and Harry find no sign of him and seek refuge on a small sand island. Bellatrix spots them as Remus and Tonks search. On the island, Ginny and Harry fend off attacks. Tonks, Remus, and Mr. Weasley join them, forming a circle with wands poised. Bellatrix observes while Greyback glances at her, and both transform, shooting skyward in a black spell cloud. They attack the Weasley house, setting it ablaze. Mr. Weasley sprints to find his family safe, embracing his wife as they helplessly watch their house burn. Lavender places a heart pendant around Ron's neck, observed by Hermione. Harry nods to Ron and walks away as Lavender leaps onto Ron's back. In Professor Dumbledore's cabinet, Harry immerses into the pensive, seeing teenage Tom Riddle at a Slughorn tea party. An uneasy Slughorn stops the memory as Harry straightens, and Dumbledore dips his hand into the pensive. Harry solemnly nods. The Potions class leaves, and Slughorn uneasily notices Harry, eventually stomping out. Slughorn locks the door. Harry finds Ron in the boy’s dormitory, dreamily gazing out the window with a gift box. Ron throws the heart-emblazoned box down, smiling inanely. Harry reads the chocolate’s card, grins, and crosses to Ron as little hearts float. Ron embraces Slughorn, who pries him off. Ron falls off the sofa, and Slughorn gives him a potion. Ron's inane smile fades as he looks quizzically at Harry. He drinks, then collapses, foaming at the mouth. Harry rushes to Slughorn's potion cabinet, places a potion in Ron's mouth, and leans over him as Ron lies breathless on the floor."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The tall, thin-faced, bearded figure stops with a menacing smile. Harry appears behind Ginny, raises his wand, but Greyback deflects the spell, spiraling away in black smoke. Ginny and Harry, unable to find him, take refuge on a sandy island. Bellatrix spots them, as Remus and Tonks search. On the island, Ginny and Harry fend off attacks with wands. Tonks, Remus, and Mr. Weasley join them in a back-to-back formation. Bellatrix and Greyback watch, change form, and the Weasley house ignites. Mr. Weasley reunites with his family, watching the house burn. Lavender puts a heart pendant on Ron. Hermione heads away, and Harry nods to Ron. Lavender leaps on Ron's back. Harry enters Dumbledore's cabinet and plunges into the pensive. At Slughorn’s tea party, Riddle taps an hourglass; the memory stops as Slughorn shifts uneasily. Slughorn sees Harry and stomps out, locking the door. Harry finds Ron gazing out the window with a heart gift box. Ron tosses it aside, smiling inanely. Harry reads the chocolate card as Ron gazes at the moon. Ron embraces Slughorn, who gives him a potion. Ron's smile fades, but he collapses after drinking again. Harry grabs a potion for Ron, who lies breathless."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The mysterious figure stands impressively tall, characterized by a thin, angular face framed by a well-groomed beard. He pauses for a moment, casting a menacing smile across the scene. Suddenly, Harry emerges stealthily from behind Ginny, ready to take action, and promptly raises his wand with determination. Greyback, however, skillfully deflects the spell with ease and, in a dramatic display, ascends into the air, transforming into a spiraling mass of ominous black smoke. Ginny and Harry, now vigilant, turn around in circles, desperately searching for any sign of him but finding none. Taking precaution, they seek safety on a small, isolated island of sand.\n\nTheir quiet refuge is short-lived, as Bellatrix soon spots them from a distance. Meanwhile, Remus and Tonks are seen still searching tirelessly nearby. On their diminutive island, Ginny and Harry work together, valiantly fending off ongoing magical attacks using their wands. Reinforcements arrive when Tonks, Remus, and Mr. Weasley join them on the sandy outcrop. Together, they form a tight-knit circle, standing back-to-back, with their wands raised and ready for battle. Bellatrix observes them intently, while Greyback, standing alongside her, exchanges a knowing glance with Bellatrix. In an instant, they change forms and shoot skyward, transforming into a swirling cloud of dark, magical spellwork. Suddenly, they attack the Weasley house, resulting in a terrifying explosion that engulfs it in flames. Mr. Weasley quickly sprints off to the house. He soon finds his family safely gathered, watching the destructive flames consume their beloved home. In a comforting gesture, he puts a reassuring arm around his wife, while the others join them. Together, they watch helplessly as the Weasley house is reduced to ashes.\n\nIn another moment elsewhere, Lavender wraps a heart-shaped pendant lovingly around Ron's neck, with Hermione observing the scene of affection. She watches as Lavender simpers over Ron before deciding to head back the way she came. Harry gives Ron a knowing nod and then walks along the corridor with purpose. In a playful move, Lavender leaps onto Ron's back, causing him to stagger away with her. Meanwhile, they arrive at Professor Dumbledore's office, where a cabinet of vials catches their attention. Harry plunges his face into the pensieve, immersing himself in a memory. He finds himself at a scene featuring a teenage Tom Riddle participating in a tea party hosted by Slughorn, who smiles uneasily. Tom taps the hourglass, and the memory draws to a stop. As the vision dissipates, Harry straightens up.\n\nDumbledore steps forward, dipping his hand into the pensieve as Harry stands solemnly before him, giving a respectful nod. The Potions class leaves, and Slughorn turns around, noticing Harry. Slughorn shifts uneasily as he looks at him. On his way out, Slughorn pauses momentarily, spins around to stare at Harry, who remains unfazed. Slughorn stomps out in frustration, closing the spyhole and locking the door securely behind him. Harry eventually finds Ron seated in the boy's dormitory. Ron sits on the floor, lost in a dreamy gaze out of the window, holding a gift box. As Harry moves away, Ron leans in closer, then suddenly throws down the box, which bears a heart symbol on it. Harry stares at Ron, who gives him an inane smile, his eyes distant and dreamy. As Ron sits on the floor and gazes up at the moon, Harry picks up the card that came with the chocolates, reads it, and grins before crossing over to Ron. Little animated hearts float from the card, adding a whimsical touch to the moment.\n\nIn a comical twist, Ron embraces Slughorn enthusiastically, prompting Harry to gently pry him away. Ron perches on the back of the sofa, only to tumble off in a clumsy fall. Slughorn offers him a potion, and Ron drinks it. The inane, fixed smile fades gradually, replaced by a quizzical expression as he glances up at Harry. Slughorn fills three glasses with liquid, and as Ron takes a sip, he shockingly collapses, foaming at the mouth. In haste, Harry rushes to Slughorn's potion cabinet as Ron convulses on the floor. He quickly administers a potion to Ron by placing it in his mouth. Harry leans over Ron, who lies motionless on his back, no longer breathing, in a desperate attempt to revive him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The intriguing and enigmatic figure stands impressively tall, possessing a thin, angular face that is accentuated by a meticulously well-groomed beard. He pauses deliberately for a moment, casting a menacing smile that spreads ominously across the entire scene. In an unexpected turn of events, Harry emerges quietly and stealthily from behind Ginny, fully prepared to take decisive action, and with determination, he promptly raises his wand. Greyback, however, displays his skill by deftly deflecting the spell with ease and, in a dramatic and impressive display, ascends gracefully into the air, transforming into a spiraling mass of ominous black smoke. Ginny and Harry, now on high alert and vigilant, turn around in circles, desperately searching for any sign of him but finding none. Taking necessary precautions, they seek safety and refuge on a small, isolated, and sandy island.\n\nTheir brief moment of quiet retreat is cut short when Bellatrix soon spots them from a distance. Meanwhile, Remus and Tonks are visibly still searching tirelessly nearby. On their diminutive island, Ginny and Harry work diligently together, valiantly fending off the ongoing magical attacks using their wands. Reinforcements arrive when Tonks, Remus, and Mr. Weasley come to their aid on the sandy outcrop. Together, they form a tight-knit, protective circle, standing resolutely back-to-back, with their wands raised high and ready for battle. Bellatrix observes them intently, while Greyback stands alongside her, exchanging a knowing glance with Bellatrix. In an instant, they both change forms, shooting skyward and transforming into a swirling, formidable cloud of dark magical spellwork. Suddenly, they launch a vicious attack on the Weasley house, resulting in a terrifying explosion that engulfs it in flames. Mr. Weasley quickly sprints toward the house. He soon discovers his family safely gathered, watching the destructive flames consume their beloved home. In a comforting gesture, he puts a reassuring arm around his wife, while the others join them. Together, they stand helplessly and watch as the Weasley house is tragically reduced to ashes.\n\nIn another moment occurring elsewhere, Lavender wraps a heart-shaped pendant lovingly around Ron's neck, with Hermione observing this scene of affectionate exchange. She watches as Lavender simpers over Ron before deciding to retrace her steps and head back the way she came. Harry gives Ron a knowing nod and then walks purposefully along the corridor. In a playful and lighthearted move, Lavender leaps onto Ron's back, causing him to stagger away with her on his back. Meanwhile, they arrive at the entrance to Professor Dumbledore's office, where a cabinet filled with vials captures their attention. Harry plunges his face into the pensieve, immersing himself deeply in a memory. He finds himself at a scene featuring a teenage Tom Riddle participating in a tea party hosted by the uneasy-looking Slughorn, who smiles with a hint of discomfort. Tom taps the hourglass, prompting the memory to draw to a halt. As the vision dissipates, Harry straightens up.\n\nDumbledore steps forward, dipping his hand into the pensieve as Harry stands solemnly before him, giving a respectful nod. The Potions class starts to leave, and Slughorn turns around, noticing Harry. Slughorn shifts uneasily as he looks toward him. On his way out, Slughorn pauses momentarily, spinning around to stare at Harry, who remains unfazed. Slughorn stomps out in frustration, closing the spyhole and securely locking the door behind him. Eventually, Harry locates Ron seated in the boy's dormitory. Ron sits on the floor, lost in a dreamy gaze out of the window, holding a gift box. As Harry moves away, Ron leans in closer, then suddenly throws down the box, which bears a heart symbol on it. Harry stares at Ron, who gives him an inane smile, his eyes distant and dreamy. As Ron sits on the floor and gazes up at the moon, Harry picks up the card that came with the chocolates, reads it with amusement, and grins before crossing over to Ron. Little animated hearts float out from the card, adding a whimsical and playful touch to the moment.\n\nIn a comical twist of events, Ron embraces Slughorn enthusiastically, prompting Harry to gently pry him away. Ron perches precariously on the back of the sofa, only to tumble off in a clumsy fall. Slughorn offers him a potion, and Ron drinks it. The previously inane, fixed smile fades gradually, replaced by a quizzical expression as he glances up at Harry. Slughorn fills three glasses with liquid; as Ron takes a sip, he shockingly collapses, foaming at the mouth. In haste, Harry rushes to Slughorn's potion cabinet as Ron convulses on the floor. He quickly administers a potion to Ron by placing it in his mouth. Harry leans over Ron, who lies motionless on his back, no longer breathing, in a desperate attempt to revive him."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The tall figure with a thin face and beard halts his movement, allowing a moment of suspense to hang in the air before curling his lips into a menacing smile that speaks of imminent danger. In the background, Harry materializes behind Ginny, silently appearing as her protector, and deftly raises his wand with intent, preparing to cast a spell. Greyback, with uncanny reflexes, swiftly deflects the spell, and in an extraordinary movement, he ascends skyward, twisting and turning in a spiral of black smoke that quickly obscures him from view. Ginny and Harry, alert and tense, rotate in place, scanning the area around them in an attempt to locate any trace of him, but their search proves fruitless. Seeking a tactical advantage, they retreat to a small, isolated patch of sand that offers some semblance of safety. It is not long before Bellatrix, with her ever-watchful eyes, spots the duo. Meanwhile, Remus and Tonks continue their search, alert to the danger that lurks. On the confined sandy haven, Ginny and Harry remain vigilant, parrying attacks with precise movements of their wands. Tonks, Remus, and Mr. Weasley soon converge on their position, completing the group. Together, they unify their defenses by forming a protective circle, standing back-to-back with wands held ready to counter any oncoming threat. Bellatrix observes them with predatory focus, while Greyback casts a glance toward Bellatrix, as if communicating silently. In a strategic transformation, they shift their forms and shoot into the air as a dense, black spell-cloud gathers momentum. This sinister cloud descends upon the Weasley house, igniting it into a blazing inferno. In a burst of urgency, Mr. Weasley dashes off, propelled by concern, and soon discovers his family unharmed, watching the destruction unfold before them with dismay etched across their faces. He comforts his wife with a reassuring arm around her shoulders as the rest join in solidarity. Together, they stand as silent witnesses, rendered powerless as the flames consume the Weasley home. Lavender, in an act of affection, places a heart-shaped pendant around Ron's neck. Hermione, observing Lavender’s overt display of endearment toward Ron, decides to retrace her steps, leaving the scene. Harry silently exchanges a knowing nod with Ron before he strides down the corridor. Lavender energetically jumps onto Ron's back, causing him to stagger under her playful weight. Meanwhile, in Professor Dumbledore's private cabinet of memories—encapsulated in vials—Harry immerses himself by leaning forward into the pensive. He is transported to a memory of a teenage Tom Riddle attending a Slughorn tea party, where Slughorn attempts a smile that fails to mask his unease. Tom, with a casual yet deliberate motion, taps the hourglass, effectively bringing the memory to a halt. Emerging from the pensive, Harry straightens himself, then meets Dumbledore’s solemn gaze and acknowledges him with a nod. As Potions class disperses, Slughorn turns, noticing Harry, and shifts with discomfort. On the verge of leaving, Slughorn hesitates, turns decisively, and fixes his stare on Harry, who remains unflinching. Slughorn exits, shutting the spyhole with finality and securing the door with a lock. Harry later discovers Ron in the boy's dormitory, sitting dreamily on the floor, gazing out at the night sky. Ron cradles a decorative gift box. As Harry moves aside, Ron leans in, inspecting the box before disdainfully tossing it aside, revealing its heart motif. As Ron communicates with a distant, goofy smile on his face, Harry observes him, amusement dancing in his gaze. Positioned on the floor, Ron looks up at the moon, while Harry examines a card accompanying chocolates, causing him to chuckle before stepping back to Ron. Animated hearts float whimsically from the card. In a sudden outburst of affection, Ron embraces Slughorn, only for Harry to separate them. Ron precariously perches on the back of a sofa, only to tumble off moments later. Slughorn offers Ron a potion, which he consumes, dispelling the fixed smile and leaving him to look questioningly at Harry. Slughorn prepares and distributes three glasses of potion, which Ron drinks before collapsing dramatically, foam forming at his mouth. Reacting quickly, Harry races to Slughorn's potion cabinet, seeking an antidote as Ron convulses on the floor. Harry places the potion into Ron's mouth and leans over him, desperate, as Ron lies motionless, his breath ceased."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The tall, thin-faced, bearded figure stops, smiling menacingly as Harry appears behind Ginny, raises his wand, but Greyback deflects the spell and spirals upward in black smoke. As Ginny and Harry turn in circles, unable to see him, they take refuge on a small sand island. Bellatrix spots them while Remus and Tonks continue searching. Ginny and Harry fend off attacks together until Tonks, Remus, and Mr. Weasley join them, forming a defensive circle, backs together, with wands ready, under Bellatrix’s watchful eye. Observing Greyback and Bellatrix transform and soar upward, the group watches as the Weasley house ignites. Mr. Weasley runs to find his family safe, putting an arm around his wife as they watch the house burn engulfed in flames. Meanwhile, Lavender puts a heart pendant around Ron's neck, under Hermione's watchful eye, who then leaves. Harry nods to Ron and walks down the corridor while Lavender playfully jumps on Ron’s back, and he staggers away with her. In Dumbledore’s office, Harry dives into the Pensieve, witnessing a teenage Tom Riddle at Slughorn’s tea party. The memory halts as Tom taps an hourglass. Harry rises solemnly, nodding at Dumbledore. After Potions class, Slughorn hesitates, unsettled by Harry, and exits, locking the door behind him. In the boy's dormitory, Harry finds Ron dreamily gazing out the window, with a gift box in hand. As Harry reads a card with floating hearts, Ron throws down the box, grinning inanely. Harry approaches, sharing in the moment until Ron suddenly embraces Slughorn, whom Harry has to pry him off before Ron falls off the sofa. Slughorn gives Ron a potion, erasing his smile. Ron drinks, then collapses, foaming at the mouth. As Ron convulses, Harry rushes to Slughorn’s potion cabinet, manages to administer a potion to Ron, leaning over him until Ron is no longer breathing."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The figure is tall with a thin face and beard, reminiscent of the infamous werewolf Fenrir Greyback known for his menacing presence. He stops and smiles menacingly. Harry, the young wizard famous for surviving a deadly curse as a baby, appears behind Ginny and raises his wand. Greyback, skilled in dark magic, deflects the spell. He flies up in a spiral of black smoke, a typical escape method for Death Eaters, Voldemort's loyal followers. Ginny and Harry turn in circles, but can see no sign of him. They take refuge on a small island of sand amidst the chaos surrounding them. Bellatrix, the notorious witch and one of Voldemort’s most devoted followers, spots them. Remus Lupin, afflicted by lycanthropy, and Tonks, an Auror known for her ability to change her appearance at will, are still searching. On their tiny island, Ginny and Harry fend off attacks with their wands, honed from years of practice at Hogwarts School of Witchcraft and Wizardry. Tonks, Remus, and Mr. Weasley, the patriarch of the large Weasley family known for their red hair and kindness, join them on the island. They form a circle, back-to-back, wands poised in a defensive stance learned through battling dark forces. Bellatrix watches them with a sinister gleam. Greyback glances at Bellatrix. They change form, demonstrating their proficiency in dark transfiguration, and shoot into the sky, a cloud of black spell. They attack the Weasley house, known as the Burrow, which bursts into flames. Mr. Weasley sprints off, desperate to ensure the safety of his family. He finds his family safe, watching their house burn, a symbol of their enduring love and unity. He puts an arm around his wife, Molly, known for her fierce protectiveness. The others join them. And they all watch helplessly, as the Weasley house is engulfed in flames, a tragic loss for the close-knit family. Lavender Brown, a classmate known for her affection towards Ron, puts a heart pendant round Ron's neck. Hermione Granger, the brightest witch of her age, watches Lavender simpering over Ron. She heads back the way they came, feeling a twinge of jealousy. Harry nods to Ron, then walks along the corridor, aware of the complicated emotions among his friends. Lavender leaps on Ron's back, and he staggers away with her, overwhelmed by her attention. Professor Dumbledore's cabinet of vials holds memories crucial to understanding Voldemort's past. Harry plunges his face into the pensive, a magical device for viewing memories. He sees teenage Tom Riddle, the young Voldemort, at a Slughorn tea party. Slughorn, the Potions Master with a penchant for collecting noteworthy students, smiles uneasily. Tom taps the hourglass, imbued with sophisticated magic. The memory stops. Harry straightens up, his mind whirling with new information. Dumbledore dips his hand into the pensive, his eyes filled with concern and wisdom. Harry stands solemnly in front of Dumbledore, and nods, acknowledging the gravity of their mission. The Potions class leave, their minds filled with the complexities of magical ingredients. Slughorn turns and sees Harry, aware of his importance in the fight against Voldemort. Slughorn shifts uneasily, recalling his own pivotal role in the past. On his way out, Slughorn stops, spins round and stares at Harry, who doesn't flinch, resolute in his purpose. He stomps out, conflicted by his past actions. Slughorn closes the spyhole and locks the door, securing his private sanctuary. Harry finds Ron in the boy's dormitory, part of the Gryffindor house at Hogwarts, known for its bravery. He's sitting on the floor, gazing dreamily out of the window, lost in thought. Ron holds a gift box, likely from his admirer. Harry moves away, as Ron leans closer, captivated by its contents. Ron throws down the box, which has a heart on it, symbolizing Lavender's infatuation. Harry stares at Ron, who smiles inanely, a faraway look in his eyes, clearly under the influence of a love potion. As Ron sits on the floor and gazes up at the moon, Harry reads the card which came with the chocolates, a notorious vehicle for magical influence. He grins and crosses to Ron, amused by the situation. Little hearts float from it, evidence of the potion’s powerful enchantment. Ron embraces Slughorn, overwhelmed by the potion's effects. Harry prises him off, aware of the impropriety. Ron sits on the back of the sofa and falls off, his coordination impaired. Slughorn gives him a potion, likely an antidote to the love potion. Ron drinks. The inane, fixed smile fades, his senses returning to normal. He looks quizzically up at Harry, who is relieved. He fills three glasses, intending to set things right. Ron drinks and collapses, foaming at the mouth, a sign of a more sinister potion at play. Harry runs to Slughorn's potion cabinet, as Ron convulses on the floor. He puts one in Ron's mouth, administering a bezoar, known for its ability to counteract poisons. He leans over Ron, who lies on his back, no longer breathing, praying for his friend’s survival."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The figure is tall with a thin face and beard. He stops and smiles menacingly. Harry appears behind Ginny and raises his wand. Greyback deflects the spell. He flies up in a spiral of black smoke. Ginny and Harry turn in circles but can see no sign of him. They take refuge on a small island of sand. Bellatrix spots them. Remus and Tonks are still searching. On their tiny island. Ginny and Harry fend off attacks with their wands. Tonks. Remus and Mr Weasley join them on the island. They form a circle backtoback wands poised. Bellatrix watches them. Greyback glances at Bellatrix. They change form and shoot into the sky the cloud of black spell. They attack the Weasley house which bursts into flames. Mr Weasley sprints off. He finds his family safe watching their house burn. He puts an arm around his wife. The others join them. And they all watch helplessly as the Weasley house is engulfed in flames. Lavender puts a heart pendant round Ron's neck. Hermione watches Lavender simpering over Ron. She heads back the way they came. Harry nods to Ron then walks along the corridor. Lavender leaps on Ron's back and he staggers away with her. Professor Dumbledore's cabinet of vials. Harry plunges his face into the pensive. Teenage Tom Riddle at a Slughorn tea party. Slughorn smiles uneasily. Tom taps the hourglass. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. The memory stops. Harry straightens up. Dumbledore dips his hand into the pensive. Harry stands solemnly in front of Dumbledore and nods. The Potions class leave. Slughorn turns and sees Harry. Slughorn shifts uneasily. On his way out. Slughorn stops spins round and stares at Harry who does not flinch. He stomps out. Slughorn closes the spyhole and locks the door. Harry finds Ron in the boy's dormitory. He is sitting on the floor gazing dreamily out of the window. Ron holds a gift box. Harry moves away as Ron leans closer. Ron throws down the box which has a heart on it. Harry stares at Ron who smiles inanely a far away look in his eyes. As Ron sits on the floor and gazes up at the moon. Harry reads the card which came with the chocolates. He grins and crosses to Ron. Little hearts float from it. Ron embraces Slughorn. Harry prises him off. Ron sits on the back of the sofa and falls off. Slughorn gives him a potion. Ron drinks. The inane fixed smile fades. He looks quizzically up at Harry. He fills three glasses. Ron drinks and collapses foaming at the mouth. Harry runs to Slughorn's potion cabinet as Ron convulses on the floor. He puts one in Ron's mouth. He leans over Ron who lies on his back no longer breathing."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The figure is tall with a thin face and beard. He stops and smiles menacingly. Harry appears behind Ginny and raises his wand. Greyback deflects the spell. He flies up in a spiral of black smoke. Ginny and Harry turn in circles but can see no sign of him. They take refuge on a small island of sand. Bellatrix spots them. Remus and Tonks are still searching. On their tiny island. Ginny and Harry fend off attacks with their wands. Tonks. Remus and Mr Weasley join them on the island. They form a circle backtoback wands poised. Bellatrix watches them. Greyback glances at Bellatrix. They change form and shoot into the sky the cloud of black spell. They attack the Weasley house which bursts into flames. Mr Weasley sprints off. He finds his family safe watching their house burn. He puts an arm around his wife. The others join them. And they all watch helplessly as the Weasley house is engulfed in flames. Lavender puts a heart pendant round Ron's neck. Hermione watches Lavender simpering over Ron. She heads back the way they came. Harry nods to Ron then walks along the corridor. Lavender leaps on Ron's back and he staggers away with her. Professor Dumbledore's cabinet of vials. Harry plunges his face into the pensive. Teenage Tom Riddle at a Slughorn tea party. Slughorn smiles uneasily. Tom taps the hourglass. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. The memory stops. Harry straightens up. Dumbledore dips his hand into the pensive. Harry stands solemnly in front of Dumbledore and nods. The Potions class leave. Slughorn turns and sees Harry. Slughorn shifts uneasily. On his way out. Slughorn stops spins round and stares at Harry who does not flinch. He stomps out. Slughorn closes the spyhole and locks the door. Harry finds Ron in the boy's dormitory. He is sitting on the floor gazing dreamily out of the window. Ron holds a gift box. Harry moves away as Ron leans closer. Ron throws down the box which has a heart on it. Harry stares at Ron who smiles inanely a far away look in his eyes. As Ron sits on the floor and gazes up at the moon. Harry reads the card which came with the chocolates. He grins and crosses to Ron. Little hearts float from it. Ron embraces Slughorn. Harry prises him off. Ron sits on the back of the sofa and falls off. Slughorn gives him a potion. Ron drinks. The inane fixed smile fades. He looks quizzically up at Harry. He fills three glasses. Ron drinks and collapses foaming at the mouth. Harry runs to Slughorn's potion cabinet as Ron convulses on the floor. He puts one in Ron's mouth. He leans over Ron who lies on his back no longer breathing."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The figure is tall with a thin face and beard. He stops and smiles menacingly. Harry appears behind Ginny and raises his wand. Greyback deflects the spell. He flies up in a spiral of black smoke. Ginny and Harry turn in circles but can see no sign of him. They take refuge on a small island of sand. Bellatrix spots them. Remus and Tonks are still searching. On their tiny island. Ginny and Harry fend off attacks with their wands. Tonks. Remus and Mr Weasley join them on the island. They form a circle backtoback wands poised. Bellatrix watches them. Greyback glances at Bellatrix. They change form and shoot into the sky the cloud of black spell. As Ron sits on the floor and gazes up at the moon. Harry reads the card which came with the chocolates. He grins and crosses to Ron. Little hearts float from it. Ron embraces Slughorn. Harry prises him off. Ron sits on the back of the sofa and falls off. Slughorn gives him a potion. Ron drinks. The inane fixed smile fades. He looks quizzically up at Harry. He fills three glasses. Ron drinks and collapses foaming at the mouth. Harry runs to Slughorn's potion cabinet as Ron convulses on the floor. He puts one in Ron's mouth. He leans over Ron who lies on his back no longer breathing."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The figure is tall with a thin face and beard. He stops and smiles menacingly. Harry appears behind Ginny and raises his wand. Greyback deflects the spell. He flies up in a spiral of black smoke. Ginny and Harry turn in circles but can see no sign of him. They take refuge on a small island of sand. The inane fixed smile fades. He looks quizzically up at Harry. He fills three glasses. Ron drinks and collapses foaming at the mouth. Harry runs to Slughorn's potion cabinet as Ron convulses on the floor. He puts one in Ron's mouth. He leans over Ron who lies on his back no longer breathing."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The giraffe is short with a round belly and feathers. It skips and frowns cheerfully. Lucy emerges under Max and lowers her umbrella. Bane absorbs the raindrop. It sails down in a cascade of purple mist. Max and Lucy spin in squares, but can spot no trace of it. They seek shelter on a large iceberg of grass. Narcissa notices them. Sirius and Luna are still exploring. On their enormous iceberg, Lucy and Max repel gusts with their umbrellas. Luna, Sirius, and Mrs. Granger accompany them on the iceberg. They create a square, side-to-side, umbrellas readied. Narcissa observes them. Bane peeks at Narcissa. They transform shape, and dive into the sea, the wave of purple raindrop. They tickle the Granger garage, which implodes into laughter. Mrs. Granger marches away. She discovers her friends amused, admiring their garage dissolve. She places a leg around her neighbor. The rest approach them. And they all admire joyfully, as the Granger garage is engulfed in laughter. Parvati places a star bracelet round Fred's leg. Draco observes Parvati giggling at Fred. He rolls forward the path they avoided. Lucy winks to Fred, then sprints across the tunnel. Parvati jumps on Fred's feet, and he crawls away with her. Teacher Snape's box of candles. Lucy plunges her foot into the cauldron. College Alfred Crouch at a Moody dance lesson. Moody laughs nervously. Alfred knocks the sundial. The dream pauses. Lucy straightens down. Snape dips his nose into the cauldron. Lucy sits casually beside Snape, and winks. The Divination club arrives. Moody shifts and notices Lucy. Moody rolls confidently. During his departure, Moody halts, flips over, and gazes at Lucy, who doesn't blink. He hops away. Moody secures the peephole and opens the window. Lucy discovers Fred in the cat's attic. He’s standing by the ceiling, admiring joyfully through the chimney. Fred holds a puzzle piece. Lucy sneaks closer, as Fred leans further. Fred hurls aside the puzzle, which bears a star upon it. Lucy views Fred, who frowns seriously, a close gaze in his nose. As Fred stands by the ceiling and glances down at the sun, Lucy writes the diary which came with the biscuits. She laughs and leaps toward Fred. Large stars burst from it. Fred hugs Moody. Lucy pries him away. Fred stands on the side of the chair and rises off. Moody hands him a scone. Fred eats. The serious, lively frown vanishes. He glances mysteriously toward Lucy. He empties five bowls. Fred eats and rises, chuckling at the nose. Lucy jogs to Moody’s scone box, as Fred sings on the ceiling. He places one in Fred’s nose. He bounces beside Fred, who sits on his nose, no longer humming."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The tall figure with a thin face and beard menacingly smiles as Harry appears behind Ginny, raising his wand. Greyback deflects Harry's spell and disappears in black smoke. Ginny and Harry find refuge on a sand island, fending off attacks with their wands. Bellatrix observes while Remus, Tonks, and Mr. Weasley join them, forming a protective circle. Greyback and Bellatrix attack the Weasley house, which bursts into flames. Mr. Weasley finds his family safe, and they watch helplessly as their home burns. Hermione sees Lavender putting a pendant on Ron and leaves. Lavender clings to Ron, who stumbles away. At a Slughorn tea party, a young Tom Riddle stops time with an hourglass. Harry and Dumbledore study this in the pensive, with Slughorn growing uneasy. Harry later finds Ron dreamily staring at a window with a heart-marked gift box. After receiving chocolates, Ron acts oddly, hugging Slughorn until Harry intervenes. Ron collapses, foaming at the mouth, but Harry finds an antidote in Slughorn's potion cabinet, saving him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He leans over Ron who lies on his back no longer breathing He puts one in Ron's mouth Harry runs to Slughorn's potion cabinet as Ron convulses on the floor Ron drinks and collapses foaming at the mouth He fills three glasses He looks quizzically up at Harry The inane fixed smile fades Ron drinks Slughorn gives him a potion Ron sits on the back of the sofa and falls off Harry prises him off Ron embraces Slughorn Little hearts float from it He grins and crosses to Ron Harry reads the card which came with the chocolates As Ron sits on the floor and gazes up at the moon Harry stares at Ron who smiles inanely a far away look in his eyes Ron throws down the box which has a heart on it Harry moves away as Ron leans closer Ron holds a gift box He is sitting on the floor gazing dreamily out of the window Harry finds Ron in the boy's dormitory Slughorn closes the spyhole and locks the door He stomps out Slughorn stops spins round and stares at Harry who does not flinch On his way out Slughorn shifts uneasily Slughorn turns and sees Harry The Potions class leave Harry stands solemnly in front of Dumbledore and nods Dumbledore dips his hand into the pensive Harry straightens up The memory stops Tom taps the hourglass Slughorn smiles uneasily Teenage Tom Riddle at a Slughorn tea party Harry plunges his face into the pensive Professor Dumbledore's cabinet of vials Lavender leaps on Ron's back and he staggers away with her Harry nods to Ron then walks along the corridor She heads back the way they came Hermione watches Lavender simpering over Ron Lavender puts a heart pendant round Ron's neck And they all watch helplessly as the Weasley house is engulfed in flames The others join them He puts an arm around his wife He finds his family safe watching their house burn Mr Weasley sprints off They attack the Weasley house which bursts into flames They change form and shoot into the sky the cloud of black spell Greyback glances at Bellatrix Bellatrix watches them They form a circle backtoback wands poised Remus and Mr Weasley join them on the island Tonks Ginny and Harry fend off attacks with their wands On their tiny island Remus and Tonks are still searching Bellatrix spots them They take refuge on a small island of sand Ginny and Harry turn in circles but can see no sign of him He flies up in a spiral of black smoke Greyback deflects the spell Harry appears behind Ginny and raises his wand He stops and smiles menacingly The figure is tall with a thin face and beard"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He stops and smiles menacingly The figure is tall with a thin face and beard Greyback deflects the spell Harry appears behind Ginny and raises his wand Ginny and Harry turn in circles but can see no sign of him He flies up in a spiral of black smoke Bellatrix spots them They take refuge on a small island of sand On their tiny island Remus and Tonks are still searching Tonks Ginny and Harry fend off attacks with their wands They form a circle backtoback wands poised Remus and Mr Weasley join them on the island Greyback glances at Bellatrix Bellatrix watches them They attack the Weasley house which bursts into flames They change form and shoot into the sky the cloud of black spell He finds his family safe watching their house burn Mr Weasley sprints off The others join them He puts an arm around his wife Lavender puts a heart pendant round Ron's neck And they all watch helplessly as the Weasley house is engulfed in flames She heads back the way they came Hermione watches Lavender simpering over Ron Lavender leaps on Ron's back and he staggers away with her Harry nods to Ron then walks along the corridor Harry plunges his face into the pensive Professor Dumbledore's cabinet of vials Slughorn smiles uneasily Teenage Tom Riddle at a Slughorn tea party The memory stops Tom taps the hourglass Dumbledore dips his hand into the pensive Harry straightens up The Potions class leave Harry stands solemnly in front of Dumbledore and nods Slughorn shifts uneasily Slughorn turns and sees Harry Slughorn stops spins round and stares at Harry who does not flinch On his way out Slughorn closes the spyhole and locks the door He stomps out He is sitting on the floor gazing dreamily out of the window Harry finds Ron in the boy's dormitory Harry moves away as Ron leans closer Ron holds a gift box Harry stares at Ron who smiles inanely a far away look in his eyes Ron throws down the box which has a heart on it Harry reads the card which came with the chocolates As Ron sits on the floor and gazes up at the moon Little hearts float from it He grins and crosses to Ron Harry prises him off Ron embraces Slughorn Slughorn gives him a potion Ron sits on the back of the sofa and falls off The inane fixed smile fades Ron drinks He fills three glasses He looks quizzically up at Harry Harry runs to Slughorn's potion cabinet as Ron convulses on the floor Ron drinks and collapses foaming at the mouth He leans over Ron who lies on his back no longer breathing He puts one in Ron's mouth"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The memory stops Harry straightens up Dumbledore dips his hand into the pensive Harry stands solemnly in front of Dumbledore and nods The Potions class leave Slughorn turns and sees Harry Slughorn shifts uneasily On his way out Slughorn stops spins round and stares at Harry who does not flinch He stomps out Slughorn closes the spyhole and locks the door Harry finds Ron in the boy's dormitory He is sitting on the floor gazing dreamily out of the window Ron holds a gift box Harry moves away as Ron leans closer Ron throws down the box which has a heart on it Harry stares at Ron who smiles inanely a far away look in his eyes As Ron sits on the floor and gazes up at the moon Harry reads the card which came with the chocolates He grins and crosses to Ron Little hearts float from it Ron embraces Slughorn Harry prises him off Ron sits on the back of the sofa and falls off Slughorn gives him a potion Ron drinks The inane fixed smile fades He looks quizzically up at Harry He fills three glasses Ron drinks and collapses foaming at the mouth Harry runs to Slughorn's potion cabinet as Ron convulses on the floor He puts one in Ron's mouth He leans over Ron who lies on his back no longer breathing The figure is tall with a thin face and beard He stops and smiles menacingly Harry appears behind Ginny and raises his wand Greyback deflects the spell He flies up in a spiral of black smoke Ginny and Harry turn in circles but can see no sign of him They take refuge on a small island of sand Bellatrix spots them Remus and Tonks are still searching On their tiny island Ginny and Harry fend off attacks with their wands Tonks Remus and Mr Weasley join them on the island They form a circle backtoback wands poised Bellatrix watches them Greyback glances at Bellatrix They change form and shoot into the sky the cloud of black spell They attack the Weasley house which bursts into flames Mr Weasley sprints off He finds his family safe watching their house burn He puts an arm around his wife The others join them And they all watch helplessly as the Weasley house is engulfed in flames Lavender puts a heart pendant round Ron's neck Hermione watches Lavender simpering over Ron She heads back the way they came Harry nods to Ron then walks along the corridor Lavender leaps on Ron's back and he staggers away with her Professor Dumbledore's cabinet of vials Harry plunges his face into the pensive Teenage Tom Riddle at a Slughorn tea party Slughorn smiles uneasily Tom taps the hourglass"
        }
      ]
    }
  ]
}