{
  "ground_truth": "Harry's hair is disheveled as he splashes water on his ashen face. Harry watches the sobbing Draco from the doorway as Draco draws his wand and casts a spell, to which Harry responds. Draco casts another spell, and they hide at each of the cubicles. Draco appears around the corner and ducks back, while Harry peeks out, his image reflected in a mirror. They crawl on the floor, peering underneath the cubicles, and Draco misses Harry. Harry stands up and aims his wand, causing Draco to stumble back and fall into the water accumulating on the floor from a burst pipe. With a book in one hand and his wand in the other, Harry slowly walks the length of the cubicles, rounds the corner, and sees Draco sprawled on his back. Shocked, Harry stumbles forward and sees blood oozing into the water, with bloodstains spreading over Draco's white shirt. Snape strides in, brushes past Harry, and stands over Draco, glaring at Harry, who avoids his gaze and leaves. Snape kneels, and the blood recedes as the bloodstains disappear. In the Gryffindor common room, the potions book lies on the table in front of Harry, while Ginny, Hermione, and Ron are silhouetted against the light from a lead-paned window. Ginny crosses to Harry and sits beside him, and Harry nods. Standing in front of the unicorn tapestry, Harry takes Ginny's outstretched hand and grips it firmly inside the cluttered room. As Ginny leads him forward, they are reflected in a mirror, and they wander through the Room of Requirement. A sound comes from the triangular gap of a cabinet covered with a heavy cloth, and Harry approaches. The ends of the cloth don't quite meet, and through the gap, Harry sees the door. A bird flies out and settles on a stone shelf while Harry gazes at Ginny. She walks toward him, stands close, and they exchange a long look. She glances at the book, takes it from his hand, and he continues looking at her. She backs away, and Harry closes his eyes, standing rooted to the spot with shallow breathing. He swallows hard but keeps his eyes shut until Ginny returns, steps close, and kisses him gently on the lips. He responds, smiles, then opens his eyes to find Ginny has disappeared. Harry walks slowly along a corridor lost in thought when Ron approaches, and Professor Slughorn stops in front of them before hurrying away. In the common room, Harry uncorks the vial of Liquid Luck, watched by Hermione and Ron, and empties its contents into his mouth. They look at him as he stares into the distance, and they get to their feet while Harry grins and turns to them. As he passes students, Hermione and Ron look confused. A greenhouse window is forced open, and Slughorn's head appears.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Harry's mane is tousled as he splatters liquid on his pale visage. Harry observes the weeping Draco from the entrance as Draco pulls his wand and performs a charm, to which Harry reacts. Draco performs another charm, and they conceal themselves at each of the stalls. Draco emerges around the bend and ducks back, while Harry peers out, his likeness mirrored in a reflection. They slink on the ground, peering beneath the stalls, and Draco misses Harry. Harry rises and targets his wand, causing Draco to stagger back and tumble into the liquid gathering on the ground from a ruptured pipe. With a tome in one hand and his wand in the other, Harry gradually moves the length of the stalls, rounds the bend, and perceives Draco sprawled on his back. Astonished, Harry stumbles forward and perceives blood seeping into the liquid, with blood smears spreading over Draco's pale shirt. Snape strides in, brushes past Harry, and stands over Draco, glaring at Harry, who deflects his gaze and departs. Snape kneels, and the blood withdraws as the blood smears vanish. In the Gryffindor common area, the potions tome rests on the table in front of Harry, while Ginny, Hermione, and Ron are silhouetted against the glow from a lead-paned aperture. Ginny crosses to Harry and sits beside him, and Harry acknowledges. Standing in front of the unicorn tapestry, Harry takes Ginny's proffered hand and grips it tightly inside the cluttered chamber. As Ginny guides him forward, they are mirrored in a reflection, and they meander through the Room of Requirement. A noise emanates from the triangular crevice of a cabinet draped with a heavy covering, and Harry approaches. The ends of the covering don't quite meet, and through the crevice, Harry perceives the door. A bird flutters out and perches on a stone ledge while Harry gazes at Ginny. She strides toward him, stands close, and they exchange a lengthy gaze. She glances at the tome, takes it from his hand, and he persists in looking at her. She retreats, and Harry shuts his eyes, standing rooted to the spot with shallow inhalations. He swallows hard but keeps his eyes shut until Ginny returns, steps close, and kisses him softly on the lips. He reacts, smiles, then opens his eyes to find Ginny has vanished. Harry moves slowly along a passageway lost in contemplation when Ron approaches, and Professor Slughorn halts in front of them before hurrying away. In the common room, Harry uncorks the flask of Liquid Luck, watched by Hermione and Ron, and empties its contents into his mouth. They gaze at him as he stares into the void, and they rise to their feet while Harry beams and turns to them. As he passes pupils, Hermione and Ron appear puzzled. A greenhouse aperture is forced open, and Slughorn's head emerges."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Harry's hair is disheveled by the water splashed on his ashen face by him. Harry is watched by Draco from the doorway as Draco draws his wand and casts a spell, to which Harry responds. Another spell is cast by Draco, and each of the cubicles is hidden at by them. Draco ducks back after appearing around the corner, while Harry is reflected in a mirror as he peeks out. The floor is crawled on by them, peering underneath the cubicles, and Draco misses Harry. Harry stands up and aims his wand, causing Draco to stumble back and fall into the water that is accumulating on the floor from a burst pipe. A book is held in one hand and his wand in the other by Harry, who slowly walks the length of the cubicles, rounds the corner, and sees Draco sprawled on his back. Shocked, Harry stumbles forward and sees blood oozing into the water, with bloodstains spreading over Draco's white shirt. Snape strides in, brushes past Harry, and stands over Draco, glaring at Harry, who avoids his gaze and leaves. The blood recedes as the bloodstains disappear when Snape kneels. In the Gryffindor common room, in front of Harry lies the potions book on the table, while Ginny, Hermione, and Ron are silhouetted against the light from a lead-paned window. Ginny crosses to Harry, sits beside him, and is nodded at by Harry. Ginny's outstretched hand is taken by Harry as he stands in front of the unicorn tapestry and grips it firmly inside the cluttered room. As she leads him forward, they are reflected in a mirror, and the Room of Requirement is wandered through by them. A sound comes from a triangular gap of a cabinet covered with a heavy cloth, and it is approached by Harry. The ends of the cloth don't quite meet, and through the gap, the door is seen by Harry. A bird flies out and settles on a stone shelf while Ginny is gazed at by Harry. She walks toward him, stands close, and they exchange a long look. The book is glanced at by her, taken from his hand, and she is looked at continuously by him. She backs away, and Harry closes his eyes, standing rooted to the spot with shallow breathing. He swallows hard but keeps his eyes shut until she returns, steps close, and kisses him gently on the lips. He responds, smiles, and then his eyes are opened by him to find Ginny has disappeared. Harry walks slowly along a corridor lost in thought when he is approached by Ron, and they are stopped in front of by Professor Slughorn before he hurries away. In the common room, the vial of Liquid Luck is uncorked by Harry, watched by Hermione and Ron, and emptied into his mouth. He is looked at by them as he stares into the distance, and they get to their feet while Harry grins and turns to them. As students are passed, Hermione and Ron look confused. A greenhouse window is forced open by Harry, and the head of Slughorn appears."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry splashes water on his disheveled hair and ashen face, watching Draco sob from the doorway. Draco casts a spell, prompting Harry to respond. They hide in cubicles, peeking out and crawling on the floor. Harry stands, aims his wand, and Draco falls into water from a burst pipe. Harry walks with a book and wand, finding Draco sprawled with blood oozing into the water. Snape enters, glares at Harry, and kneels as the bloodstains vanish. In the Gryffindor common room, the potions book is on the table. Ginny sits beside Harry, and they hold hands in front of the unicorn tapestry. In the Room of Requirement, a sound from a cabinet draws Harry's attention. A bird flies out, and Ginny approaches Harry, taking the book from him. She backs away, and Harry closes his eyes until Ginny returns and kisses him. He smiles, opens his eyes, and finds her gone. Lost in thought, Harry walks along a corridor, meeting Ron and Professor Slughorn. In the common room, Harry drinks Liquid Luck as Hermione and Ron watch. They stand as Harry grins and passes students, leaving Hermione and Ron confused. A greenhouse window opens, revealing Slughorn's head."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry splashes water on his disheveled hair and ashen face, watching Draco sobbing and casting spells. They hide in cubicles, peering underneath, and Harry causes Draco to fall into water from a burst pipe. Harry sees Draco bleeding, and Snape arrives, glaring at Harry, who leaves. Snape kneels, and the blood recedes. In the Gryffindor common room, Harry sits with Ginny, Hermione, and Ron. Ginny takes Harry's hand, and they explore the Room of Requirement. Harry approaches a cabinet, sees a bird, and exchanges a look with Ginny. She takes his book, kisses him, and disappears. Harry, lost in thought, encounters Ron and Slughorn. In the common room, Harry drinks Liquid Luck, watched by Hermione and Ron, who look confused as Harry grins. A greenhouse window opens, revealing Slughorn's head."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry's hair is in a state of disarray, tousled and unkempt, as he splashes cold water onto his pale, ashen face. From the doorway, Harry observes the sobbing Draco, who is visibly upset. Draco, with tears in his eyes, draws his wand and casts a spell, prompting Harry to respond in kind. Draco then casts another spell, and they both take cover, hiding behind the safety of the cubicles. Draco cautiously peers around the corner and quickly ducks back, while Harry, with his image reflected in a nearby mirror, peeks out as well. They crawl stealthily on the floor, peering underneath the cubicles, and Draco narrowly misses spotting Harry. Harry then stands up, aiming his wand with precision, causing Draco to stumble backward and fall into the water that is rapidly accumulating on the floor from a burst pipe. Holding a book in one hand and his wand in the other, Harry slowly walks the length of the cubicles, rounds the corner, and is taken aback to see Draco sprawled on his back. Shocked and concerned, Harry stumbles forward, noticing blood oozing into the water, with dark bloodstains spreading ominously over Draco's white shirt. Snape strides in with purpose, brushes past Harry without a word, and stands over Draco, glaring at Harry with intensity. Harry, avoiding Snape's piercing gaze, turns and leaves. Snape kneels beside Draco, and as if by magic, the blood recedes, and the bloodstains vanish completely. \n\nIn the cozy Gryffindor common room, the potions book lies open on the table in front of Harry, while Ginny, Hermione, and Ron are silhouetted against the warm light streaming through a lead-paned window. Ginny crosses the room to Harry and sits beside him, and Harry acknowledges her presence with a nod. Standing in front of the intricate unicorn tapestry, Harry takes Ginny's outstretched hand, gripping it firmly within the cluttered room. As Ginny leads him forward, their reflections appear in a mirror, and they wander together through the mysterious Room of Requirement. A sound emanates from the triangular gap of a cabinet covered with a heavy cloth, drawing Harry's attention. The ends of the cloth don't quite meet, and through the gap, Harry catches sight of the door. A bird suddenly flies out and settles on a stone shelf, while Harry gazes intently at Ginny. She walks toward him, stands close, and they exchange a long, meaningful look. She glances at the book, takes it gently from his hand, and he continues to look at her with admiration. She backs away slowly, and Harry closes his eyes, standing rooted to the spot, his breathing shallow. He swallows hard, keeping his eyes shut until Ginny returns, steps close, and kisses him gently on the lips. He responds to her kiss, smiles warmly, then opens his eyes to find that Ginny has disappeared. \n\nHarry walks slowly along a corridor, lost in thought, when Ron approaches him, and Professor Slughorn stops in front of them momentarily before hurrying away. Back in the common room, Harry uncorks the vial of Liquid Luck, watched intently by Hermione and Ron, and empties its contents into his mouth. They look at him with curiosity as he stares into the distance, and they get to their feet while Harry grins broadly and turns to them. As he passes by other students, Hermione and Ron look on, confused by his demeanor. A greenhouse window is forced open, and Slughorn's head appears, peering out with interest."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry's hair is in a state of chaotic disarray, appearing tousled and utterly unkempt, as he vigorously splashes an icy cascade of cold water onto his pale, ashen face. From the entrance of the room, Harry observes Draco, who is openly sobbing and visibly upset, tears streaming down his face. Draco, with tears flooding his eyes, draws his wand with a tense hand and casts a spell, which prompts Harry to respond in kind, brandishing his own wand. Draco subsequently casts another spell, causing both of them to take cover by hiding behind the safety of the cubicles. Draco cautiously peers around the corner, only to quickly duck back for safety, while Harry uses a nearby mirror to glimpse out, his reflection staring back at him. They crawl stealthily across the floor, their eyes peering underneath the cubicles, and Draco narrowly misses spotting Harry's hiding spot. Harry then stands up with determination, aiming his wand with precision and intention, which causes Draco to stumble backward and fall into the water rapidly accumulating on the floor from a burst pipe. Clutching a book in one hand and holding his wand in the other, Harry slowly walks the length of the cubicles, rounds the corner, and is taken aback to see Draco sprawled on his back. Shocked and filled with concern, Harry stumbles forward, noticing dark blood oozing into the water and spreading ominously over Draco's white shirt. Snape strides in with purpose, brusquely brushes past Harry without uttering a single word, and stands over Draco, glaring at Harry intensely. Harry, choosing to avoid Snape's piercing, intense gaze, turns and leaves the scene. Snape kneels beside Draco, and as if by magic, the blood gradually recedes, and the once-threatening bloodstains vanish completely from view. \n\nIn the cozy confines of the Gryffindor common room, the potions book lies open on the table directly in front of Harry, while Ginny, Hermione, and Ron are silhouetted against the warm light that streams through a lead-paned window. Ginny crosses the room to sit beside Harry, and he acknowledges her presence with a nod of recognition. Standing in front of the intricate unicorn tapestry, Harry reaches out to take Ginny's outstretched hand, gripping it firmly within the cluttered room. As Ginny leads him forward, their reflections appear in the mirror, and together, they wander through the mysterious Room of Requirement. A mysterious sound emanates from the triangular gap of a cabinet covered with a heavy cloth, drawing Harry's attentive gaze. The ends of the cloth don't quite meet, and through the gap, Harry manages to catch sight of the door inside. A bird suddenly flies out and settles on a stone shelf, while Harry gazes intently at Ginny. She walks toward him, stands close, and they exchange a long, meaningful, and lingering look. She glances at the book, takes it gently from his hand, and he continues to look at her with a sense of admiration. She slowly backs away, and Harry closes his eyes, standing rooted to the spot, his breathing shallow and measured. He swallows hard, keeping his eyes shut until Ginny returns, stepping close to him, and kisses him gently on the lips. He responds to her tender kiss, smiles warmly, then opens his eyes to discover that Ginny has disappeared from view. \n\nHarry walks slowly and thoughtfully along a corridor, lost in his own musings, when Ron approaches him, and Professor Slughorn momentarily stops in front of them before hurrying away on his own business. Back in the familiar common room, Harry uncorks the small vial of Liquid Luck while Hermione and Ron watch him intently, and he empties its contents into his mouth without hesitation. They look at him with a sense of curiosity as he stares off into the distance, and they get to their feet while Harry grins broadly and turns to them with a newfound sense of confidence. As he passes by the other students, Hermione and Ron look on, clearly confused by his unusual demeanor. A greenhouse window is forced open, and Slughorn's head appears, peering out with keen interest and curiosity."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Harry's hair is in disarray, strands sticking out in various directions, as he leans over the sink and splashes cold water onto his pale, ashen face, droplets cascading down his cheeks. Standing in the doorway, Harry's eyes fixate on Draco, who is sobbing quietly, his shoulders shaking with each breath. Draco, with a determined expression, draws his wand and utters a spell, prompting Harry to react swiftly with a counter-spell. Draco, undeterred, casts another spell, and both boys quickly seek cover, each choosing a cubicle to hide behind. Draco cautiously peeks around the corner, only to retreat quickly, while Harry, with a cautious glance, peers out, his reflection momentarily caught in a nearby mirror. They both drop to the floor, crawling on their hands and knees, trying to spot each other by looking under the cubicles, but Draco's aim is off, and he misses Harry. Seizing the opportunity, Harry rises to his feet, his wand aimed steadily, causing Draco to stumble backward and fall into the water pooling on the floor from a burst pipe. With a book clutched in one hand and his wand in the other, Harry moves slowly along the row of cubicles, rounding the corner to find Draco lying sprawled on his back. Shocked by the sight, Harry stumbles forward, his eyes widening as he notices blood oozing into the water, the red stains spreading across Draco's white shirt. At that moment, Snape strides in with purpose, brushing past Harry without a word, and stands over Draco, casting a stern glare at Harry, who avoids meeting his eyes and quietly exits the scene. Snape kneels beside Draco, and as he performs a spell, the blood begins to recede, and the stains on Draco's shirt vanish. Later, in the Gryffindor common room, the potions book lies open on the table in front of Harry, while Ginny, Hermione, and Ron are silhouetted against the light streaming through a lead-paned window. Ginny crosses the room to Harry, sits beside him, and he acknowledges her presence with a nod. Standing before the unicorn tapestry, Harry takes Ginny's outstretched hand, feeling the warmth of her grip in the cluttered room. As Ginny leads him forward, their reflections appear in a mirror, and they wander together through the Room of Requirement. A sound catches Harry's attention, emanating from the triangular gap of a cabinet draped with a heavy cloth. He approaches cautiously, noticing that the ends of the cloth don't quite meet, and through the gap, he glimpses a door. A bird suddenly flies out, settling on a stone shelf, and Harry's gaze shifts to Ginny. She walks toward him, stands close, and they share a long, meaningful look. Her eyes flicker to the book, and she gently takes it from his hand, while he continues to watch her intently. She steps back, and Harry closes his eyes, standing still with shallow breaths, swallowing hard but keeping his eyes shut until Ginny returns, steps close, and kisses him softly on the lips. He responds to the kiss, a smile forming on his lips, and when he opens his eyes, he finds that Ginny has disappeared. Harry walks slowly along a corridor, lost in thought, when Ron approaches, and Professor Slughorn briefly stops in front of them before hurrying away. Back in the common room, Harry uncorks the vial of Liquid Luck, watched closely by Hermione and Ron, and he pours its contents into his mouth. They observe him as he stares into the distance, then rise to their feet as Harry grins and turns to them. As he walks past other students, Hermione and Ron exchange confused glances. Meanwhile, a greenhouse window is forced open, and Slughorn's head appears, peering inside."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry splashes water on his disheveled hair and ashen face, then observes Draco sobbing from the doorway. As Draco casts spells, Harry responds, and they both take cover in the cubicles. They engage in a tense exchange, with Draco missing Harry, who then stands and causes Draco to fall into water from a burst pipe. Harry, holding a book and wand, approaches Draco, shocked to see blood spreading on Draco's shirt. Snape enters, brushes past Harry, and tends to Draco, making the blood recede, while Harry leaves. In the Gryffindor common room, Harry sits with the potions book as Ginny joins him. They stand before a unicorn tapestry, and Ginny leads Harry through the Room of Requirement. They discover a cabinet, and a bird flies out, prompting a meaningful exchange between them. Ginny takes the book from Harry, and after a moment, returns to kiss him gently before disappearing. Harry, lost in thought, encounters Ron and Professor Slughorn in the corridor. Later, in the common room, Harry drinks Liquid Luck as Hermione and Ron watch. He grins at them and, as he passes students, Hermione and Ron appear confused. Meanwhile, Slughorn's head emerges from a forced-open greenhouse window."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry's hair is disheveled as he splashes water on his ashen face, evidence of his recent and harrowing experiences in the mysterious world of magic. Harry watches the sobbing Draco from the doorway, inside Hogwarts School of Witchcraft and Wizardry, as Draco draws his wand, a key tool for casting spells taught at the school, and casts a spell, to which Harry responds, demonstrating their ongoing rivalry. Draco casts another spell, and they hide at each of the cubicles within the vast and echoing bathroom. Draco appears around the corner, peeking from the ornate corridor, and ducks back, while Harry peeks out, his image reflected in a mirror, an enchanted item often found in magical settings. They crawl on the floor, peering underneath the cubicles, engaging in a dangerous game of cat and mouse, and Draco misses Harry, the tension in the air palpable. Harry stands up and aims his wand, causing Draco to stumble back and fall into the water accumulating on the floor from a burst pipe, a common problem in this ancient castle. With a book in one hand, possibly the Half-Blood Prince's potions book with many dark secrets, and his wand in the other, Harry slowly walks the length of the cubicles, rounds the corner, and sees Draco sprawled on his back. Shocked, Harry stumbles forward and sees blood oozing into the water, with bloodstains spreading over Draco's white shirt, a testimony to the serious nature of their confrontation. Snape, the enigmatic Potions Master and head of Slytherin House, strides in, brushes past Harry, and stands over Draco, glaring at Harry, who avoids his gaze and leaves the tension-filled room. Snape kneels, and the blood recedes as the bloodstains disappear, revealing his mastery over healing magic. In the Gryffindor common room, characterized by its warm colors and roaring fireplace, the potions book lies on the table in front of Harry, while Ginny, Hermione, and Ron are silhouetted against the light from a lead-paned window, an architectural feature of the medieval castle. Ginny crosses to Harry and sits beside him, and Harry nods. Standing in front of the unicorn tapestry, a symbol often associated with purity and magic, Harry takes Ginny's outstretched hand and grips it firmly inside the cluttered room. As Ginny leads him forward, they are reflected in a mirror, adding a touch of magic to their moment, and they wander through the Room of Requirement, a mysterious room that appears based on one's needs. A sound comes from the triangular gap of a cabinet covered with a heavy cloth, an item possibly related to the Vanishing Cabinet linked to Borgin and Burkes, and Harry approaches. The ends of the cloth don't quite meet, and through the gap, Harry sees the door. A bird flies out and settles on a stone shelf, a place likely used for potion ingredients, while Harry gazes at Ginny. She walks toward him, stands close, and they exchange a long look. She glances at the book, takes it from his hand, and he continues looking at her. She backs away, and Harry closes his eyes, standing rooted to the spot with shallow breathing. He swallows hard but keeps his eyes shut until Ginny returns, steps close, and kisses him gently on the lips, a moment of tenderness amid their turbulent lives. He responds, smiles, then opens his eyes to find Ginny has disappeared like a fleeting, magical dream. Harry walks slowly along a corridor, lost in thought, the weight of his responsibilities ever-present, when Ron approaches, and Professor Slughorn, known for his connections and fondness for influential students, stops in front of them before hurrying away, likely to another engagement. In the common room, Harry uncorks the vial of Liquid Luck, Felix Felicis, a rare potion that grants the drinker unusually good luck, watched by Hermione and Ron, and empties its contents into his mouth. They look at him as he stares into the distance, buoyed by the confidence the potion provides, and they get to their feet while Harry grins and turns to them. As he passes students, Hermione and Ron look confused. A greenhouse window is forced open, a place abundant with magical plants, and Slughorn's head appears, possibly searching for rare Herbs or Ingredients for his potions class."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Harry's hair is disheveled as he splashes water on his ashen face. Harry watches the sobbing Draco from the doorway as Draco draws his wand and casts a spell to which Harry responds. Draco casts another spell and they hide at each of the cubicles. Draco appears around the corner and ducks back while Harry peeks out his image reflected in a mirror. They crawl on the floor peering underneath the cubicles and Draco misses Harry. Harry stands up and aims his wand causing Draco to stumble back and fall into the water accumulating on the floor from a burst pipe. With a book in one hand and his wand in the other Harry slowly walks the length of the cubicles rounds the corner and sees Draco sprawled on his back. Shocked Harry stumbles forward and sees blood oozing into the water with bloodstains spreading over Draco's white shirt. Snape strides in brushes past Harry and stands over Draco glaring at Harry who avoids his gaze and leaves Snape kneels and the blood recedes as the bloodstains disappear. In the Gryffindor common room the potions book lies on the table in front of Harry while Ginny Hermione and Ron are silhouetted against the light from a leadpaned window. Ginny crosses to Harry and sits beside him and Harry nods. Standing in front of the unicorn tapestry Harry takes Ginny's outstretched hand and grips it firmly inside the cluttered room. As Ginny leads him forward they are reflected in a mirror and they wander through the Room of Requirement. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. A sound comes from the triangular gap of a cabinet covered with a heavy cloth and Harry approaches. The ends of the cloth do not quite meet and through the gap Harry sees the door. A bird flies out and settles on a stone shelf while Harry gazes at Ginny. She walks toward him stands close and they exchange a long look. She glances at the book takes it from his hand and he continues looking at her. She backs away and Harry closes his eyes standing rooted to the spot with shallow breathing. He swallows hard but keeps his eyes shut until Ginny returns steps close and kisses him gently on the lips. He responds smiles then opens his eyes to find Ginny has disappeared. Harry walks slowly along a corridor lost in thought when Ron approaches and Professor Slughorn stops in front of them before hurrying away. In the common room Harry uncorks the vial of Liquid Luck watched by Hermione and Ron and empties its contents into his mouth. They look at him as he stares into the distance and they get to their feet while Harry grins and turns to them. As he passes students Hermione and Ron look confused. A greenhouse window is forced open and Slughorn's head appears."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Harry's hair is disheveled as he splashes water on his ashen face. Harry watches the sobbing Draco from the doorway as Draco draws his wand and casts a spell to which Harry responds. Draco casts another spell and they hide at each of the cubicles. Draco appears around the corner and ducks back while Harry peeks out his image reflected in a mirror. They crawl on the floor peering underneath the cubicles and Draco misses Harry. Harry stands up and aims his wand causing Draco to stumble back and fall into the water accumulating on the floor from a burst pipe. With a book in one hand and his wand in the other Harry slowly walks the length of the cubicles rounds the corner and sees Draco sprawled on his back. Shocked Harry stumbles forward and sees blood oozing into the water with bloodstains spreading over Draco's white shirt. Snape strides in brushes past Harry and stands over Draco glaring at Harry who avoids his gaze and leaves Snape kneels and the blood recedes as the bloodstains disappear. In the Gryffindor common room the potions book lies on the table in front of Harry while Ginny Hermione and Ron are silhouetted against the light from a leadpaned window. Ginny crosses to Harry and sits beside him and Harry nods. Standing in front of the unicorn tapestry Harry takes Ginny's outstretched hand and grips it firmly inside the cluttered room. As Ginny leads him forward they are reflected in a mirror and they wander through the Room of Requirement. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. A sound comes from the triangular gap of a cabinet covered with a heavy cloth and Harry approaches. The ends of the cloth do not quite meet and through the gap Harry sees the door. A bird flies out and settles on a stone shelf while Harry gazes at Ginny. She walks toward him stands close and they exchange a long look. She glances at the book takes it from his hand and he continues looking at her. She backs away and Harry closes his eyes standing rooted to the spot with shallow breathing. He swallows hard but keeps his eyes shut until Ginny returns steps close and kisses him gently on the lips. He responds smiles then opens his eyes to find Ginny has disappeared. Harry walks slowly along a corridor lost in thought when Ron approaches and Professor Slughorn stops in front of them before hurrying away. In the common room Harry uncorks the vial of Liquid Luck watched by Hermione and Ron and empties its contents into his mouth. They look at him as he stares into the distance and they get to their feet while Harry grins and turns to them. As he passes students Hermione and Ron look confused. A greenhouse window is forced open and Slughorn's head appears."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Harry's hair is disheveled as he splashes water on his ashen face. Harry watches the sobbing Draco from the doorway as Draco draws his wand and casts a spell to which Harry responds. Draco casts another spell and they hide at each of the cubicles. Draco appears around the corner and ducks back while Harry peeks out his image reflected in a mirror. They crawl on the floor peering underneath the cubicles and Draco misses Harry. Harry stands up and aims his wand causing Draco to stumble back and fall into the water accumulating on the floor from a burst pipe. With a book in one hand and his wand in the other Harry slowly walks the length of the cubicles rounds the corner and sees Draco sprawled on his back. He responds smiles then opens his eyes to find Ginny has disappeared. Harry walks slowly along a corridor lost in thought when Ron approaches and Professor Slughorn stops in front of them before hurrying away. In the common room Harry uncorks the vial of Liquid Luck watched by Hermione and Ron and empties its contents into his mouth. They look at him as he stares into the distance and they get to their feet while Harry grins and turns to them. As he passes students Hermione and Ron look confused. A greenhouse window is forced open and Slughorn's head appears."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Harry's hair is disheveled as he splashes water on his ashen face. Harry watches the sobbing Draco from the doorway as Draco draws his wand and casts a spell to which Harry responds. Draco casts another spell and they hide at each of the cubicles. They look at him as he stares into the distance and they get to their feet while Harry grins and turns to them. As he passes students Hermione and Ron look confused. A greenhouse window is forced open and Slughorn's head appears."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Oliver's jacket is rumpled as he tosses sand on his bronze shoes. Oliver listens to the laughing Cedric from the balcony as Cedric grabs his hat and plays a tune, to which Oliver dances. Cedric plays another tune, and they sing at each of the closets. Cedric peeks around the pillar and retreats back, while Oliver glances out, his silhouette mirrored in a portrait. They tiptoe across the ceiling, glancing above the closets, and Cedric bypasses Oliver. Oliver jumps up and points his lollipop, causing Cedric to trip forward and land into the vines gathering on the ceiling from a broken window. With a scroll in one foot and his lollipop in the other, Oliver quickly skips the width of the closets, turns the pillar, and notices Cedric lounging on his stomach. Surprised, Oliver leaps backward and observes paint seeping into the vines, with paint blotches scattering over Cedric's black jacket. Fudge strolls in, nudges past Oliver, and stands next to Cedric, squinting at Oliver, who avoids his stare and exits. Fudge bends, and the paint withdraws as the paint blotches vanish. In the Ravenclaw library, the spells notebook rests on the chair in front of Oliver, while Luna, Neville, and Cho are silhouetted against the light from a circular window. Luna strolls to Oliver and crouches beside him, and Oliver grins. Standing before the griffin mural, Oliver takes Luna's extended shoe and clasps it loosely inside the vacant library. As Luna guides him backward, they are reflected in a painting, and they wander outside the Enchanted Forest. A sound emerges from the hollow corner of a puppet covered with a light sheet, and Oliver inspects. The edges of the sheet barely connect, and through the corner, Oliver glimpses the shelf. A butterfly flutters out and perches on a wooden pedestal while Oliver glances at Luna. She wanders toward him, stands nearby, and they share a brief glance. She peers at the scroll, takes it from his foot, and he keeps glancing at her. She moves forward, and Oliver shuts his eyes, standing still with slow breaths. He exhales slowly but keeps his eyes closed until Luna returns, moves nearby, and nudges him gently on the shoulder. He responds, chuckles, then opens his eyes to find Luna has wandered off. Oliver strolls slowly along an atrium deep in thought when Arthur appears, and Professor Binns halts beside them before rushing away. In the library, Oliver unseals the flask of Feathered Fortune, watched by Luna and Arthur, and pours its contents into his hands. They gaze at him as he looks into the void, and they rise to their knees while Oliver beams and turns to them. As he passes teachers, Luna and Arthur look puzzled. A conservatory door is gently closed, and Binns's shoe emerges."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry, looking disheveled, splashes water on his face and watches Draco, who is crying and casting spells. They engage in a spell duel, hiding in cubicles. Harry stands and aims his wand, causing Draco to fall into water from a burst pipe. Shocked by the sight of Draco bleeding, Harry steps back as Snape arrives, healing Draco before glaring at Harry, who leaves. In the Gryffindor common room, Harry sits with Ginny, who leads him into the Room of Requirement. There, they exchange a look before Ginny kisses Harry, then disappears. Lost in thought, Harry encounters Ron and Professor Slughorn in the corridor. Back in the common room, Harry drinks Liquid Luck as Hermione and Ron watch. His demeanor changes, leaving his friends confused as he grins and walks away. A greenhouse window opens, revealing Slughorn peering out."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A greenhouse window is forced open and Slughorn's head appears As he passes students Hermione and Ron look confused  They look at him as he stares into the distance and they get to their feet while Harry grins and turns to them  In the common room Harry uncorks the vial of Liquid Luck watched by Hermione and Ron and empties its contents into his mouth  Harry walks slowly along a corridor lost in thought when Ron approaches and Professor Slughorn stops in front of them before hurrying away  He responds smiles then opens his eyes to find Ginny has disappeared  He swallows hard but keeps his eyes shut until Ginny returns steps close and kisses him gently on the lips  She backs away and Harry closes his eyes standing rooted to the spot with shallow breathing  She glances at the book takes it from his hand and he continues looking at her  She walks toward him stands close and they exchange a long look  A bird flies out and settles on a stone shelf while Harry gazes at Ginny  The ends of the cloth don't quite meet and through the gap Harry sees the door  A sound comes from the triangular gap of a cabinet covered with a heavy cloth and Harry approaches  As Ginny leads him forward they are reflected in a mirror and they wander through the Room of Requirement  Standing in front of the unicorn tapestry Harry takes Ginny's outstretched hand and grips it firmly inside the cluttered room  Ginny crosses to Harry and sits beside him and Harry nods  In the Gryffindor common room the potions book lies on the table in front of Harry while Ginny Hermione and Ron are silhouetted against the light from a leadpaned window  Snape strides in brushes past Harry and stands over Draco glaring at Harry who avoids his gaze and leaves Snape kneels and the blood recedes as the bloodstains disappear  Shocked Harry stumbles forward and sees blood oozing into the water with bloodstains spreading over Draco's white shirt  With a book in one hand and his wand in the other Harry slowly walks the length of the cubicles rounds the corner and sees Draco sprawled on his back  Harry stands up and aims his wand causing Draco to stumble back and fall into the water accumulating on the floor from a burst pipe  They crawl on the floor peering underneath the cubicles and Draco misses Harry  Draco appears around the corner and ducks back while Harry peeks out his image reflected in a mirror  Draco casts another spell and they hide at each of the cubicles  Harry watches the sobbing Draco from the doorway as Draco draws his wand and casts a spell to which Harry responds  Harry's hair is disheveled as he splashes water on his ashen face "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Harry watches the sobbing Draco from the doorway as Draco draws his wand and casts a spell to which Harry responds Harry's hair is disheveled as he splashes water on his ashen face Draco appears around the corner and ducks back while Harry peeks out his image reflected in a mirror Draco casts another spell and they hide at each of the cubicles Harry stands up and aims his wand causing Draco to stumble back and fall into the water accumulating on the floor from a burst pipe They crawl on the floor peering underneath the cubicles and Draco misses Harry Shocked Harry stumbles forward and sees blood oozing into the water with bloodstains spreading over Draco's white shirt With a book in one hand and his wand in the other Harry slowly walks the length of the cubicles rounds the corner and sees Draco sprawled on his back In the Gryffindor common room the potions book lies on the table in front of Harry while Ginny Hermione and Ron are silhouetted against the light from a leadpaned window Snape strides in brushes past Harry and stands over Draco glaring at Harry who avoids his gaze and leaves Snape kneels and the blood recedes as the bloodstains disappear Standing in front of the unicorn tapestry Harry takes Ginny's outstretched hand and grips it firmly inside the cluttered room Ginny crosses to Harry and sits beside him and Harry nods A sound comes from the triangular gap of a cabinet covered with a heavy cloth and Harry approaches As Ginny leads him forward they are reflected in a mirror and they wander through the Room of Requirement A bird flies out and settles on a stone shelf while Harry gazes at Ginny The ends of the cloth do not quite meet and through the gap Harry sees the door She glances at the book takes it from his hand and he continues looking at her She walks toward him stands close and they exchange a long look He swallows hard but keeps his eyes shut until Ginny returns steps close and kisses him gently on the lips She backs away and Harry closes his eyes standing rooted to the spot with shallow breathing Harry walks slowly along a corridor lost in thought when Ron approaches and Professor Slughorn stops in front of them before hurrying away He responds smiles then opens his eyes to find Ginny has disappeared They look at him as he stares into the distance and they get to their feet while Harry grins and turns to them In the common room Harry uncorks the vial of Liquid Luck watched by Hermione and Ron and empties its contents into his mouth A greenhouse window is forced open and Slughorn's head appears As he passes students Hermione and Ron look confused"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A sound comes from the triangular gap of a cabinet covered with a heavy cloth and Harry approaches  The ends of the cloth don't quite meet and through the gap Harry sees the door  A bird flies out and settles on a stone shelf while Harry gazes at Ginny  She walks toward him stands close and they exchange a long look  She glances at the book takes it from his hand and he continues looking at her  She backs away and Harry closes his eyes standing rooted to the spot with shallow breathing  He swallows hard but keeps his eyes shut until Ginny returns steps close and kisses him gently on the lips  He responds smiles then opens his eyes to find Ginny has disappeared  Harry walks slowly along a corridor lost in thought when Ron approaches and Professor Slughorn stops in front of them before hurrying away  In the common room Harry uncorks the vial of Liquid Luck watched by Hermione and Ron and empties its contents into his mouth  They look at him as he stares into the distance and they get to their feet while Harry grins and turns to them  As he passes students Hermione and Ron look confused  A greenhouse window is forced open and Slughorn's head appears Harry's hair is disheveled as he splashes water on his ashen face  Harry watches the sobbing Draco from the doorway as Draco draws his wand and casts a spell to which Harry responds  Draco casts another spell and they hide at each of the cubicles  Draco appears around the corner and ducks back while Harry peeks out his image reflected in a mirror  They crawl on the floor peering underneath the cubicles and Draco misses Harry  Harry stands up and aims his wand causing Draco to stumble back and fall into the water accumulating on the floor from a burst pipe  With a book in one hand and his wand in the other Harry slowly walks the length of the cubicles rounds the corner and sees Draco sprawled on his back  Shocked Harry stumbles forward and sees blood oozing into the water with bloodstains spreading over Draco's white shirt  Snape strides in brushes past Harry and stands over Draco glaring at Harry who avoids his gaze and leaves Snape kneels and the blood recedes as the bloodstains disappear  In the Gryffindor common room the potions book lies on the table in front of Harry while Ginny Hermione and Ron are silhouetted against the light from a leadpaned window  Ginny crosses to Harry and sits beside him and Harry nods  Standing in front of the unicorn tapestry Harry takes Ginny's outstretched hand and grips it firmly inside the cluttered room  As Ginny leads him forward they are reflected in a mirror and they wander through the Room of Requirement "
        }
      ]
    }
  ]
}