{
  "ground_truth": "Holding a small tin and a pair of scissors, he attempts to cut a piece of plant as it waves its vine-like tentacles. Harry walks past and spots him, then approaches and gives Slughorn a fright, after which he walks away. Slughorn glances around furtively as Harry walks up a grassy hillock, with Slughorn lagging a little way behind. Ahead, he sees Hagrid, his dog, and Harry by the corpse of a colossal spider, and Harry demonstrates with his fingers. A bit of spider breaks off, and Slughorn drops it on the ground, then looks up at the giant Hagrid, bows his head, and closes his eyes. In Hagrid's cottage, Harry applauds the tipsy duo, with Hagrid's eyes closed and his head tilting back until it thuds against the high-backed chair, while Harry grins. Slughorn looks across the room at Harry, but his smile fades as Harry gulps and stares at the old man with the scar on his forehead. He stands up, and wide-eyed, Slughorn gazes at the boy standing before him, blinks, and his eyes moisten. Slughorn presses the tip of his wand against his temple, closes his eyes, then pulls the wand away, revealing a wisp of vapor, the memory. His hand shaking, he holds up a small test tube; as he inverts the wand, Harry steadies Slughorn's hand, and the memory drops into the container. In his study, Dumbledore pours it into the pensive, and the memory begins with the hourglass. The teenage Tom Riddle turns away from Slughorn and walks towards the fire, hands behind his back, fiddles with a ring on his finger, and then turns to face Slughorn, who looks into the boy's cold eyes. The memory ends, and Dumbledore holds up a hand to silence Harry. Looking troubled, the professor walks away from the pensive, crosses his study, and sinks down onto a short flight of steps. Dumbledore hurries to his desk, holds it up, and Harry touches the ring, which spins. Images of the teenage Tom, the boy in the orphanage, the pebbles on the window ledge, the postcard of the coast, and Voldemort flash by, and then the ring stops spinning. Harry flexes his neck as Dumbledore moves around the desk and looks closely at him, while Harry breathes deeply. Snape abruptly leaves the astronomy tower, and descending the stairs, he meets Harry, who has overheard his exchange with Dumbledore. Snape stops in front of Harry for a moment, then continues his descent. Harry climbs up to the upper platform, rubs his chin self-consciously, and they walk to the balustrade. Harry nods, hesitates, and places his hand on Dumbledore's arm, and they shoot off the tower as white-tipped waves roll towards a pinnacle rising out of the sea, where Harry and Dumbledore stand on top of it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Grasping a diminutive canister and a pair of shears, he endeavors to sever a fragment of vegetation as it sways its vine-like appendages. Harry strolls past and notices him, then approaches and gives Slughorn a start, after which he strides away. Slughorn peers around slyly as Harry walks up a grassy mound, with Slughorn trailing a little distance behind. Ahead, he perceives Hagrid, his canine, and Harry by the carcass of a colossal arachnid, and Harry indicates with his digits. A portion of arachnid detaches, and Slughorn lets it fall on the earth, then gazes up at the towering Hagrid, inclines his head, and shuts his eyes. In Hagrid's hut, Harry cheers the inebriated pair, with Hagrid's eyes shut and his head tilting back until it strikes against the high-backed chair, while Harry beams. Slughorn gazes across the chamber at Harry, but his grin diminishes as Harry swallows and stares at the aged man with the mark on his brow. He rises, and wide-eyed, Slughorn looks at the youth standing before him, blinks, and his eyes moisten. Slughorn presses the tip of his wand against his forehead, shuts his eyes, then draws the wand away, unveiling a strand of vapor, the recollection. His hand trembling, he raises a small vial; as he reverses the wand, Harry steadies Slughorn's hand, and the recollection falls into the container. In his study, Dumbledore decants it into the pensive, and the recollection begins with the timepiece. The adolescent Tom Riddle turns away from Slughorn and strides towards the hearth, hands behind his back, fiddles with a band on his digit, and then turns to face Slughorn, who gazes into the boy's icy eyes. The recollection concludes, and Dumbledore raises a hand to silence Harry. Appearing troubled, the professor paces away from the pensive, crosses his study, and sinks down onto a short set of steps. Dumbledore hastens to his desk, raises it up, and Harry touches the band, which spins. Images of the adolescent Tom, the youth in the orphanage, the stones on the window ledge, the postcard of the shore, and Voldemort flash by, and then the band ceases spinning. Harry flexes his neck as Dumbledore moves around the desk and looks intently at him, while Harry breathes deeply. Snape abruptly leaves the astronomy tower, and descending the stairs, he encounters Harry, who has overheard his dialogue with Dumbledore. Snape halts in front of Harry for a moment, then continues his descent. Harry ascends to the upper platform, rubs his jaw self-consciously, and they proceed to the railing. Harry nods, hesitates, and places his hand on Dumbledore's arm, and they launch off the tower as white-capped waves roll towards a pinnacle rising out of the sea, where Harry and Dumbledore stand atop it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Holding a small tin and a pair of scissors, a piece of plant is attempted to be cut by him as its vine-like tentacles are waved. As Harry walks past and spots him, Slughorn is approached and frightened by Harry, after which he is walked away from by Harry. Furtive glances are cast around by Slughorn as a grassy hillock is walked up by Harry, with a little way lagged behind by Slughorn. Ahead, Hagrid, his dog, and Harry are seen by him by the corpse of a colossal spider, and a demonstration is done by Harry with his fingers. A bit of spider is broken off, and the ground is dropped on by Slughorn, then the giant Hagrid is looked up at by him, and his head is bowed, and his eyes are closed. In Hagrid's cottage, the tipsy duo is applauded by Harry, with Hagrid's eyes being closed and his head tilting back until the high-backed chair is thudded against, while a grin is shown by Harry. The room is looked across by Slughorn at Harry, but his smile fades as a gulp is done by Harry, and the old man with the scar on his forehead is stared at. He stands up, and the boy standing before him is gazed at wide-eyed by Slughorn, a blink is done, and moistening of his eyes occurs. The tip of his wand is pressed against his temple by Slughorn, his eyes are closed, then the wand is pulled away by him, and a wisp of vapor, the memory, is revealed. Shaking, a small test tube is held up by his hand; as the wand is inverted by him, Slughorn's hand is steadied by Harry, and the memory is dropped into the container. In his study, the pensive is poured into by Dumbledore, and the memory begins with the hourglass. Teenage Tom Riddle turns away from Slughorn, walks towards the fire, with hands behind his back, fiddles with a ring on his finger, and then turns to face Slughorn, who looks into the boy's cold eyes. The memory ends, and a hand is held up by Dumbledore to silence Harry. Troubled looking, the pensive is walked away from by the professor, his study is crossed, and a short flight of steps is sunk down onto. The desk is hurried to by Dumbledore, held up, and the ring, which spins, is touched by Harry. Images of the teenage Tom, the boy in the orphanage, the pebbles on the window ledge, the postcard of the coast, and Voldemort flash by, and then the ring stops spinning. His neck is flexed by Harry as the desk is moved around by Dumbledore and a close look is taken at him, while deep breaths are drawn by Harry. The astronomy tower is abruptly left by Snape, and descending the stairs, Harry is met by him, who has overheard his exchange with Dumbledore. In front of Harry, Snape stops for a moment, then his descent is continued. To the upper platform, Harry climbs, his chin is rubbed self-consciously, and the balustrade is walked to by them. A nod is given by Harry, hesitation occurs, and Dumbledore's arm is placed upon by Harry's hand, and off the tower, they are shot as white-tipped waves roll towards a pinnacle rising out of the sea, where on top of it, Harry and Dumbledore stand."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Holding a small tin and scissors, he tries to cut a plant waving its vine-like tentacles. Harry spots him, approaches, and startles Slughorn before walking away. Slughorn glances around as Harry ascends a grassy hillock, Slughorn following. Ahead, Hagrid, his dog, and Harry stand by a massive spider's corpse, and Harry gestures with his fingers. A bit of spider breaks, Slughorn drops it, then bows his head to Hagrid. In Hagrid's cottage, Harry applauds the tipsy duo, Hagrid’s head thudding back against his chair while Harry smiles. Slughorn's smile fades as he sees Harry’s scar as he gulps and stares. Slughorn blinks, his eyes moisten, and he presses his wand to his temple, extracting a vaporous memory. Shaking, he holds a test tube steady as Harry helps, dropping the memory in. Dumbledore pours it into the pensive; it begins with an hourglass. Teenage Tom Riddle turns from Slughorn, fiddles with a ring, and faces Slughorn, who looks into his cold eyes. The memory ends, and Dumbledore silences Harry. Troubled, Dumbledore moves away, then hurries to his desk, where Harry touches the spinning ring. Images of young Tom, the orphanage, pebbles, a postcard, and Voldemort appear before the ring stops. Harry flexes his neck, Dumbledore looks closely, and Harry breathes deeply. Snape leaves the astronomy tower and meets Harry, who overheard him and Dumbledore. Snape hesitates, then descends. Harry climbs to the upper platform, rubs his chin, and they walk to the balustrade. Harry nods, hesitates, touches Dumbledore's arm, and they shoot off the tower as waves roll towards a sea pinnacle, where they stand."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Holding a tin and scissors, he tries cutting a plant's waving tentacles. Harry spots him, approaches, startling Slughorn, then leaves. Slughorn watches as Harry climbs a hillock, with him following. Ahead, Hagrid, his dog, and Harry stand by a giant spider's corpse, where a piece breaks off, and Slughorn drops it. In Hagrid's cottage, Harry applauds the tipsy duo; Hagrid's head thuds against the chair. Slughorn's smile fades as he gazes at Harry. Wide-eyed, Slughorn blinks, his eyes moisten, and extracts a memory with his wand into a test tube. Dumbledore pours it into the pensive. Teenage Tom Riddle turns from Slughorn, fiddles with a ring, then faces him. The memory ends, and Dumbledore silences Harry, walks away troubled, sinks onto steps, then returns to his desk where Harry spins the ring. Images of Tom and Voldemort flash, the ring stops, and Harry flexes his neck. Snape leaves the astronomy tower, meets Harry, then descends. Harry climbs, rubs his chin, nods, and touches Dumbledore's arm before they shoot off the tower to stand on a sea pinnacle."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Holding in his hands a small tin and a pair of scissors, he carefully attempts to cut off a piece of the lively plant, which is energetically waving its vine-like tentacles in the air. As Harry walks by, he notices the peculiar scene and decides to stop, then approaches. His sudden appearance gives Slughorn a bit of a start, after which Harry continues on his way. Slughorn, now more cautious, glances around furtively while Harry makes his way up a grassy hillock, with Slughorn following a little way behind, lagging slightly. Ahead of them, he spots Hagrid, along with his trusty dog, standing beside Harry near the lifeless body of an enormous spider. Harry uses his fingers to demonstrate something, causing a fragment of the spider to break off. Slughorn lets it drop to the ground, then lifts his gaze to meet the towering figure of Hagrid, bows his head in respect, and closes his eyes momentarily.\n\nLater, within the cozy confines of Hagrid's rustic cottage, Harry applauds the inebriated duo. Hagrid, eyes gently shut and head tilted back, eventually lets it thud softly against the high-backed chair. Harry looks on with a grin. Meanwhile, Slughorn looks across the room at Harry, but his smile gradually fades as he observes Harry gulp and fix his gaze on the older man with the distinctive scar on his forehead. With an air of anticipation, Slughorn stands up, his eyes wide and moist with emotion as he gazes at the young boy standing before him. He blinks, then with determination, presses the tip of his wand against his temple. Closing his eyes, he pulls the wand away, revealing a delicate wisp of vapor, which is the memory. With his hand trembling slightly, he holds up a small test tube; as he inverts the wand, Harry reaches out to steady Slughorn's hand, and gently, the memory drops into the container.\n\nIn his dimly lit study, Dumbledore pours the memory into the pensive, and the recollection begins with the image of an hourglass. The teenage Tom Riddle turns away from Slughorn and, with a deliberate elegance, walks towards the fire. His hands are positioned behind his back, where he fiddles absentmindedly with a ring on his finger. He then turns to face Slughorn, who finds himself looking into the boy's unnervingly cold eyes. As the memory concludes, Dumbledore holds up a hand, effectively silencing Harry's response. The professor looks troubled as he walks away from the pensive, crossing his study before sinking down onto a short flight of steps. With urgency, Dumbledore hurries to his desk, picks up an object, and Harry reaches out to touch the spinning ring. Images flash by swiftly—young Tom at the orphanage, the pebbles on the window ledge, the postcard of the coast, and Voldemort—before the ring ceases its spinning. Harry stretches his neck as Dumbledore moves around the desk to closely observe him, while Harry takes a deep, calming breath.\n\nElsewhere, Snape abruptly leaves the astronomy tower, descending the stairs with determined steps until he encounters Harry, who has unintentionally overheard his conversation with Dumbledore. Snape pauses for a moment in front of Harry, then resumes his descent. Harry makes his way up to the upper platform, rubbing his chin with some self-consciousness. Together, they walk towards the balustrade, where Harry nods, hesitates briefly, and places his hand on Dumbledore's arm. With that, they shoot off the tower as white-tipped waves roll inexorably towards a pinnacle rising sharply out of the sea, where Harry and Dumbledore stand atop it, surveying the scene."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Holding in his hands a small, unassuming tin and a pair of sharp scissors, he diligently attempts to cut off a piece of the lively, verdant plant, which is energetically waving its vine-like tentacles in the open air. As Harry happens to walk by, he observes the peculiar, intriguing scene and makes the decision to stop for a moment; he then approaches with interest. Harry’s sudden appearance gives Slughorn a bit of a startle, causing him to glance over before Harry continues on his way. Slughorn, now significantly more cautious, glances around furtively, keeping a watchful eye while Harry makes his way up the gently sloping grassy hillock, with Slughorn following behind, lagging slightly in the distance. Ahead of them, he notices Hagrid, alongside his loyal, trusty dog, standing beside Harry near the lifeless body of an enormous spider. Harry uses his fingers to demonstrate something, causing a fragment of the spider's exoskeleton to break off. Slughorn allows it to drop to the ground, then lifts his gaze to meet the towering, imposing figure of Hagrid. Slughorn bows his head in respect and then closes his eyes momentarily in contemplation.\n\nLater, within the cozy, warm confines of Hagrid’s rustic, inviting cottage, Harry applauds the inebriated, jovial duo. Hagrid, with his eyes gently shut and his head tilted back, eventually lets it thud softly against the high-backed chair with a gentle impact. Harry looks on with a broad grin, amused by the sight. Meanwhile, Slughorn casts a look across the room at Harry, but his smile gradually fades as he observes Harry gulp and fix his attentive gaze on the older man with that distinctive scar on his forehead. With an air of anticipation and emotion, Slughorn stands up, his wide eyes moist with sentiment as he gazes at the young boy standing before him. He blinks a few times, then, with determination and resolve, presses the tip of his wand against his temple. As he closes his eyes, he carefully pulls the wand away, revealing a delicate, shimmering wisp of vapor, which is the precious memory. With his hand trembling slightly, he holds up a small, transparent test tube; as he inverts the wand, Harry reaches out to steady Slughorn's hand, gently, and the memory gradually drops into the container.\n\nIn his dimly lit and shadowy study, Dumbledore pours the valuable memory into the pensive, and the recollection begins with the image of an elegant hourglass. The teenage Tom Riddle turns away from Slughorn and, with deliberate elegance, walks towards the flickering fire. His hands are positioned behind his back, where he fiddles absentmindedly with a ring on his finger. He then turns to face Slughorn, who finds himself looking into the boy's unnervingly cold, calculating eyes. As the memory reaches its conclusion, Dumbledore holds up a hand, effectively silencing Harry's response before he can utter a word. The professor appears troubled and concerned as he walks away from the pensive, crossing the spacious study before sinking down onto a short flight of steps. With urgency, Dumbledore hurries to his desk, picks up an intriguing object, and Harry reaches out to touch the mesmerizing spinning ring. Images flash by swiftly—young Tom at the orphanage, the pebbles on the window ledge, the postcard of the coast, and Voldemort—before the ring finally ceases its spinning motion. Harry stretches his neck as Dumbledore moves around the desk to closely observe him, while Harry takes a deep, calming breath to steady himself.\n\nElsewhere, within the castle, Snape abruptly leaves the astronomy tower, descending the winding stairs with determined steps until he encounters Harry, who has unintentionally overheard his intense conversation with Dumbledore. Snape pauses momentarily in front of Harry, assessing him, then resumes his determined descent. Harry makes his way up to the upper platform, rubbing his chin with some self-consciousness. Together, they walk towards the sturdy balustrade, where Harry nods, hesitates briefly, and places his hand gently on Dumbledore’s arm. With that, they shoot off the tower as white-tipped waves roll inexorably towards a pinnacle rising sharply out of the sea, where Harry and Dumbledore stand atop it, surveying the vast, sprawling scene before them."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Holding a small tin in one hand and a pair of scissors in the other, he cautiously attempts to cut a piece from a plant, which is actively moving its vine-like tentacles back and forth. As he focuses on the delicate task, Harry walks past, catching sight of him and, with curiosity piqued, approaches, inadvertently causing Slughorn to jump in fright. After regaining his composure, Slughorn watches as Harry continues on his way, casting nervous glances around to ensure no one else observed the encounter. Harry strides up a grassy hillock with Slughorn trailing a short distance behind, keeping pace but with deliberate carefulness. As they crest the rise, Harry sees Hagrid accompanied by his dog, standing solemnly beside the enormous lifeless body of a colossal spider. Harry demonstrates something to Hagrid using his fingers, causing a small segment of the spider to break off, which Slughorn then awkwardly drops onto the ground. Caught in the solemnity of the moment, Slughorn looks up to the towering figure of Hagrid, his head bowing in reverence as his eyes flutter closed for a brief moment. Later, inside Hagrid's cozy cottage, Harry watches the scene unfold as the slightly inebriated duo, Slughorn and Hagrid, engage in revelry, with Hagrid's eyes closed and his head slowly tilting back until it makes a soft thud against his high-backed chair. Harry can't help but grin at the sight. Slughorn's gaze travels across the room to land on Harry, whose expression shifts from amusement to something more serious as he gulps, his attention drawn to the old man bearing a distinctive scar on his forehead. Rising from his seat, Slughorn regards Harry with wide-open eyes, blinking rapidly as his eyes glisten with moisture. In a moment of decision, Slughorn presses the tip of his wand firmly against his temple, his eyes closing as he concentrates, before pulling the wand away to reveal a delicate wisp of vapor—a memory. With an unsteady hand, Slughorn holds up a small test tube, and as he carefully inverts the wand, Harry reaches out to steady his hand, ensuring the memory safely drops into the container. In Dumbledore's study, the headmaster skillfully pours the contents into the pensive, watching as the memory begins, marked by the image of an hourglass. The scene unfolds, showing the teenage Tom Riddle turning away from Slughorn, his movements deliberate as he walks towards the fire, hands clasped behind his back and absentmindedly fiddling with a ring on his finger, before pivoting to face Slughorn, the latter meeting the cold, calculating eyes of the young Tom. The memory concludes, and as if sensing Harry's eagerness, Dumbledore raises a hand to halt any questions, looking deeply troubled. He walks away from the pensive, crosses his study with a somber demeanor, and slowly sinks onto a short flight of steps. Quickly, Dumbledore moves to his desk, lifting something from it with urgency, while Harry reaches out to touch the ring, watching as it spins, images flashing rapidly: the teenage Tom, the boy in the orphanage, pebbles neatly arranged on a window ledge, a postcard depicting the rugged coast, and finally the visage of Voldemort materialize and then fade as the ring ceases its rotation. Feeling a need to refocus, Harry stretches his neck as Dumbledore, now circumnavigating the desk, scrutinizes him closely, observing as Harry takes a deep breath in an effort to steady himself. Meanwhile, Snape abruptly exits the astronomy tower, his footsteps echoing down the stairs, and upon reaching the bottom, he encounters Harry, who has been eavesdropping on his discussion with Dumbledore. Snape pauses briefly in front of Harry, their eyes meeting for a moment before he resumes his descent. Left alone, Harry ascends to the upper platform, rubbing his chin self-consciously as he contemplates the unfolding events. They move together to the balustrade, with Harry nodding as if in agreement, pausing to consider his next move, and then, with determination, placing his hand on Dumbledore’s arm. In an instant, they are propelled off the tower, the world around them becoming a blur as they accelerate through the air, white-tipped waves crashing dramatically below, leading them to a pinnacle that rises starkly out of the sea, where they find themselves standing on its summit."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Holding a small tin and scissors, he attempts to cut a piece from a plant with vine-like tentacles. Harry walks by, startling him, and then continues on. Slughorn cautiously follows Harry up a hill to Hagrid, his dog, and a colossal spider's corpse, where Harry gestures and a spider piece breaks off. Slughorn drops it, then bows his head to the towering Hagrid. In Hagrid's cottage, Harry applauds the tipsy duo, with Hagrid's head tilting back to hit his chair, while Harry grins. Slughorn's smile fades as he notices Harry gulp and stare at him with his scar. Slughorn, wide-eyed and emotional, extracts a memory wisp with his wand, steadied by Harry, and deposits it into a small test tube. In his study, Dumbledore pours it into the Pensieve, starting the memory with the hourglass. Teenage Tom Riddle walks to the fire, fiddles with a ring, then faces Slughorn and meets his gaze. As the memory ends, Dumbledore silences Harry, then looks troubled and moves away from the Pensieve. Dumbledore rushes to his desk, picks up a ring Harry touches, which spins, displaying images of Tom, the orphanage, and Voldemort until the ring stops. Harry flexes his neck as Dumbledore examines him, and Harry breathes deeply. Meanwhile, Snape descends the astronomy tower and encounters Harry, who has overheard his conversation with Dumbledore. Snape pauses, then continues down. Harry ascends to the upper platform, rubs his chin, walks to the balustrade with Dumbledore, hesitates, then nods and touches Dumbledore's arm, leading to them shooting off the tower and standing atop a pinnacle in the sea amid rolling waves."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Holding a small tin containing a rare potion ingredient and a pair of scissors crafted from goblin silver, he attempts to cut a piece of plant, a defensive magical species called Devil's Snare, as it waves its vine-like tentacles. Harry, who possesses the famous lightning-shaped scar marking him as the boy who lived, walks past and spots him, then approaches and gives Slughorn, the potions master with a penchant for collecting talented students, a fright, after which he walks away. Slughorn glances around furtively as Harry walks up a grassy hillock, known for its lush wildflowers, with Slughorn lagging a little way behind. Ahead, he sees Hagrid, the half-giant gamekeeper and keeper of keys and grounds at Hogwarts, his loyal boarhound Fang, and Harry by the corpse of a colossal spider, Aragog, a majestic Acromantula that once protected Hagrid. Harry demonstrates with his fingers the exact nature of the task at hand. A bit of spider, which is a valuable potion ingredient particularly in dark potions, breaks off, and Slughorn drops it on the ground, then looks up at the giant Hagrid, bows his head, acknowledging the loss of Aragog, and closes his eyes in respect. In Hagrid's cottage, a cozy, cluttered space filled with various magical creatures' paraphernalia, Harry applauds the tipsy duo, with Hagrid's eyes closed and his head tilting back until it thuds against the high-backed chair, while Harry grins, knowing his plan is working. Slughorn looks across the room at Harry, but his smile fades as Harry gulps and stares at the old man with the scar on his forehead, reminding Slughorn of the dangerous times they live in. He stands up, and wide-eyed, Slughorn gazes at the boy standing before him, blinks, and his eyes moisten, touched by the boy's bravery. Slughorn presses the tip of his wand, made of fir wood with a dragon heartstring core, against his temple, closes his eyes, then pulls the wand away, revealing a shimmering wisp of vapor, the memory. His hand shaking, he holds up a small test tube, essential for storing memories safely; as he inverts the wand, Harry steadies Slughorn's hand, and the memory drops into the container. \n\nIn his study, filled with ancient tomes and mysterious artifacts, Dumbledore pours it into the Pensieve, a device used to view memories, and the memory begins with the hourglass, symbolizing the passage of time. The teenage Tom Riddle, who would later become the dark wizard Voldemort, turns away from Slughorn and walks towards the fire, its crackling flames reflecting his manipulative nature, hands behind his back, fiddles with a ring on his finger, which is later revealed to be a Horcrux, and then turns to face Slughorn, who looks into the boy's cold eyes that conceal his malevolent intentions. The memory ends, and Dumbledore holds up a hand to silence Harry, forewarning him of the weight of the knowledge. Looking troubled, the professor walks away from the Pensieve, crosses his study with a heavy heart, and sinks down onto a short flight of steps, contemplating the gravity of the situation. Dumbledore hurries to his desk, holds it up, and Harry touches the ring, which is known to carry a curse, causing it to spin. Images of the teenage Tom, the boy in the orphanage who grew up abandoned, the pebbles on the window ledge hinting at his magical abilities, the postcard of the coast representing his longing for escape, and Voldemort flash by, and then the ring stops spinning, signifying the completion of a dark destiny. Harry flexes his neck, feeling the weight of his responsibilities, as Dumbledore moves around the desk and looks closely at him, gauging his readiness for the challenges ahead, while Harry breathes deeply, steadying himself. Snape, the enigmatic potions master who harbors his own secrets, abruptly leaves the astronomy tower, a place often used for stargazing and contemplation, and descending the stairs, he meets Harry, who has overheard his terse exchange with Dumbledore. Snape stops in front of Harry for a moment, his face unreadable, then continues his descent, leaving Harry with more questions than answers. Harry climbs up to the upper platform, a vantage point offering sweeping views of the Hogwarts grounds, rubs his chin self-consciously, aware of the mounting pressure, and they walk to the balustrade, a stone rail that encircles the tower. Harry nods, hesitates, and places his hand on Dumbledore's arm, signaling their readiness for the mission, and they shoot off the tower as white-tipped waves roll towards a pinnacle rising out of the sea, where Harry and Dumbledore stand on top of it, prepared to face whatever lies ahead."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Slughorn glances around furtively as Harry walks up a grassy hillock with Slughorn lagging a little way behind Holding a small tin and a pair of scissors he attempts to cut a piece of plant as it waves its vinelike tentacles He stands up and wideeyed Harry walks past and spots him then approaches and gives Slughorn a fright after which he walks away the boy in the orphanage Slughorn glances around furtively as Harry walks up a grassy hillock with Slughorn lagging a little way behind Ahead he sees Hagrid his dog and Harry by the corpse of a colossal spider and Harry demonstrates with his fingers A bit of spider breaks off and Slughorn drops it on the ground then looks up at the giant Ahead he sees Hagrid his dog and Harry by the corpse of a colossal spider and Harry demonstrates with his fingers Holding a small tin and a pair of scissors he attempts to cut a piece of plant as it waves its vinelike tentacles Harry steadies Slughorn's hand and the memory drops into the container Hagrid bows his head and closes his eyes In Hagrid's cottage Harry applauds the tipsy duo with Hagrid's eyes closed and his head tilting back until it thuds against the highbacked chair while Harry grins Slughorn looks across the room at Harry but his smile fades as Harry gulps and stares at the old man with the scar on his forehead Slughorn looks across the room at Harry but his smile fades as Harry gulps and stares at the old man with the scar on his forehead He stands up and wideeyed A bit of spider breaks off and Slughorn drops it on the ground then looks up at the giant Slughorn gazes at the boy standing before him blinks and his eyes moisten Slughorn presses the tip of his wand against his temple closes his eyes then pulls the wand away revealing a wisp of vapor Looking troubled the professor walks away from the pensive crosses his study and sinks down onto a short flight of steps the memory In his study Dumbledore pours it into the pensive and the memory begins with the hourglass His hand shaking he holds up a small test tube as he inverts the wand Snape abruptly leaves the astronomy tower and descending the stairs he meets Harry who has overheard his exchange with Dumbledore Harry steadies Slughorn's hand and the memory drops into the container In his study Dumbledore pours it into the pensive and the memory begins with the hourglass The teenage Tom Riddle turns away from Slughorn and walks towards the fire hands behind his back fiddles with a ring on his finger and then turns to face Slughorn who looks into the boy's cold eyes The memory ends and Dumbledore holds up a hand to silence Harry Snape stops in front of Harry for a moment then continues his descent Looking troubled the professor walks away from the pensive crosses his study and sinks down onto a short flight of steps Dumbledore hurries to his desk holds it up and Harry touches the ring which spins Images of the teenage Tom the pebbles on the window ledge the postcard of the coast and Voldemort flash by and then the ring stops spinning Harry climbs up to the upper platform rubs his chin selfconsciously and they walk to the balustrade the boy in the orphanage the pebbles on the window ledge the postcard of the coast and Voldemort flash by and then the ring stops spinning Harry flexes his neck as Dumbledore moves around the desk and looks closely at him while Harry breathes deeply Snape abruptly leaves the astronomy tower and descending the stairs he meets Harry who has overheard his exchange with Dumbledore Snape stops in front of Harry for a moment then continues his descent Harry climbs up to the upper platform rubs his chin selfconsciously and they walk to the balustrade Harry nods hesitates and places his hand on Dumbledore's arm and they shoot off the tower as whitetipped waves roll towards a pinnacle rising out of the sea where Harry and Dumbledore stand on top of it"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Holding a small tin and a pair of scissors he attempts to cut a piece of plant as it waves its vinelike tentacles. Harry walks past and spots him then approaches and gives Slughorn a fright after which he walks away. Slughorn glances around furtively as Harry walks up a grassy hillock with Slughorn lagging a little way behind. Ahead he sees Hagrid his dog and Harry by the corpse of a colossal spider and Harry demonstrates with his fingers. A bit of spider breaks off and Slughorn drops it on the ground then looks up at the giant. Hagrid bows his head and closes his eyes. In Hagrid's cottage Harry applauds the tipsy duo with Hagrid's eyes closed and his head tilting back until it thuds against the highbacked chair while Harry grins. Slughorn looks across the room at Harry but his smile fades as Harry gulps and stares at the old man with the scar on his forehead. He stands up and wideeyed. Slughorn gazes at the boy standing before him blinks and his eyes moisten. Slughorn presses the tip of his wand against his temple closes his eyes then pulls the wand away revealing a wisp of vapor. the memory. His hand shaking he holds up a small test tube as he inverts the wand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Harry steadies Slughorn's hand and the memory drops into the container. In his study Dumbledore pours it into the pensive and the memory begins with the hourglass. The teenage Tom Riddle turns away from Slughorn and walks towards the fire hands behind his back fiddles with a ring on his finger and then turns to face Slughorn who looks into the boy's cold eyes. The memory ends and Dumbledore holds up a hand to silence Harry. Looking troubled the professor walks away from the pensive crosses his study and sinks down onto a short flight of steps. Dumbledore hurries to his desk holds it up and Harry touches the ring which spins. Images of the teenage Tom. the boy in the orphanage. the pebbles on the window ledge the postcard of the coast and Voldemort flash by and then the ring stops spinning. Harry flexes his neck as Dumbledore moves around the desk and looks closely at him while Harry breathes deeply. Snape abruptly leaves the astronomy tower and descending the stairs he meets Harry who has overheard his exchange with Dumbledore. Snape stops in front of Harry for a moment then continues his descent. Harry climbs up to the upper platform rubs his chin selfconsciously and they walk to the balustrade. Harry nods hesitates and places his hand on Dumbledore's arm and they shoot off the tower as whitetipped waves roll towards a pinnacle rising out of the sea where Harry and Dumbledore stand on top of it."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Holding a small tin and a pair of scissors he attempts to cut a piece of plant as it waves its vinelike tentacles. Harry walks past and spots him then approaches and gives Slughorn a fright after which he walks away. Slughorn glances around furtively as Harry walks up a grassy hillock with Slughorn lagging a little way behind. Ahead he sees Hagrid his dog and Harry by the corpse of a colossal spider and Harry demonstrates with his fingers. A bit of spider breaks off and Slughorn drops it on the ground then looks up at the giant. Hagrid bows his head and closes his eyes. In Hagrid's cottage Harry applauds the tipsy duo with Hagrid's eyes closed and his head tilting back until it thuds against the highbacked chair while Harry grins. Slughorn looks across the room at Harry but his smile fades as Harry gulps and stares at the old man with the scar on his forehead. He stands up and wideeyed. Slughorn gazes at the boy standing before him blinks and his eyes moisten. Slughorn presses the tip of his wand against his temple closes his eyes then pulls the wand away revealing a wisp of vapor. the memory. His hand shaking he holds up a small test tube as he inverts the wand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Harry steadies Slughorn's hand and the memory drops into the container. In his study Dumbledore pours it into the pensive and the memory begins with the hourglass. The teenage Tom Riddle turns away from Slughorn and walks towards the fire hands behind his back fiddles with a ring on his finger and then turns to face Slughorn who looks into the boy's cold eyes. The memory ends and Dumbledore holds up a hand to silence Harry. Looking troubled the professor walks away from the pensive crosses his study and sinks down onto a short flight of steps. Dumbledore hurries to his desk holds it up and Harry touches the ring which spins. Images of the teenage Tom. the boy in the orphanage. the pebbles on the window ledge the postcard of the coast and Voldemort flash by and then the ring stops spinning. Harry flexes his neck as Dumbledore moves around the desk and looks closely at him while Harry breathes deeply. Snape abruptly leaves the astronomy tower and descending the stairs he meets Harry who has overheard his exchange with Dumbledore. Snape stops in front of Harry for a moment then continues his descent. Harry climbs up to the upper platform rubs his chin selfconsciously and they walk to the balustrade. Harry nods hesitates and places his hand on Dumbledore's arm and they shoot off the tower as whitetipped waves roll towards a pinnacle rising out of the sea where Harry and Dumbledore stand on top of it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Holding a small tin and a pair of scissors he attempts to cut a piece of plant as it waves its vinelike tentacles. Harry walks past and spots him then approaches and gives Slughorn a fright after which he walks away. Slughorn glances around furtively as Harry walks up a grassy hillock with Slughorn lagging a little way behind. Ahead he sees Hagrid his dog and Harry by the corpse of a colossal spider and Harry demonstrates with his fingers. A bit of spider breaks off and Slughorn drops it on the ground then looks up at the giant. Hagrid bows his head and closes his eyes. In Hagrid's cottage Harry applauds the tipsy duo with Hagrid's eyes closed and his head tilting back until it thuds against the highbacked chair while Harry grins. the boy in the orphanage. the pebbles on the window ledge the postcard of the coast and Voldemort flash by and then the ring stops spinning. Harry flexes his neck as Dumbledore moves around the desk and looks closely at him while Harry breathes deeply. Snape abruptly leaves the astronomy tower and descending the stairs he meets Harry who has overheard his exchange with Dumbledore. Snape stops in front of Harry for a moment then continues his descent. Harry climbs up to the upper platform rubs his chin selfconsciously and they walk to the balustrade. Harry nods hesitates and places his hand on Dumbledore's arm and they shoot off the tower as whitetipped waves roll towards a pinnacle rising out of the sea where Harry and Dumbledore stand on top of it."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Holding a small tin and a pair of scissors he attempts to cut a piece of plant as it waves its vinelike tentacles. Harry walks past and spots him then approaches and gives Slughorn a fright after which he walks away. Slughorn glances around furtively as Harry walks up a grassy hillock with Slughorn lagging a little way behind. Snape stops in front of Harry for a moment then continues his descent. Harry climbs up to the upper platform rubs his chin selfconsciously and they walk to the balustrade. Harry nods hesitates and places his hand on Dumbledore's arm and they shoot off the tower as whitetipped waves roll towards a pinnacle rising out of the sea where Harry and Dumbledore stand on top of it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Holding a small tin and a pair of scissors, the squirrel attempts to cut a piece of plant as it waves its vine-like tentacles. The rabbit walks past and spots the squirrel, then approaches and gives the owl a fright, after which the rabbit walks away. The owl glances around furtively as the rabbit walks up a grassy hillock, with the owl lagging a little way behind. Ahead, the rabbit sees the bear, his dog, and the rabbit by the corpse of a colossal spider, and the rabbit demonstrates with his fingers. A bit of spider breaks off, and the owl drops it on the ground, then looks up at the giant bear, bows his head, and closes his eyes. In the bear's cottage, the rabbit applauds the tipsy duo, with the bear's eyes closed and his head tilting back until it thuds against the high-backed chair, while the rabbit grins. The owl looks across the room at the rabbit, but his smile fades as the rabbit gulps and stares at the old man with the scar on his forehead. The rabbit stands up, and wide-eyed, the owl gazes at the boy standing before him, blinks, and his eyes moisten. The owl presses the tip of his wand against his temple, closes his eyes, then pulls the wand away, revealing a wisp of vapor, the memory. His hand shaking, he holds up a small test tube; as he inverts the wand, the rabbit steadies the owl's hand, and the memory drops into the container. In his study, the penguin pours it into the pensive, and the memory begins with the hourglass. The teenage giraffe turns away from the owl and walks towards the fire, hands behind his back, fiddles with a ring on his finger, and then turns to face the owl, who looks into the giraffe's cold eyes. The memory ends, and the penguin holds up a hand to silence the rabbit. Looking troubled, the porcupine walks away from the pensive, crosses his study, and sinks down onto a short flight of steps. The penguin hurries to his desk, holds it up, and the rabbit touches the ring, which spins. Images of the teenage giraffe, the boy in the orphanage, the pebbles on the window ledge, the postcard of the coast, and the fox flash by, and then the ring stops spinning. The rabbit flexes his neck as the penguin moves around the desk and looks closely at the rabbit, while the rabbit breathes deeply. The hawk abruptly leaves the astronomy tower, and descending the stairs, he meets the rabbit, who has overheard his exchange with the penguin. The hawk stops in front of the rabbit for a moment, then continues his descent. The rabbit climbs up to the upper platform, rubs his chin self-consciously, and they walk to the balustrade. The rabbit nods, hesitates, and places his hand on the penguin's arm, and they shoot off the tower as white-tipped waves roll towards a pinnacle rising out of the sea, where the rabbit and the penguin stand on top of it."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Holding a small basket and a pair of tweezers, he attempts to cut a piece of fabric as it waves its ribbon-like strands. Harry walks past and spots him, then approaches and gives Slughorn a fright, after which he walks away. Slughorn glances around furtively as Harry walks up a sandy dune, with Slughorn lagging a little way behind. Ahead, he sees Hagrid, his cat, and Harry by the corpse of a colossal beetle, and Harry demonstrates with his fingers. A bit of shell breaks off, and Slughorn drops it on the ground, then looks up at the towering Hagrid, bows his head, and closes his eyes. In Hagrid's barn, Harry applauds the tipsy duo, with Hagrid's eyes closed and his head tilting back until it thuds against the wooden bench, while Harry grins. Slughorn looks across the room at Harry, but his smile fades as Harry gulps and stares at the old man with the feather on his hat. He stands up, and wide-eyed, Slughorn gazes at the boy standing before him, blinks, and his eyes moisten. Slughorn presses the tip of his spoon against his temple, closes his eyes, then pulls the spoon away, revealing a wisp of smoke, the recollection. His hand shaking, he holds up a small vial; as he inverts the spoon, Harry steadies Slughorn's hand, and the recollection drops into the container. In his study, Dumbledore pours it into the basin, and the recollection begins with the sundial. The teenage Tom Riddle turns away from Slughorn and walks towards the lamp, hands behind his back, fiddles with a button on his cuff, and then turns to face Slughorn, who looks into the boy's cold eyes. The recollection ends, and Dumbledore holds up a hand to silence Harry. Looking troubled, the professor walks away from the basin, crosses his study, and sinks down onto a short flight of cushions. Dumbledore hurries to his cabinet, holds it up, and Harry touches the button, which spins. Images of the teenage Tom, the boy in the library, the marbles on the windowsill, the sketch of the mountains, and Voldemort flash by, and then the button stops spinning. Harry flexes his shoulders as Dumbledore moves around the cabinet and looks closely at him, while Harry breathes deeply. Snape abruptly leaves the watchtower, and descending the ladder, he meets Harry, who has overheard his exchange with Dumbledore. Snape stops in front of Harry for a moment, then continues his descent. Harry climbs up to the observation deck, rubs his cheek self-consciously, and they walk to the railing. Harry nods, hesitates, and places his hand on Dumbledore's shoulder, and they shoot off the tower as white-crested waves roll towards a spire rising out of the desert, where Harry and Dumbledore stand on top of it."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Holding a small tin and a pair of scissors, he attempts to polish a piece of plant as it sways its vine-like tentacles. Harry skips past and spots him, then approaches and gives Slughorn a jolt, after which he skips away. Slughorn peers around stealthily as Harry ascends a grassy hillock, with Slughorn trailing a little way behind. Ahead, he notices Hagrid, his dog, and Harry by the corpse of a colossal spider, and Harry signals with his fingers. A bit of spider crumbles off, and Slughorn tosses it on the ground, then glances up at the giant Hagrid, nods his head, and squints his eyes. In Hagrid's cottage, Harry claps for the tipsy duo, with Hagrid’s eyes clamped shut and his head drooping back until it bounces against the high-backed chair, while Harry laughs. Slughorn peers across the room at Harry, but his grin vanishes as Harry swallows and peers at the old man with the scar on his forehead. He rises, and wide-eyed, Slughorn peers at the boy standing before him, nods, and his eyes glisten. Slughorn taps the tip of his wand against his temple, clenches his eyes shut, then retracts the wand, revealing a wisp of mist, the memory. His hand trembling, he raises a small test tube; as he tips the wand, Harry braces Slughorn's hand, and the memory drifts into the container. In his study, Dumbledore drizzles it into the pensive, and the memory starts with the hourglass. The teenage Tom Riddle turns away from Slughorn and strolls towards the fire, hands behind his back, fiddles with a ring on his finger, and then pivots to face Slughorn, who gazes into the boy's cold eyes. The memory concludes, and Dumbledore raises a hand to hush Harry. Looking distressed, the professor moves away from the pensive, traverses his study, and settles down onto a short flight of steps. Dumbledore rushes to his desk, hoists it up, and Harry taps the ring, which pivots. Images of the teenage Tom, the boy in the orphanage, the pebbles on the window ledge, the postcard of the coast, and Voldemort flash by, and then the ring ceases spinning. Harry stretches his neck as Dumbledore circles around the desk and inspects him closely, while Harry exhales deeply. Snape suddenly exits the astronomy tower, and descending the stairs, he encounters Harry, who has eavesdropped on his conversation with Dumbledore. Snape halts in front of Harry for a moment, then proceeds with his descent. Harry scales up to the upper platform, massages his chin self-consciously, and they stroll to the balustrade. Harry nods, pauses, and rests his hand on Dumbledore's arm, and they soar off the tower as white-tipped waves surge towards a pinnacle rising out of the sea, where Harry and Dumbledore stand on top of it."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Carrying a large spoon and a set of chopsticks, the mailbox attempts to paint a piece of wall as it flutters its leaf-like wings. The umbrella rolls past and spots the mailbox, then approaches and gives the toaster a fright, after which it wheels away. The toaster glances around furtively as the umbrella rolls up a rocky mound, with the toaster trailing a little way behind. Ahead, it sees the bookshelf, its cat, and the umbrella by the statue of a miniature elephant, and the umbrella demonstrates with its elbows. A bit of elephant breaks off, and the toaster drops it on the table, then looks up at the tiny bookshelf, nods its head, and blinks its eyes. In the bookshelf's garage, the umbrella applauds the sleepy pair, with the bookshelf's eyes shut and its nose dipping back until it clinks against the low-backed stool, while the umbrella grins. The toaster looks across the floor at the umbrella, but its smile fades as the umbrella gulps and stares at the young tree with the knot on its trunk. It stands up, and wide-eyed, the toaster gazes at the bird standing before it, blinks, and its eyes moisten. The toaster presses the edge of its fork against its ankle, closes its eyes, then pulls the fork away, revealing a wisp of smoke, the sound. Its leg trembling, it holds up a large bucket; as it tips the fork, the umbrella steadies the toaster's leg, and the sound spills into the bottle. In its workshop, the canoe pours it into the basin, and the sound begins with the clock. The teenage fish turns away from the toaster and swims toward the pond, fins behind its back, fiddles with a rock on its fin, and then turns to face the toaster, which looks into the fish's warm eyes. The sound ends, and the canoe holds up a leg to silence the umbrella. Looking weary, the teacher swims away from the basin, crosses its workshop, and collapses onto a tall pile of sand. The canoe rushes to its shelf, holds it up, and the umbrella touches the rock, which rotates. Pictures of the teenage fish, the bird in the nest, the twigs on the ground, the map of the city, and the penguin flash by, and then the rock stops rotating. The umbrella flexes its arm as the canoe circles the shelf and gazes closely at it, while the umbrella exhales deeply. The dolphin abruptly leaves the lighthouse, and floating down the ladder, it meets the umbrella, which has overheard its conversation with the canoe. The dolphin pauses in front of the umbrella for a moment, then continues its descent. The umbrella climbs up to the upper walkway, rubs its forehead self-consciously, and they stroll to the railing. The umbrella nods, hesitates, and places its fin on the canoe's shoulder, and they fly off the lighthouse as white-tipped clouds drift towards a tower rising out of the sky, where the umbrella and canoe stand on top of it."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Holding a small hat and a piece of paper, the squirrel struggles to peel a slice of fruit as it twirls its antenna-like feelers. Neville skips past and notices the squirrel, then retreats and gives Filch a scare, after which he skips away. Filch scans the area suspiciously as Neville climbs a rocky slope, with Filch trailing a little way behind. Ahead, Neville observes Madam Pomfrey, her cat, and Neville beside the shell of an enormous beetle, and Neville points with his toes. A fragment of beetle detaches, and Filch places it on the ground, then peers up at the towering Madam Pomfrey, ducks his head, and squints his eyes. In Madam Pomfrey's office, Neville applauds the dizzy duo, with Madam Pomfrey's eyes squinting and her head drooping back until it bumps against the cushioned couch, while Neville chuckles. Filch peers across the room at Neville, but his grin vanishes as Neville sips and glances at the old woman with the scarf on her neck. She sits down, and wide-eyed, Filch peers at the girl seated before him, yawns, and his eyes mist over. Filch taps the end of his broom against his cheek, squints his eyes, then drags the broom away, revealing a puff of smoke, the recollection. His hand trembling, he brandishes a small goblet; as he rotates the broom, Neville steadies Filch's hand, and the recollection slips into the vessel. In her classroom, McGonagall empties it into the cauldron, and the recollection starts with the sundial. The teenage Draco Malfoy turns away from Filch and strides toward the window, arms crossed, fiddles with a button on his coat, and then pivots to confront Filch, who gazes into the girl's frozen gaze. The recollection concludes, and McGonagall raises a hand to quiet Neville. Looking perplexed, the headmistress strolls away from the cauldron, paces her classroom, and collapses onto a short set of benches. McGonagall rushes to her cabinet, pulls it out, and Neville brushes the button, which rotates. Scenes of the teenage Draco, the girl in the dormitory, the shells on the beach, the postcard of the forest, and Bellatrix flash by, and then the button ceases rotating. Neville rotates his shoulders as McGonagall circles the cabinet and scrutinizes him, while Neville exhales deeply. Lupin suddenly exits the library tower, and descending the ladder, he encounters Neville, who has eavesdropped on his conversation with McGonagall. Lupin halts in front of Neville for an instant, then proceeds with his descent. Neville ascends to the higher deck, scratches his ear awkwardly, and they stroll to the parapet. Neville nods, pauses, and places his foot on McGonagall's shoulder, and they glide off the tower as white-capped waves surge towards a cliff rising out of the lake, where Neville and McGonagall stand on top of it."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Holding a small balloon and a pair of chopsticks, he attempts to poke a piece of glass as it flutters its feather-like appendages. Harry skips past and notices him, then approaches and startles Slughorn, after which he hurries away. Slughorn peers around nervously as Harry runs up a sandy dune, with Slughorn trailing a short distance behind. Ahead, he spots Hagrid, his cat, and Harry beside the shell of a massive turtle, and Harry gestures with his toes. A bit of turtle shell snaps off, and Slughorn tosses it in the air, then gazes up at the towering Hagrid, bows his shoulder, and rubs his forehead. In Hagrid's cabin, Harry claps for the cheerful pair, with Hagrid's forehead leaning back until it bumps against the low ceiling, while Harry smirks. Slughorn glances across the room at Harry, but his smile vanishes as Harry swallows and glares at the old man with the mark on his chin. He gets up, and wide-eyed, Slughorn stares at the youth standing before him, blinks, and his eyes dampen. Slughorn taps the tip of his pen against his cheek, closes his eyes, then pulls the pen away, revealing a ribbon of mist, the thought. His hand trembling, he holds up a small flask; as he tilts the pen, Harry steadies Slughorn's grip, and the thought drifts into the vessel. In his library, Dumbledore pours it into the birdbath, and the thought begins with the sundial. The youthful Tom Riddle turns away from Slughorn and strides towards the lantern, hands behind his head, fiddles with a bracelet on his wrist, and then turns to face Slughorn, who gazes into the boy's icy gaze. The thought ceases, and Dumbledore raises a finger to silence Harry. Looking worried, the professor strolls away from the birdbath, crosses his library, and settles down onto a short row of cushions. Dumbledore rushes to his bookshelf, holds it up, and Harry touches the bracelet, which twirls. Visions of the youthful Tom, the lad in the shelter, the marbles on the window sill, the painting of the mountains, and Voldemort flash by, and then the bracelet halts twirling. Harry stretches his back as Dumbledore moves around the bookshelf and examines him closely, while Harry exhales slowly. Snape abruptly exits the garden tower, and descending the ladder, he encounters Harry, who has overheard his discussion with Dumbledore. Snape halts before Harry for a moment, then continues his descent. Harry ascends to the upper pavilion, scratches his forehead pensively, and they walk to the parapet. Harry nods, pauses, and places his hand on Dumbledore's shoulder, and they glide off the tower as white-crested waves drift towards a spire rising out of the lake, where Harry and Dumbledore stand on its peak."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Carrying a small suitcase and a set of knitting needles, the owl attempts to knit a section of fabric as it flutters its feather-like wings. Fred skips past and notices the owl, then hops closer and gives Molly a surprise, after which he skips away. Molly peers around sneakily as Fred climbs a rocky ridge, with Molly trailing a fair distance behind. Ahead, she spots Gandalf, his goat, and Fred by the husk of a gigantic beetle, and Fred gestures with his antennae. A fragment of beetle falls off, and Molly drops it on the floor, then looks up at the towering Gandalf, nods her head, and hums a tune. In Gandalf's lodge, Fred claps for the merry pair, with Gandalf's eyes closed and his head tilting back until it taps against the wooden bench, while Fred chuckles. Molly gazes across the cabin at Fred, but her chuckle fades as Fred chokes and squints at the young woman with the birthmark on her cheek. She leaps up, and wide-eyed, Molly stares at the girl sitting in front of her, blinks, and her eyes water. Molly presses the end of her pen against her forehead, squints her eyes shut, then pulls the pen away, revealing a stream of ink, the notion. Her hand trembling, she holds up a tiny flask; as she tilts the pen, Fred steadies Molly's hand, and the notion drips into the vial. In her parlor, Merlin empties it into the fountain, and the notion begins with the sundial. The adolescent Jack Sparrow turns away from Molly and strolls toward the candle, hands in his pockets, fiddles with a locket on his necklace, and then turns to face Molly, who gazes into the girl's icy eyes. The notion concludes, and Merlin raises a hand to hush Fred. Looking worried, the wizard strolls away from the fountain, traverses his study, and slumps down onto a short series of rugs. Merlin rushes to her table, lifts it up, and Fred taps the locket, which twirls. Pictures of the adolescent Jack, the girl in the mansion, the stones on the windowsill, the picture of the mountain, and Moriarty blur by, and then the locket ceases twirling. Fred stretches his elbow as Merlin glides around the table and peers closely at him, while Fred inhales slowly. Luna suddenly exits the observation deck, and descending the ladders, she encounters Fred, who has eavesdropped on her dialogue with Merlin. Luna pauses in front of Fred for a second, then proceeds her descent. Fred climbs up to the higher terrace, scratches his nose distractedly, and they stroll to the railing. Fred gestures, pauses, and places his foot on Merlin's ankle, and they soar off the deck as white-capped tides surge toward a spire emerging out of the ocean, where Fred and Merlin stand atop it."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Armed with a tin and scissors, he tries to cut a plant with vine-like tentacles. Harry walks by, startling Slughorn, before continuing on. Slughorn follows to a grassy hillock where he sees Hagrid, his dog, and Harry near a huge spider's corpse. Inside Hagrid's cottage, a tipsy Slughorn is applauded by Harry, whose smile fades as he observes Slughorn. Slughorn retrieves a memory with his wand, placing it into a vial with Harry's help. Dumbledore later pours it into the pensieve, revealing teenage Tom Riddle's interaction with Slughorn. Dumbledore, troubled, leaves the pensieve and shows Harry a spinning ring. As Snape exits the astronomy tower, Harry overhears a conversation with Dumbledore. Harry and Dumbledore ascend to a pinnacle rising from the sea, where they stand together."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Harry nods hesitates and places his hand on Dumbledore's arm and they shoot off the tower as whitetipped waves roll towards a pinnacle rising out of the sea where Harry and Dumbledore stand on top of it Harry climbs up to the upper platform rubs his chin selfconsciously and they walk to the balustrade Snape stops in front of Harry for a moment then continues his descent Snape abruptly leaves the astronomy tower and descending the stairs he meets Harry who has overheard his exchange with Dumbledore Harry flexes his neck as Dumbledore moves around the desk and looks closely at him while Harry breathes deeply the pebbles on the window ledge the postcard of the coast and Voldemort flash by and then the ring stops spinning the boy in the orphanage Images of the teenage Tom Dumbledore hurries to his desk holds it up and Harry touches the ring which spins Looking troubled the professor walks away from the pensive crosses his study and sinks down onto a short flight of steps The memory ends and Dumbledore holds up a hand to silence Harry The teenage Tom Riddle turns away from Slughorn and walks towards the fire hands behind his back fiddles with a ring on his finger and then turns to face Slughorn who looks into the boy's cold eyes In his study Dumbledore pours it into the pensive and the memory begins with the hourglass Harry steadies Slughorn's hand and the memory drops into the container His hand shaking he holds up a small test tube as he inverts the wand the memory Slughorn presses the tip of his wand against his temple closes his eyes then pulls the wand away revealing a wisp of vapor Slughorn gazes at the boy standing before him blinks and his eyes moisten He stands up and wideeyed Slughorn looks across the room at Harry but his smile fades as Harry gulps and stares at the old man with the scar on his forehead In Hagrid's cottage Harry applauds the tipsy duo with Hagrid's eyes closed and his head tilting back until it thuds against the highbacked chair while Harry grins Hagrid bows his head and closes his eyes A bit of spider breaks off and Slughorn drops it on the ground then looks up at the giant Ahead he sees Hagrid his dog and Harry by the corpse of a colossal spider and Harry demonstrates with his fingers Slughorn glances around furtively as Harry walks up a grassy hillock with Slughorn lagging a little way behind Harry walks past and spots him then approaches and gives Slughorn a fright after which he walks away Holding a small tin and a pair of scissors he attempts to cut a piece of plant as it waves its vinelike tentacles"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The memory ends and Dumbledore holds up a hand to silence Harry His hand shaking he holds up a small test tube as he inverts the wand Slughorn gazes at the boy standing before him blinks and his eyes moisten Harry nods hesitates and places his hand on Dumbledore's arm and they shoot off the tower as whitetipped waves roll towards a pinnacle rising out of the sea where Harry and Dumbledore stand on top of it Images of the teenage Tom In Hagrid's cottage Harry applauds the tipsy duo with Hagrid's eyes closed and his head tilting back until it thuds against the highbacked chair while Harry grins Hagrid bows his head and closes his eyes Slughorn presses the tip of his wand against his temple closes his eyes then pulls the wand away revealing a wisp of vapor The teenage Tom Riddle turns away from Slughorn and walks towards the fire hands behind his back fiddles with a ring on his finger and then turns to face Slughorn who looks into the boy's cold eyes Harry flexes his neck as Dumbledore moves around the desk and looks closely at him while Harry breathes deeply the memory Dumbledore hurries to his desk holds it up and Harry touches the ring which spins Harry walks past and spots him then approaches and gives Slughorn a fright after which he walks away In his study Dumbledore pours it into the pensive and the memory begins with the hourglass Snape stops in front of Harry for a moment then continues his descent Harry steadies Slughorn's hand and the memory drops into the container Slughorn glances around furtively as Harry walks up a grassy hillock with Slughorn lagging a little way behind Looking troubled the professor walks away from the pensive crosses his study and sinks down onto a short flight of steps Harry climbs up to the upper platform rubs his chin selfconsciously and they walk to the balustrade A bit of spider breaks off and Slughorn drops it on the ground then looks up at the giant the pebbles on the window ledge the postcard of the coast and Voldemort flash by and then the ring stops spinning Slughorn looks across the room at Harry but his smile fades as Harry gulps and stares at the old man with the scar on his forehead He stands up and wideeyed Snape abruptly leaves the astronomy tower and descending the stairs he meets Harry who has overheard his exchange with Dumbledore Holding a small tin and a pair of scissors he attempts to cut a piece of plant as it waves its vinelike tentacles Ahead he sees Hagrid his dog and Harry by the corpse of a colossal spider and Harry demonstrates with his fingers the boy in the orphanage"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "In his study Dumbledore pours it into the pensive and the memory begins with the hourglass The teenage Tom Riddle turns away from Slughorn and walks towards the fire hands behind his back fiddles with a ring on his finger and then turns to face Slughorn who looks into the boy's cold eyes The memory ends and Dumbledore holds up a hand to silence Harry Looking troubled the professor walks away from the pensive crosses his study and sinks down onto a short flight of steps Dumbledore hurries to his desk holds it up and Harry touches the ring which spins Images of the teenage Tom the boy in the orphanage the pebbles on the window ledge the postcard of the coast and Voldemort flash by and then the ring stops spinning Harry flexes his neck as Dumbledore moves around the desk and looks closely at him while Harry breathes deeply Snape abruptly leaves the astronomy tower and descending the stairs he meets Harry who has overheard his exchange with Dumbledore Snape stops in front of Harry for a moment then continues his descent Harry climbs up to the upper platform rubs his chin selfconsciously and they walk to the balustrade Harry nods hesitates and places his hand on Dumbledore's arm and they shoot off the tower as whitetipped waves roll towards a pinnacle rising out of the sea where Harry and Dumbledore stand on top of it Holding a small tin and a pair of scissors he attempts to cut a piece of plant as it waves its vinelike tentacles Harry walks past and spots him then approaches and gives Slughorn a fright after which he walks away Slughorn glances around furtively as Harry walks up a grassy hillock with Slughorn lagging a little way behind Ahead he sees Hagrid his dog and Harry by the corpse of a colossal spider and Harry demonstrates with his fingers A bit of spider breaks off and Slughorn drops it on the ground then looks up at the giant Hagrid bows his head and closes his eyes In Hagrid's cottage Harry applauds the tipsy duo with Hagrid's eyes closed and his head tilting back until it thuds against the highbacked chair while Harry grins Slughorn looks across the room at Harry but his smile fades as Harry gulps and stares at the old man with the scar on his forehead He stands up and wideeyed Slughorn gazes at the boy standing before him blinks and his eyes moisten Slughorn presses the tip of his wand against his temple closes his eyes then pulls the wand away revealing a wisp of vapor the memory His hand shaking he holds up a small test tube as he inverts the wand Harry steadies Slughorn's hand and the memory drops into the container"
        }
      ]
    }
  ]
}