{
  "ground_truth": "Waves crash against the pinnacle and the imposing coastline in front of them, the same craggy cliff as on Tom Riddle's postcard, with dark clouds scattered behind them, spray and spume washed over them. Dumbledore's hair and beard are buffeted by the strong wind, but his eyes are affixed on an inverted v-shaped fissure in the cliff face as Harry and Dumbledore are inside a rocky cavern. Dumbledore sharpens a knife against a rock and pierces his right hand with it. Harry looks at the wound as Dumbledore smears his bloodied hand across the rock face, which starts to crumble, and he steps back beside Harry and they both watch. Using their wands as torches, they enter a previously-hidden tunnel and approach a lake, looking out across the water with their wands reflected in the dark surface. Dumbledore sends a ball of light across the lake; it rises and falls over the surface of the water, then flares up, illuminating a tiny island in the distance. Dumbledore sets a foot on a half-submerged crystalline rock and stretches out his left hand over the water as the lake at his feet bubbles and churns. Something moves amidst the frothing waters, and a length of chain leaps up into Dumbledore's hands. He passes the end of the chain to Harry, who starts to pull on it as they watch the chain lift something out of the water, revealing the carved prow of a small boat rising in front of them. Harry tugs with greater vigor, hauling the boat towards them, and the boat slowly carries them across the still water towards the island. Reaching it, they scramble out onto the translucent rock where a dip in a rock pedestal forms a crystal basin filled with liquid. Dumbledore passes his hand over the shimmering surface, looks up with a start, uses a large shell as a cup, fills it with the liquid, and drinks. His eyes closed, he drains the shell, then opens his eyes and shudders, stepping back from the basin and sitting down with difficulty, covering his ear with his blackened right hand. Harry picks up the shell, steps over to the basin, scoops up more liquid, returns to Dumbledore, and helps him drink, filling the shell again, returning again and again, forcing the liquid into Dumbledore's mouth until the basin is almost empty. Dumbledore, his eyes half closed, presses his lips together, then reluctantly opens his mouth. He opens his mouth, Harry steps back, and Dumbledore raises his head and opens his eyes wide while Harry still holds the empty shell. Dumbledore smacks his lips, and Harry returns to the basin, picking up a locket and chain lying at the bottom, as he raises his wand.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Waves crash against the summit and the formidable coastline in front of them, the same rugged precipice as on Tom Riddle's postcard, with dark clouds scattered behind them, spray and foam washed over them. Dumbledore's hair and beard are buffeted by the strong wind, but his eyes are affixed on an inverted v-shaped crack in the cliff face as Harry and Dumbledore are inside a stony cavern. Dumbledore sharpens a dagger against a stone and pierces his right hand with it. Harry looks at the wound as Dumbledore smears his bloodied hand across the rock face, which starts to crumble, and he steps back beside Harry and they both watch. Using their wands as torches, they enter a previously-hidden tunnel and approach a lake, looking out across the water with their wands reflected in the dark surface. Dumbledore sends a sphere of light across the lake; it rises and falls over the surface of the water, then flares up, illuminating a tiny isle in the distance. Dumbledore sets a foot on a half-submerged crystalline stone and stretches out his left hand over the water as the lake at his feet bubbles and churns. Something moves amidst the frothing waters, and a length of chain leaps up into Dumbledore's hands. He passes the end of the chain to Harry, who starts to pull on it as they watch the chain lift something out of the water, revealing the carved prow of a small vessel rising in front of them. Harry tugs with greater vigor, hauling the boat towards them, and the vessel slowly carries them across the still water towards the isle. Reaching it, they scramble out onto the translucent rock where a dip in a stone pedestal forms a crystal basin filled with liquid. Dumbledore passes his hand over the shimmering surface, looks up with a start, uses a large shell as a cup, fills it with the liquid, and drinks. His eyes closed, he drains the shell, then opens his eyes and shudders, stepping back from the basin and sitting down with difficulty, covering his ear with his blackened right hand. Harry picks up the shell, steps over to the basin, scoops up more liquid, returns to Dumbledore, and helps him drink, filling the shell again, returning again and again, forcing the liquid into Dumbledore's mouth until the basin is almost empty. Dumbledore, his eyes half closed, presses his lips together, then reluctantly opens his mouth. He opens his mouth, Harry steps back, and Dumbledore raises his head and opens his eyes wide while Harry still holds the empty shell. Dumbledore smacks his lips, and Harry returns to the basin, picking up a locket and chain lying at the bottom, as he raises his wand."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The pinnacle and the imposing coastline in front of them are crashed against by waves, the same craggy cliff as on Tom Riddle's postcard, with dark clouds scattered behind them, spray and spume washing over them. The strong wind buffets Dumbledore's hair and beard, but an inverted v-shaped fissure in the cliff face is affixed by his eyes as Harry and Dumbledore are inside a rocky cavern. A knife is sharpened by Dumbledore against a rock, and his right hand is pierced by it. The wound is looked at by Harry as the bloodied hand is smeared by Dumbledore across the rock face, which starts to crumble, and he steps back beside Harry and they both watch. Their wands are used as torches as they enter a previously-hidden tunnel and approach a lake, looking out across the water with their wands reflecting in the dark surface. A ball of light is sent by Dumbledore across the lake; it rises and falls over the surface of the water, then flares up, illuminating a tiny island in the distance. A foot is set by Dumbledore on a half-submerged crystalline rock and his left hand is stretched out over the water as the lake at his feet bubbles and churns. Amidst the frothing waters, something is moved, and a length of chain leaps up into Dumbledore's hands. The end of the chain is passed to Harry, who starts to pull on it as they watch the chain lift something out of the water, revealing the carved prow of a small boat rising in front of them. With greater vigor, Harry tugs, hauling the boat towards them, and they are slowly carried by the boat across the still water towards the island. Reaching it, they scramble out onto the translucent rock where a dip in a rock pedestal forms a crystal basin filled with liquid. Over the shimmering surface, Dumbledore passes his hand, looks up with a start, uses a large shell as a cup, fills it with the liquid, and drinks. His eyes are closed, the shell is drained by him, then his eyes are opened and he shudders, stepping back from the basin and sitting down with difficulty while his ear is covered by his blackened right hand. The shell is picked up by Harry, stepping over to the basin, more liquid is scooped up, he returns to Dumbledore, helping him drink, filling the shell again, returning again and again, forcing the liquid into Dumbledore's mouth until the basin is almost empty. With his eyes half-closed, Dumbledore presses his lips together, then his mouth is reluctantly opened. His mouth is opened, Harry steps back, and Dumbledore's head is raised and his eyes are opened wide while the empty shell is still held by Harry. Dumbledore's lips are smacked, and the basin is returned to by Harry, picking up a locket and chain lying at the bottom, as his wand is raised."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Waves crash against the pinnacle and the imposing coastline, identical to Tom Riddle's postcard, with dark clouds behind them. Dumbledore's hair and beard are buffeted by strong winds, but his eyes focus on an inverted v-shaped fissure in the cliff as he and Harry stand inside a rocky cavern. Dumbledore sharpens a knife, pierces his right hand, and smears blood on the rock face, causing it to crumble. They use their wands as torches to enter a hidden tunnel and approach a lake, their wands reflecting on the dark water. Dumbledore sends a light across the lake, illuminating a distant island. He steps on a half-submerged rock, stretches his hand over the bubbling lake, and a chain leaps into his hands. He passes it to Harry, who pulls, revealing a small boat. They board and cross the water to the island, where a crystal basin filled with liquid awaits. Dumbledore uses a shell to drink from the basin, shudders, and sits down. Harry repeatedly fills the shell, helping Dumbledore drink until the basin is nearly empty. Dumbledore reluctantly opens his mouth, and Harry steps back, holding the empty shell. Dumbledore smacks his lips, and Harry retrieves a locket and chain from the basin, raising his wand."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Waves crash against the pinnacle and coastline, matching Tom Riddle's postcard, with dark clouds behind. Dumbledore's hair and beard are buffeted by strong wind as he focuses on a v-shaped fissure in the cliff. Inside a cavern, he sharpens a knife, pierces his hand, and smears blood on the rock, causing it to crumble. Using wands as torches, Harry and Dumbledore enter a hidden tunnel, approach a lake, and Dumbledore sends a light across the water, revealing a distant island. He steps on a crystalline rock, stretches his hand over the bubbling lake, and a chain leaps into his hands. Harry pulls the chain, revealing a small boat, which they use to reach the island. On the island, a crystal basin filled with liquid awaits. Dumbledore drinks from a shell, shudders, and sits down. Harry helps him drink repeatedly until the basin is nearly empty. Dumbledore reluctantly drinks more, and Harry retrieves a locket and chain from the basin."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The relentless waves crash forcefully against the towering pinnacle and the imposing, rugged coastline that stretches out before them. This is the very same craggy cliff depicted on Tom Riddle's postcard, with ominous dark clouds scattered ominously behind them, while spray and spume are washed over them by the powerful sea. Dumbledore's long hair and flowing beard are buffeted by the strong, gusty wind, yet his eyes remain fixed intently on an inverted v-shaped fissure in the cliff face. Meanwhile, Harry and Dumbledore find themselves inside a rocky cavern. Dumbledore methodically sharpens a knife against a rough rock and then pierces his right hand with it. Harry observes the wound with concern as Dumbledore smears his bloodied hand across the rock face, which begins to crumble away. He steps back to stand beside Harry, and together they watch the transformation. Using their wands as makeshift torches, they venture into a previously-hidden tunnel and approach a vast lake, gazing out across the water with their wands' light reflected in the dark, still surface. Dumbledore sends a glowing ball of light across the lake; it rises and falls over the water's surface, then flares up brightly, illuminating a tiny island in the distance. Dumbledore carefully sets a foot on a half-submerged crystalline rock and stretches out his left hand over the churning water as the lake at his feet bubbles and churns with energy. Something stirs amidst the frothing waters, and a length of chain suddenly leaps up into Dumbledore's waiting hands. He passes the end of the chain to Harry, who begins to pull on it with determination as they watch the chain lift something out of the water, revealing the intricately carved prow of a small boat rising before them. Harry tugs with greater vigor, hauling the boat steadily towards them, and the boat slowly carries them across the still, dark water towards the distant island. Upon reaching it, they scramble out onto the translucent rock where a dip in a rock pedestal forms a crystal basin filled with a mysterious liquid. Dumbledore passes his hand over the shimmering surface, looks up with a start, and then uses a large shell as a makeshift cup, filling it with the liquid and drinking deeply. His eyes closed, he drains the shell completely, then opens his eyes and shudders, stepping back from the basin and sitting down with difficulty, covering his ear with his blackened right hand. Harry picks up the shell, steps over to the basin, scoops up more of the liquid, returns to Dumbledore, and helps him drink, filling the shell again and again, returning repeatedly, forcing the liquid into Dumbledore's mouth until the basin is almost empty. Dumbledore, his eyes half-closed, presses his lips together tightly, then reluctantly opens his mouth. He opens his mouth, Harry steps back, and Dumbledore raises his head and opens his eyes wide while Harry still holds the now-empty shell. Dumbledore smacks his lips, and Harry returns to the basin, picking up a locket and chain lying at the bottom, as he raises his wand."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The relentless, unyielding waves crash with tremendous force against the towering pinnacle and the imposing, rugged coastline that stretches out extensively before them. This striking scene is the very same craggy cliff depicted on Tom Riddle's postcard, with ominous, dark clouds scattered threateningly behind them. Meanwhile, the powerful sea relentlessly washes over them with spray and spume. Dumbledore's long, flowing hair and equally flowing beard are continuously buffeted by the strong, gusty wind, yet his eyes remain unflinchingly fixed intently on an inverted v-shaped fissure in the rugged cliff face. Meanwhile, both Harry and Dumbledore find themselves standing inside a shadowy, rocky cavern. Dumbledore methodically sharpens a knife against the rough surface of a rock and then deliberately uses it to pierce his right hand. Harry observes the wound with deep concern as Dumbledore smears his bloodied hand purposefully across the rock face, which then begins to crumble away before their eyes. He steps back to stand closely beside Harry, and together they watch the remarkable transformation unfold. Utilizing their wands as makeshift torches, they venture cautiously into a previously-hidden tunnel and approach a vast, enigmatic lake, gazing thoughtfully out across the water with their wands' light reflected in the dark, still surface. Dumbledore sends a glowing ball of light gracefully across the lake; it rises and falls over the water's smooth surface, then unexpectedly flares up brightly, illuminating a tiny island seen in the distance. Dumbledore carefully sets a foot on a half-submerged crystalline rock and stretches out his confident left hand over the churning water as the lake at his feet vigorously bubbles and churns with energy. Something stirs amidst the frothing waters, and a length of shiny chain suddenly leaps up into Dumbledore's waiting hands. He duly passes the end of the chain to Harry, who begins to pull on it with determination as they both watch the chain gradually lift something out of the water, revealing the intricately carved prow of a small boat rising gracefully before them. Harry tugs with greater vigor, steadily hauling the boat closer towards them, and the boat slowly but surely carries them across the still, dark water towards the distant island. Upon reaching it, they scramble out onto the translucent rock, where a dip in a rock pedestal forms a crystal basin filled with a mysterious, shimmering liquid. Dumbledore passes his hand over the glistening surface, looks up with a start of realization, and then uses a large shell as a makeshift cup, filling it with the liquid and drinking deeply. His eyes closed, he drains the shell completely, then opens his eyes and shudders, stepping back from the basin and sitting down with difficulty, covering his ear with his blackened right hand. Harry picks up the shell, steps over to the basin, scoops up more of the shimmering liquid, returns to Dumbledore, and helps him drink, filling the shell again and again, returning repeatedly, forcing the liquid into Dumbledore's mouth until the basin is almost nearly empty. Dumbledore, his eyes half-closed, presses his lips together tightly, then reluctantly opens his mouth. When he opens his mouth, Harry steps back, and Dumbledore raises his head and opens his eyes wide while Harry still holds the now-empty shell. Dumbledore smacks his lips, and Harry returns to the basin, picking up a locket and chain lying at the bottom, as he raises his wand triumphantly."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Waves relentlessly crash against the pinnacle and the imposing coastline before them, mirroring the craggy cliff depicted on Tom Riddle's postcard, with dark clouds ominously scattered behind. The spray and spume wash over the scene, while Dumbledore's hair and beard are vigorously buffeted by the strong wind. Despite the tumultuous surroundings, his eyes remain fixed on an inverted v-shaped fissure in the cliff face as he and Harry stand within a rocky cavern. Dumbledore methodically sharpens a knife against a rock, then decisively pierces his right hand with it. Harry observes the wound with concern as Dumbledore deliberately smears his bloodied hand across the rock face, which begins to crumble under the touch. Stepping back beside Harry, they both watch the transformation unfold. With their wands held aloft as torches, they cautiously enter a previously-hidden tunnel, advancing towards a lake and gazing out across the water, their wand light reflecting on the dark surface. Dumbledore conjures a ball of light, sending it skimming across the lake; it rises and falls over the water's surface before flaring up, illuminating a tiny island in the distance. Dumbledore carefully places a foot on a half-submerged crystalline rock, extending his left hand over the water as the lake at his feet begins to bubble and churn. Amidst the frothing waters, something stirs, and a length of chain leaps into Dumbledore's hands. He hands the end of the chain to Harry, who begins to pull on it with determination as they watch the chain lift something from the water, revealing the carved prow of a small boat emerging before them. Harry tugs with increased vigor, hauling the boat towards them, and they board it, allowing the boat to slowly carry them across the still water towards the island. Upon reaching it, they scramble out onto the translucent rock, where a dip in a rock pedestal forms a crystal basin filled with liquid. Dumbledore passes his hand over the shimmering surface, looks up with a start, and uses a large shell as a cup, filling it with the liquid and drinking deeply. With his eyes closed, he drains the shell, then opens his eyes and shudders, stepping back from the basin and sitting down with difficulty, covering his ear with his blackened right hand. Harry picks up the shell, steps over to the basin, scoops up more liquid, returns to Dumbledore, and assists him in drinking, repeatedly filling the shell, returning again and again, and forcing the liquid into Dumbledore's mouth until the basin is nearly empty. Dumbledore, his eyes half-closed, presses his lips together, then reluctantly opens his mouth. As he opens his mouth, Harry steps back, and Dumbledore raises his head, opening his eyes wide while Harry still holds the empty shell. Dumbledore smacks his lips, prompting Harry to return to the basin, where he picks up a locket and chain lying at the bottom, raising his wand as he does so."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Waves crash against the pinnacle and the craggy coastline depicted on Tom Riddle's postcard, with dark clouds looming behind. Amidst the spray and spume, Dumbledore, his hair and beard buffeted by the strong wind, focuses on an inverted v-shaped fissure in the cliff face. Inside a rocky cavern, he sharpens a knife, pierces his right hand, and smears his bloodied hand across the rock face, causing it to crumble. He steps back beside Harry, and together they watch the transformation. Using their wands as torches, they enter a hidden tunnel and approach a lake, observing its dark surface. Dumbledore sends a ball of light across the water, illuminating a distant tiny island. He steps onto a half-submerged crystalline rock, stretches his left hand over the bubbling lake, and a chain leaps into his grasp. Passing the chain to Harry, they pull it to reveal a small boat, which they use to cross the still water to the island. Upon arrival, they scramble onto the translucent rock, where a crystal basin filled with liquid awaits. Dumbledore uses a large shell to drink from the basin, shudders, and sits down with difficulty. Harry repeatedly fills the shell, helping Dumbledore drink until the basin is nearly empty. Dumbledore, reluctantly opening his mouth, eventually smacks his lips as Harry retrieves a locket and chain from the basin, raising his wand."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Waves crash against the pinnacle, a towering rock formation famous among sailors for its treacherous beauty, and the imposing coastline in front of them, the same craggy cliff as on Tom Riddle's postcard, which he sent during a fateful summer vacation, with dark clouds scattered behind them, spray and spume washed over them. Dumbledore's hair and beard are buffeted by the strong wind, which is typical in this coastal region known for its fierce weather, but his eyes are affixed on an inverted v-shaped fissure in the cliff face as Harry and Dumbledore are inside a rocky cavern, once used by smugglers to hide contraband. Dumbledore sharpens a knife against a rock using a technique he learned in his youth, and pierces his right hand with it. Harry looks at the wound as Dumbledore smears his bloodied hand across the rock face, which starts to crumble, revealing an ancient magical mechanism, and he steps back beside Harry and they both watch. Using their wands as torches, they enter a previously-hidden tunnel and approach a lake, said to be enchanted by ancient wizards, looking out across the water with their wands reflected in the dark surface. Dumbledore sends a ball of light across the lake; it rises and falls over the surface of the water, then flares up, illuminating a tiny island in the distance that is rumored to hold powerful secrets. Dumbledore sets a foot on a half-submerged crystalline rock, known to be slippery and treacherous, and stretches out his left hand over the water as the lake at his feet bubbles and churns. Something moves amidst the frothing waters, and a length of chain leaps up into Dumbledore's hands, crafted centuries ago by a master blacksmith. He passes the end of the chain to Harry, who starts to pull on it as they watch the chain lift something out of the water, revealing the carved prow of a small boat designed for stealth and concealment, rising in front of them. Harry tugs with greater vigor, hauling the boat towards them, and the boat slowly carries them across the still water towards the island. Reaching it, they scramble out onto the translucent rock where a dip in a rock pedestal forms a crystal basin, reminiscent of ancient ceremonial altars, filled with liquid. Dumbledore passes his hand over the shimmering surface, looks up with a start, uses a large shell, once used by merfolk for similar rituals, as a cup, fills it with the liquid, and drinks. His eyes closed, he drains the shell, then opens his eyes and shudders, stepping back from the basin and sitting down with difficulty, covering his ear with his blackened right hand, a sign of the potion's powerful effect. Harry picks up the shell, steps over to the basin, scoops up more liquid, returns to Dumbledore, and helps him drink, a task fraught with danger, filling the shell again, returning again and again, forcing the liquid into Dumbledore's mouth until the basin is almost empty. Dumbledore, his eyes half closed, presses his lips together, then reluctantly opens his mouth. He opens his mouth, Harry steps back, and Dumbledore raises his head and opens his eyes wide while Harry still holds the empty shell. Dumbledore smacks his lips, and Harry returns to the basin, picking up a locket and chain lying at the bottom, rumored to be a powerful Horcrux, as he raises his wand."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Waves crash against the pinnacle and the imposing coastline in front of them. the same craggy cliff as on Tom Riddle's postcard with dark clouds scattered behind them. spray and spume washed over them. Dumbledore's hair and beard are buffeted by the strong wind but his eyes are affixed on an inverted vshaped fissure in the cliff face. as Harry and Dumbledore are inside a rocky cavern Dumbledore sharpens a knife against a rock and pierces his right hand with it. Harry looks at the wound as Dumbledore smears his bloodied hand across the rock face which starts to crumble and he steps back beside Harry and they both watch. Using their wands as torches they enter a previouslyhidden tunnel and approach a lake looking out across the water with their wands reflected in the dark surface. Dumbledore sends a ball of light across the lake. it rises and falls over the surface of the water then flares up illuminating a tiny island in the distance. Dumbledore sets a foot on a halfsubmerged crystalline rock and stretches out his left hand over the water as the lake at his feet bubbles and churns. Something moves amidst the frothing waters and a length of chain leaps up into Dumbledore's hands. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. He passes the end of the chain to Harry who starts to pull on it as they watch the chain lift something out of the water revealing the carved prow of a small boat rising in front of them. Harry tugs with greater vigor hauling the boat towards them and the boat slowly carries them across the still water towards the island. Reaching it they scramble out onto the translucent rock where a dip in a rock pedestal forms a crystal basin filled with liquid. Dumbledore passes his hand over the shimmering surface looks up with a start uses a large she will as a cup fills it with the liquid and drinks. His eyes closed he drains the she will then opens his eyes and shudders stepping back from the basin and sitting down with difficulty covering his ear with his blackened right hand. Harry picks up the she will steps over to the basin scoops up. more liquid returns to Dumbledore and helps him drink filling the she will again returning again and again forcing the liquid into Dumbledore's mouth until the basin is almost empty. Dumbledore his eyes half closed presses his lips together then reluctantly opens his mouth. He opens his mouth. Harry steps back and Dumbledore raises his head and opens his eyes wide while Harry still holds the empty she will. Dumbledore smacks his lips and Harry returns to the basin picking up a locket and chain lying at the bottom as he raises his wand."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Waves crash against the pinnacle and the imposing coastline in front of them. the same craggy cliff as on Tom Riddle's postcard with dark clouds scattered behind them. spray and spume washed over them. Dumbledore's hair and beard are buffeted by the strong wind but his eyes are affixed on an inverted vshaped fissure in the cliff face. as Harry and Dumbledore are inside a rocky cavern Dumbledore sharpens a knife against a rock and pierces his right hand with it. Harry looks at the wound as Dumbledore smears his bloodied hand across the rock face which starts to crumble and he steps back beside Harry and they both watch. Using their wands as torches they enter a previouslyhidden tunnel and approach a lake looking out across the water with their wands reflected in the dark surface. Dumbledore sends a ball of light across the lake. it rises and falls over the surface of the water then flares up illuminating a tiny island in the distance. Dumbledore sets a foot on a halfsubmerged crystalline rock and stretches out his left hand over the water as the lake at his feet bubbles and churns. Something moves amidst the frothing waters and a length of chain leaps up into Dumbledore's hands. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. He passes the end of the chain to Harry who starts to pull on it as they watch the chain lift something out of the water revealing the carved prow of a small boat rising in front of them. Harry tugs with greater vigor hauling the boat towards them and the boat slowly carries them across the still water towards the island. Reaching it they scramble out onto the translucent rock where a dip in a rock pedestal forms a crystal basin filled with liquid. Dumbledore passes his hand over the shimmering surface looks up with a start uses a large she will as a cup fills it with the liquid and drinks. His eyes closed he drains the she will then opens his eyes and shudders stepping back from the basin and sitting down with difficulty covering his ear with his blackened right hand. Harry picks up the she will steps over to the basin scoops up. more liquid returns to Dumbledore and helps him drink filling the she will again returning again and again forcing the liquid into Dumbledore's mouth until the basin is almost empty. Dumbledore his eyes half closed presses his lips together then reluctantly opens his mouth. He opens his mouth. Harry steps back and Dumbledore raises his head and opens his eyes wide while Harry still holds the empty she will. Dumbledore smacks his lips and Harry returns to the basin picking up a locket and chain lying at the bottom as he raises his wand."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Waves crash against the pinnacle and the imposing coastline in front of them. the same craggy cliff as on Tom Riddle's postcard with dark clouds scattered behind them. spray and spume washed over them. Dumbledore's hair and beard are buffeted by the strong wind but his eyes are affixed on an inverted vshaped fissure in the cliff face. as Harry and Dumbledore are inside a rocky cavern Dumbledore sharpens a knife against a rock and pierces his right hand with it. Harry looks at the wound as Dumbledore smears his bloodied hand across the rock face which starts to crumble and he steps back beside Harry and they both watch. more liquid returns to Dumbledore and helps him drink filling the she will again returning again and again forcing the liquid into Dumbledore's mouth until the basin is almost empty. Dumbledore his eyes half closed presses his lips together then reluctantly opens his mouth. He opens his mouth. Harry steps back and Dumbledore raises his head and opens his eyes wide while Harry still holds the empty she will. Dumbledore smacks his lips and Harry returns to the basin picking up a locket and chain lying at the bottom as he raises his wand."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Waves crash against the pinnacle and the imposing coastline in front of them. the same craggy cliff as on Tom Riddle's postcard with dark clouds scattered behind them. spray and spume washed over them. Harry steps back and Dumbledore raises his head and opens his eyes wide while Harry still holds the empty she will. Dumbledore smacks his lips and Harry returns to the basin picking up a locket and chain lying at the bottom as he raises his wand."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Clouds billow around the summit and the towering shoreline next to them, the same jagged peak as on Jerry Smith's sketch, with bright stars clustered above them, mist and fog drifted under them. McGonagall's scarf and cloak are stirred by the gentle breeze, but her feet are fixed on a zigzag-shaped gap in the mountain wall as Ron and McGonagall are inside a wooden cabin. McGonagall polishes a spoon against a branch and slices her left finger with it. Ron gazes at the scratch as McGonagall rubs her stained finger along the wooden wall, which starts to dissolve, and she steps forward beside Ron and they both observe. Using their hats as lanterns, they walk through a newly-revealed corridor and reach a pond, gazing out over the liquid with their hats mirrored in the clear surface. McGonagall launches a ball of shadow over the pond; it dips and rises beneath the surface of the liquid, then bursts up, revealing a tiny raft in the distance. McGonagall sets a toe on a half-submerged metallic bar and waves her right leg over the liquid as the pond at her heels fizzes and spins. Something shifts within the bubbling liquid, and a coil of rope jumps into McGonagall's arms. She tosses the start of the rope to Ron, who begins to yank on it as they observe the rope drag something from beneath the liquid, exposing the polished mast of a large raft appearing in front of them. Ron pulls with increased enthusiasm, drawing the raft closer to them, and the raft gradually transports them over the calm liquid towards the raft. Arriving, they clamber off onto the transparent wood where a crevice in a wooden platform creates a glass bowl filled with mist. McGonagall waves her foot above the glimmering mist, glances up suddenly, uses a small bucket as a scoop, fills it with the mist, and gulps. Her eyes shut, she empties the bucket, then opens her eyes and quivers, stepping forward from the bowl and sinking down with ease, covering her toe with her reddened left finger. Ron takes the bucket, strides to the bowl, gathers more mist, returns to McGonagall, and aids her in drinking, filling the bucket once more, returning repeatedly, forcing the mist into McGonagall's mouth until the bowl is nearly full. McGonagall, her eyes half open, presses her tongue together, then reluctantly spreads her mouth. She spreads her mouth, Ron steps forward, and McGonagall lowers her chin and closes her eyes wide while Ron still grips the full bucket. McGonagall snaps her tongue, and Ron moves to the bowl, collecting a bracelet and necklace lying at the top, as he lowers his staff."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Waves crash against the cliff from Tom Riddle's postcard as dark clouds loom. Inside a cavern, Dumbledore sharpens a knife, pierces his hand, and smears blood on a rock face, revealing a hidden tunnel. Using their wands as torches, Harry and Dumbledore reach a lake. Dumbledore sends a light across the water, revealing an island. The lake bubbles, and a chain rises into Dumbledore's hands. Harry pulls the chain, bringing a small boat to the surface. They board it and cross the calm water. On the island, they find a crystal basin filled with liquid. Dumbledore drinks from a shell, shudders, and sits with difficulty. Harry continuously refills the shell, helping Dumbledore drink. Dumbledore reluctantly opens his mouth for more, and Harry retrieves a locket and chain from the basin."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Dumbledore smacks his lips and Harry returns to the basin picking up a locket and chain lying at the bottom as he raises his wand Harry steps back and Dumbledore raises his head and opens his eyes wide while Harry still holds the empty shell  He opens his mouth  Dumbledore his eyes half closed presses his lips together then reluctantly opens his mouth  more liquid returns to Dumbledore and helps him drink filling the shell again returning again and again forcing the liquid into Dumbledore's mouth until the basin is almost empty  Harry picks up the shell steps over to the basin scoops up  His eyes closed he drains the shell then opens his eyes and shudders stepping back from the basin and sitting down with difficulty covering his ear with his blackened right hand  Dumbledore passes his hand over the shimmering surface looks up with a start uses a large shell as a cup fills it with the liquid and drinks  Reaching it they scramble out onto the translucent rock where a dip in a rock pedestal forms a crystal basin filled with liquid  Harry tugs with greater vigor hauling the boat towards them and the boat slowly carries them across the still water towards the island  He passes the end of the chain to Harry who starts to pull on it as they watch the chain lift something out of the water revealing the carved prow of a small boat rising in front of them  Something moves amidst the frothing waters and a length of chain leaps up into Dumbledore's hands  Dumbledore sets a foot on a halfsubmerged crystalline rock and stretches out his left hand over the water as the lake at his feet bubbles and churns  it rises and falls over the surface of the water then flares up illuminating a tiny island in the distance  Dumbledore sends a ball of light across the lake  Using their wands as torches they enter a previouslyhidden tunnel and approach a lake looking out across the water with their wands reflected in the dark surface  Harry looks at the wound as Dumbledore smears his bloodied hand across the rock face which starts to crumble and he steps back beside Harry and they both watch  as Harry and Dumbledore are inside a rocky cavern Dumbledore sharpens a knife against a rock and pierces his right hand with it  Dumbledore's hair and beard are buffeted by the strong wind but his eyes are affixed on an inverted vshaped fissure in the cliff face  spray and spume washed over them  the same craggy cliff as on Tom Riddle's postcard with dark clouds scattered behind them  Waves crash against the pinnacle and the imposing coastline in front of them "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "the same craggy cliff as on Tom Riddle's postcard with dark clouds scattered behind them Waves crash against the pinnacle and the imposing coastline in front of them Dumbledore's hair and beard are buffeted by the strong wind but his eyes are affixed on an inverted vshaped fissure in the cliff face spray and spume washed over them Harry looks at the wound as Dumbledore smears his bloodied hand across the rock face which starts to crumble and he steps back beside Harry and they both watch as Harry and Dumbledore are inside a rocky cavern Dumbledore sharpens a knife against a rock and pierces his right hand with it Dumbledore sends a ball of light across the lake Using their wands as torches they enter a previouslyhidden tunnel and approach a lake looking out across the water with their wands reflected in the dark surface Dumbledore sets a foot on a halfsubmerged crystalline rock and stretches out his left hand over the water as the lake at his feet bubbles and churns it rises and falls over the surface of the water then flares up illuminating a tiny island in the distance He passes the end of the chain to Harry who starts to pull on it as they watch the chain lift something out of the water revealing the carved prow of a small boat rising in front of them Something moves amidst the frothing waters and a length of chain leaps up into Dumbledore's hands Reaching it they scramble out onto the translucent rock where a dip in a rock pedestal forms a crystal basin filled with liquid Harry tugs with greater vigor hauling the boat towards them and the boat slowly carries them across the still water towards the island His eyes closed he drains the she will then opens his eyes and shudders stepping back from the basin and sitting down with difficulty covering his ear with his blackened right hand Dumbledore passes his hand over the shimmering surface looks up with a start uses a large she will as a cup fills it with the liquid and drinks more liquid returns to Dumbledore and helps him drink filling the she will again returning again and again forcing the liquid into Dumbledore's mouth until the basin is almost empty Harry picks up the she will steps over to the basin scoops up He opens his mouth Dumbledore his eyes half closed presses his lips together then reluctantly opens his mouth Dumbledore smacks his lips and Harry returns to the basin picking up a locket and chain lying at the bottom as he raises his wand Harry steps back and Dumbledore raises his head and opens his eyes wide while Harry still holds the empty she will"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He passes the end of the chain to Harry who starts to pull on it as they watch the chain lift something out of the water revealing the carved prow of a small boat rising in front of them  Harry tugs with greater vigor hauling the boat towards them and the boat slowly carries them across the still water towards the island  Reaching it they scramble out onto the translucent rock where a dip in a rock pedestal forms a crystal basin filled with liquid  Dumbledore passes his hand over the shimmering surface looks up with a start uses a large shell as a cup fills it with the liquid and drinks  His eyes closed he drains the shell then opens his eyes and shudders stepping back from the basin and sitting down with difficulty covering his ear with his blackened right hand  Harry picks up the shell steps over to the basin scoops up  more liquid returns to Dumbledore and helps him drink filling the shell again returning again and again forcing the liquid into Dumbledore's mouth until the basin is almost empty  Dumbledore his eyes half closed presses his lips together then reluctantly opens his mouth  He opens his mouth  Harry steps back and Dumbledore raises his head and opens his eyes wide while Harry still holds the empty shell  Dumbledore smacks his lips and Harry returns to the basin picking up a locket and chain lying at the bottom as he raises his wand Waves crash against the pinnacle and the imposing coastline in front of them  the same craggy cliff as on Tom Riddle's postcard with dark clouds scattered behind them  spray and spume washed over them  Dumbledore's hair and beard are buffeted by the strong wind but his eyes are affixed on an inverted vshaped fissure in the cliff face  as Harry and Dumbledore are inside a rocky cavern Dumbledore sharpens a knife against a rock and pierces his right hand with it  Harry looks at the wound as Dumbledore smears his bloodied hand across the rock face which starts to crumble and he steps back beside Harry and they both watch  Using their wands as torches they enter a previouslyhidden tunnel and approach a lake looking out across the water with their wands reflected in the dark surface  Dumbledore sends a ball of light across the lake  it rises and falls over the surface of the water then flares up illuminating a tiny island in the distance  Dumbledore sets a foot on a halfsubmerged crystalline rock and stretches out his left hand over the water as the lake at his feet bubbles and churns  Something moves amidst the frothing waters and a length of chain leaps up into Dumbledore's hands "
        }
      ]
    }
  ]
}