{
  "ground_truth": "Water appears in the basin, and Harry scoops desperately but the shell wouldn't fill. Harry turns and looks at the lake, then crumbles down over the rocks towards the water. Holding onto a rock for support, he reaches down with the shell, and Dumbledore's ball of light sinks under the surface, darkness. Harry wields his wand, and the tip of his wand glows. He clenches his teeth, grips the wand with the hand he's using as support, and leans forward to dip the shell into the lake, filling it to the brim. A bony hand shoots from the water and grabs his arm, and he wrestles free. The water seethes all around the island, and the light brightens, revealing naked emaciated corpses clambering out of the water towards him. He lashes out at them as Dumbledore feebly tries to reach his own wand. Scores of corpses swarm onto the tiny island and attack Harry, and he's dragged underwater. A corpse wraps its arms around Harry from behind, and he grapples with it as they sink deeper and deeper. Above the surface, Harry sees flames, balls of fire streak through the water, and the creature releases Harry, allowing him to surface inside a circle of fire. Dumbledore is on his feet, flourishing his wand around his head, whipping up the fire, and the corpse retreats from the flames. Harry comes back onto the island and helps Dumbledore back to the boat. The flames part, revealing a clear channel of water ahead. Meanwhile, Draco Malfoy lies in bed wide awake, then gets up. The lights in Borgin and Burke's shop go out as Bellatrix leads a group through the courtyard to the room at the rear. She opens the door of the embossed cabinet, while Filch stands guard on the school battlements. Draco marches unnoticed along a corridor as Professor McGonagall leans out of a stone archway, looking out anxiously at the menacing clouds, and Snape looks out into the storm. In the Room of Requirement, Draco pulls the heavy cloth from the cabinet, steps back, and watches as the door handle turns. The cabinet opens, black smoke filters out, and Draco walks quickly away. Bellatrix, Greyback, and two Death Eaters with metal masks emerge from the smoke, and Bellatrix smirks. At the astronomy tower, Harry walks away then stops, looking back at Dumbledore. Harry hides as someone passes on the stairs, and the figure climbs to the upper platform, pointing his wand at Dumbledore. Harry watches from below as Draco pulls back his sleeve to show the Death Eater mark on his arm, and Dumbledore's wand falls. Still hidden, Harry sees Bellatrix, Greyback, and the two Death Eaters race to the upper platform, where Bellatrix faces Dumbledore and Draco still has his wand raised. Snape is behind Harry and enters the upper platform.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Water manifests in the basin, and Harry scoops frantically but the shell wouldn't fill. Harry turns and gazes at the lake, then crumbles down over the rocks towards the water. Gripping onto a rock for support, he reaches down with the shell, and Dumbledore's orb of light sinks beneath the surface, darkness. Harry wields his wand, and the tip of his wand gleams. He clenches his teeth, grips the wand with the hand he's using as support, and leans forward to dip the shell into the lake, filling it to the brim. A skeletal hand darts from the water and seizes his arm, and he struggles free. The water seethes all around the island, and the light brightens, revealing bare gaunt corpses scrambling out of the water towards him. He lashes out at them as Dumbledore feebly tries to reach his own wand. Scores of cadavers swarm onto the tiny island and assault Harry, and he's dragged underwater. A corpse coils its arms around Harry from behind, and he grapples with it as they sink deeper and deeper. Above the surface, Harry notices flames, balls of fire streak through the water, and the creature releases Harry, allowing him to surface inside a circle of fire. Dumbledore is on his feet, flourishing his wand around his head, whipping up the fire, and the corpse retreats from the flames. Harry comes back onto the island and assists Dumbledore back to the boat. The flames part, revealing a clear channel of water ahead. Meanwhile, Draco Malfoy lies in bed wide awake, then rises. The lights in Borgin and Burke's shop extinguish as Bellatrix leads a group through the courtyard to the room at the rear. She opens the door of the embossed cabinet, while Filch stands guard on the school battlements. Draco marches unnoticed along a corridor as Professor McGonagall leans out of a stone archway, looking out anxiously at the threatening clouds, and Snape looks out into the storm. In the Room of Requirement, Draco pulls the heavy cloth from the cabinet, steps back, and watches as the door handle turns. The cabinet opens, black smoke filters out, and Draco walks swiftly away. Bellatrix, Greyback, and two Death Eaters with metal masks emerge from the smoke, and Bellatrix smirks. At the astronomy tower, Harry walks away then halts, looking back at Dumbledore. Harry hides as someone passes on the stairs, and the figure climbs to the upper platform, pointing his wand at Dumbledore. Harry observes from below as Draco pulls back his sleeve to show the Death Eater mark on his arm, and Dumbledore's wand falls. Still hidden, Harry sees Bellatrix, Greyback, and the two Death Eaters race to the upper platform, where Bellatrix confronts Dumbledore and Draco still has his wand raised. Snape is behind Harry and enters the upper platform."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Water is seen in the basin, and desperate scooping is done by Harry, but the shell wouldn't fill. The lake is looked at by Harry, who then crumbles down over the rocks towards the water. A rock is held onto for support by him as the shell is reached down with, and under the surface sinks Dumbledore's ball of light, into darkness. Harry's wand is wielded, causing the tip of the wand to glow. His teeth are clenched, and the wand is gripped with the hand being used as support, leaning forward to dip the shell into the lake, filling it to the brim. A bony hand shoots from the water and grabs his arm, and free wrestling is done by him. All around the island, the water seethes, and the light brightens, revealing naked emaciated corpses clambering out of the water towards him. He lashes out at them, and Dumbledore attempts feebly to reach his own wand. Onto the tiny island swarms scores of corpses and attack Harry, and underwater he is dragged. Around Harry from behind, its arms are wrapped by a corpse, and he grapples with it as they sink deeper and deeper. Above the surface, flames are seen by Harry, and balls of fire streak through the water, causing the creature to release Harry, allowing him to surface inside a circle of fire. Dumbledore is on his feet, and the wand is flourished around his head, whipping up the fire, causing the corpse to retreat from the flames. The island is returned to by Harry, and back to the boat, Dumbledore is helped. The flames part to reveal a clear channel of water ahead. Meanwhile, wide awake lying in bed is Draco Malfoy, then he gets up. Borgin and Burke's shop's lights go out as the courtyard is led through by Bellatrix with a group to the room at the rear. The door of the embossed cabinet is opened by her, while guard is stood by Filch on the school battlements. Unnoticed marching along a corridor is Draco, as Professor McGonagall looks anxiously out of a stone archway at the menacing clouds, and into the storm looks Snape. In the Room of Requirement, the heavy cloth is pulled by Draco from the cabinet, and stepping back, he watches as the door handle turns. The cabinet opens, black smoke filters out, and away Draco walks quickly. Bellatrix, Greyback, and two Death Eaters with metal masks emerge from the smoke, and a smirk is given by Bellatrix. At the astronomy tower, away walks Harry then stops, looking back at Dumbledore. As someone passes on the stairs, hiding is done by Harry, and the figure climbs to the upper platform, a wand pointed at Dumbledore. Below watches Harry as Draco pulls back his sleeve to show the Death Eater mark on his arm, and Dumbledore's wand falls. Still hidden, Bellatrix, Greyback, and the two Death Eaters are seen by Harry racing to the upper platform, where Bellatrix faces Dumbledore, and Draco still has his wand raised. Behind Harry is Snape, who enters the upper platform."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Water fills the basin, but Harry's attempts to scoop it with the shell fail. He turns to the lake, crumbling over rocks, and reaches down with the shell. Dumbledore's light sinks into darkness. Harry's wand tip glows as he leans forward, filling the shell. A bony hand grabs him, and he struggles free. Water seethes, revealing emaciated corpses clambering towards him. He fights them as Dumbledore tries to reach his wand. Corpses swarm the island, dragging Harry underwater. A corpse grips him, but flames above force it to release him. Harry surfaces inside a fire circle. Dumbledore, wielding his wand, drives the corpses back. Harry helps Dumbledore to the boat, and flames reveal a clear water path. Meanwhile, Draco Malfoy, awake in bed, rises. Borgin and Burke's shop lights dim as Bellatrix leads a group to a rear room, opening an embossed cabinet. Filch guards the battlements. Draco moves unnoticed, as McGonagall and Snape watch the storm. In the Room of Requirement, Draco uncovers the cabinet, steps back, and watches black smoke emerge. Bellatrix, Greyback, and masked Death Eaters appear. At the astronomy tower, Harry stops, looking back at Dumbledore. He hides as someone ascends, pointing a wand at Dumbledore. Harry sees Draco reveal his Death Eater mark, and Dumbledore's wand falls. Hidden, Harry watches Bellatrix, Greyback, and Death Eaters confront Dumbledore. Snape enters the upper platform."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Water fills the basin, but Harry's shell won't fill. He turns to the lake, crumbles over rocks, and reaches with the shell as Dumbledore's light sinks into darkness. Harry's wand glows as he fills the shell, but a bony hand grabs him. He breaks free, and corpses emerge. Harry fights them as Dumbledore reaches for his wand. Corpses swarm, dragging Harry underwater. A corpse holds him, but flames appear, freeing Harry. Dumbledore creates fire, repelling the corpses. Harry helps Dumbledore to the boat, and flames reveal a clear path. Meanwhile, Draco wakes, and Bellatrix leads a group through Borgin and Burke's. Draco moves unnoticed, and McGonagall and Snape watch the storm. In the Room of Requirement, Draco opens a cabinet, releasing smoke. Bellatrix, Greyback, and masked Death Eaters emerge. At the astronomy tower, Harry hides as Draco reveals his Death Eater mark. Bellatrix and others confront Dumbledore, and Snape joins them."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Water begins to appear in the basin, and Harry, filled with desperation, scoops at it frantically, but the shell stubbornly refuses to fill. Harry turns his gaze towards the expansive lake, then collapses down over the jagged rocks, making his way towards the water's edge. Clinging onto a rock for support, he reaches down with the shell in hand, and Dumbledore's glowing ball of light slowly sinks beneath the surface, swallowed by the encroaching darkness. Harry brandishes his wand, and the tip of it begins to glow with a bright light. He clenches his teeth tightly, gripping the wand with the hand he uses for support, and leans forward precariously to dip the shell into the lake, filling it to the very brim. Suddenly, a bony hand shoots up from the water and seizes his arm, but he manages to wrestle free from its grasp. The water seethes and churns all around the small island, and the light intensifies, revealing naked, emaciated corpses clambering out of the water, advancing menacingly towards him. He lashes out at them in defense as Dumbledore, weakened, tries feebly to reach for his own wand. Scores of corpses swarm onto the tiny island, launching an attack on Harry, and he is dragged underwater. A corpse wraps its skeletal arms around Harry from behind, and he grapples with it as they sink deeper and deeper into the depths. Above the surface, Harry catches sight of flames, balls of fire streaking through the water, and the creature releases Harry, allowing him to rise to the surface inside a protective circle of fire. Dumbledore is now on his feet, flourishing his wand around his head, whipping up the fire, and the corpses retreat from the intense flames. Harry makes his way back onto the island and assists Dumbledore back to the boat. The flames part, revealing a clear channel of water ahead. Meanwhile, Draco Malfoy lies in bed, wide awake, then gets up. The lights in Borgin and Burke's shop go out as Bellatrix leads a group stealthily through the courtyard to the room at the rear. She opens the door of the intricately embossed cabinet, while Filch stands guard on the school battlements. Draco marches unnoticed along a dimly lit corridor as Professor McGonagall leans out of a stone archway, looking out anxiously at the menacing clouds, and Snape gazes out into the brewing storm. In the Room of Requirement, Draco pulls the heavy cloth from the cabinet, steps back cautiously, and watches as the door handle slowly turns. The cabinet opens, black smoke filters out ominously, and Draco walks quickly away. Bellatrix, Greyback, and two Death Eaters with metal masks emerge from the swirling smoke, and Bellatrix smirks with satisfaction. At the astronomy tower, Harry walks away, then stops abruptly, looking back at Dumbledore. Harry hides as someone passes by on the stairs, and the figure climbs to the upper platform, pointing his wand threateningly at Dumbledore. Harry watches from below as Draco pulls back his sleeve to reveal the ominous Death Eater mark on his arm, and Dumbledore's wand falls helplessly. Still hidden, Harry sees Bellatrix, Greyback, and the two Death Eaters race to the upper platform, where Bellatrix confronts Dumbledore, and Draco still has his wand raised. Snape is behind Harry and enters the upper platform."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Water begins to steadily pool and appear within the basin, but Harry, gripped with a profound sense of desperation, hurriedly scoops at it in a frantic attempt, though the stubborn shell refuses to reach fullness. With a sense of urgency, Harry turns his gaze towards the vast expanse of the lake and then collapses onto the jagged, uneven rocks, making his careful way towards the edge of the water. Desperately clinging onto a steadfast rock for support, he reaches down with the shell firmly in hand, while Dumbledore’s glowing sphere of light slowly disappears, sinking beneath the surface, swallowed by the encroaching darkness beneath the water. With determination, Harry brandishes his wand, and the tip of it begins to emit a steady, bright glow. He clenches his teeth tightly in resolve, gripping the wand with the hand providing support, and leans forward precariously to dip the shell into the lake, managing to fill it right up to the very brim. Abruptly, a skeletal, bony hand shoots up from the murky water and seizes his arm with a firm grip, but he bravely manages to wrestle free from its grasp. The water all around the small rocky island begins to seethe and churn violently, while the light emanating from Harry’s wand intensifies, revealing naked, emaciated corpses as they clamber out of the water, advancing menacingly in his direction. In defense, he lashes out at these horrifying forms as Dumbledore, weakened and frail, tries weakly to reach for his own wand. A multitude of corpses swarm onto the tiny island, launching a coordinated attack on Harry, dragging him under the water's surface. As a corpse wraps its skeletal arms around Harry from behind, he fiercely grapples with it as they both sink deeper and deeper into the watery depths. Above the tumultuous surface, Harry catches sight of flames, fiery balls streaking through the water, and with a forceful release, the creature lets go, allowing Harry to ascend, rising to the surface inside a protective circle of fire. Dumbledore stands now on his feet, skillfully flourishing his wand around his head, whipping up the towering flames, forcing the corpses to retreat from the intense heat. Harry makes his way back onto the island, assisting the weakened Dumbledore back to the awaiting boat. The parting flames reveal a clear channel of water, opening a path ahead. Meanwhile, Draco Malfoy lies wide awake in bed, then quietly rises. In Borgin and Burke's shop, the lights go out as Bellatrix leads a group stealthily through the silent courtyard to the rear room. She opens the door of the intricately embossed cabinet while Filch stands vigilantly on guard upon the school battlements. Draco strides unnoticed down a dimly lit corridor as Professor McGonagall leans out of a stone archway, gazing anxiously at the menacing, swirling clouds, and Snape looks intently into the brewing storm. In the Room of Requirement, Draco cautiously pulls the heavy covering cloth from the cabinet, stepping back with wariness, watching intently as the door handle begins to slowly turn. The cabinet creaks open, ominous black smoke filters out menacingly, and Draco departs quickly. From the swirling, creeping smoke, Bellatrix, Greyback, and two Death Eaters clad in intimidating metal masks emerge, and Bellatrix smirks with clear satisfaction. At the astronomy tower, Harry starts to walk away, then halts abruptly, looking back toward Dumbledore. Harry conceals himself as a figure passes by on the stairs, watching as the person climbs to the upper platform, wielding his wand threateningly at Dumbledore. Hidden below, Harry witnesses Draco pulling back his sleeve to reveal the ominous Death Eater mark emblazoned on his arm, while Dumbledore’s wand slips helplessly from his grasp. Remaining concealed, Harry observes Bellatrix, Greyback, and the two Death Eaters racing to the upper platform where Bellatrix confronts Dumbledore, and Draco maintains his wand raised. Snape, who was behind Harry, steps forward and enters the upper platform."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Water begins to materialize in the basin, and Harry, filled with urgency, attempts to scoop it up, but the shell remains stubbornly empty. Frustrated, Harry turns his gaze towards the lake, his mind racing for a solution, and then he collapses down over the jagged rocks, inching closer to the water's edge. With determination, he clutches a rock for balance, extending his arm with the shell towards the lake. As he does so, Dumbledore's ball of light descends beneath the surface, plunging the surroundings into darkness. In response, Harry brandishes his wand, and the tip illuminates with a soft glow. He grits his teeth, tightening his grip on the wand with the hand that steadies him, and leans forward, carefully submerging the shell into the lake until it fills to the brim. Suddenly, a skeletal hand erupts from the water, seizing his arm, and Harry struggles fiercely to break free. The water churns violently around the island, and the light intensifies, casting a glow that reveals emaciated, naked corpses emerging from the depths, advancing towards him. Harry strikes out at them in defense, while Dumbledore, weakened, attempts to reach for his own wand. A multitude of corpses swarm onto the small island, launching an attack on Harry, and he is pulled beneath the water's surface. As he sinks deeper, a corpse ensnares him from behind, and he grapples with it, fighting for his life. Above the water, Harry catches sight of flames, fiery orbs slicing through the water, and the creature releases its hold, allowing Harry to rise to the surface within a protective circle of fire. Dumbledore stands, wand in hand, skillfully manipulating the flames around him, causing the corpses to retreat from the intense heat. Harry clambers back onto the island, offering his support to Dumbledore as they make their way back to the boat. The flames part, revealing a clear path through the water. Meanwhile, Draco Malfoy lies in bed, unable to sleep, and eventually rises. In Borgin and Burke's shop, the lights extinguish as Bellatrix leads a group through the courtyard to a room at the back. She opens the door of the ornate cabinet, while Filch remains vigilant on the school battlements. Draco strides unnoticed along a corridor, as Professor McGonagall peers out from a stone archway, her eyes scanning the ominous clouds, and Snape gazes into the storm. In the Room of Requirement, Draco removes the heavy cloth from the cabinet, stepping back to observe as the door handle slowly turns. The cabinet opens, releasing a cloud of black smoke, and Draco quickly retreats. From the smoke, Bellatrix, Greyback, and two Death Eaters wearing metal masks emerge, with Bellatrix wearing a smug expression. At the astronomy tower, Harry begins to walk away but halts, glancing back at Dumbledore. He conceals himself as someone ascends the stairs, watching as the figure reaches the upper platform and aims a wand at Dumbledore. Hidden from view, Harry witnesses Draco reveal the Death Eater mark on his arm, causing Dumbledore's wand to slip from his grasp. Still concealed, Harry observes Bellatrix, Greyback, and the two Death Eaters rush to the upper platform, where Bellatrix confronts Dumbledore, and Draco maintains his wand raised. Snape appears behind Harry and proceeds to the upper platform."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Water appears in the basin, and Harry struggles to fill the shell. Realizing the futility, he moves toward the lake, using a rock for support as he dips the shell into the water, filling it. Suddenly, a bony hand grabs him, and he fights it off. The water churns, revealing emaciated corpses emerging toward him. As Harry battles them, Dumbledore attempts to reach his wand. Overwhelmed, Harry is dragged underwater, grappling with a corpse until flames appear above, forcing the creature to release him. Surfacing within a circle of fire, he sees Dumbledore wielding his wand to drive the corpses back. Harry returns to the island and assists Dumbledore to the boat, as the flames create a clear path through the water.\n\nMeanwhile, Draco Malfoy, unable to sleep, rises from bed. In Borgin and Burke's shop, Bellatrix leads a group through the courtyard to a room at the back, opening the cabinet door as Filch stands guard at the school. Draco moves unnoticed through a corridor, while McGonagall and Snape observe the storm. In the Room of Requirement, Draco uncovers the cabinet, watching as it opens and black smoke emerges. He quickly departs as Bellatrix, Greyback, and two masked Death Eaters step out, with Bellatrix smirking.\n\nAt the astronomy tower, Harry pauses, looking back at Dumbledore. He hides as someone ascends the stairs, watching as Draco reveals the Death Eater mark and Dumbledore's wand falls. Concealed, Harry sees Bellatrix, Greyback, and the Death Eaters rush to confront Dumbledore, with Draco's wand still raised. Snape arrives behind Harry and proceeds to the upper platform."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Water appears in the basin, a shallow stone structure used for collecting and holding water, and Harry scoops desperately but the shell wouldn't fill. Harry turns and looks at the lake, likely the vast and mysterious lake near Hogwarts known for its magical creatures, then crumbles down over the rocks towards the water. Holding onto a jagged rock for support, he reaches down with the shell, and Dumbledore's ball of light, a magical illumination conjured to ward off dark forces, sinks under the surface, plunging them into darkness. Harry wields his wand, a common wizarding tool often made of wood and imbued with magical properties, and the tip of his wand glows. He clenches his teeth, grips the wand with the hand he's using as support, and leans forward to dip the shell into the lake, filling it to the brim. A bony hand, likely that of a creature known as an Inferius—reanimated by dark magic—shoots from the water and grabs his arm, and he wrestles free. The water seethes all around the island, a small, rocky outcrop in the lake, and the light brightens, revealing naked emaciated corpses clambering out of the water towards him. He lashes out at them as Dumbledore, weakened from the earlier potion, feebly tries to reach his own wand. Scores of corpses swarm onto the tiny island and attack Harry, and he's dragged underwater. A corpse wraps its arms around Harry from behind, and he grapples with it as they sink deeper and deeper. Above the surface, Harry sees flames, fiery barriers of magical protection, balls of fire streak through the water, and the creature releases Harry, allowing him to surface inside a circle of fire. Dumbledore, known for his exceptional magical prowess, is on his feet, flourishing his wand around his head, whipping up the fire, and the corpse retreats from the flames. Harry comes back onto the island and helps Dumbledore back to the small boat waiting on the island's edge, reminiscent of ancient vessels used to cross mystical waters. The flames part, revealing a clear channel of water ahead. Meanwhile, Draco Malfoy lies in bed wide awake, caught in the turmoil of his conflicting loyalties, then gets up. The lights in Borgin and Burke's shop, a dark and mysterious antique store known for its sinister artifacts, go out as Bellatrix Lestrange leads a group through the courtyard to the room at the rear. She opens the door of the embossed cabinet, a Vanishing Cabinet, while Filch, the caretaker known for his dislike of students, stands guard on the school battlements. Draco marches unnoticed along a corridor as Professor McGonagall, revered for her stern presence and leadership, leans out of a stone archway, looking out anxiously at the menacing clouds, and Snape looks out into the storm, his expression unreadable. In the Room of Requirement, a magical space that transforms to meet the needs of its user, Draco pulls the heavy cloth from the cabinet, steps back, and watches as the door handle turns. The cabinet opens, black smoke, a foreboding harbinger of danger, filters out, and Draco walks quickly away. Bellatrix, a fervent follower of Voldemort, Greyback, a notorious werewolf, and two Death Eaters with metal masks emerge from the smoke, and Bellatrix smirks, triumph in her eyes. At the astronomy tower, a high and secluded area of Hogwarts used for star observation, Harry walks away then stops, looking back at Dumbledore. Harry hides as someone passes on the stairs, and the figure climbs to the upper platform, pointing his wand at Dumbledore. Harry watches from below as Draco pulls back his sleeve to show the Death Eater mark, a dark tattoo symbolizing allegiance to Voldemort, on his arm, and Dumbledore's wand falls, clattering to the floor. Still hidden, Harry sees Bellatrix, Greyback, and the two Death Eaters race to the upper platform, where Bellatrix faces Dumbledore and Draco still has his wand raised. Snape, known for his complex and mysterious motives, is behind Harry and enters the upper platform."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "darkness  Harry wields his wand and the tip of his wand glows  He clenches his teeth grips the wand with the hand he's using as support and leans forward to dip the shell into the lake filling it to the brim  A bony hand shoots from the water and grabs his arm and he wrestles free  The water seethes all around the island and the light brightens revealing naked emaciated corpses clambering out of the water towards him  He lashes out at them as Dumbledore feebly tries to reach his own wand  Scores of corpses swarm onto the tiny island and attack Harry and he's dragged underwater  A corpse wraps its arms around Harry from behind and he grapples with it as they sink deeper and deeper  Above the surface Harry sees flames  balls of fire streak through the water and the creature releases Harry allowing him to surface inside a circle of fire  Dumbledore is on his feet flourishing his wand around his head whipping up the fire and the corpse retreats from the flames  Harry comes back onto the island and helps Dumbledore back to the boat  The flames part revealing a clear channel of water ahead  Meanwhile Draco Malfoy lies in bed wide awake then gets up  The lights in Borgin and Burke's shop go out as Bellatrix leads a group through the courtyard to the room at the rear  Water appears in the basin and Harry scoops desperately but the shell wouldn't fill  Harry turns and looks at the lake then crumbles down over the rocks towards the water  Holding onto a rock for support he reaches down with the shell and Dumbledore's ball of light sinks under the surface  darkness  Harry wields his wand and the tip of his wand glows  He clenches his teeth grips the wand with the hand he's using as support and leans forward to dip the shell into the lake filling it to the brim  A bony hand shoots from the water and grabs his arm and he wrestles free  The water seethes all around the island and the light brightens revealing naked emaciated corpses clambering out of the water towards him  He lashes out at them as Dumbledore feebly tries to reach his own wand  Scores of corpses swarm onto the tiny island and attack Harry and he's dragged underwater  A corpse wraps its arms around Harry from behind and he grapples with it as they sink deeper and deeper  Above the surface Harry sees flames  balls of fire streak through the water and the creature releases Harry allowing him to surface inside a circle of fire  Dumbledore is on his feet flourishing his wand around his head whipping up the fire and the corpse retreats from the flames  Harry comes back onto the island and helps Dumbledore back to the boat  The flames part revealing a clear channel of water ahead  Meanwhile Draco Malfoy lies in bed wide awake then gets up  The lights in Borgin and Burke's shop go out as Bellatrix leads a group through the courtyard to the room at the rear  She opens the door of the embossed cabinet while Filch stands guard on the school battlements  Draco marches unnoticed along a corridor as Professor McGonagall leans out of a stone archway looking out anxiously at the menacing clouds and Snape looks out into the storm  In the Room of Requirement Draco pulls the heavy cloth from the cabinet steps back and watches as the door handle turns  The cabinet opens  black smoke filters out and Draco walks quickly away  Bellatrix Greyback and two Death Eaters with metal masks emerge from the smoke and Bellatrix smirks  At the astronomy tower Harry walks away then stops looking back at Dumbledore  Harry hides as someone passes on the stairs and the figure climbs to the upper platform pointing his wand at Dumbledore  Harry watches from below as Draco pulls back his sleeve to show the Death Eater mark on his arm and Dumbledore's wand falls  Still hidden  Harry sees Bellatrix Greyback and the two Death Eaters race to the upper platform where Bellatrix faces Dumbledore and Draco still has his wand raised  Snape is behind Harry and enters the upper platform"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Water appears in the basin and Harry scoops desperately but the she will would not fill. Harry turns and looks at the lake then crumbles down over the rocks towards the water. Holding onto a rock for support he reaches down with the she will and Dumbledore's ball of light sinks under the surface. darkness. Harry wields his wand and the tip of his wand glows. He clenches his teeth grips the wand with the hand he is using as support and leans forward to dip the she will into the lake filling it to the brim. A bony hand shoots from the water and grabs his arm and he wrestles free. The water seethes all around the island and the light brightens revealing naked emaciated corpses clambering out of the water towards him. He lashes out at them as Dumbledore feebly tries to reach his own wand. Scores of corpses swarm onto the tiny island and attack Harry and he is dragged underwater. A corpse wraps its arms around Harry from behind and he grapples with it as they sink deeper and deeper. Above the surface Harry sees flames. balls of fire streak through the water and the creature releases Harry allowing him to surface inside a circle of fire. Dumbledore is on his feet flourishing his wand around his head whipping up the fire and the corpse retreats from the flames. Harry comes back onto the island and helps Dumbledore back to the boat. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. The flames part revealing a clear channel of water ahead. Meanwhile Draco Malfoy lies in bed wide awake then gets up. The lights in Borgin and Burke's shop go out as Bellatrix leads a group through the courtyard to the room at the rear. She opens the door of the embossed cabinet while Filch stands guard on the school battlements. Draco marches unnoticed along a corridor as Professor McGonagall leans out of a stone archway looking out anxiously at the menacing clouds and Snape looks out into the storm. In the Room of Requirement Draco pulls the heavy cloth from the cabinet steps back and watches as the door handle turns. The cabinet opens. black smoke filters out and Draco walks quickly away. Bellatrix Greyback and two Death Eaters with metal masks emerge from the smoke and Bellatrix smirks. At the astronomy tower. Harry walks away then stops looking back at Dumbledore. Harry hides as someone passes on the stairs and the figure climbs to the upper platform pointing his wand at Dumbledore. Harry watches from below as Draco pulls back his sleeve to show the Death Eater mark on his arm and Dumbledore's wand falls. Still hidden. Harry sees Bellatrix Greyback and the two Death Eaters race to the upper platform where Bellatrix faces Dumbledore and Draco still has his wand raised. Snape is behind Harry and enters the upper platform."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Water appears in the basin and Harry scoops desperately but the she will would not fill. Harry turns and looks at the lake then crumbles down over the rocks towards the water. Holding onto a rock for support he reaches down with the she will and Dumbledore's ball of light sinks under the surface. darkness. Harry wields his wand and the tip of his wand glows. He clenches his teeth grips the wand with the hand he is using as support and leans forward to dip the she will into the lake filling it to the brim. A bony hand shoots from the water and grabs his arm and he wrestles free. The water seethes all around the island and the light brightens revealing naked emaciated corpses clambering out of the water towards him. He lashes out at them as Dumbledore feebly tries to reach his own wand. Scores of corpses swarm onto the tiny island and attack Harry and he is dragged underwater. A corpse wraps its arms around Harry from behind and he grapples with it as they sink deeper and deeper. Above the surface Harry sees flames. balls of fire streak through the water and the creature releases Harry allowing him to surface inside a circle of fire. Dumbledore is on his feet flourishing his wand around his head whipping up the fire and the corpse retreats from the flames. Harry comes back onto the island and helps Dumbledore back to the boat. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. The flames part revealing a clear channel of water ahead. Meanwhile Draco Malfoy lies in bed wide awake then gets up. The lights in Borgin and Burke's shop go out as Bellatrix leads a group through the courtyard to the room at the rear. She opens the door of the embossed cabinet while Filch stands guard on the school battlements. Draco marches unnoticed along a corridor as Professor McGonagall leans out of a stone archway looking out anxiously at the menacing clouds and Snape looks out into the storm. In the Room of Requirement Draco pulls the heavy cloth from the cabinet steps back and watches as the door handle turns. The cabinet opens. black smoke filters out and Draco walks quickly away. Bellatrix Greyback and two Death Eaters with metal masks emerge from the smoke and Bellatrix smirks. At the astronomy tower. Harry walks away then stops looking back at Dumbledore. Harry hides as someone passes on the stairs and the figure climbs to the upper platform pointing his wand at Dumbledore. Harry watches from below as Draco pulls back his sleeve to show the Death Eater mark on his arm and Dumbledore's wand falls. Still hidden. Harry sees Bellatrix Greyback and the two Death Eaters race to the upper platform where Bellatrix faces Dumbledore and Draco still has his wand raised. Snape is behind Harry and enters the upper platform."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Water appears in the basin and Harry scoops desperately but the she will would not fill. Harry turns and looks at the lake then crumbles down over the rocks towards the water. Holding onto a rock for support he reaches down with the she will and Dumbledore's ball of light sinks under the surface. darkness. Harry wields his wand and the tip of his wand glows. He clenches his teeth grips the wand with the hand he is using as support and leans forward to dip the she will into the lake filling it to the brim. A bony hand shoots from the water and grabs his arm and he wrestles free. The water seethes all around the island and the light brightens revealing naked emaciated corpses clambering out of the water towards him. Bellatrix Greyback and two Death Eaters with metal masks emerge from the smoke and Bellatrix smirks. At the astronomy tower. Harry walks away then stops looking back at Dumbledore. Harry hides as someone passes on the stairs and the figure climbs to the upper platform pointing his wand at Dumbledore. Harry watches from below as Draco pulls back his sleeve to show the Death Eater mark on his arm and Dumbledore's wand falls. Still hidden. Harry sees Bellatrix Greyback and the two Death Eaters race to the upper platform where Bellatrix faces Dumbledore and Draco still has his wand raised. Snape is behind Harry and enters the upper platform."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Water appears in the basin and Harry scoops desperately but the she will would not fill. Harry turns and looks at the lake then crumbles down over the rocks towards the water. Holding onto a rock for support he reaches down with the she will and Dumbledore's ball of light sinks under the surface. Harry watches from below as Draco pulls back his sleeve to show the Death Eater mark on his arm and Dumbledore's wand falls. Still hidden. Harry sees Bellatrix Greyback and the two Death Eaters race to the upper platform where Bellatrix faces Dumbledore and Draco still has his wand raised. Snape is behind Harry and enters the upper platform."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Water appears in the basin, and the cat scoops desperately but the shell wouldn't fill. The cat turns and looks at the lake, then crumbles down over the rocks towards the water. Holding onto a rock for support, the cat reaches down with the shell, and the dog's ball of light sinks under the surface, darkness. The cat wields a wand, and the tip of the wand glows. The cat clenches its teeth, grips the wand with the hand it's using as support, and leans forward to dip the shell into the lake, filling it to the brim. A bony hand shoots from the water and grabs the cat's arm, and it wrestles free. The water seethes all around the island, and the light brightens, revealing naked emaciated corpses clambering out of the water towards the cat. The cat lashes out at them as the dog feebly tries to reach its own wand. Scores of corpses swarm onto the tiny island and attack the cat, and it's dragged underwater. A corpse wraps its arms around the cat from behind, and it grapples with it as they sink deeper and deeper. Above the surface, the cat sees flames, balls of fire streak through the water, and the creature releases the cat, allowing it to surface inside a circle of fire. The dog is on its feet, flourishing a wand around its head, whipping up the fire, and the corpse retreats from the flames. The cat comes back onto the island and helps the dog back to the boat. The flames part, revealing a clear channel of water ahead. Meanwhile, the rabbit lies in bed wide awake, then gets up. The lights in Borgin and Burke's shop go out as the owl leads a group through the courtyard to the room at the rear. It opens the door of the embossed cabinet, while the squirrel stands guard on the school battlements. The rabbit marches unnoticed along a corridor as the penguin leans out of a stone archway, looking out anxiously at the menacing clouds, and the fox looks out into the storm. In the Room of Requirement, the rabbit pulls the heavy cloth from the cabinet, steps back, and watches as the door handle turns. The cabinet opens, black smoke filters out, and the rabbit walks quickly away. The owl, the wolf, and two Death Eaters with metal masks emerge from the smoke, and the owl smirks. At the astronomy tower, the cat walks away then stops, looking back at the dog. The cat hides as someone passes on the stairs, and the figure climbs to the upper platform, pointing its wand at the dog. The cat watches from below as the rabbit pulls back its sleeve to show the Death Eater mark on its arm, and the dog's wand falls. Still hidden, the cat sees the owl, the wolf, and the two Death Eaters race to the upper platform, where the owl faces the dog and the rabbit still has its wand raised. The fox is behind the cat and enters the upper platform."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Liquid appears in the sink, and Harry scoops desperately but the cup wouldn't fill. Harry turns and looks at the fountain, then crumbles down over the pebbles towards the fluid. Holding onto a boulder for support, he reaches down with the cup, and Dumbledore's orb of glow sinks under the surface, shadow. Harry wields his staff, and the tip of his staff glows. He clenches his teeth, grips the staff with the hand he's using as support, and leans forward to dip the cup into the fountain, filling it to the brim. A skeletal hand shoots from the fluid and grabs his arm, and he wrestles free. The fluid seethes all around the isle, and the glow brightens, revealing unclothed gaunt figures clambering out of the fluid towards him. He lashes out at them as Dumbledore feebly tries to reach his own staff. Scores of figures swarm onto the tiny isle and attack Harry, and he's dragged underwater. A figure wraps its arms around Harry from behind, and he grapples with it as they sink deeper and deeper. Above the surface, Harry sees flames, orbs of fire streak through the fluid, and the creature releases Harry, allowing him to surface inside a circle of flame. Dumbledore is on his feet, flourishing his staff around his head, whipping up the fire, and the figure retreats from the flames. Harry comes back onto the isle and helps Dumbledore back to the raft. The flames part, revealing a clear channel of fluid ahead. Meanwhile, Draco Malfoy lies in bed wide awake, then gets up. The lights in Borgin and Burke's store go out as Bellatrix leads a group through the courtyard to the space at the back. She opens the door of the embossed wardrobe, while Filch stands guard on the school parapets. Draco marches unnoticed along a hallway as Professor McGonagall leans out of a stone window, looking out anxiously at the ominous clouds, and Snape looks out into the tempest. In the Room of Requirement, Draco pulls the heavy drape from the wardrobe, steps back, and watches as the door handle turns. The wardrobe opens, black mist filters out, and Draco walks quickly away. Bellatrix, Greyback, and two Death Eaters with metal masks emerge from the mist, and Bellatrix smirks. At the observation tower, Harry walks away then stops, looking back at Dumbledore. Harry hides as someone passes on the stairs, and the figure climbs to the upper platform, pointing his staff at Dumbledore. Harry watches from below as Draco pulls back his sleeve to show the Death Eater mark on his arm, and Dumbledore's staff falls. Still hidden, Harry sees Bellatrix, Greyback, and the two Death Eaters race to the upper platform, where Bellatrix faces Dumbledore and Draco still has his staff raised. Snape is behind Harry and enters the upper platform."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Water vanishes from the basin, and Harry flings his hands desperately but the shell remains empty. Harry turns and gazes at the lake, then stumbles down over the rocks towards the water. Clinging to a rock for balance, he extends the shell, and Dumbledore's ball of light rises above the surface, brightness. Harry brandishes his wand, and the tip of his wand flickers. He gnashes his teeth, grips the wand with the hand he's using for balance, and leans backward to scoop the shell into the lake, emptying it completely. A bony hand emerges from the water and tugs his leg, and he slips free. The water froths all around the island, and the light dims, revealing naked emaciated corpses retreating into the water from him. He strikes out at them as Dumbledore feebly tries to lower his own wand. Scores of corpses drift onto the tiny island and evade Harry, and he's pulled above the water. A corpse releases its arms from Harry from behind, and he pushes against it as they float higher and higher. Above the surface, Harry senses shadows, balls of mist swirl through the water, and the creature grips Harry, restricting him to submerge outside a circle of shadows. Dumbledore is on his knees, waving his wand above his head, dissipating the mist, and the corpse advances towards the shadows. Harry moves back onto the island and aids Dumbledore back to the boat. The shadows merge, revealing an obscured path of water ahead. Meanwhile, Draco Malfoy sits in bed wide asleep, then lies down. The lights in Borgin and Burke's shop illuminate as Bellatrix guides a group through the courtyard to the room at the rear. She closes the door of the embossed cabinet, while Filch remains oblivious on the school battlements. Draco strolls unnoticed along a corridor as Professor McGonagall ducks into a stone archway, peering out curiously at the serene clouds, and Snape looks inwards into the calm. In the Room of Requirement, Draco drapes the heavy cloth over the cabinet, steps forward, and observes as the door handle remains still. The cabinet closes, white smoke wafts in, and Draco ambles slowly away. Bellatrix, Greyback, and two Death Eaters with leather masks dissolve into the smoke, and Bellatrix frowns. At the astronomy tower, Harry strolls forward then pauses, gazing back at Dumbledore. Harry reveals himself as someone lingers on the stairs, and the figure descends to the lower platform, lowering his wand from Dumbledore. Harry observes from above as Draco covers his sleeve to conceal the Death Eater mark on his arm, and Dumbledore's wand rises. Still concealed, Harry sees Bellatrix, Greyback, and the two Death Eaters drift to the lower platform, where Bellatrix approaches Dumbledore and Draco still has his wand lowered. Snape is ahead of Harry and exits the lower platform."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Juice appears in the sink, and Oliver scoops desperately but the bucket wouldn't fill. Oliver turns and looks at the pond, then crumbles down over the pebbles towards the juice. Holding onto a tree for support, he reaches down with the bucket, and Hermione's sphere of glow sinks under the surface, shadow. Oliver wields his broom, and the tip of his broom glows. He clenches his teeth, grips the broom with the branch he's using as support, and leans forward to dip the bucket into the pond, filling it to the brim. A skeletal shoe shoots from the juice and grabs his sleeve, and he wrestles free. The juice churns all around the peninsula, and the glow brightens, revealing naked emaciated wolves clambering out of the juice towards him. He lashes out at them as Hermione feebly tries to reach her own broom. Scores of wolves swarm onto the tiny peninsula and attack Oliver, and he's dragged underwater. A wolf wraps its paws around Oliver from behind, and he grapples with it as they sink deeper and deeper. Above the surface, Oliver sees sparks, orbs of flame streak through the juice, and the creature releases Oliver, allowing him to surface inside a ring of sparks. Hermione is on her feet, flourishing her broom around her head, whipping up the sparks, and the wolf retreats from the flames. Oliver comes back onto the peninsula and helps Hermione back to the raft. The sparks part, revealing a clear channel of juice ahead. Meanwhile, Luna Lovegood lies on the sofa wide awake, then gets up. The lamps in Weasleys' Wizard Wheezes shop go out as Narcissa leads a troop through the ballroom to the closet at the rear. She opens the lid of the embossed vase, while Filch stands guard on the school turrets. Luna marches unnoticed along a corridor as Professor Sprout leans out of a wooden doorway, looking out anxiously at the swirling fog, and Lupin looks out into the blizzard. In the Chamber of Secrets, Luna pulls the heavy veil from the vase, steps back, and watches as the knob wobbles. The vase opens, black fog filters out, and Luna walks quickly away. Narcissa, Greyback, and two Goblins with metal hats emerge from the fog, and Narcissa grins. At the library tower, Oliver walks away then stops, looking back at Hermione. Oliver hides as someone passes on the ladder, and the shadow climbs to the upper deck, pointing its broom at Hermione. Oliver watches from below as Luna pulls back her cloak to show the Goblin mark on her arm, and Hermione's broom falls. Still hidden, Oliver sees Narcissa, Greyback, and the two Goblins race to the upper deck, where Narcissa faces Hermione and Luna still has her broom raised. Lupin is behind Oliver and enters the upper deck."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Water emerges in the basin, and Ron gazes hesitantly but the shell wouldn't tilt. Ron spins and glares at the lake, then tumbles down over the rocks towards the water. Clinging onto a rock for balance, he stretches down with the shell, and McGonagall's spark of light drifts under the surface, shadows. Ron brandishes his baton, and the tip of his baton flickers. He grinds his teeth, clutches the baton with the hand he's holding for balance, and lunges forward to immerse the shell into the lake, filling it to the brim. A skeletal paw darts from the water and clutches his arm, and he writhes free. The water bubbles all around the island, and the light illuminates, revealing bare gaunt apparitions scrambling out of the water towards him. He strikes out at them as McGonagall weakly attempts to grab her own baton. Crowds of apparitions swarm onto the tiny island and charge at Ron, and he's pulled underwater. A specter coils its arms around Ron from behind, and he struggles with it as they descend deeper and deeper. Above the surface, Ron observes embers, spheres of fire dart through the water, and the creature releases Ron, allowing him to surface inside a ring of fire. McGonagall is on her feet, brandishing her baton around her head, stirring up the fire, and the specter retreats from the flames. Ron returns onto the island and assists McGonagall back to the raft. The flames divide, revealing a clear path of water ahead. Meanwhile, Neville Longbottom lies in bed wide awake, then rises up. The lights in Flourish and Blotts blink out as Narcissa leads a group through the courtyard to the chamber at the rear. She unseals the door of the engraved cabinet, while Goyle stands watch on the school ramparts. Neville strides unnoticed along a corridor as Professor Sprout leans out of a stone archway, gazing anxiously at the threatening clouds, and Lupin peers out into the storm. In the Room of Requirement, Neville yanks the heavy cloth from the cabinet, steps back, and observes as the door handle turns. The cabinet unlocks, dark mist trickles out, and Neville strides swiftly away. Narcissa, Fenrir, and two Death Eaters with metal masks emerge from the mist, and Narcissa grins. At the astronomy tower, Ron walks away then pauses, glancing back at McGonagall. Ron conceals as someone passes on the stairs, and the figure ascends to the upper platform, aiming his baton at McGonagall. Ron observes from below as Neville pulls back his sleeve to reveal the Death Eater mark on his arm, and McGonagall's baton tumbles. Still concealed, Ron witnesses Narcissa, Fenrir, and the two Death Eaters sprint to the upper platform, where Narcissa confronts McGonagall and Neville still has his baton raised. Lupin is behind Ron and enters the upper platform."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Mist rises in the fountain, and Harry grabs frantically but the cup wouldn't overflow. Harry spins and peeks at the river, then collapses down over the boulders towards the stream. Clutching onto a branch for balance, he stretches down with the cup, and Dumbledore's orb of shadow drifts beneath the surface, dusk. Harry swings his stick, and the end of his stick flickers. He grits his teeth, grips the stick with the hand he's using for balance, and bends forward to plunge the cup into the river, topping it to the rim. A skeletal finger bursts from the stream and catches his shoulder, and he struggles loose. The stream churns all around the peninsula, and the shadow intensifies, unveiling unclothed gaunt skeletons climbing out of the stream towards him. He strikes at them as Dumbledore weakly attempts to grab his own stick. Dozens of skeletons flood onto the tiny peninsula and tackle Harry, and he's pulled underwater. A skeleton coils its limbs around Harry from behind, and he grapples with it as they plunge deeper and deeper. Above the surface, Harry notices sparks, orbs of light shoot through the stream, and the figure releases Harry, enabling him to rise inside a ring of light. Dumbledore is on his feet, twirling his stick around his head, swirling up the light, and the skeleton withdraws from the sparks. Harry returns onto the peninsula and assists Dumbledore back to the raft. The sparks divide, revealing a clear path of stream ahead. Meanwhile, Draco Malfoy rests in bed fully alert, then rises. The candles in Borgin and Burke's shop dim as Bellatrix directs a group through the alley to the chamber at the rear. She swings open the gate of the decorated box, while Filch stands sentinel on the school towers. Draco strides unnoticed down a hallway as Professor McGonagall leans out of a stone arch, looking out apprehensively at the threatening mist, and Snape peers out into the drizzle. In the Room of Requirement, Draco pulls the heavy sheet from the box, steps back, and observes as the latch twists. The box opens, dark mist seeps out, and Draco walks swiftly away. Bellatrix, Greyback, and two Death Eaters with iron visors emerge from the mist, and Bellatrix grins. At the observatory tower, Harry moves away then halts, glancing back at Dumbledore. Harry conceals himself as an individual ascends on the stairs, and the figure climbs to the topmost deck, aiming his stick at Dumbledore. Harry observes from below as Draco pulls back his sleeve to reveal the Death Eater emblem on his arm, and Dumbledore's stick drops. Still concealed, Harry sees Bellatrix, Greyback, and the two Death Eaters sprint to the topmost deck, where Bellatrix confronts Dumbledore and Draco still has his stick elevated. Snape is behind Harry and steps into the topmost deck."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Mist drifts into the meadow, and George shovels eagerly but the hat wouldn't brim. George spins and peeks at the river, then stumbles down over the boulders towards the brook. Clutching onto a pebble for stability, he lunges down with the bowl, and Michelangelo's orb of shimmer sinks beneath the surface, shadow. George wields his cane, and the edge of his cane radiates. He grits his teeth, clasps the cane with the hand he's using for balance, and bends forward to dunk the bowl into the brook, saturating it to the rim. A skeletal foot leaps from the brook and clutches his leg, and he battles loose. The brook churns all around the peninsula, and the glow intensifies, displaying bare skeletal figures scrambling out of the brook towards him. He strikes out at them as Michelangelo weakly attempts to grasp his own cane. Scores of figures crowd onto the small peninsula and assault George, and he's hauled underwater. A figure wraps its limbs around George from behind, and he struggles with it as they plummet deeper and deeper. Beyond the surface, George glimpses embers, spheres of glow streak through the brook, and the creature releases George, permitting him to ascend inside a perimeter of sparks. Michelangelo stands on his toes, brandishing his cane above his head, whipping up the sparks, and the figure retreats from the embers. George returns onto the peninsula and assists Michelangelo back to the raft. The embers split, exposing a clear path of brook ahead. Meanwhile, Tony Stark tosses in dreams wide awake, then rises. The bulbs in Mopps and Grindle's studio dim as Helena directs a troop through the square to the parlor at the back. She swings the portal of the etched cupboard, while Finch watches post in the academy ramparts. Tony strolls unnoticed along a hallway as Doctor Greengrass peers out of a brick alcove, staring out tensely at the looming mists, and Don peers out into the deluge. In the Hall of Wishes, Tony tugs the hefty fabric from the cupboard, steps away, and observes as the latch swivels. The cupboard swings open, dark mist drifts out, and Tony strides swiftly away. Helena, Moonfang, and two Miscreants with iron veils emerge from the mist, and Helena grins. At the stargazing watchtower, George strides away then halts, glancing back at Michelangelo. George conceals as someone crosses on the ladder, and the silhouette ascends to the top platform, aiming his cane at Michelangelo. George peers from below as Tony retracts his cuff to display the Miscreant symbol on his wrist, and Michelangelo's cane drops. Still concealed, George perceives Helena, Moonfang, and the two Miscreants dash to the top platform, where Helena confronts Michelangelo, and Tony still has his cane elevated. Don is behind George and ascends to the top platform."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Water fills the basin as Harry desperately tries to scoop it with a shell, but it won't fill. He climbs down to the lake, using a rock for support to fill the shell. A bony hand grabs him, and he fights free as emaciated corpses emerge from the water. Harry battles them until he's dragged underwater. Flames streak through the water, forcing the creature to release him, and he surfaces in a circle of fire conjured by Dumbledore, who fights off the corpses. Harry helps Dumbledore to the boat as flames reveal a clear path. Meanwhile, Draco Malfoy, wide awake, gets up, and Bellatrix leads a group through Borgin and Burke's to a rear room. She opens an embossed cabinet as Draco moves unnoticed through the school. In the Room of Requirement, he unveils the cabinet, and black smoke fills the room. Bellatrix, Greyback, and Death Eaters emerge. At the astronomy tower, Harry hides as Draco reveals his Death Eater mark and approaches Dumbledore. Bellatrix and her group reach the tower, confronting Dumbledore as Draco holds his wand on him. Snape arrives behind Harry and joins the upper platform confrontation."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Snape is behind Harry and enters the upper platform Harry sees Bellatrix Greyback and the two Death Eaters race to the upper platform where Bellatrix faces Dumbledore and Draco still has his wand raised  Still hidden  Harry watches from below as Draco pulls back his sleeve to show the Death Eater mark on his arm and Dumbledore's wand falls  Harry hides as someone passes on the stairs and the figure climbs to the upper platform pointing his wand at Dumbledore  At the astronomy tower Harry walks away then stops looking back at Dumbledore  Bellatrix Greyback and two Death Eaters with metal masks emerge from the smoke and Bellatrix smirks  black smoke filters out and Draco walks quickly away  The cabinet opens  In the Room of Requirement Draco pulls the heavy cloth from the cabinet steps back and watches as the door handle turns  Draco marches unnoticed along a corridor as Professor McGonagall leans out of a stone archway looking out anxiously at the menacing clouds and Snape looks out into the storm  She opens the door of the embossed cabinet while Filch stands guard on the school battlements  The lights in Borgin and Burke's shop go out as Bellatrix leads a group through the courtyard to the room at the rear  Meanwhile Draco Malfoy lies in bed wide awake then gets up  The flames part revealing a clear channel of water ahead  Harry comes back onto the island and helps Dumbledore back to the boat  Dumbledore is on his feet flourishing his wand around his head whipping up the fire and the corpse retreats from the flames  balls of fire streak through the water and the creature releases Harry allowing him to surface inside a circle of fire  Above the surface Harry sees flames  A corpse wraps its arms around Harry from behind and he grapples with it as they sink deeper and deeper  Scores of corpses swarm onto the tiny island and attack Harry and he's dragged underwater  He lashes out at them as Dumbledore feebly tries to reach his own wand  The water seethes all around the island and the light brightens revealing naked emaciated corpses clambering out of the water towards him  A bony hand shoots from the water and grabs his arm and he wrestles free  He clenches his teeth grips the wand with the hand he's using as support and leans forward to dip the shell into the lake filling it to the brim  Harry wields his wand and the tip of his wand glows  darkness  Holding onto a rock for support he reaches down with the shell and Dumbledore's ball of light sinks under the surface  Harry turns and looks at the lake then crumbles down over the rocks towards the water  Water appears in the basin and Harry scoops desperately but the shell wouldn't fill "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Scores of corpses swarm onto the tiny island and attack Harry and he's dragged underwater  Water appears in the basin and Harry scoops desperately but the shell wouldn't fill  Draco marches unnoticed along a corridor as Professor McGonagall leans out of a stone archway looking out anxiously at the menacing clouds and Snape looks out into the storm  The cabinet opens  Harry sees Bellatrix Greyback and the two Death Eaters race to the upper platform where Bellatrix faces Dumbledore and Draco still has his wand raised  He clenches his teeth grips the wand with the hand he's using as support and leans forward to dip the shell into the lake filling it to the brim  Bellatrix Greyback and two Death Eaters with metal masks emerge from the smoke and Bellatrix smirks  Harry hides as someone passes on the stairs and the figure climbs to the upper platform pointing his wand at Dumbledore  In the Room of Requirement Draco pulls the heavy cloth from the cabinet steps back and watches as the door handle turns  Harry comes back onto the island and helps Dumbledore back to the boat  At the astronomy tower Harry walks away then stops looking back at Dumbledore  The flames part revealing a clear channel of water ahead  Meanwhile Draco Malfoy lies in bed wide awake then gets up  The water seethes all around the island and the light brightens revealing naked emaciated corpses clambering out of the water towards him  The lights in Borgin and Burke's shop go out as Bellatrix leads a group through the courtyard to the room at the rear  Harry turns and looks at the lake then crumbles down over the rocks towards the water  Harry watches from below as Draco pulls back his sleeve to show the Death Eater mark on his arm and Dumbledore's wand falls  She opens the door of the embossed cabinet while Filch stands guard on the school battlements  Above the surface Harry sees flames  Snape is behind Harry and enters the upper platform balls of fire streak through the water and the creature releases Harry allowing him to surface inside a circle of fire  Holding onto a rock for support he reaches down with the shell and Dumbledore's ball of light sinks under the surface  darkness  Still hidden  A bony hand shoots from the water and grabs his arm and he wrestles free  Harry wields his wand and the tip of his wand glows  He lashes out at them as Dumbledore feebly tries to reach his own wand  A corpse wraps its arms around Harry from behind and he grapples with it as they sink deeper and deeper  Dumbledore is on his feet flourishing his wand around his head whipping up the fire and the corpse retreats from the flames  black smoke filters out and Draco walks quickly away "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The flames part revealing a clear channel of water ahead  Meanwhile Draco Malfoy lies in bed wide awake then gets up  The lights in Borgin and Burke's shop go out as Bellatrix leads a group through the courtyard to the room at the rear  She opens the door of the embossed cabinet while Filch stands guard on the school battlements  Draco marches unnoticed along a corridor as Professor McGonagall leans out of a stone archway looking out anxiously at the menacing clouds and Snape looks out into the storm  In the Room of Requirement Draco pulls the heavy cloth from the cabinet steps back and watches as the door handle turns  The cabinet opens  black smoke filters out and Draco walks quickly away  Bellatrix Greyback and two Death Eaters with metal masks emerge from the smoke and Bellatrix smirks  At the astronomy tower Harry walks away then stops looking back at Dumbledore  Harry hides as someone passes on the stairs and the figure climbs to the upper platform pointing his wand at Dumbledore  Harry watches from below as Draco pulls back his sleeve to show the Death Eater mark on his arm and Dumbledore's wand falls  Still hidden  Harry sees Bellatrix Greyback and the two Death Eaters race to the upper platform where Bellatrix faces Dumbledore and Draco still has his wand raised  Snape is behind Harry and enters the upper platform Water appears in the basin and Harry scoops desperately but the shell wouldn't fill  Harry turns and looks at the lake then crumbles down over the rocks towards the water  Holding onto a rock for support he reaches down with the shell and Dumbledore's ball of light sinks under the surface  darkness  Harry wields his wand and the tip of his wand glows  He clenches his teeth grips the wand with the hand he's using as support and leans forward to dip the shell into the lake filling it to the brim  A bony hand shoots from the water and grabs his arm and he wrestles free  The water seethes all around the island and the light brightens revealing naked emaciated corpses clambering out of the water towards him  He lashes out at them as Dumbledore feebly tries to reach his own wand  Scores of corpses swarm onto the tiny island and attack Harry and he's dragged underwater  A corpse wraps its arms around Harry from behind and he grapples with it as they sink deeper and deeper  Above the surface Harry sees flames  balls of fire streak through the water and the creature releases Harry allowing him to surface inside a circle of fire  Dumbledore is on his feet flourishing his wand around his head whipping up the fire and the corpse retreats from the flames  Harry comes back onto the island and helps Dumbledore back to the boat "
        }
      ]
    }
  ]
}