{
  "ground_truth": "Dumbledore glances down and catches Harry's eye. Snape looks eyes with Dumbledore, Bellatrix glares. Dumbledore's eyes flicker. Harry watches in horror as Dumbledore is flung backwards over the balustrade. The white-haired professor seems to float gently downwards. Snape grabs the distraught Draco. Bellatrix is jubilant. The shape of a skull appears in the dark clouds. Snape rushes Draco down the tower's spiral staircase. Harry follows, as Snape leads the death eaters and the ashen-faced Draco through the school corridors. Bellatrix creates havoc as she strides along a tabletop in the Great Hall. An Auror is thrown aside. Bellatrix aims her wand at the huge windows. They explode and the candles are snuffed out. Draco, Snape, and the Death Eaters stride through the forest towards Hagrid's cottage. Harry follows. Bellatrix sets fire to the cottage. Harry aims his wand. Harry falls. Bellatrix licks her lips then saunters away. Illuminated by the flames from the burning cottage, Snape stands alone. Harry lies on his back on the hillside. Snape turns away as Harry gets to his feet. Harry staggers forward. Snape deflects the spell. Harry crashes to the ground. Snape walks over to him. Trembling, Harry looks up at Snape, who kicks Harry's wand from his hand. Harry lies motionless on the grassy hillside. Snape hurries away past the burning cottage below him. Harry looks up at the glowering clouds forming the shape of a skull. Harry strides through the school courtyard followed by Hagrid. He pushes past students and teachers. Professor McGonagall, Hermione, Ginny, and Ron stand at the front of the crowd. Harry kneels beside Dumbledore's body. He leans forward and gently touches Dumbledore's cheek. The Horcrux. Harry gently places his hand on Dumbledore's heart. Ginny walks forward and kneels down beside Harry. He rests his head on her shoulder. A tear rolls down Hermione's cheek. Professor McGonagall raises her wand high above her head. The tip of it glows as it points up towards the skull-shaped cloud. Pomfrey raises her wand then Luna. One after another, everyone does the same. Wand after wand points upwards, the tip of each one glowing like a star. Grief-stricken, the staff and students stand in solemn silence. Dumbledore lies before them, his face serene and peaceful. As the wands glow more brightly, light bursts through the clouds and the skull disappears. Harry takes his hand from Dumbledore's heart. His head on Ginny's shoulder, Harry weeps. Sunlight streams in through the damaged window of the Great Hall. The long tables are bare, the seats and benches are empty. The door of Dumbledore's study opens and Harry steps inside. It, too, is bathed in sunlight. Harry walks towards Dumbledore's desk. A pair of half-moon spectacles lies on an open book.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Dumbledore gazes down and captures Harry's gaze. Snape matches gazes with Dumbledore, Bellatrix scowls. Dumbledore's gaze flickers. Harry observes in terror as Dumbledore is hurled backward over the railing. The white-haired educator seems to float gently downward. Snape seizes the distressed Draco. Bellatrix is exultant. The outline of a skull materializes in the darkened clouds. Snape rushes Draco down the tower's coiled staircase. Harry trails, as Snape leads the death eaters and the pallid Draco through the school passageways. Bellatrix causes mayhem as she strides along a tabletop in the Great Hall. An Auror is tossed aside. Bellatrix targets her wand at the enormous windows. They shatter and the candles are extinguished. Draco, Snape, and the Death Eaters march through the wood towards Hagrid's hut. Harry trails. Bellatrix ignites the hut. Harry targets his wand. Harry tumbles. Bellatrix moistens her lips then saunters away. Lit by the blaze from the burning hut, Snape stands solitary. Harry lies on his back on the slope. Snape turns away as Harry gets to his feet. Harry staggers onward. Snape parries the spell. Harry crashes to the terrain. Snape strides over to him. Shaking, Harry looks up at Snape, who kicks Harry's wand from his hand. Harry lies motionless on the grassy slope. Snape hurries away past the burning hut below him. Harry looks up at the scowling clouds forming the outline of a skull. Harry strides through the school courtyard followed by Hagrid. He pushes past pupils and instructors. Professor McGonagall, Hermione, Ginny, and Ron stand at the front of the throng. Harry kneels beside Dumbledore's form. He leans forward and gently touches Dumbledore's face. The Horcrux. Harry gently places his hand on Dumbledore's chest. Ginny walks forward and kneels down beside Harry. He rests his head on her shoulder. A tear rolls down Hermione's face. Professor McGonagall raises her wand high above her head. The tip of it shines as it points up towards the skull-shaped cloud. Pomfrey raises her wand then Luna. One after another, everyone does the same. Wand after wand points upwards, the tip of each one shining like a star. Grief-stricken, the staff and pupils stand in solemn silence. Dumbledore lies before them, his face tranquil and placid. As the wands shine more brightly, light bursts through the clouds and the skull vanishes. Harry removes his hand from Dumbledore's chest. His head on Ginny's shoulder, Harry cries. Sunlight streams in through the shattered window of the Great Hall. The long tables are bare, the seats and benches are unoccupied. The door of Dumbledore's study opens and Harry steps inside. It, too, is bathed in sunlight. Harry walks towards Dumbledore's desk. A pair of half-moon spectacles rests on an open book."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Dumbledore's eye is glanced down at and caught by Harry. Eyes are locked with Dumbledore by Snape, Bellatrix is glared. The eyes of Dumbledore flicker. In horror, Harry watches as Dumbledore is flung backwards over the balustrade. The professor with white hair seems to be floated gently downwards. Draco is grabbed by Snape. Jubilation is felt by Bellatrix. A skull is shaped in the dark clouds. Draco is rushed down the tower's spiral staircase by Snape. They are followed by Harry, as the death eaters and the ashen-faced Draco are led through the school corridors by Snape. Havoc is created by Bellatrix as a tabletop in the Great Hall is strode along by her. An Auror throws someone aside. Her wand is aimed at the huge windows by Bellatrix. An explosion occurs and the candles are snuffed out. The forest towards Hagrid's cottage is stridden through by Draco, Snape, and the Death Eaters. They are followed by Harry. The cottage is set on fire by Bellatrix. His wand is aimed by Harry. Harry is made to fall. Her lips are licked by Bellatrix, then she saunters away. Snape is illuminated by the flames from the burning cottage and stands alone. On his back, Harry lies on the hillside. Snape turns away as his feet are gotten to by Harry. Forward, Harry staggers. The spell is deflected by Snape. The ground is crashed onto by Harry. Over to him, Snape walks. Up at Snape, trembling, Harry looks, who kicks Harry's wand from his hand. On the grassy hillside, Harry lies motionless. Past the burning cottage below him, Snape hurries away. Up at the clouds forming the skull shape, Harry looks. Through the school courtyard, Harry strides followed by Hagrid. Past students and teachers, he pushes. At the front of the crowd, Professor McGonagall, Hermione, Ginny, and Ron stand. Beside Dumbledore's body, Harry kneels. Forward, he leans and Dumbledore's cheek is gently touched by him. The Horcrux. On Dumbledore's heart, Harry gently places his hand. Forward, Ginny walks and beside Harry, she kneels down. His head is rested on her shoulder by him. A tear is rolled down Hermione's cheek. Her wand is raised high above her head by Professor McGonagall. The tip of it glowing is pointed up towards the skull-shaped cloud. Her wand is raised by Pomfrey, then Luna. The same is done by everyone, one after another. Upwards, wand after wand points, the tip of each glowing like a star. Grief-stricken, in solemn silence the staff and students stand. Before them lies Dumbledore, his face serene and peaceful. As more brightly the wands glow, through the clouds light bursts and the skull disappears. From Dumbledore's heart, Harry takes his hand. On Ginny's shoulder, his head is rested by Harry, who weeps. Through the damaged window of the Great Hall, sunlight is streamed in. The long tables are left bare, and the seats and benches are left empty. The study door of Dumbledore is opened, and inside steps Harry. In sunlight, it too is bathed. Towards Dumbledore's desk, Harry walks. On an open book, a pair of half-moon spectacles is left lying."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Dumbledore glances down and catches Harry's eye. Snape locks eyes with Dumbledore; Bellatrix glares as Dumbledore's eyes flicker. Horrified, Harry watches Dumbledore be flung over the balustrade, seeming to float gently downwards. Snape grabs distraught Draco while Bellatrix is jubilant. A skull forms in the dark clouds. Snape rushes Draco down the tower staircase. Harry follows as Snape leads Draco and the Death Eaters through the school. Bellatrix creates havoc in the Great Hall. An Auror is thrown aside as she shatters windows and extinguishes candles. Draco, Snape, and the Death Eaters move towards Hagrid's cottage. Harry follows. Bellatrix sets the cottage ablaze. Harry aims his wand but falls. Bellatrix saunters away, licking her lips. Snape stands alone by the burning cottage. Harry lies on the hillside as Snape turns away. Snape deflects a spell, and Harry crashes to the ground. Snape kicks Harry's wand and hurries past the burning cottage. Harry looks up at the skull-shaped clouds. He strides through a courtyard with Hagrid, pushing past students and teachers. McGonagall, Hermione, Ginny, and Ron stand at the crowd's front. Harry kneels beside Dumbledore's body, touching his cheek and heart. Ginny kneels beside Harry, who rests his head on her shoulder. A tear rolls down Hermione's cheek as McGonagall raises her glowing wand toward the skull cloud. Pomfrey, then Luna, and others follow. The wands glow like stars, breaking through the clouds. Harry lifts his head from Ginny's shoulder, weeping as the sunlight streams through the Great Hall's damaged window. The hall is empty, as is Dumbledore's sunlit study. Harry approaches Dumbledore's desk, where his half-moon spectacles lie on an open book."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Dumbledore glances down, catching Harry's eye. Snape and Bellatrix lock eyes with Dumbledore, whose eyes flicker. Harry watches as Dumbledore is flung over the balustrade, floating gently downwards. Snape grabs Draco while Bellatrix celebrates. A skull appears in the clouds. Snape rushes Draco down the tower's staircase, followed by Harry, as they lead the Death Eaters through the school. Bellatrix wreaks havoc, exploding windows and extinguishing candles. Snape, Draco, and the Death Eaters move towards Hagrid's cottage, with Harry trailing. Bellatrix sets it ablaze. Harry falls, Bellatrix departs. Snape, alone by the burning cottage, deflects Harry's spell, knocking him down. Snape kicks Harry's wand away and leaves. Harry, motionless, watches the skull-shaped clouds. In the school courtyard, Harry kneels beside Dumbledore, placing his hand on his heart. Ginny joins him, and Hermione sheds a tear. McGonagall raises her wand, followed by others, pointing towards the skull. As they glow, light pierces the clouds, erasing the skull. Harry and Ginny grieve over Dumbledore's serene form. Sunlight enters the Great Hall. Harry steps into Dumbledore's sunny study, noticing half-moon spectacles on an open book."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Dumbledore, with a subtle yet meaningful glance, looks downward and catches Harry's focused gaze. At the same time, Snape locks eyes with Dumbledore, while Bellatrix shoots a menacing glare. Dumbledore's eyes flicker with a fleeting expression. In sheer horror, Harry watches as Dumbledore is dramatically flung backwards, tumbling over the edge of the balustrade. The distinguished, white-haired professor appears almost ethereal as he seems to float gently downwards. In a swift motion, Snape grabs the visibly distraught Draco. Meanwhile, Bellatrix exudes jubilance, her glee unmistakable. High above, forming ominously in the dark clouds, the sinister shape of a skull emerges. Snape urgently rushes Draco down the twisting staircase of the tower. Behind them, Harry follows closely, as Snape leads the assembly of Death Eaters and the ashen-faced Draco through the ancient school corridors. Bellatrix, in a fit of chaotic delight, creates havoc as she strides confidently atop a tabletop in the Great Hall. An unfortunate Auror is forcefully cast aside. With a swift motion, Bellatrix aims her wand at the enormous windows, causing them to explode spectacularly, snuffing out the flickering candles.\n\nThe group, comprising Draco, Snape, and the Death Eaters, strides purposefully through the dense forest towards Hagrid's humble cottage. Harry remains in pursuit. With a malicious spell, Bellatrix sets the cottage ablaze, flames rising into the night. Harry aims his wand with determination, but suddenly, he falls. Bellatrix, with a wicked grin, licks her lips then saunters away, her figure illuminated by the intense flames consuming the cottage. Alone, Snape stands, silhouetted against the fiery backdrop. Lying on his back upon the chilly hillside, Harry watches. Snape, turning away, moves as Harry struggles to his feet. Harry, determined yet unsteady, staggers forward. Snape deftly deflects his spell, causing Harry to crash hard to the ground. Snape approaches him, a menacing presence. Trembling with both fear and exhaustion, Harry looks up as Snape coldly kicks Harry's wand from his hand, leaving Harry lying motionless on the grassy hillside. Snape hurries away, moving swiftly past the burning cottage below him. Harry, glancing upwards, sees the ominous clouds above, still forming the sinister shape of a skull.\n\nThrough the school courtyard, Harry strides with purpose, followed closely by Hagrid. He decisively pushes past the throng of students and teachers. At the forefront of the gathered crowd stand Professor McGonagall, Hermione, Ginny, and Ron, worry etched on their faces. Harry kneels solemnly beside Dumbledore's lifeless body. With great care, he leans forward and gently touches Dumbledore's cool cheek. Remembering the Horcrux, Harry softly places his hand over Dumbledore's silent heart. Ginny steps forward and kneels beside Harry, offering silent support. Harry, seeking solace, rests his head on her shoulder. A solitary tear rolls down Hermione's cheek, a testament to the profound grief felt by all. Professor McGonagall, with a determined expression, raises her wand high above her head. Its tip glows brightly as it points towards the ominous skull-shaped cloud. Following her lead, Pomfrey raises her wand, then Luna, and one by one, everyone does the same. Wand after wand stretches skyward, each tip glowing like a myriad of tiny stars. Grief-stricken, the staff and students stand united in solemn silence, witnessing the poignant scene before them. Dumbledore lies at peace, his face serene and untouched by fear. As the collective glow of the wands intensifies, light breaks through the oppressive clouds, causing the skull to dissipate. Gently, Harry removes his hand from Dumbledore's heart. Overcome with emotion, his head resting on Ginny's comforting shoulder, Harry weeps quietly. Sunlight streams gently in through the damaged windows of the Great Hall. The long tables are now bare, seats and benches empty. The door to Dumbledore's study swings open, and Harry steps inside. The study, like the hall, is awash with sunlight. Harry walks towards Dumbledore's desk, where a pair of half-moon spectacles lies atop an open book, a poignant reminder of the man who once wore them."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Dumbledore, with a subtle yet deeply meaningful glance, directs his eyes downward and catches Harry's intensely focused gaze. At the same precise moment, Snape locks his eyes with those of Dumbledore, while Bellatrix Lestrange shoots an unmistakably menacing glare. Dumbledore's eyes flicker with a fleeting and enigmatic expression. In sheer horror and disbelief, Harry watches as Dumbledore is dramatically flung backwards, his body tumbling over the edge of the balustrade. The distinguished, white-haired professor appears almost ethereal as he seems to float gently downwards through the air. In a swift and decisive motion, Snape grabs the visibly distraught Draco. Meanwhile, Bellatrix exudes jubilance, her glee unmistakably clear. High above, forming ominously in the dark and turbulent clouds, the sinister shape of a skull emerges. Snape urgently rushes Draco down the twisting and narrow staircase of the tower. Behind them, Harry follows closely, as Snape leads the assembly of Death Eaters and the ashen-faced Draco through the ancient stone corridors of the old school. Bellatrix, in a fit of chaotic and wild delight, creates havoc as she strides confidently atop a long tabletop in the Great Hall. An unfortunate Auror is forcefully cast aside. With a swift, precise motion, Bellatrix aims her wand at the enormous, stained glass windows, causing them to explode spectacularly, snuffing out the flickering candles.\n\nThe group, comprising Draco, Snape, and the Death Eaters, strides purposefully through the dense and shadowy forest towards Hagrid's humble and rustic cottage. Harry remains determinedly in pursuit. With a malicious and ill-intentioned spell, Bellatrix sets the cottage ablaze, flames rising high into the night. Harry aims his wand with determination, but suddenly, he falls. Bellatrix, with a wicked grin, licks her lips then saunters away, her figure illuminated by the intense, consuming flames of the burning cottage. Alone, Snape stands there, silhouetted against the fiery and chaotic backdrop. Lying on his back upon the chilly and damp hillside, Harry watches. Snape, turning away, moves as Harry struggles to his feet with determination. Harry, determined yet unsteady, staggers forward with resolve. Snape deftly deflects his spell, causing Harry to crash hard to the ground, the impact jarring. Snape approaches him, a menacing and imposing presence. Trembling with both fear and exhaustion, Harry looks up as Snape coldly kicks Harry's wand from his hand, leaving Harry lying motionless and vulnerable on the grassy hillside. Snape hurries away, moving swiftly past the burning and smoldering cottage below him. Harry, glancing upwards, sees the ominous and foreboding clouds above, still forming the sinister shape of a skull.\n\nThrough the school courtyard, Harry strides with purpose, followed closely by the towering figure of Hagrid. He decisively pushes past the throng of concerned students and teachers. At the forefront of the gathered and anxious crowd stand Professor McGonagall, Hermione, Ginny, and Ron, worry etched deeply on their faces. Harry kneels solemnly beside Dumbledore's lifeless body. With great care, he leans forward and gently touches Dumbledore's cool and still cheek. Remembering the Horcrux, Harry softly places his hand over Dumbledore's silent heart. Ginny steps forward and kneels beside Harry, offering her silent support and companionship. Harry, seeking solace, rests his head on her supportive shoulder. A solitary tear rolls down Hermione's cheek, a testament to the profound grief felt by everyone present. Professor McGonagall, with a determined expression etched on her face, raises her wand high above her head. Its tip glows brightly as it points towards the ominous skull-shaped cloud. Following her lead, Pomfrey raises her wand, then Luna does the same, and one by one, everyone follows suit. Wand after wand stretches skyward, each tip glowing like a myriad of tiny, radiant stars. Grief-stricken, the staff and students stand united in solemn silence, witnessing the poignant and moving scene before them. Dumbledore lies at peace, his face serene and untouched by fear. As the collective glow of the wands intensifies, an illuminating light breaks through the oppressive clouds, causing the skull to dissipate. Gently, Harry removes his hand from Dumbledore's heart. Overcome with emotion, his head still resting on Ginny's comforting shoulder, Harry weeps quietly. Sunlight streams gently in through the damaged windows of the Great Hall. The long tables are now bare, seats and benches empty. The door to Dumbledore's study swings open, inviting Harry to step inside. The study, like the hall, is awash with sunlight. Harry walks towards Dumbledore's desk, where a pair of half-moon spectacles lies atop an open book, serving as a poignant reminder of the man who once wore them."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Dumbledore, with a subtle and meaningful glance downward, locks eyes with Harry, creating a moment of silent communication between them. Snape holds Dumbledore’s gaze with intensity, while Bellatrix stands nearby, her eyes filled with malice as she glares. Dumbledore’s eyes flicker with a mix of emotions, unreadable but profound. In the next terrifying moment, Harry watches helplessly as Dumbledore is violently hurled backwards over the balustrade. To Harry’s dismay, Dumbledore appears to float slowly and gently downward, as if defying gravity. Amidst the chaos, Snape seizes Draco, who is visibly disturbed, gripping him tightly. Bellatrix, however, revels in the mayhem, her jubilation clear. Meanwhile, above them, the ominous shape of a skull forms amongst the dark clouds, casting a menacing shadow. Snape urgently rushes Draco down the spiral staircase of the tower, each step echoing with urgency. Harry immediately follows, filled with determination, as Snape efficiently guides the Death Eaters and a shaken Draco through the winding corridors of the school. As they move, Bellatrix leaves a trail of destruction, striding confidently along a tabletop in the Great Hall, exuding chaos and power. An Auror, standing in her way, is summarily thrown aside. Bellatrix, with a flourish, aims her wand at the towering windows, causing them to shatter explosively, snuffing out the light of the candles in an instant. Draco, Snape, and the other Death Eaters continue their stride into the forest, heading purposefully towards Hagrid’s cottage, with Harry keenly following at a distance. In an act of vile satisfaction, Bellatrix sets the cottage ablaze with a flick of her wand. In response, Harry raises his wand, preparing to retaliate, but is knocked down in the ensuing commotion. Bellatrix, triumphant, licks her lips with a twisted pleasure before sauntering away from the scene of destruction. Snape stands alone, silhouetted by the fiery glow from the burning cottage, creating a haunting image. Harry, having been knocked down, lies on his back upon the grassy hillside. Recovering, he sees Snape turning his back to him as he rises to his feet. Harry, fighting fatigue and pain, staggers forward, casting a spell at Snape with desperation, only for Snape to deftly deflect it, sending Harry crashing back to the ground. Calmly, Snape walks over to where Harry lies, who looks up, trembling, meeting Snape’s eyes just before Snape kicks Harry’s wand out of his grasp, leaving Harry defenseless. Motionless on the hillside, Harry watches as Snape departs hastily, skirting past the flames of the burning cottage below. With resolve, Harry shifts his gaze upwards, seeing the sinister clouds still forming the shape of a skull. Determined, Harry strides purposefully through the courtyard of the school, with Hagrid following closely behind. As he makes his way, he pushes past the throngs of students and teachers gathered. At the forefront of the crowd, Professor McGonagall, Hermione, Ginny, and Ron stand united in grief. Harry kneels beside Dumbledore’s lifeless body, reaching out to tenderly touch the great wizard’s cheek, his mind heavy with the thought of the Horcrux. He then places his hand gently on Dumbledore’s heart, in a gesture of mourning and farewell. Ginny steps forward softly, kneeling beside Harry, offering support and solace as Harry rests his head wearily on her shoulder. Nearby, a tear slips down Hermione’s cheek, a silent testament to her sorrow. Professor McGonagall, with solemn dignity, lifts her wand high into the air, the tip glowing brightly as it points towards the ominous skull-shaped cloud. Pomfrey follows suit, then Luna, and one by one, everyone raises their wand in tribute, each tip glowing like a beacon in the gloom. Together, the staff and students stand, overwhelmed by grief, in a heavy and respectful silence. Before them, Dumbledore’s body lies serenely, his face conveying a sense of peace that belies the turmoil around him. As the collective glow of the wands intensifies, beams of light pierce through the clouds, erasing the sinister skull from the sky. Gently, Harry removes his hand from Dumbledore’s heart, overcome with emotion, his head still resting on Ginny’s shoulder as he succumbs to tears. Sunlight begins to stream through the shattered window of the Great Hall, illuminating the empty, bare long tables and deserted benches. The door to Dumbledore’s study swings open with a soft creak, allowing Harry to step inside slowly. The room, too, is bathed in the gentle light of the sun, casting a peaceful glow. Harry moves forward with quiet reverence toward Dumbledore’s desk, where a pair of half-moon spectacles rests on an open book, a poignant reminder of the man who once wore them."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Dumbledore catches Harry's eye before looking at Snape. As tension builds, Bellatrix exults while Harry watches in horror as Dumbledore is thrown over the balustrade, descending gently. Snape seizes Draco and ushers him down the tower's staircase with the other Death Eaters, Harry in pursuit. Amidst the chaos Bellatrix causes in the Great Hall, the Death Eaters, led by Snape, flee through the forest towards Hagrid’s cottage, igniting it as Harry follows. Illuminated by the flames, Snape confronts Harry, deflects his spell, and disarms him before leaving. Harry remains sprawled on the hillside, observing the menacing skull-shaped clouds. \n\nBack at the school courtyard, Harry pushes through the crowd to reach Dumbledore's body, where he tenderly touches his cheek and heart. Supported by Ginny, he grieves as Hermione, McGonagall, and others raise their wands towards the skull-shaped cloud; their lights gradually dispel the ominous image. With sunlight breaking through the Great Hall's broken window, Harry, still mourning, enters Dumbledore's sunlit study and approaches the desk, finding a pair of half-moon spectacles on an open book."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Dumbledore, the revered headmaster of Hogwarts School of Witchcraft and Wizardry, glances down and catches Harry's eye. Snape, a complex character known for his mysterious allegiance, locks eyes with Dumbledore, while Bellatrix Lestrange, a fervent follower of Voldemort, glares. Dumbledore's eyes flicker with an enigmatic message understood only by Harry. Harry watches in horror as Dumbledore is flung backwards over the balustrade of Hogwarts' Astronomy Tower. The white-haired professor seems to float gently downwards in a moment that feels suspended in time. Snape grabs the distraught Draco Malfoy, a young wizard caught between the forces of good and evil. Bellatrix is jubilant, intoxicated by chaos. The shape of a skull, known as the Dark Mark and a symbol of Voldemort's followers, appears in the dark clouds. Snape rushes Draco down the tower's spiral staircase, a hidden passageway within the ancient castle. Harry follows, as Snape leads the Death Eaters, a group dedicated to pureblood supremacy, and the ashen-faced Draco through the school corridors. Bellatrix creates havoc as she strides along a tabletop in the Great Hall, the central gathering place for Hogwarts students. An Auror, one of the magical law enforcement officers, is thrown aside. Bellatrix aims her wand at the huge windows. They explode, and the candles, which float midair, are snuffed out. Draco, Snape, and the Death Eaters stride through the Forbidden Forest towards Hagrid's cottage. Harry follows, his heart pounding with purpose. Bellatrix sets fire to the cottage, which belongs to the gentle half-giant, Hagrid. Harry aims his wand in desperation. Harry falls. Bellatrix licks her lips in cruel satisfaction then saunters away. Illuminated by the flames from the burning cottage, Snape stands alone, a lone figure amidst chaos. Harry lies on his back on the hillside, a place of many pivotal events in his life. Snape turns away as Harry gets to his feet, determined yet vulnerable. Harry staggers forward. Snape, skilled in defense, deflects the spell. Harry crashes to the ground. Snape walks over to him, his face inscrutable. Trembling, Harry looks up at Snape, who kicks Harry's wand from his hand, a final act of dominance. Harry lies motionless on the grassy hillside, a symbol of defeat and loss. Snape hurries away past the burning cottage below him, disappearing into the darkness. Harry looks up at the glowering clouds forming the shape of a skull, a reminder of looming danger. Harry strides through the school courtyard followed by Hagrid, the loyal caretaker of magical creatures. He pushes past students and teachers. Professor McGonagall, the stern yet caring deputy headmistress, stands with Hermione, Ginny, and Ron, Harry's closest friends and allies, at the front of the crowd. Harry kneels beside Dumbledore's body, his mentor and protector. He leans forward and gently touches Dumbledore's cheek, feeling the coldness of loss. The Horcrux, a dark object containing a piece of Voldemort's soul, weighs heavily on his mind. Harry gently places his hand on Dumbledore's heart, a gesture of farewell. Ginny walks forward and kneels down beside Harry, offering silent support. He rests his head on her shoulder, comforted by her presence. A tear rolls down Hermione's cheek, a testament to the depth of their bond. Professor McGonagall raises her wand high above her head, leading a gesture of respect and unity. The tip of it glows as it points up towards the skull-shaped cloud. Pomfrey, the school nurse known for her healing skills, raises her wand, then Luna, the whimsical yet wise student. One after another, everyone does the same. Wand after wand points upwards, the tip of each one glowing like a star. Grief-stricken, the staff and students stand in solemn silence. Dumbledore lies before them, his face serene and peaceful in death, embodying the wisdom he shared. As the wands glow more brightly, light bursts through the clouds and the skull disappears, symbolizing the triumph of hope over despair. Harry takes his hand from Dumbledore's heart, filled with gratitude and sorrow. His head on Ginny's shoulder, Harry weeps, mourning the loss yet determined to continue the fight. Sunlight streams in through the damaged window of the Great Hall, casting a hopeful glow. The long tables are bare, the seats and benches are empty, echoing the emptiness they all feel. The door of Dumbledore's study, a room filled with magical artifacts and memories, opens and Harry steps inside. It, too, is bathed in sunlight, a silent promise of a new beginning. Harry walks towards Dumbledore's desk, a place of many profound conversations. A pair of half-moon spectacles, emblematic of Dumbledore's wisdom and kindness, lies on an open book, marking the end of a chapter yet inviting the start of a new journey."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Dumbledore glances down and catches Harry's eye. Snape looks eyes with Dumbledore. Bellatrix glares. Dumbledore's eyes flicker. Harry watches in horror as Dumbledore is flung backwards over the balustrade. The whitehaired professor seems to float gently downwards. Snape grabs the distraught Draco. Bellatrix is jubilant. The shape of a skull appears in the dark clouds. Snape rushes Draco down the tower's spiral staircase. Harry follows as Snape leads the death eaters and the ashenfaced Draco through the school corridors. Bellatrix creates havoc as she strides along a tabletop in the Great Hall. An Auror is thrown aside. Bellatrix aims her wand at the huge windows. They explode and the candles are snuffed out. Draco Snape and the Death Eaters stride through the forest towards Hagrid's cottage. Harry follows. Bellatrix sets fire to the cottage. Harry aims his wand. Harry falls. Bellatrix licks her lips then saunters away. Illuminated by the flames from the burning cottage. Snape stands alone. Harry lies on his back on the hillside. Snape turns away as Harry gets to his feet. Harry staggers forward. Snape deflects the spell. Harry crashes to the ground. Snape walks over to him. Trembling. Harry looks up at Snape who kicks Harry's wand from his hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Harry lies motionless on the grassy hillside. Snape hurries away past the burning cottage below him. Harry looks up at the glowering clouds forming the shape of a skull. Harry strides through the school courtyard followed by Hagrid. He pushes past students and teachers. Professor McGonagall Hermione Ginny and Ron stand at the front of the crowd. Harry kneels beside Dumbledore's body. He leans forward and gently touches Dumbledore's cheek. The Horcrux. Harry gently places his hand on Dumbledore's heart. Ginny walks forward and kneels down beside Harry. He rests his head on her shoulder. A tear rolls down Hermione's cheek. Professor McGonagall raises her wand high above her head. The tip of it glows as it points up towards the skullshaped cloud. Pomfrey raises her wand then Luna. One after another everyone does the same. Wand after wand points upwards the tip of each one glowing like a star. Griefstricken. the staff and students stand in solemn silence. Dumbledore lies before them his face serene and peaceful. As the wands glow more brightly light bursts through the clouds and the skull disappears. Harry takes his hand from Dumbledore's heart. His head on Ginny's shoulder. Harry weeps. Sunlight streams in through the damaged window of the Great Hall. The long tables are bare the seats and benches are empty. The door of Dumbledore's study opens and Harry steps inside. It too is bathed in sunlight. Harry walks towards Dumbledore's desk. A pair of halfmoon spectacles lies on an open book."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Dumbledore glances down and catches Harry's eye. Snape looks eyes with Dumbledore. Bellatrix glares. Dumbledore's eyes flicker. Harry watches in horror as Dumbledore is flung backwards over the balustrade. The whitehaired professor seems to float gently downwards. Snape grabs the distraught Draco. Bellatrix is jubilant. The shape of a skull appears in the dark clouds. Snape rushes Draco down the tower's spiral staircase. Harry follows as Snape leads the death eaters and the ashenfaced Draco through the school corridors. Bellatrix creates havoc as she strides along a tabletop in the Great Hall. An Auror is thrown aside. Bellatrix aims her wand at the huge windows. They explode and the candles are snuffed out. Draco Snape and the Death Eaters stride through the forest towards Hagrid's cottage. Harry follows. Bellatrix sets fire to the cottage. Harry aims his wand. Harry falls. Bellatrix licks her lips then saunters away. Illuminated by the flames from the burning cottage. Snape stands alone. Harry lies on his back on the hillside. Snape turns away as Harry gets to his feet. Harry staggers forward. Snape deflects the spell. Harry crashes to the ground. Snape walks over to him. Trembling. Harry looks up at Snape who kicks Harry's wand from his hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Harry lies motionless on the grassy hillside. Snape hurries away past the burning cottage below him. Harry looks up at the glowering clouds forming the shape of a skull. Harry strides through the school courtyard followed by Hagrid. He pushes past students and teachers. Professor McGonagall Hermione Ginny and Ron stand at the front of the crowd. Harry kneels beside Dumbledore's body. He leans forward and gently touches Dumbledore's cheek. The Horcrux. Harry gently places his hand on Dumbledore's heart. Ginny walks forward and kneels down beside Harry. He rests his head on her shoulder. A tear rolls down Hermione's cheek. Professor McGonagall raises her wand high above her head. The tip of it glows as it points up towards the skullshaped cloud. Pomfrey raises her wand then Luna. One after another everyone does the same. Wand after wand points upwards the tip of each one glowing like a star. Griefstricken. the staff and students stand in solemn silence. Dumbledore lies before them his face serene and peaceful. As the wands glow more brightly light bursts through the clouds and the skull disappears. Harry takes his hand from Dumbledore's heart. His head on Ginny's shoulder. Harry weeps. Sunlight streams in through the damaged window of the Great Hall. The long tables are bare the seats and benches are empty. The door of Dumbledore's study opens and Harry steps inside. It too is bathed in sunlight. Harry walks towards Dumbledore's desk. A pair of halfmoon spectacles lies on an open book."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Dumbledore glances down and catches Harry's eye. Snape looks eyes with Dumbledore. Bellatrix glares. Dumbledore's eyes flicker. Harry watches in horror as Dumbledore is flung backwards over the balustrade. The whitehaired professor seems to float gently downwards. Snape grabs the distraught Draco. Bellatrix is jubilant. The shape of a skull appears in the dark clouds. Snape rushes Draco down the tower's spiral staircase. Harry follows as Snape leads the death eaters and the ashenfaced Draco through the school corridors. Bellatrix creates havoc as she strides along a tabletop in the Great Hall. An Auror is thrown aside. Bellatrix aims her wand at the huge windows. They explode and the candles are snuffed out. Draco Snape and the Death Eaters stride through the forest towards Hagrid's cottage. One after another everyone does the same. Wand after wand points upwards the tip of each one glowing like a star. Griefstricken. the staff and students stand in solemn silence. Dumbledore lies before them his face serene and peaceful. As the wands glow more brightly light bursts through the clouds and the skull disappears. Harry takes his hand from Dumbledore's heart. His head on Ginny's shoulder. Harry weeps. Sunlight streams in through the damaged window of the Great Hall. The long tables are bare the seats and benches are empty. The door of Dumbledore's study opens and Harry steps inside. It too is bathed in sunlight. Harry walks towards Dumbledore's desk. A pair of halfmoon spectacles lies on an open book."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Dumbledore glances down and catches Harry's eye. Snape looks eyes with Dumbledore. Bellatrix glares. Dumbledore's eyes flicker. Harry watches in horror as Dumbledore is flung backwards over the balustrade. The whitehaired professor seems to float gently downwards. Snape grabs the distraught Draco. Sunlight streams in through the damaged window of the Great Hall. The long tables are bare the seats and benches are empty. The door of Dumbledore's study opens and Harry steps inside. It too is bathed in sunlight. Harry walks towards Dumbledore's desk. A pair of halfmoon spectacles lies on an open book."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The dragon glances down and catches Luna's eye. The mouse locks eyes with the dragon, the witch grins. The dragon's eyes shimmer. Luna watches in disbelief as the dragon is flung backwards over the railing. The golden-furred beast seems to glide serenely sideways. The mouse grabs the bewildered frog. The witch is ecstatic. The shape of a phoenix appears in the stormy skies. The mouse dashes the frog down the ladder's winding rungs. Luna chases, as the mouse leads the shadow puppets and the pale-faced frog through the garden pathways. The witch causes chaos as she stomps along a log in the Grand Pavilion. An elf is brushed aside. The witch points her stick at the towering trees. They shatter and the lanterns are extinguished. The frog, the mouse, and the shadow puppets march through the meadow towards the giant's shed. Luna follows. The witch sets ablaze the shed. Luna points her stick. Luna trips. The witch smirks then saunters away. Illuminated by the flames from the burning shed, the mouse stands alone. Luna lies on her back on the plateau. The mouse turns away as Luna rises to her feet. Luna stumbles forward. The mouse deflects the charm. Luna tumbles to the earth. The mouse strides over to her. Quivering, Luna gazes up at the mouse, who kicks Luna's stick from her hand. Luna stays motionless on the grassy plateau. The mouse rushes away past the flaming shed below her. Luna gazes up at the brooding skies forming the shape of a phoenix. Luna marches through the garden plaza followed by the giant. She shoves past villagers and sages. The blacksmith, the fairy, the bird, and the troll stand at the head of the crowd. Luna kneels beside the dragon's figure. She leans close and softly touches the dragon's whiskers. The artifact. Luna gently places her hand on the dragon's scales. The bird steps forward and kneels down beside Luna. She rests her head on the bird's wing. A tear glides down the fairy's cheek. The blacksmith lifts her rod high above her head. The tip of it shines as it points up towards the phoenix-shaped cloud. The healer lifts her rod then the sprite. One after another, everyone does the same. Rod after rod points upwards, the tip of each one glinting like a comet. Heartbroken, the clan and villagers stand in mournful quiet. The dragon lies before them, its countenance calm and restful. As the rods shine more brightly, light breaks through the skies and the phoenix fades. Luna takes her hand from the dragon's scales. Her head on the bird's wing, Luna mourns. Sunbeams flow in through the ruined archway of the Grand Pavilion. The long planks are empty, the stools and cushions are vacant. The portal of the dragon's chamber opens and Luna steps inside. It, too, is awash with sunlight. Luna approaches the dragon's perch. A pair of crescent spectacles rests on an open scroll."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Dumbledore meets Harry's gaze before being flung over the balustrade, seeming to float downwards. Snape grabs a distraught Draco as Bellatrix celebrates, causing chaos in the Great Hall. As Bellatrix sets fire to Hagrid's cottage, Harry follows Snape, Draco, and the Death Eaters through the forest. Harry tries to fight, but Snape deflects his spell, leaving him on the ground. The Death Eaters escape, and Harry returns to the school courtyard, where he kneels beside Dumbledore's serene body. Joined by Ginny, they mourn as Professor McGonagall and others raise their glowing wands to dissipate the skull-shaped cloud. As light breaks through, signaling Dumbledore's impact, Harry weeps. Sunlight fills the Great Hall and Dumbledore's study, where Harry finds a pair of half-moon spectacles on an open book."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A pair of halfmoon spectacles lies on an open book Harry walks towards Dumbledore's desk It too is bathed in sunlight The door of Dumbledore's study opens and Harry steps inside The long tables are bare the seats and benches are empty Sunlight streams in through the damaged window of the Great Hall Harry weeps His head on Ginny's shoulder Harry takes his hand from Dumbledore's heart As the wands glow more brightly light bursts through the clouds and the skull disappears Dumbledore lies before them his face serene and peaceful the staff and students stand in solemn silence Griefstricken Wand after wand points upwards the tip of each one glowing like a star One after another everyone does the same Pomfrey raises her wand then Luna The tip of it glows as it points up towards the skullshaped cloud Professor McGonagall raises her wand high above her head A tear rolls down Hermione's cheek He rests his head on her shoulder Ginny walks forward and kneels down beside Harry Harry gently places his hand on Dumbledore's heart The Horcrux He leans forward and gently touches Dumbledore's cheek Harry kneels beside Dumbledore's body Professor McGonagall Hermione Ginny and Ron stand at the front of the crowd He pushes past students and teachers Harry strides through the school courtyard followed by Hagrid Harry looks up at the glowering clouds forming the shape of a skull Snape hurries away past the burning cottage below him Harry lies motionless on the grassy hillside Harry looks up at Snape who kicks Harry's wand from his hand Trembling Snape walks over to him Harry crashes to the ground Snape deflects the spell Harry staggers forward Snape turns away as Harry gets to his feet Harry lies on his back on the hillside Snape stands alone Illuminated by the flames from the burning cottage Bellatrix licks her lips then saunters away Harry falls Harry aims his wand Bellatrix sets fire to the cottage Harry follows Draco Snape and the Death Eaters stride through the forest towards Hagrid's cottage They explode and the candles are snuffed out Bellatrix aims her wand at the huge windows An Auror is thrown aside Bellatrix creates havoc as she strides along a tabletop in the Great Hall Harry follows as Snape leads the death eaters and the ashenfaced Draco through the school corridors Snape rushes Draco down the tower's spiral staircase The shape of a skull appears in the dark clouds Bellatrix is jubilant Snape grabs the distraught Draco The whitehaired professor seems to float gently downwards Harry watches in horror as Dumbledore is flung backwards over the balustrade Dumbledore's eyes flicker Bellatrix glares Snape looks eyes with Dumbledore Dumbledore glances down and catches Harry's eye"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Snape looks eyes with Dumbledore Dumbledore glances down and catches Harry's eye Dumbledore's eyes flicker Bellatrix glares The whitehaired professor seems to float gently downwards Harry watches in horror as Dumbledore is flung backwards over the balustrade Bellatrix is jubilant Snape grabs the distraught Draco Snape rushes Draco down the tower's spiral staircase The shape of a skull appears in the dark clouds Bellatrix creates havoc as she strides along a tabletop in the Great Hall Harry follows as Snape leads the death eaters and the ashenfaced Draco through the school corridors Bellatrix aims her wand at the huge windows An Auror is thrown aside Draco Snape and the Death Eaters stride through the forest towards Hagrid's cottage They explode and the candles are snuffed out Bellatrix sets fire to the cottage Harry follows Harry falls Harry aims his wand Illuminated by the flames from the burning cottage Bellatrix licks her lips then saunters away Harry lies on his back on the hillside Snape stands alone Harry staggers forward Snape turns away as Harry gets to his feet Harry crashes to the ground Snape deflects the spell Trembling Snape walks over to him Harry lies motionless on the grassy hillside Harry looks up at Snape who kicks Harry's wand from his hand Harry looks up at the glowering clouds forming the shape of a skull Snape hurries away past the burning cottage below him He pushes past students and teachers Harry strides through the school courtyard followed by Hagrid Harry kneels beside Dumbledore's body Professor McGonagall Hermione Ginny and Ron stand at the front of the crowd The Horcrux He leans forward and gently touches Dumbledore's cheek Ginny walks forward and kneels down beside Harry Harry gently places his hand on Dumbledore's heart A tear rolls down Hermione's cheek He rests his head on her shoulder The tip of it glows as it points up towards the skullshaped cloud Professor McGonagall raises her wand high above her head One after another everyone does the same Pomfrey raises her wand then Luna Griefstricken Wand after wand points upwards the tip of each one glowing like a star Dumbledore lies before them his face serene and peaceful the staff and students stand in solemn silence Harry takes his hand from Dumbledore's heart As the wands glow more brightly light bursts through the clouds and the skull disappears Harry weeps His head on Ginny's shoulder The long tables are bare the seats and benches are empty Sunlight streams in through the damaged window of the Great Hall It too is bathed in sunlight The door of Dumbledore's study opens and Harry steps inside A pair of halfmoon spectacles lies on an open book Harry walks towards Dumbledore's desk"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Harry lies motionless on the grassy hillside Snape hurries away past the burning cottage below him Harry looks up at the glowering clouds forming the shape of a skull Harry strides through the school courtyard followed by Hagrid He pushes past students and teachers Professor McGonagall Hermione Ginny and Ron stand at the front of the crowd Harry kneels beside Dumbledore's body He leans forward and gently touches Dumbledore's cheek The Horcrux Harry gently places his hand on Dumbledore's heart Ginny walks forward and kneels down beside Harry He rests his head on her shoulder A tear rolls down Hermione's cheek Professor McGonagall raises her wand high above her head The tip of it glows as it points up towards the skullshaped cloud Pomfrey raises her wand then Luna One after another everyone does the same Wand after wand points upwards the tip of each one glowing like a star Griefstricken the staff and students stand in solemn silence Dumbledore lies before them his face serene and peaceful As the wands glow more brightly light bursts through the clouds and the skull disappears Harry takes his hand from Dumbledore's heart His head on Ginny's shoulder Harry weeps Sunlight streams in through the damaged window of the Great Hall The long tables are bare the seats and benches are empty The door of Dumbledore's study opens and Harry steps inside It too is bathed in sunlight Harry walks towards Dumbledore's desk A pair of halfmoon spectacles lies on an open book Dumbledore glances down and catches Harry's eye Snape looks eyes with Dumbledore Bellatrix glares Dumbledore's eyes flicker Harry watches in horror as Dumbledore is flung backwards over the balustrade The whitehaired professor seems to float gently downwards Snape grabs the distraught Draco Bellatrix is jubilant The shape of a skull appears in the dark clouds Snape rushes Draco down the tower's spiral staircase Harry follows as Snape leads the death eaters and the ashenfaced Draco through the school corridors Bellatrix creates havoc as she strides along a tabletop in the Great Hall An Auror is thrown aside Bellatrix aims her wand at the huge windows They explode and the candles are snuffed out Draco Snape and the Death Eaters stride through the forest towards Hagrid's cottage Harry follows Bellatrix sets fire to the cottage Harry aims his wand Harry falls Bellatrix licks her lips then saunters away Illuminated by the flames from the burning cottage Snape stands alone Harry lies on his back on the hillside Snape turns away as Harry gets to his feet Harry staggers forward Snape deflects the spell Harry crashes to the ground Snape walks over to him Trembling Harry looks up at Snape who kicks Harry's wand from his hand"
        }
      ]
    }
  ]
}