{
  "ground_truth": "The front door is off its hinges. As they enter the house, Dumbledore holds his wand in his undamaged left hand. The tips of their wands glow like torches. The house is in a mess. Pictures hang at angles. There are scratches on a door frame. Harry and Dumbledore enter the sitting room, where the furniture is toppled over. The room has been completely trashed. As Harry stares down at the paper, a spot of blood drops onto it. Harry looks up. Plaster has broken away, revealing bloodstained rafters. A drop lands on his forehead. Dumbledore wipes the blood off Harry's forehead with a finger, and tastes it with the tip of his tongue. Dumbledore glances suspiciously around the room. He fixes his eyes on an over-stuffed comfy armchair and slowly walks towards it. Harry follows. Dumbledore prods the armchair with his wand. A man in disguise. He spots Harry. Dumbledore sweeps his wand over the room. Bits of broken glass fly towards a shattered chandelier. It re-hangs itself from the ceiling. Harry steps aside, as a vinyl disk returns to a record player. Books fly back onto shelves, and a grand piano rights itself. The missing plaster renews itself on the ceiling, and Harry smiles. He looks down at his feet. Trapped under his trainer is a piece from the chandelier. He raises his foot, and it zooms up to its rightful place. Horace wears pajamas made from upholstery fabric. He grins at Harry. Harry crosses over to a collection of framed, moving photographs. A group of them raise glasses. Dumbledore leaves. Harry glances at Horace Slughorn, then goes out. As they walk down the path, Slughorn comes after them. In the street, Dumbledore holds out his arm. Harry braces himself. Dust rises as they apparate. Alone, Harry lands in a stream. Shaking water from his trainers, he trudges through a reed bed. He smiles when he recognizes the Weasley house. He sees Ginny in an upstairs window. Coming downstairs, Ginny spots Harry's trunk and white owl. On the stairs, Ginny runs to Harry and they hug warmly. As they part, they gaze at each other. Hermione runs up. Ron touches Hermione's cheek. Harry regards Ron and Hermione with interest. Harry, Hermione, and Ron are sitting on the floor, around a tray set on a stool. In a dingy, wet part of town, Draco's mother Narcissa walks along a narrow alley, with Bellatrix Lestrange. They wait for children to cycle past. Then, Narcissa steps out onto a street and knocks at a door. The two women wait outside in the rain. A face peers at them through the glass panel in the door. A round-faced man, Wormtail, lets them into Severus Snape's study.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The front portal is off its hinges. As they enter the abode, Dumbledore grips his wand in his undamaged left hand. The tips of their wands illuminate like beacons. The dwelling is in disarray. Illustrations dangle at angles. There are gouges on a door frame. Harry and Dumbledore enter the sitting chamber, where the furnishings are toppled over. The room has been utterly ransacked. As Harry gazes down at the sheet, a spot of blood drips onto it. Harry glances up. Plaster has fractured away, revealing bloodstained beams. A droplet lands on his forehead. Dumbledore cleans the blood off Harry's forehead with a finger, and tastes it with the tip of his tongue. Dumbledore scans suspiciously around the room. He fixes his eyes on an over-stuffed cozy armchair and slowly strides towards it. Harry follows. Dumbledore pokes the armchair with his wand. A man in disguise. He notices Harry. Dumbledore sweeps his wand over the room. Bits of shattered glass soar towards a broken chandelier. It re-hangs itself from the ceiling. Harry steps aside, as a vinyl disk returns to a record player. Tomes fly back onto shelves, and a grand piano rights itself. The missing plaster renews itself on the ceiling, and Harry smiles. He looks down at his feet. Trapped under his sneaker is a fragment from the chandelier. He raises his foot, and it zooms up to its rightful position. Horace wears pajamas made from upholstery material. He grins at Harry. Harry crosses over to a collection of framed, moving photographs. A cluster of them raise goblets. Dumbledore departs. Harry glances at Horace Slughorn, then exits. As they stroll down the path, Slughorn pursues them. In the street, Dumbledore extends his arm. Harry braces himself. Dust ascends as they apparate. Alone, Harry lands in a stream. Shaking water from his sneakers, he trudges through a reed bed. He smiles when he recognizes the Weasley residence. He sees Ginny in an upstairs window. Descending, Ginny spots Harry's trunk and snowy owl. On the stairs, Ginny runs to Harry and they embrace warmly. As they part, they gaze at each other. Hermione rushes up. Ron touches Hermione's cheek. Harry observes Ron and Hermione with interest. Harry, Hermione, and Ron are sitting on the floor, around a tray set on a stool. In a dingy, wet part of town, Draco's mother Narcissa strolls along a narrow lane, with Bellatrix Lestrange. They wait for youngsters to cycle past. Then, Narcissa steps onto a street and knocks at a door. The two women wait outside in the rain. A face peers at them through the glass panel in the door. A round-faced man, Wormtail, lets them into Severus Snape's study."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The front door has been removed from its hinges. As the house is entered by them, Dumbledore's wand is held in his undamaged left hand. Their wands' tips are glowing like torches. A mess fills the house. Pictures have been hung at angles. Scratches cover a door frame. The sitting room is entered by Harry and Dumbledore, where the furniture has been toppled over. They have completely trashed the room. As the paper is stared at by Harry, a spot of blood is dropped onto it. Harry’s gaze shifts upwards. Plaster had broken away, revealing rafters stained with blood. A drop is landed on his forehead. Harry's forehead is wiped off by Dumbledore with a finger, and he tastes it with the tip of his tongue. Dumbledore's suspicious glance sweeps the room. His eyes are fixed on an over-stuffed comfy armchair as he walks slowly towards it. Harry trails behind. The armchair is prodded by Dumbledore with his wand. A man is disguised. He spots Harry. His wand sweeps the room again. Bits of broken glass are drawn towards a chandelier that was shattered. The chandelier itself is hung from the ceiling once more. Harry steps aside to allow a vinyl disk to return to its record player. Books are sent flying back onto shelves, and a grand piano is righted. The missing plaster is renewed on the ceiling, and Harry smiles. His gaze drops to his feet. A piece from the chandelier is trapped under his trainer. His foot is raised, and it zooms up to its rightful place. Pajamas made from upholstery fabric are worn by Horace. He grins at Harry. Harry crosses over to a collection of framed, moving photographs. Glasses are raised by a group of them. Dumbledore departs. Horace Slughorn is glanced at by Harry, then he goes out. As the path is walked down by them, Slughorn follows them. In the street, his arm is held out by Dumbledore. Harry braces himself. As they apparate, dust is raised. Alone, Harry finds himself landing in a stream. Water is shaken from his trainers as he trudges through a reed bed. When the Weasley house is recognized by him, he smiles. Ginny is seen in an upstairs window by him. Coming downstairs, Harry's trunk and white owl are spotted by Ginny. Ginny runs to Harry on the stairs and they are hugged warmly by each other. As the two part, gazes are exchanged warmly. Hermione runs up. Hermione’s cheek is touched by Ron. Ron and Hermione are regarded with interest by Harry. Harry, Hermione, and Ron are seated on the floor, surrounding a tray set on a stool. In a dingy, wet part of town, Draco’s mother Narcissa is walking along a narrow alley, accompanied by Bellatrix Lestrange. Children on bicycles are waited for by them. Then, Narcissa steps onto a street and a door is knocked at by her. Standing outside in the rain, the two women wait. Through the glass panel, a face peers at them in the door. Wormtail, round-faced, lets them into Severus Snape's study."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The front door is off its hinges. As they enter, Dumbledore holds his wand in his undamaged left hand, with the tips glowing like torches. The house is a mess, with pictures askew and scratches on a door frame. In the sitting room, furniture is overturned, and the room is trashed. As Harry stares at the paper, blood drops onto it. He looks up to see bloodstained rafters, and a drop lands on his forehead. Dumbledore wipes it off and tastes it, then suspiciously eyes an overstuffed armchair, prodding it with his wand. A disguised man spots Harry. Dumbledore sweeps his wand, and broken glass reassembles a chandelier. Harry steps aside as a vinyl disk returns to a record player, books fly back onto shelves, and a grand piano rights itself. Missing plaster renews on the ceiling, and Harry smiles. He lifts his foot, releasing a chandelier piece that zooms to its place. Horace, in upholstery fabric pajamas, grins at Harry. Harry crosses to moving photographs, where a group raises glasses. Dumbledore leaves, and Harry glances at Horace Slughorn before going out. As they walk, Slughorn follows. In the street, Dumbledore holds out his arm, and they apparate. Alone, Harry lands in a stream, shakes water from his trainers, and trudges through reeds, smiling at the Weasley house. He sees Ginny in a window. Ginny spots Harry's trunk and owl, runs to him, and they hug warmly. As they part, they gaze at each other. Hermione runs up, and Ron touches her cheek. Harry watches Ron and Hermione with interest. Harry, Hermione, and Ron sit around a tray on a stool. In a dingy town, Draco's mother Narcissa and Bellatrix Lestrange walk an alley, waiting for children to pass. Narcissa knocks at a door, and they wait in the rain. A face peers through the glass, and Wormtail lets them into Severus Snape's study."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The front door hangs off. Inside, Dumbledore holds his wand in his left hand; both wands glow. The house is messy—pictures tilted, door frame scratched. In the sitting room, furniture lies overturned. As Harry stares at paper, blood drops on it. He looks up to see broken plaster and bloodstained rafters. A drop lands on his head. Dumbledore wipes and tastes it, then scans the room, eyes locking on an overstuffed chair. He approaches, Harry behind. Dumbledore prods it—it's a disguised man. Dumbledore waves his wand; glass flies into a chandelier, rehanging it. A record plays, books shelve themselves, a piano uprights. Plaster repairs the ceiling. Harry grins, lifts his foot from a chandelier shard—it returns in place. Horace, in upholstery pajamas, grins. Harry walks to moving photos; some raise glasses. Dumbledore exits. Harry looks at Slughorn and follows. Outside, Slughorn joins. In the street, Dumbledore extends his arm. Harry braces; dust rises as they apparate. Harry lands in a stream alone, shakes off water, and walks through reeds, smiling at the Weasley house. He sees Ginny upstairs. Spotting Harry’s trunk and owl, she runs to hug him. They part and lock eyes. Hermione runs over. Ron touches her cheek. Harry observes them. The trio sits on the floor, around a tray on a stool. Meanwhile, Narcissa and Bellatrix walk a wet alley. After kids pass, Narcissa knocks on a door. In the rain, they wait. Wormtail peers through a panel and lets them into Snape's study."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The front door of the house is completely off its hinges, hanging awkwardly as if it has been forcibly removed. As they cautiously step into the dimly lit house, Dumbledore holds his wand firmly in his undamaged left hand, ready for anything. The tips of their wands emit a bright glow, illuminating the space like torches in the darkness. The house is in utter disarray, with pictures hanging askew on the walls. There are noticeable scratches marring the surface of a door frame. Harry and Dumbledore proceed into the sitting room, where the furniture is overturned and scattered. The room has been thoroughly ransacked and left in chaos. As Harry gazes down at a piece of paper, a spot of blood suddenly drops onto it. Startled, Harry looks up. The plaster on the ceiling has broken away, exposing bloodstained rafters. Another drop of blood lands on his forehead. Dumbledore gently wipes the blood from Harry's forehead with his finger and tastes it with the tip of his tongue, his eyes scanning the room suspiciously. He focuses intently on an over-stuffed, comfy armchair and slowly approaches it. Harry follows closely behind. Dumbledore prods the armchair with his wand, revealing a man in disguise. The man notices Harry. Dumbledore then sweeps his wand over the room, and bits of broken glass magically fly towards a shattered chandelier, which re-hangs itself from the ceiling. Harry steps aside as a vinyl disk returns to its place on a record player. Books fly back onto their shelves, and a grand piano rights itself with a flourish. The missing plaster on the ceiling renews itself, and Harry smiles with satisfaction. He looks down at his feet and sees a piece from the chandelier trapped under his trainer. He lifts his foot, and the piece zooms up to its rightful place. Horace, wearing pajamas made from upholstery fabric, grins at Harry. Harry crosses over to a collection of framed, moving photographs, where a group of them raise their glasses in a toast. Dumbledore leaves the room, and Harry glances at Horace Slughorn before following him out. As they walk down the path, Slughorn comes after them. In the street, Dumbledore extends his arm. Harry braces himself for the sensation. Dust rises around them as they apparate. Alone, Harry lands in a stream, shaking water from his trainers as he trudges through a reed bed. He smiles with recognition when he sees the Weasley house in the distance. He spots Ginny in an upstairs window. As she comes downstairs, Ginny notices Harry's trunk and his white owl. On the stairs, Ginny runs to Harry, and they embrace warmly. As they part, they gaze into each other's eyes. Hermione runs up to join them, and Ron gently touches Hermione's cheek. Harry observes Ron and Hermione with interest. The three of them—Harry, Hermione, and Ron—are sitting on the floor around a tray set on a stool. Meanwhile, in a dingy, wet part of town, Draco's mother, Narcissa, walks along a narrow alley accompanied by Bellatrix Lestrange. They wait patiently for children to cycle past before Narcissa steps out onto the street and knocks at a door. The two women stand outside in the rain, waiting. A face peers at them through the glass panel in the door. It is a round-faced man, Wormtail, who lets them into Severus Snape's study."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The front door of the house is entirely off its hinges, hanging precariously as though it has been forcibly removed from its rightful place. As they carefully step into the dimly lit house, Dumbledore holds his wand with a firm grip in his undamaged left hand, prepared for any eventuality. The tips of their wands emit a brilliant glow, casting light throughout the space like torches cutting through the darkness. The house is in complete disarray, with pictures hanging askew on the walls, evidence of the previous chaos. There are noticeable scratches that mar the surface of a nearby door frame. Harry and Dumbledore proceed onward into the sitting room, where the furniture is overturned and scattered haphazardly. The room has been thoroughly ransacked and abandoned in a state of utter chaos. As Harry gazes down at a piece of paper clutched in his hand, a single spot of blood suddenly drops onto it from above. Startled by this, Harry looks up. The plaster on the ceiling has broken away, revealing bloodstained rafters. Another drop of blood lands on his forehead. With a gentle touch, Dumbledore wipes the blood from Harry's forehead with his finger and tastes it with the tip of his tongue, his eyes scanning the room with suspicion. His gaze focuses intently on an overstuffed, comfortable-looking armchair, and he slowly approaches it with caution. Harry follows closely behind him. Dumbledore prods the armchair with his wand, revealing a man cleverly disguised. The man takes notice of Harry. Dumbledore then sweeps his wand over the room, and bits of broken glass magically fly toward a shattered chandelier, which re-hangs itself gracefully from the ceiling. Harry steps aside as a vinyl disk smoothly returns to its designated place on a record player. Books fly back to their rightful spots on the shelves, and a grand piano rights itself with a dramatic flourish. The missing plaster on the ceiling renews itself, and Harry smiles with great satisfaction. He looks down at his feet and sees a piece from the chandelier trapped beneath his trainer. As he lifts his foot, the piece zooms up to its rightful place. Horace, wearing pajamas made from upholstery fabric, grins at Harry with amusement. Harry crosses over to a collection of framed, moving photographs, where a group within the frames raises their glasses in a communal toast. Dumbledore leaves the room, and Harry glances at Horace Slughorn one last time before following him out. As they make their way down the path, Slughorn comes after them. In the street, Dumbledore extends his arm. Harry braces himself for the familiar sensation. Dust rises dramatically around them as they apparate. Alone, Harry lands in a stream, shaking water from his trainers as he trudges through a nearby reed bed. He smiles with recognition when he sees the Weasley house standing in the distance. He spots Ginny in an upstairs window. As she comes downstairs, Ginny notices Harry's trunk and his faithful white owl. On the stairs, Ginny runs eagerly to Harry, and they embrace warmly. As they part, they gaze deeply into each other's eyes. Hermione runs up to join them, and Ron gently touches Hermione's cheek with affection. Harry observes Ron and Hermione with keen interest. The three of them—Harry, Hermione, and Ron—are sitting comfortably on the floor around a tray set upon a stool. Meanwhile, in a dingy, wet part of town, Draco's mother, Narcissa, walks along a narrow alley, accompanied by the ever-intimidating Bellatrix Lestrange. They wait patiently for children to cycle past before Narcissa confidently steps out onto the street and knocks at a door. The two women stand outside in the rain, waiting with anticipation. A face peers at them through the glass panel in the door. It is a round-faced man, Wormtail, who lets them inside Severus Snape's study."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The front door, having been removed from its hinges, stands askew as they approach the entrance of the house. As they step inside, Dumbledore, with a steady grip, holds his wand in his undamaged left hand, the tip of which emits a bright glow akin to a torch, illuminating their path. The house is in disarray, with pictures hanging crookedly at odd angles and scratches marring the door frame. Harry and Dumbledore proceed into the sitting room, where they are met with the sight of overturned furniture, evidence of a room that has been thoroughly ransacked. As Harry's gaze falls upon a piece of paper on the floor, a droplet of blood suddenly lands on it, prompting him to look upward. His eyes trace the damage to the ceiling, where plaster has fallen away, exposing rafters stained with blood. Another drop falls, this time landing on Harry's forehead. Dumbledore, with a swift motion, wipes the blood from Harry's forehead using his finger and, with a thoughtful expression, tastes it with the tip of his tongue. His eyes then scan the room with suspicion, eventually fixing on an over-stuffed comfy armchair. He moves towards it with deliberate steps, Harry trailing closely behind. Upon reaching the armchair, Dumbledore prods it with his wand, revealing a man in disguise who immediately notices Harry. Dumbledore then performs a sweeping motion with his wand over the room, causing shards of broken glass to fly towards a shattered chandelier, which reassembles and re-hangs itself from the ceiling. Harry steps aside as a vinyl disk floats back to its place on a record player, books soar back onto their shelves, and a grand piano rights itself. The missing plaster on the ceiling restores itself, prompting a smile from Harry. He glances down at his feet, noticing a piece of the chandelier trapped under his trainer. As he lifts his foot, the piece zooms up to rejoin the chandelier. Horace, dressed in pajamas made from upholstery fabric, grins at Harry, who then crosses over to examine a collection of framed, moving photographs, where a group within raises their glasses in a toast. Dumbledore exits the room, and Harry, after a brief glance at Horace Slughorn, follows him out. As they walk down the path, Slughorn hurries after them. In the street, Dumbledore extends his arm, and Harry braces himself for what is to come. Dust swirls around them as they apparate, and Harry finds himself landing alone in a stream. He shakes the water from his trainers and trudges through a reed bed, his spirits lifting as he recognizes the Weasley house in the distance. He spots Ginny in an upstairs window, and as she descends the stairs, she notices Harry's trunk and white owl. Ginny runs to Harry, and they embrace warmly, their eyes meeting as they part. Hermione approaches at a run, and Ron gently touches Hermione's cheek, prompting Harry to observe Ron and Hermione with interest. The three friends, Harry, Hermione, and Ron, sit on the floor around a tray set on a stool, sharing a moment together. Meanwhile, in a dingy, wet part of town, Draco's mother, Narcissa, walks along a narrow alley accompanied by Bellatrix Lestrange. They pause to let children on bicycles pass by before Narcissa steps onto a street and knocks on a door. The two women stand waiting in the rain until a face peers at them through the glass panel in the door. It is Wormtail, a round-faced man, who opens the door to let them into Severus Snape's study."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The front door is off its hinges as Dumbledore and Harry enter the house, their wand tips glowing like torches. Inside, the house is in disarray, with crooked pictures and scratches on the door frame. In the trashed sitting room, Harry notices blood dripping from the ceiling, which Dumbledore wipes from Harry's forehead and tastes, glancing around suspiciously. Fixing his gaze on an overstuffed armchair, Dumbledore approaches and prods it with his wand, revealing a disguised man who spots Harry. Dumbledore then restores the room with a sweep of his wand, re-hanging the chandelier, returning books to shelves, and repairing the ceiling, which makes Harry smile. Noticing a piece of the chandelier under his foot, Harry lifts it, allowing it to return to its place. Horace, in upholstery fabric pajamas, grins at Harry, who then examines a collection of moving photographs. As Dumbledore leaves, Harry follows, and Slughorn comes after them. In the street, Dumbledore offers his arm to Harry, who braces himself as they apparate. Harry lands alone in a stream, shakes water from his trainers, and smiles upon recognizing the Weasley house. He sees Ginny in an upstairs window, and as she comes downstairs, they share a warm hug and gaze at each other. Hermione arrives, and Ron touches her cheek, prompting Harry to observe them with interest. The trio sits around a tray on a stool. Meanwhile, in a dingy part of town, Narcissa Malfoy and Bellatrix Lestrange walk through a narrow alley, waiting for children to pass before knocking on a door. In the rain, they are let into Severus Snape's study by Wormtail."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The front door is off its hinges, a likely sign of a forced entry, suggesting recent chaos. As they enter the house, Dumbledore, the esteemed headmaster of Hogwarts School of Witchcraft and Wizardry known for his immense magical skill, holds his wand in his undamaged left hand. The tips of their wands glow like torches, illuminating the path in front with a magical luminescence. The house is in a mess, a testament to a recent struggle. Pictures, depicting happier times, hang at angles. There are scratches on a door frame, indicative of a hasty exit or entrance. Harry and Dumbledore enter the sitting room, where the furniture is toppled over, echoing the sounds of a violent upheaval. The room has been completely trashed. As Harry stares down at the paper, a spot of blood, a stark reminder of violence, drops onto it. Harry looks up. Plaster has broken away, revealing bloodstained rafters that speak of a sinister past event. A drop lands on his forehead. Dumbledore, ever the curious scholar of the dark arts, wipes the blood off Harry's forehead with a finger, and tastes it with the tip of his tongue. Dumbledore glances suspiciously around the room. He fixes his eyes on an over-stuffed comfy armchair, reminiscent of a bygone era, and slowly walks towards it. Harry follows. Dumbledore prods the armchair with his wand, revealing a man in disguise. He spots Harry. Dumbledore sweeps his wand over the room gracefully. Bits of broken glass fly towards a shattered chandelier, a delicate piece that once adorned the ceiling. It re-hangs itself from the ceiling. Harry steps aside, as a vinyl disk returns to a record player, symbolizing the restoration of order. Books fly back onto shelves, and a grand piano rights itself, its polished surface reflecting the room. The missing plaster renews itself on the ceiling, and Harry smiles, appreciating the magic. He looks down at his feet. Trapped under his trainer is a piece from the chandelier. He raises his foot, and it zooms up to its rightful place. Horace wears pajamas made from upholstery fabric, an unusual choice that adds to his eccentric charm. He grins at Harry. Harry crosses over to a collection of framed, moving photographs, a common magical artifact in the wizarding world. A group of them raise glasses, caught forever in a moment of celebration. Dumbledore leaves. Harry glances at Horace Slughorn, a former potions master with a penchant for collecting talented students, then goes out. As they walk down the path, Slughorn comes after them. In the street, Dumbledore holds out his arm. Harry braces himself for the disorienting sensation. Dust rises as they apparate, a form of magical teleportation. Alone, Harry lands in a stream. Shaking water from his trainers, he trudges through a reed bed. He smiles when he recognizes the Weasley house, known as The Burrow, a place of warmth and love. He sees Ginny in an upstairs window. Coming downstairs, Ginny spots Harry's trunk and white owl, Hedwig, a loyal companion. On the stairs, Ginny runs to Harry and they hug warmly, a testament to their growing bond. As they part, they gaze at each other. Hermione runs up, her usual bushy hair an unmistakable trademark. Ron touches Hermione's cheek, a rare display of affection. Harry regards Ron and Hermione with interest, noting the subtle dynamics. Harry, Hermione, and Ron are sitting on the floor, around a tray set on a stool, sharing a moment of camaraderie. In a dingy, wet part of town reminiscent of the less desirable areas of London, Draco's mother Narcissa walks along a narrow alley, with Bellatrix Lestrange, her fanatically loyal sister. They wait for children to cycle past. Then, Narcissa steps out onto a street and knocks at a door. The two women wait outside in the rain. A face peers at them through the glass panel in the door. A round-faced man, Wormtail, a traitorous servant to Voldemort, lets them into Severus Snape's study, which serves as a fortress of secrecy."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The front door is off its hinges. As they enter the house Dumbledore holds his wand in his undamaged left hand. The tips of their wands glow like torches. The house is in a mess. Pictures hang at angles. There are scratches on a door frame. Harry and Dumbledore enter the sitting room where the furniture is toppled over. The room has been completely trashed. As Harry stares down at the paper a spot of blood drops onto it. Harry looks up. Plaster has broken away revealing bloodstained rafters. A drop lands on his forehead. Dumbledore wipes the blood off Harry's forehead with a finger and tastes it with the tip of his tongue. Dumbledore glances suspiciously around the room. He fixes his eyes on an overstuffed comfy armchair and slowly walks towards it. Harry follows. Dumbledore prods the armchair with his wand. A man in disguise. He spots Harry. Dumbledore sweeps his wand over the room. Bits of broken glass fly towards a shattered chandelier. It rehangs itself from the ceiling. Harry steps aside as a vinyl disk returns to a record player. Books fly back onto shelves and a grand piano rights itself. The missing plaster renews itself on the ceiling and Harry smiles. He looks down at his feet. Trapped under his trainer is a piece from the chandelier. He raises his foot and it zooms up to its rightful place. Horace wears pajamas made from upholstery fabric. He grins at Harry. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. Harry crosses over to a collection of framed moving photographs. A group of them raise glasses. Dumbledore leaves. Harry glances at Horace. Slughorn then goes out. As they walk down the path Slughorn comes after them. In the street Dumbledore holds out his arm. Harry braces himself. Dust rises as they apparate. Alone. Harry lands in a stream. Shaking water from his trainers he trudges through a reed bed. He smiles when he recognizes the Weasley house. He sees Ginny in an upstairs window. Coming downstairs Ginny spots Harry's trunk and white owl. On the stairs Ginny runs to Harry and they hug warmly. As they part they gaze at each other. Hermione runs up. Ron touches Hermione's cheek. Harry regards Ron and Hermione with interest. Harry Hermione and Ron are sitting on the floor around a tray set on a stool. In a dingy wet part of town. Draco's mother. Narcissa walks along a narrow alley with Bellatrix Lestrange. They wait for children to cycle past. Then Narcissa steps out onto a street and knocks at a door. The two women wait outside in the rain. A face peers at them through the glass panel in the door. A roundfaced man. Wormtail let us them into Severus. Snape's study."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The front door is off its hinges. As they enter the house Dumbledore holds his wand in his undamaged left hand. The tips of their wands glow like torches. The house is in a mess. Pictures hang at angles. There are scratches on a door frame. Harry and Dumbledore enter the sitting room where the furniture is toppled over. The room has been completely trashed. As Harry stares down at the paper a spot of blood drops onto it. Harry looks up. Plaster has broken away revealing bloodstained rafters. A drop lands on his forehead. Dumbledore wipes the blood off Harry's forehead with a finger and tastes it with the tip of his tongue. Dumbledore glances suspiciously around the room. He fixes his eyes on an overstuffed comfy armchair and slowly walks towards it. Harry follows. Dumbledore prods the armchair with his wand. A man in disguise. He spots Harry. Dumbledore sweeps his wand over the room. Bits of broken glass fly towards a shattered chandelier. It rehangs itself from the ceiling. Harry steps aside as a vinyl disk returns to a record player. Books fly back onto shelves and a grand piano rights itself. The missing plaster renews itself on the ceiling and Harry smiles. He looks down at his feet. Trapped under his trainer is a piece from the chandelier. He raises his foot and it zooms up to its rightful place. Horace wears pajamas made from upholstery fabric. He grins at Harry. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Harry crosses over to a collection of framed moving photographs. A group of them raise glasses. Dumbledore leaves. Harry glances at Horace. Slughorn then goes out. As they walk down the path Slughorn comes after them. In the street Dumbledore holds out his arm. Harry braces himself. Dust rises as they apparate. Alone. Harry lands in a stream. Shaking water from his trainers he trudges through a reed bed. He smiles when he recognizes the Weasley house. He sees Ginny in an upstairs window. Coming downstairs Ginny spots Harry's trunk and white owl. On the stairs Ginny runs to Harry and they hug warmly. As they part they gaze at each other. Hermione runs up. Ron touches Hermione's cheek. Harry regards Ron and Hermione with interest. Harry Hermione and Ron are sitting on the floor around a tray set on a stool. In a dingy wet part of town. Draco's mother. Narcissa walks along a narrow alley with Bellatrix Lestrange. They wait for children to cycle past. Then Narcissa steps out onto a street and knocks at a door. The two women wait outside in the rain. A face peers at them through the glass panel in the door. A roundfaced man. Wormtail let us them into Severus. Snape's study."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The front door is off its hinges. As they enter the house Dumbledore holds his wand in his undamaged left hand. The tips of their wands glow like torches. The house is in a mess. Pictures hang at angles. There are scratches on a door frame. Harry and Dumbledore enter the sitting room where the furniture is toppled over. The room has been completely trashed. As Harry stares down at the paper a spot of blood drops onto it. Harry looks up. Plaster has broken away revealing bloodstained rafters. A drop lands on his forehead. Dumbledore wipes the blood off Harry's forehead with a finger and tastes it with the tip of his tongue. Dumbledore glances suspiciously around the room. He fixes his eyes on an overstuffed comfy armchair and slowly walks towards it. On the stairs Ginny runs to Harry and they hug warmly. As they part they gaze at each other. Hermione runs up. Ron touches Hermione's cheek. Harry regards Ron and Hermione with interest. Harry Hermione and Ron are sitting on the floor around a tray set on a stool. In a dingy wet part of town. Draco's mother. Narcissa walks along a narrow alley with Bellatrix Lestrange. They wait for children to cycle past. Then Narcissa steps out onto a street and knocks at a door. The two women wait outside in the rain. A face peers at them through the glass panel in the door. A roundfaced man. Wormtail let us them into Severus. Snape's study."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The front door is off its hinges. As they enter the house Dumbledore holds his wand in his undamaged left hand. The tips of their wands glow like torches. The house is in a mess. Pictures hang at angles. There are scratches on a door frame. They wait for children to cycle past. Then Narcissa steps out onto a street and knocks at a door. The two women wait outside in the rain. A face peers at them through the glass panel in the door. A roundfaced man. Wormtail let us them into Severus. Snape's study."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The garden gate is off its hinges. As they creep into the barn, Gandalf grips his staff in his uninjured right hand. The ends of their staffs shimmer like lanterns. The barn is in disarray. Posters tilt at angles. There are marks on a window frame. Frodo and Gandalf enter the dining area, where the tables are overturned. The place has been thoroughly ransacked. As Frodo gawks down at the map, a drop of ink drips onto it. Frodo glances up. Wallpaper has peeled away, uncovering inky beams. A splash lands on his nose. Gandalf brushes the ink off Frodo's nose with a feather, and samples it with the tip of his finger. Gandalf peers warily around the area. He fixes his gaze on an over-cushioned rocking chair and slowly shuffles towards it. Frodo trails behind. Gandalf nudges the chair with his staff. A woman in disguise. She notices Frodo. Gandalf swings his staff over the area. Shards of shattered pottery fly towards a broken vase. It reassembles itself on the mantel. Frodo steps aside, as a cassette tape returns to a stereo. Magazines flutter back onto tables, and a large harp realigns itself. The missing wallpaper restores itself on the wall, and Frodo grins. He glances down at his boots. Stuck under his sandal is a shard from the vase. He lifts his foot, and it zips up to its rightful place. Horace sports overalls made from curtain fabric. He smirks at Frodo. Frodo strolls over to a cluster of framed, animated sketches. A troupe of them clink mugs. Gandalf departs. Frodo peeks at Horace Slughorn, then wanders out. As they tread down the lane, Slughorn rushes after them. On the boulevard, Gandalf extends his staff. Frodo steadies himself. Mist rises as they teleport. Isolated, Frodo lands in a meadow. Shaking grass from his sandals, he plods through a field of blossoms. He grins when he recognizes the Burrow. He glimpses Luna in an attic window. Descending the stairs, Luna notices Frodo's suitcase and gray parrot. On the staircase, Luna dashes to Frodo and they embrace cheerfully. As they separate, they gaze at one another. Sam rushes up. Pippin taps Sam's shoulder. Frodo observes Pippin and Sam with curiosity. Frodo, Sam, and Pippin are lounging on the floor, around a platter perched on a crate. In a grimy, dry part of the city, Sam's cousin Narcissa wanders along a narrow passage, with Bellatrix Black. They linger for birds to fly past. Then, Narcissa strides out onto a boulevard and taps at a gate. The two people linger outside in the storm. A mask peers at them through the mesh panel in the gate. A square-faced woman, Wormtail, sneaks them into Radagast's office."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The front door is off its hinges as Dumbledore and Harry enter, their wands glowing like torches. The house is in disarray, with bloodstains on the rafters. Dumbledore wipes blood off Harry's forehead and examines it. Suspicious, he approaches an armchair, revealing a disguised man. Dumbledore uses magic to restore the room, impressing Harry. Horace, in pajama-like upholstery, greets Harry. As Dumbledore leaves, Harry follows. Outside, Dumbledore and Harry apparate away, landing separately. Harry joyfully trudges through a stream, recognizing the Weasley house. He reunites with Ginny warmly, and they share a moment. Hermione and Ron join, sharing a connection. Meanwhile, Narcissa and Bellatrix wait in a rainy alley, knocking on Snape's study door, where Wormtail admits them."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Snape's study Wormtail lets them into Severus  A roundfaced man  A face peers at them through the glass panel in the door  The two women wait outside in the rain  Then Narcissa steps out onto a street and knocks at a door  They wait for children to cycle past  Narcissa walks along a narrow alley with Bellatrix Lestrange  Draco's mother  In a dingy wet part of town  Harry Hermione and Ron are sitting on the floor around a tray set on a stool  Harry regards Ron and Hermione with interest  Ron touches Hermione's cheek  Hermione runs up  As they part they gaze at each other  On the stairs Ginny runs to Harry and they hug warmly  Coming downstairs Ginny spots Harry's trunk and white owl  He sees Ginny in an upstairs window  He smiles when he recognizes the Weasley house  Shaking water from his trainers he trudges through a reed bed  Harry lands in a stream  Alone  Dust rises as they apparate  Harry braces himself  In the street Dumbledore holds out his arm  As they walk down the path Slughorn comes after them  Slughorn then goes out  Harry glances at Horace  Dumbledore leaves  A group of them raise glasses  Harry crosses over to a collection of framed moving photographs  He grins at Harry  Horace wears pajamas made from upholstery fabric  He raises his foot and it zooms up to its rightful place  Trapped under his trainer is a piece from the chandelier  He looks down at his feet  The missing plaster renews itself on the ceiling and Harry smiles  Books fly back onto shelves and a grand piano rights itself  Harry steps aside as a vinyl disk returns to a record player  It rehangs itself from the ceiling  Bits of broken glass fly towards a shattered chandelier  Dumbledore sweeps his wand over the room  He spots Harry  A man in disguise  Dumbledore prods the armchair with his wand  Harry follows  He fixes his eyes on an overstuffed comfy armchair and slowly walks towards it  Dumbledore glances suspiciously around the room  Dumbledore wipes the blood off Harry's forehead with a finger and tastes it with the tip of his tongue  A drop lands on his forehead  Plaster has broken away revealing bloodstained rafters  Harry looks up  As Harry stares down at the paper a spot of blood drops onto it  The room has been completely trashed  Harry and Dumbledore enter the sitting room where the furniture is toppled over  There are scratches on a door frame  Pictures hang at angles  The house is in a mess  The tips of their wands glow like torches  As they enter the house Dumbledore holds his wand in his undamaged left hand  The front door is off its hinges "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "As they enter the house Dumbledore holds his wand in his undamaged left hand The front door is off its hinges The house is in a mess The tips of their wands glow like torches There are scratches on a door frame Pictures hang at angles The room has been completely trashed Harry and Dumbledore enter the sitting room where the furniture is toppled over Harry looks up As Harry stares down at the paper a spot of blood drops onto it A drop lands on his forehead Plaster has broken away revealing bloodstained rafters Dumbledore glances suspiciously around the room Dumbledore wipes the blood off Harry's forehead with a finger and tastes it with the tip of his tongue Harry follows He fixes his eyes on an overstuffed comfy armchair and slowly walks towards it A man in disguise Dumbledore prods the armchair with his wand Dumbledore sweeps his wand over the room He spots Harry It rehangs itself from the ceiling Bits of broken glass fly towards a shattered chandelier Books fly back onto shelves and a grand piano rights itself Harry steps aside as a vinyl disk returns to a record player He looks down at his feet The missing plaster renews itself on the ceiling and Harry smiles He raises his foot and it zooms up to its rightful place Trapped under his trainer is a piece from the chandelier He grins at Harry Horace wears pajamas made from upholstery fabric A group of them raise glasses Harry crosses over to a collection of framed moving photographs Harry glances at Horace Dumbledore leaves As they walk down the path Slughorn comes after them Slughorn then goes out Harry braces himself In the street Dumbledore holds out his arm Alone Dust rises as they apparate Shaking water from his trainers he trudges through a reed bed Harry lands in a stream He sees Ginny in an upstairs window He smiles when he recognizes the Weasley house On the stairs Ginny runs to Harry and they hug warmly Coming downstairs Ginny spots Harry's trunk and white owl Hermione runs up As they part they gaze at each other Harry regards Ron and Hermione with interest Ron touches Hermione's cheek In a dingy wet part of town Harry Hermione and Ron are sitting on the floor around a tray set on a stool Narcissa walks along a narrow alley with Bellatrix Lestrange Draco's mother Then Narcissa steps out onto a street and knocks at a door They wait for children to cycle past A face peers at them through the glass panel in the door The two women wait outside in the rain Wormtail let us them into Severus A roundfaced man Snape's study"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A group of them raise glasses  Dumbledore leaves  Harry glances at Horace  Slughorn then goes out  As they walk down the path Slughorn comes after them  In the street Dumbledore holds out his arm  Harry braces himself  Dust rises as they apparate  Alone  Harry lands in a stream  Shaking water from his trainers he trudges through a reed bed  He smiles when he recognizes the Weasley house  He sees Ginny in an upstairs window  Coming downstairs Ginny spots Harry's trunk and white owl  On the stairs Ginny runs to Harry and they hug warmly  As they part they gaze at each other  Hermione runs up  Ron touches Hermione's cheek  Harry regards Ron and Hermione with interest  Harry Hermione and Ron are sitting on the floor around a tray set on a stool  In a dingy wet part of town  Draco's mother  Narcissa walks along a narrow alley with Bellatrix Lestrange  They wait for children to cycle past  Then Narcissa steps out onto a street and knocks at a door  The two women wait outside in the rain  A face peers at them through the glass panel in the door  A roundfaced man  Wormtail lets them into Severus  Snape's study The front door is off its hinges  As they enter the house Dumbledore holds his wand in his undamaged left hand  The tips of their wands glow like torches  The house is in a mess  Pictures hang at angles  There are scratches on a door frame  Harry and Dumbledore enter the sitting room where the furniture is toppled over  The room has been completely trashed  As Harry stares down at the paper a spot of blood drops onto it  Harry looks up  Plaster has broken away revealing bloodstained rafters  A drop lands on his forehead  Dumbledore wipes the blood off Harry's forehead with a finger and tastes it with the tip of his tongue  Dumbledore glances suspiciously around the room  He fixes his eyes on an overstuffed comfy armchair and slowly walks towards it  Harry follows  Dumbledore prods the armchair with his wand  A man in disguise  He spots Harry  Dumbledore sweeps his wand over the room  Bits of broken glass fly towards a shattered chandelier  It rehangs itself from the ceiling  Harry steps aside as a vinyl disk returns to a record player  Books fly back onto shelves and a grand piano rights itself  The missing plaster renews itself on the ceiling and Harry smiles  He looks down at his feet  Trapped under his trainer is a piece from the chandelier  He raises his foot and it zooms up to its rightful place  Horace wears pajamas made from upholstery fabric  He grins at Harry  Harry crosses over to a collection of framed moving photographs "
        }
      ]
    }
  ]
}