{
  "ground_truth": "Ricky walks into view, and Lester drapes his arm around Ricky as he gives him the money; from the waist up, Lester looks naked. Ricky, with wet hair from the rain, puts the cash in his pocket while Lester's arm remains draped around his shoulder. Grinning, Ricky squats down and reaches under the weight bench as Lester sits in the bowl chair, leans back with his hands behind his head, and watches Ricky roll the joint. From the Colonel's point of view, Lester leans back in his chair, and we can only see Ricky's back and shoulders as he rolls the joint, causing the Colonel's face to tighten. After a moment, Lester's jaw drops, and he throws his head back, making it appear as though Ricky is giving him a blow job from our perspective; the Colonel watches incredulously. Then, as we hear a car approaching, the Colonel glances over to see Angela's BMW pulling into the driveway, stopping behind Lester's Firebird. As Angela and Jane get out and run toward the house, our focus moves back to the garage window, where Ricky stands, looking a little panicked, as Lester pulls on his T-shirt and both he and Ricky cross out of view. Jane and Angela enter, with Jane frowning when she sees Lester, who leans nonchalantly against the counter, trying to remain cool and doing so successfully. Jane rolls her eyes and exits, while Angela walks over to Lester, placing her hand on his arm flirtatiously and looking up at him with a smile to intimidate him, but something has changed and he isn't intimidated. He looks directly at her, leans in, and smiles slowly, speaking in a low and intense voice, causing her to move away, suddenly insecure, and she heads out quickly with Lester watching her go, baffled. Ricky enters, wet from the pouring rain, crosses to his bureau, and pulls the wad of cash out of his pocket; he turns, startled, as the Colonel steps out of the shadows. The Colonel backhands Ricky so hard it sends him sprawling, but he gets up and eyes the Colonel, realizing he's discovered a way to break free from his father, incredulous at its simplicity. Ricky grabs his backpack, turns, and walks out the door, leaving the Colonel standing there, glassy-eyed and breathing heavily. Ricky enters another room to find Barbara standing in the middle, clutching a dish and looking frightened, having obviously heard his argument with his father; she looks into his eyes, aware something eventful is happening. He kisses her cheek softly, then exits through the back door, leaving her standing alone, still clutching her dish. From the Colonel's point of view, below him, Ricky dashes through the rain to the Burnhams' front door and knocks.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Ricky strolls into sight, and Lester drapes his limb around Ricky as he gives him the currency; from the waist up, Lester appears nude. Ricky, with damp hair from the storm, places the money in his pocket while Lester's limb remains draped around his shoulder. Smiling, Ricky crouches down and reaches beneath the weight bench as Lester sits in the bowl chair, reclines with his hands behind his head, and observes Ricky roll the joint. From the Colonel's perspective, Lester reclines in his chair, and we can only see Ricky's back and shoulders as he rolls the joint, causing the Colonel's visage to tighten. After a moment, Lester's jaw drops, and he throws his head back, making it appear as though Ricky is giving him a blow job from our viewpoint; the Colonel watches incredulously. Then, as we hear an automobile approaching, the Colonel glances over to see Angela's BMW pulling into the driveway, halting behind Lester's Firebird. As Angela and Jane exit and dash toward the house, our focus shifts back to the garage window, where Ricky stands, appearing a little anxious, as Lester pulls on his T-shirt and both he and Ricky move out of sight. Jane and Angela enter, with Jane frowning when she sees Lester, who leans casually against the counter, attempting to remain cool and doing so effectively. Jane rolls her eyes and leaves, while Angela walks over to Lester, placing her hand on his arm flirtatiously and looking up at him with a grin to intimidate him, but something has altered and he isn't intimidated. He looks directly at her, leans in, and smiles slowly, speaking in a low and intense voice, causing her to move away, suddenly insecure, and she heads out quickly with Lester watching her go, confused. Ricky enters, soaked from the pouring rain, crosses to his dresser, and pulls the bunch of cash out of his pocket; he turns, startled, as the Colonel steps out of the shadows. The Colonel backhands Ricky so forcefully it sends him sprawling, but he rises and eyes the Colonel, realizing he's discovered a way to break free from his father, amazed at its simplicity. Ricky grabs his backpack, turns, and walks out the door, leaving the Colonel standing there, glassy-eyed and breathing heavily. Ricky enters another room to find Barbara standing in the middle, clutching a dish and looking frightened, having evidently heard his argument with his father; she looks into his eyes, aware something significant is happening. He kisses her cheek softly, then exits through the back door, leaving her standing alone, still clutching her dish. From the Colonel's viewpoint, below him, Ricky dashes through the rain to the Burnhams' front door and knocks."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Ricky is seen walking into view, and his arm is draped by Lester around Ricky as the money is given to him by Lester; from the waist up, Lester appears naked. With wet hair from the rain, the cash is placed in his pocket by Ricky while Lester's arm remains draped around his shoulder. Grinning, Ricky is squatting down and reaching under the weight bench as Lester, who sits in the bowl chair, leans back with his hands behind his head and watches Ricky roll the joint. From the Colonel's point of view, Lester is seen leaning back in his chair, and only Ricky's back and shoulders can be seen as the joint is rolled by him, which causes the Colonel's face to tighten. After a moment, Lester's jaw is dropped by him and his head is thrown back, making it appear as though he is receiving a blow job from Ricky from our perspective; the Colonel watches incredulously. Then, as a car is heard approaching, the Colonel glances over and sees Angela's BMW pulling into the driveway, stopping behind Lester's Firebird. Angela and Jane are getting out and running toward the house, as our focus is moved back to the garage window where Ricky stands, looking a little panicked, as Lester pulls on his T-shirt, and both he and Ricky are crossed out of view. Jane and Angela enter, with Lester leaned nonchalantly against the counter, trying to remain cool, doing so successfully as Jane frowns upon seeing him. Jane rolls her eyes and exits, while Angela walks over to Lester, places her hand on his arm flirtatiously, and looks up at him with a smile intending to intimidate him, but something has been changed and intimidation is not felt by him. He is looking directly at her, leaning in and slowly smiling, speaking in a low and intense voice, which causes her to move away, suddenly insecure, and she quickly heads out with Lester watching her, baffled. Wet from the pouring rain, Ricky enters, crosses to his bureau, and the wad of cash is pulled out of his pocket by him; startled, he turns as the Colonel steps out of the shadows. Ricky is backhanded so hard by the Colonel it sends him sprawling, but he gets up and eyes the Colonel, realizing a simple way to break free from his father has been discovered, incredulous at its simplicity. Ricky grabs his backpack, turns, and the door is walked out by him, leaving the Colonel standing there, glassy-eyed and breathing heavily. Ricky enters another room to find Barbara standing in the middle, clutching a dish and looking frightened, having obviously heard his argument with his father; she looks into his eyes, aware something eventful is happening. Her cheek is softly kissed by him, then the back door is exited through by him, leaving her standing alone, still clutching her dish. From the Colonel's point of view, below him, Ricky is seen dashing through the rain to the Burnhams' front door and knocking on it."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Ricky enters, and Lester, appearing shirtless from the waist up, drapes an arm around him while giving him money. Ricky, with wet hair, pockets the cash as Lester watches him roll a joint. From the Colonel's view, Lester leans back, and only Ricky's back is visible, causing the Colonel's face to tighten. Lester's jaw drops, making it seem like Ricky is performing a sexual act, which the Colonel watches incredulously. A car approaches, and the Colonel sees Angela's BMW stop behind Lester's Firebird. Angela and Jane run toward the house, and Ricky looks panicked as Lester puts on a T-shirt, and they move out of view. Jane frowns at Lester, who leans coolly against the counter. Jane exits, and Angela flirts with Lester, but he isn't intimidated. He leans in, speaks intensely, and she retreats, leaving him baffled. Ricky, wet from rain, retrieves cash from his pocket, startled as the Colonel emerges. The Colonel backhands Ricky, who realizes he can break free from his father. Ricky grabs his backpack and leaves, with the Colonel standing, glassy-eyed. Ricky finds Barbara, frightened, and kisses her cheek before exiting. From the Colonel's view, Ricky runs through the rain to the Burnhams' door and knocks."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Ricky enters, and Lester, appearing shirtless, drapes an arm around him while giving him money. Ricky, with wet hair, pockets the cash. Grinning, he squats to roll a joint as Lester relaxes in a chair, watching. From the Colonel's view, it seems Ricky is performing a sexual act on Lester, causing the Colonel's face to tighten. Hearing a car, the Colonel sees Angela's BMW arrive. Angela and Jane run inside, and Ricky, looking panicked, exits with Lester. Jane frowns at Lester, who remains cool, and exits. Angela flirts with Lester, but he responds confidently, unsettling her. She leaves quickly, and Lester watches, confused. Ricky, wet from rain, retrieves cash from his pocket, startled by the Colonel, who hits him. Ricky realizes he can break free from his father, grabs his backpack, and leaves. He finds Barbara, frightened, kisses her cheek, and exits. From the Colonel's view, Ricky runs through the rain to the Burnhams' door and knocks."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Ricky confidently strides into view, and Lester casually drapes his arm around Ricky's shoulders as he hands him the money; from the waist up, Lester appears to be naked. Ricky, with his hair still damp from the rain, carefully places the cash into his pocket while Lester's arm remains comfortably draped around him. With a grin on his face, Ricky squats down and reaches beneath the weight bench, while Lester settles into the bowl chair, leaning back with his hands clasped behind his head, watching intently as Ricky skillfully rolls the joint. From the Colonel's perspective, Lester is seen reclining in his chair, and only Ricky's back and shoulders are visible as he rolls the joint, causing the Colonel's expression to tighten with suspicion. After a brief moment, Lester's jaw drops dramatically, and he throws his head back, creating the illusion that Ricky is performing a sexual act on him from our viewpoint; the Colonel observes this scene with incredulity. Then, as the sound of an approaching car becomes audible, the Colonel glances over to see Angela's BMW pulling into the driveway, coming to a stop behind Lester's Firebird. As Angela and Jane exit the car and hurry toward the house, our attention shifts back to the garage window, where Ricky stands, appearing slightly panicked, as Lester hurriedly pulls on his T-shirt, and both he and Ricky move out of sight. Jane and Angela enter the house, with Jane frowning upon seeing Lester, who leans casually against the counter, maintaining an air of coolness with apparent ease. Jane rolls her eyes in exasperation and exits, while Angela approaches Lester, placing her hand flirtatiously on his arm and looking up at him with a smile intended to intimidate him, but something has shifted, and he is no longer intimidated. He meets her gaze directly, leans in closer, and smiles slowly, speaking in a low, intense voice, which causes her to retreat, suddenly feeling insecure, and she quickly heads out, with Lester watching her departure, baffled by the change. Ricky enters, drenched from the relentless rain, crosses to his bureau, and retrieves the wad of cash from his pocket; he turns, startled, as the Colonel emerges from the shadows. The Colonel strikes Ricky with a backhand so forceful that it sends him sprawling, but Ricky rises to his feet and looks at the Colonel, realizing he has discovered a simple way to break free from his father's control, incredulous at its simplicity. Ricky grabs his backpack, turns, and walks out the door, leaving the Colonel standing there, glassy-eyed and breathing heavily. Ricky enters another room to find Barbara standing in the middle, clutching a dish and looking frightened, having clearly overheard his argument with his father; she gazes into his eyes, aware that something significant is unfolding. He kisses her cheek softly, then exits through the back door, leaving her standing alone, still clutching her dish. From the Colonel's vantage point, below him, Ricky is seen dashing through the rain to the Burnhams' front door, where he knocks."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Ricky strides confidently into view with an air of assurance, while Lester casually drapes his arm around Ricky's shoulders in a familiar manner as he hands over the money. From the waist up, Lester appears to be without any shirt or top. Ricky, with his hair still somewhat damp from the persistent rain, carefully and methodically tucks the cash away into his pocket, all the while feeling Lester's arm comfortably resting on him. With an easy grin spreading across his face, Ricky then squats down and reaches underneath the weight bench. Meanwhile, Lester settles himself into the bowl chair, leaning back in a relaxed manner, his hands clasped behind his head, all the while watching intently as Ricky skillfully rolls the joint. From the Colonel's perspective, Lester is seen reclining casually in his chair, with only Ricky's back and shoulders visible as he concentrates on rolling the joint. This sight causes the Colonel's expression to tighten with suspicion and concern. After a brief moment, Lester's jaw drops dramatically, and he throws his head back, creating the misleading illusion that Ricky is performing a sexual act on him from our viewpoint. The Colonel observes this scene with bewilderment and incredulity. Just then, the distinct sound of an approaching car becomes audible, prompting the Colonel to glance over and see Angela's BMW pulling smoothly into the driveway and coming to a stop directly behind Lester's Firebird. As Angela and Jane exit the car and hurry efficiently toward the house, our attention shifts back to the garage window, where Ricky stands, appearing slightly panicked. Simultaneously, Lester hurriedly pulls on his T-shirt, and both he and Ricky move quickly out of sight. As Jane and Angela make their way into the house, Jane frowns with displeasure upon seeing Lester, who leans casually against the counter, exuding an air of coolness with apparent ease. Jane rolls her eyes in exasperation and exits the room, while Angela approaches Lester, placing her hand flirtatiously on his arm and looking up at him with a smile intended to intimidate him. However, something within him has shifted, and he is no longer intimidated. He meets her gaze directly, leans in closer, and smiles slowly, speaking in a low, intense voice that causes her to retreat abruptly, suddenly feeling insecure. She quickly heads out, leaving Lester to watch her departure with a sense of bafflement at the unexpected change. Ricky enters, drenched from the relentless rain, walks over to his bureau, and retrieves the wad of cash from his pocket. He turns, startled, as the Colonel emerges ominously from the shadows. The Colonel strikes Ricky with a backhand so forceful and swift that it sends him sprawling to the ground, but Ricky rises defiantly to his feet, looking at the Colonel with a sudden realization that he has discovered a simple way to break free from his father's control, incredulous at its simplicity. Ricky then grabs his backpack, turns, and walks out the door with determination, leaving the Colonel standing there, glassy-eyed and breathing heavily. Ricky enters another room to find Barbara standing in the center, clutching a dish and looking frightened, having clearly overheard his heated argument with his father. She gazes into his eyes, aware that something significant and transformative is unfolding. He kisses her gently on the cheek, then exits through the back door, leaving her standing alone, still clutching her dish. From the Colonel's vantage point, below him, Ricky is seen dashing through the pouring rain to the Burnhams' front door, where he knocks purposefully."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Ricky steps into view, and Lester casually drapes his arm around Ricky's shoulders while handing him some money; from the waist up, Lester appears to be naked. Ricky, with his hair still wet from the rain, carefully tucks the cash into his pocket, all the while feeling the weight of Lester's arm resting on him. With a grin spreading across his face, Ricky lowers himself into a squat and reaches beneath the weight bench, while Lester settles into the bowl chair, leaning back comfortably with his hands clasped behind his head, his eyes fixed on Ricky as he begins to roll a joint. From the Colonel's perspective, Lester is seen reclining in his chair, and only Ricky's back and shoulders are visible as he concentrates on rolling the joint, a sight that causes the Colonel's face to tighten with disapproval. After a brief moment, Lester's jaw drops dramatically, and he throws his head back, creating an illusion from the Colonel's viewpoint that Ricky is performing an inappropriate act, which the Colonel watches with disbelief. Suddenly, the sound of an approaching car draws the Colonel's attention, and he turns to see Angela's BMW pulling into the driveway, coming to a stop behind Lester's Firebird. As Angela and Jane quickly exit the car and dash toward the house, the focus shifts back to the garage window, where Ricky stands, appearing slightly panicked, as Lester hurriedly pulls on his T-shirt, and both he and Ricky move out of sight. Jane and Angela enter the house, with Jane casting a disapproving frown at Lester, who leans casually against the counter, exuding an air of coolness and successfully maintaining his composure. Jane rolls her eyes in exasperation and leaves the room, while Angela approaches Lester, placing her hand flirtatiously on his arm and looking up at him with a smile intended to intimidate him, but something has shifted, and he no longer feels intimidated. He meets her gaze directly, leans in closer, and smiles slowly, speaking in a low, intense voice that causes her to retreat, suddenly feeling insecure, and she quickly exits with Lester watching her departure, puzzled. Ricky enters, drenched from the pouring rain, and crosses to his bureau, retrieving the wad of cash from his pocket; he turns abruptly, startled, as the Colonel emerges from the shadows. The Colonel strikes Ricky with a backhand so forceful that it sends him sprawling, but Ricky rises to his feet, meeting the Colonel's gaze with a newfound realization that he has discovered a simple way to break free from his father's control. Incredulous at the ease of this revelation, Ricky grabs his backpack, turns, and walks out the door, leaving the Colonel standing there, glassy-eyed and breathing heavily. Ricky enters another room to find Barbara standing in the center, clutching a dish and looking frightened, having clearly overheard his confrontation with his father; she gazes into his eyes, sensing that something significant is unfolding. He kisses her cheek softly, then exits through the back door, leaving her standing alone, still holding her dish. From the Colonel's vantage point, Ricky is seen below, dashing through the rain to the Burnhams' front door, where he knocks."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Ricky enters the scene, and Lester, appearing shirtless from the waist up, drapes an arm around him while handing over some money. Ricky, with rain-soaked hair, pockets the cash as Lester keeps his arm around him. Grinning, Ricky squats to roll a joint under the weight bench, while Lester relaxes in a bowl chair, watching him. From the Colonel's perspective, Lester's posture and Ricky's actions create a misleading impression, causing the Colonel to react with disbelief. As a car approaches, the Colonel notices Angela's BMW arriving and parking behind Lester's Firebird. Angela and Jane rush toward the house, shifting the focus back to the garage, where Ricky appears anxious as Lester puts on a T-shirt, and they both leave the scene. Inside, Jane frowns at Lester, who leans casually against the counter, maintaining his composure. Jane rolls her eyes and exits, while Angela approaches Lester flirtatiously, but he remains unfazed, responding with a confident smile and intense words that unsettle her, prompting her to leave quickly. Lester watches her departure, puzzled. Ricky, drenched from the rain, retrieves cash from his pocket at his bureau, startled by the Colonel emerging from the shadows. The Colonel strikes Ricky, who rises with newfound resolve, realizing a path to independence from his father. Ricky grabs his backpack and exits, leaving the Colonel stunned. Entering another room, Ricky finds Barbara, visibly shaken by the earlier confrontation. He gently kisses her cheek and leaves through the back door, while she remains, clutching a dish. From the Colonel's viewpoint, Ricky is seen running through the rain to the Burnhams' front door, where he knocks."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Ricky, known for his quick wit and recent string of small-time hustles in the neighborhood, walks into view, and Lester drapes his arm around Ricky as he gives him the money; from the waist up, Lester looks naked, a common sight since he's known for his casual at-home attire. Ricky, with wet hair from the rain that has been pouring since morning, puts the cash in his pocket while Lester's arm remains draped around his shoulder. Grinning, Ricky squats down and reaches under the weight bench, one of the few pieces of equipment Lester keeps in his garage-turned-hangout, as Lester sits in the bowl chair, leans back with his hands behind his head, and watches Ricky roll the joint, a routine they've repeated many times. From the Colonel's point of view, a man known for his strict military background and disapproval of such activities, Lester leans back in his chair, and we can only see Ricky's back and shoulders as he rolls the joint, causing the Colonel's face to tighten with tension. After a moment, Lester's jaw drops, and he throws his head back, making it appear as though Ricky is giving him a blow job from our perspective; the Colonel watches incredulously, his conservative values clashing with the scene before him. Then, as we hear a car approaching, the Colonel glances over to see Angela's BMW pulling into the driveway, stopping behind Lester's Firebird, a classic car he takes pride in restoring. As Angela and Jane get out and run toward the house, our focus moves back to the garage window, where Ricky stands, looking a little panicked, as Lester pulls on his T-shirt and both he and Ricky cross out of view. Jane and Angela enter, with Jane frowning when she sees Lester, who leans nonchalantly against the counter, trying to remain cool and doing so successfully, an ability he honed from years of maintaining a carefree facade. Jane rolls her eyes and exits, while Angela walks over to Lester, placing her hand on his arm flirtatiously, utilizing her well-known charm to intimidate him, but something has changed, and he isn't intimidated. He looks directly at her, leans in, and smiles slowly, speaking in a low and intense voice, causing her to move away, suddenly insecure, and she heads out quickly with Lester watching her go, baffled by the exchange. Ricky enters, wet from the pouring rain, crosses to his bureau, and pulls the wad of cash out of his pocket; he turns, startled, as the Colonel steps out of the shadows, a tactic he's used to discipline Ricky in the past. The Colonel backhands Ricky so hard it sends him sprawling, but he gets up and eyes the Colonel, realizing he's discovered a way to break free from his father, incredulous at its simplicity. Ricky grabs his backpack, a well-worn item always ready for such decisive moments, turns, and walks out the door, leaving the Colonel standing there, glassy-eyed and breathing heavily as his authority visibly crumbles. Ricky enters another room to find Barbara standing in the middle, the Colonel's wife, clutching a dish and looking frightened, having obviously heard his argument with his father; she looks into his eyes, aware something eventful is happening that might alter their lives. He kisses her cheek softly, then exits through the back door, leaving her standing alone, still clutching her dish with a mix of sadness and understanding. From the Colonel's point of view, below him, Ricky dashes through the rain to the Burnhams' front door, their neighbors known for their troubled yet seemingly perfect family, and knocks."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Ricky walks into view and Lester drapes his arm around Ricky as he gives him the money from the waist up  Lester looks naked  Ricky with wet hair from the rain puts the cash in his pocket while Lester's arm remains draped around his shoulder  As Angela and Jane get out and run toward the house our focus moves back to the garage window where Ricky stands looking a little panicked as Lester pulls on his Tshirt and both he and Ricky cross out of view  Jane and Angela enter with Jane frowning when she sees Lester who leans nonchalantly against the counter trying to remain cool and doing so successfully  Jane rolls her eyes and exits while Angela walks over to Lester placing her hand on his arm flirtatiously and looking up at him with a smile to intimidate him but something has changed and he isn't intimidated  He looks directly at her leans in and smiles slowly speaking in a low and intense voice causing her to move away suddenly insecure and she heads out quickly with Lester watching her go baffled  Ricky enters wet from the pouring rain crosses to his bureau and pulls the wad of cash out of his pocket  he turns startled as the Colonel steps out of the shadows  The Colonel backhands Ricky so hard it sends him sprawling but he gets up and eyes the Colonel realizing he's discovered a way to break free from his father  incredulous at its simplicity Ricky grabs his backpack turns and walks out the door leaving the Colonel standing there glassyeyed and breathing heavily  Ricky enters another room to find Barbara standing in the middle clutching a dish and looking frightened having obviously heard his argument with his father  she looks into his eyes aware something eventful is happening  He kisses her cheek softly then exits through the back door leaving her standing alone still clutching her dish  From the Colonel's point of view below him  Grinning  Ricky squats down and reaches under the weight bench  as Lester sits in the bowl chair leans back with his hands behind his head and watches Ricky roll the joint  From the Colonel's point of view Lester leans back in his chair and we can only see Ricky's back and shoulders as he rolls the joint causing the Colonel's face to tighten  After a moment Lester's jaw drops and he throws his head back making it appear as though Ricky is giving him a blow job  from our perspective the Colonel watches incredulously  Then as we hear a car approaching the Colonel glances over to see Angela's BMW pulling into the driveway stopping behind Lester's Firebird  As Angela and Jane get out and run toward the house our focus moves back to the garage window where Ricky stands looking a little panicked as Lester pulls on his Tshirt and both he and Ricky cross out of view  Jane and Angela enter with Jane frowning when she sees Lester who leans nonchalantly against the counter trying to remain cool and doing so successfully  Jane rolls her eyes and exits while Angela walks over to Lester placing her hand on his arm flirtatiously and looking up at him with a smile to intimidate him but something has changed and he isn't intimidated  He looks directly at her leans in and smiles slowly speaking in a low and intense voice causing her to move away suddenly insecure and she heads out quickly with Lester watching her go baffled  Ricky enters wet from the pouring rain crosses to his bureau and pulls the wad of cash out of his pocket  he turns startled as the Colonel steps out of the shadows  The Colonel backhands Ricky so hard it sends him sprawling but he gets up and eyes the Colonel realizing he's discovered a way to break free from his father  incredulous at its simplicity Ricky grabs his backpack turns and walks out the door leaving the Colonel standing there glassyeyed and breathing heavily  Ricky enters another room to find Barbara standing in the middle clutching a dish and looking frightened having obviously heard his argument with his father  she looks into his eyes aware something eventful is happening  He kisses her cheek softly then exits through the back door leaving her standing alone still clutching her dish  From the Colonel's point of view below him  Ricky dashes through the rain to the Burnhams' front door and knocks"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Ricky walks into view and Lester drapes his arm around Ricky as he gives him the money from the waist up. Lester looks naked. Ricky with wet hair from the rain puts the cash in his pocket while Lester's arm remains draped around his shoulder. Grinning. Ricky squats down and reaches under the weight bench. as Lester sits in the bowl chair leans back with his hands behind his head and watches Ricky roll the joint. From the Colonel's point of view Lester leans back in his chair and we can only see Ricky's back and shoulders as he rolls the joint causing the Colonel's face to tighten. After a moment Lester's jaw drops and he throws his head back making it appear as though Ricky is giving him a blow job. from our perspective the Colonel watches incredulously. Then as we hear a car approaching the Colonel glances over to see Angela's BMW pulling into the driveway stopping behind Lester's Firebird. As Angela and Jane get out and run toward the house our focus moves back to the garage window where Ricky stands looking a little panicked as Lester pulls on his Tshirt and both he and Ricky cross out of view. Jane and Angela enter with Jane frowning when she sees Lester who leans nonchalantly against the counter trying to remain cool and doing so successfully. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Jane rolls her eyes and exits while Angela walks over to Lester placing her hand on his arm flirtatiously and looking up at him with a smile to intimidate him but something has changed and he is not intimidated. He looks directly at her leans in and smiles slowly speaking in a low and intense voice causing her to move away suddenly insecure and she heads out quickly with Lester watching her go baffled. Ricky enters wet from the pouring rain crosses to his bureau and pulls the wad of cash out of his pocket. he turns startled as the Colonel steps out of the shadows. The Colonel backhands Ricky so hard it sends him sprawling but he gets up and eyes the Colonel realizing he is discovered a way to break free from his father. incredulous at its simplicity. Ricky grabs his backpack turns and walks out the door leaving the Colonel standing there glassyeyed and breathing heavily. Ricky enters another room to find Barbara standing in the middle clutching a dish and looking frightened having obviously heard his argument with his father. she looks into his eyes aware something eventful is happening. He kisses her cheek softly then exits through the back door leaving her standing alone still clutching her dish. From the Colonel's point of view below him. Ricky dashes through the rain to the Burnhams' front door and knocks."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Ricky walks into view and Lester drapes his arm around Ricky as he gives him the money from the waist up. Lester looks naked. Ricky with wet hair from the rain puts the cash in his pocket while Lester's arm remains draped around his shoulder. Grinning. Ricky squats down and reaches under the weight bench. as Lester sits in the bowl chair leans back with his hands behind his head and watches Ricky roll the joint. From the Colonel's point of view Lester leans back in his chair and we can only see Ricky's back and shoulders as he rolls the joint causing the Colonel's face to tighten. After a moment Lester's jaw drops and he throws his head back making it appear as though Ricky is giving him a blow job. from our perspective the Colonel watches incredulously. Then as we hear a car approaching the Colonel glances over to see Angela's BMW pulling into the driveway stopping behind Lester's Firebird. As Angela and Jane get out and run toward the house our focus moves back to the garage window where Ricky stands looking a little panicked as Lester pulls on his Tshirt and both he and Ricky cross out of view. Jane and Angela enter with Jane frowning when she sees Lester who leans nonchalantly against the counter trying to remain cool and doing so successfully. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Jane rolls her eyes and exits while Angela walks over to Lester placing her hand on his arm flirtatiously and looking up at him with a smile to intimidate him but something has changed and he is not intimidated. He looks directly at her leans in and smiles slowly speaking in a low and intense voice causing her to move away suddenly insecure and she heads out quickly with Lester watching her go baffled. Ricky enters wet from the pouring rain crosses to his bureau and pulls the wad of cash out of his pocket. he turns startled as the Colonel steps out of the shadows. The Colonel backhands Ricky so hard it sends him sprawling but he gets up and eyes the Colonel realizing he is discovered a way to break free from his father. incredulous at its simplicity. Ricky grabs his backpack turns and walks out the door leaving the Colonel standing there glassyeyed and breathing heavily. Ricky enters another room to find Barbara standing in the middle clutching a dish and looking frightened having obviously heard his argument with his father. she looks into his eyes aware something eventful is happening. He kisses her cheek softly then exits through the back door leaving her standing alone still clutching her dish. From the Colonel's point of view below him. Ricky dashes through the rain to the Burnhams' front door and knocks."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Ricky walks into view and Lester drapes his arm around Ricky as he gives him the money from the waist up. Lester looks naked. Ricky with wet hair from the rain puts the cash in his pocket while Lester's arm remains draped around his shoulder. Grinning. Ricky squats down and reaches under the weight bench. as Lester sits in the bowl chair leans back with his hands behind his head and watches Ricky roll the joint. Ricky grabs his backpack turns and walks out the door leaving the Colonel standing there glassyeyed and breathing heavily. Ricky enters another room to find Barbara standing in the middle clutching a dish and looking frightened having obviously heard his argument with his father. she looks into his eyes aware something eventful is happening. He kisses her cheek softly then exits through the back door leaving her standing alone still clutching her dish. From the Colonel's point of view below him. Ricky dashes through the rain to the Burnhams' front door and knocks."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Ricky walks into view and Lester drapes his arm around Ricky as he gives him the money from the waist up. Lester looks naked. Ricky with wet hair from the rain puts the cash in his pocket while Lester's arm remains draped around his shoulder. From the Colonel's point of view below him. Ricky dashes through the rain to the Burnhams' front door and knocks."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat walks into view, and the dog drapes its arm around the cat as it gives the cat the money; from the waist up, the dog looks naked. The cat, with wet hair from the rain, puts the cash in its pocket while the dog's arm remains draped around its shoulder. Grinning, the cat squats down and reaches under the weight bench as the dog sits in the bowl chair, leans back with its hands behind its head, and watches the cat roll the joint. From the bird's point of view, the dog leans back in its chair, and we can only see the cat's back and shoulders as it rolls the joint, causing the bird's face to tighten. After a moment, the dog's jaw drops, and it throws its head back, making it appear as though the cat is giving it a blow job from our perspective; the bird watches incredulously. Then, as we hear a car approaching, the bird glances over to see the raccoon's BMW pulling into the driveway, stopping behind the dog's Firebird. As the raccoon and the rabbit get out and run toward the house, our focus moves back to the garage window, where the cat stands, looking a little panicked, as the dog pulls on its T-shirt and both the cat and the dog cross out of view. The rabbit and the raccoon enter, with the rabbit frowning when it sees the dog, who leans nonchalantly against the counter, trying to remain cool and doing so successfully. The rabbit rolls its eyes and exits, while the raccoon walks over to the dog, placing its hand on the dog's arm flirtatiously and looking up at it with a smile to intimidate it, but something has changed and the dog isn't intimidated. It looks directly at the raccoon, leans in, and smiles slowly, speaking in a low and intense voice, causing the raccoon to move away, suddenly insecure, and it heads out quickly with the dog watching it go, baffled. The cat enters, wet from the pouring rain, crosses to its bureau, and pulls the wad of cash out of its pocket; it turns, startled, as the bird steps out of the shadows. The bird backhands the cat so hard it sends the cat sprawling, but the cat gets up and eyes the bird, realizing it's discovered a way to break free from its father, incredulous at its simplicity. The cat grabs its backpack, turns, and walks out the door, leaving the bird standing there, glassy-eyed and breathing heavily. The cat enters another room to find the dolphin standing in the middle, clutching a dish and looking frightened, having obviously heard its argument with its father; it looks into the cat's eyes, aware something eventful is happening. The cat kisses the dolphin's cheek softly, then exits through the back door, leaving the dolphin standing alone, still clutching its dish. From the bird's point of view, below it, the cat dashes through the rain to the Burnhams' front door and knocks."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Ricky walks into view, and Lester drapes his arm around Ricky as he gives him the tickets; from the waist up, Lester looks naked. Ricky, with soaked hair from the waterfall, puts the tickets in his jacket while Lester's arm remains draped around his shoulder. Grinning, Ricky squats down and reaches under the pool table as Lester sits in the hammock chair, leans back with his hands behind his head, and watches Ricky roll the scroll. From the Colonel's point of view, Lester leans back in his chair, and we can only see Ricky's back and shoulders as he rolls the scroll, causing the Colonel's face to tighten. After a moment, Lester's jaw drops, and he throws his head back, making it appear as though Ricky is giving him a foot massage from our perspective; the Colonel watches incredulously. Then, as we hear a train approaching, the Colonel glances over to see Angela's motorcycle pulling into the alley, stopping behind Lester's skateboard. As Angela and Jane get out and run toward the cottage, our focus moves back to the basement window, where Ricky stands, looking a little panicked, as Lester pulls on his hoodie and both he and Ricky cross out of view. Jane and Angela enter, with Jane frowning when she sees Lester, who leans nonchalantly against the bookshelf, trying to remain cool and doing so successfully. Jane rolls her eyes and exits, while Angela walks over to Lester, placing her hand on his arm flirtatiously and looking up at him with a smile to intimidate him, but something has changed, and he isn't intimidated. He looks directly at her, leans in, and smiles slowly, speaking in a low and intense voice, causing her to move away, suddenly insecure, and she heads out quickly with Lester watching her go, baffled. Ricky enters, drenched from the cascading waterfall, crosses to his dresser, and pulls the stack of letters out of his jacket; he turns, startled, as the Colonel steps out of the shadows. The Colonel backhands Ricky so hard it sends him sprawling, but he gets up and eyes the Colonel, realizing he's discovered a way to break free from his father, incredulous at its simplicity. Ricky grabs his suitcase, turns, and walks out the door, leaving the Colonel standing there, glassy-eyed and breathing heavily. Ricky enters another room to find Barbara standing in the middle, clutching a vase and looking frightened, having obviously heard his argument with his father; she looks into his eyes, aware something eventful is happening. He kisses her hand softly, then exits through the side door, leaving her standing alone, still clutching her vase. From the Colonel's point of view, below him, Ricky dashes through the waterfall to the Burnhams' front porch and knocks."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Ricky shuffles into view, and Lester tosses his arm around Ricky as he hands him the money; from the waist up, Lester appears unclothed. Ricky, with wet hair from the rain, slides the cash into his pocket while Lester's arm remains tossed around his shoulder. Grinning, Ricky crouches down and probes under the weight bench as Lester lounges in the bowl chair, stretches back with his hands behind his head, and observes Ricky assemble the joint. From the Colonel's point of view, Lester stretches back in his chair, and we can only see Ricky's back and shoulders as he assembles the joint, causing the Colonel's face to harden. After a moment, Lester's jaw widens, and he pitches his head back, making it appear as though Ricky is giving him a haircut from our perspective; the Colonel observes incredulously. Then, as we hear a car approaching, the Colonel peeks over to see Angela's BMW gliding into the driveway, halting behind Lester's Firebird. As Angela and Jane step out and dash toward the house, our focus shifts back to the garage window, where Ricky stands, looking a little alarmed, as Lester tugs on his T-shirt and both he and Ricky slip out of view. Jane and Angela enter, with Jane scowling when she sees Lester, who rests casually against the counter, trying to remain composed and doing so seamlessly. Jane sighs and departs, while Angela strolls over to Lester, placing her hand on his arm teasingly and looking up at him with a grin to rattle him, but something has altered and he isn't rattled. He gazes directly at her, leans in, and grins slowly, speaking in a low and intense voice, causing her to drift away, suddenly uncertain, and she heads out swiftly with Lester observing her departure, puzzled. Ricky enters, soaked from the heavy rain, moves to his bureau, and pulls the bundle of cash out of his pocket; he turns, astonished, as the Colonel emerges from the shadows. The Colonel slaps Ricky so hard it sends him skidding, but he rises and eyes the Colonel, realizing he's uncovered a way to liberate himself from his father, astonished at its simplicity. Ricky snatches his backpack, spins, and strides out the door, leaving the Colonel standing there, misty-eyed and breathing deeply. Ricky enters another room to find Barbara standing in the center, gripping a dish and looking fearful, having evidently heard his confrontation with his father; she gazes into his eyes, aware something momentous is unfolding. He pecks her cheek softly, then departs through the back door, leaving her standing alone, still gripping her dish. From the Colonel's point of view, below him, Ricky darts through the rain to the Burnhams' front door and taps."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The toaster walks into view, and the shoelace drapes its branch around the toaster as it gives it the envelope; from the waist up, the shoelace looks naked. The toaster, with wet fur from the mist, puts the coins in its satchel while the shoelace's branch remains draped around its antenna. Grinning, the toaster squats down and reaches under the bookshelf as the shoelace sits in the cereal box, leans back with its paws behind its head, and watches the toaster roll the dice. From the penguin's point of view, the shoelace leans back in its box, and we can only see the toaster's tail and fins as it rolls the dice, causing the penguin's beak to tighten. After a moment, the shoelace's jaw drops, and it throws its head back, making it appear as though the toaster is giving it a blow dry from our perspective; the penguin watches incredulously. Then, as we hear a bicycle approaching, the penguin glances over to see the cactus's roller skates pulling into the driveway, stopping behind the shoelace's skateboard. As the cactus and the tea kettle get out and run toward the tent, our focus moves back to the shed window, where the toaster stands, looking a little panicked, as the shoelace pulls on its sweater and both it and the toaster cross out of view. The tea kettle and the cactus enter, with the tea kettle frowning when it sees the shoelace, who leans nonchalantly against the oven, trying to remain cool and doing so successfully. The tea kettle rolls its eyes and exits, while the cactus walks over to the shoelace, placing its leaf on its branch flirtatiously and looking up at it with a smile to intimidate it, but something has changed and it isn't intimidated. It looks directly at it, leans in, and smiles slowly, speaking in a low and intense voice, causing it to move away, suddenly insecure, and it heads out quickly with the shoelace watching it go, baffled. The toaster enters, wet from the misty haze, crosses to its cupboard, and pulls the pile of pebbles out of its satchel; it turns, startled, as the penguin steps out of the foliage. The penguin backhands the toaster so hard it sends it sprawling, but it gets up and eyes the penguin, realizing it's discovered a way to break free from its parent, incredulous at its simplicity. The toaster grabs its suitcase, turns, and walks out the flap, leaving the penguin standing there, glassy-eyed and breathing heavily. The toaster enters another alcove to find the llama standing in the center, clutching a lantern and looking frightened, having obviously heard its argument with its parent; it looks into its eyes, aware something eventful is happening. It kisses its cheek softly, then exits through the trapdoor, leaving it standing alone, still clutching its lantern. From the penguin's point of view, below it, the toaster dashes through the mist to the zebras' front gate and knocks."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Tom strolls into view, and Sam drapes his leg around Tom as he hands him the map; from the waist up, Sam looks disguised. Tom, with dry hair from the sun, places the map in his backpack while Sam's leg remains draped around his shoulder. Grinning, Tom kneels down and reaches under the picnic table as Sam reclines in the hammock, stretches with his arms over his head, and observes Tom sketch the painting. From the General's point of view, Sam stretches in his hammock, and we can only see Tom's back and shoulders as he sketches the painting, prompting the General's face to furrow. After a moment, Sam's mouth opens, and he tilts his head back, making it appear as though Tom is whispering something from our perspective; the General observes skeptically. Then, as we hear a train approaching, the General peers over to see Sally's Mustang parking in the driveway, coming to a halt behind Sam's Thunderbird. As Sally and Jillian jump out and dash toward the house, our focus shifts back to the garage window, where Tom stands, looking slightly alarmed, as Sam pulls on his jacket and both he and Tom slip out of view. Jillian and Sally enter, with Jillian scowling when she sees Sam, who lounges casually against the table, attempting to remain cool and succeeding. Jillian sighs and exits, while Sally steps over to Sam, resting her head on his shoulder flirtatiously and gazing up at him with a grin to challenge him, but something has shifted and he isn't challenged. He gazes directly at her, draws closer, and grins slowly, speaking in a soft and profound tone, causing her to step back, suddenly unsure, and she departs swiftly with Sam observing her leave, puzzled. Tom enters, dry from the scorching sun, moves to his dresser, and pulls the pile of maps out of his backpack; he turns, surprised, as the General steps out of the shadows. The General shoves Tom so hard it sends him stumbling, but he recovers and observes the General, realizing he's discovered a method to free himself from his father, astonished by its simplicity. Tom grabs his suitcase, pivots, and strides out the door, leaving the General standing there, wide-eyed and breathing deeply. Tom enters another room to find Mary standing in the middle, clutching a vase and looking nervous, having evidently overheard his dispute with his father; she gazes into his eyes, aware something significant is occurring. He kisses her forehead gently, then departs through the side door, leaving her standing alone, still clutching her vase. From the General's point of view, below him, Tom races through the sun to the Joness' front door and knocks."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Ricky glides into view, and Lester drapes his scarf around Ricky as he hands him the keys; from the waist up, Lester looks clothed. Ricky, with dry hair from the wind, places the keys in his shoe while Lester's scarf remains draped around his shoulder. Beaming, Ricky lounges and reaches under the dining table as Lester rests in the bean bag, leans forward with his hands on his knees, and watches Ricky juggle the oranges. From the Colonel's point of view, Lester leans forward in his seat, and we can only see Ricky's head and arms as he juggles the oranges, causing the Colonel's face to soften. After a moment, Lester's jaw closes, and he tosses his head forward, making it appear as though Ricky is mending his shoe from our perspective; the Colonel watches curiously. Then, as we hear a train approaching, the Colonel glances over to see Angela's bicycle pulling into the driveway, stopping behind Lester's motorcycle. As Angela and Jane get out and race toward the house, our focus moves back to the kitchen window, where Ricky stands, looking a little amused, as Lester puts on his jacket and both he and Ricky drift out of view. Jane and Angela enter, with Jane smiling when she sees Lester, who leans casually against the wall, trying to remain aloof and doing so unsuccessfully. Jane rolls her eyes and exits, while Angela strolls over to Lester, placing her hat on his hand teasingly and looking up at him with a frown to amuse him, but something has changed and he isn't amused. He looks directly at her, leans back, and frowns slowly, speaking in a high and cheerful voice, causing her to move closer, suddenly confident, and she heads out slowly with Lester watching her go, puzzled. Ricky enters, dry from the gentle breeze, crosses to his sofa, and pulls the wad of keys out of his shoe; he turns, startled, as the Colonel steps out of the curtains. The Colonel hugs Ricky so hard it sends him spinning, but he steadies himself and eyes the Colonel, realizing he's discovered a way to connect with his father, astonished at its elegance. Ricky grabs his suitcase, turns, and dances out the door, leaving the Colonel standing there, wide-eyed and smiling softly. Ricky enters another room to find Barbara sitting in the corner, hugging a pillow and looking amused, having obviously sensed his union with his father; she looks into his eyes, aware something momentous is happening. He shakes her hand firmly, then slips through the front door, leaving her standing alone, still hugging her pillow. From the Colonel's point of view, above him, Ricky skips through the breeze to the Burnhams' front gate and waves."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Tina strolls into sight, and Oliver hangs his scarf around Tina as he hands her the keys; from the knees up, Oliver appears clothed. Tina, with dry shoes from the storm, tucks the keys in her bag while Oliver's scarf stays hung around her neck. Smiling, Tina crouches and retrieves an item under the garden bench as Oliver lounges in the hammock chair, leans forward with his elbows on his knees, and observes Tina paint the sculpture. From the Teacher's point of view, Oliver leans forward in his chair, and we can only glimpse Tina's hair and neck as she paints the sculpture, causing the Teacher's eyes to narrow. After a breath, Oliver's eyes widen, and he shakes his head, making it seem as though Tina is braiding his hair from our angle; the Teacher observes skeptically. Then, as we hear a bike pedaling, the Teacher shifts his gaze to see Lucy's Audi parking in the alley, pausing beside Oliver's Mustang. As Lucy and Emma hop out and sprint toward the porch, our attention returns to the garage doorway, where Tina stands, appearing slightly anxious, as Oliver slips on his jacket, and both she and Oliver step out of sight. Emma and Lucy arrive, with Emma scowling when she spots Oliver, who lounges casually against the cupboard, attempting to stay composed and manages to do so effectively. Emma sighs and departs, while Lucy wanders over to Oliver, resting her hand on his shoulder teasingly and glancing up at him with a grin to unsettle him, but something has shifted, and he isn't unsettled. He gazes directly at her, draws near, and grins quietly, speaking in a soft and serious tone, prompting her to step back, suddenly uncertain, and she leaves promptly with Oliver watching her depart, puzzled. Tina arrives, moist from the deluge, heads to her dresser, and extracts the bundle of keys from her bag; she pivots, surprised, as the Teacher emerges from the shadows. The Teacher slaps Tina so lightly it makes her stagger, but she rises and gazes at the Teacher, realizing she's uncovered a method to free herself from her uncle, astonished by its ease. Tina snatches her suitcase, spins, and exits the doorway, leaving the Teacher standing there, wide-eyed and breathing softly. Tina steps into another space to find Clara standing in the corner, holding a fork and appearing startled, having evidently overheard her dispute with her uncle; she gazes into her eyes, conscious something significant is unfolding. She pecks her cheek gently, then exits through the side exit, leaving her standing solo, still holding her fork. From the Teacher's perspective, beneath him, Tina dashes through the storm to the Smiths' side door and rings."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ricky enters, wet from the rain, and receives money from Lester, who appears shirtless. As Ricky rolls a joint, the Colonel watches suspiciously, misconstruing their interaction. Angela and Jane arrive, prompting a subtly confident confrontation between Lester and Angela, who subsequently leaves, unsettled. Ricky takes cash from his pocket, startled when the Colonel emerges. After being slapped by his father, Ricky realizes he can break free from him. He packs his backpack and exits, leaving the Colonel behind. Encountering his mother, Barbara, looking frightened, Ricky kisses her cheek softly and leaves through the back door. The Colonel watches as Ricky runs through the rain to the Burnhams' front door and knocks."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ricky dashes through the rain to the Burnhams' front door and knocks From the Colonel's point of view below him  He kisses her cheek softly then exits through the back door leaving her standing alone still clutching her dish  she looks into his eyes aware something eventful is happening  Ricky enters another room to find Barbara standing in the middle clutching a dish and looking frightened having obviously heard his argument with his father  incredulous at its simplicity Ricky grabs his backpack turns and walks out the door leaving the Colonel standing there glassyeyed and breathing heavily  The Colonel backhands Ricky so hard it sends him sprawling but he gets up and eyes the Colonel realizing he's discovered a way to break free from his father  he turns startled as the Colonel steps out of the shadows  Ricky enters wet from the pouring rain crosses to his bureau and pulls the wad of cash out of his pocket  He looks directly at her leans in and smiles slowly speaking in a low and intense voice causing her to move away suddenly insecure and she heads out quickly with Lester watching her go baffled  Jane rolls her eyes and exits while Angela walks over to Lester placing her hand on his arm flirtatiously and looking up at him with a smile to intimidate him but something has changed and he isn't intimidated  Jane and Angela enter with Jane frowning when she sees Lester who leans nonchalantly against the counter trying to remain cool and doing so successfully  As Angela and Jane get out and run toward the house our focus moves back to the garage window where Ricky stands looking a little panicked as Lester pulls on his Tshirt and both he and Ricky cross out of view  Then as we hear a car approaching the Colonel glances over to see Angela's BMW pulling into the driveway stopping behind Lester's Firebird  from our perspective the Colonel watches incredulously  After a moment Lester's jaw drops and he throws his head back making it appear as though Ricky is giving him a blow job  From the Colonel's point of view Lester leans back in his chair and we can only see Ricky's back and shoulders as he rolls the joint causing the Colonel's face to tighten  as Lester sits in the bowl chair leans back with his hands behind his head and watches Ricky roll the joint  Ricky squats down and reaches under the weight bench  Grinning  Ricky with wet hair from the rain puts the cash in his pocket while Lester's arm remains draped around his shoulder  Lester looks naked  Ricky walks into view and Lester drapes his arm around Ricky as he gives him the money from the waist up "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "incredulous at its simplicity Ricky grabs his backpack turns and walks out the door leaving the Colonel standing there glassyeyed and breathing heavily  After a moment Lester's jaw drops and he throws his head back making it appear as though Ricky is giving him a blow job  she looks into his eyes aware something eventful is happening  Jane and Angela enter with Jane frowning when she sees Lester who leans nonchalantly against the counter trying to remain cool and doing so successfully  Ricky squats down and reaches under the weight bench  he turns startled as the Colonel steps out of the shadows  Ricky dashes through the rain to the Burnhams' front door and knocks Then as we hear a car approaching the Colonel glances over to see Angela's BMW pulling into the driveway stopping behind Lester's Firebird  From the Colonel's point of view Lester leans back in his chair and we can only see Ricky's back and shoulders as he rolls the joint causing the Colonel's face to tighten  The Colonel backhands Ricky so hard it sends him sprawling but he gets up and eyes the Colonel realizing he's discovered a way to break free from his father  Lester looks naked  From the Colonel's point of view below him  Jane rolls her eyes and exits while Angela walks over to Lester placing her hand on his arm flirtatiously and looking up at him with a smile to intimidate him but something has changed and he isn't intimidated  Grinning  Ricky with wet hair from the rain puts the cash in his pocket while Lester's arm remains draped around his shoulder  He kisses her cheek softly then exits through the back door leaving her standing alone still clutching her dish  As Angela and Jane get out and run toward the house our focus moves back to the garage window where Ricky stands looking a little panicked as Lester pulls on his Tshirt and both he and Ricky cross out of view  He looks directly at her leans in and smiles slowly speaking in a low and intense voice causing her to move away suddenly insecure and she heads out quickly with Lester watching her go baffled  as Lester sits in the bowl chair leans back with his hands behind his head and watches Ricky roll the joint  Ricky walks into view and Lester drapes his arm around Ricky as he gives him the money from the waist up  from our perspective the Colonel watches incredulously  Ricky enters another room to find Barbara standing in the middle clutching a dish and looking frightened having obviously heard his argument with his father  Ricky enters wet from the pouring rain crosses to his bureau and pulls the wad of cash out of his pocket "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Jane rolls her eyes and exits while Angela walks over to Lester placing her hand on his arm flirtatiously and looking up at him with a smile to intimidate him but something has changed and he isn't intimidated  He looks directly at her leans in and smiles slowly speaking in a low and intense voice causing her to move away suddenly insecure and she heads out quickly with Lester watching her go baffled  Ricky enters wet from the pouring rain crosses to his bureau and pulls the wad of cash out of his pocket  he turns startled as the Colonel steps out of the shadows  The Colonel backhands Ricky so hard it sends him sprawling but he gets up and eyes the Colonel realizing he's discovered a way to break free from his father  incredulous at its simplicity Ricky grabs his backpack turns and walks out the door leaving the Colonel standing there glassyeyed and breathing heavily  Ricky enters another room to find Barbara standing in the middle clutching a dish and looking frightened having obviously heard his argument with his father  she looks into his eyes aware something eventful is happening  He kisses her cheek softly then exits through the back door leaving her standing alone still clutching her dish  From the Colonel's point of view below him  Ricky dashes through the rain to the Burnhams' front door and knocks Ricky walks into view and Lester drapes his arm around Ricky as he gives him the money from the waist up  Lester looks naked  Ricky with wet hair from the rain puts the cash in his pocket while Lester's arm remains draped around his shoulder  Grinning  Ricky squats down and reaches under the weight bench  as Lester sits in the bowl chair leans back with his hands behind his head and watches Ricky roll the joint  From the Colonel's point of view Lester leans back in his chair and we can only see Ricky's back and shoulders as he rolls the joint causing the Colonel's face to tighten  After a moment Lester's jaw drops and he throws his head back making it appear as though Ricky is giving him a blow job  from our perspective the Colonel watches incredulously  Then as we hear a car approaching the Colonel glances over to see Angela's BMW pulling into the driveway stopping behind Lester's Firebird  As Angela and Jane get out and run toward the house our focus moves back to the garage window where Ricky stands looking a little panicked as Lester pulls on his Tshirt and both he and Ricky cross out of view  Jane and Angela enter with Jane frowning when she sees Lester who leans nonchalantly against the counter trying to remain cool and doing so successfully "
        }
      ]
    }
  ]
}