{
  "ground_truth": "Gittes is clicking off more shots when the tiles his feet are hooked over come loose, leading to a slow slide down the tile to the edge of the roof and possibly over it to a three-story drop. The loose tile also begins to slide, and a fragment off the cracked edge of the tile falls. Gittes tries to slow himself down as Mulwray stares at the fragment at his feet, rises, looks up to the roof, and then at the girl. In the style of the Hearst yellow press, there is a heart-shaped drawing around one of the photos that Gittes had taken, bringing a self-satisfied smile to his face. Elsewhere, a car is stalled with the hood up, as a man watches his radiator boiling over, reading a paper while getting a haircut and his shoes shined. Almost all the customers are reading papers. Gittes straightens up and gets out of the chair, despite Barney's concern as he tries to restrain him by holding onto the barber sheet around Gittes' neck. A customer shrinks back into the chair as Gittes bursts in, slapping a newspaper on his thigh. She gets up and leaves, while Walsh comes out of his office and Duffy out of the other one. A stunning young woman appears behind Gittes in his doorway, soon joined by a small, gray-haired man, as they listen unseen by Gittes, who laughs and then is staggered. When Gittes looks up, he sees the young woman, apparently in her late twenties, so stunning that he nearly gasps as the gray-haired man winces. The young woman walks past him toward the door. Evelyn starts out the door, and Gittes starts after her but is stopped by the gray-haired man who has also come out of his office and up behind him. Gittes stares down at the papers in his hand and turns to be handed a thick sheaf of papers, a summons and complaint. The Secretary half rises in protest but Gittes is through the inner door, where the walls are covered with commendations, photos of Mulwray at various construction sites, and large maps of watershed areas and reservoirs in the city. On the desk is a framed, tinted photo of Evelyn in riding clothes. Gittes moves to the desk, watching the translucent pane in the upper half of the door leading to the outer office as he does so. He begins to open and close the desk drawers after quickly examining the top, reopens the top drawer, and the bottom one opens. He looks in it, pulls out a checkbook, and opens it to riffle through the stubs like he was shuffling cards.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Gittes is snapping off more photos when the tiles his feet are hooked over come loose, leading to a slow slide down the slab to the edge of the roof and possibly over it to a three-story drop. The unsecured tile also starts to slide, and a fragment off the fractured edge of the tile falls. Gittes attempts to slow himself down as Mulwray gazes at the fragment at his feet, rises, looks up to the roof, and then at the girl. In the style of the Hearst yellow press, there is a heart-shaped sketch around one of the photographs that Gittes had taken, bringing a self-satisfied grin to his face. Elsewhere, an automobile is stalled with the hood up, as a man observes his radiator boiling over, reading a paper while getting a haircut and his shoes polished. Nearly all the patrons are reading papers. Gittes straightens up and gets out of the chair, despite Barney's concern as he tries to restrain him by holding onto the barber sheet around Gittes' neck. A client shrinks back into the chair as Gittes bursts in, slapping a newspaper on his thigh. She gets up and departs, while Walsh emerges from his office and Duffy out of the other one. A striking young woman appears behind Gittes in his doorway, soon joined by a small, gray-haired man, as they listen unseen by Gittes, who laughs and then is staggered. When Gittes looks up, he sees the young woman, apparently in her late twenties, so striking that he nearly gasps as the gray-haired man winces. The young woman walks past him toward the door. Evelyn starts out the door, and Gittes starts after her but is stopped by the gray-haired man who has also emerged from his office and up behind him. Gittes stares down at the papers in his hand and turns to be handed a thick wad of papers, a summons and complaint. The Secretary half rises in protest but Gittes is through the inner door, where the walls are covered with commendations, photos of Mulwray at various building sites, and large maps of watershed zones and reservoirs in the city. On the desk is a framed, tinted photo of Evelyn in riding garments. Gittes moves to the desk, watching the translucent pane in the upper half of the door leading to the outer office as he does so. He begins to open and close the desk drawers after quickly examining the top, reopens the top drawer, and the bottom one opens. He looks in it, pulls out a checkbook, and opens it to riffle through the stubs like he was shuffling cards."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Gittes is clicking off more shots when the tiles over which his feet are hooked are loosened, leading to a slow slide down the tile to the edge of the roof and possibly over it to a three-story drop. The loose tile is also made to slide, and a fragment off the cracked edge of the tile is caused to fall. Gittes tries to slow himself down as Mulwray stares at the fragment at his feet, rises, looks up to the roof, and then at the girl. In the style of the Hearst yellow press, a heart-shaped drawing is placed around one of the photos that Gittes had taken, bringing a self-satisfied smile to his face. Elsewhere, a man stalls a car with the hood up, watching his radiator boiling over while reading a paper and getting a haircut and his shoes shined. Almost all the customers read papers. Gittes is straightened up and removed from the chair, despite Barney's concern as he tries to restrain him by holding onto the barber sheet around Gittes' neck. A customer is shrunk back into the chair as Gittes bursts in, slapping a newspaper on his thigh. She gets up and leaves, while Walsh comes out of his office and Duffy out of the other one. Behind Gittes in his doorway, a stunning young woman appears, soon joined by a small, gray-haired man, as they listen unseen by Gittes, who laughs and then is staggered. When the young woman is seen by Gittes as he looks up, she is apparently in her late twenties, so stunning that a gasp is nearly emitted by him as the gray-haired man winces. The young woman is walked past by him toward the door. Evelyn starts out the door, and Gittes starts after her, but the gray-haired man stops him, who has also come out of his office and up behind him. Gittes is made to stare down at the papers in his hand and turns to be handed a thick sheaf of papers, a summons and complaint. The Secretary rises in protest halfway but is ignored by Gittes as he goes through the inner door, where the walls are covered with commendations, photos of Mulwray at various construction sites, and large maps of watershed areas and reservoirs in the city. A framed, tinted photo of Evelyn in riding clothes is placed on the desk. Gittes moves to the desk, watching the translucent pane in the upper half of the door leading to the outer office as he does so. After quickly examining the top, he begins to open and close the desk drawers, reopens the top drawer, and the bottom one is opened. A checkbook is looked in by him, pulled out, and opened to riffle through the stubs like cards are being shuffled by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Gittes takes more photos when the tiles under his feet come loose, causing him to slide toward the roof's edge and a potential three-story fall. A tile fragment falls, and Mulwray notices it, looks up, and then at the girl. A heart-shaped drawing around one of Gittes' photos brings a self-satisfied smile to his face. Elsewhere, a car with its hood up has a man watching his radiator boil over while reading a paper, getting a haircut, and having his shoes shined. Most customers are reading papers. Gittes stands up from the chair, despite Barney's attempt to restrain him by holding the barber sheet. A customer shrinks back as Gittes enters, slapping a newspaper on his thigh. She leaves, while Walsh and Duffy emerge from their offices. A stunning young woman and a small, gray-haired man appear behind Gittes, who is staggered. Gittes nearly gasps at the young woman, apparently in her late twenties, as the gray-haired man winces. She walks past him, and Gittes follows but is stopped by the gray-haired man. Gittes looks at the papers in his hand and receives a thick sheaf of papers, a summons and complaint. The Secretary protests, but Gittes enters the inner office, where walls are covered with commendations, photos of Mulwray at construction sites, and maps of watershed areas and reservoirs. On the desk is a framed photo of Evelyn in riding clothes. Gittes moves to the desk, watching the translucent pane in the door to the outer office, opens and closes desk drawers, and finds a checkbook, riffling through the stubs like shuffling cards."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gittes takes photos when the tiles under his feet loosen, causing him to slide towards a three-story drop. A tile fragment falls as Mulwray notices it, looks up, and then at the girl. Gittes smiles at a heart-shaped drawing around one of his photos. Elsewhere, a man reads a paper while his car radiator boils over, getting a haircut and shoe shine. Most customers read papers. Gittes stands up, despite Barney's attempt to restrain him with the barber sheet. A customer shrinks back as Gittes enters, slapping a newspaper. She leaves as Walsh and Duffy appear. A stunning young woman and a gray-haired man watch Gittes, who is staggered by her beauty. Evelyn exits, and Gittes follows but is stopped by the gray-haired man. Gittes receives a summons and complaint. The Secretary protests as Gittes enters an office filled with commendations, Mulwray's photos, and city maps. On the desk is a photo of Evelyn. Gittes examines the desk, opens drawers, finds a checkbook, and flips through the stubs."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Gittes is in the midst of clicking off more shots when the tiles, which his feet are precariously hooked over, suddenly come loose. This causes him to begin a slow, inevitable slide down the sloped surface of the tile, inching ever closer to the edge of the roof and the potential three-story drop that lies beyond. As this happens, the loose tile itself also starts to slide, and a small fragment from the cracked edge of the tile breaks off and falls. In an attempt to prevent his descent, Gittes tries to slow himself down. Meanwhile, Mulwray, who is observing the situation, stares intently at the fragment that has landed at his feet. He then rises, casting his gaze upward toward the roof and subsequently at the girl. In a manner reminiscent of the sensational style of the Hearst yellow press, one of the photos that Gittes had taken is adorned with a heart-shaped drawing, which brings a self-satisfied smile to his face. Elsewhere, a car is stalled with its hood raised, and a man stands by, watching as his radiator boils over. He is multitasking, reading a newspaper while simultaneously getting a haircut and having his shoes shined. Almost all the customers around him are engrossed in their newspapers. Gittes then straightens up and gets out of the chair, despite Barney's evident concern as he attempts to restrain him by holding onto the barber sheet that is wrapped around Gittes' neck. A customer, feeling the tension, shrinks back into their chair as Gittes bursts in, emphatically slapping a newspaper against his thigh. She rises from her seat and leaves, while Walsh emerges from his office and Duffy comes out of another one. A stunning young woman, appearing behind Gittes in his doorway, soon makes her presence known, joined by a small, gray-haired man. They both listen, unseen by Gittes, who laughs heartily and then is taken aback. When Gittes finally looks up, he is met with the sight of the young woman, who appears to be in her late twenties and is so stunning that he nearly gasps, while the gray-haired man winces. The young woman gracefully walks past him toward the door. Evelyn begins to make her way out the door, and Gittes starts to follow her but is halted by the gray-haired man, who has also emerged from his office and positioned himself behind Gittes. Gittes stares down at the papers in his hand and turns, only to be handed a thick sheaf of documents, which include a summons and complaint. The Secretary half rises in protest, but Gittes is already through the inner door, where the walls are adorned with commendations, photographs of Mulwray at various construction sites, and large maps depicting watershed areas and reservoirs throughout the city. On the desk, there is a framed, tinted photograph of Evelyn dressed in riding clothes. Gittes moves toward the desk, all the while watching the translucent pane in the upper half of the door that leads to the outer office. He begins to open and close the desk drawers after quickly examining the top, reopens the top drawer, and the bottom one opens. He looks inside, pulls out a checkbook, and opens it to riffle through the stubs as if he were shuffling a deck of cards."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Gittes is in the process of clicking off a series of photographs when, quite suddenly and without warning, the tiles over which his feet are precariously hooked begin to come loose. This unexpected event causes him to start an inexorable, slow-motion slide down the sloped surface of the tile, inching ever so closely toward the perilous edge of the roof and the potential danger of a three-story drop that ominously awaits beyond. As this happens, the very tile that became loose also starts its descent, and a small fragment from the cracked edge breaks off and falls. In a frantic attempt to prevent his descent, Gittes tries to apply friction and slow himself down. Meanwhile, Mulwray, who is attentively observing the unfolding situation, focuses intently on the fragment that has landed at his feet. He then rises from his seated position, directing his gaze upward toward the roof and subsequently at the girl. In a manner reminiscent of the sensational style of the Hearst yellow press, one of the photos that Gittes had managed to take is embellished with a heart-shaped drawing, which evokes a self-satisfied smile on his face filled with pride. Elsewhere, there is a car that has become stalled with its hood raised in the air, and a man stands by, observing as his radiator boils over. He skillfully multitasks, reading a newspaper while simultaneously having his haircut done and his shoes shined. Almost all the customers around him are deeply engrossed in reading their newspapers. Gittes then stands up straight and steps out of the chair, despite Barney's evident concern, as he makes a visible attempt to restrain Gittes by holding onto the barber sheet wrapped around his neck. Feeling the tension in the air, a customer sinks back into their chair, watching as Gittes bursts in, emphatically slapping a newspaper against his thigh. She rises from her seat with a sense of urgency and leaves, while Walsh emerges from his office and Duffy comes out of another one. A stunningly attractive young woman, making her presence known in the doorway behind Gittes, soon appears, accompanied by a small, gray-haired man. They both stand there, listening intently, unseen by Gittes, who laughs heartily and is then taken aback. When Gittes finally looks up, he is met with the sight of the young woman, who appears to be in her late twenties and is so breathtakingly beautiful that he nearly gasps audibly, while the gray-haired man winces slightly. The young woman walks past him elegantly toward the door. Evelyn starts to make her way out the door, and Gittes attempts to follow her but is stopped by the gray-haired man, who has also emerged from his office and positioned himself strategically behind Gittes. Gittes stares down at the papers in his hand and turns around, only to be presented with a thick sheaf of documents, which prominently include a summons and a complaint. The Secretary half rises in a gesture of protest, but Gittes has already moved through the inner door, where the walls are adorned with commendations, various photographs of Mulwray at different construction sites, and large, detailed maps depicting watershed areas and reservoirs throughout the city. On the desk, there is a framed, tinted photograph of Evelyn dressed in elegant riding clothes. Gittes moves with purpose toward the desk, all the while keeping an eye on the translucent pane in the upper half of the door that leads to the outer office, ensuring he remains aware of his surroundings. He begins to open and close the desk drawers methodically, after quickly examining the top, reopening the top drawer, and then the bottom one opens. He looks inside, retrieves a checkbook, and opens it to riffle through the stubs as if he were shuffling a deck of cards."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Gittes is in the midst of clicking off more shots when he suddenly feels the tiles beneath his feet begin to shift. His feet, hooked over the edge of the tiles, cause him to slowly slide down the sloped surface, inching closer to the edge of the roof, which looms ominously as a potential three-story drop. As he slides, the loose tile beneath him also starts to move, and a small fragment from the cracked edge of the tile breaks off and falls. In an attempt to prevent himself from sliding further, Gittes tries to slow his descent. Meanwhile, Mulwray, who is nearby, notices the fragment that has landed at his feet. He rises from his position, looks up towards the roof where Gittes is precariously perched, and then shifts his gaze to the girl. In a different scene, reminiscent of the sensational style of the Hearst yellow press, there is a heart-shaped drawing around one of the photos that Gittes had taken, which brings a self-satisfied smile to his face. Elsewhere, a car is stalled with its hood up, and a man stands by, observing his radiator as it boils over. He multitasks by reading a newspaper while simultaneously getting a haircut and having his shoes shined. Almost all the customers around him are engrossed in their newspapers. Back with Gittes, he straightens up and attempts to get out of the chair, despite Barney's concern, who tries to restrain him by holding onto the barber sheet that is wrapped around Gittes' neck. As Gittes bursts into the room, a customer shrinks back into their chair, startled by his sudden entrance, and he slaps a newspaper against his thigh. The customer, feeling uncomfortable, gets up and leaves the area. At this moment, Walsh emerges from his office, and Duffy comes out of another one. A stunning young woman appears behind Gittes in his doorway, soon joined by a small, gray-haired man. They both stand there, listening to Gittes, who is unaware of their presence. He laughs, but then is suddenly staggered by something. When Gittes finally looks up, he sees the young woman, who appears to be in her late twenties and is so stunning that he nearly gasps, while the gray-haired man winces at the sight. The young woman walks past Gittes, heading toward the door. Evelyn begins to make her way out the door, and Gittes starts to follow her, but he is stopped by the gray-haired man, who has also come out of his office and approaches Gittes from behind. Gittes stares down at the papers in his hand, then turns to be handed a thick sheaf of papers, which are a summons and complaint. The Secretary half rises in protest, but Gittes moves through the inner door, entering a room where the walls are adorned with commendations, photos of Mulwray at various construction sites, and large maps depicting watershed areas and reservoirs in the city. On the desk, there is a framed, tinted photo of Evelyn in riding clothes. Gittes approaches the desk, keeping an eye on the translucent pane in the upper half of the door that leads to the outer office as he does so. He begins to open and close the desk drawers, quickly examining the top one before reopening it, and then he opens the bottom drawer. He looks inside, pulls out a checkbook, and opens it to riffle through the stubs as if he were shuffling a deck of cards."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gittes is taking photos when the tiles beneath him come loose, causing him to slide slowly toward the roof's edge. As a tile fragment falls, Mulwray notices it, looks up at the roof, and then at the girl. Gittes, pleased with a heart-shaped drawing around one of his photos, smiles self-satisfactorily. Meanwhile, a man with a stalled car reads a paper while getting a haircut and shoe shine, surrounded by other newspaper-reading customers. Gittes stands up from his chair, despite Barney's attempt to restrain him with the barber sheet. A customer recoils as Gittes enters, slapping a newspaper on his thigh, prompting her to leave. Walsh and Duffy emerge from their offices as a stunning young woman and a small, gray-haired man appear behind Gittes, unnoticed by him. Gittes is momentarily staggered by the woman's beauty, nearly gasping as the gray-haired man winces. The young woman walks past him, and as Gittes moves to follow her, the gray-haired man stops him. Gittes examines the papers in his hand, receives a thick sheaf of documents, and enters an inner office filled with commendations, photos of Mulwray, and maps of city reservoirs. On the desk, he notices a framed photo of Evelyn in riding clothes. Gittes approaches the desk, watching the translucent pane in the door, and begins searching through the drawers, eventually finding and riffling through a checkbook."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Gittes is clicking off more shots when the tiles, part of the original Spanish-style roofing common in early 20th-century Californian architecture, his feet are hooked over come loose, leading to a slow slide down the tile to the edge of the roof and possibly over it to a three-story drop. The loose tile also begins to slide, and a fragment off the cracked edge of the tile falls. Gittes tries to slow himself down as Mulwray, known for his work on the city's controversial water projects, stares at the fragment at his feet, rises, looks up to the roof, and then at the girl. In the style of the Hearst yellow press, notorious for sensationalism in the early 1900s, there is a heart-shaped drawing around one of the photos that Gittes had taken, bringing a self-satisfied smile to his face. Elsewhere, a car is stalled with the hood up, as a man watches his radiator boiling over, a common sight in the days before modern cooling systems, reading a paper while getting a haircut and his shoes shined. Almost all the customers are reading papers, reflecting the era's high newspaper readership. Gittes straightens up and gets out of the chair, despite Barney's concern as he tries to restrain him by holding onto the barber sheet around Gittes' neck. A customer shrinks back into the chair as Gittes bursts in, slapping a newspaper on his thigh. She gets up and leaves, while Walsh comes out of his office and Duffy out of the other one. A stunning young woman appears behind Gittes in his doorway, soon joined by a small, gray-haired man, both figures unfamiliar yet clearly significant, as they listen unseen by Gittes, who laughs and then is staggered. When Gittes looks up, he sees the young woman, apparently in her late twenties, so stunning that he nearly gasps as the gray-haired man winces. The young woman walks past him toward the door. Evelyn, renowned within local social circles for her equestrian skills, starts out the door, and Gittes starts after her but is stopped by the gray-haired man who has also come out of his office and up behind him. Gittes stares down at the papers in his hand and turns to be handed a thick sheaf of papers, a summons and complaint, typical of legal entanglements of the period. The Secretary half rises in protest but Gittes is through the inner door, where the walls are covered with commendations, photos of Mulwray at various construction sites, and large maps of watershed areas and reservoirs in the city, crucial to understanding the ongoing water disputes. On the desk is a framed, tinted photo of Evelyn in riding clothes, which highlights her passion for horseback riding. Gittes moves to the desk, watching the translucent pane in the upper half of the door leading to the outer office as he does so. He begins to open and close the desk drawers after quickly examining the top, reopens the top drawer, and the bottom one opens. He looks in it, pulls out a checkbook, and opens it to riffle through the stubs, reminiscent of shuffling cards during a poker game, a popular pastime of the era."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Gittes is clicking off more shots when the tiles his feet are hooked over come loose leading to a slow slide down the tile to the edge of the roof and possibly over it to a threestory drop. The loose tile also begins to slide and a fragment off the cracked edge of the tile falls. Gittes tries to slow himself down as Mulwray stares at the fragment at his feet rises looks up to the roof and then at the girl. In the style of the Hearst yellow press there is a heartshaped drawing around one of the photos that Gittes had taken bringing a selfsatisfied smile to his face. Elsewhere a car is stalled with the hood up as a man watches his radiator boiling over reading a paper while getting a haircut and his shoes shined. Almost all the customers are reading papers. Gittes straightens up and gets out of the chair despite Barney's concern as he tries to restrain him by holding onto the barber sheet around Gittes' neck. A customer shrinks back into the chair as Gittes bursts in slapping a newspaper on his thigh. She gets up and leaves while Walsh comes out of his office and Duffy out of the other one. A stunning young woman appears behind Gittes in his doorway soon joined by a small grayhaired man as they listen unseen by Gittes who laughs and then is staggered. When Gittes looks up he sees the young woman apparently in her late twenties so stunning that he nearly gasps as the grayhaired man winces. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. The young woman walks past him toward the door. Evelyn starts out the door and Gittes starts after her but is stopped by the grayhaired man who has also come out of his office and up behind him. Gittes stares down at the papers in his hand and turns to be handed. a thick sheaf of papers a summons and complaint. The Secretary half rises in protest but Gittes is through the inner door where the walls are covered with commendations. photos of Mulwray at various construction sites and large maps of watershed areas and reservoirs in the city. On the desk is a framed tinted photo of Evelyn in riding clothes. Gittes moves to the desk watching the translucent pane in the upper half of the door leading to the outer office as he does so. He begins to open and close the desk drawers. after quickly examining the top reopens the top drawer and the bottom one opens. He looks in it pulls out a checkbook and opens it to riffle through the stubs like he was shuffling cards."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Gittes is clicking off more shots when the tiles his feet are hooked over come loose leading to a slow slide down the tile to the edge of the roof and possibly over it to a threestory drop. The loose tile also begins to slide and a fragment off the cracked edge of the tile falls. Gittes tries to slow himself down as Mulwray stares at the fragment at his feet rises looks up to the roof and then at the girl. In the style of the Hearst yellow press there is a heartshaped drawing around one of the photos that Gittes had taken bringing a selfsatisfied smile to his face. Elsewhere a car is stalled with the hood up as a man watches his radiator boiling over reading a paper while getting a haircut and his shoes shined. Almost all the customers are reading papers. Gittes straightens up and gets out of the chair despite Barney's concern as he tries to restrain him by holding onto the barber sheet around Gittes' neck. A customer shrinks back into the chair as Gittes bursts in slapping a newspaper on his thigh. She gets up and leaves while Walsh comes out of his office and Duffy out of the other one. A stunning young woman appears behind Gittes in his doorway soon joined by a small grayhaired man as they listen unseen by Gittes who laughs and then is staggered. When Gittes looks up he sees the young woman apparently in her late twenties so stunning that he nearly gasps as the grayhaired man winces. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. The young woman walks past him toward the door. Evelyn starts out the door and Gittes starts after her but is stopped by the grayhaired man who has also come out of his office and up behind him. Gittes stares down at the papers in his hand and turns to be handed. a thick sheaf of papers a summons and complaint. The Secretary half rises in protest but Gittes is through the inner door where the walls are covered with commendations. photos of Mulwray at various construction sites and large maps of watershed areas and reservoirs in the city. On the desk is a framed tinted photo of Evelyn in riding clothes. Gittes moves to the desk watching the translucent pane in the upper half of the door leading to the outer office as he does so. He begins to open and close the desk drawers. after quickly examining the top reopens the top drawer and the bottom one opens. He looks in it pulls out a checkbook and opens it to riffle through the stubs like he was shuffling cards."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Gittes is clicking off more shots when the tiles his feet are hooked over come loose leading to a slow slide down the tile to the edge of the roof and possibly over it to a threestory drop. The loose tile also begins to slide and a fragment off the cracked edge of the tile falls. Gittes tries to slow himself down as Mulwray stares at the fragment at his feet rises looks up to the roof and then at the girl. In the style of the Hearst yellow press there is a heartshaped drawing around one of the photos that Gittes had taken bringing a selfsatisfied smile to his face. Elsewhere a car is stalled with the hood up as a man watches his radiator boiling over reading a paper while getting a haircut and his shoes shined. Almost all the customers are reading papers. On the desk is a framed tinted photo of Evelyn in riding clothes. Gittes moves to the desk watching the translucent pane in the upper half of the door leading to the outer office as he does so. He begins to open and close the desk drawers. after quickly examining the top reopens the top drawer and the bottom one opens. He looks in it pulls out a checkbook and opens it to riffle through the stubs like he was shuffling cards."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Gittes is clicking off more shots when the tiles his feet are hooked over come loose leading to a slow slide down the tile to the edge of the roof and possibly over it to a threestory drop. The loose tile also begins to slide and a fragment off the cracked edge of the tile falls. Gittes tries to slow himself down as Mulwray stares at the fragment at his feet rises looks up to the roof and then at the girl. after quickly examining the top reopens the top drawer and the bottom one opens. He looks in it pulls out a checkbook and opens it to riffle through the stubs like he was shuffling cards."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Barker is munching on more apples when the branches his hands are latched onto snap, triggering a rapid tumble down the branch to the base of the tree and potentially beneath it to a two-floor climb. The snapped branch also begins to tumble, and a splinter from the jagged rim of the branch drops. Barker attempts to speed himself up as Chandler gawks at the splinter by his toes, jumps, glances down to the field, and then at the boy. In the manner of the Smith gossip rag, there is a star-shaped doodle around one of the sketches that Barker had made, bringing a gleeful grin to his face. Nearby, a bicycle is toppled with the basket open, as a woman observes her kettle steaming over, knitting a scarf while getting a manicure and her glasses cleaned. Almost all the spectators are knitting scarves. Barker leans down and tumbles out of the hammock, despite Jordan's worry as she tries to grab him by clutching the hammock net around Barker's waist. A spectator leaps forward onto the hammock as Barker barges out, waving a magazine on his shoulder. He sits down and snoozes, while Harvey enters his garage and Wallace out of the other one. A dazzling young boy materializes beside Barker in his garden, soon joined by a tall, blonde-haired lady, as they murmur unnoticed by Barker, who cackles and then is puzzled. When Barker glances over, he notices the young boy, apparently in his early teens, so striking that he nearly frowns as the blonde-haired lady grimaces. The young boy strolls ahead of him through the gate. Emily skips through the gate, and Barker skips behind her but is halted by the blonde-haired lady who has also emerged from her garage and down beside him. Barker peers up at the sculptures in his lap and pivots to be handed a slim album of sculptures, a painting and invoice. The Baker fully descends in frustration but Barker is through the outer gate, where the fences are adorned with accolades, sketches of Chandler at various engineering camps, and small diagrams of windmill designs and gardens in the town. On the table is a glossy, framed sketch of Emily in hiking boots. Barker wanders to the table, studying the opaque curtain in the lower half of the gate leading to the inner garden as he does so. He starts to lock and unlock the table cabinets after slowly surveying the bottom, relocks the bottom cabinet, and the top one closes. He peers into it, draws out a notebook, and closes it to thumb through the pages like he was reading letters."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gittes takes photos when loose tiles cause him to slide towards a roof's edge, with tiles falling dangerously. Mulwray notices, and in true yellow press fashion, a heart is drawn around one photo, making Gittes smile. Elsewhere, a man deals with his overheated car while getting a haircut and reading a paper. Gittes rises from his chair despite Barney's attempts to restrain him. He bursts in, slapping a newspaper on his thigh, causing a customer to leave. Walsh and Duffy appear as a stunning young woman and a gray-haired man listen to Gittes. Shocked by her beauty, Gittes nearly gasps. As she leaves, he's handed legal papers. Ignoring a secretary's protest, Gittes enters the inner office to find it lined with Mulwray's commendations, site photos, and maps. He inspects the desk, finds a checkbook, and riffles through its stubs."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He looks in it pulls out a checkbook and opens it to riffle through the stubs like he was shuffling cards after quickly examining the top reopens the top drawer and the bottom one opens  He begins to open and close the desk drawers  Gittes moves to the desk watching the translucent pane in the upper half of the door leading to the outer office as he does so  On the desk is a framed tinted photo of Evelyn in riding clothes  photos of Mulwray at various construction sites and large maps of watershed areas and reservoirs in the city  The Secretary half rises in protest but Gittes is through the inner door where the walls are covered with commendations  a thick sheaf of papers a summons and complaint  Gittes stares down at the papers in his hand and turns to be handed  Evelyn starts out the door and Gittes starts after her but is stopped by the grayhaired man who has also come out of his office and up behind him  The young woman walks past him toward the door  When Gittes looks up he sees the young woman apparently in her late twenties so stunning that he nearly gasps as the grayhaired man winces  A stunning young woman appears behind Gittes in his doorway soon joined by a small grayhaired man as they listen unseen by Gittes who laughs and then is staggered  She gets up and leaves while Walsh comes out of his office and Duffy out of the other one  A customer shrinks back into the chair as Gittes bursts in slapping a newspaper on his thigh  Gittes straightens up and gets out of the chair despite Barney's concern as he tries to restrain him by holding onto the barber sheet around Gittes' neck  Almost all the customers are reading papers  Elsewhere a car is stalled with the hood up as a man watches his radiator boiling over reading a paper while getting a haircut and his shoes shined  In the style of the Hearst yellow press there is a heartshaped drawing around one of the photos that Gittes had taken bringing a selfsatisfied smile to his face  Gittes tries to slow himself down as Mulwray stares at the fragment at his feet rises looks up to the roof and then at the girl  The loose tile also begins to slide and a fragment off the cracked edge of the tile falls  Gittes is clicking off more shots when the tiles his feet are hooked over come loose leading to a slow slide down the tile to the edge of the roof and possibly over it to a threestory drop "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The loose tile also begins to slide and a fragment off the cracked edge of the tile falls Gittes is clicking off more shots when the tiles his feet are hooked over come loose leading to a slow slide down the tile to the edge of the roof and possibly over it to a threestory drop In the style of the Hearst yellow press there is a heartshaped drawing around one of the photos that Gittes had taken bringing a selfsatisfied smile to his face Gittes tries to slow himself down as Mulwray stares at the fragment at his feet rises looks up to the roof and then at the girl Almost all the customers are reading papers Elsewhere a car is stalled with the hood up as a man watches his radiator boiling over reading a paper while getting a haircut and his shoes shined A customer shrinks back into the chair as Gittes bursts in slapping a newspaper on his thigh Gittes straightens up and gets out of the chair despite Barney's concern as he tries to restrain him by holding onto the barber sheet around Gittes' neck A stunning young woman appears behind Gittes in his doorway soon joined by a small grayhaired man as they listen unseen by Gittes who laughs and then is staggered She gets up and leaves while Walsh comes out of his office and Duffy out of the other one The young woman walks past him toward the door When Gittes looks up he sees the young woman apparently in her late twenties so stunning that he nearly gasps as the grayhaired man winces Gittes stares down at the papers in his hand and turns to be handed Evelyn starts out the door and Gittes starts after her but is stopped by the grayhaired man who has also come out of his office and up behind him The Secretary half rises in protest but Gittes is through the inner door where the walls are covered with commendations a thick sheaf of papers a summons and complaint On the desk is a framed tinted photo of Evelyn in riding clothes photos of Mulwray at various construction sites and large maps of watershed areas and reservoirs in the city He begins to open and close the desk drawers Gittes moves to the desk watching the translucent pane in the upper half of the door leading to the outer office as he does so He looks in it pulls out a checkbook and opens it to riffle through the stubs like he was shuffling cards after quickly examining the top reopens the top drawer and the bottom one opens"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The young woman walks past him toward the door  Evelyn starts out the door and Gittes starts after her but is stopped by the grayhaired man who has also come out of his office and up behind him  Gittes stares down at the papers in his hand and turns to be handed  a thick sheaf of papers a summons and complaint  The Secretary half rises in protest but Gittes is through the inner door where the walls are covered with commendations  photos of Mulwray at various construction sites and large maps of watershed areas and reservoirs in the city  On the desk is a framed tinted photo of Evelyn in riding clothes  Gittes moves to the desk watching the translucent pane in the upper half of the door leading to the outer office as he does so  He begins to open and close the desk drawers  after quickly examining the top reopens the top drawer and the bottom one opens  He looks in it pulls out a checkbook and opens it to riffle through the stubs like he was shuffling cards Gittes is clicking off more shots when the tiles his feet are hooked over come loose leading to a slow slide down the tile to the edge of the roof and possibly over it to a threestory drop  The loose tile also begins to slide and a fragment off the cracked edge of the tile falls  Gittes tries to slow himself down as Mulwray stares at the fragment at his feet rises looks up to the roof and then at the girl  In the style of the Hearst yellow press there is a heartshaped drawing around one of the photos that Gittes had taken bringing a selfsatisfied smile to his face  Elsewhere a car is stalled with the hood up as a man watches his radiator boiling over reading a paper while getting a haircut and his shoes shined  Almost all the customers are reading papers  Gittes straightens up and gets out of the chair despite Barney's concern as he tries to restrain him by holding onto the barber sheet around Gittes' neck  A customer shrinks back into the chair as Gittes bursts in slapping a newspaper on his thigh  She gets up and leaves while Walsh comes out of his office and Duffy out of the other one  A stunning young woman appears behind Gittes in his doorway soon joined by a small grayhaired man as they listen unseen by Gittes who laughs and then is staggered  When Gittes looks up he sees the young woman apparently in her late twenties so stunning that he nearly gasps as the grayhaired man winces "
        }
      ]
    }
  ]
}