{
  "ground_truth": "Bellatrix sets down the ornament and glares at Snape. Narcissa glances at her sister then looks anxiously back to Snape, stands, and they both stare at Bellatrix. Bellatrix steps towards Snape, moves behind him, but then walks away while staring, open-mouthed. Narcissa and Snape grasp each other's right wrist, and Bellatrix waves her wand, causing a glowing cord to bind their wrists together. Narcissa stares unwaveringly at Snape as Bellatrix stands close to him. The cord binding their wrists fades and disappears, Narcissa releases her grip, and flexes her wrist. At a shop called Pieces of Modern Magic, outside, a mechanical man makes the rabbit on his head disappear under a big top hat. The Weasley twins are present, a boy looks sick, and Ron watches a mechanical toy of Dolores Umbridge balancing on a tightrope. A boy walks up a wall. Harry spots a strange substance, and the twins give him some. A handsome youth, Cormac, smiles at Hermione who puts down a love potion. Ron turns to Hermione and Harry, and they pass Lavender, a girl with curly hair, who watches him go. Outside, a little dragon breathes flames, roasting chestnuts, which a boy buys before sliding down a chute into a bag. They're in Diagon Alley and enter the empty and burned-out shop the Death Eaters attacked, with Harry leading, followed by Ron and then Hermione. Ron stops by a window and looks out. Narcissa and Draco look around furtively before entering a narrow alley. The trio leave Ollivander's and peek around the corner where there's a wanted poster for Fenrir Greyback, the bearded Death Eater who attacked the shop. They follow the Malfoys down the gloomy alleyway as the Malfoys descend steps to a shop with a sign above its door, Borgin and Burke. Narcissa strides in, and Draco follows, while the three friends look up as a light comes on in an arched window in the rear of the shop. They climb onto an adjoining roof and watch as the Malfoys are led across a courtyard below into a high room that reaches from the ground floor to the roof. They see Draco running his hands over a tall, triangular, embossed wooden cabinet, and several figures approach Draco as Harry hauls himself up to get a better view. Narcissa kisses her son's cheek, and someone appears at a window. Harry, Hermione, and Ron duck down as a thin-faced man with a beard looks out and lowers the blind. Harry looks up and breathes a sigh of relief. The Hogwarts Express chugs through barren moorland, where Luna holds magazines and Ginny has a Pygmy Puff. Ginny reads the cover, and Luna saunters along the corridor with her magazines. Further back on the train, Hermione, Harry, and Ron have a compartment to themselves.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Bellatrix places down the decoration and frowns at Snape. Narcissa peeks at her sibling then looks nervously back to Snape, rises, and they both gaze at Bellatrix. Bellatrix advances towards Snape, moves behind him, but then walks away while staring, open-mouthed. Narcissa and Snape clasp each other's right wrist, and Bellatrix waves her wand, causing a glowing rope to bind their wrists together. Narcissa stares unwaveringly at Snape as Bellatrix stands close to him. The cord binding their wrists fades and vanishes, Narcissa releases her grasp, and bends her wrist. At a store called Pieces of Modern Magic, outside, a mechanical man makes the rabbit on his head vanish under a big top hat. The Weasley twins are there, a boy looks ill, and Ron observes a mechanical toy of Dolores Umbridge balancing on a tightrope. A boy walks up a wall. Harry spots a peculiar substance, and the twins give him some. A charming youth, Cormac, grins at Hermione who puts down a love potion. Ron turns to Hermione and Harry, and they pass Lavender, a girl with curly hair, who watches him go. Outside, a small dragon exhales flames, roasting chestnuts, which a boy buys before sliding down a chute into a bag. They're in Diagon Alley and enter the vacant and burned-out store the Death Eaters attacked, with Harry leading, followed by Ron and then Hermione. Ron halts by a window and looks out. Narcissa and Draco look around cautiously before entering a narrow alley. The trio departs Ollivander's and peeks around the corner where there's a wanted poster for Fenrir Greyback, the bearded Death Eater who attacked the shop. They follow the Malfoys down the shadowy alleyway as the Malfoys descend steps to a shop with a sign above its door, Borgin and Burke. Narcissa strides in, and Draco follows, while the three friends look up as a light comes on in an arched window in the rear of the shop. They climb onto an adjoining roof and watch as the Malfoys are led across a courtyard below into a high room that extends from the ground floor to the roof. They see Draco running his hands over a tall, triangular, embossed wooden cabinet, and several figures approach Draco as Harry pulls himself up to get a better view. Narcissa kisses her son's cheek, and someone appears at a window. Harry, Hermione, and Ron duck down as a thin-faced man with a beard looks out and lowers the blind. Harry looks up and exhales a sigh of relief. The Hogwarts Express chugs through desolate moorland, where Luna holds magazines and Ginny has a Pygmy Puff. Ginny reads the cover, and Luna walks along the passageway with her magazines. Further back on the train, Hermione, Harry, and Ron have a compartment to themselves."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The ornament is set down by Bellatrix, and Snape is glared at by her. Narcissa’s glance is cast at her sister, then anxiously directed back to Snape; she stands, and Bellatrix is stared at by both. Snape is stepped towards by Bellatrix, and he is moved behind by her, but then, while being stared at open-mouthed, she walks away. Each other's right wrist is grasped by Narcissa and Snape, and a wand is waved by Bellatrix, causing a glowing cord to bind their wrists together. Snape is stared at unwaveringly by Narcissa as close to him stands Bellatrix. The cord binding their wrists fades and disappears, Narcissa’s grip is released by her, and her wrist is flexed. At a shop called Pieces of Modern Magic, outside, a mechanical man makes the rabbit on his head disappear under a big top hat. The Weasley twins are present, and a sick-looking boy is watched by Ron as a mechanical toy of Dolores Umbridge performs a tightrope act. Up a wall walks a boy. A strange substance is spotted by Harry, and some is given to him by the twins. A handsome youth, Cormac, smiles at Hermione, who places down a love potion. To Hermione and Harry, Ron turns, and as they pass Lavender, a girl with curly hair, they are watched by her as he goes. Outside, flames are breathed by a little dragon, roasting chestnuts, which are bought by a boy before he slides down a chute into a bag. Diagon Alley is where they are, and the empty and burned-out shop that the Death Eaters attacked is entered by them, with Harry leading, followed by Ron and then Hermione. By a window, a stop is made by Ron, and out he looks. Furtive glances are exchanged by Narcissa and Draco before a narrow alley is entered by them. Ollivander’s is left by the trio, and around the corner, they peek where a wanted poster is for Fenrir Greyback, the bearded Death Eater who attacked the shop. The Malfoys are followed by them down the gloomy alleyway as steps are descended by the Malfoys to a shop with a sign above its door, Borgin and Burke. Narcissa strides in, and Draco follows; the three friends look up as a light is switched on in an arched window at the rear of the shop. An adjoining roof is climbed onto by them, and they watch as the Malfoys are led across a courtyard below into a high room that reaches from the ground floor to the roof. Draco is seen running his hands over a tall, triangular, embossed wooden cabinet, and several figures approach him as a better view is sought by Harry by hauling himself up. Her son’s cheek is kissed by Narcissa, and someone appears at a window. Harry, Hermione, and Ron duck down as a thin-faced man with a beard looks out and lowers the blind. Up Harry looks, and a sigh of relief is breathed by him. The barren moorland is chugged through by the Hogwarts Express, where magazines are held by Luna, and Ginny has a Pygmy Puff. The cover is read by Ginny, and Luna saunters along the corridor with her magazines. Further back on the train, a compartment is had by Hermione, Harry, and Ron to themselves."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Bellatrix sets down the ornament and glares at Snape. Narcissa glances at her sister, looks anxiously back to Snape, stands, and they both stare at Bellatrix. Bellatrix moves behind Snape, then walks away while staring, open-mouthed. Narcissa and Snape grasp each other's right wrist, and Bellatrix waves her wand, causing a glowing cord to bind their wrists. The cord fades, disappears, Narcissa releases her grip, and flexes her wrist. Outside a shop called Pieces of Modern Magic, a mechanical man makes a rabbit vanish under a hat. The Weasley twins are present, a boy looks sick, and Ron watches a Dolores Umbridge toy on a tightrope. A boy walks up a wall. Harry notices a strange substance and the twins give him some. A handsome youth, Cormac, smiles at Hermione, who puts down a love potion. Ron turns to Hermione and Harry, passing Lavender, a curly-haired girl who watches him leave. Outside, a little dragon roasts chestnuts with flames, which a boy buys before sliding into a bag. They're in Diagon Alley and enter the burned-out shop the Death Eaters attacked, led by Harry, followed by Ron and Hermione. Ron stops by a window. Narcissa and Draco look around furtively before entering a narrow alley. The trio leaves Ollivander's, peeking around a corner at a wanted poster for Fenrir Greyback, the bearded Death Eater who attacked the shop. They follow the Malfoys down the gloomy alleyway as they descend steps to Borgin and Burke. Narcissa enters, and Draco follows, as the trio watches a light in an arched window. They climb a roof, observe the Malfoys led into a high room. Draco runs his hands over a triangular, embossed cabinet, and figures approach Draco as Harry climbs for a better view. Narcissa kisses her son's cheek, and someone appears at a window. Harry, Hermione, and Ron duck as a thin-faced man looks out and lowers the blind. Harry sighs in relief. The Hogwarts Express travels through moorland; Luna holds magazines and Ginny has a Pygmy Puff. Ginny reads the cover, and Luna walks along the corridor with her magazines. Further back, Hermione, Harry, and Ron have a compartment to themselves."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Bellatrix sets an ornament down, glaring at Snape. Narcissa glances at her sister, back to Snape, stands, and they both watch Bellatrix. Bellatrix moves behind Snape, then walks away, staring. Narcissa and Snape grasp right wrists, and Bellatrix's wand binds them with a glowing cord. The cord fades, Narcissa releases, flexes her wrist. At Pieces of Modern Magic shop, a mechanical man vanishes a rabbit under a hat. The Weasley twins are present, a boy is sick, Ron watches a Dolores Umbridge toy on a tightrope. A boy walks up a wall. Harry spots a substance, twins give him some. Cormac smiles at Hermione, who puts down a love potion. Ron, Hermione, and Harry pass curly-haired Lavender, who watches him. Outside, a dragon roasts chestnuts, a boy buys some, sliding them into a bag. In Diagon Alley, they enter the empty, burned-out shop Death Eaters attacked, Harry leads, Ron follows, Hermione last. Ron looks out a window. Narcissa and Draco furtively enter a narrow alley. The trio leaves Ollivander's, sees a wanted poster for Fenrir Greyback, follows Malfoys down an alley to Borgin and Burke. Narcissa enters, Draco follows, the friends see a light in a shop window. They climb a roof, watch as Malfoys are led into a high room. Draco touches a wooden cabinet, several figures approach. Narcissa kisses Draco, someone appears at a window, and the trio ducks as a bearded man lowers a blind. Harry sighs in relief. The Hogwarts Express crosses moorland, Luna holds magazines, Ginny has a Pygmy Puff. Ginny reads a cover, Luna walks with her magazines. Further back, Hermione, Harry, and Ron share a compartment."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Bellatrix, with an air of disdain, sets down the delicate ornament and glares fiercely at Snape. Narcissa, noticing her sister's intense gaze, quickly glances at Bellatrix before turning her anxious eyes back to Snape. With a swift movement, she stands, causing both of them to fix their stares intently upon Bellatrix. As if propelled by a sudden decision, Bellatrix steps purposefully towards Snape, only to move behind him briefly. She then changes her course, walking away while continuing to stare at him, her mouth agape in surprise or disbelief. In a synchronized motion, Narcissa and Snape clasp each other's right wrist, creating a steadfast grip. Bellatrix, with a flick of her wand, conjures a glowing magical cord that binds their wrists together in a mystical union. Narcissa maintains an unwavering stare directed at Snape as Bellatrix positions herself closely beside him. Gradually, the enchanted cord binding their wrists fades away and vanishes into thin air. Narcissa releases her hold, flexing her wrist to regain feeling.\n\nOutside at a whimsical shop named Pieces of Modern Magic, a mechanical man performs a trick, making a rabbit sitting atop his head vanish beneath an oversized top hat. Nearby, the Weasley twins make their presence known; a boy appears to be feeling nauseous, while Ron observes a mechanical toy of Dolores Umbridge skillfully balancing on a tightrope. An adventurous boy defies gravity as he walks up a vertical wall. Harry's attention is drawn to a strange and peculiar substance, which the twins generously share with him. A strikingly handsome youth, known as Cormac, flashes a charming smile at Hermione, who is in the process of putting down a love potion bottle. As Ron turns to converse with Hermione and Harry, they pass by Lavender, a girl adorned with a cascade of curly hair, who watches Ron intently as he walks away.\n\nOutside in bustling Diagon Alley, a small dragon breathes fiery flames, skillfully roasting chestnuts that a young boy eagerly purchases before joyfully sliding down a chute, causing the chestnuts to tumble into a waiting bag. The trio, consisting of Harry, Ron, and Hermione, makes their way to an empty, burned-out shop ravaged by the Death Eaters' attack, with Harry leading the group, followed closely by Ron and then Hermione. Pausing momentarily, Ron stops by a window to gaze out reflectively.\n\nMeanwhile, Narcissa and Draco move stealthily, casting furtive glances around before slipping into a narrow alley. The trio departs from Ollivander's, cautiously peering around the corner where a wanted poster of Fenrir Greyback, the bearded and dangerous Death Eater responsible for the shop's attack, is prominently displayed. They quietly trail the Malfoys down the dimly lit alleyway, observing as the Malfoys descend a set of steps leading to a shop identified by the sign above its door, Borgin and Burke. Narcissa strides assertively inside, followed closely by Draco, while the three friends look upward just as a light flicks on in an arched window at the back of the shop.\n\nQuietly climbing onto an adjacent rooftop, they observe the Malfoys being escorted across a small courtyard below into a towering room that spans from the ground floor all the way up to the roof. There, they watch Draco as he runs his hands over a large, tall, triangular wooden cabinet adorned with intricate embossing. Several shadowy figures approach Draco, prompting Harry to haul himself up to obtain a better vantage point. Narcissa tenderly kisses her son's cheek as a figure appears at the window. Sensing danger, Harry, Hermione, and Ron quickly duck down as a thin-faced man with a scraggly beard peers out and promptly lowers the blind. Harry, now feeling relieved, looks up and breathes a sigh of relief.\n\nAs the Hogwarts Express makes its way through vast stretches of barren moorland, Luna holds an assortment of magazines, and Ginny cuddles a lively Pygmy Puff. Ginny peruses the magazine covers, while Luna leisurely strolls along the train corridor with her pile of magazines in hand. Further back on the train, Hermione, Harry, and Ron occupy a compartment all to themselves, savoring their time together."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Bellatrix, carrying herself with an air of clear disdain, carefully sets down the delicate ornament in her hand, all the while glaring fiercely at Snape with an intense expression. Narcissa, catching sight of her sister's piercing gaze, quickly glances towards Bellatrix before directing her own anxious eyes back to Snape. In one swift and decisive movement, she stands, causing both her own and Snape's stares to fix intently on Bellatrix once again. As if propelled by a sudden and urgent decision, Bellatrix strides purposefully towards Snape, only to momentarily step behind him. She then alters her course, walking away while maintaining her penetrating gaze on him, her mouth open in what seems to be a display of surprise or disbelief. In perfect synchronization, Narcissa and Snape clasp each other's right wrist, forming a firm and steadfast grip between them. With a quick flick of her wand, Bellatrix conjures a glowing magical cord, which binds their wrists together in a mystical union. Narcissa remains unwavering in her intense stare directed at Snape as Bellatrix positions herself closely beside him. Gradually and almost imperceptibly, the enchanted cord binding their wrists fades away and completely vanishes into thin air. Narcissa then releases her hold, gently flexing her wrist to restore feeling.\n\nOutside, at a whimsical shop known as Pieces of Modern Magic, a mechanical man mesmerizingly performs a magic trick, making the rabbit sitting atop his head disappear beneath an oversized top hat. Nearby, the Weasley twins are noticeable; one boy appears to be feeling rather nauseous, while Ron watches a mechanical toy version of Dolores Umbridge skillfully and precariously balancing on a tightrope. An adventurous young boy defies the laws of gravity as he walks directly up a vertical wall. Harry's attention is captured by a strange and peculiar substance, which the twins generously share with him. A strikingly handsome youth named Cormac flashes a charming and confident smile at Hermione, who is in the midst of putting down a bottle containing a love potion. As Ron turns to converse with Hermione and Harry, they walk past Lavender, a girl with a cascade of curly hair, who watches Ron with focused attention as he walks away from them.\n\nOutside in the bustling and lively Diagon Alley, a small dragon skillfully breathes fiery flames, effectively roasting chestnuts that a young boy eagerly purchases before joyfully sliding down a chute, causing the chestnuts to tumble right into a waiting bag. The trio, consisting of Harry, Ron, and Hermione, makes their way towards an empty, burned-out shop that has been ravaged by the destructive attack of the Death Eaters, with Harry leading the group, followed closely by Ron, and then by Hermione. Pausing for a brief moment, Ron stops by a nearby window to gaze reflectively at the scene outside.\n\nMeanwhile, Narcissa and Draco move stealthily and cautiously, casting furtive and watchful glances around before they slip into a narrow alley. The trio departs from Ollivander's wand shop, cautiously peering around the corner, where they see a wanted poster prominently displaying Fenrir Greyback, the bearded and dangerous Death Eater responsible for the shop's attack. They carefully and quietly trail the Malfoys down the dimly lit alleyway, observing as Narcissa and Draco descend a set of steps leading to a shop signified by the sign above its door—Borgin and Burke. Narcissa strides assertively inside the shop, closely followed by Draco, while the three friends look upward just as a light flickers on in an arched window at the back of the shop.\n\nQuietly climbing onto an adjacent rooftop, they observe the Malfoys being escorted across a small courtyard below into a towering room that stretches from the ground floor all the way up to the roof. There, they watch Draco as he runs his hands over a large, tall, triangular wooden cabinet adorned with intricate and detailed embossing. Several shadowy and mysterious figures approach Draco, prompting Harry to pull himself up to obtain a better vantage point. Narcissa tenderly kisses her son's cheek as a figure appears at the window, peering out. Sensing potential danger, Harry, Hermione, and Ron quickly duck down as a thin-faced man with a scraggly beard peers out and promptly lowers the blind. Feeling a sense of relief, Harry looks up and lets out a sigh of relief.\n\nAs the Hogwarts Express makes its journey through vast stretches of barren moorland, Luna holds an assortment of colorful magazines, and Ginny cuddles a lively Pygmy Puff. Ginny peruses the covers of the magazines, while Luna leisurely strolls along the corridor of the train, clutching her pile of magazines in her hands. Further back on the train, Hermione, Harry, and Ron occupy a compartment all to themselves, savoring and enjoying their time together."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Bellatrix, standing with a stern demeanor, decisively places the ornament down, fixing a sharp glare on Snape. With a quick, worried exchange of glances, Narcissa turns her eyes from her sister back to Snape, her expression filled with anxiety. Rising from her seat, she stands alongside Snape, and both direct their gaze intently at Bellatrix. In a calculated move, Bellatrix steps deliberately towards Snape, circles behind him with purpose, and then, as if caught in a sudden thought, walks away, her mouth agape with a mix of emotions. Meanwhile, Narcissa and Snape engage in a mutual clasping of each other's right wrists, a symbolic gesture as Bellatrix, wielding her wand, performs a spell that causes a luminous cord to materialize and bind their wrists together. Unwaveringly, Narcissa maintains her intense gaze upon Snape, even as Bellatrix positions herself closely beside him. Gradually, the glowing cord that binds their wrists begins to dim and eventually disappears. With this release, Narcissa lets go of Snape's wrist, flexing her own to regain comfort. Meanwhile, outside a shop named Pieces of Modern Magic, a mechanical man is animatedly making the rabbit atop his head vanish beneath an oversized top hat, capturing the attention of onlookers. Among them, the Weasley twins stand present as a boy appears unwell, while Ron is engrossed by a mechanical toy depicting Dolores Umbridge balancing precariously on a tightrope. Nearby, a boy intriguingly walks up a wall. In another moment, Harry notices a strange substance and, intrigued, receives some from the twins. Cormac, an undeniably handsome youth, casts a charming smile at Hermione, who is in the act of setting down a love potion. Ron, shifting his focus, turns towards Hermione and Harry, and as they proceed, they pass by Lavender, a girl with distinct curly hair, who watches Ron go with notable interest. Outside, a small dragon enacts its fiery nature by breathing flames that roast chestnuts, which a boy eagerly purchases before delightfully sliding down a chute into a waiting bag. This lively scene occurs in the bustling area of Diagon Alley, where they soon enter a shop left empty and charred by a past Death Eater attack. Harry confidently leads the way inside, with Ron following him and Hermione bringing up the rear. At one point, Ron pauses by a window, gazing out thoughtfully. Meanwhile, Narcissa and Draco, moving with caution, survey their surroundings furtively before slipping into a narrow alley. Keeping a low profile, the trio exits Ollivander's and cautiously peeks around a corner where they notice a wanted poster for Fenrir Greyback, the infamous bearded Death Eater connected to the shop attack. Deciding to follow, they trail the Malfoys down the dark, shadow-filled alleyway as the Malfoys make their way down steps leading to the shop known as Borgin and Burke's, which is identified by the sign above its door. Narcissa enters the shop with determination, and Draco follows close behind, while the three friends, situated outside, look up just in time to see a light flicker on in an arched window at the rear of the shop. In pursuit, they climb onto an adjacent rooftop, gaining an advantageous position to observe the Malfoys being escorted across a courtyard below into a towering room that extends from the ground floor all the way to the roof. From their vantage point, they observe Draco as he runs his hands over an intricately designed, tall, triangular wooden cabinet, its surface embossed with mysterious patterns. As several figures approach Draco, Harry strains to pull himself up further, seeking a clearer view. In a poignant moment, Narcissa kisses her son's cheek affectionately, and at that instant, someone appears at the window. Reacting quickly, Harry, Hermione, and Ron duck down to avoid detection as a bearded, thin-faced man peers out the window and subsequently lowers the blind. With the coast clear, Harry, feeling a sense of relief, looks up and audibly exhales. Meanwhile, the Hogwarts Express moves steadily through a landscape of barren moorland, where Luna can be seen holding a collection of magazines, while Ginny accompanies her with a Pygmy Puff in her possession. Ginny reads the magazine cover aloud, and Luna, with a casual grace, makes her way along the train corridor, her stack of magazines safely in hand. Elsewhere on the train, in a compartment of their own, Hermione, Harry, and Ron find themselves in a peaceful moment, seated together, away from the pressing events outside."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Bellatrix sets down the ornament, glares at Snape, and steps toward him before moving behind him and then walking away, still staring. Narcissa and Snape exchange anxious glances before grasping each other's wrists, as Bellatrix waves her wand to bind them with a glowing cord. The cord soon fades and disappears, leading Narcissa to release Snape's wrist and flex it. Outside a shop named Pieces of Modern Magic, a mechanical man performs a trick with a rabbit and a hat, observed by the Weasley twins and Ron, who also watches a mechanical toy of Dolores Umbridge. Amid the bustling scene, a boy walks up a wall, Harry receives a strange substance from the twins, and Ron interacts with Hermione and Harry as they pass Lavender. In Diagon Alley, a boy buys roasted chestnuts from a flame-breathing dragon and slides them into a bag. The group, led by Harry, enters the empty and burned-out shop attacked by Death Eaters, while Ron stops to look out a window. Meanwhile, Narcissa and Draco stealthily enter a narrow alley. The trio exits Ollivander's, glances at a wanted poster for Fenrir Greyback, and follows the Malfoys to Borgin and Burke’s. They observe from an adjoining roof as the Malfoys enter the shop, watch Draco with a wooden cabinet, and see Narcissa kiss Draco while figures approach him. As someone appears at a window, the trio ducks down to avoid being seen and Harry breathes a sigh of relief. On the Hogwarts Express traveling through barren moorland, Luna holds magazines while Ginny reads and carries a Pygmy Puff. Luna strolls the corridor, and further back, Hermione, Harry, and Ron occupy their own compartment."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Bellatrix sets down the ornament, a delicate dark object known to amplify dark magic, and glares at Snape, the enigmatic Potions Master of Hogwarts. Narcissa, her composure strained as usual under family tensions, glances at her sister then looks anxiously back to Snape, stands, and they both stare at Bellatrix. Bellatrix, filled with a fury that echoes her reputation as one of Voldemort's most loyal followers, steps towards Snape, moves behind him, but then walks away while staring, open-mouthed. Narcissa and Snape grasp each other's right wrist in a traditional wizarding oath, and Bellatrix waves her wand from which a glowing cord emerges, causing a glowing cord to bind their wrists together as part of the Unbreakable Vow ritual. Narcissa stares unwaveringly at Snape, a trust mingled with desperation, as Bellatrix stands close to him, her presence menacing. The cord binding their wrists fades and disappears, Narcissa releases her grip, and flexes her wrist in the tense silence.\n\nAt a shop called Pieces of Modern Magic, renowned for its enchanted trinkets, outside, a mechanical man ingeniously crafted by a skilled charm worker makes the rabbit on his head disappear under a big top hat. The Weasley twins, famous for their mischievous inventions, are present, a boy looks sick, perhaps overwhelmed by the bustling magic around, and Ron, eyeing the spectacle cautiously, watches a mechanical toy of Dolores Umbridge, a notorious Ministry official, balancing on a tightrope. A boy, charmed by novelty, walks up a wall, defying gravity. Harry, with a keen eye for the unusual, spots a strange substance, and the twins, always eager to share their latest prank, give him some. A handsome youth, Cormac, known for his confidence and Quidditch skills, smiles at Hermione who puts down a love potion, a popular yet controversial magical item. Ron turns to Hermione and Harry, and they pass Lavender, a girl with curly hair and an obvious fondness for Ron, who watches him go with interest. Outside, a little dragon, no bigger than a large cat, breathes flames, roasting chestnuts, which a boy buys before sliding down a chute into a bag designed to prevent scorching. They're in Diagon Alley, the bustling wizarding marketplace, and enter the empty and burned-out shop the Death Eaters attacked, a grim reminder of the recent violence, with Harry leading, followed by Ron and then Hermione. Ron stops by a window and looks out, perhaps considering the chaos that has unfolded.\n\nNarcissa and Draco, aware of the constant danger, look around furtively before entering a narrow alley. The trio leave Ollivander's, where wands of all kinds are crafted, and peek around the corner where there's a wanted poster for Fenrir Greyback, the notorious werewolf and bearded Death Eater who attacked the shop. They follow the Malfoys down the gloomy alleyway as the Malfoys descend steps to a shop with a sign above its door, Borgin and Burke, famed for dealing in dark artefacts. Narcissa strides in, and Draco follows, while the three friends look up as a light comes on in an arched window in the rear of the shop. They climb onto an adjoining roof and watch as the Malfoys are led across a courtyard below into a high room that reaches from the ground floor to the roof, likely used for storing contraband. They see Draco running his hands over a tall, triangular, embossed wooden cabinet, which Harry, in horror, recognizes as a Vanishing Cabinet, and several figures approach Draco as Harry hauls himself up to get a better view. Narcissa kisses her son's cheek, a tender moment in stark contrast to their grim surroundings, and someone appears at a window. Harry, Hermione, and Ron duck down as a thin-faced man with a beard, a shop assistant or perhaps an ally of the Malfoys, looks out and lowers the blind. Harry looks up and breathes a sigh of relief, his heart pounding with the thrill of narrowly avoiding detection.\n\nThe Hogwarts Express, the iconic scarlet train ferrying students to the school, chugs through barren moorland, where Luna, eccentric and known for her wit and Ravenclaw wisdom, holds magazines and Ginny, fierce and independent, has a Pygmy Puff, a small fluffy creature that is a popular pet. Ginny reads the cover, perhaps the latest issue of The Quibbler, and Luna saunters along the corridor with her magazines. Further back on the train, Hermione, Harry, and Ron have a compartment to themselves, relishing the brief respite from the ongoing uncertainty and danger."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Bellatrix sets down the ornament and glares at Snape. Narcissa glances at her sister then looks anxiously back to. Snape stands and they both stare at Bellatrix. Bellatrix steps towards Snape moves behind him but then walks away while staring openmouthed. Narcissa and Snape grasp each other's right wrist and Bellatrix waves her wand causing a glowing cord to bind their wrists together. Narcissa stares unwaveringly at Snape as Bellatrix stands close to him. The cord binding their wrists fades and disappears. Narcissa releases her grip and flexes her wrist. At a shop called Pieces of Modern Magic outside a mechanical man makes the rabbit on his head disappear under a big top hat. The Weasley twins are present. a boy looks sick and Ron watches a mechanical toy of Dolores Umbridge balancing on a tightrope. A boy walks up a wall. Harry spots a strange substance and the twins give him some. A handsome youth Cormac smiles at Hermione who puts down a love potion. Ron turns to Hermione and Harry and they pass. Lavender a girl with curly hair who watches him go. Outside a little dragon breathes flames roasting chestnuts which a boy buys before sliding down a chute into a bag. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. They are in Diagon Alley and enter the empty and burnedout shop. the Death Eaters attacked with Harry leading followed by Ron and then Hermione. Ron stops by a window and looks out. Narcissa and Draco look around furtively before entering a narrow alley. The trio leave Ollivander's and peek around the corner where there is a wanted poster for Fenrir Greyback the bearded Death Eater who attacked the shop. They follow the Malfoys down the gloomy alleyway as the Malfoys descend steps to a shop with a sign above its door. Borgin and Burke. Narcissa strides in and Draco follows while the three friends look up as a light comes on in an arched window in the rear of the shop. They climb onto an adjoining roof and watch as the Malfoys are led across a courtyard below into a high room that reaches from the ground floor to the roof. They see Draco running his hands over a tall triangular embossed wooden cabinet and several figures approach Draco as Harry hauls himself up to get a better view. Narcissa kisses her son's cheek and someone appears at a window. Harry Hermione and Ron duck down as a thinfaced man with a beard looks out and lowers the blind. Harry looks up and breathes a sigh of relief. The Hogwarts Express chugs through barren moorland where Luna holds magazines and Ginny has a Pygmy Puff. Ginny reads the cover and Luna saunters along the corridor with her magazines. Further back on the train. Hermione Harry and Ron have a compartment to themselves."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Bellatrix sets down the ornament and glares at Snape. Narcissa glances at her sister then looks anxiously back to. Snape stands and they both stare at Bellatrix. Bellatrix steps towards Snape moves behind him but then walks away while staring openmouthed. Narcissa and Snape grasp each other's right wrist and Bellatrix waves her wand causing a glowing cord to bind their wrists together. Narcissa stares unwaveringly at Snape as Bellatrix stands close to him. The cord binding their wrists fades and disappears. Narcissa releases her grip and flexes her wrist. At a shop called Pieces of Modern Magic outside a mechanical man makes the rabbit on his head disappear under a big top hat. The Weasley twins are present. a boy looks sick and Ron watches a mechanical toy of Dolores Umbridge balancing on a tightrope. A boy walks up a wall. Harry spots a strange substance and the twins give him some. A handsome youth Cormac smiles at Hermione who puts down a love potion. Ron turns to Hermione and Harry and they pass. Lavender a girl with curly hair who watches him go. Outside a little dragon breathes flames roasting chestnuts which a boy buys before sliding down a chute into a bag. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. They are in Diagon Alley and enter the empty and burnedout shop. the Death Eaters attacked with Harry leading followed by Ron and then Hermione. Ron stops by a window and looks out. Narcissa and Draco look around furtively before entering a narrow alley. The trio leave Ollivander's and peek around the corner where there is a wanted poster for Fenrir Greyback the bearded Death Eater who attacked the shop. They follow the Malfoys down the gloomy alleyway as the Malfoys descend steps to a shop with a sign above its door. Borgin and Burke. Narcissa strides in and Draco follows while the three friends look up as a light comes on in an arched window in the rear of the shop. They climb onto an adjoining roof and watch as the Malfoys are led across a courtyard below into a high room that reaches from the ground floor to the roof. They see Draco running his hands over a tall triangular embossed wooden cabinet and several figures approach Draco as Harry hauls himself up to get a better view. Narcissa kisses her son's cheek and someone appears at a window. Harry Hermione and Ron duck down as a thinfaced man with a beard looks out and lowers the blind. Harry looks up and breathes a sigh of relief. The Hogwarts Express chugs through barren moorland where Luna holds magazines and Ginny has a Pygmy Puff. Ginny reads the cover and Luna saunters along the corridor with her magazines. Further back on the train. Hermione Harry and Ron have a compartment to themselves."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Bellatrix sets down the ornament and glares at Snape. Narcissa glances at her sister then looks anxiously back to. Snape stands and they both stare at Bellatrix. Bellatrix steps towards Snape moves behind him but then walks away while staring openmouthed. Narcissa and Snape grasp each other's right wrist and Bellatrix waves her wand causing a glowing cord to bind their wrists together. Narcissa stares unwaveringly at Snape as Bellatrix stands close to him. The cord binding their wrists fades and disappears. Narcissa releases her grip and flexes her wrist. At a shop called Pieces of Modern Magic outside a mechanical man makes the rabbit on his head disappear under a big top hat. They see Draco running his hands over a tall triangular embossed wooden cabinet and several figures approach Draco as Harry hauls himself up to get a better view. Narcissa kisses her son's cheek and someone appears at a window. Harry Hermione and Ron duck down as a thinfaced man with a beard looks out and lowers the blind. Harry looks up and breathes a sigh of relief. The Hogwarts Express chugs through barren moorland where Luna holds magazines and Ginny has a Pygmy Puff. Ginny reads the cover and Luna saunters along the corridor with her magazines. Further back on the train. Hermione Harry and Ron have a compartment to themselves."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Bellatrix sets down the ornament and glares at Snape. Narcissa glances at her sister then looks anxiously back to. Snape stands and they both stare at Bellatrix. Bellatrix steps towards Snape moves behind him but then walks away while staring openmouthed. Ginny reads the cover and Luna saunters along the corridor with her magazines. Further back on the train. Hermione Harry and Ron have a compartment to themselves."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Zelda drops the teacup and frowns at Marvin. Georgina peeks at her sibling then glances nervously back to Marvin, rises, and they both gaze at Zelda. Zelda strides towards Marvin, slips behind him, but then marches away while gawking, wide-eyed. Georgina and Marvin clasp each other's left ankle, and Zelda twirls her locket, causing a shimmering ribbon to wrap their ankles together. Georgina gazes steadfastly at Marvin as Zelda stands near him. The ribbon entwining their ankles fades and vanishes, Georgina loosens her hold, and bends her ankle. At a boutique called Fragments of Ancient Sorcery, outside, a robotic cat makes the turtle on its back vanish beneath an enormous sunhat. The Smith brothers are around, a girl looks queasy, and Leo observes a robotic figurine of Joan Arc twirling on a high wire. A girl climbs up a tree. Oliver notices a peculiar powder, and the brothers offer him some. A charming maiden, Clive, grins at Samantha who puts down a charm bracelet. Leo turns to Samantha and Oliver, and they walk past Ivy, a girl with straight hair, who observes him leave. Outside, a tiny griffon exhales sparks, toasting marshmallows, which a girl purchases before tumbling down a ramp into a sack. They're in Wizarding Way and enter the vacant and charred boutique the Sorcerers ransacked, with Oliver leading, followed by Leo and then Samantha. Leo halts by a door and peers out. Georgina and Marcus glance around stealthily before entering a wide avenue. The group departs Ollivander's and peers around the bend where there's a wanted portrait for Reginald Blackwater, the mustached Sorcerer who breached the boutique. They trail the Washingtons down the shadowy passageway as the Washingtons descend ladders to a boutique with a placard above its entrance, Mason and Noble. Georgina marches in, and Marcus follows, while the three acquaintances glance up as a lamp lights up in a dome-shaped portal in the back of the boutique. They climb onto a neighboring terrace and observe as the Washingtons are ushered across a plaza below into a lofty chamber that extends from floor to ceiling. They witness Marcus running his fingers over a broad, diamond-shaped, engraved metal trunk, and several shadows approach Marcus as Oliver pulls himself up to catch a clearer sight. Georgina kisses her son's temple, and a figure appears at a portal. Oliver, Samantha, and Leo crouch down as a thin-lipped woman with spectacles peers out and shuts the drape. Oliver glances up and exhales a breath of relief. The Magical Rail trundles through desolate grassland, where Luna clutches newspapers and Ginny holds a Pixie Puff. Ginny browses the headline, and Luna strolls down the aisle with her newspapers. Further back on the rail, Samantha, Oliver, and Leo have a carriage to themselves."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Bellatrix glares at Snape as Narcissa and Snape clasp each other's wrists. Bellatrix binds them with a magical cord that fades away, releasing their grip. At Pieces of Modern Magic, the Weasley twins, Ron, and Harry explore magical items. Cormac flirts with Hermione, and Lavender watches Ron. In Diagon Alley, Harry, Ron, and Hermione enter an attacked shop. Meanwhile, Narcissa and Draco furtively enter Borgin and Burke's shop. The trio follows to observe Draco examining a cabinet. Narcissa kisses Draco's cheek before a man lowers the blinds, prompting the trio to hide. The Hogwarts Express travels through moorland, with Luna holding magazines and Ginny a Pygmy Puff, while Hermione, Harry, and Ron sit together in a compartment."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Hermione Harry and Ron have a compartment to themselves Further back on the train Ginny reads the cover and Luna saunters along the corridor with her magazines The Hogwarts Express chugs through barren moorland where Luna holds magazines and Ginny has a Pygmy Puff Harry looks up and breathes a sigh of relief Harry Hermione and Ron duck down as a thinfaced man with a beard looks out and lowers the blind Narcissa kisses her son's cheek and someone appears at a window They see Draco running his hands over a tall triangular embossed wooden cabinet and several figures approach Draco as Harry hauls himself up to get a better view They climb onto an adjoining roof and watch as the Malfoys are led across a courtyard below into a high room that reaches from the ground floor to the roof Narcissa strides in and Draco follows while the three friends look up as a light comes on in an arched window in the rear of the shop Borgin and Burke They follow the Malfoys down the gloomy alleyway as the Malfoys descend steps to a shop with a sign above its door The trio leave Ollivander's and peek around the corner where there is a wanted poster for Fenrir Greyback the bearded Death Eater who attacked the shop Narcissa and Draco look around furtively before entering a narrow alley Ron stops by a window and looks out the Death Eaters attacked with Harry leading followed by Ron and then Hermione They are in Diagon Alley and enter the empty and burnedout shop Outside a little dragon breathes flames roasting chestnuts which a boy buys before sliding down a chute into a bag Lavender a girl with curly hair who watches him go Ron turns to Hermione and Harry and they pass A handsome youth Cormac smiles at Hermione who puts down a love potion Harry spots a strange substance and the twins give him some A boy walks up a wall a boy looks sick and Ron watches a mechanical toy of Dolores Umbridge balancing on a tightrope The Weasley twins are present At a shop called Pieces of Modern Magic outside a mechanical man makes the rabbit on his head disappear under a big top hat Narcissa releases her grip and flexes her wrist The cord binding their wrists fades and disappears Narcissa stares unwaveringly at Snape as Bellatrix stands close to him Narcissa and Snape grasp each other's right wrist and Bellatrix waves her wand causing a glowing cord to bind their wrists together Bellatrix steps towards Snape moves behind him but then walks away while staring openmouthed Snape stands and they both stare at Bellatrix Narcissa glances at her sister then looks anxiously back to Bellatrix sets down the ornament and glares at Snape"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Narcissa glances at her sister then looks anxiously back to Bellatrix sets down the ornament and glares at Snape Bellatrix steps towards Snape moves behind him but then walks away while staring openmouthed Snape stands and they both stare at Bellatrix Narcissa stares unwaveringly at Snape as Bellatrix stands close to him Narcissa and Snape grasp each other's right wrist and Bellatrix waves her wand causing a glowing cord to bind their wrists together Narcissa releases her grip and flexes her wrist The cord binding their wrists fades and disappears The Weasley twins are present At a shop called Pieces of Modern Magic outside a mechanical man makes the rabbit on his head disappear under a big top hat A boy walks up a wall a boy looks sick and Ron watches a mechanical toy of Dolores Umbridge balancing on a tightrope A handsome youth Cormac smiles at Hermione who puts down a love potion Harry spots a strange substance and the twins give him some Lavender a girl with curly hair who watches him go Ron turns to Hermione and Harry and they pass They are in Diagon Alley and enter the empty and burnedout shop Outside a little dragon breathes flames roasting chestnuts which a boy buys before sliding down a chute into a bag Ron stops by a window and looks out the Death Eaters attacked with Harry leading followed by Ron and then Hermione The trio leave Ollivander's and peek around the corner where there is a wanted poster for Fenrir Greyback the bearded Death Eater who attacked the shop Narcissa and Draco look around furtively before entering a narrow alley Borgin and Burke They follow the Malfoys down the gloomy alleyway as the Malfoys descend steps to a shop with a sign above its door They climb onto an adjoining roof and watch as the Malfoys are led across a courtyard below into a high room that reaches from the ground floor to the roof Narcissa strides in and Draco follows while the three friends look up as a light comes on in an arched window in the rear of the shop Narcissa kisses her son's cheek and someone appears at a window They see Draco running his hands over a tall triangular embossed wooden cabinet and several figures approach Draco as Harry hauls himself up to get a better view Harry looks up and breathes a sigh of relief Harry Hermione and Ron duck down as a thinfaced man with a beard looks out and lowers the blind Ginny reads the cover and Luna saunters along the corridor with her magazines The Hogwarts Express chugs through barren moorland where Luna holds magazines and Ginny has a Pygmy Puff Hermione Harry and Ron have a compartment to themselves Further back on the train"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They are in Diagon Alley and enter the empty and burnedout shop the Death Eaters attacked with Harry leading followed by Ron and then Hermione Ron stops by a window and looks out Narcissa and Draco look around furtively before entering a narrow alley The trio leave Ollivander's and peek around the corner where there is a wanted poster for Fenrir Greyback the bearded Death Eater who attacked the shop They follow the Malfoys down the gloomy alleyway as the Malfoys descend steps to a shop with a sign above its door Borgin and Burke Narcissa strides in and Draco follows while the three friends look up as a light comes on in an arched window in the rear of the shop They climb onto an adjoining roof and watch as the Malfoys are led across a courtyard below into a high room that reaches from the ground floor to the roof They see Draco running his hands over a tall triangular embossed wooden cabinet and several figures approach Draco as Harry hauls himself up to get a better view Narcissa kisses her son's cheek and someone appears at a window Harry Hermione and Ron duck down as a thinfaced man with a beard looks out and lowers the blind Harry looks up and breathes a sigh of relief The Hogwarts Express chugs through barren moorland where Luna holds magazines and Ginny has a Pygmy Puff Ginny reads the cover and Luna saunters along the corridor with her magazines Further back on the train Hermione Harry and Ron have a compartment to themselves Bellatrix sets down the ornament and glares at Snape Narcissa glances at her sister then looks anxiously back to Snape stands and they both stare at Bellatrix Bellatrix steps towards Snape moves behind him but then walks away while staring openmouthed Narcissa and Snape grasp each other's right wrist and Bellatrix waves her wand causing a glowing cord to bind their wrists together Narcissa stares unwaveringly at Snape as Bellatrix stands close to him The cord binding their wrists fades and disappears Narcissa releases her grip and flexes her wrist At a shop called Pieces of Modern Magic outside a mechanical man makes the rabbit on his head disappear under a big top hat The Weasley twins are present a boy looks sick and Ron watches a mechanical toy of Dolores Umbridge balancing on a tightrope A boy walks up a wall Harry spots a strange substance and the twins give him some A handsome youth Cormac smiles at Hermione who puts down a love potion Ron turns to Hermione and Harry and they pass Lavender a girl with curly hair who watches him go Outside a little dragon breathes flames roasting chestnuts which a boy buys before sliding down a chute into a bag"
        }
      ]
    }
  ]
}