{
  "ground_truth": "Harry gets up, takes something from the overhead luggage rack, goes out of the compartment, and walks along the corridor, hiding it behind his back. The train steams across a vast, brown landscape illuminated by the evening sun. Harry stops to let two girls pass and sees Draco in an open carriage with seats on either side, looking thoughtful as he glances down at the Peruvian Darkness Powder in his hand. Suddenly, darkness engulfs the carriage. Summoned by Pansy and Blaise, a surly boy with short-cropped hair, Draco sits down opposite them and glances up to see his briefcase move slightly on the luggage rack. As Hagrid stands swinging a lantern on the Hogwarts platform when the express pulls up, its headlight cuts through the darkness. Pansy and Blaise wait for Draco at the carriage door and finally leave their compartment, while Ron and Hermione leave theirs. Draco pulls his briefcase from the luggage rack, heads for the door to the next carriage, slides it shut, and pulls down the blind. All the blinds close, and something falls from the rack, crashing to the floor. Draco pulls off the invisibility cloak, revealing Harry immobilized and staring, stamps on him, flings the cloak back over Harry, and walks out of the carriage. He steps onto the almost deserted platform, glances along it, and steam rises as he walks away. Someone walks through the train, viewing it as if through a rose-tinted kaleidoscope, with pink and mauve shapes swirling. The carriage door opens, and it's Luna, wearing the blue and white Spectrespecs advertised in the Quibbler. She sees a cloud of silvery dust hovering above the floor and pulls out her wand. The invisibility cloak is removed, and Harry snaps out of the immobility spell as Luna raises her specs. Harry's nose is broken and bloody when they reach the school gates. Flitwick erects an invisible shield across the gates as Luna and Harry watch Draco snatch his walking stick from Filch, smirk at Harry, and walk away, with Snape following him. Luna raises her wand, and Harry's swollen and misshapen nose returns to normal, though blood remains on his upper lip, chin, and t-shirt. In the Great Hall, Ron is guzzling jelly and cream until Hermione hits him with a book, and Harry walks towards them. Dumbledore steps up to the lectern, a gilded owl on the front of it stretches its wings, and Ginny wipes blood from Harry's face. Professor Slughorn, in a gown and mortarboard, acknowledges the applause. Draco stares glumly ahead while Slytherins celebrate around him as the students glance at one another. Draco rests his chin on his hand, lost in thought, and remains seated.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Harry rises, takes something from the overhead baggage shelf, exits the compartment, and strolls along the hallway, concealing it behind his back. The train travels across a vast, brown terrain illuminated by the evening sun. Harry halts to allow two girls to pass and notices Draco in an open carriage with seats on either side, appearing thoughtful as he gazes down at the Peruvian Blackness Powder in his hand. Suddenly, darkness envelops the carriage. Summoned by Pansy and Blaise, a sullen boy with short-cropped hair, Draco sits down opposite them and glances up to see his briefcase shift slightly on the baggage shelf. As Hagrid stands swinging a lantern on the Hogwarts platform when the express arrives, its headlight pierces the darkness. Pansy and Blaise wait for Draco at the carriage door and finally exit their compartment, while Ron and Hermione exit theirs. Draco pulls his briefcase from the baggage shelf, heads for the door to the next carriage, slides it shut, and pulls down the curtain. All the curtains close, and something tumbles from the shelf, crashing to the floor. Draco pulls off the invisibility cloak, revealing Harry paralyzed and staring, stamps on him, flings the cloak back over Harry, and exits the carriage. He steps onto the nearly empty platform, glances along it, and steam rises as he walks away. Someone walks through the train, viewing it as if through a rose-tinted kaleidoscope, with pink and mauve forms swirling. The carriage door opens, and it's Luna, wearing the blue and white Spectrespecs advertised in the Quibbler. She sees a cloud of silvery dust hovering above the floor and draws out her wand. The invisibility cloak is removed, and Harry snaps out of the paralysis spell as Luna raises her specs. Harry's nose is broken and bloody when they reach the school gates. Flitwick erects an invisible shield across the gates as Luna and Harry observe Draco snatch his walking cane from Filch, smirk at Harry, and walk away, with Snape following him. Luna raises her wand, and Harry's swollen and misshapen nose returns to normal, though blood remains on his upper lip, chin, and t-shirt. In the Great Hall, Ron is devouring jelly and cream until Hermione strikes him with a book, and Harry walks towards them. Dumbledore steps up to the lectern, a gilded owl on the front of it spreads its wings, and Ginny wipes blood from Harry's face. Professor Slughorn, in a gown and mortarboard, acknowledges the applause. Draco stares sorrowfully ahead while Slytherins rejoice around him as the students glance at one another. Draco rests his chin on his hand, lost in contemplation, and remains seated."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Harry is gotten up by something, taken from the overhead luggage rack, gone out of the compartment, and the corridor is walked along by him while it is hidden behind his back. A vast, brown landscape is steamed across by the train as it is illuminated by the evening sun. Two girls are let pass by Harry, and he sees Draco in an open carriage with seats on either side, who looks thoughtful as he glances down at the Peruvian Darkness Powder in his hand. Suddenly, the carriage is engulfed by darkness. Pansy and Blaise summon a surly boy with short-cropped hair, who sits down opposite them, and Draco glances up to see his briefcase move slightly on the luggage rack. As Hagrid stands swinging a lantern on the Hogwarts platform when the express pulls up, darkness is cut through by its headlight. Draco is waited for at the carriage door by Pansy and Blaise, and finally, their compartment is left by them, while Ron and Hermione leave theirs. Draco pulls his briefcase from the luggage rack, heads for the door to the next carriage, slides it shut, and the blind is pulled down by him. All the blinds are closed, and something is made to fall from the rack, crashing to the floor. The invisibility cloak is pulled off by Draco, revealing Harry immobilized and staring. Harry is stamped on by him, the cloak is flung back over him, and the carriage is walked out of by Draco. He steps onto the almost deserted platform, the platform is glanced along by him, and he walks away as steam rises. Someone walks through the train, viewing it as if through a rose-tinted kaleidoscope, with pink and mauve shapes swirling. The carriage door is opened by Luna, who is wearing the blue and white Spectrespecs advertised in the Quibbler. She sees a cloud of silvery dust hovering above the floor and her wand is pulled out by her. Luna removes the invisibility cloak, and Harry snaps out of the immobility spell as she raises her specs. Harry's nose is found broken and bloody by Luna when the school gates are reached by them. Flitwick erects an invisible shield across the gates as Luna and Harry watch Draco snatch his walking stick from Filch. He smirks at Harry and walks away, with Snape following him. Luna raises her wand, and Harry's swollen and misshapen nose is returned to normal by her, though blood remains on his upper lip, chin, and t-shirt. In the Great Hall, Ron is guzzling jelly and cream until a book is hit on him by Hermione, and Harry walks towards them. Dumbledore steps up to the lectern, a gilded owl on the front of it stretches its wings, and Ginny wipes blood from Harry's face. Applause is acknowledged by Professor Slughorn, in a gown and mortarboard. Slytherins celebrate around Draco as he stares glumly ahead while students glance at one another. Draco rests his chin on his hand, lost in thought, and he remains seated."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry rises, retrieves something from the overhead rack, and exits the compartment, concealing it behind his back. The train crosses a vast, brown landscape lit by the evening sun. Harry pauses for two girls, spotting Draco in an open carriage, pondering the Peruvian Darkness Powder in his hand. Darkness suddenly envelops the carriage. Summoned by Pansy and Blaise, a surly boy with short hair, Draco sits opposite them and notices his briefcase shift on the rack. As Hagrid swings a lantern on the Hogwarts platform, the train's headlight pierces the darkness. Pansy and Blaise wait for Draco at the door, leaving their compartment as Ron and Hermione leave theirs. Draco retrieves his briefcase, heads to the next carriage, shuts the door, and lowers the blind. All blinds close, and something crashes to the floor. Draco removes the invisibility cloak, revealing Harry immobilized, stamps on him, covers him again, and exits the carriage. He steps onto the nearly empty platform, glances around, and steam rises as he departs. Someone walks through the train, seeing it through a rose-tinted kaleidoscope. The carriage door opens, revealing Luna in blue and white Spectrespecs from the Quibbler. She spots silvery dust hovering, draws her wand, and removes the cloak, breaking Harry's immobility spell. Harry's nose is broken and bloody at the school gates. Flitwick creates an invisible shield as Luna and Harry watch Draco take his walking stick from Filch, smirk at Harry, and leave, followed by Snape. Luna heals Harry's nose, though blood remains on his face. In the Great Hall, Ron devours jelly and cream until Hermione hits him with a book, and Harry approaches them. Dumbledore steps to the lectern, a gilded owl stretches its wings, and Ginny wipes blood from Harry's face. Professor Slughorn, in a gown and mortarboard, acknowledges applause. Draco stares ahead, lost in thought, as Slytherins celebrate around him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry retrieves something from the overhead rack, exits the compartment, and walks along the corridor, hiding it. The train crosses a sunlit, brown landscape. Harry pauses for two girls, sees Draco with Peruvian Darkness Powder, and darkness fills the carriage. Draco, summoned by Pansy and Blaise, sits opposite them, noticing his briefcase move. As Hagrid swings a lantern on the Hogwarts platform, the train's headlight pierces the darkness. Pansy and Blaise wait for Draco, who retrieves his briefcase, shuts the carriage door, and closes the blinds. Something falls, and Draco reveals Harry under an invisibility cloak, stamps on him, covers him again, and leaves. On the platform, Draco walks away as steam rises. Luna, wearing Spectrespecs, enters, sees silvery dust, and removes the cloak, freeing Harry from the spell. Harry's nose is broken when they reach the school gates. Flitwick shields the gates as Luna and Harry watch Draco take his walking stick from Filch and smirk. Luna heals Harry's nose, leaving blood on his face. In the Great Hall, Ron eats jelly and cream until Hermione hits him, and Harry approaches. Dumbledore speaks at the lectern, Ginny wipes Harry's face, and Slughorn acknowledges applause. Draco, lost in thought, remains seated as Slytherins celebrate."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry rises from his seat, reaching up to retrieve an item from the overhead luggage rack. With the object discreetly concealed behind his back, he exits the compartment and makes his way down the corridor. The train chugs steadily across a sprawling, brown landscape, bathed in the warm glow of the evening sun. As Harry pauses to allow two girls to pass by, he notices Draco seated in an open carriage. Draco appears deep in thought, his gaze fixed on the Peruvian Darkness Powder he holds in his hand. Suddenly, the carriage is enveloped in darkness. Responding to the summons of Pansy and Blaise, a boy with a surly demeanor and short-cropped hair, Draco takes a seat opposite them. He glances upward, noticing his briefcase shift slightly on the luggage rack. Meanwhile, Hagrid stands on the Hogwarts platform, swinging a lantern as the express train arrives, its headlight piercing through the surrounding darkness. Pansy and Blaise wait patiently for Draco at the carriage door before finally departing their compartment, just as Ron and Hermione leave theirs. Draco retrieves his briefcase from the luggage rack, makes his way to the door leading to the next carriage, slides it shut, and pulls down the blind. As all the blinds close, something tumbles from the rack, crashing to the floor. Draco removes the invisibility cloak, revealing Harry, who is immobilized and staring. Draco stamps on him, flings the cloak back over Harry, and exits the carriage. He steps onto the nearly deserted platform, casting a glance along it as steam rises around him while he walks away. Someone moves through the train, perceiving it as if through a rose-tinted kaleidoscope, with swirling pink and mauve shapes. The carriage door swings open, revealing Luna, who is wearing the blue and white Spectrespecs featured in the Quibbler. She notices a cloud of silvery dust hovering just above the floor and draws her wand. The invisibility cloak is removed, and Harry snaps out of the immobilizing spell as Luna raises her Spectrespecs. By the time they reach the school gates, Harry's nose is broken and bloody. Flitwick constructs an invisible shield across the gates while Luna and Harry watch Draco snatch his walking stick from Filch, smirk at Harry, and walk away, with Snape trailing behind him. Luna raises her wand, and Harry's swollen, misshapen nose returns to its normal state, though blood still stains his upper lip, chin, and t-shirt. In the Great Hall, Ron is voraciously consuming jelly and cream until Hermione hits him with a book, and Harry approaches them. Dumbledore steps up to the lectern, where a gilded owl on the front stretches its wings, and Ginny wipes the blood from Harry's face. Professor Slughorn, dressed in a gown and mortarboard, acknowledges the applause. Draco stares ahead with a glum expression while the Slytherins celebrate around him, and the students exchange glances. Draco rests his chin on his hand, lost in thought, and remains seated."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry rises deliberately from his seat, carefully extending his arm to reach up and retrieve an item from the overhead luggage rack situated above him. With the object now discreetly concealed behind his back, he exits the compartment with a purposeful stride, making his way down the narrow corridor. Outside the train, it chugs steadily along its predetermined path across a sprawling and expansive, brown landscape, which is beautifully bathed in the warm, golden glow of the setting evening sun. As Harry pauses momentarily to allow two girls to pass by him, he notices Draco seated alone in an open carriage nearby. Draco appears to be deep in thought, his gaze intently focused on the Peruvian Darkness Powder he is holding in his hand. Suddenly, the carriage is completely enveloped in an impenetrable shroud of darkness. Responding promptly to the summons of Pansy and Blaise, who has a surly demeanor and short-cropped hair, Draco takes a seat opposite them in the carriage. He glances upward, noticing his briefcase shift ever so slightly on the overhead luggage rack. Meanwhile, Hagrid stands on the Hogwarts platform, swinging his lantern in an arc as the express train arrives, its headlight piercing through the surrounding darkness. Pansy and Blaise wait patiently for Draco at the carriage door before they finally depart from their compartment, just as Ron and Hermione emerge from theirs. Draco retrieves his briefcase from the luggage rack, makes his way to the door leading to the next carriage, slides it shut behind him, and thoughtfully pulls down the blind. As all the blinds close around him, something unexpectedly tumbles from the rack, crashing with a loud noise to the floor below. Draco removes the invisibility cloak, revealing Harry, who is immobilized and staring up helplessly. Draco stamps on him with a smirk, flings the cloak back over Harry, and exits the carriage briskly. He steps onto the nearly deserted platform, casting a long glance along it as steam slowly rises around him while he walks away with purpose. Someone moves through the train, perceiving the world as if through a mesmerizing rose-tinted kaleidoscope, filled with swirling pink and mauve shapes. The carriage door swings open to reveal Luna, who is distinctively wearing the blue and white Spectrespecs featured prominently in the Quibbler. She notices a shimmering cloud of silvery dust that is hovering just above the floor and instinctively draws her wand. The invisibility cloak is removed, and Harry suddenly snaps out of the immobilizing spell just as Luna raises her Spectrespecs. By the time they reach the towering school gates, Harry's nose is broken and bloody. Flitwick diligently constructs an invisible shield across the gates as a protective measure, while Luna and Harry watch Draco confidently snatch his walking stick from Filch, smirk at Harry, and walk away, with Snape following closely behind him. Luna raises her wand skillfully, and Harry's swollen, misshapen nose returns to its normal state, though dark blood still stains his upper lip, chin, and t-shirt. In the Great Hall, Ron is voraciously consuming jelly and cream with enthusiasm until Hermione hits him with a book to get his attention, and Harry approaches them with measured steps. Dumbledore steps up to the lectern with authority, where a gilded owl on the front stretches its wings impressively, and Ginny kindly wipes the blood from Harry's face. Professor Slughorn, dressed in a distinguished gown and mortarboard, acknowledges the applause with a gracious nod. Draco stares straight ahead with a glum expression while the Slytherins celebrate exuberantly around him, and the students exchange meaningful glances. Draco rests his chin thoughtfully on his hand, lost in contemplation, and remains seated in his spot."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Harry rises from his seat, reaching up to the overhead luggage rack to retrieve an item, which he then conceals behind his back as he exits the compartment. He proceeds to walk along the corridor of the train, which is steaming through a vast, brown landscape bathed in the warm glow of the evening sun. As he moves forward, he pauses momentarily to allow two girls to pass by, and in doing so, he notices Draco seated in an open carriage with benches on either side. Draco appears deep in thought, his gaze fixed on the Peruvian Darkness Powder he holds in his hand. Without warning, the carriage is enveloped in darkness. Responding to a summons from Pansy and Blaise, a surly boy with short-cropped hair, Draco takes a seat opposite them and looks up just in time to see his briefcase shift slightly on the luggage rack. Meanwhile, as the Hogwarts Express pulls into the platform, Hagrid stands there, swinging a lantern, its headlight piercing through the surrounding darkness. Pansy and Blaise wait for Draco at the carriage door, eventually leaving their compartment, while Ron and Hermione exit theirs. Draco retrieves his briefcase from the luggage rack, makes his way to the door leading to the next carriage, slides it shut, and pulls down the blind. As all the blinds close, an object tumbles from the rack, crashing to the floor. Draco removes the invisibility cloak, revealing Harry, who is immobilized and staring. Draco stamps on him, then flings the cloak back over Harry and exits the carriage. He steps onto the nearly deserted platform, casting a glance along it as steam rises around him, and walks away. Meanwhile, someone traverses the train, perceiving it through a rose-tinted kaleidoscope, with pink and mauve shapes swirling. The carriage door opens to reveal Luna, adorned with the blue and white Spectrespecs featured in the Quibbler. She notices a cloud of silvery dust hovering above the floor and draws her wand. The invisibility cloak is removed, and Harry emerges from the immobility spell as Luna raises her specs. By the time they reach the school gates, Harry's nose is broken and bloody. Flitwick constructs an invisible shield across the gates while Luna and Harry observe Draco snatch his walking stick from Filch, smirk at Harry, and walk away, with Snape trailing behind him. Luna raises her wand, restoring Harry's swollen and misshapen nose to its normal state, though blood still stains his upper lip, chin, and t-shirt. In the Great Hall, Ron is voraciously consuming jelly and cream until Hermione interrupts him with a book, and Harry approaches them. Dumbledore steps up to the lectern, where a gilded owl on the front stretches its wings, and Ginny wipes the blood from Harry's face. Professor Slughorn, dressed in a gown and mortarboard, acknowledges the applause. Draco, meanwhile, stares glumly ahead as the Slytherins celebrate around him, with students exchanging glances. Lost in thought, Draco rests his chin on his hand and remains seated."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry retrieves an item from the overhead luggage rack and discreetly exits the train compartment, walking along the corridor. As the train travels through a sunlit, brown landscape, he pauses to let two girls pass and notices Draco in an open carriage, contemplating the Peruvian Darkness Powder. Darkness suddenly envelops the carriage. Draco, summoned by Pansy and Blaise, sits with them and notices his briefcase shift slightly on the luggage rack. As the train arrives at the Hogwarts platform, illuminated by Hagrid's lantern, Pansy and Blaise wait for Draco at the carriage door. Ron and Hermione also leave their compartment. Draco retrieves his briefcase, moves to the next carriage, closes the door, and lowers the blinds. Something falls from the rack, and Draco reveals Harry, immobilized under an invisibility cloak, stamps on him, covers him again, and exits the carriage. He steps onto the platform, glances around, and walks away as steam rises. Luna, wearing Spectrespecs, enters the train, sees silvery dust, and removes the invisibility cloak, freeing Harry from the spell. At the school gates, Harry's nose is broken and bloody. Flitwick creates an invisible shield as Luna and Harry watch Draco take his walking stick from Filch and smirk at Harry, with Snape following. Luna heals Harry's nose, though blood remains on his face. In the Great Hall, Ron eats jelly and cream until Hermione intervenes, and Harry joins them. Dumbledore approaches the lectern, and Ginny wipes blood from Harry's face. Professor Slughorn acknowledges applause, while Draco, lost in thought, remains seated as Slytherins celebrate around him."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry gets up, takes something from the overhead luggage rack which is full of travelers' bags and personal items, goes out of the compartment, and walks along the corridor, hiding it behind his back. The train, the Hogwarts Express known for its iconic route to the wizarding school, steams across a vast, brown landscape illuminated by the evening sun. Harry stops to let two girls pass, students excitedly chatting about the new school term, and sees Draco in an open carriage with seats on either side, looking thoughtful as he glances down at the Peruvian Darkness Powder in his hand, a magical substance known for creating impenetrable shadows. Suddenly, darkness engulfs the carriage. Summoned by Pansy and Blaise, both Slytherins known for their loyalty to Draco, a surly boy with short-cropped hair, Draco sits down opposite them and glances up to see his briefcase move slightly on the luggage rack. As Hagrid, the school's beloved gamekeeper with a giant's physique, stands swinging a lantern on the Hogwarts platform when the express pulls up, its headlight cuts through the darkness. Pansy and Blaise wait for Draco at the carriage door and finally leave their compartment, while Ron and Hermione, Harry's closest friends who have been with him through many adventures, leave theirs. Draco pulls his briefcase from the luggage rack, heads for the door to the next carriage, slides it shut, and pulls down the blind. All the blinds close, and something falls from the rack, crashing to the floor. Draco pulls off the invisibility cloak, a rare magical item that renders the wearer invisible, revealing Harry immobilized and staring, stamps on him, flings the cloak back over Harry, and walks out of the carriage. He steps onto the almost deserted platform, glances along it, and steam rises as he walks away. Someone walks through the train, viewing it as if through a rose-tinted kaleidoscope, with pink and mauve shapes swirling. The carriage door opens, and it's Luna, known for her eccentricity and unique perspective, wearing the blue and white Spectrespecs advertised in the Quibbler, her father's unconventional magazine. She sees a cloud of silvery dust hovering above the floor and pulls out her wand. The invisibility cloak is removed, and Harry snaps out of the immobility spell as Luna raises her specs. Harry's nose is broken and bloody when they reach the school gates. Flitwick, the Charms professor known for his diminutive stature yet vast magical skill, erects an invisible shield across the gates as Luna and Harry watch Draco snatch his walking stick from Filch, the school caretaker notorious for his strictness, smirk at Harry, and walk away, with Snape, the potions master whose loyalties are often questioned, following him. Luna raises her wand, and Harry's swollen and misshapen nose returns to normal, though blood remains on his upper lip, chin, and t-shirt. In the Great Hall, Ron is guzzling jelly and cream until Hermione hits him with a book, her usual method of keeping him in line, and Harry walks towards them. Dumbledore, the wise and revered headmaster of Hogwarts, steps up to the lectern, a gilded owl on the front of it stretches its wings, and Ginny, Ron's sister with a courageous spirit, wipes blood from Harry's face. Professor Slughorn, in a gown and mortarboard characteristic of his role as an honored teacher, acknowledges the applause. Draco stares glumly ahead while Slytherins, his house known for ambition and cunning, celebrate around him as the students glance at one another. Draco rests his chin on his hand, lost in thought, and remains seated."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Harry gets up takes something from the overhead luggage rack goes out of the compartment and walks along the corridor hiding it behind his back  The train steams across a vast brown landscape illuminated by the evening sun  Harry stops to let two girls pass and sees Draco in an open carriage with seats on either side looking thoughtful as he glances down at the Peruvian Darkness Powder in his hand  All the blinds close and something falls from the rack crashing to the floor  Draco pulls off the invisibility cloak revealing Harry immobilized and staring stamps on him flings the cloak back over Harry and walks out of the carriage  He steps onto the almost deserted platform glances along it and steam rises as he walks away  Someone walks through the train viewing it as if through a rosetinted kaleidoscope with pink and mauve shapes swirling  The carriage door opens and it's Luna wearing the blue and white Spectrespecs advertised in the Quibbler  She sees a cloud of silvery dust hovering above the floor and pulls out her wand  The invisibility cloak is removed and Harry snaps out of the immobility spell  as Luna raises her specs  Harry's nose is broken and bloody when they reach the school gates  Flitwick erects an invisible shield across the gates as Luna and Harry watch Draco snatch his walking stick from Filch smirk at Harry and walk away with Snape following him  Luna raises her wand and Harry's swollen and misshapen nose returns to normal though blood remains on his upper lip chin and tshirt  In the Great Hall Ron is guzzling jelly and cream until Hermione hits him with a book and Harry walks towards them  Dumbledore steps up to the lectern  a gilded owl on the front of it stretches its wings and Ginny wipes blood from Harry's face  Suddenly darkness engulfs the carriage  Summoned by Pansy and Blaise a surly boy with shortcropped hair  Draco sits down opposite them and glances up to see his briefcase move slightly on the luggage rack  As Hagrid stands swinging a lantern on the Hogwarts platform when the express pulls up its headlight cuts through the darkness  Pansy and Blaise wait for Draco at the carriage door and finally leave their compartment  while Ron and Hermione leave theirs  Draco pulls his briefcase from the luggage rack heads for the door to the next carriage slides it shut and pulls down the blind  All the blinds close and something falls from the rack crashing to the floor  Draco pulls off the invisibility cloak revealing Harry immobilized and staring stamps on him flings the cloak back over Harry and walks out of the carriage  He steps onto the almost deserted platform glances along it and steam rises as he walks away  Someone walks through the train viewing it as if through a rosetinted kaleidoscope with pink and mauve shapes swirling  The carriage door opens and it's Luna wearing the blue and white Spectrespecs advertised in the Quibbler  She sees a cloud of silvery dust hovering above the floor and pulls out her wand  The invisibility cloak is removed and Harry snaps out of the immobility spell  as Luna raises her specs  Harry's nose is broken and bloody when they reach the school gates  Flitwick erects an invisible shield across the gates as Luna and Harry watch Draco snatch his walking stick from Filch smirk at Harry and walk away with Snape following him  Luna raises her wand and Harry's swollen and misshapen nose returns to normal though blood remains on his upper lip chin and tshirt  In the Great Hall Ron is guzzling jelly and cream until Hermione hits him with a book and Harry walks towards them  Dumbledore steps up to the lectern  a gilded owl on the front of it stretches its wings and Ginny wipes blood from Harry's face  Professor Slughorn in a gown and mortarboard acknowledges the applause  Draco stares glumly ahead while Slytherins celebrate around him  as the students glance at one another Draco rests his chin on his hand lost in thought and remains seated"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Harry gets up takes something from the overhead luggage rack goes out of the compartment and walks along the corridor hiding it behind his back. The train steams across a vast brown landscape illuminated by the evening sun. Harry stops to let two girls pass and sees Draco in an open carriage with seats on either side looking thoughtful as he glances down at the Peruvian Darkness Powder in his hand. Suddenly darkness engulfs the carriage. Summoned by Pansy and Blaise a surly boy with shortcropped hair. Draco sits down opposite them and glances up to see his briefcase move slightly on the luggage rack. As Hagrid stands swinging a lantern on the Hogwarts platform when the express pulls up its headlight cuts through the darkness. Pansy and Blaise wait for Draco at the carriage door and finally leave their compartment. while Ron and Hermione leave theirs. Draco pulls his briefcase from the luggage rack heads for the door to the next carriage slides it shut and pulls down the blind. All the blinds close and something falls from the rack crashing to the floor. Draco pulls off the invisibility cloak revealing Harry immobilized and staring stamps on him flings the cloak back over Harry and walks out of the carriage. He steps onto the almost deserted platform glances along it and steam rises as he walks away. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Someone walks through the train viewing it as if through a rosetinted kaleidoscope with pink and mauve shapes swirling. The carriage door opens and it is Luna wearing the blue and white Spectrespecs advertised in the Quibbler. She sees a cloud of silvery dust hovering above the floor and pulls out her wand. The invisibility cloak is removed and Harry snaps out of the immobility spell. as Luna raises her specs. Harry's nose is broken and bloody when they reach the school gates. Flitwick erects an invisible shield across the gates as Luna and Harry watch Draco snatch his walking stick from Filch smirk at Harry and walk away with Snape following him. Luna raises her wand and Harry's swollen and misshapen nose returns to normal though blood remains on his upper lip chin and tshirt. In the Great Hall Ron is guzzling jelly and cream until Hermione hits him with a book and Harry walks towards them. Dumbledore steps up to the lectern. a gilded owl on the front of it stretches its wings and Ginny wipes blood from Harry's face. Professor Slughorn in a gown and mortarboard acknowledges the applause. Draco stares glumly ahead while Slytherins celebrate around him. as the students glance at one another Draco rests his chin on his hand lost in thought and remains seated."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Harry gets up takes something from the overhead luggage rack goes out of the compartment and walks along the corridor hiding it behind his back. The train steams across a vast brown landscape illuminated by the evening sun. Harry stops to let two girls pass and sees Draco in an open carriage with seats on either side looking thoughtful as he glances down at the Peruvian Darkness Powder in his hand. Suddenly darkness engulfs the carriage. Summoned by Pansy and Blaise a surly boy with shortcropped hair. Draco sits down opposite them and glances up to see his briefcase move slightly on the luggage rack. As Hagrid stands swinging a lantern on the Hogwarts platform when the express pulls up its headlight cuts through the darkness. Pansy and Blaise wait for Draco at the carriage door and finally leave their compartment. while Ron and Hermione leave theirs. Draco pulls his briefcase from the luggage rack heads for the door to the next carriage slides it shut and pulls down the blind. All the blinds close and something falls from the rack crashing to the floor. Draco pulls off the invisibility cloak revealing Harry immobilized and staring stamps on him flings the cloak back over Harry and walks out of the carriage. He steps onto the almost deserted platform glances along it and steam rises as he walks away. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Someone walks through the train viewing it as if through a rosetinted kaleidoscope with pink and mauve shapes swirling. The carriage door opens and it is Luna wearing the blue and white Spectrespecs advertised in the Quibbler. She sees a cloud of silvery dust hovering above the floor and pulls out her wand. The invisibility cloak is removed and Harry snaps out of the immobility spell. as Luna raises her specs. Harry's nose is broken and bloody when they reach the school gates. Flitwick erects an invisible shield across the gates as Luna and Harry watch Draco snatch his walking stick from Filch smirk at Harry and walk away with Snape following him. Luna raises her wand and Harry's swollen and misshapen nose returns to normal though blood remains on his upper lip chin and tshirt. In the Great Hall Ron is guzzling jelly and cream until Hermione hits him with a book and Harry walks towards them. Dumbledore steps up to the lectern. a gilded owl on the front of it stretches its wings and Ginny wipes blood from Harry's face. Professor Slughorn in a gown and mortarboard acknowledges the applause. Draco stares glumly ahead while Slytherins celebrate around him. as the students glance at one another Draco rests his chin on his hand lost in thought and remains seated."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Harry gets up takes something from the overhead luggage rack goes out of the compartment and walks along the corridor hiding it behind his back. The train steams across a vast brown landscape illuminated by the evening sun. Harry stops to let two girls pass and sees Draco in an open carriage with seats on either side looking thoughtful as he glances down at the Peruvian Darkness Powder in his hand. Suddenly darkness engulfs the carriage. Summoned by Pansy and Blaise a surly boy with shortcropped hair. Draco sits down opposite them and glances up to see his briefcase move slightly on the luggage rack. As Hagrid stands swinging a lantern on the Hogwarts platform when the express pulls up its headlight cuts through the darkness. Luna raises her wand and Harry's swollen and misshapen nose returns to normal though blood remains on his upper lip chin and tshirt. In the Great Hall Ron is guzzling jelly and cream until Hermione hits him with a book and Harry walks towards them. Dumbledore steps up to the lectern. a gilded owl on the front of it stretches its wings and Ginny wipes blood from Harry's face. Professor Slughorn in a gown and mortarboard acknowledges the applause. Draco stares glumly ahead while Slytherins celebrate around him. as the students glance at one another Draco rests his chin on his hand lost in thought and remains seated."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Harry gets up takes something from the overhead luggage rack goes out of the compartment and walks along the corridor hiding it behind his back. The train steams across a vast brown landscape illuminated by the evening sun. Harry stops to let two girls pass and sees Draco in an open carriage with seats on either side looking thoughtful as he glances down at the Peruvian Darkness Powder in his hand. Professor Slughorn in a gown and mortarboard acknowledges the applause. Draco stares glumly ahead while Slytherins celebrate around him. as the students glance at one another Draco rests his chin on his hand lost in thought and remains seated."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Oliver gets up, takes something from the overhead luggage rack, goes out of the compartment, and walks along the corridor, hiding it behind his back. The train steams across a vast, brown landscape illuminated by the evening sun. Oliver stops to let two girls pass and sees Neville in an open carriage with seats on either side, looking thoughtful as he glances down at the Peruvian Darkness Powder in his hand. Suddenly, darkness engulfs the carriage. Summoned by Lavender and Dean, a surly boy with short-cropped hair, Neville sits down opposite them and glances up to see his briefcase move slightly on the luggage rack. As McGonagall stands swinging a lantern on the Hogwarts platform when the express pulls up, its headlight cuts through the darkness. Lavender and Dean wait for Neville at the carriage door and finally leave their compartment, while Fred and George leave theirs. Neville pulls his briefcase from the luggage rack, heads for the door to the next carriage, slides it shut, and pulls down the blind. All the blinds close, and something falls from the rack, crashing to the floor. Neville pulls off the invisibility cloak, revealing Oliver immobilized and staring, stamps on him, flings the cloak back over Oliver, and walks out of the carriage. He steps onto the almost deserted platform, glances along it, and steam rises as he walks away. Someone walks through the train, viewing it as if through a rose-tinted kaleidoscope, with pink and mauve shapes swirling. The carriage door opens, and it's Cho, wearing the blue and white Spectrespecs advertised in the Quibbler. She sees a cloud of silvery dust hovering above the floor and pulls out her wand. The invisibility cloak is removed, and Oliver snaps out of the immobility spell as Cho raises her specs. Oliver's nose is broken and bloody when they reach the school gates. Trelawney erects an invisible shield across the gates as Cho and Oliver watch Neville snatch his walking stick from Quirrell, smirk at Oliver, and walk away, with Krum following him. Cho raises her wand, and Oliver's swollen and misshapen nose returns to normal, though blood remains on his upper lip, chin, and t-shirt. In the Great Hall, Dean is guzzling jelly and cream until Seamus hits him with a book, and Oliver walks towards them. Grindelwald steps up to the lectern, a gilded owl on the front of it stretches its wings, and Hermione wipes blood from Oliver's face. Professor Trelawney, in a gown and mortarboard, acknowledges the applause. Neville stares glumly ahead while Slytherins celebrate around him as the students glance at one another. Neville rests his chin on his hand, lost in thought, and remains seated."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Harry gets up, takes something from the overhead hat shelf, goes out of the enclosure, and walks along the passageway, hiding it behind his back. The plane zooms across a vast, green forest illuminated by the morning sun. Harry stops to let two girls pass and sees Draco in an open buggy with stools on either side, looking thoughtful as he glances down at the Brazilian Shadow Dust in his hand. Suddenly, shadows engulf the buggy. Summoned by Pansy and Blaise, a surly boy with short-cropped hair, Draco sits down opposite them and glances up to see his backpack move slightly on the hat shelf. As Hagrid stands swinging a flashlight on the Hogwarts airstrip when the chopper pulls up, its spotlight cuts through the shadows. Pansy and Blaise wait for Draco at the buggy door and finally leave their enclosure, while Ron and Hermione leave theirs. Draco pulls his backpack from the hat shelf, heads for the door to the next buggy, slides it shut, and pulls down the curtain. All the curtains close, and something falls from the rack, crashing to the floor. Draco pulls off the invisibility veil, revealing Harry immobilized and staring, stamps on him, flings the veil back over Harry, and walks out of the buggy. He steps onto the almost deserted runway, glances along it, and mist rises as he walks away. Someone walks through the plane, viewing it as if through a blue-tinted kaleidoscope, with azure and lavender shapes swirling. The buggy door opens, and it's Luna, wearing the red and yellow Spectrespecs advertised in the Quibbler. She sees a cloud of golden dust hovering above the floor and pulls out her wand. The invisibility veil is removed, and Harry snaps out of the immobility spell as Luna raises her specs. Harry's nose is broken and bloody when they reach the school entrance. Flitwick erects an invisible barrier across the entrance as Luna and Harry watch Draco snatch his umbrella from Filch, smirk at Harry, and walk away, with Snape following him. Luna raises her wand, and Harry's swollen and misshapen nose returns to normal, though blood remains on his upper lip, chin, and sweater. In the Great Hall, Ron is guzzling pudding and custard until Hermione hits him with a scroll, and Harry walks towards them. Dumbledore steps up to the podium, a silver hawk on the front of it stretches its wings, and Ginny wipes blood from Harry's face. Professor Slughorn, in a suit and cap, acknowledges the applause. Draco stares glumly ahead while Slytherins celebrate around him as the students glance at one another. Draco rests his chin on his hand, lost in thought, and remains seated."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Harry lies down, retrieves something from the overhead luggage rack, tumbles out of the compartment, and skips along the corridor, balancing it on his head. The train floats across a vast, brown landscape painted by the evening sun. Harry dances to let two girls fly past and spots Draco in an open carriage with seats on either side, looking puzzled as he tosses the Peruvian Darkness Powder in his hand. Suddenly, light overtakes the carriage. Noticed by Pansy and Blaise, a cheery boy with long, flowing hair, Draco leaps up opposite them and peers up to see his briefcase levitate slightly on the luggage rack. As Hagrid kneels waving a banner on the Hogwarts platform when the express floats up, its headlight scatters the light. Pansy and Blaise summon Draco at the carriage door and eventually enter their compartment, while Ron and Hermione linger in theirs. Draco nudges his briefcase from the luggage rack, reaches for the window to the next carriage, swings it shut, and raises the blind. All the blinds open, and something levitates from the rack, hovering above the floor. Draco dons the invisibility cloak, revealing Harry wriggling and grinning, hops over him, drapes the cloak back over Harry, and dances out of the carriage. He floats onto the almost crowded platform, peers along it, and fog swirls as he skips away. Someone skips through the train, viewing it as if through a cloudy kaleidoscope, with green and yellow shapes swirling. The carriage door closes, and it's Luna, wearing the red and gold Spectrespecs advertised in the Quibbler. She notices a carpet of golden dust resting above the floor and pushes out her wand. The invisibility cloak is worn, and Harry laughs out of the immobility spell as Luna lowers her specs. Harry's nose is straight and spotless when they exit the school gates. Flitwick dismantles an invisible net across the gates as Luna and Harry watch Draco offer his walking stick to Filch, wink at Harry, and skip away, with Snape trailing him. Luna lowers her wand, and Harry's perfect and handsome nose changes to peculiar, though sparkles remain on his upper lip, chin, and t-shirt. In the Great Hall, Ron is sipping jelly and cream until Hermione nudges him with a quill, and Harry dances towards them. Dumbledore hops up to the lectern, a gilded owl on the front of it blinks its eyes, and Ginny paints sparkles on Harry's face. Professor Slughorn, in a suit and top hat, ignores the applause. Draco grins brightly ahead while Slytherins stroll around him as the students laugh at one another. Draco taps his chin with his hand, lost in giggles, and remains dancing."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Harriet rises, retrieves something from the overhead fruit basket, exits the greenhouse, and meanders down the staircase, concealing it beneath her cloak. The rocket glides over a sprawling, ochre ocean bathed in the moonlight. Harriet pauses to let two peacocks cross and notices Damian in an open gondola with cushions on either side, appearing pensive as he gazes down at the Norwegian Daylight Sand in his paw. Instantly, daylight floods the gondola. Summoned by Penelope and Bryce, a cranky squirrel with cropped fur, Damian sits opposite them and looks up to see his backpack sway slightly on the fruit basket. As Hector stands swinging a flashlight on the Beauxbatons boardwalk when the shuttle arrives, its beacon pierces through the daylight. Penelope and Bryce wait for Damian at the gondola gate and eventually leave their greenhouse, while Isabel and Harold leave theirs. Damian snatches his backpack from the fruit basket, heads toward the next gondola's gate, slides it shut, and pulls down the curtain. All the curtains close, and something tumbles from the basket, thudding to the ground. Damian jerks off the visibility cloak, revealing Harriet immobilized and staring, stamps on her, flings the cloak back over Harriet, and exits the gondola. He steps onto the nearly barren boardwalk, glances along it, and mist rises as he departs. Somebody strolls through the rocket, perceiving it as if through a violet-tinted kaleidoscope, with turquoise and lavender forms whirling. The gondola gate opens, and it's Nellie, sporting the yellow and purple Moon Goggles featured in the Oracle. She observes a plume of golden ash hovering above the ground and retrieves her staff. The visibility cloak is lifted, and Harriet snaps out of the immobilization charm as Nellie raises her goggles. Harriet's ear is fractured and bruised when they reach the castle doors. Ferguson erects a transparent barrier across the doors as Nellie and Harriet watch Damian seize his fishing rod from Felix, grin at Harriet, and saunter off, with Slade trailing him. Nellie lifts her staff, restoring Harriet's bloated and deformed ear to its usual state, though bruises remain on her upper lip, cheek, and jacket. In the Grand Hall, Harold is gobbling pudding and ice cream until Isabel strikes him with a scroll, and Harriet approaches them. Dorian steps up to the podium, a silver fox on the front of it unfurls its tail, and Jennifer wipes bruises from Harriet's cheek. Professor Maple, in a tunic and beret, acknowledges the cheers. Damian gazes sullenly forward while Gryffindors revel around him as the attendees watch one another. Damian props his cheek on his hand, reflecting deeply, and stays seated."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Mark rises, lifts something from the overhead luggage rack, exits the compartment, and meanders along the corridor, concealing it beneath his coat. The train glides across a sprawling, sunlit landscape under the evening sky. Mark pauses to allow two dogs to trot by and spots Neville in an open carriage with seats on either side, appearing pensive as he peers at the Goblin Nightshade Dust in his hand. Abruptly, light floods the carriage. Summoned by Petunia and Cedric, a cheerful girl with braided hair, Neville settles down opposite them and peers upward to see his backpack shift slightly on the luggage rack. As Filch stands swinging a candle on the King's Cross platform when the express arrives, its whistle pierces the air. Petunia and Cedric wait for Neville at the carriage door and eventually leave their compartment, while Luna and Ginny leave theirs. Neville plucks his backpack from the luggage rack, proceeds to the door to the next carriage, slides it shut, and raises the shade. All the shades open, and something leaps from the rack, landing on the floor. Neville pulls off the invisibility cloak, uncovering Mark immobilized and staring, skips on him, tosses the cloak back over Mark, and strides out of the carriage. He steps onto the nearly empty platform, peeks along it, and fog descends as he strolls away. An owl flies through the train, sensing it as if through a lavender-scented crystal ball, with blue and amber shapes swirling. The carriage door creaks open, and it's Hermione, wearing the red and yellow Spectrespecs advertised in the Quibbler. She notices a mist of golden powder drifting above the floor and draws out her wand. The invisibility cloak is discarded, and Mark emerges from the paralysis spell as Hermione lifts her specs. Mark's arm is twisted and bruised when they approach the castle entrance. Sprout installs a visible barrier across the entrance as Hermione and Mark witness Neville snatch his umbrella from Filch, grin at Mark, and wander off, with McGonagall tailing him. Hermione lifts her wand, and Mark's twisted and crooked arm returns to shape, though the bruise remains on his forearm, elbow, and jacket. In the Great Hall, Neville is munching pies and pudding until Ginny nudges him with a quill, and Mark approaches them. Snape steps up to the podium, a silver cat on the front of it flicks its tail, and Luna wipes the bruise from Mark's arm. Professor McGonagall, in a cape and bonnet, accepts the applause. Neville gazes sadly forward while Gryffindors revel around him as the students exchange looks. Neville rests his forehead on his palm, absorbed in reverie, and stays put."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Harry gets up, grabs something from the overhead fruit basket, tumbles out of the enclosure, and skips along the sidewalk, juggling it in front of him. The ship sails across a vast, green ocean illuminated by the morning fog. Harry pauses to let two dogs frolic by and spots Draco in an open sedan with swings on either side, looking curious as he peers down at the Brazilian Light Powder in his lap. Abruptly, mist surrounds the sedan. Summoned by Pansy and Blaise, a brash boy with a spiky mohawk, Draco lounges down beside them and gazes up to see his fedora sway slightly on the hat stand. As Hagrid stands juggling a candle on the Diagon Alley pier when the ferry pulls in, its spotlight slices through the mist. Pansy and Blaise wait for Draco at the sedan's exit and eventually saunter out of their enclosure, while Ron and Hermione depart theirs. Draco snatches his fedora from the hat stand, strides toward the exit to the next sedan, slides it open, and pulls up the banner. All the banners lift, and something tumbles from the stand, clattering to the ground. Draco peels off the transparency tarp, revealing Harry frozen and wide-eyed, squashes on him, throws the tarp back over Harry, and skips out of the sedan. He strolls onto the mostly empty pier, scans along it, and fog billows as he strides away. Someone meanders through the ship, observing it as if through an amber-stained kaleidoscope, with golden and lavender patterns whirling. The sedan's exit swings open, and it's Luna, wearing the red and yellow Spectrespecs featured in the Quibbler. She notices a mist of silvery feathers floating above the ground and draws out her flute. The transparency tarp is lifted, and Harry shakes off the paralysis charm as Luna adjusts her specs. Harry's nose is twisted and bruised when they reach the castle entryway. Flitwick constructs a visible barrier across the entryway as Luna and Harry watch Draco pluck his umbrella from Filch, grin at Harry, and stride away, with Snape trailing him. Luna waves her flute, and Harry's swollen and misshapen nose returns to normal, though green paint remains on his cheek, neck, and jacket. In the Grand Ballroom, Ron is devouring custard and candy until Hermione taps him with a scroll, and Harry saunters towards them. Dumbledore steps up to the pulpit, a bronze raven on the front of it flaps its wings, and Ginny wipes paint from Harry's cheek. Professor Slughorn, in a suit and top hat, acknowledges the cheers. Draco gazes somberly forward while Slytherins revel around him as the students glance at one another. Draco props his cheek on his fist, deep in thought, and remains seated."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Tom leaps down, grabs a frisbee from the upper pantry shelf, dances out of the elevator, and scampers through the hallway, juggling it above his head. The airplane glides over a sprawling, green meadow lit by the morning moon. Tom pauses to let a pair of dogs trot by and spots Wendy in a narrow limousine with cushions on each side, appearing puzzled as she peers up at the Norwegian Mist Powder in her lap. Abruptly, mist unfolds within the limousine. Summoned by Lisa and Greg, a cheerful girl with long braided hair, Wendy nestles beside them and gazes down to see her backpack shuffle gently on the floorboards. As Neville prances, juggling a flashlight on the Hogsmeade pier when the ferry anchors, its taillight pierces through the mist. Lisa and Greg wait for Wendy at the limousine window and eventually exit their elevator, while Larry and Matilda exit theirs. Wendy fetches her backpack from the floorboards, charges for the window to the preceding limousine, slips it open, and rolls up the curtain. All the curtains roll up, and a coconut tumbles from the floorboards, smacking onto the tiles. Wendy pulls off the transparency cloak, unveiling Tom frozen and blinking, skips on him, throws the cloak back over Tom, and dances out of the limousine. She steps onto the nearly empty tarmac, surveys along it, and fog ascends as she skips away. Somebody skips through the airplane, examining it as though through a silver-streaked kaleidoscope, with orange and teal shapes whirling. The limousine window opens, and it's Zoe, sporting the red and yellow MagicSpecs advertised in the Times. She spots a swirl of golden smoke floating above the cushion and brandishes her flute. The transparency cloak is lifted, and Tom snaps free of the paralysis charm as Zoe lifts her spectacles. Tom's ankle is sprained and swollen when they reach the castle walls. McGonagall builds an opaque curtain along the walls as Zoe and Tom watch Wendy swipe her umbrella from Fudge, grin at Tom, and skip away, with Trelawney trailing her. Zoe raises her flute, and Tom's lumpy and bruised ankle returns to normal, though mud remains on his lower leg, ankle, and shoe. In the Grand Chamber, Larry is nibbling peanut butter and jam until Matilda taps him with a pillow, and Tom skips toward them. Dobby prances up to the podium, a silver fox on the edge of it yawns, and Molly wipes mud from Tom's ankle. Professor Sprout, in a jumpsuit and sunhat, nods to the clapping. Wendy glares sadly forward while Gryffindors rejoice around her as the teachers whisper to one another. Wendy rests her elbow on her knee, deep in memories, and stays put."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry retrieves something from the overhead rack and walks along the train corridor, hiding it behind his back. As the train crosses a vast landscape, he notices Draco in a carriage, contemplating Peruvian Darkness Powder. The carriage is suddenly engulfed in darkness. Draco joins Pansy and Blaise, then sees his briefcase move. Upon reaching the Hogwarts platform, Draco shuts the carriage door, and an item crashes to the floor. Draco removes an invisibility cloak, revealing an immobilized Harry, whom he stamps on, and then leaves with the cloak covering Harry. On the platform, Draco departs, and steam rises around him. Luna finds Harry under the cloak, and her Spectrespecs reveal silvery dust. After removing the cloak, Harry awakens from the spell, his nose broken. Luna heals Harry's nose, though remnants of blood remain. Draco snatches his walking stick from Filch and smirks at Harry as Snape follows him. In the Great Hall, Ron and Hermione are bickering, and Ginny cleans Harry's face. Dumbledore addresses the students, and Professor Slughorn is acknowledged. While Slytherins celebrate, Draco, deep in thought, sits glumly."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "as the students glance at one another Draco rests his chin on his hand lost in thought and remains seated Draco stares glumly ahead while Slytherins celebrate around him  Professor Slughorn in a gown and mortarboard acknowledges the applause  a gilded owl on the front of it stretches its wings and Ginny wipes blood from Harry's face  Dumbledore steps up to the lectern  In the Great Hall Ron is guzzling jelly and cream until Hermione hits him with a book and Harry walks towards them  Luna raises her wand and Harry's swollen and misshapen nose returns to normal though blood remains on his upper lip chin and tshirt  Flitwick erects an invisible shield across the gates as Luna and Harry watch Draco snatch his walking stick from Filch smirk at Harry and walk away with Snape following him  Harry's nose is broken and bloody when they reach the school gates  as Luna raises her specs  The invisibility cloak is removed and Harry snaps out of the immobility spell  She sees a cloud of silvery dust hovering above the floor and pulls out her wand  The carriage door opens and it's Luna wearing the blue and white Spectrespecs advertised in the Quibbler  Someone walks through the train viewing it as if through a rosetinted kaleidoscope with pink and mauve shapes swirling  He steps onto the almost deserted platform glances along it and steam rises as he walks away  Draco pulls off the invisibility cloak revealing Harry immobilized and staring stamps on him flings the cloak back over Harry and walks out of the carriage  All the blinds close and something falls from the rack crashing to the floor  Draco pulls his briefcase from the luggage rack heads for the door to the next carriage slides it shut and pulls down the blind  while Ron and Hermione leave theirs  Pansy and Blaise wait for Draco at the carriage door and finally leave their compartment  As Hagrid stands swinging a lantern on the Hogwarts platform when the express pulls up its headlight cuts through the darkness  Draco sits down opposite them and glances up to see his briefcase move slightly on the luggage rack  Summoned by Pansy and Blaise a surly boy with shortcropped hair  Suddenly darkness engulfs the carriage  Harry stops to let two girls pass and sees Draco in an open carriage with seats on either side looking thoughtful as he glances down at the Peruvian Darkness Powder in his hand  The train steams across a vast brown landscape illuminated by the evening sun  Harry gets up takes something from the overhead luggage rack goes out of the compartment and walks along the corridor hiding it behind his back "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Draco pulls his briefcase from the luggage rack heads for the door to the next carriage slides it shut and pulls down the blind  Harry gets up takes something from the overhead luggage rack goes out of the compartment and walks along the corridor hiding it behind his back  Flitwick erects an invisible shield across the gates as Luna and Harry watch Draco snatch his walking stick from Filch smirk at Harry and walk away with Snape following him  In the Great Hall Ron is guzzling jelly and cream until Hermione hits him with a book and Harry walks towards them  Someone walks through the train viewing it as if through a rosetinted kaleidoscope with pink and mauve shapes swirling  Draco sits down opposite them and glances up to see his briefcase move slightly on the luggage rack  a gilded owl on the front of it stretches its wings and Ginny wipes blood from Harry's face  Draco stares glumly ahead while Slytherins celebrate around him  Luna raises her wand and Harry's swollen and misshapen nose returns to normal though blood remains on his upper lip chin and tshirt  The carriage door opens and it's Luna wearing the blue and white Spectrespecs advertised in the Quibbler  Professor Slughorn in a gown and mortarboard acknowledges the applause  She sees a cloud of silvery dust hovering above the floor and pulls out her wand  The invisibility cloak is removed and Harry snaps out of the immobility spell  Pansy and Blaise wait for Draco at the carriage door and finally leave their compartment  as Luna raises her specs  The train steams across a vast brown landscape illuminated by the evening sun  as the students glance at one another Draco rests his chin on his hand lost in thought and remains seated Harry's nose is broken and bloody when they reach the school gates  Draco pulls off the invisibility cloak revealing Harry immobilized and staring stamps on him flings the cloak back over Harry and walks out of the carriage  Dumbledore steps up to the lectern  He steps onto the almost deserted platform glances along it and steam rises as he walks away  Harry stops to let two girls pass and sees Draco in an open carriage with seats on either side looking thoughtful as he glances down at the Peruvian Darkness Powder in his hand  Suddenly darkness engulfs the carriage  All the blinds close and something falls from the rack crashing to the floor  As Hagrid stands swinging a lantern on the Hogwarts platform when the express pulls up its headlight cuts through the darkness  Summoned by Pansy and Blaise a surly boy with shortcropped hair  while Ron and Hermione leave theirs "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The carriage door opens and it's Luna wearing the blue and white Spectrespecs advertised in the Quibbler  She sees a cloud of silvery dust hovering above the floor and pulls out her wand  The invisibility cloak is removed and Harry snaps out of the immobility spell  as Luna raises her specs  Harry's nose is broken and bloody when they reach the school gates  Flitwick erects an invisible shield across the gates as Luna and Harry watch Draco snatch his walking stick from Filch smirk at Harry and walk away with Snape following him  Luna raises her wand and Harry's swollen and misshapen nose returns to normal though blood remains on his upper lip chin and tshirt  In the Great Hall Ron is guzzling jelly and cream until Hermione hits him with a book and Harry walks towards them  Dumbledore steps up to the lectern  a gilded owl on the front of it stretches its wings and Ginny wipes blood from Harry's face  Professor Slughorn in a gown and mortarboard acknowledges the applause  Draco stares glumly ahead while Slytherins celebrate around him  as the students glance at one another Draco rests his chin on his hand lost in thought and remains seated Harry gets up takes something from the overhead luggage rack goes out of the compartment and walks along the corridor hiding it behind his back  The train steams across a vast brown landscape illuminated by the evening sun  Harry stops to let two girls pass and sees Draco in an open carriage with seats on either side looking thoughtful as he glances down at the Peruvian Darkness Powder in his hand  Suddenly darkness engulfs the carriage  Summoned by Pansy and Blaise a surly boy with shortcropped hair  Draco sits down opposite them and glances up to see his briefcase move slightly on the luggage rack  As Hagrid stands swinging a lantern on the Hogwarts platform when the express pulls up its headlight cuts through the darkness  Pansy and Blaise wait for Draco at the carriage door and finally leave their compartment  while Ron and Hermione leave theirs  Draco pulls his briefcase from the luggage rack heads for the door to the next carriage slides it shut and pulls down the blind  All the blinds close and something falls from the rack crashing to the floor  Draco pulls off the invisibility cloak revealing Harry immobilized and staring stamps on him flings the cloak back over Harry and walks out of the carriage  He steps onto the almost deserted platform glances along it and steam rises as he walks away  Someone walks through the train viewing it as if through a rosetinted kaleidoscope with pink and mauve shapes swirling "
        }
      ]
    }
  ]
}