{
  "ground_truth": "Fending off Gryffindor players, they pass the Quaffle, until one hurls it towards the goal. Ron swoops to save the shot. His supporters are ecstatic. In the air, Ron repulses wave after wave of Slytherin attacks. Hermione shakes her head but still looks towards. Gryffindor goes on the attack. A Slytherin Beater whacks a Bludger towards an opponent but misses and is himself knocked from his broomstick. A shot on target for Gryffindor brings cheers from their supporters, and a renewed attack by Slytherin in a V formation. The Quaffle zooms towards the goal. Ron saves it. His right fist raised in triumph, Ron looks down at the chanting crowd. Hermione barely smiles. Perfectly balanced on his broomstick, Ron raises both hands in the air. In the Gryffindor common room, he stands on a table showered with red confetti. Harry shows her the unopened vial of Liquid Luck. He shakes his head. Lavender flings her arms around Ron's neck and kisses him passionately. Harry grins. Next to him, Hermione takes a deep breath. As the kiss continues, she turns abruptly and walks out. Harry sees her go and follows. He hears sobbing in a dark corridor. From the top of a spiral staircase, he sees Hermione sitting on the bottom step, weeping. He walks down the steps, his shadow cast against the wall. Charm birds fly all around Hermione. She looks up at Harry. He sits down beside her. Ron and Lavender run into the cloister. She tries to lead Ron away. Hermione stands, her face grim. The birds dive headlong to attack Ron. He runs. They splat against a wooden door in a drift of feathers. Ron looks at Hermione in alarm and walks away. She sinks down onto the step. Hermione leans her head on Harry's shoulder. Awkwardly, he puts his hand on her arm. The celebration continues without Ron and Lavender, who run together up a flight of stairs. Standing beside a tall window, they move closer and kiss again. Draco Malfoy stands alone, high up on the astronomy tower. He leans on the balustrade and looks out over the school. Snow falls gently on the spires and roofs of Hogwarts. The cloisters are decorated with greenery. A raven-haired girl smiles. Luna with a knee-length tiered dress of pale pink silk, with chiffon ruffles round the neckline, skirt, and sleeves. Harry escorts her. They walk past a window bay, where Draco sits alone, deep in thought. His face grim, Draco walks along the upstairs corridor and stops. He closes his eyes. In the cluttered room, he pulls the heavy cloth from the cabinet. He opens the cabinet and places an apple inside. He opens the cabinet. The apple has gone.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Ward off Gryffindor athletes, they toss the Quaffle, until one flings it towards the goal. Ron swoops to avert the attempt. His fans are elated. In the sky, Ron repels surge after surge of Slytherin offensives. Hermione shakes her head but still gazes towards. Gryffindor proceeds on the assault. A Slytherin Beater strikes a Bludger towards an adversary but misses and is himself dislodged from his broomstick. A shot on mark for Gryffindor elicits cheers from their fans, and a renewed offensive by Slytherin in a V arrangement. The Quaffle zips towards the goal. Ron saves it. His right hand raised in victory, Ron gazes down at the chanting crowd. Hermione barely grins. Perfectly balanced on his broomstick, Ron lifts both hands in the air. In the Gryffindor common room, he stands on a table showered with crimson confetti. Harry shows her the unopened vial of Liquid Luck. He shakes his head. Lavender flings her arms around Ron's neck and kisses him passionately. Harry beams. Next to him, Hermione draws a profound breath. As the kiss persists, she turns abruptly and walks out. Harry sees her leave and follows. He hears sobbing in a shadowy hallway. From the top of a spiral staircase, he sees Hermione seated on the bottom step, weeping. He descends the steps, his shadow thrown against the wall. Enchantment birds flutter all around Hermione. She gazes up at Harry. He sits down beside her. Ron and Lavender dash into the cloister. She attempts to lead Ron away. Hermione rises, her face stern. The birds dive headlong to assail Ron. He runs. They splat against a timber door in a scatter of plumage. Ron gazes at Hermione in apprehension and walks away. She sinks down onto the step. Hermione leans her head on Harry's shoulder. Awkwardly, he places his hand on her arm. The festivity continues without Ron and Lavender, who run together up a flight of stairs. Standing beside a tall window, they move closer and kiss again. Draco Malfoy stands solitary, high up on the astronomy tower. He leans on the parapet and gazes out over the school. Snow descends softly on the spires and roofs of Hogwarts. The cloisters are adorned with greenery. A raven-haired girl smiles. Luna with a knee-length tiered dress of pale pink silk, with chiffon ruffles around the neckline, skirt, and sleeves. Harry escorts her. They stroll past a window bay, where Draco sits solitary, deep in thought. His face stern, Draco walks along the upper corridor and pauses. He closes his eyes. In the cluttered room, he pulls the hefty cloth from the cabinet. He opens the cabinet and places an apple inside. He opens the cabinet. The apple has vanished."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Fending off Gryffindor players, the Quaffle is passed by them until it is hurled towards the goal by one. The shot is saved by Ron. Ecstatic are his supporters. Wave after wave of Slytherin attacks is repulsed by Ron in the air. Her head is shaken by Hermione, but she still looks towards Ron. The attack is carried on by Gryffindor. A Bludger is whacked towards an opponent by a Slytherin Beater, but he misses and knocks himself from his broomstick. Cheers are brought by a shot on target for Gryffindor, and a V-formation renewed attack is made by Slytherin. The goal is zoomed towards by the Quaffle. It is saved by Ron. The crowd is looked down upon by Ron, his right fist raised in triumph. Hermione barely smiles. Perfectly balanced on his broomstick, both hands are raised in the air by Ron. He is showered with red confetti while standing on a table in the Gryffindor common room. The unopened vial of Liquid Luck is shown to her by Harry. His head is shaken. Her arms are flung around Ron's neck by Lavender, and he is kissed passionately by her. A grin is given by Harry. Next to him, Hermione takes a deep breath. As the kiss continues, she turns abruptly and walks out. Hermione is seen to go by Harry, and she is followed by him. Sobbing is heard by him in a dark corridor. From the top of a spiral staircase, Hermione is seen sitting on the bottom step, weeping by him. The steps are walked down by him, his shadow is cast against the wall. All around Hermione, charm birds fly. Harry is looked up at by her. He sits down beside her. Ron and Lavender run into the cloister. Ron is tried to be led away by her. Hermione stands, her face grim. The birds are dived headlong to attack Ron by them. He runs. Against a wooden door, they splat in a drift of feathers. Ron looks at Hermione in alarm and walks away. Onto the step, she sinks down. Her head is leaned on Harry's shoulder by Hermione. Awkwardly, his hand is put on her arm by him. The celebration continues without Ron and Lavender, who are run together by stairs up a flight of stairs. Beside a tall window, they stand, move closer, and kiss again. Draco Malfoy stands alone, high up on the astronomy tower. The balustrade is leaned on by him, and out over the school, he looks. Snow falls gently on the spires and roofs of Hogwarts. The cloisters are decorated with greenery. A raven-haired girl smiles. Luna is in a knee-length tiered dress of pale pink silk, with chiffon ruffles around the neckline, skirt, and sleeves. She is escorted by Harry. Past a window bay, they walk, where Draco sits alone, deep in thought. His face grim, the upstairs corridor is walked along by Draco and is stopped by him. His eyes are closed by him. In the cluttered room, the heavy cloth is pulled from the cabinet by him. The cabinet is opened by him, and an apple is placed inside. The cabinet is opened by him. The apple has gone."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Fending off Gryffindor players, they pass the Quaffle until one throws it at the goal. Ron swoops in to save it, thrilling his supporters. He deflects repeated Slytherin attacks. Hermione shakes her head but still watches. Gryffindor counters. A Slytherin Beater swings at a Bludger, misses, and is knocked from his broom. A Gryffindor shot draws cheers and prompts a Slytherin V-formation assault. The Quaffle speeds toward the goal—Ron saves it again. Raising his fist in triumph, he looks down at the chanting crowd. Hermione barely smiles. Balancing on his broom, Ron lifts both hands. In the Gryffindor common room, he stands on a table amid red confetti. Harry shows Hermione the unopened Liquid Luck vial and shakes his head. Lavender hugs and kisses Ron passionately. Harry grins; Hermione sighs, then walks off. Harry follows, hearing sobs in a dark corridor. At the bottom of a spiral staircase, Hermione weeps. Harry descends, his shadow on the wall. Charm birds flutter around Hermione. She looks up; he sits beside her. Ron and Lavender run into the cloister. As she pulls Ron away, Hermione rises, her face grim. Birds dive at Ron, who flees as they crash against a wooden door. Ron stares at Hermione, then walks off. She collapses onto the step. Hermione rests her head on Harry’s shoulder. He awkwardly places his hand on her arm. The celebration continues without them. Ron and Lavender kiss again near a tall window. Draco stands alone on the astronomy tower, gazing out over snowy Hogwarts. Cloisters are adorned with greenery. A raven-haired girl smiles. Luna wears a pale pink, knee-length dress with chiffon ruffles. Harry escorts her. They pass a bay window where Draco sits alone, grim. He walks the upstairs corridor, stops, and closes his eyes. In a cluttered room, he unveils and opens a cabinet, placing an apple inside. It vanishes when he opens it again."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Fending off Gryffindor players, they pass the Quaffle until one hurls it at the goal. Ron saves the shot, thrilling his supporters. He repels Slytherin attacks, while Hermione watches. Gryffindor attacks, and a Slytherin Beater misses a Bludger, falling off his broom. Gryffindor's shot excites their fans, prompting a Slytherin V-formation attack. Ron saves the Quaffle again, celebrating with raised fists. In the Gryffindor common room, Ron stands on a table with red confetti. Harry shows Hermione an unopened Liquid Luck vial. Lavender kisses Ron passionately, making Harry grin. Hermione leaves, and Harry follows, finding her weeping on a staircase. He sits beside her as charm birds fly around. Ron and Lavender enter, and Hermione's birds attack Ron, who flees. Hermione leans on Harry's shoulder. The celebration continues without Ron and Lavender, who kiss by a window. Draco Malfoy stands alone on the astronomy tower, watching snow fall on Hogwarts. The cloisters are decorated, and a raven-haired girl smiles. Luna wears a pink silk dress, escorted by Harry. They pass Draco, who is deep in thought. Draco walks to a cluttered room, opens a cabinet, places an apple inside, and finds it gone."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Fending off the determined Gryffindor players with skill and agility, they deftly pass the Quaffle back and forth, maintaining control, until one of them hurls it with force towards the goal. Ron, ever vigilant, swoops in just in time to save the shot. His supporters erupt into ecstatic cheers, their excitement palpable. High in the air, Ron continues to repulse wave after relentless wave of Slytherin attacks, showcasing his impressive skills. Hermione, observing the scene, shakes her head in disbelief but still keeps her gaze fixed on the action. Gryffindor then shifts to the offensive, launching their own attack. A Slytherin Beater, with a powerful swing, whacks a Bludger towards an opponent but misses the mark and ends up being knocked from his broomstick himself. A shot on target for Gryffindor elicits loud cheers from their enthusiastic supporters, while Slytherin responds with a renewed attack, forming a strategic V formation. The Quaffle zooms towards the goal once more, but Ron saves it again. With his right fist raised high in triumph, Ron looks down at the chanting crowd below. Hermione barely manages a smile. Perfectly balanced on his broomstick, Ron raises both hands triumphantly in the air. Later, in the Gryffindor common room, he stands proudly on a table, showered with a cascade of red confetti. Harry shows Hermione the unopened vial of Liquid Luck, shaking his head in disbelief. Lavender, filled with excitement, flings her arms around Ron's neck and kisses him passionately. Harry grins at the scene. Next to him, Hermione takes a deep breath, visibly affected. As the kiss continues, she turns abruptly and walks out, unable to watch any longer. Harry notices her departure and follows. He hears the sound of sobbing echoing in a dark corridor. From the top of a spiral staircase, he sees Hermione sitting on the bottom step, weeping softly. He walks down the steps, his shadow cast long against the wall. Charm birds flutter all around Hermione, creating a whimsical scene. She looks up at Harry as he sits down beside her, offering silent support. Ron and Lavender suddenly run into the cloister, and she tries to lead Ron away. Hermione stands, her face set in a grim expression. The charm birds dive headlong to attack Ron, who runs in alarm. They splat against a wooden door, leaving a drift of feathers behind. Ron looks at Hermione in alarm and then walks away, leaving her behind. She sinks down onto the step, feeling defeated. Hermione leans her head on Harry's shoulder, seeking comfort. Awkwardly, he places his hand on her arm, trying to console her. Meanwhile, the celebration continues without Ron and Lavender, who run together up a flight of stairs. Standing beside a tall window, they move closer and share another kiss. Elsewhere, Draco Malfoy stands alone, high up on the astronomy tower. He leans on the balustrade, looking out over the vast expanse of the school. Snow falls gently on the spires and roofs of Hogwarts, creating a serene scene. The cloisters are beautifully decorated with greenery, adding to the festive atmosphere. A raven-haired girl smiles, her expression warm and inviting. Luna, dressed in a knee-length tiered dress of pale pink silk, adorned with chiffon ruffles around the neckline, skirt, and sleeves, walks gracefully. Harry escorts her, and together they walk past a window bay, where Draco sits alone, deep in thought. His face is grim as he walks along the upstairs corridor and stops, closing his eyes in contemplation. In a cluttered room, he pulls the heavy cloth from the cabinet, revealing its contents. He opens the cabinet and places an apple inside. When he opens the cabinet again, the apple has mysteriously vanished."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In a remarkable display of skill and agility, the determined players from Gryffindor fend off their opponents with impressive prowess, deftly passing the Quaffle back and forth between them. They maintain firm control of the game until one of their players hurls it forcefully toward the goal. Ron, ever alert and vigilant, swoops in just in the nick of time to make a remarkable save. His devoted supporters explode into ecstatic cheers, their excitement and enthusiasm almost tangible. High up in the air, Ron continues to repulse wave after relentless wave of Slytherin attacks, showcasing his admirable skills with each deflected attempt.\n\nHermione, carefully observing the unfolding scene, shakes her head in disbelief yet remains fixated on the intense action below. Gryffindor then shifts their strategy and moves to the offensive, launching an aggressive attack of their own. A Slytherin Beater, with a powerful swing, sends a Bludger hurtling toward an opponent but misses the mark entirely, ending up knocked from his broomstick in the process. A perfectly aimed shot on target for Gryffindor brings loud cheers from their enthusiastic supporters, while Slytherin mounts a renewed and strategic counterattack, forming a classic V formation. The Quaffle zooms towards the goal once more, but once again, Ron saves it with ease. Raising his right fist high in triumph, Ron glances down at the chanting crowd below with an air of pride and satisfaction. Hermione can barely muster a smile but remains a supportive spectator. Perfectly balanced on his broomstick, with the confidence of a seasoned player, Ron raises both hands in the air triumphantly.\n\nLater, in the cozy Gryffindor common room, he stands proudly atop a table, showered in a cascade of vibrant red confetti. Harry approaches Hermione and shows her the unopened vial of Liquid Luck, shaking his head in disbelief at the scene unfolding. Filled with excitement and unable to contain her joy, Lavender throws her arms around Ron's neck, kissing him passionately. Harry, grinning at the cheerful scene, stands nearby. Next to him, Hermione takes a deep, steadying breath, visibly affected by the display. As the kiss continues unabated, she turns suddenly and walks out, unable to watch any longer. Harry, noticing her abrupt departure, follows her. He hears the sound of quiet sobbing echoing through a shadowy corridor. Descending from the top of a spiral staircase, he sees Hermione sitting on the bottom step, weeping softly. As he walks down the steps, his shadow stretches long against the wall. Charmed birds flutter all around Hermione, creating a whimsical and enchanting scene. Looking up at Harry as he sits down beside her, she finds silent support in his presence.\n\nSuddenly, Ron and Lavender appear in the cloister, and she attempts to lead Ron away. Hermione stands, her face set in a determined yet grim expression. The charm birds dive headlong to attack Ron, who runs away in alarm. They splat against a wooden door, leaving a drift of feathers behind. Ron looks at Hermione with a mixture of alarm and confusion, then walks away, leaving her behind. She sinks back down onto the step, feeling utterly defeated. Hermione leans her head gently on Harry's shoulder, seeking comfort and solace. Awkwardly, he places his hand on her arm, trying to console her in this moment of vulnerability. Meanwhile, the celebration continues elsewhere, without Ron and Lavender, who run together up a flight of stairs. Standing beside a tall, elegant window, they move closer and share another intimate kiss.\n\nElsewhere, high up on the astronomy tower, Draco Malfoy stands alone. He leans on the balustrade, looking out over the vast expanse of the school grounds. Snow falls gently on the spires and roofs of Hogwarts, creating a serene and picturesque scene. The cloisters are beautifully decorated with lush greenery, adding to the festive atmosphere. A raven-haired girl smiles warmly, her expression inviting. Luna, clad in a charming knee-length, tiered dress of pale pink silk, adorned with chiffon ruffles around the neckline, skirt, and sleeves, walks gracefully. Harry escorts her, and together they stroll past a window bay, where Draco sits alone, deep in thought and contemplation. His face is grim as he walks along the upstairs corridor, stopping momentarily to close his eyes in deep reflection. In a cluttered and dusty room, he pulls the heavy cloth from the cabinet, unveiling its contents. He opens the cabinet and places an apple inside, only to find it mysteriously vanished when he opens the cabinet door once again."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the Gryffindor players skillfully fend off their opponents, they deftly pass the Quaffle among themselves, maintaining a fluid motion until one player, with a determined look, hurls it towards the goal with all their might. Ron, with sharp reflexes and unwavering focus, swoops in just in time to save the shot, eliciting ecstatic cheers from his supporters. High above the pitch, Ron remains vigilant, repulsing wave after wave of Slytherin attacks with precision and determination. Hermione, watching intently, shakes her head in disbelief yet continues to look towards the action. Gryffindor, seizing the moment, launches an aggressive attack. Meanwhile, a Slytherin Beater, with a fierce swing, whacks a Bludger towards an opponent but miscalculates, resulting in him being knocked from his broomstick. The Gryffindor team, undeterred, takes a shot on target, prompting cheers from their supporters and a renewed, strategic attack by Slytherin in a tight V formation. The Quaffle zooms towards the goal once more, but Ron, with impeccable timing, saves it again. With his right fist raised in triumph, Ron looks down at the chanting crowd, basking in the moment. Hermione, watching from afar, barely manages a smile. Perfectly balanced on his broomstick, Ron raises both hands in the air, celebrating his success. Later, in the Gryffindor common room, he stands proudly on a table, showered with red confetti as the celebration continues. Harry, standing nearby, shows Hermione the unopened vial of Liquid Luck, shaking his head in disbelief at the day's events. Suddenly, Lavender, filled with excitement, flings her arms around Ron's neck and kisses him passionately, causing Harry to grin. Next to him, Hermione takes a deep breath, her emotions conflicted. As the kiss continues, she abruptly turns and walks out, unable to watch any longer. Harry, noticing her departure, follows her, his concern evident. He hears sobbing echoing in a dark corridor and, from the top of a spiral staircase, sees Hermione sitting on the bottom step, weeping. He walks down the steps, his shadow cast against the wall, and as he approaches, charm birds flutter all around Hermione. She looks up at Harry, her eyes filled with tears, and he sits down beside her, offering silent support. Just then, Ron and Lavender run into the cloister, and Lavender tries to lead Ron away. Hermione stands, her face set in a grim expression, and the charm birds, sensing her distress, dive headlong to attack Ron. He runs, startled, as the birds splat against a wooden door in a drift of feathers. Ron, looking back at Hermione in alarm, walks away, leaving her to sink down onto the step once more. Hermione leans her head on Harry's shoulder, seeking comfort, and he awkwardly places his hand on her arm, unsure of how to console her. Meanwhile, the celebration continues without Ron and Lavender, who run together up a flight of stairs. Standing beside a tall window, they move closer and share another kiss. Elsewhere, Draco Malfoy stands alone, high up on the astronomy tower, leaning on the balustrade as he gazes out over the school. Snow falls gently on the spires and roofs of Hogwarts, creating a serene scene. The cloisters are decorated with greenery, adding to the festive atmosphere. A raven-haired girl smiles, and Luna, dressed in a knee-length tiered dress of pale pink silk with chiffon ruffles around the neckline, skirt, and sleeves, walks gracefully beside Harry as he escorts her. They pass by a window bay where Draco sits alone, deep in thought, his face grim. Draco, with a heavy heart, walks along the upstairs corridor and stops, closing his eyes as if to gather his thoughts. In a cluttered room, he pulls a heavy cloth from a cabinet, revealing its contents. He opens the cabinet and places an apple inside, then closes it momentarily. When he opens the cabinet again, the apple has mysteriously vanished, leaving him to ponder the implications of this strange occurrence."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Fending off Gryffindor players, they pass the Quaffle until one attempts a goal, but Ron saves the shot, thrilling his supporters. In the air, Ron consistently deflects Slytherin's attacks, while Hermione watches with mixed emotions. Gryffindor counters with an offensive move, and a Slytherin Beater's missed Bludger strike results in his own fall. Gryffindor's successful shot elicits cheers, prompting a renewed Slytherin attack. Ron saves another goal, celebrating with a raised fist as the crowd chants. Hermione barely smiles as Ron, perfectly balanced, raises both hands in triumph. Later, in the Gryffindor common room, Ron stands on a table amidst red confetti. Harry shows Hermione the unopened vial of Liquid Luck, shaking his head. Lavender passionately kisses Ron, prompting Harry to grin and Hermione to leave abruptly. Harry follows her to a dark corridor, finding her weeping on a staircase. He sits beside her as charm birds fly around. Ron and Lavender enter the cloister, and Hermione's birds attack Ron, who flees. Hermione sinks onto the step, leaning on Harry's shoulder as he awkwardly comforts her. Meanwhile, Ron and Lavender continue their celebration, kissing by a tall window. Draco Malfoy stands alone on the astronomy tower, observing the snow-covered Hogwarts. The cloisters are adorned with greenery, and a raven-haired girl smiles. Luna, in a pale pink silk dress, walks with Harry past a window where Draco sits, deep in thought. Draco, with a grim expression, walks along the corridor, stops, and closes his eyes. In a cluttered room, he uncovers a cabinet, places an apple inside, and finds it gone upon reopening."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Fending off Gryffindor players, known for their daring and competitive spirit on the Quidditch pitch, they pass the Quaffle, a red ball used in the game to score points, until one hurls it towards the goal. Ron swoops to save the shot, demonstrating the agility and reflexes typical of a seasoned Quidditch Keeper. His supporters are ecstatic, their cheers echoing through the stadium. In the air, Ron repulses wave after wave of Slytherin attacks, known for their cunning and often ruthless tactics. Hermione shakes her head but still looks towards. Gryffindor goes on the attack. A Slytherin Beater whacks a Bludger, an enchanted iron ball meant to disrupt players, towards an opponent but misses and is himself knocked from his broomstick. A shot on target for Gryffindor brings cheers from their supporters, and a renewed attack by Slytherin in a V formation resembling an organized military maneuver. The Quaffle zooms towards the goal. Ron saves it with a dramatic leap. His right fist raised in triumph, Ron looks down at the chanting crowd that fills the stands of the Hogwarts Quidditch pitch. Hermione barely smiles. Perfectly balanced on his broomstick, Ron raises both hands in the air. In the Gryffindor common room, decorated with scarlet and gold as a testament to house pride, he stands on a table showered with red confetti. Harry shows her the unopened vial of Liquid Luck, a potion that grants the drinker an unparalleled streak of good fortune. He shakes his head. Lavender flings her arms around Ron's neck and kisses him passionately, a gesture causing a stir among the gathered students. Harry grins. Next to him, Hermione takes a deep breath. As the kiss continues, she turns abruptly and walks out, her expression unreadable. Harry sees her go and follows, concerned. He hears sobbing in a dark corridor lit dimly by torches. From the top of a spiral staircase, he sees Hermione sitting on the bottom step, weeping quietly. He walks down the steps, his shadow cast against the wall by the flickering flames. Charm birds, small magical creatures conjured by her spellwork, fly all around Hermione. She looks up at Harry. He sits down beside her. Ron and Lavender run into the cloister, an open gallery of arches and columns often used by students seeking privacy. She tries to lead Ron away. Hermione stands, her face grim and determined. The birds dive headlong to attack Ron. He runs, startled, as they splat against a wooden door in a drift of feathers. Ron looks at Hermione in alarm and walks away, confused by her actions. She sinks down onto the step, emotionally exhausted. Hermione leans her head on Harry's shoulder. Awkwardly, he puts his hand on her arm, offering silent comfort. The celebration continues without Ron and Lavender, who run together up a flight of stairs. Standing beside a tall window, they move closer and kiss again, oblivious to the world around them. Draco Malfoy stands alone, high up on the astronomy tower, a place often used for stargazing and reflection. He leans on the balustrade and looks out over the school. Snow falls gently on the spires and roofs of Hogwarts, the ancient castle blanketed in winter's quiet. The cloisters are decorated with greenery, a nod to the festive season approaching. A raven-haired girl smiles. Luna, known for her eccentric style, wears a knee-length tiered dress of pale pink silk, with chiffon ruffles round the neckline, skirt, and sleeves. Harry escorts her, his demeanor protective and kind. They walk past a window bay, where Draco sits alone, deep in thought, wrestling with hidden burdens. His face grim, Draco walks along the upstairs corridor and stops. He closes his eyes, a moment of introspection. In the cluttered room, known to some as the Room of Requirement, he pulls the heavy cloth from the cabinet. He opens the cabinet and places an apple inside, a mysterious task rumored to be linked to a dark purpose. He opens the cabinet. The apple has gone, a testament to the cabinet's ability to transport objects elsewhere."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Fending off Gryffindor players they pass the Quaffle until one hurls it towards the goal. Ron swoops to save the shot. His supporters are ecstatic. In the air Ron repulses wave after wave of Slytherin attacks. Hermione shakes her head but still looks towards. Gryffindor goes on the attack. A Slytherin Beater whacks a Bludger towards an opponent but misses and is himself knocked from his broomstick. A shot on target for Gryffindor brings cheers from their supporters and a renewed attack by Slytherin in a V formation. The Quaffle zooms towards the goal. Ron saves it. His right fist raised in triumph. Ron looks down at the chanting crowd. Hermione barely smiles. Perfectly balanced on his broomstick Ron raises both hands in the air. In the Gryffindor common room he stands on a table showered with red confetti. Harry shows her the unopened vial of Liquid Luck. He shakes his head. Lavender flings her arms around Ron's neck and kisses him passionately. Harry grins Next to him. Hermione takes a deep breath. As the kiss continues she turns abruptly and walks out. Harry sees her go and follows. He hears sobbing in a dark corridor. From the top of a spiral staircase he sees Hermione sitting on the bottom step weeping. He walks down the steps his shadow cast against the wall. Charm birds fly all around Hermione. She looks up at Harry. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. He sits down beside her. Ron and Lavender run into the cloister. She tries to lead Ron away. Hermione stands her face grim. The birds dive headlong to attack Ron. He runs. They splat against a wooden door in a drift of feathers. Ron looks at Hermione in alarm and walks away. She sinks down onto the step. Hermione leans her head on Harry's shoulder. Awkwardly he puts his hand on her arm. The celebration continues without Ron and Lavender who run together up a flight of stairs. Standing beside a tall window they move closer and kiss again. Draco Malfoy stands alone high up on the astronomy tower. He leans on the balustrade and looks out over the school. Snow falls gently on the spires and roofs of Hogwarts. The cloisters are decorated with greenery. A ravenhaired girl smiles. Luna with a kneelength tiered dress of pale pink silk with chiffon ruffles round the neckline skirt and sleeves. Harry escorts her. They walk past a window bay where Draco sits alone deep in thought. His face grim. Draco walks along the upstairs corridor and stops. He closes his eyes. In the cluttered room he pulls the heavy cloth from the cabinet. He opens the cabinet and places an apple inside. He opens the cabinet. The apple has gone."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Fending off Gryffindor players they pass the Quaffle until one hurls it towards the goal. Ron swoops to save the shot. His supporters are ecstatic. In the air Ron repulses wave after wave of Slytherin attacks. Hermione shakes her head but still looks towards. Gryffindor goes on the attack. A Slytherin Beater whacks a Bludger towards an opponent but misses and is himself knocked from his broomstick. A shot on target for Gryffindor brings cheers from their supporters and a renewed attack by Slytherin in a V formation. The Quaffle zooms towards the goal. Ron saves it. His right fist raised in triumph. Ron looks down at the chanting crowd. Hermione barely smiles. Perfectly balanced on his broomstick Ron raises both hands in the air. In the Gryffindor common room he stands on a table showered with red confetti. Harry shows her the unopened vial of Liquid Luck. He shakes his head. Lavender flings her arms around Ron's neck and kisses him passionately. Harry grins Next to him. Hermione takes a deep breath. As the kiss continues she turns abruptly and walks out. Harry sees her go and follows. He hears sobbing in a dark corridor. From the top of a spiral staircase he sees Hermione sitting on the bottom step weeping. He walks down the steps his shadow cast against the wall. Charm birds fly all around Hermione. She looks up at Harry. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. He sits down beside her. Ron and Lavender run into the cloister. She tries to lead Ron away. Hermione stands her face grim. The birds dive headlong to attack Ron. He runs. They splat against a wooden door in a drift of feathers. Ron looks at Hermione in alarm and walks away. She sinks down onto the step. Hermione leans her head on Harry's shoulder. Awkwardly he puts his hand on her arm. The celebration continues without Ron and Lavender who run together up a flight of stairs. Standing beside a tall window they move closer and kiss again. Draco Malfoy stands alone high up on the astronomy tower. He leans on the balustrade and looks out over the school. Snow falls gently on the spires and roofs of Hogwarts. The cloisters are decorated with greenery. A ravenhaired girl smiles. Luna with a kneelength tiered dress of pale pink silk with chiffon ruffles round the neckline skirt and sleeves. Harry escorts her. They walk past a window bay where Draco sits alone deep in thought. His face grim. Draco walks along the upstairs corridor and stops. He closes his eyes. In the cluttered room he pulls the heavy cloth from the cabinet. He opens the cabinet and places an apple inside. He opens the cabinet. The apple has gone."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Fending off Gryffindor players they pass the Quaffle until one hurls it towards the goal. Ron swoops to save the shot. His supporters are ecstatic. In the air Ron repulses wave after wave of Slytherin attacks. Hermione shakes her head but still looks towards. Gryffindor goes on the attack. A Slytherin Beater whacks a Bludger towards an opponent but misses and is himself knocked from his broomstick. A shot on target for Gryffindor brings cheers from their supporters and a renewed attack by Slytherin in a V formation. The Quaffle zooms towards the goal. Ron saves it. His right fist raised in triumph. Ron looks down at the chanting crowd. Hermione barely smiles. Perfectly balanced on his broomstick Ron raises both hands in the air. He leans on the balustrade and looks out over the school. Snow falls gently on the spires and roofs of Hogwarts. The cloisters are decorated with greenery. A ravenhaired girl smiles. Luna with a kneelength tiered dress of pale pink silk with chiffon ruffles round the neckline skirt and sleeves. Harry escorts her. They walk past a window bay where Draco sits alone deep in thought. His face grim. Draco walks along the upstairs corridor and stops. He closes his eyes. In the cluttered room he pulls the heavy cloth from the cabinet. He opens the cabinet and places an apple inside. He opens the cabinet. The apple has gone."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Fending off Gryffindor players they pass the Quaffle until one hurls it towards the goal. Ron swoops to save the shot. His supporters are ecstatic. In the air Ron repulses wave after wave of Slytherin attacks. Hermione shakes her head but still looks towards. Draco walks along the upstairs corridor and stops. He closes his eyes. In the cluttered room he pulls the heavy cloth from the cabinet. He opens the cabinet and places an apple inside. He opens the cabinet. The apple has gone."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Repelling the Ravensclaw turtles, they toss the frisbee, until one catapults it towards the basket. Max dives to intercept the disc. His fans are thrilled. In the skies, Max fends off wave after wave of Badger intrusions. Lisa shrugs but still glances skyward. Ravensclaw goes on the defense. A Badger hurler slams a pebble towards a challenger but misses and is himself toppled from his scooter. A strike on target for Ravensclaw brings applause from their followers, and a renewed push by Badger in a T formation. The frisbee rockets toward the basket. Max intercepts it. His left hand raised in victory, Max gazes down at the cheering crowd. Lisa barely smirks. Perfectly steady on his scooter, Max raises both feet in the air. In the Ravensclaw lounge, he stands on a bench covered with blue glitter. Sam shows her the unopened jar of Golden Syrup. He nods slightly. Betty throws her arms around Max's waist and embraces him intensely. Sam chuckles. Next to him, Lisa exhales deeply. As the embrace continues, she turns swiftly and strides away. Sam watches her leave and trails after her. He hears sniffing in a shadowy hallway. From the top of a circular staircase, he spots Lisa sitting on the lowest rung, crying. He descends the stairs, his silhouette stretching against the wall. Light orbs flutter all around Lisa. She glances up at Sam. He settles down beside her. Max and Betty dash into the arcade. She attempts to pull Max away. Lisa rises, her expression determined. The orbs plunge headfirst to assault Max. He sprints. They splatter against a metal gate in a puff of light. Max glances at Lisa in shock and departs. She collapses back onto the step. Lisa rests her head on Sam's shoulder. Hesitantly, he places his hand on her elbow. The festival continues without Max and Betty, who dash together up a staircase. Standing beside a wide doorway, they edge closer and embrace once more. Leo Lionheart stands solo, high on the observation platform. He leans on the railing and gazes out over the building. Rain falls softly on the turrets and rooftops of Skyward College. The arcades are adorned with flowers. A blonde-haired boy grins. Cassandra with an ankle-length flared gown of light blue satin, with velvet ribbons around the hemline, bodice, and sleeves. Sam leads her. They stroll past a glass alcove, where Leo rests alone, lost in contemplation. His expression serious, Leo wanders the lower hallway and halts. He shuts his eyes. In the crowded space, he removes the heavy tarp from the shelf. He unlocks the case and places a banana inside. He locks the case. The banana has disappeared."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Fending off Gryffindor players, they pass the Quaffle until one hurls it toward the goal, but Ron saves the shot, thrilling his supporters. Despite Hermione's mixed feelings, Ron continues to block Slytherin attacks. A Gryffindor shot on goal excites their fans, but Slytherin renews their attack. Ron saves another attempt, celebrating triumphantly. Later, in the Gryffindor common room, he stands on a table with red confetti around him. Harry shows Hermione the unopened Liquid Luck vial. Lavender passionately kisses Ron, making Harry grin, but Hermione walks away, upset. Harry follows and finds her crying alone. He comforts Hermione as Ron and Lavender leave together. Hermione's magical birds attack Ron, who flees in alarm. The celebration continues without them as they move closer and kiss again by a window. Elsewhere, Draco stands alone on the astronomy tower, gazing over snowy Hogwarts. In the cloisters, decorated with greenery, Luna appears in a pink silk dress with Harry. They pass Draco, who's lost in thought and troubled. He retrieves a cabinet, places an apple inside, and watches it disappear, indicating his ongoing internal conflict."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The apple has gone He opens the cabinet  He opens the cabinet and places an apple inside  In the cluttered room he pulls the heavy cloth from the cabinet  He closes his eyes  Draco walks along the upstairs corridor and stops  His face grim  They walk past a window bay where Draco sits alone deep in thought  Harry escorts her  Luna with a kneelength tiered dress of pale pink silk with chiffon ruffles round the neckline skirt and sleeves  A ravenhaired girl smiles  The cloisters are decorated with greenery  Snow falls gently on the spires and roofs of Hogwarts  He leans on the balustrade and looks out over the school  Draco Malfoy stands alone high up on the astronomy tower  Standing beside a tall window they move closer and kiss again  The celebration continues without Ron and Lavender who run together up a flight of stairs  Awkwardly he puts his hand on her arm  Hermione leans her head on Harry's shoulder  She sinks down onto the step  Ron looks at Hermione in alarm and walks away  They splat against a wooden door in a drift of feathers  He runs  The birds dive headlong to attack Ron  Hermione stands her face grim  She tries to lead Ron away  Ron and Lavender run into the cloister  He sits down beside her  She looks up at Harry  Charm birds fly all around Hermione  He walks down the steps his shadow cast against the wall  From the top of a spiral staircase he sees Hermione sitting on the bottom step weeping  He hears sobbing in a dark corridor  Harry sees her go and follows  As the kiss continues she turns abruptly and walks out  Hermione takes a deep breath  Harry grins Next to him  Lavender flings her arms around Ron's neck and kisses him passionately  He shakes his head  Harry shows her the unopened vial of Liquid Luck  In the Gryffindor common room he stands on a table showered with red confetti  Perfectly balanced on his broomstick Ron raises both hands in the air  Hermione barely smiles  Ron looks down at the chanting crowd  His right fist raised in triumph  Ron saves it  The Quaffle zooms towards the goal  A shot on target for Gryffindor brings cheers from their supporters and a renewed attack by Slytherin in a V formation  A Slytherin Beater whacks a Bludger towards an opponent but misses and is himself knocked from his broomstick  Gryffindor goes on the attack  Hermione shakes her head but still looks towards  In the air Ron repulses wave after wave of Slytherin attacks  His supporters are ecstatic  Ron swoops to save the shot  Fending off Gryffindor players they pass the Quaffle until one hurls it towards the goal "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Ron swoops to save the shot Fending off Gryffindor players they pass the Quaffle until one hurls it towards the goal In the air Ron repulses wave after wave of Slytherin attacks His supporters are ecstatic Gryffindor goes on the attack Hermione shakes her head but still looks towards A shot on target for Gryffindor brings cheers from their supporters and a renewed attack by Slytherin in a V formation A Slytherin Beater whacks a Bludger towards an opponent but misses and is himself knocked from his broomstick Ron saves it The Quaffle zooms towards the goal Ron looks down at the chanting crowd His right fist raised in triumph Perfectly balanced on his broomstick Ron raises both hands in the air Hermione barely smiles Harry shows her the unopened vial of Liquid Luck In the Gryffindor common room he stands on a table showered with red confetti Lavender flings her arms around Ron's neck and kisses him passionately He shakes his head Hermione takes a deep breath Harry grins Next to him Harry sees her go and follows As the kiss continues she turns abruptly and walks out From the top of a spiral staircase he sees Hermione sitting on the bottom step weeping He hears sobbing in a dark corridor Charm birds fly all around Hermione He walks down the steps his shadow cast against the wall He sits down beside her She looks up at Harry She tries to lead Ron away Ron and Lavender run into the cloister The birds dive headlong to attack Ron Hermione stands her face grim They splat against a wooden door in a drift of feathers He runs She sinks down onto the step Ron looks at Hermione in alarm and walks away Awkwardly he puts his hand on her arm Hermione leans her head on Harry's shoulder Standing beside a tall window they move closer and kiss again The celebration continues without Ron and Lavender who run together up a flight of stairs He leans on the balustrade and looks out over the school Draco Malfoy stands alone high up on the astronomy tower The cloisters are decorated with greenery Snow falls gently on the spires and roofs of Hogwarts Luna with a kneelength tiered dress of pale pink silk with chiffon ruffles round the neckline skirt and sleeves A ravenhaired girl smiles They walk past a window bay where Draco sits alone deep in thought Harry escorts her Draco walks along the upstairs corridor and stops His face grim In the cluttered room he pulls the heavy cloth from the cabinet He closes his eyes He opens the cabinet He opens the cabinet and places an apple inside The apple has gone"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ron and Lavender run into the cloister  She tries to lead Ron away  Hermione stands her face grim  The birds dive headlong to attack Ron  He runs  They splat against a wooden door in a drift of feathers  Ron looks at Hermione in alarm and walks away  She sinks down onto the step  Hermione leans her head on Harry's shoulder  Awkwardly he puts his hand on her arm  The celebration continues without Ron and Lavender who run together up a flight of stairs  Standing beside a tall window they move closer and kiss again  Draco Malfoy stands alone high up on the astronomy tower  He leans on the balustrade and looks out over the school  Snow falls gently on the spires and roofs of Hogwarts  The cloisters are decorated with greenery  A ravenhaired girl smiles  Luna with a kneelength tiered dress of pale pink silk with chiffon ruffles round the neckline skirt and sleeves  Harry escorts her  They walk past a window bay where Draco sits alone deep in thought  His face grim  Draco walks along the upstairs corridor and stops  He closes his eyes  In the cluttered room he pulls the heavy cloth from the cabinet  He opens the cabinet and places an apple inside  He opens the cabinet  The apple has gone Fending off Gryffindor players they pass the Quaffle until one hurls it towards the goal  Ron swoops to save the shot  His supporters are ecstatic  In the air Ron repulses wave after wave of Slytherin attacks  Hermione shakes her head but still looks towards  Gryffindor goes on the attack  A Slytherin Beater whacks a Bludger towards an opponent but misses and is himself knocked from his broomstick  A shot on target for Gryffindor brings cheers from their supporters and a renewed attack by Slytherin in a V formation  The Quaffle zooms towards the goal  Ron saves it  His right fist raised in triumph  Ron looks down at the chanting crowd  Hermione barely smiles  Perfectly balanced on his broomstick Ron raises both hands in the air  In the Gryffindor common room he stands on a table showered with red confetti  Harry shows her the unopened vial of Liquid Luck  He shakes his head  Lavender flings her arms around Ron's neck and kisses him passionately  Harry grins Next to him  Hermione takes a deep breath  As the kiss continues she turns abruptly and walks out  Harry sees her go and follows  He hears sobbing in a dark corridor  From the top of a spiral staircase he sees Hermione sitting on the bottom step weeping  He walks down the steps his shadow cast against the wall  Charm birds fly all around Hermione  She looks up at Harry  He sits down beside her "
        }
      ]
    }
  ]
}