{
  "ground_truth": "A young blond boy sits cross-legged in front of the large wooden TV set on screen in black and white. Seated guests clap as a movie clip plays at an award ceremony. A man is seated nearby. Sophie is slender and beautiful. A woman on stage reads her name, seated beside a gobsmacked Sophie. Sidney cracks a wide smile and claps. Shapely raven-haired Sophie rises from her seat, Sidney turns to the camera. A smartly dressed man and woman rise from a nearby table. Camera phone pictures of Ricky Gervais. Sidney stands at a red rope barrier. He has a pig on a lead. She looks around nervously. He grins as she lifts the barrier. Alison leads Sidney and the pig away. The Haymarket Hotel. Sidney is dressed as a waiter with a fake mustache. Britney wags her curly tail. Sidney tosses her a canape, and she snaffles it down. Obscuring his face with a tray of canapes, he saunters into the party past the Nazi Clipboard woman. He sits by a pool chatting with Thandie Newton. The brown-haired hotel manager knocks on Sidney's room door. He enters to find that the room has been trashed. Chocolates and booze bottles litter the floor by the open fridge, and upturned furniture is strewn about the room. Unseen, Britney trots out of the hotel room and scurries down a corridor to a lift. The electric doors close. Thandie smiles coyly. She bursts out laughing and pats him at the thigh. Britney wanders out of the lift. Thandie smiles flirtatiously. He sips champagne. She gives him a sultry look, and he grins as he lets out a bashful sigh disturbing the fake mustache. Noticing this, Thandie frowns. Britney urinates on a lady's red high heels. The PR Nazi pushes through the crowd. Sidney spots Britney. Thandie stands. Bouncers approach. Sidney scampers. The PR Nazi watches hawkishly. Thandie shrugs. Two bouncers give chase. A woman is pushed away. He takes a running jump and a photographer snaps him mid-flight. The postmodern review has a photo from the newspaper in which Clint Eastwood has him in a headlock. He hears the phone ringing, and staff arguing in the next room. Holding a lit cigarette, Sydney strides into his busy living room come office. A cover of postmodern review disparages Sharp's editor. The writers have gathered in a frenzy to watch the fight brew. The women flaunt and flip the fax machine over. An airplane soars through the blue sky. At night, the glimmer of a taxi staring out the window as he's swept through. He gazes, wide-eyed, at a sign over the entrance of a theater, cruises through Chinatown. His smile fades as he sees a helicopter.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A youthful fair-haired lad perches cross-legged in front of the large wooden television configuration on display in monochrome. Seated attendees applaud as a film excerpt plays at an accolade event. A gentleman is seated close. Sophie is slender and attractive. A lady on stage announces her designation, seated beside a flabbergasted Sophie. Sidney cracks a broad grin and applauds. Curvaceous raven-haired Sophie arises from her position, Sidney turns to the camera. A smartly attired gentleman and lady arise from a nearby table. Camera phone images of Ricky Gervais. Sidney stands at a crimson rope partition. He has a hog on a tether. She glances around apprehensively. He beams as she raises the partition. Alison conducts Sidney and the hog away. The Haymarket Hotel. Sidney is attired as a server with a counterfeit mustache. Britney wags her curly tail. Sidney throws her a hors d'oeuvre, and she devours it. Concealing his visage with a tray of hors d'oeuvres, he strolls into the gathering past the Nazi Clipboard female. He perches by a pool conversing with Thandie Newton. The brunette hotel director knocks on Sidney's suite portal. He enters to discover that the suite has been vandalized. Chocolates and liquor bottles clutter the floor by the open refrigerator, and overturned furnishings are scattered about the suite. Unnoticed, Britney trots out of the hotel suite and scampers down a hallway to a lift. The electric portals close. Thandie smiles coyly. She erupts into laughter and pats him on the thigh. Britney meanders out of the lift. Thandie smiles flirtatiously. He sips sparkling wine. She gives him a sultry glance, and he grins as he releases a bashful sigh disrupting the counterfeit mustache. Observing this, Thandie frowns. Britney urinates on a woman's crimson high heels. The PR Nazi pushes through the throng. Sidney notices Britney. Thandie stands. Security approaches. Sidney scampers. The PR Nazi observes sharply. Thandie shrugs. Two security personnel pursue. A lady is shoved aside. He takes a running leap and a photographer captures him mid-flight. The postmodern critique has an image from the periodical in which Clint Eastwood has him in a headlock. He hears the telephone ringing, and personnel quarrelling in the adjoining chamber. Holding a lit cigarette, Sydney strides into his bustling living room turned office. A cover of postmodern critique disparages Sharp's editor. The writers have assembled in a frenzy to observe the confrontation escalate. The females flaunt and flip the facsimile apparatus over. An airplane soars through the azure atmosphere. At night, the glimmer of a taxi staring out the pane as he's swept through. He gazes, wide-eyed, at a sign over the entryway of a theater, cruises through Chinatown. His grin diminishes as he perceives a helicopter."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A young blond boy is seated cross-legged in front of the large wooden TV set as black and white images are shown on screen. Clapping is done by seated guests as a movie clip is played at an award ceremony. Sitting nearby is a man. Slender and beautiful Sophie is described. Her name is read by a woman on stage, who sits beside a gobsmacked Sophie. A wide smile is cracked by Sidney as he claps. Shapely raven-haired Sophie is seen rising from her seat, and the camera is turned to by Sidney. A nearby table is where a smartly dressed man and woman are seated, and they rise. Ricky Gervais is captured by camera phones. At a red rope barrier stands Sidney. A pig is held by him on a lead. Nervously, she looks around. As the barrier is lifted by her, he grins. Sidney and the pig are led away by Alison. The Haymarket Hotel is mentioned. Dressed as a waiter with a fake mustache is Sidney. Britney's curly tail is wagged. A canape is tossed to her by Sidney, and it is snaffled down by her. His face is obscured with a tray of canapes as he saunters into the party past the Nazi Clipboard woman. Sitting by a pool, he chats with Thandie Newton. The room door of Sidney is knocked on by the brown-haired hotel manager. Upon entering, he finds that the room has been trashed. The floor by the open fridge is littered with chocolates and booze bottles, and the room is strewn with upturned furniture. Unseen, the hotel room is exited by Britney, and she scurries down a corridor to a lift. The electric doors are closed. A coy smile is given by Thandie. Laughing bursts out from her, and his thigh is patted by her. Out of the lift wanders Britney. A flirtatious smile is flashed by Thandie. Champagne is sipped by him. A sultry look is given by her, and a bashful sigh is let out by him, disturbing the fake mustache. This is noticed by Thandie, and she frowns. Red high heels of a lady are urinated on by Britney. Through the crowd pushes the PR Nazi. Britney is spotted by Sidney. Thandie stands. An approach is made by bouncers. Scampers are made by Sidney. The PR Nazi watches hawkishly. A shrug is given by Thandie. Two bouncers give chase. A woman is pushed away by him. He takes a running jump, and a photographer snaps him mid-flight. The postmodern review features a photo from the newspaper, where Clint Eastwood is seen having him in a headlock. The phone is heard ringing by him, and an argument is overheard by staff in the next room. Holding a lit cigarette, the busy living room come office is strode into by Sydney. A cover of postmodern review disparages Sharp's editor. A frenzy among the writers is gathered to watch the fight brew. The fax machine is flaunted and flipped over by the women. An airplane is seen soaring through the blue sky. At night, staring out the window as he's swept through is the glimmer of a taxi. At a sign over the entrance of a theater, he gazes wide-eyed, as Chinatown is cruised through by him. His smile fades as a helicopter is seen."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A young blond boy sits cross-legged in front of a large wooden TV showing a black-and-white screen. Guests clap as a movie clip plays at an award ceremony. A man sits nearby. Sophie, slender and beautiful, is announced as a winner, seated beside a shocked Sophie. Sidney smiles and claps. Raven-haired Sophie rises, and Sidney turns to the camera. A smartly dressed couple stands nearby. Camera phone pictures of Ricky Gervais. Sidney stands at a red rope barrier with a pig on a lead. She nervously looks around. He grins as she lifts the barrier. Alison leads Sidney and the pig away. At the Haymarket Hotel, Sidney, dressed as a waiter with a fake mustache, tosses a canape to Britney, who eats it. Hiding his face with a tray, he enters the party past the Nazi Clipboard woman. He chats with Thandie Newton by a pool. The hotel manager finds Sidney's room trashed with chocolates and booze bottles. Britney sneaks out and takes a lift. Thandie laughs and pats Sidney's thigh. Britney exits the lift. Thandie smiles flirtatiously. He sips champagne, and she gives him a sultry look. He grins, disturbing his fake mustache, and Thandie frowns. Britney urinates on a lady's red heels. The PR Nazi pushes through the crowd. Sidney spots Britney. Thandie stands as bouncers approach. Sidney runs, and the PR Nazi watches. Thandie shrugs. Bouncers chase him. A woman is pushed aside. He jumps, and a photographer captures him mid-flight. A newspaper photo shows Clint Eastwood with him in a headlock. He hears a phone ringing and staff arguing. Holding a lit cigarette, Sidney strides into his busy living room-office. A postmodern review cover criticizes Sharp's editor. Writers gather to watch a brewing fight. Women flaunt and flip the fax machine. An airplane soars in the blue sky. At night, he gazes out a taxi window, passing a theater sign and cruising through Chinatown. His smile fades at the sight of a helicopter."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A young blond boy sits cross-legged in front of a large wooden TV showing a black-and-white screen. Guests clap as a movie clip plays at an award ceremony. A man sits nearby. Sophie, slender and beautiful, is announced as a winner, leaving her gobsmacked. Sidney smiles and claps. Raven-haired Sophie rises, and Sidney turns to the camera. A smartly dressed couple stands nearby. Camera phone pictures of Ricky Gervais appear. Sidney stands at a red rope barrier with a pig on a lead. Alison lifts the barrier, leading Sidney and the pig away. At the Haymarket Hotel, Sidney, dressed as a waiter with a fake mustache, tosses a canape to Britney, who eats it. He hides his face with a tray and enters the party past the Nazi Clipboard woman. He chats with Thandie Newton by a pool. The hotel manager finds Sidney's trashed room. Britney sneaks out, scurrying to a lift. Thandie laughs and pats Sidney's thigh. Britney exits the lift. Thandie smiles flirtatiously, and Sidney sips champagne, disturbing his fake mustache. Thandie frowns as Britney urinates on a lady's red heels. The PR Nazi pushes through the crowd. Sidney spots Britney, and Thandie stands as bouncers approach. Sidney runs, and the PR Nazi watches. Two bouncers chase him. A photographer captures him mid-flight. A postmodern review shows a photo of Clint Eastwood with Sidney in a headlock. Sidney hears a phone ringing and staff arguing. Holding a cigarette, he enters his busy living room office. A postmodern review cover disparages Sharp's editor. Writers gather to watch the brewing fight. Women flip the fax machine. An airplane soars through the sky. At night, a taxi glimmers as Sidney gazes at a theater sign, cruising through Chinatown. His smile fades at the sight of a helicopter."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A young blond boy, with his hair neatly combed, sits cross-legged in front of the large, vintage wooden TV set, which displays images in classic black and white. The seated guests in the audience clap enthusiastically as a movie clip plays during the prestigious award ceremony. Nearby, a man is seated, observing the proceedings. Sophie, who is slender and strikingly beautiful, is present. A woman on stage, seated beside a gobsmacked Sophie, reads her name aloud. Sidney, with a wide, infectious smile, joins in the applause. The shapely, raven-haired Sophie gracefully rises from her seat, while Sidney turns his attention to the camera. A smartly dressed man and woman, seated at a nearby table, also rise. Camera phone pictures capture the moment with Ricky Gervais. Sidney stands confidently at a red rope barrier, holding a pig on a lead. She looks around nervously, scanning the room. He grins broadly as she lifts the barrier, allowing them to pass. Alison leads Sidney and the pig away from the scene. At the Haymarket Hotel, Sidney is cleverly disguised as a waiter, complete with a fake mustache. Britney, the pig, wags her curly tail with excitement. Sidney tosses her a canape, which she eagerly snaffles down. Obscuring his face with a tray of canapes, he saunters nonchalantly into the party, slipping past the stern Nazi Clipboard woman. He finds a spot by the pool and engages in a lively chat with Thandie Newton. The brown-haired hotel manager knocks on Sidney's room door, only to enter and discover the room in disarray. Chocolates and booze bottles are scattered across the floor by the open fridge, and upturned furniture is strewn about the room. Unseen, Britney trots out of the hotel room and scurries down a corridor to a lift. The electric doors close behind her. Thandie smiles coyly, then bursts out laughing and playfully pats him on the thigh. Britney wanders out of the lift, and Thandie smiles flirtatiously. He sips champagne, savoring the moment. She gives him a sultry look, and he grins, letting out a bashful sigh that disturbs the fake mustache. Noticing this, Thandie frowns slightly. Britney, in a mischievous moment, urinates on a lady's red high heels. The PR Nazi pushes through the crowd with determination. Sidney spots Britney, and Thandie stands up. Bouncers approach with intent. Sidney quickly scampers away. The PR Nazi watches hawkishly, while Thandie shrugs nonchalantly. Two bouncers give chase, pushing a woman aside in their pursuit. He takes a running jump, and a photographer captures him mid-flight. The postmodern review features a photo from the newspaper, showing Clint Eastwood having him in a headlock. He hears the phone ringing and staff arguing in the next room. Holding a lit cigarette, Sidney strides confidently into his busy living room, which doubles as an office. A cover of the postmodern review disparages Sharp's editor. The writers have gathered in a frenzy, eager to watch the fight brew. The women flaunt and flip the fax machine over in excitement. An airplane soars majestically through the clear blue sky. At night, the glimmer of a taxi's headlights illuminates the scene as he stares out the window, being swept through the city. He gazes wide-eyed at a sign over the entrance of a theater, as the taxi cruises through the vibrant streets of Chinatown. His smile fades as he catches sight of a helicopter hovering above."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A young blond boy, his hair neatly combed into place with precision, sits cross-legged right in front of the large, vintage wooden TV set, which faithfully displays images in the timeless classic black and white format. The seated guests within the audience clap with enthusiastic vigor as a movie clip plays on during the prestigious award ceremony. Nearby, a man is also seated, keenly observing the proceedings with attentive interest. Sophie, who is slender and strikingly beautiful in appearance, is present in the scene. A woman on stage, seated beside a gobsmacked and visibly surprised Sophie, reads her name aloud, announcing it clearly. Sidney, with a wide, infectious smile that spreads joy, joins in the applause with gusto. The shapely, raven-haired Sophie gracefully rises from her seat, radiating elegance, while Sidney turns his attention toward the camera capturing the moment. A smartly dressed man and woman, seated comfortably at a nearby table, also rise to join in the moment. Camera phone pictures eagerly capture the scene with Ricky Gervais in the frame. Sidney stands confidently at a red rope barrier, firmly holding a pig on a lead. She looks around nervously, her eyes scanning the room with uncertainty. He grins broadly as she lifts the red barrier, allowing them both to pass through. Alison then leads Sidney and the pig away from the vibrant scene. At the Haymarket Hotel, Sidney is cleverly disguised as a waiter, complete with a convincingly fake mustache adorning his face. Britney, the delightful pig, wags her curly tail with visible excitement. Sidney tosses her a canape, which she eagerly snaffles down with delight. Obscuring his face with a tray of canapes, he saunters nonchalantly into the lively party, effortlessly slipping past the stern and watchful Nazi Clipboard woman. He discovers a spot by the pool and engages in a lively, animated chat with Thandie Newton. The brown-haired hotel manager knocks on Sidney's room door, only to enter and discover the room in utter disarray. Chocolates and booze bottles are scattered across the floor near the open fridge, and upturned furniture is strewn haphazardly about the room. Unseen to everyone, Britney trots confidently out of the hotel room, scurrying quickly down a corridor to the lift. The electric doors close quietly behind her. Thandie smiles coyly, then bursts out laughing and playfully pats him on the thigh, expressing amusement. Britney wanders leisurely out of the lift, and Thandie smiles flirtatiously. He sips champagne, savoring the delightful moment. She gives him a sultry look, and he grins, letting out a bashful sigh that inadvertently disturbs the fake mustache. Noticing this shift, Thandie frowns slightly in response. Britney, in a mischievous moment, urinates on a lady's striking red high heels. The PR Nazi pushes with determination through the dense crowd. Sidney spots Britney, and Thandie stands up. Bouncers approach with clear intent. Sidney quickly scampers away, eager to avoid them. The PR Nazi watches hawkishly, while Thandie shrugs nonchalantly, unaffected by the chaos. Two bouncers give chase, pushing a woman aside in their urgent pursuit. He takes a running jump, and a photographer captures the moment, freezing him mid-flight. The postmodern review features a captivating photo from the newspaper, showing Clint Eastwood having him in a headlock. He hears the phone ringing insistently and staff arguing loudly in the next room. Holding a lit cigarette, Sidney strides confidently into his busy living room, which doubles functionally as an office space. A cover of the postmodern review disparages Sharp's editor with a biting headline. The writers have gathered in a frenzy, all eager and ready to watch the fight brew. The women flaunt their excitement and flip the fax machine over with enthusiasm. An airplane soars majestically through the clear blue sky above. At night, the glimmer of a taxi's headlights illuminates the scene as he stares thoughtfully out the window, being swept through the bustling city. He gazes wide-eyed at a sign over the entrance of a theater, as the taxi cruises smoothly through the vibrant streets of Chinatown. His smile gradually fades as he catches sight of a helicopter hovering imposingly above."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A young blond boy sits cross-legged on the floor, his eyes fixed intently on the large wooden TV set displaying a black-and-white image. As the screen flickers, seated guests in the room begin to clap enthusiastically while a movie clip plays during an award ceremony. Nearby, a man sits quietly, observing the scene. Sophie, who is slender and beautiful, sits beside him, her expression one of surprise as a woman on stage reads out her name. The announcement leaves Sophie gobsmacked, and Sidney, seated nearby, cracks a wide smile and joins in the applause. Shapely and raven-haired, Sophie rises gracefully from her seat, while Sidney turns his attention to the camera, capturing the moment. At a nearby table, a smartly dressed man and woman also rise, adding to the celebratory atmosphere. Meanwhile, camera phone pictures of Ricky Gervais are being taken, capturing the excitement of the event. Sidney stands at a red rope barrier, holding a pig on a lead, and as he looks around nervously, a woman lifts the barrier, allowing Alison to lead Sidney and the pig away. They head towards the Haymarket Hotel, where Sidney, now dressed as a waiter with a fake mustache, tosses a canape to Britney, who wags her curly tail and eagerly snaffles it down. With a tray of canapes obscuring his face, Sidney saunters into the party, slipping past the Nazi Clipboard woman unnoticed. He finds a spot by the pool and sits down to chat with Thandie Newton. Meanwhile, the brown-haired hotel manager knocks on Sidney's room door and enters to discover the room in disarray, with chocolates and booze bottles littering the floor by the open fridge and upturned furniture scattered about. Unseen, Britney trots out of the hotel room and scurries down a corridor to a lift, where the electric doors close behind her. Back at the party, Thandie smiles coyly at Sidney, then bursts out laughing and playfully pats him on the thigh. Britney eventually wanders out of the lift, and Thandie continues to smile flirtatiously at Sidney, who sips champagne and returns her sultry look with a grin, letting out a bashful sigh that disturbs his fake mustache. Noticing this, Thandie frowns slightly. Meanwhile, Britney causes a scene by urinating on a lady's red high heels, prompting the PR Nazi to push through the crowd. Sidney spots Britney, and as Thandie stands, bouncers begin to approach. Sensing trouble, Sidney scampers away, with the PR Nazi watching hawkishly and Thandie shrugging in response. Two bouncers give chase, pushing a woman aside in their pursuit. Sidney takes a running jump, and a photographer captures him mid-flight. Later, a postmodern review features a newspaper photo showing Clint Eastwood with Sidney in a headlock. In his busy living room, which doubles as an office, Sidney hears the phone ringing and staff arguing in the next room. Holding a lit cigarette, he strides into the chaos, where a cover of the postmodern review disparages Sharp's editor. Writers have gathered in a frenzy, eager to watch the brewing fight, while women flaunt and flip the fax machine over. Outside, an airplane soars through the blue sky, and at night, Sidney finds himself in a taxi, staring wide-eyed out the window as he is swept through the city. He gazes at a sign over the entrance of a theater and cruises through Chinatown, but his smile fades as he catches sight of a helicopter overhead."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A young blond boy sits cross-legged in front of a large wooden TV set, watching a black-and-white award ceremony where guests clap as a movie clip plays. Nearby, a man and a slender, beautiful woman named Sophie are seated. When Sophie's name is announced, she is surprised, and Sidney, seated beside her, smiles and claps. As Sophie rises, Sidney turns to the camera, while a smartly dressed couple stands from a nearby table. Sidney, standing at a red rope barrier with a pig on a lead, grins as a woman named Alison lifts the barrier, leading them away. At the Haymarket Hotel, Sidney, disguised as a waiter with a fake mustache, tosses a canape to the pig, Britney, who eagerly eats it. Concealing his face with a tray of canapes, he sneaks past a strict woman into the party and chats by the pool with Thandie Newton. Meanwhile, the hotel manager discovers Sidney's trashed room, littered with chocolates, booze bottles, and overturned furniture. Unseen, Britney escapes the room, takes a lift, and wanders out. Thandie, smiling flirtatiously, shares a laugh with Sidney, who sips champagne and grins bashfully, disturbing his fake mustache. Noticing this, Thandie frowns. Britney then urinates on a woman's red high heels, prompting the PR Nazi to push through the crowd as Sidney spots Britney. As Thandie stands, bouncers approach, and Sidney makes a quick escape, with the PR Nazi watching intently. Two bouncers give chase, and a photographer captures Sidney mid-flight. A newspaper photo later shows Clint Eastwood with Sidney in a headlock. Sidney hears a phone ringing and staff arguing in the next room. Holding a lit cigarette, he strides into his bustling living room-office, where writers are gathered in a frenzy over a disparaging cover of the postmodern review. Women flaunt and flip the fax machine over. An airplane soars through the sky, and at night, Sidney gazes out a taxi window, wide-eyed, as he passes a theater sign and cruises through Chinatown. His smile fades upon seeing a helicopter."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A young blond boy, reminiscent of the children who grew up in the 1960s when TV sets were large and primarily broadcasted in black and white, sits cross-legged in front of the large wooden TV set on screen in black and white. Seated guests clap as a movie clip from a classic 1950s film plays at an award ceremony, which appears to be modeled after the glamorous Oscars. A man, possibly a famous director known for his recent controversial movie, is seated nearby. Sophie, who resembles a classic Hollywood starlet, is slender and beautiful. A woman on stage reads her name, seated beside a gobsmacked Sophie, who is nominated for Best Actress. Sidney, a well-known comedian famous for his improvisational humor, cracks a wide smile and claps. Shapely raven-haired Sophie rises from her seat, her grace reminiscent of 1940s film noir actresses, Sidney turns to the camera. A smartly dressed man and woman, appearing to be influential critics from a renowned film magazine, rise from a nearby table. Camera phone pictures of Ricky Gervais, known for his biting humor at award shows, are passed around. Sidney stands at a red rope barrier, an area typically reserved for VIP guests. He has a pig on a lead, a bizarre choice perhaps symbolizing his irreverent nature. She looks around nervously, unsure of the spectacle. He grins as she lifts the barrier, allowing access to a restricted area. Alison, a quick-thinking event coordinator trying to keep the situation under control, leads Sidney and the pig away. The Haymarket Hotel, famous for hosting celebrities during award season, is bustling with activity. Sidney is dressed as a waiter with a fake mustache, a common disguise for sneaking into exclusive events. Britney, the pig, wags her curly tail enthusiastically. Sidney tosses her a canape, and she snaffles it down, as pigs are known for their voracious appetites. Obscuring his face with a tray of canapes, he saunters into the party past the Nazi Clipboard woman, a stern gatekeeper notorious for her strict guest list enforcement. He sits by a pool chatting with Thandie Newton, a renowned actress celebrated for her roles in both independent films and big-budget blockbusters. The brown-haired hotel manager, known for her meticulous attention to detail, knocks on Sidney's room door. He enters to find that the room has been trashed, with chocolates and booze bottles littering the floor by the open fridge, and upturned furniture strewn about the room indicative of a raucous party. Unseen, Britney trots out of the hotel room and scurries down a corridor to a lift, a quick escape route in the bustling hotel. The electric doors close silently. Thandie smiles coyly, reflecting her playful and charming screen presence. She bursts out laughing and pats him at the thigh, suggesting a close and comfortable rapport. Britney wanders out of the lift, her curiosity leading her to explore new territories. Thandie smiles flirtatiously, employing her well-known charisma. He sips champagne, savoring the luxurious drink, as she gives him a sultry look, and he grins bashfully as he lets out a bashful sigh disturbing the fake mustache. Noticing this, Thandie frowns, her astute observation skills coming into play. Britney urinates on a lady's red high heels, a humorous disruption at the elegant gathering. The PR Nazi, notorious for her no-nonsense approach, pushes through the crowd. Sidney spots Britney, his partner in mischief. Thandie stands, maintaining her composed and elegant demeanor. Bouncers, clad in black suits, approach, ready to handle any unruly behavior. Sidney scampers, executing a quick getaway. The PR Nazi watches hawkishly, ensuring the event maintains its high standards. Thandie shrugs, unfazed by the commotion. Two bouncers give chase, demonstrating their commitment to security. A woman, caught in the chaos, is pushed away. He takes a running jump, a daring escape attempt, and a photographer snaps him mid-flight, capturing the moment for posterity. The postmodern review, known for its cutting-edge satire and commentary, has a photo from the newspaper in which Clint Eastwood, an iconic actor and director, has him in a headlock, adding to the humor of the scenario. He hears the phone ringing, and staff arguing in the next room, the chaos of a busy magazine office. Holding a lit cigarette, Sydney strides into his busy living room come office, a scene of organized chaos. A cover of postmodern review disparages Sharp's editor, reflecting the publication's reputation for fearless criticism. The writers, energetic and passionate about their craft, have gathered in a frenzy to watch the fight brew. The women, embodying the fierce independence of modern journalists, flaunt and flip the fax machine over. An airplane soars through the blue sky, a symbol of freedom and adventure. At night, the glimmer of a taxi, a familiar sight in bustling cities, staring out the window as he's swept through. He gazes, wide-eyed, at a sign over the entrance of a theater, cruises through Chinatown, an area known for its vibrant culture and delicious cuisine. His smile fades as he sees a helicopter, a sign of looming authority or an unfolding emergency."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A young blond boy sits crosslegged in front of the large wooden TV set on screen in black and white  Seated guests clap as a movie clip plays at an award ceremony  A man is seated nearby  Sophie is slender and beautiful  A woman on stage reads her name seated beside a gobsmacked Sophie  Sidney cracks a wide smile and claps  Shapely ravenhaired Sophie rises from her seat  He sits by a pool chatting with Thandie Newton  The brownhaired hotel manager knocks on Sidney's room door  He enters to find that the room has been trashed  Chocolates and booze bottles litter the floor by the open fridge and upturned furniture is strewn about the room  Unseen Britney trots out of the hotel room and scurries down a corridor to a lift  The electric doors close  Thandie smiles coyly  She bursts out laughing and pats him at the thigh  Britney wanders out of the lift  Thandie smiles flirtatiously  He sips champagne  She gives him a sultry look and he grins as he lets out a bashful sigh disturbing the fake mustache  Noticing this Thandie frowns  Britney urinates on a lady's red high heels  The PR Nazi pushes through the crowd  Sidney spots Britney  Thandie stands  Bouncers approach  Sidney scampers  The PR Nazi watches hawkishly  Thandie shrugs  Two bouncers give chase  A woman is pushed away  He takes a running jump and a photographer snaps him midflight  The postmodern review has a photo from the newspaper in which Clint Eastwood has him in a headlock  He hears the phone ringing and staff arguing in the next room  Holding a lit cigarette Sydney strides into his busy living room  come office  Sidney turns to the camera  A smartly dressed man and woman rise from a nearby table  Camera phone pictures of Ricky Gervais  Sidney stands at a red rope barrier  He has a pig on a lead  She looks around nervously  He grins as she lifts the barrier  Alison leads Sidney and the pig away  The Haymarket Hotel  Sidney is dressed as a waiter with a fake mustache  Britney wags her curly tail  Sidney tosses her a canape and she snaffles it down  Obscuring his face with a tray of canapes he saunters into the party past the Nazi Clipboard woman  He sits by a pool chatting with Thandie Newton  The brownhaired hotel manager knocks on Sidney's room door  He enters to find that the room has been trashed  Chocolates and booze bottles litter the floor by the open fridge and upturned furniture is strewn about the room  Unseen Britney trots out of the hotel room and scurries down a corridor to a lift  The electric doors close  Thandie smiles coyly  She bursts out laughing and pats him at the thigh  Britney wanders out of the lift  Thandie smiles flirtatiously  He sips champagne  She gives him a sultry look and he grins as he lets out a bashful sigh disturbing the fake mustache  Noticing this Thandie frowns  Britney urinates on a lady's red high heels  The PR Nazi pushes through the crowd  Sidney spots Britney  Thandie stands  Bouncers approach  Sidney scampers  The PR Nazi watches hawkishly  Thandie shrugs  Two bouncers give chase  A woman is pushed away  He takes a running jump and a photographer snaps him midflight  The postmodern review has a photo from the newspaper in which Clint Eastwood has him in a headlock  He hears the phone ringing and staff arguing in the next room  Holding a lit cigarette Sydney strides into his busy living room  come office  A cover of postmodern review disparages Sharp's editor  The writers have gathered in a frenzy to watch the fight brew  The women flaunt and flip the fax machine over  An airplane soars through the blue sky  At night the glimmer of a taxi staring out the window as he's swept through  He gazes wideeyed at a sign over the entrance of a theater cruises through Chinatown  His smile fades as he sees a helicopter"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A young blond boy sits crosslegged in front of the large wooden TV set on screen in black and white. Seated guests clap as a movie clip plays at an award ceremony. A man is seated nearby. Sophie is slender and beautiful. A woman on stage reads her name seated beside a gobsmacked Sophie. Sidney cracks a wide smile and claps. Shapely ravenhaired Sophie rises from her seat. Sidney turns to the camera. A smartly dressed man and woman rise from a nearby table. Camera phone pictures of Ricky Gervais. Sidney stands at a red rope barrier. He has a pig on a lead. She looks around nervously. He grins as she lifts the barrier. Alison leads Sidney and the pig away. The Haymarket Hotel. Sidney is dressed as a waiter with a fake mustache. Britney wags her curly tail. Sidney tosses her a canape and she snaffles it down. Obscuring his face with a tray of canapes he saunters into the party past the Nazi Clipboard woman. He sits by a pool chatting with Thandie Newton. The brownhaired hotel manager knocks on Sidney's room door. He enters to find that the room has been trashed. Chocolates and booze bottles litter the floor by the open fridge and upturned furniture is strewn about the room. Unseen Britney trots out of the hotel room and scurries down a corridor to a lift. The electric doors close. Thandie smiles coyly. She bursts out laughing and pats him at the thigh. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Britney wanders out of the lift. Thandie smiles flirtatiously. He sips champagne. She gives him a sultry look and he grins as he let us out a bashful sigh disturbing the fake mustache. Noticing this Thandie frowns. Britney urinates on a lady's red high heels. The PR Nazi pushes through the crowd. Sidney spots Britney. Thandie stands. Bouncers approach. Sidney scampers. The PR Nazi watches hawkishly. Thandie shrugs. Two bouncers give chase. A woman is pushed away. He takes a running jump and a photographer snaps him midflight. The postmodern review has a photo from the newspaper in which Clint Eastwood has him in a headlock. He hears the phone ringing and staff arguing in the next room. Holding a lit cigarette Sydney strides into his busy living room. come office. A cover of postmodern review disparages Sharp's editor. The writers have gathered in a frenzy to watch the fight brew. The women flaunt and flip the fax machine over. An airplane soars through the blue sky. At night the glimmer of a taxi staring out the window as he is swept through. He gazes wideeyed at a sign over the entrance of a theater. cruises through Chinatown. His smile fades as he sees a helicopter."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A young blond boy sits crosslegged in front of the large wooden TV set on screen in black and white. Seated guests clap as a movie clip plays at an award ceremony. A man is seated nearby. Sophie is slender and beautiful. A woman on stage reads her name seated beside a gobsmacked Sophie. Sidney cracks a wide smile and claps. Shapely ravenhaired Sophie rises from her seat. Sidney turns to the camera. A smartly dressed man and woman rise from a nearby table. Camera phone pictures of Ricky Gervais. Sidney stands at a red rope barrier. He has a pig on a lead. She looks around nervously. He grins as she lifts the barrier. Alison leads Sidney and the pig away. The Haymarket Hotel. Sidney is dressed as a waiter with a fake mustache. Britney wags her curly tail. Sidney tosses her a canape and she snaffles it down. Obscuring his face with a tray of canapes he saunters into the party past the Nazi Clipboard woman. He sits by a pool chatting with Thandie Newton. The brownhaired hotel manager knocks on Sidney's room door. He enters to find that the room has been trashed. Chocolates and booze bottles litter the floor by the open fridge and upturned furniture is strewn about the room. Unseen Britney trots out of the hotel room and scurries down a corridor to a lift. The electric doors close. Thandie smiles coyly. She bursts out laughing and pats him at the thigh. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Britney wanders out of the lift. Thandie smiles flirtatiously. He sips champagne. She gives him a sultry look and he grins as he let us out a bashful sigh disturbing the fake mustache. Noticing this Thandie frowns. Britney urinates on a lady's red high heels. The PR Nazi pushes through the crowd. Sidney spots Britney. Thandie stands. Bouncers approach. Sidney scampers. The PR Nazi watches hawkishly. Thandie shrugs. Two bouncers give chase. A woman is pushed away. He takes a running jump and a photographer snaps him midflight. The postmodern review has a photo from the newspaper in which Clint Eastwood has him in a headlock. He hears the phone ringing and staff arguing in the next room. Holding a lit cigarette Sydney strides into his busy living room. come office. A cover of postmodern review disparages Sharp's editor. The writers have gathered in a frenzy to watch the fight brew. The women flaunt and flip the fax machine over. An airplane soars through the blue sky. At night the glimmer of a taxi staring out the window as he is swept through. He gazes wideeyed at a sign over the entrance of a theater. cruises through Chinatown. His smile fades as he sees a helicopter."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A young blond boy sits crosslegged in front of the large wooden TV set on screen in black and white. Seated guests clap as a movie clip plays at an award ceremony. A man is seated nearby. Sophie is slender and beautiful. A woman on stage reads her name seated beside a gobsmacked Sophie. Sidney cracks a wide smile and claps. Shapely ravenhaired Sophie rises from her seat. Sidney turns to the camera. A smartly dressed man and woman rise from a nearby table. Camera phone pictures of Ricky Gervais. Sidney stands at a red rope barrier. He has a pig on a lead. She looks around nervously. He grins as she lifts the barrier. A woman is pushed away. He takes a running jump and a photographer snaps him midflight. The postmodern review has a photo from the newspaper in which Clint Eastwood has him in a headlock. He hears the phone ringing and staff arguing in the next room. Holding a lit cigarette Sydney strides into his busy living room. come office. A cover of postmodern review disparages Sharp's editor. The writers have gathered in a frenzy to watch the fight brew. The women flaunt and flip the fax machine over. An airplane soars through the blue sky. At night the glimmer of a taxi staring out the window as he is swept through. He gazes wideeyed at a sign over the entrance of a theater. cruises through Chinatown. His smile fades as he sees a helicopter."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A young blond boy sits crosslegged in front of the large wooden TV set on screen in black and white. Seated guests clap as a movie clip plays at an award ceremony. A man is seated nearby. Sophie is slender and beautiful. A woman on stage reads her name seated beside a gobsmacked Sophie. Sidney cracks a wide smile and claps. The women flaunt and flip the fax machine over. An airplane soars through the blue sky. At night the glimmer of a taxi staring out the window as he is swept through. He gazes wideeyed at a sign over the entrance of a theater. cruises through Chinatown. His smile fades as he sees a helicopter."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A young blond girl sits cross-legged in front of the large wooden TV set on screen in black and white. Seated animals clap as a movie clip plays at an award ceremony. A cat is seated nearby. The dog is slender and beautiful. A fish on stage reads her name, seated beside a gobsmacked dog. An owl cracks a wide smile and claps. Shapely raven-haired dog rises from her seat, the owl turns to the camera. A smartly dressed giraffe and donkey rise from a nearby table. Camera phone pictures of Ricky Gervais. The owl stands at a red rope barrier. He has a horse on a lead. She looks around nervously. He grins as she lifts the barrier. A rabbit leads the owl and the horse away. The Haymarket Hotel. The owl is dressed as a waiter with a fake mustache. The sheep wags her curly tail. The owl tosses her a canape, and she snaffles it down. Obscuring his face with a tray of canapes, he saunters into the party past the Nazi Clipboard rabbit. He sits by a pool chatting with a lion. The brown-haired hotel manager knocks on the owl's room door. He enters to find that the room has been trashed. Chocolates and booze bottles litter the floor by the open fridge, and upturned furniture is strewn about the room. Unseen, the sheep trots out of the hotel room and scurries down a corridor to a lift. The electric doors close. The lion smiles coyly. She bursts out laughing and pats him at the thigh. The sheep wanders out of the lift. The lion smiles flirtatiously. He sips champagne. She gives him a sultry look, and he grins as he lets out a bashful sigh disturbing the fake mustache. Noticing this, the lion frowns. The sheep urinates on a bear's red high heels. The PR Nazi hops through the crowd. The owl spots the sheep. The lion stands. Bouncers approach. The owl scampers. The PR Nazi watches hawkishly. The lion shrugs. Two bouncers give chase. A squirrel is pushed away. He takes a running jump and a photographer snaps him mid-flight. The postmodern review has a photo from the newspaper in which Clint Eastwood has him in a headlock. He hears the phone ringing, and crows arguing in the next room. Holding a lit cigarette, the panda strides into his busy living room come office. A cover of postmodern review disparages Sharp's editor. The frogs have gathered in a frenzy to watch the fight brew. The dolphins flaunt and flip the fax machine over. An airplane soars through the blue sky. At night, the glimmer of a taxi staring out the window as he's swept through. He gazes, wide-eyed, at a sign over the entrance of a theater, cruises through Chinatown. His smile fades as he sees a helicopter."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A young blond boy sits cross-legged in front of the large wooden radio set on screen in sepia tone. Seated guests clap as a slideshow plays at a book launch. A man is seated nearby. Sophie is slender and beautiful. A woman on stage reads her name, seated beside a gobsmacked Sophie. Sidney cracks a wide smile and claps. Shapely raven-haired Sophie rises from her seat, Sidney turns to the audience. A smartly dressed man and woman rise from a nearby bench. Camera phone pictures of David Attenborough. Sidney stands at a blue velvet curtain. He has a llama on a lead. She looks around nervously. He grins as she lifts the curtain. Alison leads Sidney and the llama away. The Paddington Library. Sidney is dressed as a gardener with a fake beard. Britney wags her fluffy tail. Sidney tosses her a donut, and she snaffles it down. Obscuring his face with a tray of donuts, he saunters into the library past the Viking Clipboard woman. He sits by a fireplace chatting with Idris Elba. The blonde-haired library manager knocks on Sidney's room door. He enters to find that the room has been unraveled. Popcorn and juice bottles litter the floor by the open cabinet, and upturned books are strewn about the room. Unseen, Britney trots out of the library room and scurries down an aisle to a stairwell. The mechanical doors close. Idris smiles coyly. She bursts out laughing and pats him on the shoulder. Britney wanders out of the stairwell. Idris smiles flirtatiously. He sips lemonade. She gives him a sultry look, and he grins as he lets out a bashful sigh disturbing the fake beard. Noticing this, Idris frowns. Britney urinates on a lady's blue flip-flops. The PR Viking pushes through the crowd. Sidney spots Britney. Idris stands. Security guards approach. Sidney scampers. The PR Viking watches hawkishly. Idris shrugs. Two security guards give chase. A man is pushed away. He takes a running jump and a painter snaps him mid-flight. The postmodern article has a photo from the magazine in which Morgan Freeman has him in a headlock. He hears the phone ringing, and staff arguing in the next cubicle. Holding a lit candle, Sidney strides into his busy dining room come study. A cover of postmodern article disparages Sharp's columnist. The editors have gathered in a frenzy to watch the plot brew. The women flaunt and flip the typewriter over. A drone soars through the orange sky. At night, the glimmer of a bus staring out the window as he's swept through. He gazes, wide-eyed, at a sign over the entrance of a stadium, cruises through Little Italy. His smile fades as he sees a zeppelin."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A young blond boy kneels cross-legged in front of the large wooden TV set on screen in black and white. Seated guests nod as a movie clip pauses at an award ceremony. A man is perched nearby. Sophie is slender and beautiful. A woman on stage scribbles her name, seated beside a gobsmacked Sophie. Sidney cracks a wide grin and winks. Shapely raven-haired Sophie descends from her seat, Sidney whispers to the camera. A smartly dressed man and woman leap from a nearby table. Camera phone sketches of Ricky Gervais. Sidney leans on a red rope barrier. He has a cat on a lead. She spins around nervously. He chuckles as she dismantles the barrier. Alison pulls Sidney and the cat away. The Haymarket Hotel. Sidney is dressed as a chef with a fake mustache. Britney shakes her curly fur. Sidney flicks her a biscuit, and she gulps it down. Obscuring his face with a tray of biscuits, he tiptoes into the party past the Nazi Clipboard woman. He stands by a pool singing with Thandie Newton. The brown-haired hotel manager taps on Sidney's room door. He enters to find that the room has been decorated. Chocolates and booze bottles adorn the floor by the closed fridge, and upright furniture is arranged about the room. Unseen, Britney skips out of the hotel room and dashes down a corridor to a lift. The electric doors swing open. Thandie smiles playfully. She bursts out sneezing and taps him on the shoulder. Britney wanders into the lift. Thandie laughs flirtatiously. He devours champagne. She offers him a sultry glance, and he grins as he lets out a bashful tune tickling the fake mustache. Noticing this, Thandie raises an eyebrow. Britney sniffs a lady's red high heels. The PR Nazi tiptoes through the crowd. Sidney spies Britney. Thandie sits. Bouncers applaud. Sidney crawls. The PR Nazi watches gleefully. Thandie stretches. Two bouncers enjoy the chase. A woman is spun away. He skips with joy and a photographer sketches him mid-air. The postmodern review has a drawing from the newspaper in which Clint Eastwood embraces him in a headlock. He hears the door creaking, and staff dancing in the next room. Holding an unlit cigarette, Sydney waltzes into his busy living room come office. A cover of postmodern review praises Sharp's editor. The writers have gathered in a frenzy to watch the band play. The women flaunt and toss the fax machine into the air. An airplane glides through the blue sky. At night, the gleam of a taxi peeking out the window as he's whisked through. He squints, wide-eyed, at a sign over the entrance of a theater, sails through Chinatown. His smile brightens as he sees a billboard."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A tiny red robot sits cross-legged in front of the large brass jukebox on stage in sepia tones. Seated acrobats clap as a puppet show plays at a book festival. A dolphin is seated nearby. Charlie is compact and vibrant. A giraffe on trampoline reads its name, seated beside a bewildered Charlie. Norman cracks a wide smile and claps. Graceful emerald-beaked Charlie rises from its seat, Norman turns to the easel. A warmly dressed giraffe and dolphin rise from a neighboring ottoman. Balloon camera pictures of Albert Einstein. Norman stands at a velvet curtain rail. He has a turtle on a string. It looks around cautiously. He grins as it lifts the rail. Helen guides Norman and the turtle away. The Aviary Spa. Norman is dressed as a chef with a plastic beard. Stephanie wags her feathery plume. Norman tosses it a pancake, and it devours it eagerly. Concealing his face with a platter of pancakes, he struts into the event past the Zombie Blueprint giraffe. He lounges by a fountain chatting with Cate Blanchett. The golden-feathered aviary caretaker raps on Norman's locker door. He enters to find that the locker has been disarrayed. Vegetables and soda cans clutter the floor by the ajar cupboard, and toppled shelving is haphazard across the locker. Unnoticed, Stephanie flutters out of the locker and dashes down a corridor to a staircase. The revolving doors shut. Cate smiles playfully. She bursts out laughing and pats him on the shoulder. Stephanie glides out of the staircase. Cate smiles suggestively. He sips lemonade. She gives him a playful glance, and he grins as he lets out a nervous chuckle unsettling the plastic beard. Noting this, Cate frowns. Stephanie defecates on a kangaroo's purple rain boots. The PR Zombie pushes through the gathering. Norman spots Stephanie. Cate stands. Bouncers advance. Norman sprints. The PR Zombie watches sternly. Cate shrugs. Two bouncers pursue. A toucan is nudged aside. He takes a running leap and an artist sketches him mid-air. The avant-garde commentary has an illustration from the journal in which Audrey Hepburn has him in a chokehold. He hears the toaster chiming, and guests bickering in the adjacent hall. Holding a flickering candle, Norman strides into his bustling den come gallery. A cover of avant-garde commentary criticizes Luna's columnist. The painters have assembled in a frenzy to observe the drama unfold. The toucans flaunt and flip the coffee maker over. A zeppelin glides through the cloudy horizon. At sunset, the glint of a rickshaw peering out the gate as he's swept past. He gazes, wide-eyed, at a billboard over the entrance of a cinema, glides through Little Italy. His grin vanishes as he spots a blimp."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A young red-haired girl kneels in front of the small metallic radio set on screen in color. Standing spectators cheer as a dance routine unfolds at a music festival. A woman is standing nearby. Charles is tall and handsome. A man on stage announces his name, standing beside a stunned Charles. Maria bursts into laughter and cheers. Stocky blonde-haired Charles jumps from his chair, Maria turns to the audience. A casually dressed boy and girl jump from a nearby bench. Tablet drawings of Stephen Colbert. Maria leans on a blue velvet barricade. She has a cat on a strap. He glances around cautiously. She chuckles as he raises the barrier. Thomas guides Maria and the cat forward. The Waldorf Astoria. Maria is dressed as a chef with a fake beard. Rocky flicks her pointy ears. Maria hands her a cracker, and she gulps it up. Covering his face with a basket of pastries, she dances into the event past the Inspector Gadget man. She lies by a fountain conversing with Jason Statham. The curly-haired gym coach taps on Maria's suite door. He walks in to discover that the suite has been ransacked. Cupcakes and wine glasses cover the carpet by the empty mini-bar, and toppled sculptures lay about the suite. Hair hidden, Rocky prances out of the suite and dashes down a hallway to an elevator. The glass doors shut. Jason grins broadly. He bursts out giggling and pokes her at the shoulder. Rocky struts out of the elevator. Jason beams warmly. She gulps lemonade. He gives her a cheeky wink, and she smirks as she lets out a shy chuckle displacing the fake beard. Spotting this, Jason glares. Rocky hops over a lady's black platform shoes. The Fashion Judge storms through the cluster. Maria notices Rocky. Jason sits. Guards rush in. Maria scoots. The Fashion Judge examines intently. Jason nods. Several guards pursue. A child is pulled away. She makes a flying leap and a journalist captures her mid-air. The retro article has an illustration from the tabloid in which Will Smith traps her in a headlock. She notices the doorbell ringing, and relatives arguing in the neighboring suite. Holding a lit match, Maria marches into her hectic dining room turned workspace. A cover of retro article mocks Stone's publisher. The readers have gathered in a craze to watch the chaos escalate. The men spotlight and twirl the printer over. A blimp glides through the gray clouds. At dawn, the sparkle of a limo peering at the scenery as she's whisked away. She stares, curious, at a billboard above the entrance of a museum, sails through Little Italy. Her grin vanishes as she spots a zeppelin."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A young blond boy lounges cross-legged in front of the large wooden fireplace, viewing a kaleidoscope of colors. Seated spectators cheer as a music video plays at a fashion show. A man is standing nearby. Sophie is tall and elegant. A woman on stage announces her name, positioned beside a shell-shocked Sophie. Sidney beams a broad smile and cheers. Shapely raven-haired Sophie springs from her seat, Sidney turns to wave at the crowd. A smartly dressed man and woman jump up from a nearby pedestal. Digital camera images of Ricky Gervais. Sidney leans against a velvet curtain. He has a kangaroo on a leash. She glances around anxiously. He chuckles as she removes the curtain. Alison directs Sidney and the kangaroo forward. The Savoy Theatre. Sidney is clothed as a magician with a false beard. Britney wags her pointed ears. Sidney flips her a grape, and she gobbles it up. Concealing his face with a bouquet of flowers, he glides into the concert past the Knight Doorkeeper woman. He reclines by a fountain conversing with Thandie Newton. The red-haired apartment manager knocks on Sidney's office door. He enters to discover that the workspace is in chaos. Coins and sandwich wrappers cover the carpet by the open drawer, and toppled chairs are scattered around the area. Unseen, Britney darts out of the office and zips down a hall to a staircase. The revolving doors spin. Thandie grins mischievously. She bursts into giggles and taps him on the shoulder. Britney strolls out of the staircase. Thandie grins coquettishly. He gulps juice. She flashes him a seductive glance, and he beams as he emits a shy chuckle, shifting the false beard. Noticing this, Thandie squints. Britney naps on a lady's blue sneakers. The Manager Diva pushes through the assembly. Sidney glimpses Britney. Thandie rises. Security guards advance. Sidney sprints. The Manager Diva observes sharply. Thandie shrugs. Two guards pursue. A man is pulled aside. He leaps over an obstacle, and a videographer records him mid-air. The postmodern review features an image from the journal in which Clint Eastwood has him in a tight embrace. He hears the doorbell ringing, and guests whispering in the adjacent room. Holding a steaming cup, Sydney saunters into his crowded veranda turned office. An illustration of postmodern review ridicules Sharp's publisher. The editors have assembled in a hubbub to witness the chaos unfold. The men brandish and topple the printer over. A blimp drifts through the cloudy sky. By evening, the sparkle of a limousine glaring out the balcony as he's carried through. He stares, astonished, at a banner above the gate of a gallery, drifts through Little Italy. His grin disappears as he spots a blimp."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A little brown-haired cat lounges lazily beside a towering glass bookshelf in vivid color. Standing dancers cheer as a puppet show screens during a dance contest. A woman slumbers nearby. Marcus is stout and mesmerizing. A turtle on stage calls her number, dozing next to a startled Marcus. Edna beams a huge grin and whistles. Graceful silver-maned Marcus leaps onto her perch, Edna faces the window. A casually dressed elf and gnome bounce from a distant couch. Disposable camera snapshots of Benedict Cumberbatch. Edna perches on a purple velvet rope. She has a goat on a leash. He glances around cautiously. She chuckles as he lifts the rope. Natalie guides Edna and the goat away. The Green Dragon Inn. Edna is clothed as a chef with a cardboard monocle. Johnny wags his fluffy ears. Edna throws him a biscuit, and he gobbles it up. Masking her eyes with a platter of biscuits, she waltzes into the lounge past the Vampire Listkeeper. She lounges beside a fountain conversing with Idris Elba. The blonde-tailed chef raps on Edna's cabin door. She steps in to discover the cabin has been demolished. Marshmallows and juice cartons speckle the rug near the ajar wardrobe, and scattered cushions decorate the cabin. Unnoticed, Johnny flits out of the cabin and prances down a passage to an escalator. The revolving gates shut. Idris grins mischievously. She erupts in giggles and taps him on the shoulder. Johnny dawdles out of the escalator. Idris grins invitingly. She sips lemonade. He casts her a dreamy look, and she chuckles as she lets out a flustered chuckle, dislodging the cardboard monocle. Aware of this, Idris scowls. Johnny spills tea on a man's blue sneakers. The Executive Vampire barges past the audience. Edna glimpses Johnny. Idris steps up. Guards stroll over. Edna flutters. The Executive Vampire observes fiercely. Idris shrugs. Two guards pursue. A gnome is nudged back. He takes a flying leap, and a sculptor paints him mid-air. The futuristic critique has a sketch from the brochure in which Morgan Freeman nudges him with a feather. She hears the gong clanging, and artists bickering in the adjacent studio. Clutching a burning incense stick, Edna strolls into her bustling bedroom-turned-study. A cover of futuristic critique ridicules Frost's director. The painters have convened in a frenzy to watch the drama rise. The musicians flaunt and topple the typewriter over. A kite glides through the twilight breeze. By dawn, the shimmer of a carriage peeking out the window as she's swept through. She marvels, doe-eyed, at a poster above the doorway of a gallery, glides through Koreatown. Her grin dims as she spots a zeppelin."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A young blond boy watches a black-and-white award ceremony on TV. Sophie, a stunning raven-haired woman, is startled when her name is called on stage; Sidney, nearby, smiles widely and claps. At the Haymarket Hotel, Sidney, with a pig named Britney, is led away by Alison. Later, disguised as a waiter, he sneaks into a party where he chats with Thandie Newton by the pool. The hotel manager finds Sidney's room trashed with chocolate and booze, while Britney the pig wanders the hotel. Sidney and Thandie exchange flirtatious looks, but chaos ensues when Britney urinates on a woman's shoes. Bouncers chase Sidney as the PR Nazi watches. Sidney narrowly escapes, with a photographer capturing his flight. He hears a phone ringing and staff arguing in his packed living room office. The postmodern review dismisses Sharp's editor as writers eagerly await a brewing conflict. Sidney's adventures continue as he travels through the city, observing a theater sign and a helicopter with a fading smile."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "His smile fades as he sees a helicopter He gazes wideeyed at a sign over the entrance of a theater cruises through Chinatown  At night the glimmer of a taxi staring out the window as he's swept through  An airplane soars through the blue sky  The women flaunt and flip the fax machine over  The writers have gathered in a frenzy to watch the fight brew  A cover of postmodern review disparages Sharp's editor  come office  Holding a lit cigarette Sydney strides into his busy living room  He hears the phone ringing and staff arguing in the next room  The postmodern review has a photo from the newspaper in which Clint Eastwood has him in a headlock  He takes a running jump and a photographer snaps him midflight  A woman is pushed away  Two bouncers give chase  Thandie shrugs  The PR Nazi watches hawkishly  Sidney scampers  Bouncers approach  Thandie stands  Sidney spots Britney  The PR Nazi pushes through the crowd  Britney urinates on a lady's red high heels  Noticing this Thandie frowns  She gives him a sultry look and he grins as he lets out a bashful sigh disturbing the fake mustache  He sips champagne  Thandie smiles flirtatiously  Britney wanders out of the lift  She bursts out laughing and pats him at the thigh  Thandie smiles coyly  The electric doors close  Unseen Britney trots out of the hotel room and scurries down a corridor to a lift  Chocolates and booze bottles litter the floor by the open fridge and upturned furniture is strewn about the room  He enters to find that the room has been trashed  The brownhaired hotel manager knocks on Sidney's room door  He sits by a pool chatting with Thandie Newton  Obscuring his face with a tray of canapes he saunters into the party past the Nazi Clipboard woman  Sidney tosses her a canape and she snaffles it down  Britney wags her curly tail  Sidney is dressed as a waiter with a fake mustache  The Haymarket Hotel  Alison leads Sidney and the pig away  He grins as she lifts the barrier  She looks around nervously  He has a pig on a lead  Sidney stands at a red rope barrier  Camera phone pictures of Ricky Gervais  A smartly dressed man and woman rise from a nearby table  Sidney turns to the camera  Shapely ravenhaired Sophie rises from her seat  Sidney cracks a wide smile and claps  A woman on stage reads her name seated beside a gobsmacked Sophie  Sophie is slender and beautiful  A man is seated nearby  Seated guests clap as a movie clip plays at an award ceremony  A young blond boy sits crosslegged in front of the large wooden TV set on screen in black and white "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "A cover of postmodern review disparages Sharp's editor  A young blond boy sits crosslegged in front of the large wooden TV set on screen in black and white  The PR Nazi pushes through the crowd  The electric doors close  Thandie smiles coyly  The Haymarket Hotel  Two bouncers give chase  The brownhaired hotel manager knocks on Sidney's room door  He has a pig on a lead  She bursts out laughing and pats him at the thigh  Camera phone pictures of Ricky Gervais  Sophie is slender and beautiful  Sidney is dressed as a waiter with a fake mustache  Noticing this Thandie frowns  come office  Obscuring his face with a tray of canapes he saunters into the party past the Nazi Clipboard woman  The women flaunt and flip the fax machine over  His smile fades as he sees a helicopter Seated guests clap as a movie clip plays at an award ceremony  She gives him a sultry look and he grins as he lets out a bashful sigh disturbing the fake mustache  Britney wanders out of the lift  He sips champagne  Sidney spots Britney  He sits by a pool chatting with Thandie Newton  A smartly dressed man and woman rise from a nearby table  An airplane soars through the blue sky  He takes a running jump and a photographer snaps him midflight  The postmodern review has a photo from the newspaper in which Clint Eastwood has him in a headlock  Sidney turns to the camera  At night the glimmer of a taxi staring out the window as he's swept through  Britney urinates on a lady's red high heels  Bouncers approach  The writers have gathered in a frenzy to watch the fight brew  Thandie shrugs  He grins as she lifts the barrier  He enters to find that the room has been trashed  Sidney scampers  Sidney stands at a red rope barrier  He gazes wideeyed at a sign over the entrance of a theater cruises through Chinatown  Thandie smiles flirtatiously  Britney wags her curly tail  Unseen Britney trots out of the hotel room and scurries down a corridor to a lift  Shapely ravenhaired Sophie rises from her seat  Holding a lit cigarette Sydney strides into his busy living room  Sidney cracks a wide smile and claps  Sidney tosses her a canape and she snaffles it down  Alison leads Sidney and the pig away  A woman is pushed away  A man is seated nearby  A woman on stage reads her name seated beside a gobsmacked Sophie  He hears the phone ringing and staff arguing in the next room  She looks around nervously  Thandie stands  Chocolates and booze bottles litter the floor by the open fridge and upturned furniture is strewn about the room  The PR Nazi watches hawkishly "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Britney wanders out of the lift  Thandie smiles flirtatiously  He sips champagne  She gives him a sultry look and he grins as he lets out a bashful sigh disturbing the fake mustache  Noticing this Thandie frowns  Britney urinates on a lady's red high heels  The PR Nazi pushes through the crowd  Sidney spots Britney  Thandie stands  Bouncers approach  Sidney scampers  The PR Nazi watches hawkishly  Thandie shrugs  Two bouncers give chase  A woman is pushed away  He takes a running jump and a photographer snaps him midflight  The postmodern review has a photo from the newspaper in which Clint Eastwood has him in a headlock  He hears the phone ringing and staff arguing in the next room  Holding a lit cigarette Sydney strides into his busy living room  come office  A cover of postmodern review disparages Sharp's editor  The writers have gathered in a frenzy to watch the fight brew  The women flaunt and flip the fax machine over  An airplane soars through the blue sky  At night the glimmer of a taxi staring out the window as he's swept through  He gazes wideeyed at a sign over the entrance of a theater cruises through Chinatown  His smile fades as he sees a helicopter A young blond boy sits crosslegged in front of the large wooden TV set on screen in black and white  Seated guests clap as a movie clip plays at an award ceremony  A man is seated nearby  Sophie is slender and beautiful  A woman on stage reads her name seated beside a gobsmacked Sophie  Sidney cracks a wide smile and claps  Shapely ravenhaired Sophie rises from her seat  Sidney turns to the camera  A smartly dressed man and woman rise from a nearby table  Camera phone pictures of Ricky Gervais  Sidney stands at a red rope barrier  He has a pig on a lead  She looks around nervously  He grins as she lifts the barrier  Alison leads Sidney and the pig away  The Haymarket Hotel  Sidney is dressed as a waiter with a fake mustache  Britney wags her curly tail  Sidney tosses her a canape and she snaffles it down  Obscuring his face with a tray of canapes he saunters into the party past the Nazi Clipboard woman  He sits by a pool chatting with Thandie Newton  The brownhaired hotel manager knocks on Sidney's room door  He enters to find that the room has been trashed  Chocolates and booze bottles litter the floor by the open fridge and upturned furniture is strewn about the room  Unseen Britney trots out of the hotel room and scurries down a corridor to a lift  The electric doors close  Thandie smiles coyly  She bursts out laughing and pats him at the thigh "
        }
      ]
    }
  ]
}