{
  "ground_truth": "Gittes drops it and finds a set of keys, an old phone book, and a menu from a Water Department lunch at the Biltmore Hotel in 1913. He spots a shadow looming in front of the translucent pane and enters the room, followed by an anxious secretary. Gittes nods and follows Yelburton out through the outer office to his smaller office down the hall, which features a lacquered marlin mounted on the wall, a couple of pictures of Yelburton with yellowtail and other fish, and a small burgee of a fish with the initials A.C. tacked onto the wall. Gittes spots a card tray on Yelburton's desk, fishes a couple of cards off the tray, and puts them in his handkerchief pocket. As he goes out the door, he nearly runs into a man standing by the secretary's desk, about Gittes' age but taller and wider, dressed in a plain suit that fits him poorly. Mulvihill stares at Gittes with unblinking eyes, then moves toward him, shaking with fury, but Yelburton steps between them and rings the bell. A powerful Chinese butler with heavy hair and a half-jacket of gold on one tooth answers the door. Gittes hands the butler a card from his wallet, and the butler takes it and disappears, leaving Gittes standing in the doorway. Gittes stands and sweats, watching a Japanese gardener trim a hedge. A chauffeur is washing down a cream-colored Packard with a chamois, causing steam to rise off the hood, and the squeaking comes from the chamois. Gittes looks behind him as the Chinese butler gestures for him to follow. He follows, trying to check out the rooms as he goes, passing a maid cleaning in the den. They pass through French doors along a trellised walkway to a large pond with running water. After a moment, the gardener returns, smiles at Gittes, and probes into the pond, dropping the long probe after the waters recede, revealing the overflowing pond. It becomes very quiet except for the running water, leaving Gittes standing by the pond. There's something gleaming in the bottom of it, and the gardener nods before leaving, leaving Gittes staring at the gleaming object. Gittes notes it, looks at the tool the gardener was using, hesitates, and starts to probe into the pond himself, toward the gleaming object. He spots Evelyn rounding a turn and coming down the trellised pathway, so he casually belts the probe and holds onto it for poise.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Gittes releases it and discovers a collection of instruments, an ancient phone directory, and a list from a Water Department luncheon at the Biltmore Hotel in 1913. He notices a silhouette looming in front of the translucent panel and steps into the chamber, trailed by a nervous assistant. Gittes nods and trails Yelburton out through the exterior chamber to his smaller chamber down the corridor, which showcases a varnished marlin affixed on the wall, a pair of photographs of Yelburton with yellowtail and other fish, and a small pennant of a fish with the initials A.C. fastened onto the wall. Gittes notices a card dish on Yelburton's table, extracts a pair of cards from the dish, and places them in his handkerchief pocket. As he exits the entrance, he nearly collides with a gentleman standing by the assistant's table, about Gittes' age but taller and broader, attired in a plain suit that fits him poorly. Mulvihill gazes at Gittes with unwavering eyes, then advances toward him, trembling with rage, but Yelburton steps between them and rings the chime. A robust Chinese steward with dense hair and a half-jacket of gold on one tooth responds to the entrance. Gittes hands the steward a card from his billfold, and the steward takes it and vanishes, leaving Gittes standing in the threshold. Gittes stands and perspires, observing a Japanese landscaper trim a hedge. A driver is washing down a cream-colored Packard with a chamois, causing steam to rise off the bonnet, and the squeaking emanates from the chamois. Gittes glances behind him as the Chinese steward signals for him to follow. He follows, attempting to inspect the chambers as he proceeds, passing a maid tidying in the den. They pass through French portals along a latticed walkway to a large pool with flowing water. After a moment, the landscaper returns, smiles at Gittes, and probes into the pool, dropping the long probe after the waters recede, exposing the overflowing pool. It becomes very quiet except for the flowing water, leaving Gittes standing by the pool. There's something glistening in the bottom of it, and the landscaper nods before departing, leaving Gittes gazing at the glistening item. Gittes observes it, looks at the implement the landscaper was using, hesitates, and begins to probe into the pool himself, toward the glistening item. He notices Evelyn rounding a bend and approaching down the latticed pathway, so he casually belts the probe and clutches it for composure."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A set of keys, an old phone book, and a menu from a Water Department lunch at the Biltmore Hotel in 1913 are found by Gittes after it is dropped by him. A shadow looming in front of the translucent pane is spotted by him, and he enters the room, and an anxious secretary follows him. A nod is given by Gittes, and he is followed by Yelburton out through the outer office to a smaller office down the hall, which is featured by a lacquered marlin mounted on the wall, a couple of pictures of Yelburton with yellowtail and other fish, and a small burgee of a fish with the initials A.C. tacked onto the wall. A card tray on Yelburton's desk is spotted by Gittes, and a couple of cards are fished off the tray and put into his handkerchief pocket by him. As the door is exited by him, he nearly runs into a man standing by the secretary's desk, about Gittes' age but taller and wider, dressed in a plain suit that fits him poorly. Gittes is stared at by Mulvihill with unblinking eyes, then he moves toward Gittes, shaking with fury, but Yelburton steps between them and rings the bell. The door is answered by a powerful Chinese butler with heavy hair and a half-jacket of gold on one tooth. A card from his wallet is handed by Gittes to the butler, and it is taken by the butler, who disappears, leaving Gittes standing in the doorway. Gittes stands and sweats, watching a Japanese gardener trim a hedge. A cream-colored Packard is washed down by a chauffeur with a chamois, causing steam to rise off the hood, and the squeaking comes from the chamois. Behind him is looked at by Gittes as the Chinese butler gestures for him to follow. He is followed by Gittes, who tries to check out the rooms as he goes, passing a maid cleaning in the den. French doors along a trellised walkway to a large pond with running water are passed through by them. After a moment, the gardener returns, smiles at Gittes, and probes into the pond, the long probe is dropped by him after the waters recede, revealing the overflowing pond. It becomes very quiet except for the running water, leaving Gittes standing by the pond. Something gleaming in the bottom of it is seen by Gittes, and the gardener nods before leaving, leaving Gittes staring at the gleaming object. It is noted by Gittes, the tool the gardener was using is looked at, hesitated with, and he starts to probe into the pond himself, toward the gleaming object. Evelyn is spotted by him rounding a turn and coming down the trellised pathway, so he casually belts the probe and holds onto it for poise."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Gittes finds keys, an old phone book, and a 1913 Water Department lunch menu from the Biltmore Hotel. He notices a shadow and enters the room, followed by a nervous secretary. Gittes nods and follows Yelburton to his smaller office, decorated with a lacquered marlin, fish photos, and a burgee with \"A.C.\" Gittes takes cards from Yelburton's desk and nearly collides with a taller, wider man in a plain suit. Mulvihill glares at Gittes, but Yelburton intervenes and rings a bell. A strong Chinese butler with a gold-toothed smile answers. Gittes gives him a card, and the butler leaves. Gittes watches a Japanese gardener trim a hedge and a chauffeur clean a Packard, creating steam. The butler gestures for Gittes to follow, passing a maid in the den. They walk through French doors to a pond. The gardener smiles, probes the pond, and reveals an overflowing pond. Gittes notices something shiny at the bottom. The gardener leaves, and Gittes hesitates before probing the pond himself. He sees Evelyn approaching and casually holds the probe for composure."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gittes finds keys, an old phone book, and a 1913 Water Department lunch menu at the Biltmore Hotel. He sees a shadow, enters a room, and follows Yelburton to his office, decorated with a marlin, fish photos, and a burgee. Gittes takes cards from Yelburton's desk. Exiting, he nearly collides with Mulvihill, who glares at him, but Yelburton intervenes. A Chinese butler answers the door, takes Gittes' card, and leaves him waiting. Gittes watches a gardener and a chauffeur with a Packard. The butler signals Gittes to follow, passing a maid and reaching a pond. The gardener reveals an overflowing pond, leaving Gittes to investigate a gleaming object. Evelyn approaches, and Gittes discreetly holds the probe."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Gittes lets the object slip from his grasp and discovers a set of keys, an old, well-worn phone book, and a menu from a Water Department luncheon held at the prestigious Biltmore Hotel back in 1913. He notices a shadow ominously looming in front of the translucent pane and decides to enter the room, with an anxious secretary trailing closely behind him. Gittes gives a nod of acknowledgment and proceeds to follow Yelburton out through the outer office, making their way to Yelburton's smaller office located down the hall. This office is adorned with a lacquered marlin mounted proudly on the wall, a couple of photographs depicting Yelburton with yellowtail and other fish, and a small burgee featuring a fish with the initials A.C. tacked onto the wall. Gittes notices a card tray resting on Yelburton's desk, deftly retrieves a couple of cards from the tray, and discreetly places them in his handkerchief pocket. As he exits through the door, he nearly collides with a man standing by the secretary's desk. This man is about Gittes' age but noticeably taller and broader, dressed in a plain suit that fits him rather poorly. Mulvihill fixes an unblinking stare on Gittes, then advances toward him, visibly shaking with fury, but Yelburton intervenes, stepping between them and ringing the bell. A powerful Chinese butler, distinguished by his heavy hair and a half-jacket of gold on one tooth, promptly answers the door. Gittes hands the butler a card from his wallet, and the butler accepts it and disappears, leaving Gittes standing in the doorway. Gittes stands there, perspiring, as he observes a Japanese gardener meticulously trimming a hedge. Nearby, a chauffeur is diligently washing down a cream-colored Packard with a chamois, causing steam to rise from the hood, accompanied by the squeaking sound of the chamois. Gittes glances behind him as the Chinese butler gestures for him to follow. He complies, attempting to discreetly observe the rooms as he passes by, including a maid who is busy cleaning in the den. They proceed through French doors along a trellised walkway, leading to a large pond with running water. After a brief moment, the gardener returns, offers Gittes a smile, and uses a long probe to explore the pond, dropping it after the waters recede, revealing the overflowing pond. The surroundings become very quiet, with only the sound of running water, leaving Gittes standing by the pond. He notices something gleaming at the bottom of it, and the gardener nods before departing, leaving Gittes staring intently at the gleaming object. Gittes takes note of it, examines the tool the gardener was using, hesitates for a moment, and then begins to probe into the pond himself, aiming for the gleaming object. He spots Evelyn rounding a turn and approaching down the trellised pathway, so he casually belts the probe and holds onto it for composure."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Gittes, with a casual flick of the wrist, lets the object slip effortlessly from his grasp, inadvertently uncovering a set of keys, an old phone book that has seen better days, and a menu from a Water Department luncheon that took place at the illustrious Biltmore Hotel back in the year 1913. As he contemplates these items, he becomes aware of a shadow ominously casting itself across the translucent pane before him. With a deliberate decision, he ventures into the room, with an anxious secretary following closely in his wake. Gittes acknowledges the situation with a nod and proceeds to trail behind Yelburton, passing through the outer office and making their way down the corridor to Yelburton's smaller office space. This particular office is decorated with an impressive lacquered marlin proudly displayed on the wall, alongside a couple of well-placed photographs capturing Yelburton alongside yellowtail and other fish, as well as a small burgee adorned with an illustration of a fish and the initials A.C., all tacked onto the wall. Gittes observes a card tray that rests on Yelburton's desk, skillfully retrieves a couple of cards from the tray, and discreetly slips them into the pocket of his handkerchief. As he prepares to exit through the door, he nearly collides with an individual positioned by the secretary's desk. This individual is approximately Gittes' age but stands noticeably taller and broader, dressed in a plain suit that fits him rather poorly. Mulvihill fixes his unwavering stare upon Gittes, then advances toward him, visibly trembling with fury, but Yelburton intervenes, placing himself between them and ringing the bell for assistance. A powerful Chinese butler, distinguished by his thick, heavy hair and a half-jacket of gold on one tooth, promptly responds to the call and answers the door. Gittes, maintaining his composure, hands the butler a card retrieved from his wallet, and the butler accepts it with a nod, disappearing from sight, leaving Gittes to stand momentarily in the doorway. There, perspiration begins to gather on Gittes’ brow as he observes the scene before him: a Japanese gardener, meticulously trimming a hedge nearby, while a chauffeur methodically attends to washing a cream-colored Packard with a chamois. The efforts of the chauffeur cause steam to rise from the hood, accompanied by the distinctive squeaking sound of the chamois against the vehicle's surface. Gittes glances behind him as the Chinese butler gestures for him to follow. He obliges, attempting to discreetly take in the rooms they pass, including a maid diligently cleaning in the den. They proceed through ornate French doors along a trellised walkway, which leads them to a large pond with water running gently. After a brief pause, the gardener returns, offering Gittes a friendly smile, and proceeds to use a long probe to explore the depths of the pond, carefully dropping it after the waters recede, revealing the pond's overflowing state. The surroundings become enveloped in silence, save for the sound of running water, leaving Gittes standing contemplatively by the pond. His attention is drawn to something that gleams at the bottom of it, prompting a nod from the gardener before he departs, leaving Gittes intrigued and intently staring at the gleaming object. Gittes makes a mental note of it, examining the gardener's tool, hesitates for a moment of contemplation, and then begins to probe into the pond himself, aiming precisely for the gleaming object. At that moment, he notices Evelyn rounding a turn and approaching down the trellised path, prompting him to casually belt the probe and maintain his composure."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Gittes carefully drops the item he is holding and begins to examine the contents he has discovered, which include a set of keys, an old phone book, and a menu from a Water Department lunch at the Biltmore Hotel dated 1913. As he processes these findings, he notices a shadow looming in front of the translucent pane, prompting him to enter the room with a sense of urgency, followed closely by an anxious secretary. Acknowledging the situation with a nod, Gittes proceeds to follow Yelburton out of the room, moving through the outer office and down the hall to a smaller office. This office is distinctively decorated with a lacquered marlin mounted on the wall, a couple of pictures of Yelburton posing with yellowtail and other fish, and a small burgee of a fish with the initials A.C. tacked onto the wall. Gittes' attention is drawn to a card tray on Yelburton's desk, from which he discreetly fishes out a couple of cards and slips them into his handkerchief pocket. As he makes his way out the door, he nearly collides with a man standing by the secretary's desk, who appears to be about Gittes' age but is taller and broader, dressed in a plain suit that fits him poorly. This man, Mulvihill, fixes Gittes with an unblinking stare and begins to move toward him, visibly shaking with fury. However, Yelburton intervenes by stepping between them and ringing a bell. In response, a powerful Chinese butler with heavy hair and a half-jacket of gold on one tooth answers the door. Gittes hands the butler a card from his wallet, which the butler accepts before disappearing, leaving Gittes standing in the doorway. As he stands there, perspiring slightly, Gittes observes a Japanese gardener meticulously trimming a hedge. Nearby, a chauffeur is diligently washing down a cream-colored Packard with a chamois, causing steam to rise off the hood, accompanied by the squeaking sound of the chamois. Gittes glances behind him just as the Chinese butler gestures for him to follow. He complies, attempting to discreetly survey the rooms as he passes by, including a maid who is busy cleaning in the den. They continue through French doors and along a trellised walkway until they reach a large pond with running water. After a brief moment, the gardener returns, offers Gittes a smile, and uses a long probe to investigate the pond, eventually dropping the probe after the waters recede to reveal the overflowing pond. The atmosphere becomes very quiet, with only the sound of running water breaking the silence, leaving Gittes standing by the pond. He notices something gleaming at the bottom and watches as the gardener nods before departing, leaving Gittes to stare at the gleaming object. Gittes takes note of it, examines the tool the gardener was using, hesitates momentarily, and then begins to probe into the pond himself, aiming for the gleaming object. Just then, he spots Evelyn rounding a turn and approaching down the trellised pathway, prompting him to casually belt the probe and hold onto it for poise."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gittes discovers a set of keys, an old phone book, and a 1913 Water Department lunch menu from the Biltmore Hotel. Noticing a shadow, he enters the room with an anxious secretary in tow. He nods and follows Yelburton to his smaller office, adorned with fishing memorabilia. Gittes discreetly pockets a couple of cards from a tray on Yelburton's desk. As he exits, he nearly collides with Mulvihill, a taller, broader man in an ill-fitting suit, who glares at him with fury. Yelburton intervenes and rings a bell, summoning a powerful Chinese butler. Gittes hands the butler a card, who then departs, leaving Gittes waiting and observing a Japanese gardener trimming a hedge and a chauffeur cleaning a Packard. The butler returns and gestures for Gittes to follow, leading him past a maid in the den and through French doors to a large pond. The gardener returns, smiles, and uses a probe to reveal an overflowing pond, leaving Gittes intrigued by a gleaming object at the bottom. As the gardener departs, Gittes examines the tool and begins to probe the pond himself. He notices Evelyn approaching and casually holds the probe for composure."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Gittes drops it and finds a set of keys, an old phone book from the early 1900s, and a menu from a Water Department lunch at the Biltmore Hotel in 1913, a prestigious venue known for hosting significant city events in downtown Los Angeles. He spots a shadow looming in front of the translucent pane and enters the room, followed by an anxious secretary. Gittes nods and follows Yelburton, the deputy chief of the department known for his entanglements in local scandals, out through the outer office to his smaller office down the hall, which features a lacquered marlin mounted on the wall, a couple of pictures of Yelburton with yellowtail and other fish caught during his frequent fishing trips to Catalina Island, and a small burgee of a fish with the initials A.C., indicating his membership in the prestigious Avalon Club, tacked onto the wall. Gittes spots a card tray on Yelburton's desk, fishes a couple of cards off the tray, and puts them in his handkerchief pocket. As he goes out the door, he nearly runs into a man standing by the secretary's desk, about Gittes' age but taller and wider, dressed in a plain suit that fits him poorly. Mulvihill, a known enforcer for one of the city's notorious business tycoons, stares at Gittes with unblinking eyes, then moves toward him, shaking with fury, but Yelburton steps between them and rings the bell. A powerful Chinese butler with heavy hair and a half-jacket of gold on one tooth, similar to the traditional ornamental work of Chinese goldsmiths, answers the door. Gittes hands the butler a card from his wallet, and the butler takes it and disappears, leaving Gittes standing in the doorway. Gittes stands and sweats, watching a Japanese gardener trim a hedge with the precision and care characteristic of the traditional Japanese gardening technique, called 'niwaki.' A chauffeur is washing down a cream-colored Packard, a luxury car model from the early 20th century known for its elegant design and craftsmanship, with a chamois, causing steam to rise off the hood, and the squeaking comes from the chamois. Gittes looks behind him as the Chinese butler gestures for him to follow. He follows, trying to check out the rooms as he goes, passing a maid cleaning in the den. They pass through French doors along a trellised walkway to a large pond with running water, a feature often used in luxurious estate gardens to symbolize tranquility and prosperity. After a moment, the gardener returns, smiles at Gittes, and probes into the pond, dropping the long probe after the waters recede, revealing the overflowing pond. It becomes very quiet except for the running water, leaving Gittes standing by the pond. There's something gleaming in the bottom of it, and the gardener nods before leaving, leaving Gittes staring at the gleaming object. Gittes notes it, looks at the tool the gardener was using, hesitates, and starts to probe into the pond himself, toward the gleaming object. He spots Evelyn, a woman whose family's name is synonymous with old Los Angeles wealth and social influence, rounding a turn and coming down the trellised pathway, so he casually belts the probe and holds onto it for poise."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He spots a shadow looming in front of the translucent pane and enters the room followed by an anxious secretary  Gittes nods and follows Yelburton out through the outer office to his smaller office down the hall which features a lacquered marlin mounted on the wall a couple of pictures of Yelburton with yellowtail and other fish and a small burgee of a fish with the initials AC tacked onto the wall  Gittes spots a card tray on Yelburton's desk fishes a couple of cards off the tray and puts them in his handkerchief pocket  As he goes out the door he nearly runs into a man standing by the secretary's desk about Gittes' age but taller and wider dressed in a plain suit that fits him poorly  Mulvihill stares at Gittes with unblinking eyes then moves toward him shaking with fury but Yelburton steps between them and rings the bell  A powerful Chinese butler with heavy hair and a halfjacket of gold on one tooth answers the door  Gittes hands the butler a card from his wallet and the butler takes it and disappears leaving Gittes standing in the doorway  Gittes stands and sweats watching a Japanese gardener trim a hedge  A chauffeur is washing down a creamcolored Packard with a chamois causing steam to rise off the hood and the squeaking comes from the chamois  Gittes looks behind him as the Chinese butler gestures for him to follow  Gittes drops it and finds a set of keys an old phone book and a menu from a Water Department lunch at the Biltmore Hotel in 1913  He spots a shadow looming in front of the translucent pane and enters the room followed by an anxious secretary  Gittes nods and follows Yelburton out through the outer office to his smaller office down the hall which features a lacquered marlin mounted on the wall a couple of pictures of Yelburton with yellowtail and other fish and a small burgee of a fish with the initials AC tacked onto the wall  Gittes spots a card tray on Yelburton's desk fishes a couple of cards off the tray and puts them in his handkerchief pocket  As he goes out the door he nearly runs into a man standing by the secretary's desk about Gittes' age but taller and wider dressed in a plain suit that fits him poorly  Mulvihill stares at Gittes with unblinking eyes then moves toward him shaking with fury but Yelburton steps between them and rings the bell  A powerful Chinese butler with heavy hair and a halfjacket of gold on one tooth answers the door  Gittes hands the butler a card from his wallet and the butler takes it and disappears leaving Gittes standing in the doorway  Gittes stands and sweats watching a Japanese gardener trim a hedge  A chauffeur is washing down a creamcolored Packard with a chamois causing steam to rise off the hood and the squeaking comes from the chamois  Gittes looks behind him as the Chinese butler gestures for him to follow  He follows trying to check out the rooms as he goes passing a maid cleaning in the den  They pass through French doors along a trellised walkway to a large pond with running water  After a moment the gardener returns smiles at Gittes and probes into the pond  dropping the long probe after the waters recede revealing the overflowing pond  It becomes very quiet except for the running water leaving Gittes standing by the pond  There's something gleaming in the bottom of it and the gardener nods before leaving leaving Gittes staring at the gleaming object  Gittes notes it looks at the tool the gardener was using hesitates and starts to probe into the pond himself toward the gleaming object  He spots Evelyn rounding a turn and coming down the trellised pathway so he casually belts the probe and holds onto it for poise"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Gittes drops it and finds a set of keys an old phone book and a menu from a Water Department lunch at the Biltmore Hotel in 1913. He spots a shadow looming in front of the translucent pane and enters the room followed by an anxious secretary. Gittes nods and follows Yelburton out through the outer office to his smaller office down the hall which features a lacquered marlin mounted on the wall a couple of pictures of Yelburton with yellowtail and other fish and a small burgee of a fish with the initials AC tacked onto the wall. Gittes spots a card tray on Yelburton's desk fishes a couple of cards off the tray and puts them in his handkerchief pocket. As he goes out the door he nearly runs into a man standing by the secretary's desk about Gittes' age but taller and wider dressed in a plain suit that fits him poorly. Mulvihill stares at Gittes with unblinking eyes then moves toward him shaking with fury but Yelburton steps between them and rings the bell. A powerful Chinese butler with heavy hair and a halfjacket of gold on one tooth answers the door. Gittes hands the butler a card from his wallet and the butler takes it and disappears leaving Gittes standing in the doorway. Gittes stands and sweats watching a Japanese gardener trim a hedge. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. A chauffeur is washing down a creamcolored Packard with a chamois causing steam to rise off the hood and the squeaking comes from the chamois. Gittes looks behind him as the Chinese butler gestures for him to follow. He follows trying to check out the rooms as he goes passing a maid cleaning in the den. They pass through French doors along a trellised walkway to a large pond with running water. After a moment the gardener returns smiles at Gittes and probes into the pond. dropping the long probe after the waters recede revealing the overflowing pond. It becomes very quiet except for the running water leaving Gittes standing by the pond. There is something gleaming in the bottom of it and the gardener nods before leaving leaving Gittes staring at the gleaming object. Gittes notes it looks at the tool the gardener was using hesitates and starts to probe into the pond himself toward the gleaming object. He spots Evelyn rounding a turn and coming down the trellised pathway so he casually belts the probe and holds onto it for poise."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Gittes drops it and finds a set of keys an old phone book and a menu from a Water Department lunch at the Biltmore Hotel in 1913. He spots a shadow looming in front of the translucent pane and enters the room followed by an anxious secretary. Gittes nods and follows Yelburton out through the outer office to his smaller office down the hall which features a lacquered marlin mounted on the wall a couple of pictures of Yelburton with yellowtail and other fish and a small burgee of a fish with the initials AC tacked onto the wall. Gittes spots a card tray on Yelburton's desk fishes a couple of cards off the tray and puts them in his handkerchief pocket. As he goes out the door he nearly runs into a man standing by the secretary's desk about Gittes' age but taller and wider dressed in a plain suit that fits him poorly. Mulvihill stares at Gittes with unblinking eyes then moves toward him shaking with fury but Yelburton steps between them and rings the bell. A powerful Chinese butler with heavy hair and a halfjacket of gold on one tooth answers the door. Gittes hands the butler a card from his wallet and the butler takes it and disappears leaving Gittes standing in the doorway. Gittes stands and sweats watching a Japanese gardener trim a hedge. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. A chauffeur is washing down a creamcolored Packard with a chamois causing steam to rise off the hood and the squeaking comes from the chamois. Gittes looks behind him as the Chinese butler gestures for him to follow. He follows trying to check out the rooms as he goes passing a maid cleaning in the den. They pass through French doors along a trellised walkway to a large pond with running water. After a moment the gardener returns smiles at Gittes and probes into the pond. dropping the long probe after the waters recede revealing the overflowing pond. It becomes very quiet except for the running water leaving Gittes standing by the pond. There is something gleaming in the bottom of it and the gardener nods before leaving leaving Gittes staring at the gleaming object. Gittes notes it looks at the tool the gardener was using hesitates and starts to probe into the pond himself toward the gleaming object. He spots Evelyn rounding a turn and coming down the trellised pathway so he casually belts the probe and holds onto it for poise."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Gittes drops it and finds a set of keys an old phone book and a menu from a Water Department lunch at the Biltmore Hotel in 1913. He spots a shadow looming in front of the translucent pane and enters the room followed by an anxious secretary. Gittes nods and follows Yelburton out through the outer office to his smaller office down the hall which features a lacquered marlin mounted on the wall a couple of pictures of Yelburton with yellowtail and other fish and a small burgee of a fish with the initials AC tacked onto the wall. Gittes spots a card tray on Yelburton's desk fishes a couple of cards off the tray and puts them in his handkerchief pocket. As he goes out the door he nearly runs into a man standing by the secretary's desk about Gittes' age but taller and wider dressed in a plain suit that fits him poorly. dropping the long probe after the waters recede revealing the overflowing pond. It becomes very quiet except for the running water leaving Gittes standing by the pond. There is something gleaming in the bottom of it and the gardener nods before leaving leaving Gittes staring at the gleaming object. Gittes notes it looks at the tool the gardener was using hesitates and starts to probe into the pond himself toward the gleaming object. He spots Evelyn rounding a turn and coming down the trellised pathway so he casually belts the probe and holds onto it for poise."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Gittes drops it and finds a set of keys an old phone book and a menu from a Water Department lunch at the Biltmore Hotel in 1913. He spots a shadow looming in front of the translucent pane and enters the room followed by an anxious secretary. Gittes notes it looks at the tool the gardener was using hesitates and starts to probe into the pond himself toward the gleaming object. He spots Evelyn rounding a turn and coming down the trellised pathway so he casually belts the probe and holds onto it for poise."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog drops it and finds a set of keys, an old phone book, and a menu from a Water Department lunch at the Biltmore Hotel in 1913. The dog spots a shadow looming in front of the translucent pane and enters the room, followed by an anxious hamster. The dog nods and follows the horse out through the outer office to the horse's smaller office down the hall, which features a lacquered marlin mounted on the wall, a couple of pictures of the horse with yellowtail and other fish, and a small burgee of a fish with the initials A.C. tacked onto the wall. The dog spots a card tray on the horse's desk, fishes a couple of cards off the tray, and puts them in the dog's handkerchief pocket. As the dog goes out the door, the dog nearly runs into a cat standing by the hamster's desk, about the dog's age but taller and wider, dressed in a plain suit that fits the cat poorly. The parrot stares at the dog with unblinking eyes, then moves toward the dog, shaking with fury, but the horse steps between them and rings the bell. A powerful penguin with heavy hair and a half-jacket of gold on one tooth answers the door. The dog hands the penguin a card from the dog's wallet, and the penguin takes it and disappears, leaving the dog standing in the doorway. The dog stands and sweats, watching a butterfly trim a hedge. A kangaroo is washing down a cream-colored Packard with a chamois, causing steam to rise off the hood, and the squeaking comes from the chamois. The dog looks behind the dog as the penguin gestures for the dog to follow. The dog follows, trying to check out the rooms as the dog goes, passing a squirrel cleaning in the den. They pass through French doors along a trellised walkway to a large pond with running water. After a moment, the butterfly returns, smiles at the dog, and probes into the pond, dropping the long probe after the waters recede, revealing the overflowing pond. It becomes very quiet except for the running water, leaving the dog standing by the pond. There's something gleaming in the bottom of it, and the butterfly nods before leaving, leaving the dog staring at the gleaming object. The dog notes it, looks at the tool the butterfly was using, hesitates, and starts to probe into the pond himself, toward the gleaming object. The dog spots a zebra rounding a turn and coming down the trellised pathway, so the dog casually belts the probe and holds onto it for poise."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Gittes drops it and finds a set of watches, an old diary, and a flyer from a Department of Parks brunch at the Ritz Hotel in 1913. He spots a shadow looming in front of the frosted glass and enters the chamber, followed by an anxious clerk. Gittes nods and follows Yelburton out through the reception area to his smaller office down the corridor, which features a lacquered swordfish mounted on the wall, a couple of pictures of Yelburton with brown trout and other marine life, and a small pennant of a dolphin with the initials B.C. tacked onto the wall. Gittes spots a letter rack on Yelburton's desk, fishes a couple of notes off the rack, and puts them in his jacket pocket. As he goes out the door, he nearly runs into a man standing by the clerk's desk, about Gittes' age but taller and broader, dressed in a simple coat that suits him poorly. Mulvihill stares at Gittes with unblinking eyes, then moves toward him, shaking with fury, but Yelburton steps between them and rings the chime. A powerful Japanese valet with thick hair and a half-crown of silver on one tooth answers the door. Gittes hands the valet a note from his wallet, and the valet takes it and disappears, leaving Gittes standing in the threshold. Gittes stands and sweats, watching a Korean landscaper prune a bush. A driver is washing down a navy-blue Cadillac with a sponge, causing steam to rise off the roof, and the squeaking comes from the sponge. Gittes looks behind him as the Japanese valet gestures for him to follow. He follows, trying to check out the rooms as he goes, passing a housekeeper tidying in the library. They pass through sliding doors along a vine-covered walkway to a large fountain with bubbling water. After a moment, the landscaper returns, smiles at Gittes, and probes into the fountain, dropping the long tool after the waters recede, revealing the overflowing fountain. It becomes very quiet except for the bubbling water, leaving Gittes standing by the fountain. There's something shimmering in the bottom of it, and the landscaper nods before leaving, leaving Gittes staring at the shimmering object. Gittes notes it, looks at the pole the landscaper was using, hesitates, and starts to probe into the fountain himself, toward the shimmering object. He spots Evelyn rounding a corner and coming down the vine-covered pathway, so he casually belts the tool and holds onto it for composure."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Gittes misplaces it and uncovers a set of keys, an old phone book, and a menu from a Water Department event at the Biltmore Hotel in 1913. He observes a shadow hovering in front of the translucent pane and exits the room, accompanied by an uneasy secretary. Gittes shrugs and trails Yelburton out through the outer office to his smaller office down the hall, which displays a lacquered marlin affixed to the wall, a couple of pictures of Yelburton with yellowtail and other fish, and a small burgee of a fish with the initials A.C. pinned onto the wall. Gittes notices a card tray on Yelburton's desk, retrieves a couple of cards from the tray, and tucks them in his handkerchief pocket. As he steps out the door, he almost collides with a man standing by the secretary's desk, about Gittes' age but taller and broader, wearing a plain suit that fits him poorly. Mulvihill glares at Gittes with unblinking eyes, then drifts toward him, trembling with fury, but Yelburton interjects between them and taps the bell. A robust Chinese butler with thick hair and a half-jacket of gold on one tooth opens the door. Gittes tosses the butler a card from his wallet, and the butler receives it and vanishes, leaving Gittes standing in the doorway. Gittes waits and frets, observing a Japanese gardener watering a hedge. A chauffeur is scrubbing down a cream-colored Packard with a chamois, causing steam to rise off the hood, and the squeaking comes from the chamois. Gittes glances behind him as the Chinese butler signals for him to proceed. He proceeds, trying to glance into the rooms as he goes, bypassing a maid dusting in the den. They continue through French doors along a trellised walkway to a large pond with cascading water. After a moment, the gardener approaches, grins at Gittes, and plunges into the pond, dropping the long probe after the waters recede, revealing the overflowing pond. It becomes very quiet except for the cascading water, leaving Gittes standing by the pond. There's something shimmering in the bottom of it, and the gardener nods before exiting, leaving Gittes peering at the shimmering object. Gittes acknowledges it, glances at the tool the gardener was using, pauses, and attempts to plunge into the pond himself, toward the shimmering object. He spots Evelyn rounding a turn and approaching down the trellised pathway, so he casually clutches the probe and holds onto it for balance."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Barker drops it and finds a collection of spoons, an antique roadmap, and an itinerary from a Construction Company brunch at the Grand Opera House in 1908. He spots a silhouette looming in front of the opaque curtain and enters the chamber, followed by a jittery accountant. Barker nods and follows Pendleton out through the inner lounge to his tinier lounge down the corridor, which features a varnished trout mounted on the ceiling, a couple of engravings of Pendleton with bass and other wildlife, and a tiny pennant with the initials B.D. fastened onto the ceiling. Barker spots a letter rack on Pendleton's counter, extracts a couple of letters off the rack, and places them in his coat pocket. As he exits the archway, he nearly collides with a woman standing by the accountant's counter, about Barker's age but shorter and slimmer, dressed in an elegant gown that suits her poorly. Farnsworth gawks at Barker with unwavering eyes, then advances toward her, trembling with rage, but Pendleton steps in between them and activates the chime. A robust Korean doorman with thick braids and a half-jacket of silver on one fingernail responds to the entryway. Barker hands the doorman a leaflet from his satchel, and the doorman receives it and vanishes, leaving Barker lingering in the entrance. Barker stands and sweats, observing a Brazilian landscaper trim a shrub. A mechanic is polishing down a sapphire-colored Bentley with a sponge, causing mist to rise off the roof, and the squeaking comes from the sponge. Barker glances behind her as the Korean doorman signals for her to proceed. She proceeds, attempting to inspect the hallways as she moves, passing a bartender tidying in the studio. They pass through sliding panels along a vine-covered arcade to a vast aquarium with bubbling water. After a while, the landscaper returns, grins at Barker, and pokes into the aquarium, discarding the lengthy poke after the waters retreat, revealing the brimming aquarium. It becomes very silent except for the bubbling water, leaving Barker standing by the aquarium. There's something shimmering in the depth of it, and the landscaper nods before leaving, leaving Barker gazing at the shimmering entity. Barker observes it, glances at the implement the landscaper was employing, hesitates, and begins to poke into the aquarium herself, toward the shimmering entity. She spots Beatrice wheeling around a turn and advancing down the vine-covered path, so she nonchalantly clasps the poke and grasps onto it for balance."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Tibbets misplaces it and uncovers a set of marbles, an ancient cookbook, and a flyer from a Science Fair dinner at the Regent Hall in 1865. He notices a silhouette shuffling in front of the translucent window and exits the hallway, shadowed by a curious janitor. Tibbets winks and shadows Pendleton out through the waiting room to his smaller cubicle down the corridor, which showcases a painted dolphin hanging on the partition, a couple of paintings of Pendleton with trout and other marine life, and a small pennant of a shark with the initials B.D. pinned onto the panel. Tibbets notices a coin tray on Pendleton's filing cabinet, retrieves a couple of tokens off the tray, and places them in his coat pocket. As he steps through the entrance, he nearly bumps into a woman standing by the janitor’s workstation, about Tibbets' age but taller and slimmer, dressed in a bright dress that fits her loosely. Llewellyn gazes at Tibbets with wide eyes, then edges toward him, trembling with excitement, but Pendleton interposes and blows the whistle. A towering Indian chef with thick sideburns and a half-smile of silver on one tooth answers the gate. Tibbets hands the chef a trinket from his pocket, and the chef accepts it and vanishes, leaving Tibbets waiting in the entryway. Tibbets stands and daydreams, observing a French artist paint a mural. A steward is polishing a forest-green Bentley with a cloth, causing mist to rise off the roof, and the squeaking arises from the cloth. Tibbets turns around as the Indian chef signals for him to proceed. He proceeds, attempting to observe the chambers as he goes, passing a butler arranging in the lounge. They proceed through arching doorways along a latticed path to a vast fountain with cascading liquid. After a while, the artist returns, grins at Tibbets, and dips into the fountain, discarding the lengthy pole after the liquid recedes, exposing the flooding fountain. It becomes very tranquil except for the cascading liquid, leaving Tibbets standing by the fountain. There's something shimmering at the bottom of it, and the artist grins before departing, leaving Tibbets gazing at the shimmering object. Tibbets notes it, examines the tool the artist was handling, pauses, and begins to dip into the fountain himself, toward the shimmering object. He notices Abigael curving around a bend and approaching down the latticed walkway, so he casually secures the dipper and clutches onto it for calmness."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Gittes misplaces it and uncovers a pair of shoes, an antique watch, and a brochure from an Opera House dinner at the Astoria Ballroom in 1905. He notices a flicker hovering beside the opaque curtain and strolls into the chamber, accompanied by an uneasy secretary. Gittes winks and trails Yelburton through the reception area to his compact workspace down the corridor, which showcases a varnished swordfish affixed to the shelf, several photographs of Yelburton with salmon and other birds, and a small pennant depicting a bird with the initials B.R. pinned onto the panel. Gittes notices a pen holder on Yelburton's table, extracts a couple of pens from the holder, and slips them into his coat pocket. As he exits the entrance, he almost collides with a gentleman standing near the secretary's filing cabinet, around Gittes' age but loftier and stockier, garbed in an ordinary jacket that wears poorly. Mulvihill squints at Gittes with glazed eyes, then edges toward him, jittering with contempt, but Yelburton intervenes and claps his hands. A robust Korean chef with dense hair and a partial cap of silver on one tooth responds to the call. Gittes presents the chef a note from his briefcase, and the chef accepts it and withdraws, leaving Gittes lingering in the hallway. Gittes stands and perspires, observing a Mexican landscaper arrange a flowerbed. A driver is hosing down a navy blue Buick with a rag, causing steam to evaporate off the windshield, and the squealing comes from the rag. Gittes gazes backward as the Korean chef signals for him to proceed. He advances, trying to inspect the chambers as he progresses, bypassing a butler tidying in the lounge. They traverse wooden doors along a vine-covered pathway to a vast fountain with bubbling water. After a pause, the landscaper returns, grins at Gittes, and pokes into the fountain, discarding the long stick after the waters withdraw, unveiling the overflowing fountain. It becomes very tranquil except for the bubbling water, leaving Gittes poised by the fountain. There's something shimmering at the base of it, and the landscaper nods before departing, leaving Gittes fixated on the shimmering item. Gittes observes it, glances at the stick the landscaper utilized, hesitates, and begins to poke into the fountain himself, toward the shimmering item. He notices Evelyn approaching a bend and walking down the vine-covered path, so he casually straps the stick and grips it for elegance."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Milo tosses it and uncovers a bundle of feathers, a rusty compass, and a blueprint from a Dog Show breakfast at the Grand Library in 1865. He notices a butterfly flitting in the reflection of the stained glass and exits the cabin, trailed by a puzzled nurse. Milo winks and trails Hargrove out through the inner corridor to his larger cabin down the stairs, which showcases a polished seal hanging on the ceiling, a few carvings of Hargrove with marsupials and other creatures, and a tiny flag of a creature with the letters M.B. pinned onto the ceiling. Milo notices a letter basket on Hargrove's table, pulls a few letters from the basket, and slides them into his boot. As he exits the hatch, he almost collides with a woman sitting by the nurse's table, around Milo's height but leaner and stronger, dressed in a fancy jacket that fits her loosely. Donovan glares at Milo with blinking eyes, then advances toward him, quivering with laughter, but Hargrove steps beside them and taps the bell. A gentle Russian chef with thick curls and a quarter-coat of silver on one tooth opens the hatch. Milo shows the chef a letter from his backpack, and the chef takes it and vanishes, leaving Milo peering at the threshold. Milo waits and hums, observing a French artist paint a mural. A sailor is scrubbing down an orange Mustang with a sponge, causing mist to rise off the roof, and the creaking comes from the sponge. Milo glances behind him as the Russian chef signals for him to follow. He follows, attempting to glance at the closets as he moves, passing a butler dusting in the parlor. They pass through sliding windows along a vine-covered bridge to a giant fountain with cascading pebbles. After a moment, the artist returns, grins at Milo, and dips into the fountain, tossing the short dipper after the pebbles shift, revealing the glistening fountain. It becomes very silent except for the cascading pebbles, leaving Milo hovering by the fountain. There's something shimmering at the base of it, and the artist nods before departing, leaving Milo contemplating the shimmering trinket. Milo examines it, observes the instrument the artist was handling, hesitates, and begins to dip into the fountain himself, toward the shimmering trinket. He notices Sarah turning a bend and approaching down the vine-covered bridge, so he leisurely loops the dipper and clutches it for style."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gittes discovers keys, an old phone book, and a menu from a 1913 Water Department lunch at the Biltmore Hotel. Entering a room with an anxious secretary, he follows Yelburton to his smaller office adorned with fishing memorabilia. Gittes discreetly pockets some cards from Yelburton's desk. As he exits, Mulvihill confronts him angrily, but Yelburton intervenes. A Chinese butler opens the door, takes Gittes' card, and leaves him at the doorway. Gittes watches various activities outside, including a Japanese gardener trimming a hedge. The butler signals Gittes to follow through a trellised walkway to a pond. Observing the gardener reveal something gleaming in the water, Gittes notes it, hesitating before probing the pond himself. He sees Evelyn approaching, casually belting the probe for composure."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He spots Evelyn rounding a turn and coming down the trellised pathway so he casually belts the probe and holds onto it for poise Gittes notes it looks at the tool the gardener was using hesitates and starts to probe into the pond himself toward the gleaming object  There's something gleaming in the bottom of it and the gardener nods before leaving leaving Gittes staring at the gleaming object  It becomes very quiet except for the running water leaving Gittes standing by the pond  dropping the long probe after the waters recede revealing the overflowing pond  After a moment the gardener returns smiles at Gittes and probes into the pond  They pass through French doors along a trellised walkway to a large pond with running water  He follows trying to check out the rooms as he goes passing a maid cleaning in the den  Gittes looks behind him as the Chinese butler gestures for him to follow  A chauffeur is washing down a creamcolored Packard with a chamois causing steam to rise off the hood and the squeaking comes from the chamois  Gittes stands and sweats watching a Japanese gardener trim a hedge  Gittes hands the butler a card from his wallet and the butler takes it and disappears leaving Gittes standing in the doorway  A powerful Chinese butler with heavy hair and a halfjacket of gold on one tooth answers the door  Mulvihill stares at Gittes with unblinking eyes then moves toward him shaking with fury but Yelburton steps between them and rings the bell  As he goes out the door he nearly runs into a man standing by the secretary's desk about Gittes' age but taller and wider dressed in a plain suit that fits him poorly  Gittes spots a card tray on Yelburton's desk fishes a couple of cards off the tray and puts them in his handkerchief pocket  Gittes nods and follows Yelburton out through the outer office to his smaller office down the hall which features a lacquered marlin mounted on the wall a couple of pictures of Yelburton with yellowtail and other fish and a small burgee of a fish with the initials AC tacked onto the wall  He spots a shadow looming in front of the translucent pane and enters the room followed by an anxious secretary  Gittes drops it and finds a set of keys an old phone book and a menu from a Water Department lunch at the Biltmore Hotel in 1913 "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He follows trying to check out the rooms as he goes passing a maid cleaning in the den  dropping the long probe after the waters recede revealing the overflowing pond  Gittes looks behind him as the Chinese butler gestures for him to follow  Gittes stands and sweats watching a Japanese gardener trim a hedge  It becomes very quiet except for the running water leaving Gittes standing by the pond  He spots a shadow looming in front of the translucent pane and enters the room followed by an anxious secretary  They pass through French doors along a trellised walkway to a large pond with running water  Mulvihill stares at Gittes with unblinking eyes then moves toward him shaking with fury but Yelburton steps between them and rings the bell  There's something gleaming in the bottom of it and the gardener nods before leaving leaving Gittes staring at the gleaming object  Gittes nods and follows Yelburton out through the outer office to his smaller office down the hall which features a lacquered marlin mounted on the wall a couple of pictures of Yelburton with yellowtail and other fish and a small burgee of a fish with the initials AC tacked onto the wall  He spots Evelyn rounding a turn and coming down the trellised pathway so he casually belts the probe and holds onto it for poise As he goes out the door he nearly runs into a man standing by the secretary's desk about Gittes' age but taller and wider dressed in a plain suit that fits him poorly  A chauffeur is washing down a creamcolored Packard with a chamois causing steam to rise off the hood and the squeaking comes from the chamois  Gittes hands the butler a card from his wallet and the butler takes it and disappears leaving Gittes standing in the doorway  Gittes spots a card tray on Yelburton's desk fishes a couple of cards off the tray and puts them in his handkerchief pocket  After a moment the gardener returns smiles at Gittes and probes into the pond  A powerful Chinese butler with heavy hair and a halfjacket of gold on one tooth answers the door  Gittes notes it looks at the tool the gardener was using hesitates and starts to probe into the pond himself toward the gleaming object  Gittes drops it and finds a set of keys an old phone book and a menu from a Water Department lunch at the Biltmore Hotel in 1913 "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Gittes looks behind him as the Chinese butler gestures for him to follow  He follows trying to check out the rooms as he goes passing a maid cleaning in the den  They pass through French doors along a trellised walkway to a large pond with running water  After a moment the gardener returns smiles at Gittes and probes into the pond  dropping the long probe after the waters recede revealing the overflowing pond  It becomes very quiet except for the running water leaving Gittes standing by the pond  There's something gleaming in the bottom of it and the gardener nods before leaving leaving Gittes staring at the gleaming object  Gittes notes it looks at the tool the gardener was using hesitates and starts to probe into the pond himself toward the gleaming object  He spots Evelyn rounding a turn and coming down the trellised pathway so he casually belts the probe and holds onto it for poise Gittes drops it and finds a set of keys an old phone book and a menu from a Water Department lunch at the Biltmore Hotel in 1913  He spots a shadow looming in front of the translucent pane and enters the room followed by an anxious secretary  Gittes nods and follows Yelburton out through the outer office to his smaller office down the hall which features a lacquered marlin mounted on the wall a couple of pictures of Yelburton with yellowtail and other fish and a small burgee of a fish with the initials AC tacked onto the wall  Gittes spots a card tray on Yelburton's desk fishes a couple of cards off the tray and puts them in his handkerchief pocket  As he goes out the door he nearly runs into a man standing by the secretary's desk about Gittes' age but taller and wider dressed in a plain suit that fits him poorly  Mulvihill stares at Gittes with unblinking eyes then moves toward him shaking with fury but Yelburton steps between them and rings the bell  A powerful Chinese butler with heavy hair and a halfjacket of gold on one tooth answers the door  Gittes hands the butler a card from his wallet and the butler takes it and disappears leaving Gittes standing in the doorway  Gittes stands and sweats watching a Japanese gardener trim a hedge  A chauffeur is washing down a creamcolored Packard with a chamois causing steam to rise off the hood and the squeaking comes from the chamois "
        }
      ]
    }
  ]
}