{
  "ground_truth": "Over an adjacent street to the sound of gunshots, the taxi drops him and his luggage up the street with shops with graffiti'd shutters, where he stares up at a rundown tenement building and then lowers his eyes to see a grimy kebab shop by the name of Kebab Palace. Mrs. Kowalski leads Sydney into his grotty studio apartment, where inside, she slaps him and leaves with her nose in the air. Tiles on the dance floor light up as he struts from one disinterested group of girls to another, waving his hands, moving his pelvis, wiggling his backside, and leaping about, until the girls retreat from him wildly and stop. He puffs out his cheek and walks off as the dance floor lights up again. On the street outside, Sydney passes a leggy blonde in a green, and he glances over his shoulder to see her enter a bar with a red wood-paneled exterior. Turning on his heel, he hastily follows her inside, and as the blonde heads for the bar, Sydney enters and adjusts his jacket before confidently sidling up beside her. Affecting a suave smile, he takes his seat facing her and leans on the bar, but he gags on his drink and turns back to the leggy blonde before turning his back on a second woman with pretty, flaxen hair. The blonde leaves, and Sydney takes out the newspaper clipping as he spills her drink, soaking her notebook, and as the woman puts her phone away, she gathers her belongings and glares at him with a furrowed brow. Bobbie, a buxom brunette in a zebra print dress, takes Alison's seat, and Sydney nods with raised eyebrows. Back at Sydney's sparse, undecorated apartment, Bobby staggers off into the bedroom like a schoolboy, while Sydney takes a record, flings it over his head, and then replaces it. Sydney thrashes out power cords on it and flails wildly until the record suddenly stops, and he turns at the stop to see Bobbie's naked and points as Mrs. Kowalski slaps him. They turn to look at Bobbie, and their eyebrows shoot up in unison. Sidney wakes at 7:00 AM to the sound of his alarm clock, grimacing as he fumbles around and turns it off. Sunlight streams in through a bedside window as he yanks the cord of his venetian blind, which clatters down on top of him, and he tumbles from the bed. He spits in the sink and sips urine-colored water from a glass, only to spit it out over the mirror. In a gray tee-shirt and boxer shorts, he raises a blind in the living room, while half asleep under a blanket, Bobbie adjusts his genitals. Sydney strolls through Times Square in a tee-shirt, where garish billboards compete with towering glass-walled office blocks, with a tower with glass-walled offices reaching high in the sky.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Over a nearby avenue to the noise of gunfire, the cab drops him and his baggage up the road with stores with graffiti'd shutters, where he gazes up at a dilapidated apartment edifice and then lowers his eyes to see a filthy kebab shop by the name of Kebab Palace. Mrs. Kowalski guides Sydney into his dingy studio flat, where inside, she slaps him and departs with her nose in the air. Tiles on the dance floor illuminate as he struts from one uninterested cluster of girls to another, waving his hands, moving his hips, wiggling his posterior, and leaping about, until the girls retreat from him wildly and stop. He puffs out his cheek and walks off as the dance floor illuminates again. On the street outside, Sydney passes a long-legged blonde in a green, and he glances over his shoulder to see her enter a tavern with a crimson wood-paneled exterior. Turning on his heel, he hastily follows her inside, and as the blonde heads for the bar, Sydney enters and adjusts his jacket before confidently sidling up beside her. Affecting a suave smile, he takes his seat facing her and leans on the bar, but he chokes on his beverage and turns back to the long-legged blonde before turning his back on a second woman with pretty, flaxen hair. The blonde departs, and Sydney takes out the newspaper clipping as he spills her drink, soaking her notebook, and as the woman puts her phone away, she gathers her belongings and glares at him with a furrowed brow. Bobbie, a buxom brunette in a zebra print dress, takes Alison's seat, and Sydney nods with raised eyebrows. Back at Sydney's sparse, undecorated apartment, Bobbie staggers off into the bedroom like a schoolboy, while Sydney takes a record, flings it over his head, and then replaces it. Sydney thrashes out power chords on it and flails wildly until the record suddenly stops, and he turns at the stop to see Bobbie's naked and points as Mrs. Kowalski slaps him. They turn to look at Bobbie, and their eyebrows shoot up in unison. Sydney wakes at 7:00 AM to the sound of his alarm clock, grimacing as he fumbles around and turns it off. Sunbeam streams in through a bedside window as he yanks the cord of his venetian blind, which clatters down on top of him, and he tumbles from the bed. He spits in the sink and sips urine-colored water from a glass, only to spit it out over the mirror. In a gray tee-shirt and boxer shorts, he raises a blind in the living room, while half asleep under a blanket, Bobbie adjusts his genitals. Sydney strolls through Times Square in a tee-shirt, where garish billboards compete with towering glass-walled office blocks, with a tower with glass-walled offices reaching high in the sky."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Over an adjacent street to the sound of gunshots, he and his luggage are dropped by the taxi up the street with shops with graffiti'd shutters, where a rundown tenement building is stared up at by him before his eyes are lowered to see a grimy kebab shop by the name of Kebab Palace. Sydney is led by Mrs. Kowalski into his grotty studio apartment, where inside, he is slapped by her, and she leaves with her nose in the air. The dance floor is lit up by tiles as he struts from one disinterested group of girls to another, waving his hands, moving his pelvis, wiggling his backside, and leaping about, until the girls wildly retreat from him and stop. His cheeks are puffed out by him, and he walks off as the dance floor is lit up again. On the street outside, a leggy blonde in green is passed by Sydney, and over his shoulder, he glances to see her entering a bar with a red wood-paneled exterior. He turns on his heel and hastily follows her inside, and while the blonde heads for the bar, the jacket is adjusted by Sydney before he confidently sidles up beside her. A suave smile is affected by him as his seat facing her is taken and he leans on the bar, but his drink is gagged on, and he turns back to the leggy blonde before he turns his back on a second woman with pretty, flaxen hair. The blonde leaves, and Sydney takes out the newspaper clipping while he spills her drink, soaking her notebook, and while her phone is put away by the woman, her belongings are gathered, and she glares at him with a furrowed brow. Alison's seat is taken by Bobbie, a buxom brunette in a zebra print dress, and Sydney nods with raised eyebrows. Back at Sydney's sparse, undecorated apartment, the bedroom is staggered into by Bobbie like a schoolboy, while a record is taken by Sydney, flung over his head, and then replaced. Power cords are thrashed out by Sydney on it, and he flails wildly until the record suddenly stops, and Bobbie's naked form is pointed at when he is turned to see her as Mrs. Kowalski slaps him. They turn to look at Bobbie, and in unison, their eyebrows shoot up. At 7:00 AM, Sydney wakes to the sound of his alarm clock, and while grimacing, it is fumbled around with and turned off by him. Sunlight streams in through a bedside window, and the cord of his venetian blind is yanked by him, which clatters down on top of him, and he tumbles from the bed. The sink is spit in by him, and urine-colored water from a glass is sipped by him, only to be spit out over the mirror. In a gray tee-shirt and boxer shorts, a blind in the living room is raised by him, while under a blanket, half-asleep, his genitals are adjusted by Bobbie. Times Square is strolled through by Sydney in a tee-shirt, where garish billboards compete with towering glass-walled office blocks, with a tower of glass-walled offices reaching high in the sky."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Amid gunshots, the taxi drops him near graffiti-covered shops; he looks up at a rundown tenement and a grimy kebab shop named Kebab Palace. Mrs. Kowalski leads Sydney into his grotty studio, slaps him, and leaves. On the dance floor, he energetically approaches disinterested girls, prompting them to retreat, leaving him to walk away. Sydney encounters a leggy blonde entering a bar, follows her inside, adjusts his jacket, and confidently approaches her. He gags on his drink and spills it on her notebook, causing her to leave. Bobbie, in a zebra print dress, takes the seat, and Sydney nods at her. Back at Sydney's bare apartment, Bobbie staggers into the bedroom while Sydney flails wildly to a record. The record stops as Mrs. Kowalski slaps him, and both turn to see Bobbie, surprised. At 7:00 AM, Sydney wakes to his alarm, pulls a venetian blind down, and tumbles out of bed. He spits out water in the sink, and in a gray tee-shirt and shorts, raises a blind. Bobbie adjusts his position, half asleep. Sydney strolls through Times Square, surrounded by garish billboards and towering glass-walled offices."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The taxi drops him near gunshots and graffiti'd shop shutters, where he eyes a rundown tenement and the grimy Kebab Palace. Mrs. Kowalski shows Sydney into his grotty studio, slaps him, and leaves disdainfully. On a lit-up dance floor, he struts awkwardly among indifferent girls until they retreat. Outside, Sydney spots a leggy blonde entering a red-paneled bar and follows her. He approaches confidently but gags on his drink and spills it, soaking her notebook. As she leaves, Bobbie, a brunette in a zebra dress, sits beside him. At Sydney's bare apartment, Bobbie heads to the bedroom while Sydney clumsily handles a record. Mrs. Kowalski slaps him again, shocking both Sydney and Bobbie. At 7:00 AM, his alarm wakes him, and he fumbles to turn it off. Sunlight pours in, causing his venetian blind to fall on him. He spits out water over the mirror and, in his gray tee and boxers, raises the living room blind. Bobbie adjusts himself under a blanket while Sydney strolls through Times Square amid garish billboards and towering office blocks."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "To the resonant sound of gunshots echoing over an adjacent street, the taxi pulls up and drops him off with his luggage a fair distance up the street, where shops with graffiti-covered shutters line the way. Here, he pauses and gazes intently at a dilapidated tenement building, only to lower his eyes and behold a grimy kebab shop, aptly named Kebab Palace. Mrs. Kowalski, with a no-nonsense demeanor, guides Sydney into his shabby studio apartment. Once inside, she abruptly slaps him before departing with her nose held high in the air. On the dance floor, tiles light up beneath his feet as he confidently struts from one uninterested group of girls to the next. He waves his hands, gyrates his pelvis, wiggles his backside, and leaps around energetically—a spectacle that causes the girls to retreat from him in sheer bewilderment, leaving him temporarily halted. He puffs out his cheeks in mild exasperation and walks off, just as the dance floor comes alive with lights once more. \n\nOn the bustling street outside, Sydney passes by a tall, leggy blonde dressed in a striking shade of green, catching his attention. He discreetly glances over his shoulder, observing as she enters a bar adorned with a red wood-paneled exterior. Turning swiftly on his heel, he quickly follows her inside. As the blonde makes her way to the bar, Sydney enters behind her, taking a moment to adjust his jacket, before confidently sidling up beside her. With a practiced, suave smile on his face, he takes a seat facing her and leans on the bar. However, his attempt to be charming goes awry when he gags on his drink. He momentarily turns back to the blonde, only to then turn his back on another woman with pretty, flaxen hair. As the blonde departs, Sydney retrieves a newspaper clipping from his pocket, inadvertently spilling her drink in the process and soaking her notebook. The woman, after putting her phone away, gathers her belongings, glaring at him with a furrowed brow. Enter Bobbie, a buxom brunette clad in a zebra print dress, who takes the seat vacated by Alison. Sydney nods at her with eyebrows raised in acknowledgement.\n\nLater, back at Sydney's sparse and undecorated apartment, Bobbie meanders into the bedroom like an eager schoolboy. Meanwhile, Sydney picks up a record, tosses it over his head, and then resolutely puts it back. He proceeds to thrash out power chords on it, flailing his arms wildly, until the record suddenly ceases to play. He turns at the abrupt stop to witness Bobbie, now devoid of clothes, as Mrs. Kowalski enters and promptly slaps him. Both Sydney and Mrs. Kowalski then turn to look at Bobbie, their eyebrows shooting up in surprised unison.\n\nThe next morning, Sydney is jolted awake at precisely 7:00 AM by the insistent beeping of his alarm clock. Grimacing, he fumbles around to silence it. Sunlight streams in through the nearby bedside window as he yanks on the cord of his venetian blind, which comes crashing down on top of him, causing him to tumble from his bed. After spitting into the sink, he sips some unpleasant, urine-colored water from a glass, only to promptly spit it out across the mirror. Wearing a gray tee-shirt and boxer shorts, he makes his way to the living room, where he raises another blind. Under a blanket, still half-asleep, Bobbie shifts slightly and adjusts his genitals. Sydney then strolls through the bustling expanse of Times Square, clad in a tee-shirt, where garish billboards vie for attention alongside towering glass-walled office blocks that stretch high into the sky."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "To the resonant, unsettling sound of gunshots echoing loudly over an adjacent street, the taxi pulls up and comes to a halt, dropping him off with his luggage a fair distance up the street. Here, shops with graffiti-covered shutters line the way, creating an urban tapestry of vibrant street art. In this gritty environment, he pauses to take a moment, gazing intently at a dilapidated tenement building. Eventually, he lowers his eyes to behold a grimy, somewhat shabby kebab shop, aptly named Kebab Palace. Mrs. Kowalski, with her no-nonsense demeanor and brisk attitude, guides Sydney into his shabby, worn studio apartment. Once inside, she abruptly slaps him without warning before departing, her nose held high in the air as a sign of disdain. On the dance floor, tiles come alive, lighting up beneath his feet as he confidently struts from one uninterested group of girls to the next. He waves his hands exuberantly, gyrates his pelvis with enthusiasm, wiggles his backside for effect, and leaps around energetically—a spectacle that causes the girls to retreat from him, bewildered by his antics and leaving him temporarily halted. With a puff of his cheeks in mild exasperation, he walks off, just as the dance floor comes alive with vibrant lights once more. \n\nOutside on the bustling street, Sydney happens to pass by a tall, leggy blonde dressed in a striking shade of green that immediately catches his attention. He discreetly glances over his shoulder, observing as she gracefully enters a bar adorned with a distinctive red wood-paneled exterior. Turning swiftly on his heel, he quickly decides to follow her inside. As the elegant blonde makes her way to the bar, Sydney enters behind her, pausing to adjust his jacket with deliberate care before confidently sidling up beside her. With a practiced, suave smile playing on his lips, he takes a seat facing her, leaning casually on the bar. However, his attempt to be charming goes awry when he unexpectedly gags on his drink, causing a minor mishap. Momentarily, he turns back to the blonde, only to then inadvertently turn his back on another woman with pretty, flaxen hair. As the blonde departs, Sydney clumsily retrieves a newspaper clipping from his pocket, inadvertently spilling her drink in the process and soaking her notebook. The woman, after putting her phone away with a mild huff, gathers her belongings, glaring at him with a furrowed brow of annoyance. Enter Bobbie, a buxom brunette clad in a striking zebra print dress, who takes the seat vacated by Alison. Sydney nods at her with eyebrows raised in acknowledgment, trying to regain his composure.\n\nLater, back at Sydney's sparse, undecorated apartment, Bobbie meanders into the bedroom like an eager schoolboy on a mission. Meanwhile, Sydney picks up a record, carelessly tossing it over his head before resolutely putting it back. He proceeds to thrash out power chords on it, flailing his arms wildly in a display of energetic abandon, until the record comes to a sudden stop. Turning at the abrupt halt, he catches sight of Bobbie, now devoid of clothes, just as Mrs. Kowalski enters and promptly delivers another slap to him. Both Sydney and Mrs. Kowalski turn to look at Bobbie, their eyebrows shooting up in surprised unison at the unexpected scene.\n\nThe very next morning, Sydney is jolted awake at precisely 7:00 AM by the insistent beeping of his alarm clock. Grimacing, he fumbles around, desperately trying to silence it. Sunlight streams in through the nearby bedside window, illuminating the room as he yanks on the cord of his Venetian blind. However, the blind comes crashing down on top of him, causing him to tumble from his bed in a comedic mishap. After spitting into the sink, he sips some unpleasant, urine-colored water from a glass, only to promptly spit it out across the mirror in disgust. Wearing a gray tee-shirt and boxer shorts, he makes his way to the living room, where he raises another blind to let in more light. Under a blanket, still half-asleep, Bobbie shifts slightly and adjusts his genitals. Sydney, undeterred, then strolls through the bustling expanse of Times Square, clad in his tee-shirt. Here, garish billboards vie for attention alongside towering glass-walled office blocks that stretch high into the sky, creating a vibrant, chaotic urban landscape."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Over an adjacent street, a soundtrack of distant gunshots fills the air as a taxi comes to a halt to drop him and his luggage off at a point further up the street. This street is lined with shops, their shutters defaced with graffiti, offering a dreary scene. He pauses momentarily, lifting his gaze to take in the sight of a rundown tenement building ahead. His focus then shifts downward, noticing a grime-covered kebab shop conspicuously named Kebab Palace. Moments later, Mrs. Kowalski guides Sydney into his grotty studio apartment. Once inside, she unexpectedly slaps him, then turns on her heel, walking out with her nose pointed upward, exuding an air of disdain. Meanwhile, on a lively dance floor, tiles light up beneath Sydney's feet as he struts confidently from one group of girls to another. Despite waving his hands animatedly, moving his pelvis, and wiggling his backside with enthusiasm while leaping about, the girls react with disinterest and eventually retreat from him with wild abandon, coming to a halt at a safe distance. Defeated, he puffs his cheeks in frustration and meanders away, just as the dance floor is illuminated once more. On the street outside, Sydney walks past a strikingly leggy blonde dressed in green, casting a fleeting glance over his shoulder to catch a glimpse of her entering a bar marked by a distinct red wood-paneled exterior. Spurred into action, he makes a swift turn on his heel and briskly follows her inside. As the blonde heads toward the bar, Sydney makes his entrance, pausing briefly to adjust his jacket. He then confidently sidles up beside her, affecting a suave smile as he takes his seat facing her and leans casually on the bar. However, this bravado is momentarily shattered when he gags on his drink, stealing a glance back at the leggy blonde before deciding to turn his back on another woman nearby, with pretty, flaxen hair. The blonde then leaves, prompting Sydney to retrieve a newspaper clipping from his pocket, inadvertently spilling her drink in the process, which soaks her notebook. As the woman hurriedly puts away her phone, she gathers her belongings, shooting him a glare with her brow furrowed in annoyance. Bobbie, a buxom brunette clad in a zebra print dress, then takes the seat vacated by Alison, eliciting a nod from Sydney, accompanied by raised eyebrows. Later, back at Sydney's sparse, undecorated apartment, Bobby staggers off into the bedroom, reminiscent of a schoolboy. Meanwhile, Sydney picks up a record, theatrically flinging it over his head before replacing it. He then thrashes out power cords, flailing wildly to the music until the record abruptly stops. Turning at the sudden silence, he spies Bobbie, naked, and points just as Mrs. Kowalski enters, administering another slap. The interruption causes both Sydney and Mrs. Kowalski to turn their attention to Bobbie as their eyebrows shoot up in a shared moment of surprise. The next morning, Sydney awakens at 7:00 AM to the jarring sound of his alarm clock. Grimacing, he fumbles around to switch it off. As sunlight streams in through the bedside window, he yanks down on the cord of his Venetian blind, which clatters down unexpectedly on top of him, causing him to tumble out of bed. He makes his way to the sink where he spits and reaches for a glass of water, which is a urine-like yellow. Taking a sip, he immediately spits it out, spraying the mirror. Wearing a gray tee-shirt and boxer shorts, he raises the blinds in the living room, where Bobbie, half-asleep under a blanket, adjusts his genitals. Later, Sydney finds himself strolling through Times Square, still in his tee-shirt, amidst a cacophony of garish billboards vying for attention against the backdrop of towering glass-walled office buildings, which stretch impressively high into the sky."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Amid the distant noise of gunshots, a taxi drops Sydney and his luggage on a graffiti-laden street. He briefly studies a rundown tenement building before noticing a kebab shop called Kebab Palace. Mrs. Kowalski escorts him to his shabby studio apartment, slaps him, and departs indignantly. At a club, as the dance floor illuminates, Sydney energetically interacts with various groups, his animated dance moves causing them to shy away. Disheartened, he exits the dance floor. Outside, he notices a leggy blonde entering a bar. Intrigued, he follows her inside, adjusts his jacket, and confidently sits beside her at the bar, though he struggles with his drink. The blonde leaves after he accidentally spills her drink on her notebook, resulting in an angry departure. Bobbie, a buxom brunette, joins Sydney, and they head to his sparse apartment. While Sydney energetically plays a record, Bobbie moves toward the bedroom. The music abruptly stops as Sydney and Mrs. Kowalski, who reappears, react in surprise to Bobbie's state of undress. At 7:00 AM, Sydney is jarred awake by his alarm clock. Sunlight floods the room as he accidentally sends a venetian blind crashing down. He spits out water from a glass and, in a gray tee-shirt and boxer shorts, opens the living room blinds. Meanwhile, Bobbie, half asleep, adjusts himself under a blanket. Sydney eventually strolls through Times Square, surrounded by flashy billboards and towering office buildings."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Over an adjacent street to the sound of gunshots, possibly a reminder of the area's notorious reputation for crime, the taxi drops him and his luggage up the street with shops with graffiti'd shutters, each shutter showcasing the vibrant yet rebellious art culture pervasive in many urban areas, where he stares up at a rundown tenement building, a relic of the city’s housing crisis, and then lowers his eyes to see a grimy kebab shop by the name of Kebab Palace, a favorite late-night spot for locals. Mrs. Kowalski, the stern landlord known for her strict no-nonsense attitude, leads Sydney into his grotty studio apartment, where inside, she slaps him and leaves with her nose in the air, a gesture of her disapproval and possibly a common interaction with unruly tenants. Tiles on the dance floor, reminiscent of the 1970s disco era, light up as he struts from one disinterested group of girls to another, waving his hands, moving his pelvis, wiggling his backside, and leaping about, until the girls retreat from him wildly and stop. He puffs out his cheek and walks off as the dance floor lights up again, its vibrant colors flashing to the beat of retro music. On the street outside, Sydney passes a leggy blonde in a green dress that stands out in the crowd, and he glances over his shoulder to see her enter a bar with a red wood-paneled exterior, a classic design evoking a sense of warmth and tradition. Turning on his heel, he hastily follows her inside, a testament to his impulsive nature, and as the blonde heads for the bar, Sydney enters and adjusts his jacket before confidently sidling up beside her. Affecting a suave smile, he takes his seat facing her and leans on the bar, but he gags on his drink, a surprisingly strong cocktail, and turns back to the leggy blonde before turning his back on a second woman with pretty, flaxen hair, who seems unfazed by his antics. The blonde leaves, and Sydney takes out the newspaper clipping, perhaps a reminder of a past ambition or unfinished business, as he spills her drink, soaking her notebook, a mishap that ruins potentially important notes, and as the woman puts her phone away, she gathers her belongings and glares at him with a furrowed brow. Bobbie, a buxom brunette in a zebra print dress that screams bold fashion choices, takes Alison's seat, and Sydney nods with raised eyebrows, acknowledging the new company. Back at Sydney's sparse, undecorated apartment, a reflection of his transient lifestyle, Bobbie staggers off into the bedroom like a schoolboy, while Sydney takes a record, likely a vintage one, flings it over his head, and then replaces it. Sydney thrashes out power cords on it, channeling his inner rock star, and flails wildly until the record suddenly stops, and he turns at the stop to see Bobbie's naked and points as Mrs. Kowalski slaps him again, a recurring theme of disapproval. They turn to look at Bobbie, and their eyebrows shoot up in unison, sharing a moment of shock. Sidney wakes at 7:00 AM to the sound of his alarm clock, grimacing as he fumbles around and turns it off, a typical start to a chaotic day. Sunlight streams in through a bedside window, highlighting the cluttered state of the room, as he yanks the cord of his venetian blind, which clatters down on top of him, and he tumbles from the bed. He spits in the sink and sips urine-colored water from a glass, only to spit it out over the mirror, a testament to the poor water quality in the aging building. In a gray tee-shirt and boxer shorts, he raises a blind in the living room, while half asleep under a blanket, Bobbie adjusts his genitals nonchalantly. Sydney strolls through Times Square, the iconic tourist destination bustling with energy, in a tee-shirt, where garish billboards compete with towering glass-walled office blocks, with a tower with glass-walled offices reaching high in the sky, illustrating the blend of commercialism and modern architecture in the heart of the city."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He spits in the sink and sips urinecolored water from a glass only to spit it out over the mirror Over an adjacent street to the sound of gunshots the taxi drops him and his luggage up the street with shops with graffiti'd shutters where he stares up at a rundown tenement building and then lowers his eyes to see a grimy kebab shop by the name of Kebab Palace Tiles on the dance floor light up as he struts from one disinterested group of girls to another waving his hands moving his pelvis wiggling his backside and leaping about until the girls retreat from him wildly and stop Sydney strolls through Times Square in a teeshirt where garish billboards compete with towering glasswalled office blocks with a tower with glasswalled offices reaching high in the sky Mrs Kowalski leads Sydney into his grotty studio apartment where inside she slaps him and leaves with her nose in the air He puffs out his cheek and walks off as the dance floor lights up again They turn to look at Bobbie and their eyebrows shoot up in unison Mrs Kowalski leads Sydney into his grotty studio apartment where inside she slaps him and leaves with her nose in the air Tiles on the dance floor light up as he struts from one disinterested group of girls to another waving his hands moving his pelvis wiggling his backside and leaping about until the girls retreat from him wildly and stop He puffs out his cheek and walks off as the dance floor lights up again On the street outside Sydney passes a leggy blonde in a green and he glances over his shoulder to see her enter a bar with a red woodpaneled exterior Turning on his heel he hastily follows her inside and as the blonde heads for the bar Sydney enters and adjusts his jacket before confidently sidling up beside her Affecting a suave smile he takes his seat facing her and leans on the bar but he gags on his drink and turns back to the leggy blonde before turning his back on a second woman with pretty flaxen hair The blonde leaves and Sydney takes out the newspaper clipping as he spills her drink soaking her notebook and as the woman puts her phone away she gathers her belongings and glares at him with a furrowed brow Bobbie a buxom brunette in a zebra print dress takes Alison's seat and Sydney nods with raised eyebrows Back at Sydney's sparse undecorated apartment Bobby staggers off into the bedroom like a schoolboy while Sydney takes a record flings it over his head and then replaces it In a gray teeshirt and boxer shorts he raises a blind in the living room while half asleep under a blanket Sydney thrashes out power cords on it and flails wildly until the record suddenly stops and he turns at the stop to see Bobbie's naked and points as Mrs Kowalski slaps him They turn to look at Bobbie and their eyebrows shoot up in unison Bobbie a buxom brunette in a zebra print dress takes Alison's seat and Sydney nods with raised eyebrows Sidney wakes at 700 AM to the sound of his alarm clock grimacing as he fumbles around and turns it off Sunlight streams in through a bedside window as he yanks the cord of his venetian blind which clatters down on top of him and he tumbles from the bed He spits in the sink and sips urinecolored water from a glass only to spit it out over the mirror In a gray teeshirt and boxer shorts he raises a blind in the living room while half asleep under a blanket Bobbie adjusts his genitals Over an adjacent street to the sound of gunshots the taxi drops him and his luggage up the street with shops with graffiti'd shutters where he stares up at a rundown tenement building and then lowers his eyes to see a grimy kebab shop by the name of Kebab Palace Sydney strolls through Times Square in a teeshirt where garish billboards compete with towering glasswalled office blocks with a tower with glasswalled offices reaching high in the sky"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Over an adjacent street to the sound of gunshots the taxi drops him and his luggage up the street with shops with graffiti'd shutters where he stares up at a rundown tenement building and then lowers his eyes to see a grimy kebab shop by the name of Kebab Palace. Mrs Kowalski leads Sydney into his grotty studio apartment where inside she slaps him and leaves with her nose in the air. Tiles on the dance floor light up as he struts from one disinterested group of girls to another waving his hands moving his pelvis wiggling his backside and leaping about until the girls retreat from him wildly and stop. He puffs out his cheek and walks off as the dance floor lights up again. On the street outside Sydney passes a leggy blonde in a green and he glances over his shoulder to see her enter a bar with a red woodpaneled exterior. Turning on his heel he hastily follows her inside and as the blonde heads for the bar Sydney enters and adjusts his jacket before confidently sidling up beside her. Affecting a suave smile he takes his seat facing her and leans on the bar but he gags on his drink and turns back to the leggy blonde before turning his back on a second woman with pretty flaxen hair. The blonde leaves and Sydney takes out the newspaper clipping as he spills her drink soaking her notebook and as the woman puts her phone away she gathers her belongings and glares at him with a furrowed brow. Bobbie a buxom brunette in a zebra print dress takes Alison's seat and Sydney nods with raised eyebrows. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Back at Sydney's sparse undecorated apartment Bobby staggers off into the bedroom like a schoolboy while Sydney takes a record flings it over his head and then replaces it. Sydney thrashes out power cords on it and flails wildly until the record suddenly stops and he turns at the stop to see Bobbie's naked and points as Mrs Kowalski slaps him. They turn to look at Bobbie and their eyebrows shoot up in unison. Sidney wakes at 700 AM to the sound of his alarm clock grimacing as he fumbles around and turns it off. Sunlight streams in through a bedside window as he yanks the cord of his venetian blind which clatters down on top of him and he tumbles from the bed. He spits in the sink and sips urinecolored water from a glass only to spit it out over the mirror. In a gray teeshirt and boxer shorts he raises a blind in the living room while half asleep under a blanket. Bobbie adjusts his genitals. Sydney strolls through Times Square in a teeshirt where garish billboards compete with towering glasswalled office blocks with a tower with glasswalled offices reaching high in the sky."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Over an adjacent street to the sound of gunshots the taxi drops him and his luggage up the street with shops with graffiti'd shutters where he stares up at a rundown tenement building and then lowers his eyes to see a grimy kebab shop by the name of Kebab Palace. Mrs Kowalski leads Sydney into his grotty studio apartment where inside she slaps him and leaves with her nose in the air. Tiles on the dance floor light up as he struts from one disinterested group of girls to another waving his hands moving his pelvis wiggling his backside and leaping about until the girls retreat from him wildly and stop. He puffs out his cheek and walks off as the dance floor lights up again. On the street outside Sydney passes a leggy blonde in a green and he glances over his shoulder to see her enter a bar with a red woodpaneled exterior. Turning on his heel he hastily follows her inside and as the blonde heads for the bar Sydney enters and adjusts his jacket before confidently sidling up beside her. Affecting a suave smile he takes his seat facing her and leans on the bar but he gags on his drink and turns back to the leggy blonde before turning his back on a second woman with pretty flaxen hair. The blonde leaves and Sydney takes out the newspaper clipping as he spills her drink soaking her notebook and as the woman puts her phone away she gathers her belongings and glares at him with a furrowed brow. Bobbie a buxom brunette in a zebra print dress takes Alison's seat and Sydney nods with raised eyebrows. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Back at Sydney's sparse undecorated apartment Bobby staggers off into the bedroom like a schoolboy while Sydney takes a record flings it over his head and then replaces it. Sydney thrashes out power cords on it and flails wildly until the record suddenly stops and he turns at the stop to see Bobbie's naked and points as Mrs Kowalski slaps him. They turn to look at Bobbie and their eyebrows shoot up in unison. Sidney wakes at 700 AM to the sound of his alarm clock grimacing as he fumbles around and turns it off. Sunlight streams in through a bedside window as he yanks the cord of his venetian blind which clatters down on top of him and he tumbles from the bed. He spits in the sink and sips urinecolored water from a glass only to spit it out over the mirror. In a gray teeshirt and boxer shorts he raises a blind in the living room while half asleep under a blanket. Bobbie adjusts his genitals. Sydney strolls through Times Square in a teeshirt where garish billboards compete with towering glasswalled office blocks with a tower with glasswalled offices reaching high in the sky."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Over an adjacent street to the sound of gunshots the taxi drops him and his luggage up the street with shops with graffiti'd shutters where he stares up at a rundown tenement building and then lowers his eyes to see a grimy kebab shop by the name of Kebab Palace. Mrs Kowalski leads Sydney into his grotty studio apartment where inside she slaps him and leaves with her nose in the air. Tiles on the dance floor light up as he struts from one disinterested group of girls to another waving his hands moving his pelvis wiggling his backside and leaping about until the girls retreat from him wildly and stop. He puffs out his cheek and walks off as the dance floor lights up again. On the street outside Sydney passes a leggy blonde in a green and he glances over his shoulder to see her enter a bar with a red woodpaneled exterior. He spits in the sink and sips urinecolored water from a glass only to spit it out over the mirror. In a gray teeshirt and boxer shorts he raises a blind in the living room while half asleep under a blanket. Bobbie adjusts his genitals. Sydney strolls through Times Square in a teeshirt where garish billboards compete with towering glasswalled office blocks with a tower with glasswalled offices reaching high in the sky."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Over an adjacent street to the sound of gunshots the taxi drops him and his luggage up the street with shops with graffiti'd shutters where he stares up at a rundown tenement building and then lowers his eyes to see a grimy kebab shop by the name of Kebab Palace. Mrs Kowalski leads Sydney into his grotty studio apartment where inside she slaps him and leaves with her nose in the air. Bobbie adjusts his genitals. Sydney strolls through Times Square in a teeshirt where garish billboards compete with towering glasswalled office blocks with a tower with glasswalled offices reaching high in the sky."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Over an adjacent street to the sound of gunshots, the llama drops him and his luggage up the street with shops with graffiti'd shutters, where it stares up at a rundown tenement building and then lowers its eyes to see a grimy kebab shop by the name of Kebab Palace. Mr. Jenkins leads a squirrel into his grotty studio apartment, where inside, he slaps it and leaves with his nose in the air. Tiles on the dance floor light up as it struts from one disinterested group of girls to another, waving its hands, moving its pelvis, wiggling its backside, and leaping about, until the girls retreat from it wildly and stop. It puffs out its cheek and walks off as the dance floor lights up again. On the street outside, a squirrel passes a leggy blonde in a green, and it glances over its shoulder to see her enter a bar with a red wood-paneled exterior. Turning on its heel, it hastily follows her inside, and as the blonde heads for the bar, a squirrel enters and adjusts its jacket before confidently sidling up beside her. Affecting a suave smile, it takes its seat facing her and leans on the bar, but it gags on its drink and turns back to the leggy blonde before turning its back on a second woman with pretty, flaxen hair. The blonde leaves, and a squirrel takes out the newspaper clipping as it spills her drink, soaking her notebook, and as the woman puts her phone away, she gathers her belongings and glares at it with a furrowed brow. Charlie, a buxom brunette in a zebra print dress, takes Mark's seat, and a squirrel nods with raised eyebrows. Back at a squirrel's sparse, undecorated apartment, Charlie staggers off into the bedroom like a schoolboy, while a squirrel takes a record, flings it over its head, and then replaces it. A squirrel thrashes out power cords on it and flails wildly until the record suddenly stops, and it turns at the stop to see Charlie's naked and points as Mr. Jenkins slaps it. They turn to look at Charlie, and their eyebrows shoot up in unison. A squirrel wakes at 7:00 AM to the sound of its alarm clock, grimacing as it fumbles around and turns it off. Sunlight streams in through a bedside window as it yanks the cord of its venetian blind, which clatters down on top of it, and it tumbles from the bed. It spits in the sink and sips urine-colored water from a glass, only to spit it out over the mirror. In a gray tee-shirt and boxer shorts, it raises a blind in the living room, while half asleep under a blanket, Charlie adjusts its genitals. A squirrel strolls through Times Square in a tee-shirt, where garish billboards compete with towering glass-walled office blocks, with a tower with glass-walled offices reaching high in the sky."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Over an adjacent avenue to the sound of fireworks, the rickshaw drops him and his belongings down the lane with stalls with graffiti’d awnings, where he stares up at a dilapidated mansion and then lowers his eyes to see a dingy bakery by the name of Pita Palace. Mrs. Kowalski leads Sydney into his cramped attic room, where inside, she smacks him and leaves with her nose in the air. Panels on the stage light up as he struts from one indifferent group of boys to another, waving his arms, moving his knees, wiggling his elbows, and leaping about, until the boys retreat from him swiftly and stop. He puffs out his mouth and walks off as the stage lights up again. On the avenue outside, Sydney passes a tall brunette in a blue, and he glances over his shoulder to see her enter a café with a yellow brick façade. Turning on his heel, he hurriedly follows her inside, and as the brunette heads for the counter, Sydney enters and adjusts his scarf before confidently sidling up beside her. Affecting a suave grin, he takes his spot facing her and leans on the counter, but he chokes on his beverage and turns back to the tall brunette before turning his back on a second woman with lovely, golden hair. The brunette departs, and Sydney takes out the magazine clipping as he spills her espresso, soaking her diary, and as the woman puts her tablet away, she gathers her belongings and glares at him with a furrowed brow. Bobbie, a curvy redhead in a leopard print skirt, takes Alison's place, and Sydney nods with raised eyebrows. Back at Sydney's bare, undecorated loft, Bobbie staggers off into the sleeping area like a schoolboy, while Sydney takes a cassette, flings it over his shoulder, and then replaces it. Sydney thrashes out power chords on it and flails wildly until the cassette suddenly stops, and he turns at the stop to see Bobbie's naked and points as Mrs. Kowalski slaps him. They turn to look at Bobbie, and their eyebrows shoot up in unison. Sidney wakes at 7:00 AM to the sound of his digital watch, grimacing as he fumbles around and turns it off. Sunlight streams in through a bathroom window as he yanks the string of his venetian shade, which clatters down on top of him, and he tumbles from the cot. He spits in the basin and sips honey-colored tea from a cup, only to spit it out over the glass. In a gray hoodie and gym shorts, he raises a shade in the parlor, while half asleep under a quilt, Bobbie adjusts his spectacles. Sydney strolls through Piccadilly Circus in a hoodie, where vibrant banners compete with towering steel-walled office towers, with a skyscraper with steel-walled offices reaching high in the sky."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Over an adjacent street to the sound of gunshots, the taxi elevates him and his luggage up the street with shops with graffiti'd shutters, where he squints up at a rundown tenement building and then raises his eyes to see a gleaming kebab shop by the name of Kebab Palace. Mrs. Kowalski drags Sydney into his grotty studio apartment, where inside, she embraces him and leaves with her nose in the air. Tiles on the dance floor dim as he crawls from one disinterested group of girls to another, clapping his hands, twisting his pelvis, nodding his backside, and tiptoeing about, until the girls gather around him curiously and pause. He deflates his cheek and skips off as the dance floor goes dark again. On the street outside, Sydney bumps a leggy blonde in a green, and he swivels over his shoulder to see her depart a bar with a red wood-paneled exterior. Turning on his heel, he leisurely trails her inside, and as the blonde aims for the bar, Sydney enters and discards his jacket before cautiously creeping up beside her. Affecting a goofy smile, he loses his seat facing her and slouches on the bar, but he sips his drink and shifts back to the leggy blonde before averting his gaze from a second woman with pretty, flaxen hair. The blonde vanishes, and Sydney unfolds the newspaper clipping as he drops her drink, drenching her notebook, and as the woman retrieves her phone, she closes her belongings and smiles at him with a soft brow. Bobbie, a buxom brunette in a zebra print dress, grabs Alison's seat, and Sydney grins with raised eyebrows. Back at Sydney's sparse, undecorated apartment, Bobby prances off into the bedroom like a schoolboy, while Sydney holds a record, spins it over his head, and then misplaces it. Sydney taps out power cords on it and spins gently until the record suddenly plays, and he turns at the music to see Bobbie's clothed and gesticulates as Mrs. Kowalski hugs him. They turn to look at Bobbie, and their eyebrows droop in unison. Sidney drifts awake at 7:00 AM to the sound of his alarm clock, yawning as he gropes around and turns it off. Sunlight bounces off through a bedside window as he unfurls the cord of his venetian blind, which glides down on top of him, and he flips from the bed. He gargles in the sink and pours urine-colored water from a glass, only to swallow it over the mirror. In a gray tee-shirt and boxer shorts, he lowers a blind in the living room, while half asleep under a blanket, Bobbie adjusts his glasses. Sydney marches through Times Square in a tee-shirt, where garish billboards compete with towering glass-walled office blocks, with a tower with glass-walled offices sinking deep into the ground."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Over an adjacent avenue to the sound of fireworks, the spaceship drops a cat and its backpack up the path with gardens with painted fences, where the cat stares up at a sparkling skyscraper and then lowers its eyes to see a shiny pizza stand by the name of Pizza Palace. Mr. Henderson leads Charlie into its pristine penthouse, where inside, he shakes it and leaves with his chin in the air. Balloons on the stage light up as it wanders from one amused band of robots to another, waving its tail, wiggling its ears, jiggling its whiskers, and leaping about, until the robots retreat from it madly and halt. It puffs out its paw and strolls off as the stage lights up again. On the avenue outside, Charlie passes a long-legged flamingo in blue, and it glances over its wing to see it hop into a café with a yellow metal façade. Turning on its paw, it quickly follows it inside, and as the flamingo heads for the counter, Charlie enters and adjusts its hat before confidently sidling up beside it. Putting on a cheerful grin, it takes its perch facing it and leans on the counter, but it coughs on its beverage and turns back to the long-legged flamingo before turning its back on a second toucan with shiny, scarlet feathers. The flamingo hops away, and Charlie takes out the photograph clipping as it spills its beverage, soaking its magazine, and as the toucan puts its gadget away, it gathers its belongings and squawks at it with a furrowed beak. Alex, a fluffy panda in a tiger-striped jacket, takes Morgan's spot, and Charlie nods with widened eyes. Back at Charlie's minimalistic, unadorned nest, Alex waddles off into the den like a toddler, while Charlie takes a book, flings it over its shoulder, and then places it back. Charlie strums long cables on it and flaps wildly until the book abruptly stops, and it swivels at the stop to see Alex's bare and points as Mr. Henderson shakes it. They turn to observe Alex, and their tails shoot up together. Charlie rouses at dawn to the sound of its chime, grimacing as it fumbles around and silences it. Sunlight streams in through a window ledge as it tugs the string of its bamboo shade, which clatters down on top of it, and it rolls from the cushion. It spits in the bucket and tastes lemon-colored juice from a jar, only to spit it out over the painting. In a white apron and denim shorts, it raises a curtain in the den, while half hidden under a pillow, Alex adjusts its paws. Charlie saunters through Central Park in a polo, where vivid posters compete with towering steel-walled museums, with a spire with crystal-walled artworks reaching high in the clouds."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Over an adjacent street to the sound of firecrackers, the bicycle lifts him and his backpack down the street with markets with graffiti'd shutters, where he glances up at a crumbling warehouse and then raises his eyes to see a dingy sushi bar by the name of Sushi Palace. Dr. Stevens guides Jordan into her shabby attic apartment, where inside, he tickles her and departs with his chin held high. Lamps on the stage glow as she shuffles from one bored group of boys to another, flapping her arms, rolling her shoulders, shaking her knees, and spinning around, until the boys retreat from her hastily and pause. She blows out her lips and skips off as the stage lights flicker again. On the street outside, Jordan passes a tall brunette in a yellow, and she peers over her shoulder to see him enter a café with a blue brick façade. Twisting on her toe, she slowly follows him inside, and as the brunette heads for the coffee counter, Jordan enters and smooths his scarf before casually sliding up beside him. Wearing a polished grin, she takes his place facing him and leans on her elbow, but she chokes on her espresso and turns back to the tall brunette before turning her attention to a second man with handsome, golden locks. The brunette exits, and Jordan unfolds the magazine article as he topples his beverage, drenching his planner, and as the man puts his laptop away, he collects his accessories and frowns at her with a scowl. Trevor, a tall redhead in a tiger print shirt, takes Cameron's place, and Jordan winks with lowered eyelids. Back at Jordan's cluttered, overdecorated apartment, Trevor stumbles off into the kitchen like a lifeguard, while Jordan picks up a book, tosses it over his shoulder, and then retrieves it. Jordan pounds out tunes on it and sways enthusiastically until the book abruptly closes, and he turns at the closure to see Trevor's bare foot and points as Dr. Stevens tickles him. They swivel to glance at Trevor, and their mouths gape in tandem. Jordan awakens at 9:00 AM to the noise of his phone alarm, grimacing as he gropes around and silences it. Sunlight cascades in through a skylight window as he pulls the string of his roller blind, which crashes down on top of him, and he slides off the couch. He gargles in the tub and gulps lime-colored tea from a mug, only to spew it out over the faucet. In a blue polo shirt and gym shorts, he lowers a shade in the study, while half asleep on a futon, Trevor scratches his chin. Jordan ambles through Downtown in a hoodie, where vivid posters clash with soaring steel-framed skyscrapers, with a skyscraper with steel-framed offices reaching high in the sky."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Over an adjacent bridge to the sound of fireworks, the rickshaw plants him and his backpack down the avenue with stalls with painted awnings, where he gazes skyward at a derelict mansion and then lowers his eyes to notice a dilapidated sushi bar by the name of Sushi Kingdom. Mrs. Kowalski guides Sydney into his shabby attic room, where inside, she hugs him and leaves with her chin held high. Tiles on the stage transition to new colors as he waltzes from one indifferent cluster of guys to another, clapping his hands, twisting his hips, shimmying his shoulders, and twirling about, until the guys disperse from him abruptly and halt. He puffs out his chest and drifts away as the stage lights up again. On the sidewalk outside, Sydney crosses paths with a leggy blonde in a red dress, and he peeks over his shoulder to see her disappear into a café with a gleaming brass-framed entrance. Spinning on his toes, he quickly tails her inside, and as the blonde veers toward a booth, Sydney enters and smooths his shirt before casually sidling up near her. Flashing a debonair grin, he perches himself opposite her and leans on the table, but he coughs on his beverage and turns back to the leggy blonde before averting his gaze from a second woman with charming, golden hair. The blonde departs, and Sydney unfolds the magazine snippet as he overturns her cup, drenching her diary, and as the woman tucks her diary away, she gathers her things and frowns at him with a knitted brow. Bobbie, a curvy brunette in a leopard print outfit, occupies Alison's spot, and Sydney nods with lifted eyebrows. Back at Sydney's sparse, undecorated loft, Bobbie skips off into the den like a schoolboy, while Sydney grabs a book, flips it over his shoulder, and then places it back. Sydney strums out crazed riffs on it and flounders impetuously until the book abruptly shuts, and he spins at the sound to see Bobbie's unclothed and gestures as Mrs. Kowalski hugs him. They turn to observe Bobbie, and their eyebrows soar simultaneously. Sydney wakes at 7:00 AM to the sound of his doorbell, wincing as he gropes around and turns it off. Moonlight filters in through a side window as he tugs the cord of his venetian blind, which lands on top of him, and he rolls off the bed. He swishes in the sink and gulps lemonade-colored water from a pitcher, only to spray it over the mirror. In a green tee-shirt and boxers, he lifts a curtain in the den, while half awake under a quilt, Bobbie adjusts his spectacles. Sydney ambles through Central Park in a tee-shirt, where vibrant banners vie with towering brick-walled skyscrapers, with a skyscraper with brick-walled offices reaching high into the clouds."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Across a distant avenue to the noise of fireworks, the carriage releases her and her packages near the avenue with cafes with painted awnings, where she gazes up at a dilapidated cottage and then shifts her gaze to notice a gritty taco stand by the title of Taco Tower. Mr. Johnson escorts Morgan into her modest workshop flat, where inside, he tickles her and exits with his chin held high. Bricks on the patio floor flicker as she prances from one uninterested cluster of boys to another, flailing her arms, twisting her waist, jiggling her shoulders, and hopping around, until the boys disperse from her frantically and halt. She inflates her lungs and strolls away as the patio lights flicker again. On the avenue outside, Morgan passes a tall redhead in a purple, and she peeks over her arm to watch him enter a café with a blue metal-paneled front. Spinning on her foot, she swiftly trails him inside, and as the redhead goes toward the counter, Morgan enters and straightens her scarf before confidently sidling up next to him. Attempting a smooth grin, she takes her position facing him and leans on the counter, but she chokes on her snack and turns back to the towering redhead before turning her back on a second man with handsome, chestnut curls. The redhead departs, and Morgan pulls out the magazine snippet as she knocks over his snack, drenching his diary, and as the man tucks his tablet away, he gathers his possessions and scowls at her with narrowed eyes. Charlie, a curvy blonde in a leopard print suit, takes Brian's place, and Morgan nods with raised shoulders. Back at Morgan's tidy, undecorated studio, Charlie stumbles off into the parlor like a toddler, while Morgan grabs a novel, tosses it over her shoulder, and then returns it. Morgan strums out discordant notes on it and gyrates wildly until the novel abruptly closes, and she turns at the close to see Charlie’s bare and gestures as Mr. Johnson chuckles at her. They turn to glance at Charlie, and their shoulders rise in unison. Morgan awakens at 6:00 AM to the chime of her wall clock, wincing as she scrambles around and halts it. Moonlight streams in through a side window as she pulls the string of her shutters, which crash down on top of her, and she rolls from the mattress. She gargles in the basin and gulps lemonade-tinted coffee from a cup, only to spit it out over the picture. In a black hoodie and track pants, she lifts a curtain in the family room, while half awake under a duvet, Charlie scratches her knee. Morgan saunters through Central Park in a hoodie, where vibrant posters compete with soaring transparent-walled business towers, with a tower with transparent-walled offices rising tall in the clouds."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Sydney is dropped off by a taxi in a gritty neighborhood, where he eyes a run-down building and the Kebab Palace below. Mrs. Kowalski escorts him to his dismal studio apartment, and after slapping him, she departs haughtily. At a dance club, Sydney tries to impress disinterested women but is unsuccessful. Spotting a blonde entering a nearby bar, he follows and attempts to engage her, but clumsily spills her drink. As the blonde leaves, Bobbie, a brunette, takes her seat. Sydney heads back to his sparse apartment with Bobbie, plays loud music, and is interrupted abruptly. Mrs. Kowalski confronts him as they both notice Bobbie's unexpected presence. Sydney wakes to his alarm, struggles with a venetian blind, and drinks foul water. In the living room, half-asleep, Bobbie adjusts himself while Sydney, wearing a tee-shirt, walks through Times Square, overshadowed by towering billboards and glass office buildings."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Sydney strolls through Times Square in a teeshirt where garish billboards compete with towering glasswalled office blocks with a tower with glasswalled offices reaching high in the sky Bobbie adjusts his genitals In a gray teeshirt and boxer shorts he raises a blind in the living room while half asleep under a blanket He spits in the sink and sips urinecolored water from a glass only to spit it out over the mirror Sunlight streams in through a bedside window as he yanks the cord of his venetian blind which clatters down on top of him and he tumbles from the bed Sidney wakes at 700 AM to the sound of his alarm clock grimacing as he fumbles around and turns it off They turn to look at Bobbie and their eyebrows shoot up in unison Sydney thrashes out power cords on it and flails wildly until the record suddenly stops and he turns at the stop to see Bobbie's naked and points as Mrs Kowalski slaps him Back at Sydney's sparse undecorated apartment Bobby staggers off into the bedroom like a schoolboy while Sydney takes a record flings it over his head and then replaces it Bobbie a buxom brunette in a zebra print dress takes Alison's seat and Sydney nods with raised eyebrows The blonde leaves and Sydney takes out the newspaper clipping as he spills her drink soaking her notebook and as the woman puts her phone away she gathers her belongings and glares at him with a furrowed brow Affecting a suave smile he takes his seat facing her and leans on the bar but he gags on his drink and turns back to the leggy blonde before turning his back on a second woman with pretty flaxen hair Turning on his heel he hastily follows her inside and as the blonde heads for the bar Sydney enters and adjusts his jacket before confidently sidling up beside her On the street outside Sydney passes a leggy blonde in a green and he glances over his shoulder to see her enter a bar with a red woodpaneled exterior He puffs out his cheek and walks off as the dance floor lights up again Tiles on the dance floor light up as he struts from one disinterested group of girls to another waving his hands moving his pelvis wiggling his backside and leaping about until the girls retreat from him wildly and stop Mrs Kowalski leads Sydney into his grotty studio apartment where inside she slaps him and leaves with her nose in the air Over an adjacent street to the sound of gunshots the taxi drops him and his luggage up the street with shops with graffiti'd shutters where he stares up at a rundown tenement building and then lowers his eyes to see a grimy kebab shop by the name of Kebab Palace"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Sunlight streams in through a bedside window as he yanks the cord of his venetian blind which clatters down on top of him and he tumbles from the bed Sidney wakes at 700 AM to the sound of his alarm clock grimacing as he fumbles around and turns it off On the street outside Sydney passes a leggy blonde in a green and he glances over his shoulder to see her enter a bar with a red woodpaneled exterior Back at Sydney's sparse undecorated apartment Bobby staggers off into the bedroom like a schoolboy while Sydney takes a record flings it over his head and then replaces it Turning on his heel he hastily follows her inside and as the blonde heads for the bar Sydney enters and adjusts his jacket before confidently sidling up beside her The blonde leaves and Sydney takes out the newspaper clipping as he spills her drink soaking her notebook and as the woman puts her phone away she gathers her belongings and glares at him with a furrowed brow Bobbie adjusts his genitals Affecting a suave smile he takes his seat facing her and leans on the bar but he gags on his drink and turns back to the leggy blonde before turning his back on a second woman with pretty flaxen hair Sydney thrashes out power cords on it and flails wildly until the record suddenly stops and he turns at the stop to see Bobbie's naked and points as Mrs Kowalski slaps him In a gray teeshirt and boxer shorts he raises a blind in the living room while half asleep under a blanket Mrs Kowalski leads Sydney into his grotty studio apartment where inside she slaps him and leaves with her nose in the air They turn to look at Bobbie and their eyebrows shoot up in unison Tiles on the dance floor light up as he struts from one disinterested group of girls to another waving his hands moving his pelvis wiggling his backside and leaping about until the girls retreat from him wildly and stop He spits in the sink and sips urinecolored water from a glass only to spit it out over the mirror Sydney strolls through Times Square in a teeshirt where garish billboards compete with towering glasswalled office blocks with a tower with glasswalled offices reaching high in the sky Bobbie a buxom brunette in a zebra print dress takes Alison's seat and Sydney nods with raised eyebrows Over an adjacent street to the sound of gunshots the taxi drops him and his luggage up the street with shops with graffiti'd shutters where he stares up at a rundown tenement building and then lowers his eyes to see a grimy kebab shop by the name of Kebab Palace He puffs out his cheek and walks off as the dance floor lights up again"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Back at Sydney's sparse undecorated apartment Bobby staggers off into the bedroom like a schoolboy while Sydney takes a record flings it over his head and then replaces it Sydney thrashes out power cords on it and flails wildly until the record suddenly stops and he turns at the stop to see Bobbie's naked and points as Mrs Kowalski slaps him They turn to look at Bobbie and their eyebrows shoot up in unison Sidney wakes at 700 AM to the sound of his alarm clock grimacing as he fumbles around and turns it off Sunlight streams in through a bedside window as he yanks the cord of his venetian blind which clatters down on top of him and he tumbles from the bed He spits in the sink and sips urinecolored water from a glass only to spit it out over the mirror In a gray teeshirt and boxer shorts he raises a blind in the living room while half asleep under a blanket Bobbie adjusts his genitals Sydney strolls through Times Square in a teeshirt where garish billboards compete with towering glasswalled office blocks with a tower with glasswalled offices reaching high in the sky Over an adjacent street to the sound of gunshots the taxi drops him and his luggage up the street with shops with graffiti'd shutters where he stares up at a rundown tenement building and then lowers his eyes to see a grimy kebab shop by the name of Kebab Palace Mrs Kowalski leads Sydney into his grotty studio apartment where inside she slaps him and leaves with her nose in the air Tiles on the dance floor light up as he struts from one disinterested group of girls to another waving his hands moving his pelvis wiggling his backside and leaping about until the girls retreat from him wildly and stop He puffs out his cheek and walks off as the dance floor lights up again On the street outside Sydney passes a leggy blonde in a green and he glances over his shoulder to see her enter a bar with a red woodpaneled exterior Turning on his heel he hastily follows her inside and as the blonde heads for the bar Sydney enters and adjusts his jacket before confidently sidling up beside her Affecting a suave smile he takes his seat facing her and leans on the bar but he gags on his drink and turns back to the leggy blonde before turning his back on a second woman with pretty flaxen hair The blonde leaves and Sydney takes out the newspaper clipping as he spills her drink soaking her notebook and as the woman puts her phone away she gathers her belongings and glares at him with a furrowed brow Bobbie a buxom brunette in a zebra print dress takes Alison's seat and Sydney nods with raised eyebrows"
        }
      ]
    }
  ]
}