{
  "ground_truth": "A flustered man looks down at Elizabeth, then lifts his chin, flutters his eyelids, and steps over her. Alison gives him the A-OK and he walks on. In a staff meeting, his coworkers look on stony-faced. He prods Alison's arm. Clayton rises from his seat at the head of the table and walks out. Alison raises a palm to Sidney. Clayton eats edamame beans and sushi at the desk in his office. He tries to ignore Sidney, who's tapping a notebook with a pen. He nods. Bill's eyes narrow and his expression hardens as a sheepish-looking Sidney sits opposite an indignant Clayton. Sidney's hopeful smile wanes. Clayton stares at Sidney, who furrows his brow and points at the door. Clayton nods and Sidney leaves. Alison reads as models pick outfits from a rack. Sidney plunks himself down beside her and sighs. Alison stares at him, scoffs, stands up, and flounces off with her nose in the air. Sidney makes eye contact with Lawrence and waves. Sidney's nose is taped up like a pig's snout. As Eleanor and Sophie approach, he tears the tape from his face and hides under his desk, then emerges from beneath the table with Sellotape stuck to his left ear. Sidney frowns and obediently toddles off. He fills a plastic container from a water cooler and stares at Sophie, who's cradling Cuba, screwing up his face slightly. Slighted, Eleanor gives him a piercing look and stomps off. His eyebrows twitch as he looks around, and Lawrence and Sophie follow Eleanor from the office. Sidney cautiously opens the door of an office and peers in to see Cuba staring back at him. He tosses the little red ball, which bounces out through an open window, and Cuba scampers after it. Sidney dives for the window and closes it, then smiles and looks up to see a large stone ornament. Sidney's eyes widen at the weighted, polished stone and, horrified, he bites his fist. He calls an elevator, and as she points, they grapple for it. A white paw sticks out as Sophie, Eleanor, and Lawrence are in reception. Sidney runs off and Alison follows to find Sidney leaning out of a window. He turns minus the bag. She turns to look at Sidney, who shrugs with arms folded. The search party heads off, leaving a relieved Sidney slumped against a wall by the window, as Cuba's nose sticks out of the leather handbag drifting up behind him on the window cleaner's rising platform. Sidney stands in the doorway of Clayton's office, sips whiskey, flings the blue shirts onto a desk, and peers down his nose at them, gesturing with a raised hand. Smiling, Clayton strolls up to him. Sidney leaves, then steps back in.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A bewildered gentleman gazes down at Elizabeth, then raises his chin, flickers his eyelids, and strides over her. Alison grants him the thumbs-up and he moves on. In a team session, his colleagues observe on stoic-faced. He nudges Alison's limb. Clayton stands from his spot at the head of the table and exits. Alison elevates a hand to Sidney. Clayton consumes edamame legumes and sushi at the counter in his workspace. He attempts to disregard Sidney, who's drumming a journal with a stylus. He acknowledges. Bill's eyes narrow and his visage stiffens as a bashful-looking Sidney sits across a resentful Clayton. Sidney's optimistic grin dims. Clayton glares at Sidney, who knits his brow and gestures at the entrance. Clayton acknowledges and Sidney departs. Alison peruses as mannequins select garments from a stand. Sidney plops himself down beside her and exhales. Alison gazes at him, derides, stands up, and struts off with her nose elevated. Sidney makes eye contact with Lawrence and salutes. Sidney's nose is taped up like a pig's snout. As Eleanor and Sophie approach, he rips the adhesive from his visage and conceals under his desk, then surfaces from beneath the table with adhesive tape affixed to his left ear. Sidney scowls and obediently ambles off. He fills a plastic receptacle from a water cooler and gazes at Sophie, who's cuddling Cuba, puckering his visage slightly. Offended, Eleanor gives him a penetrating glance and stomps off. His eyebrows quiver as he glances around, and Lawrence and Sophie trail Eleanor from the workspace. Sidney gingerly opens the door of an office and peers in to see Cuba gazing back at him. He throws the small crimson sphere, which rebounds out through an open casement, and Cuba dashes after it. Sidney lunges for the casement and closes it, then grins and glances up to see a large stone ornament. Sidney's eyes widen at the heavy, glossy stone and, appalled, he bites his fist. He summons an elevator, and as she indicates, they wrestle for it. A white paw protrudes as Sophie, Eleanor, and Lawrence are in reception. Sidney dashes off and Alison trails to find Sidney leaning out of a casement. He turns without the satchel. She turns to glance at Sidney, who shrugs with limbs crossed. The search party proceeds off, leaving a relieved Sidney slumped against a partition by the casement, as Cuba's nose protrudes of the leather purse floating up behind him on the window cleaner's ascending platform. Sidney stands in the threshold of Clayton's workspace, sips whiskey, flings the azure shirts onto a counter, and peers down his nose at them, signaling with a lifted hand. Grinning, Clayton saunters up to him. Sidney departs, then steps back in."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A flustered man is looked at by Elizabeth, who is then looked down upon by him, chin lifted, eyelids fluttering, and she is stepped over by him. The A-OK is given to him by Alison, and he is walked on by the man. In a staff meeting, stony-faced looks are given on by his coworkers. Alison's arm is prodded by him. Clayton rises from his seat at the head of the table and walks out. A palm is raised to Sidney by Alison. Edamame beans and sushi are eaten at the desk in his office by Clayton. Sidney, who's tapping a notebook with a pen, is tried to be ignored by him. A nod is given by him. Bill narrows his eyes and hardens his expression as Sidney, looking sheepish, sits opposite Clayton, who looks indignant. Sidney's hopeful smile wanes. Sidney is stared at by Clayton, who furrows his brow and points at the door. Clayton nods, and Sidney leaves. Models pick outfits from a rack as Alison reads. Sidney plunks himself down beside her and sighs. Sidney is stared at, scoffed at, stood up and flounced off from by Alison with her nose in the air. Eye contact is made with Lawrence by Sidney, who waves. Sidney's nose is taped up like a pig's snout. As Eleanor and Sophie approach, Sidney tears the tape from his face and hides under his desk, emerging from beneath the table with Sellotape stuck to his left ear. A frown and obedient toddle off are done by Sidney. A plastic container is filled by him from a water cooler, and Sophie is stared at by him, who's cradling Cuba, screwing up his face slightly. Slighted, a piercing look is given to him by Eleanor, who stomps off. His eyebrows twitch as he looks around, and Eleanor is followed from the office by Lawrence and Sophie. Sidney cautiously opens the door of an office and peers in to see Cuba staring back at him. The little red ball is tossed by him, which bounces out through an open window, and it is scampered after by Cuba. Sidney dives for the window and closes it, then smiles and looks up to see a large stone ornament. The weighted, polished stone is looked at with widened eyes by Sidney and, horrified, his fist is bitten by him. An elevator is called by him, and as she points, they grapple for it. A white paw sticks out as reception is occupied by Sophie, Eleanor, and Lawrence. Sidney runs off, and he is followed by Alison to find Sidney leaning out of a window. The bag is turned minus by him. She turns to look at Sidney, who shrugs with arms folded. A search party heads off, leaving a relieved Sidney slumped against a wall by the window, as Cuba's nose sticks out of the leather handbag drifting up behind him on the window cleaner's rising platform. Sidney stands in the doorway of Clayton's office, sips whiskey, flings the blue shirts onto a desk, and peers down his nose at them, gesturing with a raised hand. Smiling, Clayton strolls up to him. Sidney leaves, then steps back in."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A flustered man glances at Elizabeth, lifts his chin, and steps over her. Alison signals he's okay, and he walks on. In a meeting, coworkers are stone-faced. He nudges Alison, Clayton rises and exits. At his desk, Clayton eats edamame and sushi, ignoring Sidney's pen-tapping. Bill frowns at a nervous Sidney opposite an irate Clayton. Sidney's hopeful smile fades. Clayton stares, Sidney gestures to the door, Clayton nods, and Sidney exits. Alison reads as models select outfits. Sidney sits by her and sighs; Alison scoffs and leaves. Sidney's taped nose resembles a pig's snout. Eleanor and Sophie approach as Sidney removes the tape and hides under a desk, reemerging with tape on his ear. Sidney frowns and leaves, filling a container from a cooler while staring at Sophie, who's holding Cuba. Eleanor glares and leaves, followed by Lawrence and Sophie. Sidney peers into an office, sees Cuba, and tosses a red ball out the window, Cuba chases it. Sidney shuts the window, eyes widening at a stone ornament, biting his fist in horror. He calls an elevator and grapples for it. A white paw appears as Sophie, Eleanor, and Lawrence are in reception. Sidney runs, Alison chases him to find him bagless at a window. She looks at Sidney, who shrugs. The search party leaves, as Cuba's nose emerges from a handbag on the window cleaner's platform. Sidney stands in Clayton's office doorway, sipping whiskey, flinging blue shirts onto a desk. Clayton smiles at him. Sidney exits, then returns."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A man nervously looks at Elizabeth, lifts his chin, flutters his eyelids, and steps over her. Alison signals OK. In a meeting, coworkers look cold. He nudges Alison. Clayton leaves the head of the table. Alison signals Sidney. Clayton eats at his desk, ignoring pen-tapping Sidney. Bill's eyes narrow as Sidney sits opposite indignant Clayton, whose stare drives Sidney out. Models pick outfits as Alison reads. Sidney joins her, sighs, and Alison scoffs and leaves. Sidney waves to Lawrence with taped-up nose. Approached by Eleanor and Sophie, he hides under his desk and emerges with tape on his ear. Sidney obediently leaves, fills a cup at a water cooler, and stares at Sophie with Cuba. Offended, Eleanor leaves with Sophie and Lawrence. Sidney peeks into an office, interacts with Cuba, closes a window, and notices a stone ornament. Alarmed, he bites his fist. He calls an elevator and struggles over it. Sophie, Eleanor, and Lawrence are in reception as Sidney runs with Alison following. Sidney is seen at the window, shrugs, while a handbag with Cuba is lifted on a window cleaner's platform. Sidney, sipping whiskey in Clayton’s doorway, flings shirts on a desk. Clayton approaches, smiling, as Sidney exits and re-enters."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A visibly flustered man finds himself looking down at Elizabeth. After a brief moment of hesitation, he lifts his chin slightly, flutters his eyelids with a touch of impatience, and steps over her without another glance. Meanwhile, Alison acknowledges him with an enthusiastic A-OK gesture, and he continues on his way. During a tense staff meeting, his colleagues remain stony-faced, watching everything unfold. He lightly taps Alison's arm to get her attention. At this point, Clayton, who has been sitting at the head of the table, rises from his seat with a sense of authority and decisively walks out of the room. Alison, in response, raises a palm in Sidney's direction. \n\nIn the privacy of his office, Clayton enjoys a meal of edamame beans and sushi at his desk, immersing himself in his work as he makes a concerted effort to ignore Sidney, who is persistently tapping a notebook with a pen nearby. Clayton offers an absent-minded nod. Across the room, Bill narrows his eyes as his expression hardens, watching Sidney with a sheepish demeanor sitting opposite an indignant Clayton. Sidney's hopeful smile fades away as Clayton fixes a stern gaze upon him; Sidney furrows his brow and gestures towards the door. Clayton gives an approving nod, and Sidney quietly departs. \n\nLater, Alison is absorbed in her reading while nearby, models select outfits from a clothing rack. Sidney plunks himself down beside her with a sigh. Alison looks at him, scoffs with a mix of exasperation and disbelief, stands up abruptly, and flounces off, pointedly raising her nose in the air. Sidney then makes eye contact with Lawrence and gives a friendly wave. In a moment of silliness, Sidney's nose is taped up to resemble a pig's snout. As Eleanor and Sophie approach, he hurriedly tears the tape from his face and attempts to hide under his desk, only to emerge with a piece of Sellotape comically stuck to his left ear. Sidney frowns, toddling off obediently. \n\nHe fills a plastic container with water from the cooler, all the while staring at Sophie, who is cradling Cuba in her arms, and subtly screws up his face in slight annoyance. Feeling slighted, Eleanor directs a piercing look at him and stomps off in a huff. Sidney's eyebrows twitch with uncertainty as he glances around the room and notices Lawrence and Sophie trailing after Eleanor and leaving the office. Sidney cautiously opens the door to another office and peeks inside, only to find Cuba staring back at him with keen interest. He tosses a small red ball, which bounces out playfully through an open window, prompting Cuba to scamper after it. Sidney makes a desperate dive for the window, quickly closing it, and then he smiles as he looks up to notice a large stone ornament nearby. \n\nStartled, Sidney's eyes widen at the sight of the weighted, polished stone, and in a moment of horror, he bites his fist. He calls for an elevator, and as it arrives, there is a brief struggle as she points and they grapple for control. A white paw sticks out as Sophie, Eleanor, and Lawrence stand in the reception area. Sidney quickly runs off, and Alison follows to discover Sidney leaning out of a window. He turns to face her, minus the bag that was previously in his possession. She turns to cast a questioning look at Sidney, who merely shrugs, arms folded with an air of resignation. The search party moves on, leaving Sidney visibly relieved as he slumps against a wall beside the window, with Cuba's nose sneakily sticking out of a leather handbag that is drifting up behind him on a window cleaner's rising platform. \n\nSidney stands in the doorway of Clayton's office, indulging in a sip of whiskey. He flings several blue shirts onto a desk and peers down his nose at them with disdain, gesturing towards them with a raised hand. With a friendly smile, Clayton strolls up to him. Sidney makes his exit, only to step back in, completing the circle of events."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A man, who is noticeably flustered and showing signs of inner turmoil, finds himself in the awkward position of looking down at Elizabeth. After a brief moment of hesitation and uncertainty, he lifts his chin slightly, fluttering his eyelids with a touch of visible impatience, and then makes the decision to step over her without offering another glance. Meanwhile, Alison, aware of the situation, acknowledges him with an enthusiastic A-OK gesture, and he continues on his way without any further interaction. During a tense and somewhat uncomfortable staff meeting, his colleagues remain stony-faced and impassive, watching everything unfold with interest. He lightly taps Alison's arm to gently get her attention. At this point, Clayton, who has been sitting with authority at the head of the table, rises from his seat with a sense of command and decisively walks out of the room. In response, Alison raises a palm in Sidney's direction as a gesture of acknowledgment.\n\nIn the privacy and solitude of his office, Clayton is enjoying a meal consisting of edamame beans and sushi while seated at his desk, immersing himself in his work as he makes a concerted effort to ignore Sidney, who is persistently tapping a notebook with a pen nearby. With an absent-minded nod, Clayton acknowledges the presence around him. Across the room, Bill narrows his eyes as his expression hardens, observing Sidney's sheepish demeanor while sitting opposite an indignant Clayton. With Sidney's hopeful smile beginning to fade away, Clayton fixes him with a stern gaze. Sidney furrows his brow in response and gestures towards the door. Clayton gives an approving nod in agreement, and Sidney quietly departs the office.\n\nLater, Alison is deeply absorbed in her reading while, nearby, models are busy selecting outfits from a clothing rack. Sidney plunks himself down beside her with an audible sigh of exasperation. Alison looks at him, scoffs with a mix of exasperation and disbelief, stands up abruptly, and flounces off, pointedly raising her nose in the air as she leaves. Sidney then makes eye contact with Lawrence and offers a friendly wave. In a whimsical moment of silliness, Sidney has his nose taped up to resemble a pig's snout. As Eleanor and Sophie approach, he hurriedly tears the tape from his face and attempts to hide under his desk, only to comically emerge with a piece of Sellotape still stuck awkwardly to his left ear. Sidney frowns, then obediently toddles off in search of something else to occupy his time.\n\nHe carefully fills a plastic container with water from the cooler, all the while staring openly at Sophie, who is cradling Cuba lovingly in her arms, and subtly screws up his face in slight annoyance. Feeling slighted and misunderstood, Eleanor directs a piercing look at him and stomps off in a huff. Sidney's eyebrows twitch with uncertainty as he glances nervously around the room and notices that Lawrence and Sophie are trailing after Eleanor, leaving the office together. Sidney cautiously opens the door to another office and peeks inside, only to find Cuba staring back at him with keen interest and curiosity. He tosses a small red ball, which bounces out playfully through an open window, prompting Cuba to scamper after it with enthusiasm. Sidney makes a desperate dive for the window, quickly closing it, and then smiles as he looks up to notice a large, imposing stone ornament nearby.\n\nStartled by the unexpected sight, Sidney's eyes widen in surprise at the presence of the weighted, polished stone, and in a moment of horror, he bites his fist. He calls for an elevator, and as it arrives, there is a brief struggle as she points and they grapple for control. A white paw sticks out amidst this confusion as Sophie, Eleanor, and Lawrence stand together in the reception area. Sidney quickly runs off, and Alison follows in pursuit to discover Sidney leaning out of a window. He turns to face her, minus the bag that was previously in his possession. She turns to cast a questioning and slightly accusatory look at Sidney, who merely shrugs his shoulders, arms folded with an air of resignation. The search party moves on, leaving Sidney visibly relieved as he slumps against a wall beside the window. Meanwhile, Cuba's nose is sneakily sticking out of a leather handbag that is drifting up behind him on a window cleaner's rising platform.\n\nSidney finds himself standing in the doorway of Clayton's office, indulging in a sip of whiskey. He flings several blue shirts onto a desk and peers down his nose at them with a sense of disdain, gesturing towards them with a slightly raised hand. With a friendly smile, Clayton strolls up to him, showing a casual interest in the scene. Sidney makes his exit, only to step back in, completing the circle of events, as each character continues to engage in the ongoing drama of their everyday lives."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A flustered man glances down at Elizabeth with a mix of emotions flitting across his face. He lifts his chin slightly, flutters his eyelids in a moment of indecision, and carefully steps over her. As he continues on his way, Alison acknowledges him with a gesture indicating the A-OK, signaling that he can proceed without concern. During a staff meeting, the atmosphere is tense as his coworkers maintain stony-faced expressions. In an attempt to elicit a response, he gently prods Alison's arm, seeking her attention. Clayton, seated at the head of the table, suddenly rises, making a firm decision to leave the room, and walks out purposefully. As Clayton departs, Alison raises her palm in a subtle gesture to Sidney, acknowledging the situation. Meanwhile, in his office, Clayton is seated at his desk, eating edamame beans and sushi, trying to maintain focus on his meal and ignore Sidney, who persistently taps a notebook with a pen. Eventually, Clayton gives a nod of acknowledgment. Bill, observing everything, narrows his eyes, and his expression transforms into one of hardened resolve as Sidney, wearing a sheepish expression, sits opposite Clayton, who appears indignant. Sidney attempts a hopeful smile, but his optimism quickly diminishes under Clayton's intense stare. Sidney furrows his brow in frustration and points towards the door, a clear indication for Sidney to leave. Clayton nods in agreement, and Sidney exits the room. Meanwhile, Alison is engrossed in reading as models carefully select outfits from a clothing rack. Sidney approaches, plunks himself down next to her, and releases a heavy sigh. In response, Alison stares at him disapprovingly, scoffs at his presence, stands up with determination, and flounces off with an air of superiority, her nose held high. Sidney then makes eye contact with Lawrence and offers a wave, albeit half-heartedly. Meanwhile, Sidney's nose is humorously taped up to resemble a pig's snout. As Eleanor and Sophie draw nearer, he hurriedly tears the tape from his face and attempts to hide under his desk, only to reemerge with Sellotape inadvertently stuck to his left ear. Sidney frowns in annoyance before obediently toddling off, filling a plastic container from a nearby water cooler. He fixes a stare on Sophie, who's cradling Cuba, and subtly screws up his face, attempting to mask his irritation. Eleanor, feeling slighted by his demeanor, shoots him a piercing look and stomps off in a huff. Sidney's eyebrows twitch with uncertainty as he glances around the room, noticing Lawrence and Sophie following Eleanor out of the office. Cautiously, Sidney opens the door to another office and peers in, only to find Cuba gazing back at him with curiosity. In an effort to engage Cuba, he tosses a little red ball, which bounces playfully out through an open window, prompting Cuba to scamper after it. Sidney dives towards the window with urgency, closing it swiftly behind Cuba's exit, then looks upwards with a smile of satisfaction, only to notice a large, polished stone ornament. Sidney's eyes widen in horror at the sight of the weighted object and, in a moment of panic, he bites his fist. He rushes to call an elevator, engaging in a brief but tense struggle as she points and they grapple to access it. As the elevator door closes, a white paw protrudes, capturing the attention of Sophie, Eleanor, and Lawrence, who are all gathered in reception. Seizing the opportunity, Sidney dashes off, with Alison quick to follow, only to find Sidney leaning precariously out of a window. He turns, now minus a bag, leaving Alison to turn and look at him quizzically. Sidney meets her gaze with a nonchalant shrug, arms folded in feigned indifference. As the search party moves on, Sidney remains behind, leaning against a wall by the window, visibly relieved. Unbeknownst to him, Cuba's nose protrudes from a leather handbag that is drifting upward on a window cleaner's rising platform alongside him. Sidney eventually finds himself standing in the doorway of Clayton's office, casually sipping whiskey. He flings a couple of blue shirts onto a desk with a dramatic flair and peers down his nose at them, punctuating the action with a raised hand gesture. Smiling, Clayton approaches Sidney unhurriedly, and after a brief exchange, Sidney makes his exit, only to pause and step back into the room briefly."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A flustered man looks down at Elizabeth, lifts his chin, steps over her, and receives an A-OK from Alison before continuing on. During a tense staff meeting, he prods Alison's arm while his coworkers watch stony-faced, prompting Clayton to leave the room. Alone in his office, Clayton tries to focus on eating sushi and edamame but is distracted by Sidney's persistent tapping. Following a silent exchange, Sidney leaves as Alison reads and models select outfits nearby. Sidney joins Alison with a sigh, but she dismissively leaves after scoffing at him. Sidney waves at Lawrence, his nose humorously taped up, before removing it in embarrassment as Eleanor and Sophie approach. Feeling slighted, Eleanor departs with Lawrence and Sophie, leaving Sidney to wander off. He fills a water container while sneaking glances at Sophie with Cuba, drawing Eleanor's ire. Sidney cautiously peers into an office, tosses a ball for Cuba, and quickly closes the window after the dog chases it outside. Spotting a large stone ornament, he panics and calls for an elevator, but a scramble ensues when a paw appears at reception with Sophie, Eleanor, and Lawrence. Sidney and Alison run off, finding Sidney at a window sans bag as a search party departs. Sidney leans relieved against a wall, oblivious to Cuba poking from a bag ascending on a window cleaner's platform. Finally, Sidney stands in Clayton's office, sipping whiskey, inspecting blue shirts, and gesturing as Clayton approaches with a smile. Sidney exits and then hesitantly re-enters."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A flustered man, who appears to be in a rush to an important meeting, looks down at Elizabeth, then lifts his chin, flutters his eyelids—a habit he developed in college to feign nonchalance—and steps over her. Alison, who is known for her straightforward communication style, gives him the A-OK and he walks on. In a staff meeting held in a sleek, modern office with glass walls, his coworkers look on stony-faced, likely due to the tension of a pending project deadline. He prods Alison's arm, hoping for some reassurance. Clayton, the stern but fair team leader, rises from his seat at the head of the table and walks out, his departure a signal of disapproval. Alison raises a palm to Sidney as a gesture to pause. Clayton eats edamame beans and sushi at the desk in his office, a nod to his penchant for healthy living and Japanese cuisine. He tries to ignore Sidney, who's anxiously tapping a notebook, an inherited pen from his late grandfather, with a pen. He nods, indicating he understands the unspoken office dynamics. Bill’s eyes narrow and his expression hardens as a sheepish-looking Sidney, known for his timid demeanor, sits opposite an indignant Clayton. Sidney's hopeful smile wanes, a common occurrence when he's under pressure. Clayton stares at Sidney, who furrows his brow and points at the door, suggesting he needs to step out for a breather. Clayton nods and Sidney leaves, feeling the weight of expectations. Alison reads a fashion magazine, her favorite pastime, as models pick outfits from a rack for an upcoming show. Sidney plunks himself down beside her and sighs, exhausted from his earlier confrontation. Alison stares at him, scoffs, stands up, and flounces off with her nose in the air, a dramatic exit she's perfected from years in the theater. Sidney makes eye contact with Lawrence, the new intern trying to find his place, and waves. Sidney’s nose is taped up like a pig's snout, a prank from a previous office party. As Eleanor and Sophie, colleagues who often share lunch together, approach, he tears the tape from his face and hides under his desk, a favorite hiding spot during office pranks, then emerges from beneath the table with Sellotape stuck to his left ear. Sidney frowns and obediently toddles off, eager to avoid further embarrassment. He fills a plastic container from a water cooler and stares at Sophie, who’s cradling Cuba, a fluffy office dog beloved by all, screwing up his face slightly. Slighted, Eleanor gives him a piercing look and stomps off, her patience worn thin. His eyebrows twitch as he looks around, and Lawrence and Sophie follow Eleanor from the office, leaving him alone in his thoughts. Sidney cautiously opens the door of an office and peers in to see Cuba staring back at him, ready for another game. He tosses the little red ball, a favored toy of Cuba’s, which bounces out through an open window, and Cuba scampers after it. Sidney dives for the window and closes it, then smiles and looks up to see a large stone ornament, an ancient relic from a colleague’s travels. Sidney's eyes widen at the weighted, polished stone and, horrified at the potential disaster, he bites his fist. He calls an elevator, a sleek new installation with mirrored walls, and as she points, they grapple for it. A white paw sticks out as Sophie, Eleanor, and Lawrence are in reception, watching the commotion. Sidney runs off and Alison follows to find Sidney leaning out of a window, a familiar place for him during breaks. He turns minus the bag, realizing a misstep. She turns to look at Sidney, who shrugs with arms folded, a gesture of resignation. The search party heads off, leaving a relieved Sidney slumped against a wall by the window, comforted by the sight of Cuba’s nose sticking out of the leather handbag drifting up behind him on the window cleaner’s rising platform. Sidney stands in the doorway of Clayton’s office, sips whiskey, a rare indulgence for him, flings the blue shirts onto a desk, and peers down his nose at them, gesturing with a raised hand in a mock aristocratic manner. Smiling, Clayton strolls up to him, amused by the antics. Sidney leaves, then steps back in, contemplating his next move."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Smiling Clayton strolls up to him A flustered man looks down at Elizabeth then lifts his chin flutters his eyelids and steps over her As Eleanor and Sophie approach he tears the tape from his face and hides under his desk then emerges from beneath the table with Sellotape stuck to his left ear Alison gives him the AOK and he walks on In a staff meeting his coworkers look on stonyfaced He prods Alison's arm Clayton rises from his seat at the head of the table and walks out Alison raises a palm to Sidney Clayton eats edamame beans and sushi at the desk in his office He tries to ignore Sidney who is tapping a notebook with a pen He turns minus the bag He nods Bill's eyes narrow and his expression hardens as a sheepishlooking Sidney sits opposite an indignant Clayton Sidney's hopeful smile wanes Clayton stares at Sidney who furrows his brow and points at the door Alison stares at him scoffs stands up and flounces off with her nose in the air Clayton nods and Sidney leaves A white paw sticks out as Sophie Alison reads as models pick outfits from a rack Sidney plunks himself down beside her and sighs Sidney frowns and obediently toddles off Alison stares at him scoffs stands up and flounces off with her nose in the air Sidney makes eye contact with Lawrence and waves Sidney's nose is taped up like a pig's snout As Eleanor and Sophie approach he tears the tape from his face and hides under his desk then emerges from beneath the table with Sellotape stuck to his left ear Sidney frowns and obediently toddles off He fills a plastic container from a water cooler and stares at Sophie who is cradling Cuba screwing up his face slightly Slighted Eleanor gives him a piercing look and stomps off His eyebrows twitch as he looks around and Lawrence and Sophie follow Eleanor from the office Sidney cautiously opens the door of an office and peers in to see Cuba staring back at him Sidney cautiously opens the door of an office and peers in to see Cuba staring back at him whiskey flings the blue shirts onto a desk and peers down his nose at them gesturing with a raised hand He tosses the little red ball which bounces out through an open window and Cuba scampers after it Sidney dives for the window and closes it then smiles and looks up to see a large stone ornament Sidney's eyes widen at the weighted polished stone and horrified he bites his fist He calls an elevator and as she points they grapple for it A white paw sticks out as Sophie Eleanor and Lawrence are in reception Sidney runs off and Alison follows to find Sidney leaning out of a window He turns minus the bag In a staff meeting his coworkers look on stonyfaced Eleanor gives him a piercing look and stomps off He tries to ignore Sidney who is tapping a notebook with a pen She turns to look at Sidney who shrugs with arms folded Sidney leaves then steps back in Sidney makes eye contact with Lawrence and waves The search party heads off leaving a relieved Sidney slumped against a wall by the window as Cuba's nose sticks out of the leather handbag drifting up behind him on the window cleaner's rising platform Sidney stands in the doorway of Clayton's office sips whiskey flings the blue shirts onto a desk and peers down his nose at them gesturing with a raised hand Smiling Clayton strolls up to him A flustered man looks down at Elizabeth then lifts his chin flutters his eyelids and steps over her He nods Bill's eyes narrow and his expression hardens as a sheepishlooking Sidney sits opposite an indignant Clayton Alison gives him the AOK and he walks on Sidney's eyes widen at the weighted polished stone and horrified he bites his fist Sidney leaves then steps back in Clayton eats edamame beans and sushi at the desk in his office Sidney plunks himself down beside her and sighs"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A flustered man looks down at Elizabeth then lifts his chin flutters his eyelids and steps over her. Alison gives him the AOK and he walks on. In a staff meeting his coworkers look on stonyfaced. He prods Alison's arm. Clayton rises from his seat at the head of the table and walks out. Alison raises a palm to Sidney. Clayton eats edamame beans and sushi at the desk in his office. He tries to ignore Sidney who is tapping a notebook with a pen. He nods Bill's eyes narrow and his expression hardens as a sheepishlooking Sidney sits opposite an indignant Clayton. Sidney's hopeful smile wanes. Clayton stares at Sidney who furrows his brow and points at the door. Clayton nods and Sidney leaves. Alison reads as models pick outfits from a rack. Sidney plunks himself down beside her and sighs. Alison stares at him scoffs stands up and flounces off with her nose in the air. Sidney makes eye contact with Lawrence and waves. Sidney's nose is taped up like a pig's snout. As Eleanor and Sophie approach he tears the tape from his face and hides under his desk then emerges from beneath the table with Sellotape stuck to his left ear. Sidney frowns and obediently toddles off. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. He fills a plastic container from a water cooler and stares at Sophie who is cradling Cuba screwing up his face slightly. Slighted. Eleanor gives him a piercing look and stomps off. His eyebrows twitch as he looks around and Lawrence and Sophie follow Eleanor from the office. Sidney cautiously opens the door of an office and peers in to see Cuba staring back at him. He tosses the little red ball which bounces out through an open window and Cuba scampers after it. Sidney dives for the window and closes it then smiles and looks up to see a large stone ornament. Sidney's eyes widen at the weighted polished stone and horrified he bites his fist. He calls an elevator and as she points they grapple for it. A white paw sticks out as Sophie. Eleanor and Lawrence are in reception. Sidney runs off and Alison follows to find Sidney leaning out of a window. He turns minus the bag. She turns to look at Sidney who shrugs with arms folded. The search party heads off leaving a relieved Sidney slumped against a wall by the window as Cuba's nose sticks out of the leather handbag drifting up behind him on the window cleaner's rising platform. Sidney stands in the doorway of Clayton's office sips. whiskey flings the blue shirts onto a desk and peers down his nose at them gesturing with a raised hand. Smiling Clayton strolls up to him. Sidney leaves then steps back in."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A flustered man looks down at Elizabeth then lifts his chin flutters his eyelids and steps over her. Alison gives him the AOK and he walks on. In a staff meeting his coworkers look on stonyfaced. He prods Alison's arm. Clayton rises from his seat at the head of the table and walks out. Alison raises a palm to Sidney. Clayton eats edamame beans and sushi at the desk in his office. He tries to ignore Sidney who is tapping a notebook with a pen. He nods Bill's eyes narrow and his expression hardens as a sheepishlooking Sidney sits opposite an indignant Clayton. Sidney's hopeful smile wanes. Clayton stares at Sidney who furrows his brow and points at the door. Clayton nods and Sidney leaves. Alison reads as models pick outfits from a rack. Sidney plunks himself down beside her and sighs. Alison stares at him scoffs stands up and flounces off with her nose in the air. Sidney makes eye contact with Lawrence and waves. Sidney's nose is taped up like a pig's snout. As Eleanor and Sophie approach he tears the tape from his face and hides under his desk then emerges from beneath the table with Sellotape stuck to his left ear. Sidney frowns and obediently toddles off. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. He fills a plastic container from a water cooler and stares at Sophie who is cradling Cuba screwing up his face slightly. Slighted. Eleanor gives him a piercing look and stomps off. His eyebrows twitch as he looks around and Lawrence and Sophie follow Eleanor from the office. Sidney cautiously opens the door of an office and peers in to see Cuba staring back at him. He tosses the little red ball which bounces out through an open window and Cuba scampers after it. Sidney dives for the window and closes it then smiles and looks up to see a large stone ornament. Sidney's eyes widen at the weighted polished stone and horrified he bites his fist. He calls an elevator and as she points they grapple for it. A white paw sticks out as Sophie. Eleanor and Lawrence are in reception. Sidney runs off and Alison follows to find Sidney leaning out of a window. He turns minus the bag. She turns to look at Sidney who shrugs with arms folded. The search party heads off leaving a relieved Sidney slumped against a wall by the window as Cuba's nose sticks out of the leather handbag drifting up behind him on the window cleaner's rising platform. Sidney stands in the doorway of Clayton's office sips. whiskey flings the blue shirts onto a desk and peers down his nose at them gesturing with a raised hand. Smiling Clayton strolls up to him. Sidney leaves then steps back in."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A flustered man looks down at Elizabeth then lifts his chin flutters his eyelids and steps over her. Alison gives him the AOK and he walks on. In a staff meeting his coworkers look on stonyfaced. He prods Alison's arm. Clayton rises from his seat at the head of the table and walks out. Alison raises a palm to Sidney. Clayton eats edamame beans and sushi at the desk in his office. He tries to ignore Sidney who is tapping a notebook with a pen. He nods Bill's eyes narrow and his expression hardens as a sheepishlooking Sidney sits opposite an indignant Clayton. Sidney's hopeful smile wanes. Eleanor and Lawrence are in reception. Sidney runs off and Alison follows to find Sidney leaning out of a window. He turns minus the bag. She turns to look at Sidney who shrugs with arms folded. The search party heads off leaving a relieved Sidney slumped against a wall by the window as Cuba's nose sticks out of the leather handbag drifting up behind him on the window cleaner's rising platform. Sidney stands in the doorway of Clayton's office sips. whiskey flings the blue shirts onto a desk and peers down his nose at them gesturing with a raised hand. Smiling Clayton strolls up to him. Sidney leaves then steps back in."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A flustered man looks down at Elizabeth then lifts his chin flutters his eyelids and steps over her. Alison gives him the AOK and he walks on. In a staff meeting his coworkers look on stonyfaced. He prods Alison's arm. Sidney stands in the doorway of Clayton's office sips. whiskey flings the blue shirts onto a desk and peers down his nose at them gesturing with a raised hand. Smiling Clayton strolls up to him. Sidney leaves then steps back in."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A flustered giraffe looks down at a skateboard, then lifts his chin, flutters his eyelids, and steps over it. A lion gives the giraffe the A-OK and it walks on. In a staff meeting, the raccoons look on stony-faced. The giraffe prods a lion's arm. A kangaroo rises from its seat at the head of the table and walks out. The lion raises a palm to a squirrel. The kangaroo eats edamame beans and sushi at the desk in a cave. The kangaroo tries to ignore the squirrel, who's tapping a notebook with a pen. The kangaroo nods. An eagle's eyes narrow and its expression hardens as a sheepish-looking squirrel sits opposite an indignant kangaroo. The squirrel's hopeful smile wanes. The kangaroo stares at the squirrel, who furrows his brow and points at the door. The kangaroo nods and the squirrel leaves. A lion reads as butterflies pick outfits from a rack. The squirrel plunks himself down beside the lion and sighs. The lion stares at the squirrel, scoffs, stands up, and flounces off with its nose in the air. The squirrel makes eye contact with a walrus and waves. The squirrel's nose is taped up like a pig's snout. As a penguin and a platypus approach, the squirrel tears the tape from his face and hides under a desk, then emerges from beneath the table with Sellotape stuck to his left ear. The squirrel frowns and obediently toddles off. The squirrel fills a plastic container from a water cooler and stares at the platypus, who's cradling a coconut, screwing up his face slightly. Slighted, the penguin gives the squirrel a piercing look and stomps off. The squirrel's eyebrows twitch as he looks around, and the walrus and platypus follow the penguin from the cave. The squirrel cautiously opens the door of a cave and peers in to see the coconut staring back at him. The squirrel tosses the little red ball, which bounces out through an open window, and the coconut scampers after it. The squirrel dives for the window and closes it, then smiles and looks up to see a large stone ornament. The squirrel's eyes widen at the weighted, polished stone and, horrified, he bites his fist. The squirrel calls an elevator, and as a rabbit points, they grapple for it. A white paw sticks out as the platypus, the penguin, and the walrus are in reception. The squirrel runs off and the lion follows to find the squirrel leaning out of a window. The squirrel turns minus the bag. The lion turns to look at the squirrel, who shrugs with arms folded. The search party heads off, leaving a relieved squirrel slumped against a wall by the window, as the coconut's nose sticks out of the leather handbag drifting up behind him on the window cleaner's rising platform. The squirrel stands in the doorway of the kangaroo's cave, sips whiskey, flings the blue shirts onto a desk, and peers down his nose at them, gesturing with a raised hand. Smiling, the kangaroo strolls up to the squirrel. The squirrel leaves, then steps back in."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A flustered man looks down at Elizabeth, then lifts his chin, flutters his eyelids, and steps over her. Alison gives him the thumbs-up and he walks on. In a conference room, his coworkers look on stony-faced. He prods Alison's shoulder. Clayton rises from his seat at the foot of the couch and walks out. Alison raises a palm to Sidney. Clayton eats popcorn and sandwiches at the bench in his office. He tries to ignore Sidney, who's tapping a calculator with a stylus. He nods. Bill's eyes narrow and his expression hardens as a sheepish-looking Sidney sits opposite an indignant Clayton. Sidney's hopeful smile wanes. Clayton stares at Sidney, who furrows his brow and gestures at the window. Clayton nods and Sidney leaves. Alison reads as models pick scarves from a shelf. Sidney plunks himself down beside her and sighs. Alison stares at him, scoffs, stands up, and flounces off with her chin in the air. Sidney makes eye contact with Lawrence and waves. Sidney's nose is taped up like a cow's snout. As Eleanor and Sophie approach, he tears the tape from his face and hides under his chair, then emerges from beneath the bench with masking tape stuck to his left ear. Sidney frowns and obediently toddles off. He fills a glass vase from a soda machine and stares at Sophie, who's cradling a globe, screwing up his face slightly. Slighted, Eleanor gives him a piercing look and stomps off. His eyebrows twitch as he looks around, and Lawrence and Sophie follow Eleanor from the building. Sidney cautiously opens the door of a store and peers in to see the globe staring back at him. He tosses the little blue frisbee, which bounces out through an open door, and the globe rolls after it. Sidney dives for the door and closes it, then smiles and looks up to see a large metal sculpture. Sidney's eyes widen at the shiny, polished metal and, horrified, he bites his lip. He calls an escalator, and as she points, they grapple for it. A white feather sticks out as Sophie, Eleanor, and Lawrence are in the lobby. Sidney runs off and Alison follows to find Sidney leaning out of a balcony. He turns minus the suitcase. She turns to look at Sidney, who shrugs with arms crossed. The search team heads off, leaving a relieved Sidney slumped against a pillar by the balcony, as the globe's nose sticks out of the velvet backpack drifting up behind him on the cleaning crew's rising elevator. Sidney stands in the doorway of Clayton's garage, sips soda, flings the red coats onto a shelf, and peers down his nose at them, gesturing with a raised eyebrow. Smiling, Clayton strolls up to him. Sidney leaves, then steps back in."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A flustered man gazes down at Elizabeth, then tilts his chin, blinks rapidly, and sidesteps her. Alison flashes him a thumbs-up and he saunters on. In a staff meeting, his coworkers frown sternly. He nudges Alison's arm. Clayton strolls from his seat at the head of the table and exits. Alison gestures a high-five to Sidney. Clayton munches on edamame beans and sushi at the desk in his office. He attempts to dismiss Sidney, who's flipping a notebook with a pen. He winks. Bill's eyes squint and his expression tightens as a sheepish-looking Sidney plops opposite an indignant Clayton. Sidney's hopeful grin fades. Clayton glares at Sidney, who scrunches his forehead and gestures at the door. Clayton winks and Sidney departs. Alison skims as models choose outfits from a rack. Sidney plops himself beside her and groans. Alison glares at him, huffs, gets up, and storms off with her chin held high. Sidney locks eyes with Lawrence and salutes. Sidney's nose is bandaged up like a pig's snout. As Eleanor and Sophie approach, he rips the tape from his face and crouches under his desk, then reemerges from beneath the table with Sellotape stuck to his right ear. Sidney scowls and dutifully waddles off. He fills a plastic container from a water cooler and gawks at Sophie, who's cradling Cuba, scrunching up his face slightly. Offended, Eleanor shoots him a sharp glance and stomps off. His eyebrows quiver as he glances around, and Lawrence and Sophie trail Eleanor from the office. Sidney gingerly opens the door of an office and peeks in to see Cuba gazing back at him. He throws the little red ball, which ricochets out through an open window, and Cuba bolts after it. Sidney lunges for the window and shuts it, then grins and looks up to see a massive stone ornament. Sidney's eyes bulge at the hefty, shiny stone and, terrified, he gnaws his knuckles. He summons an elevator, and as she gestures, they scramble for it. A white paw juts out as Sophie, Eleanor, and Lawrence are in reception. Sidney bolts off and Alison follows to find Sidney dangling out of a window. He turns minus the bag. She glances at Sidney, who shrugs with arms folded. The search party departs, leaving a relieved Sidney slouched against a wall by the window, as Cuba's nose peeks out of the leather handbag gliding up behind him on the window cleaner's ascending platform. Sidney stands in the doorway of Clayton's office, sips whiskey, tosses the blue shirts onto a desk, and peers down his nose at them, gesturing with a raised hand. Grinning, Clayton saunters up to him. Sidney departs, then steps back inside."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A bewildered squirrel glances down at Margaret, then raises its beak, flaps its wings, and hops over her. Christine gives it the thumbs-up and it continues on. In a team briefing, its teammates gaze on expressionless. It nudges Christine's elbow. Gregory gets up from his bench at the edge of the room and wanders out. Christine lifts a hoof to Victor. Gregory munches on pistachio nuts and pasta in the shed in his garden. He attempts to disregard Victor, who's drumming a clipboard with a spatula. He nods. Daniel's nostrils flare, and his demeanor stiffens as a bashful-looking Victor settles across from a disgruntled Gregory. Victor's eager grin fades. Gregory glares at Victor, who wrinkles his snout and gestures at the gate. Gregory nods, and Victor departs. Christine watches as artists choose canvases from a pile. Victor plops himself down beside her and groans. Christine glares at him, sneers, rises, and struts away with her beak in the clouds. Victor makes eye contact with Martin and salutes. Victor's ears are pinned up like a dragon's fin. As Rachel and Heidi approach, he rips the band from his muzzle and hides under his workbench, then reappears from beneath the counter with ribbon affixed to his right tusk. Victor grimaces and obediently waddles away. He fills a ceramic pot from a juice dispenser and gazes at Heidi, who's holding Morocco, wrinkling his snout slightly. Offended, Rachel shoots him a fiery glance and stomps away. His whiskers quiver as he looks about, and Martin and Heidi trail after Rachel from the workshop. Victor gingerly opens the gate of a barn and peers in to find Morocco gazing back at him. He tosses the tiny blue marble, which bounces out through an open gap, and Morocco dashes after it. Victor lunges for the gap and seals it, then grins and looks up to see a towering bronze sculpture. Victor's eyes widen at the hefty, gleaming bronze and, terrified, he gnaws his knuckle. He summons a stairlift, and as she gestures, they tussle for it. An orange feather protrudes as Heidi, Rachel, and Martin are in the foyer. Victor dashes away and Christine chases to find Victor leaning out of a vent. He turns minus the parcel. She turns to look at Victor, who shrugs with arms folded. The expedition sets off, leaving a relieved Victor reclining against a fence by the vent, as Morocco's tail peeks out of the woolen backpack floating up behind him on the washing line's ascending pulley. Victor stands in the threshold of Gregory's shed, sips lemonade, flings the green jackets onto a bench, and squints down his beak at them, waving with a lifted hoof. Grinning, Gregory saunters up to him. Victor exits, then steps back in."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A bewildered cat glances down at Margaret, then lifts its tail, blinks its whiskers, and hops over her. Kevin signals with a thumbs-up and it skips on. In a staff meeting, its teammates glance on poker-faced. It nudges Kevin's shoulder. Diana springs from her seat at the head of the table and marches out. Kevin gestures a wave to Paul. Diana munches almonds and noodles at the desk in her lounge. She attempts to overlook Paul, who's patting a folder with a ruler. She winks. Nancy's nostrils flare and her demeanor tightens as a bashful-looking Paul perches in front of an indignant Diana. Paul's hopeful grin fades. Diana glances at Paul, who frowns and gestures toward the exit. Diana grins and Paul exits. Kevin scans as dancers choose costumes from a rack. Paul plops himself beside her and exhales. Kevin squints at him, chuckles, leaps up, and struts away with her chin held high. Paul connects eyes with Thomas and salutes. Paul's ears are adorned with rings resembling donkey's ears. As Patricia and Lucy approach, he pulls the rings from his ears and burrows under his chair, then climbs out from beneath the table with stickers stuck to his right cheek. Paul pouts and dutifully waddles away. He fills a glass bottle from a fridge and observes Lucy, who's petting Brazil, wrinkling her cheeks slightly. Offended, Patricia gives him a stern glare and storms away. Her eyelashes flicker as she peers around, and Thomas and Lucy shadow Patricia from the cafeteria. Paul hesitantly opens the door of a lounge and peeks in to find Brazil gazing back at him. He rolls the tiny blue marble, which rolls out through a narrow gap, and Brazil darts after it. Paul lunges for the gap and seals it, then smirks and glances down to observe a massive wooden sculpture. Paul’s eyes bulge at the weighted, polished wood and, panicked, he covers his mouth. He summons an escalator, and as he gestures, they tussle for it. A black paw emerges as Lucy, Patricia, and Thomas are in the atrium. Paul dashes off and Kevin trails to discover Paul hanging out of a gap. He pivots missing the cap. She pivots to gaze at Paul, who shrugs with arms crossed. The exploration crew heads away, leaving a relieved Paul propped against a pillar by the gap, as Brazil's ear pops out of the canvas backpack floating beside him on the cleaning crew’s ascending lift. Paul stands in the entryway of Diana's room, sips lemonade, tosses the red scarves onto a chair, and scrutinizes them down his nose, gesturing with a lifted eyebrow. Grinning, Diana ambles up to him. Paul departs, then sneaks back in."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A flustered man glances down at Elizabeth, then raises his eyebrows, twitches his nose, and tiptoes around her. Alison gives him the thumbs-up and he skips on. In a staff meeting, his coworkers gaze on expressionless. He nudges Alison's shoulder. Clayton gets up from his seat at the head of the table and trots out. Alison waves a forearm to Sidney. Clayton munches on popcorn and pretzels at the counter in his office. He attempts to disregard Sidney, who's drumming a book with a pencil. He tilts his head. Bill's eyes squint and his expression stiffens as a bashful-looking Sidney perches opposite an irate Clayton. Sidney's optimistic grin fades. Clayton gawks at Sidney, who knits his forehead and gestures at the window. Clayton bows slightly and Sidney departs. Alison flips through a magazine as models select shoes from a shelf. Sidney flops down beside her and groans. Alison glares at him, snickers, rises up, and saunters off with her chin held high. Sidney locks eyes with Lawrence and winks. Sidney's nostrils are taped up like a cat's whiskers. As Eleanor and Sophie approach, he pulls the tape from his face and ducks under his desk, then pops up from beneath the workbench with masking tape stuck to his right elbow. Sidney scowls and obediently shuffles away. He fills a pitcher from a coffee machine and gazes at Sophie, who's hugging Jamaica, knitting his eyebrows slightly. Slighted, Eleanor gives him a sharp glare and storms off. His cheeks twitch as he scans the room, and Lawrence and Sophie trail after Eleanor from the office. Sidney cautiously opens the door of a storeroom and glances in to see Jamaica gazing back at him. He tosses the little blue frisbee, which rolls out through an open door, and Jamaica dashes after it. Sidney lunges for the door and shuts it, then smirks and looks up to see a large metal sculpture. Sidney's eyes widen at the heavy, glossy statue and, terrified, he covers his mouth with his hands. He requests an escalator, and as she signals, they tussle for it. A black paw sticks out as Sophie, Eleanor, and Lawrence are in the lobby. Sidney dashes off and Alison follows to find Sidney leaning out of a balcony. He turns without the satchel. She turns to glance at Sidney, who shrugs with arms crossed. The search team heads off, leaving a relieved Sidney slouched against a pillar by the balcony, as Jamaica's tail sticks out of the leather backpack hovering up behind him on the window washer's elevator. Sidney stands in the doorway of Clayton's storeroom, sips iced tea, tosses the gray scarves onto a bench, and gazes down his nose at them, gesticulating with a lifted finger. Grinning, Clayton saunters up to him. Sidney exits, then steps back in."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A bewildered parrot gazes up at Marianne, then raises its beak, blinks its feathers, and hops over her. Geraldine shows it a thumbs-up and it struts away. In a garden gathering, its comrades gaze on with curiosity. It nudges Geraldine’s wing. Marvin pops up from his perch at the edge of the pond and flutters away. Geraldine lifts a claw to Percy. Marvin munches on sunflower seeds and carrots in the corner of his aviary. He attempts to forget Percy, who's drumming on a clipboard with a twig. He bows. Oscar's ears twitch and his gaze sharpens as a bashful-looking Percy roosts opposite an irate Marvin. Percy's eager grin fades. Marvin glares at Percy, who creases his forehead and gestures toward the gate. Marvin bows and Percy flits away. Geraldine examines as mannequins select accessories from a shelf. Percy plops himself down next to her and huffs. Geraldine glances at him, sneers, hops up, and prances off with her beak in the wind. Percy locks eyes with Norris and beckons. Percy's beak is wrapped up like a pig’s tail. As Dahlia and Fiona draw near, he rips the wrap from his beak and ducks under his perch, then surfaces with string stuck to his tail feather. Percy scowls and obediently waddles away. He fills a ceramic bowl from a bird bath and gawks at Fiona, who's cuddling Brazil, scrunching up her beak slightly. Offended, Dahlia shoots him a glare and stamps away. His tail twitches as he scans the area, and Norris and Fiona trail Dahlia from the grove. Percy gingerly pushes open the gate of a pen and peeks in to see Brazil gazing back at him. He hurls the tiny green pebble, which rolls out through an open fence, and Brazil scuttles after it. Percy plunges for the fence and seals it, then beams and glances up to see a large wooden sculpture. Percy's feathers stand on end at the hefty, carved wood, and, terrified, he nibbles his claw. He summons a ladder, and as she signals, they tussle for it. A spotted fin protrudes as Fiona, Dahlia, and Norris are in the meadow. Percy darts away and Geraldine pursues to find Percy dangling from a branch. He turns minus the sack. She glances at Percy, who shrugs with wings folded. The exploration band moves away, leaving a content Percy nestled against a log by the branch, as Brazil’s beak pokes out of the woven basket floating up behind him on the farmer’s climbing vine. Percy perches in the archway of Marvin’s grove, sips nectar, tosses the scarlet ties onto a trunk, and peers down his beak at them, gesturing with a lifted wing. Grinning, Marvin saunters toward him. Percy flits out, then flutters back in."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A flustered man steps over Elizabeth, guided by Alison, in a tense staff meeting. Sidney irritates Clayton, who nods for him to leave. Sidney interacts awkwardly with coworkers, including Lawrence, Eleanor, and Sophie, and clumsily uses tape on his face. He fills a plastic container while eyeing Sophie and Eleanor, who storms off. Sidney tosses a ball for Cuba, who chases it out the window. Alarmed, Sidney dives to close the window, then sees a large stone ornament and reacts in horror. In a scramble with Alison, they fight for the elevator as Sophie's white paw emerges. Sidney runs off, followed by Alison, ending in a search for the missing bag. Relieved, Sidney leans against a wall as Cuba’s nose peeks from a leather handbag on a rising platform. Sidney, sipping whiskey, flings shirts onto a desk, and Clayton approaches, smiling. Sidney exits, then re-enters."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Sidney leaves then steps back in Smiling Clayton strolls up to him whiskey flings the blue shirts onto a desk and peers down his nose at them gesturing with a raised hand Sidney stands in the doorway of Clayton's office sips The search party heads off leaving a relieved Sidney slumped against a wall by the window as Cuba's nose sticks out of the leather handbag drifting up behind him on the window cleaner's rising platform She turns to look at Sidney who shrugs with arms folded He turns minus the bag Sidney runs off and Alison follows to find Sidney leaning out of a window Eleanor and Lawrence are in reception A white paw sticks out as Sophie He calls an elevator and as she points they grapple for it Sidney's eyes widen at the weighted polished stone and horrified he bites his fist Sidney dives for the window and closes it then smiles and looks up to see a large stone ornament He tosses the little red ball which bounces out through an open window and Cuba scampers after it Sidney cautiously opens the door of an office and peers in to see Cuba staring back at him His eyebrows twitch as he looks around and Lawrence and Sophie follow Eleanor from the office Eleanor gives him a piercing look and stomps off Slighted He fills a plastic container from a water cooler and stares at Sophie who is cradling Cuba screwing up his face slightly Sidney frowns and obediently toddles off As Eleanor and Sophie approach he tears the tape from his face and hides under his desk then emerges from beneath the table with Sellotape stuck to his left ear Sidney's nose is taped up like a pig's snout Sidney makes eye contact with Lawrence and waves Alison stares at him scoffs stands up and flounces off with her nose in the air Sidney plunks himself down beside her and sighs Alison reads as models pick outfits from a rack Clayton nods and Sidney leaves Clayton stares at Sidney who furrows his brow and points at the door Sidney's hopeful smile wanes He nods Bill's eyes narrow and his expression hardens as a sheepishlooking Sidney sits opposite an indignant Clayton He tries to ignore Sidney who is tapping a notebook with a pen Clayton eats edamame beans and sushi at the desk in his office Alison raises a palm to Sidney Clayton rises from his seat at the head of the table and walks out He prods Alison's arm In a staff meeting his coworkers look on stonyfaced Alison gives him the AOK and he walks on A flustered man looks down at Elizabeth then lifts his chin flutters his eyelids and steps over her"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Clayton nods and Sidney leaves The search party heads off leaving a relieved Sidney slumped against a wall by the window as Cuba's nose sticks out of the leather handbag drifting up behind him on the window cleaner's rising platform Clayton stares at Sidney who furrows his brow and points at the door She turns to look at Sidney who shrugs with arms folded Sidney stands in the doorway of Clayton's office sips Eleanor and Lawrence are in reception Alison reads as models pick outfits from a rack Alison raises a palm to Sidney Sidney dives for the window and closes it then smiles and looks up to see a large stone ornament Sidney runs off and Alison follows to find Sidney leaning out of a window He calls an elevator and as she points they grapple for it Clayton rises from his seat at the head of the table and walks out Sidney's hopeful smile wanes He fills a plastic container from a water cooler and stares at Sophie who is cradling Cuba screwing up his face slightly He prods Alison's arm He tosses the little red ball which bounces out through an open window and Cuba scampers after it Slighted His eyebrows twitch as he looks around and Lawrence and Sophie follow Eleanor from the office Sidney's nose is taped up like a pig's snout Sidney leaves then steps back in He turns minus the bag Sidney's eyes widen at the weighted polished stone and horrified he bites his fist A flustered man looks down at Elizabeth then lifts his chin flutters his eyelids and steps over her Smiling Clayton strolls up to him Sidney plunks himself down beside her and sighs Sidney frowns and obediently toddles off In a staff meeting his coworkers look on stonyfaced whiskey flings the blue shirts onto a desk and peers down his nose at them gesturing with a raised hand A white paw sticks out as Sophie Sidney cautiously opens the door of an office and peers in to see Cuba staring back at him Eleanor gives him a piercing look and stomps off Clayton eats edamame beans and sushi at the desk in his office He nods Bill's eyes narrow and his expression hardens as a sheepishlooking Sidney sits opposite an indignant Clayton Alison stares at him scoffs stands up and flounces off with her nose in the air Sidney makes eye contact with Lawrence and waves As Eleanor and Sophie approach he tears the tape from his face and hides under his desk then emerges from beneath the table with Sellotape stuck to his left ear Alison gives him the AOK and he walks on He tries to ignore Sidney who is tapping a notebook with a pen"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He fills a plastic container from a water cooler and stares at Sophie who is cradling Cuba screwing up his face slightly Slighted Eleanor gives him a piercing look and stomps off His eyebrows twitch as he looks around and Lawrence and Sophie follow Eleanor from the office Sidney cautiously opens the door of an office and peers in to see Cuba staring back at him He tosses the little red ball which bounces out through an open window and Cuba scampers after it Sidney dives for the window and closes it then smiles and looks up to see a large stone ornament Sidney's eyes widen at the weighted polished stone and horrified he bites his fist He calls an elevator and as she points they grapple for it A white paw sticks out as Sophie Eleanor and Lawrence are in reception Sidney runs off and Alison follows to find Sidney leaning out of a window He turns minus the bag She turns to look at Sidney who shrugs with arms folded The search party heads off leaving a relieved Sidney slumped against a wall by the window as Cuba's nose sticks out of the leather handbag drifting up behind him on the window cleaner's rising platform Sidney stands in the doorway of Clayton's office sips whiskey flings the blue shirts onto a desk and peers down his nose at them gesturing with a raised hand Smiling Clayton strolls up to him Sidney leaves then steps back in A flustered man looks down at Elizabeth then lifts his chin flutters his eyelids and steps over her Alison gives him the AOK and he walks on In a staff meeting his coworkers look on stonyfaced He prods Alison's arm Clayton rises from his seat at the head of the table and walks out Alison raises a palm to Sidney Clayton eats edamame beans and sushi at the desk in his office He tries to ignore Sidney who is tapping a notebook with a pen He nods Bill's eyes narrow and his expression hardens as a sheepishlooking Sidney sits opposite an indignant Clayton Sidney's hopeful smile wanes Clayton stares at Sidney who furrows his brow and points at the door Clayton nods and Sidney leaves Alison reads as models pick outfits from a rack Sidney plunks himself down beside her and sighs Alison stares at him scoffs stands up and flounces off with her nose in the air Sidney makes eye contact with Lawrence and waves Sidney's nose is taped up like a pig's snout As Eleanor and Sophie approach he tears the tape from his face and hides under his desk then emerges from beneath the table with Sellotape stuck to his left ear Sidney frowns and obediently toddles off"
        }
      ]
    }
  ]
}