{
  "ground_truth": "The sun shines on Sydney's red brick building. He's in the kitchen making a fry-up. Alison comes in wearing his oversized pajamas. Rubbing her neck, she looks at the black and white photo Richard was inspecting. He turns back to the stove and continues to cook. Alison sits at the table. She looks at the bacon, sausage, egg, tomatoes, beans, and toast. She runs off with a hand over her mouth. Sydney plumps a cushion on his leather sofa and takes his father's book from the coffee table. In doing so, he knocks Alison's handbag to the floor. The contents tumble out and he scrabbles to collect them. He picks up Alison's red notebook. It's embossed with a gold image of a butterfly. He glances about furtively, then opens it and starts to read. He looks up again to find Alison watching him. She shrugs and takes a seat. She starts to gather her things from the coffee table. The soundtrack to Le Dolce Vita. Holding the record, she looks up with a smile. He takes the battered record sleeve from her. She closes her eyes and smiles as he puts the record on. Wearing a wry smile, Sydney starts to dance. He turns and offers Alison his hand. They dance. Sydney's pretty mother seems to watch from the photograph on the shelving unit, as Alison cracks a smile and dances a cheeky little jive with Sydney. He takes her by the hand and raises it above his head. Nestled between lush green trees and other crumbling apartment blocks. Sydney's building is dwarfed by the skyscrapers on the horizon. Alison sits at her desk as Ingrid goes through dresses with another model. Sydney listens at the door. Hearing Alison cross the office, he darts for a fire exit, setting off the alarm. He closes the door and turns back. A crowd of office workers convenes and turns back. He taps the sign on the door. He takes a wildlife book from a shelf. The crowd disperses but Alison remains. She watches him head off. Into his bathroom mirror. He sticks some fake fangs in. He wrinkles his nose. With white face paint, fangs, and a cape, he carries a glass of wine as he finds Elena dressed as Marlene Dietrich. She stands chatting. Sydney walks away. A person with an Elvis Presley costume kisses a nun. He heads over to Alison, who wears a black wig and holds a cigarette in a long holder. He removes the fangs. Lawrence gives her a glass of champagne, then kisses her on the cheek and walks away. Sydney shifts uncomfortably. He shakes his head. They sip their drinks and stare straight ahead. Sydney looks at Alison and sighs.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The star radiates upon Sydney's crimson masonry edifice. He's in the cookhouse crafting a fry-up. Alison enters donning his oversized sleepwear. Rubbing her neck, she gazes at the monochrome image Richard was examining. He turns back to the range and persists to prepare. Alison settles at the table. She gazes at the bacon, sausage, egg, tomatoes, beans, and toast. She runs off with a hand over her mouth. Sydney fluffs a cushion on his leather settee and takes his father's tome from the coffee table. In doing so, he knocks Alison's purse to the floor. The contents cascade out and he scrambles to gather them. He picks up Alison's crimson notebook. It's embossed with a gold emblem of a butterfly. He glances about stealthily, then opens it and starts to peruse. He looks up again to find Alison observing him. She shrugs and takes a seat. She starts to assemble her items from the coffee table. The soundtrack to La Dolce Vita. Holding the record, she looks up with a grin. He takes the battered record sleeve from her. She closes her eyes and smiles as he places the record on. Wearing a wry grin, Sydney starts to dance. He turns and extends Alison his hand. They dance. Sydney's lovely mother seems to watch from the photograph on the shelving unit, as Alison cracks a smile and dances a cheeky little jive with Sydney. He takes her by the hand and lifts it above his head. Nestled between lush verdant trees and other crumbling apartment blocks. Sydney's edifice is dwarfed by the skyscrapers on the horizon. Alison sits at her desk as Ingrid goes through garments with another model. Sydney listens at the door. Hearing Alison traverse the office, he darts for a fire exit, setting off the alarm. He closes the door and turns back. A crowd of office staff assembles and turns back. He taps the sign on the door. He takes a wildlife tome from a shelf. The crowd disperses but Alison remains. She watches him head off. Into his bathroom mirror. He sticks some fake fangs in. He wrinkles his nose. With white facial paint, fangs, and a cloak, he carries a goblet of wine as he finds Elena dressed as Marlene Dietrich. She stands conversing. Sydney walks away. An individual with an Elvis Presley costume kisses a nun. He heads over to Alison, who wears a black wig and holds a cigarette in a long holder. He removes the fangs. Lawrence gives her a glass of champagne, then kisses her on the cheek and walks away. Sydney shifts uncomfortably. He shakes his head. They sip their beverages and stare straight ahead. Sydney gazes at Alison and sighs."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Sydney's red brick building is shone on by the sun. A fry-up is being made by him in the kitchen. His oversized pajamas are worn by Alison as she comes in. The black and white photo that Richard was inspecting is looked at by her while rubbing her neck. The stove is turned back to by him as he continues to cook. The table is sat at by Alison. The bacon, sausage, egg, tomatoes, beans, and toast are looked at by her. A hand is put over her mouth as she runs off. A cushion on his leather sofa is plumped by Sydney, and his father's book is taken from the coffee table. Alison's handbag is knocked to the floor by him in doing so. The contents are tumbled out, and he scrabbles to collect them. Alison's red notebook is picked up by him. It is embossed with a gold image of a butterfly. He glances about furtively, then opens and starts to read it. His eyes are looked up with again to find Alison watching him. A seat is taken by her with a shrug. Her things are started to be gathered by her from the coffee table. The soundtrack to Le Dolce Vita. The record is held as she looks up with a smile. The battered record sleeve is taken from her by him. Her eyes are closed, and she smiles as the record is put on by him. Wearing a wry smile, a dance is started by Sydney. His hand is offered to Alison by him as he turns. A dance is shared by them. From the photograph on the shelving unit, Sydney's pretty mother seems to watch as a smile is cracked by Alison and a cheeky little jive is danced with Sydney. Her hand is taken by him, and above his head, it is raised. Nestled between lush green trees and other crumbling apartment blocks, the building of Sydney is dwarfed by the skyscrapers on the horizon. Alison is at her desk as dresses are gone through with another model by Ingrid. At the door, Sydney listens. The office is crossed by Alison, he hears, so he darts for a fire exit, setting off the alarm. The door is closed and turned back to by him. A crowd of office workers is convened and turned back by him. The sign on the door is tapped by him. A wildlife book is taken from a shelf by him. The crowd disperses, but Alison remains. She watches him head off. Into his bathroom mirror, he goes. Some fake fangs are stuck in by him. His nose is wrinkled. Dressed with white face paint, fangs, and a cape, a glass of wine is carried by him as Elena is found dressed as Marlene Dietrich. She stands chatting. Walking away is done by Sydney. A person in an Elvis Presley costume kisses a nun. He heads over to Alison, who is wearing a black wig and holds a cigarette in a long holder. The fangs are removed by him. A glass of champagne is given to her by Lawrence, then she is kissed on the cheek by him and he walks away. Sydney shifts uncomfortably. His head is shaken by him. Their drinks are sipped, and straight ahead is stared by them. Alison is looked at by Sydney, and a sigh is made by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Sunlight illuminates Sydney's red brick building. In the kitchen, he's making breakfast. Alison enters in his oversized pajamas, rubbing her neck as she notices the black and white photo Richard was examining. Sydney resumes cooking while Alison sits at the table, eyeing the bacon, sausage, eggs, tomatoes, beans, and toast before rushing off with a hand over her mouth. Sydney plumps a cushion on his leather sofa and picks up his father's book, accidentally knocking Alison's handbag to the floor. As he gathers the contents, he finds her red notebook embossed with a gold butterfly. Glancing around, he opens it and reads until Alison catches him. She shrugs, sits, and collects her things. Holding the soundtrack to La Dolce Vita, she smiles. Sydney takes the record sleeve, plays the record, and starts dancing, offering Alison his hand. They dance as Sydney's mother seems to watch from a photo. Alison smiles and jives with Sydney, who raises her hand above his head. Sydney's building, nestled among trees and crumbling apartments, is dwarfed by nearby skyscrapers. Alison sits at her desk while Ingrid reviews dresses with another model. Sydney listens at the door, then darts for a fire exit, triggering the alarm. He turns back, taps the door sign, and takes a wildlife book from a shelf. The crowd disperses, but Alison stays, watching him leave. In his bathroom mirror, he dons fake fangs, white face paint, and a cape, carrying a glass of wine. He finds Elena dressed as Marlene Dietrich, chatting. Sydney walks away, passing someone in an Elvis costume kissing a nun. He approaches Alison, in a black wig with a cigarette holder, and removes the fangs. Lawrence gives her champagne, kisses her cheek, and leaves. Sydney shifts uncomfortably, shakes his head, and they sip their drinks, staring ahead. Sydney looks at Alison and sighs."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The sun shines on Sydney's red brick building. He's cooking in the kitchen. Alison enters in his oversized pajamas, rubs her neck, and notices the photo Richard was inspecting. Sydney continues cooking as Alison sits and looks at the breakfast spread. She runs off, hand over mouth. Sydney plumps a cushion, takes his father's book, and knocks Alison's handbag to the floor. He collects the contents, including her red notebook with a gold butterfly. He reads it furtively until Alison watches him. She shrugs, gathers her things, and smiles at the Le Dolce Vita soundtrack. Sydney dances, offering Alison his hand. They jive as his mother's photo seems to watch. Sydney's building is surrounded by trees and dwarfed by skyscrapers. Alison sits at her desk while Sydney listens at the door. He sets off the fire alarm and escapes, tapping a sign on the door. The crowd disperses, but Alison watches him leave. In his bathroom, Sydney dons fake fangs, white face paint, and a cape. He finds Elena dressed as Marlene Dietrich and walks away. An Elvis impersonator kisses a nun. Sydney approaches Alison, in a black wig with a cigarette holder. He removes the fangs. Lawrence gives her champagne, kisses her cheek, and leaves. Sydney shifts uncomfortably, shakes his head, and they sip drinks, staring ahead. Sydney looks at Alison and sighs."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The bright, golden sun casts its warm rays upon the red brick building where Sydney resides, highlighting its vibrant hue. Inside, Sydney is busy in the kitchen, skillfully preparing a hearty fry-up. Alison enters the room, comfortably dressed in his oversized pajamas, which seem to envelop her. As she rubs her neck, she notices the black and white photograph that Richard had been examining with interest. Without missing a beat, Sydney turns his attention back to the stove, continuing to cook with focused determination. Alison takes a seat at the table, her eyes scanning the spread of bacon, sausage, eggs, tomatoes, beans, and toast laid out before her. Suddenly, she rushes off, covering her mouth with her hand.\n\nMeanwhile, Sydney moves to the living room, where he plumps a cushion on his leather sofa and picks up his father's book from the coffee table. In the process, he accidentally knocks Alison's handbag to the floor, causing its contents to spill out. He hurriedly scrambles to gather them, picking up Alison's red notebook, which is beautifully embossed with a gold image of a butterfly. Glancing around furtively, he opens it and begins to read. Just then, he looks up to find Alison watching him. She merely shrugs and takes a seat, starting to collect her belongings from the coffee table. The soundtrack to \"La Dolce Vita\" plays softly in the background. Holding the record, she looks up with a smile, and Sydney takes the battered record sleeve from her hands. She closes her eyes, smiling as he places the record on the player. With a wry smile, Sydney begins to dance, turning to offer Alison his hand. Together, they dance, and Sydney's pretty mother seems to watch from a photograph on the shelving unit. Alison cracks a smile and joins Sydney in a cheeky little jive. He takes her hand and raises it above his head in a playful gesture.\n\nNestled among lush green trees and surrounded by other crumbling apartment blocks, Sydney's building is dwarfed by the towering skyscrapers on the horizon. Later, Alison sits at her desk while Ingrid goes through dresses with another model. Sydney listens intently at the door. Hearing Alison cross the office, he quickly darts for a fire exit, inadvertently setting off the alarm. He closes the door behind him and turns back, as a crowd of office workers gathers and then disperses. Alison, however, remains, watching him as he heads off. In front of his bathroom mirror, Sydney sticks some fake fangs in, wrinkling his nose at his reflection. With white face paint, fangs, and a cape, he carries a glass of wine as he encounters Elena, who is dressed as Marlene Dietrich, standing and chatting. Sydney walks away, observing a person in an Elvis Presley costume kissing a nun. He makes his way over to Alison, who is wearing a black wig and holding a cigarette in a long holder. Removing the fangs, Lawrence hands her a glass of champagne, kisses her on the cheek, and walks away. Sydney shifts uncomfortably, shaking his head slightly. They sip their drinks in silence, staring straight ahead. Sydney glances at Alison and lets out a sigh."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The radiant, golden sunlight casts its warm and inviting rays upon the red brick building where Sydney makes his home, highlighting and enhancing its vibrant, eye-catching hue. Inside this cozy abode, Sydney is busily engaged in the kitchen, skillfully and meticulously preparing a hearty fry-up. At this moment, Alison enters the room, comfortably attired in his oversized pajamas, which seem to envelope and swallow her petite frame. As she gently rubs her neck, she takes notice of the black and white photograph that had captured Richard's interest and was previously being examined attentively by him. Without missing a beat, Sydney redirects his focus back to the stove, continuing to cook with unwavering determination and concentration. Alison takes a seat at the table, her eyes scanning the generous spread of crispy bacon, sizzling sausage, perfectly cooked eggs, juicy tomatoes, savory beans, and crispy toast laid invitingly before her. All of a sudden, she rushes off, covering her mouth with her hand in an urgent manner.\n\nMeanwhile, Sydney moves gracefully into the living room, where he casually plumps a cushion on his sleek leather sofa and picks up a treasured book of his father's from the coffee table. In doing so, he accidentally knocks Alison's handbag to the floor, causing its contents to spill out in a disorganized mess. He hurriedly scrambles to gather the scattered items, picking up Alison's red notebook, which is beautifully and ornately embossed with a gold image of a butterfly. Glancing around furtively, he opens the notebook and begins to read its contents. Just then, he looks up to find Alison watching him with an unreadable expression. She merely shrugs and takes a seat, starting to collect her scattered belongings from the coffee table. The soothing soundtrack to \"La Dolce Vita\" plays softly in the background, adding a touch of elegance to the atmosphere. Holding the record, she looks up with a warm smile, and Sydney gently takes the battered record sleeve from her hands. She closes her eyes, smiling serenely as he carefully places the record on the player. With a wry smile on his face, Sydney begins to dance lightly, turning to offer Alison his hand with a playful gesture. Together, they dance cheekily, and Sydney's pretty mother seems to observe them from a photograph on the shelving unit. Alison cracks a smile and joins Sydney in a cheeky little jive, and he takes her hand, raising it above his head in a playful, exuberant gesture.\n\nNestled comfortably among lush green trees and surrounded by other crumbling apartment blocks, Sydney's building is dwarfed by the imposing and towering skyscrapers that dominate the horizon. Later, Alison sits at her desk, while Ingrid busily goes through dresses with another model. Sydney listens intently at the door, trying to catch any snatches of conversation. Hearing Alison cross the office, he quickly darts for a nearby fire exit, inadvertently setting off the loud alarm. He closes the door behind him and turns back, as a dispersed crowd of office workers gathers and then disperses once more. Alison, however, remains behind, watching him thoughtfully as he makes his way off. In front of his bathroom mirror, Sydney sticks some fake fangs in, wrinkling his nose at his reflection in playfulness. With his face adorned in white face paint, fangs, and a dramatic cape, he carries a glass of wine as he encounters Elena, who is elegantly dressed as Marlene Dietrich, standing and chatting animatedly. Sydney walks away, observing a person in an Elvis Presley costume kissing a nun in a playful display. He eventually makes his way over to Alison, who is wearing a chic black wig and holding a cigarette in a long, elegant holder. Removing the fangs, Lawrence hands her a sparkling glass of champagne, kisses her on the cheek with affection, and walks away nonchalantly. Sydney shifts uncomfortably, shaking his head slightly as if in disbelief. They sip their drinks in contemplative silence, staring straight ahead into the distance. Sydney glances at Alison and lets out a long, deep sigh."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The sun casts its warm glow on Sydney's red brick building, illuminating the scene as he stands in the kitchen, focused on preparing a hearty fry-up. He carefully tends to the sizzling bacon, sausage, eggs, tomatoes, beans, and toast, ensuring each item is cooked to perfection. Alison enters the room, wearing his oversized pajamas, and rubs her neck as she approaches. Her gaze falls on the black and white photo that Richard had been inspecting, but she quickly shifts her attention back to Sydney, who has turned back to the stove to continue cooking. Alison takes a seat at the table, her eyes scanning the array of breakfast items before her. Suddenly, she feels a wave of nausea and rushes off, covering her mouth with her hand. Meanwhile, Sydney moves to the living room, where he plumps a cushion on his leather sofa and reaches for his father's book on the coffee table. In the process, he accidentally knocks Alison's handbag to the floor, causing its contents to spill out. He hurriedly scrambles to gather the scattered items, picking up Alison's red notebook, which is embossed with a gold image of a butterfly. Curiosity piqued, he glances around furtively before opening the notebook and beginning to read. As he becomes engrossed in its contents, he looks up to find Alison watching him. She merely shrugs and takes a seat, starting to collect her belongings from the coffee table. The soundtrack to \"La Dolce Vita\" plays in the background, and Alison, holding the record, looks up with a smile. Sydney takes the battered record sleeve from her, and as he places the record on, Alison closes her eyes and smiles. With a wry smile, Sydney begins to dance, turning to offer Alison his hand. They dance together, and Sydney's pretty mother seems to watch from a photograph on the shelving unit as Alison cracks a smile and joins Sydney in a cheeky little jive. He takes her by the hand, raising it above his head as they twirl. Nestled between lush green trees and other crumbling apartment blocks, Sydney's building is dwarfed by the towering skyscrapers on the horizon. Later, Alison sits at her desk while Ingrid goes through dresses with another model. Sydney listens at the door, and upon hearing Alison cross the office, he quickly darts for a fire exit, inadvertently setting off the alarm. He closes the door behind him and turns back, observing as a crowd of office workers convenes and then disperses. He taps the sign on the door and retrieves a wildlife book from a shelf. The crowd disperses, but Alison remains, watching him as he heads off. In his bathroom mirror, Sydney sticks some fake fangs in, wrinkling his nose at his reflection. With white face paint, fangs, and a cape, he carries a glass of wine and finds Elena dressed as Marlene Dietrich, standing and chatting. Sydney walks away, passing a person in an Elvis Presley costume who kisses a nun. He approaches Alison, who wears a black wig and holds a cigarette in a long holder. Removing the fangs, he watches as Lawrence gives her a glass of champagne, kisses her on the cheek, and walks away. Sydney shifts uncomfortably, shaking his head as they both sip their drinks and stare straight ahead. Sydney looks at Alison and lets out a sigh."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The sun shines on Sydney's red brick building as he prepares a fry-up in the kitchen. Alison enters in his oversized pajamas, glancing at a black and white photo before sitting at the table. Overwhelmed by the sight of the breakfast spread, she rushes off. Sydney, meanwhile, settles on the sofa with his father's book, accidentally knocking over Alison's handbag. As he gathers her belongings, he notices her red notebook, embossed with a gold butterfly, and begins to read it furtively until Alison catches him. She shrugs, retrieves her things, and hands him a record. Smiling, he plays it, and they dance together, watched over by a photo of Sydney's mother. Later, nestled among trees and overshadowed by skyscrapers, Sydney's building stands as Alison works at her desk. Sydney listens at the door, then makes a hasty exit, triggering an alarm. As the office crowd disperses, Alison watches him leave. In his bathroom, Sydney dons a vampire costume, complete with fangs and face paint, and joins a party where he encounters Elena as Marlene Dietrich and Alison in a black wig. After removing his fangs, he watches as Lawrence gives Alison champagne and a kiss on the cheek. Sydney, feeling uneasy, sips his drink beside Alison, both staring ahead in silence."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The sun, rising over the iconic skyline that includes the Sydney Opera House, shines on Sydney's red brick building. He's in the kitchen making a fry-up, a traditional English breakfast known for its hearty ingredients. Alison comes in wearing his oversized pajamas. Rubbing her neck, she looks at the black and white photo Richard, named after the renowned actor Richard Burton, was inspecting. He turns back to the stove and continues to cook. Alison sits at the table. She looks at the bacon, sausage, egg, tomatoes, beans, and toast, staples of a classic fry-up breakfast. She runs off with a hand over her mouth. Sydney plumps a cushion on his leather sofa, reminiscent of those found in upscale Victorian homes, and takes his father's book from the coffee table, a novel by acclaimed author Ernest Hemingway. In doing so, he knocks Alison's handbag to the floor. The contents tumble out and he scrabbles to collect them. He picks up Alison's red notebook. It's embossed with a gold image of a butterfly, a symbol of transformation and beauty in many cultures. He glances about furtively, then opens it and starts to read. He looks up again to find Alison watching him. She shrugs and takes a seat. She starts to gather her things from the coffee table. The soundtrack to La Dolce Vita, a classic film by Federico Fellini, begins to play. Holding the record, she looks up with a smile. He takes the battered record sleeve from her, its edges worn from years of use. She closes her eyes and smiles as he puts the record on. Wearing a wry smile, Sydney starts to dance. He turns and offers Alison his hand. They dance. Sydney's pretty mother seems to watch from the photograph on the shelving unit, reminiscent of a bygone era, as Alison cracks a smile and dances a cheeky little jive with Sydney. He takes her by the hand and raises it above his head. Nestled between lush green trees and other crumbling apartment blocks, Sydney's building is dwarfed by the skyscrapers on the horizon that mark the burgeoning cityscape. Alison sits at her desk as Ingrid, a renowned fashion designer, goes through dresses with another model. Sydney listens at the door. Hearing Alison cross the office, he darts for a fire exit, setting off the alarm. He closes the door and turns back. A crowd of office workers convenes and turns back. He taps the sign on the door that reads \"Emergency Exit.\" He takes a wildlife book from a shelf, a guide to Australian fauna. The crowd disperses but Alison remains. She watches him head off. Into his bathroom mirror, he sticks some fake fangs in, reminiscent of classic horror film motifs. He wrinkles his nose. With white face paint, fangs, and a cape reminiscent of a vintage Dracula costume, he carries a glass of wine as he finds Elena dressed as Marlene Dietrich, the legendary actress known for her sultry roles. She stands chatting. Sydney walks away. A person dressed in an Elvis Presley costume, referencing the King of Rock and Roll's iconic image, kisses a nun. He heads over to Alison, who wears a black wig and holds a cigarette in a long holder, a nod to 1920s flapper fashion. He removes the fangs. Lawrence, an acquaintance from their theatre group, gives her a glass of champagne, then kisses her on the cheek and walks away. Sydney shifts uncomfortably. He shakes his head. They sip their drinks and stare straight ahead at the dimly lit room filled with costumed partygoers. Sydney looks at Alison and sighs."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The sun shines on Sydney's red brick building. He is in the kitchen making a fryup. Alison comes in wearing his oversized pajamas. Rubbing her neck she looks at the black and white photo Richard was inspecting. He turns back to the stove and continues to cook. Alison sits at the table. She looks at the bacon sausage egg tomatoes beans and toast. She runs off with a hand over her mouth. Sydney plumps a cushion on his leather sofa and takes his father's book from the coffee table. In doing so he knocks Alison's handbag to the floor. The contents tumble out and he scrabbles to collect them. He picks up Alison's red notebook. It is embossed with a gold image of a butterfly. He glances about furtively then opens it and starts to read. He looks up again to find Alison watching him. She shrugs and takes a seat. She starts to gather her things from the coffee table. The soundtrack to Le Dolce Vita. Holding the record she looks up with a smile. He takes the battered record sleeve from her. She closes her eyes and smiles as he puts the record on. Wearing a wry smile Sydney starts to dance. He turns and offers Alison his hand. They dance. Sydney's pretty mother seems to watch from the photograph on the shelving unit as Alison cracks a smile and dances a cheeky little jive with Sydney. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. He takes her by the hand and raises it above his head. Nestled between lush green trees and other crumbling apartment blocks. Sydney's building is dwarfed by the skyscrapers on the horizon. Alison sits at her desk as Ingrid goes through dresses with another model. Sydney listens at the door. Hearing Alison cross the office he darts for a fire exit setting off the alarm. He closes the door and turns back. A crowd of office workers convenes and turns back. He taps the sign on the door. He takes a wildlife book from a shelf. The crowd disperses but Alison remains. She watches him head off Into his bathroom mirror. He sticks some fake fangs in. He wrinkles his nose. With white face paint fangs and a cape he carries a glass of wine as he finds Elena dressed as Marlene Dietrich. She stands chatting. Sydney walks away. A person with an Elvis Presley costume kisses a nun. He heads over to Alison who wears a black wig and holds a cigarette in a long holder. He removes the fangs. Lawrence gives her a glass of champagne then kisses her on the cheek and walks away. Sydney shifts uncomfortably. He shakes his head. They sip their drinks and stare straight ahead. Sydney looks at Alison and sighs."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The sun shines on Sydney's red brick building. He is in the kitchen making a fryup. Alison comes in wearing his oversized pajamas. Rubbing her neck she looks at the black and white photo Richard was inspecting. He turns back to the stove and continues to cook. Alison sits at the table. She looks at the bacon sausage egg tomatoes beans and toast. She runs off with a hand over her mouth. Sydney plumps a cushion on his leather sofa and takes his father's book from the coffee table. In doing so he knocks Alison's handbag to the floor. The contents tumble out and he scrabbles to collect them. He picks up Alison's red notebook. It is embossed with a gold image of a butterfly. He glances about furtively then opens it and starts to read. He looks up again to find Alison watching him. She shrugs and takes a seat. She starts to gather her things from the coffee table. The soundtrack to Le Dolce Vita. Holding the record she looks up with a smile. He takes the battered record sleeve from her. She closes her eyes and smiles as he puts the record on. Wearing a wry smile Sydney starts to dance. He turns and offers Alison his hand. They dance. Sydney's pretty mother seems to watch from the photograph on the shelving unit as Alison cracks a smile and dances a cheeky little jive with Sydney. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. He takes her by the hand and raises it above his head. Nestled between lush green trees and other crumbling apartment blocks. Sydney's building is dwarfed by the skyscrapers on the horizon. Alison sits at her desk as Ingrid goes through dresses with another model. Sydney listens at the door. Hearing Alison cross the office he darts for a fire exit setting off the alarm. He closes the door and turns back. A crowd of office workers convenes and turns back. He taps the sign on the door. He takes a wildlife book from a shelf. The crowd disperses but Alison remains. She watches him head off Into his bathroom mirror. He sticks some fake fangs in. He wrinkles his nose. With white face paint fangs and a cape he carries a glass of wine as he finds Elena dressed as Marlene Dietrich. She stands chatting. Sydney walks away. A person with an Elvis Presley costume kisses a nun. He heads over to Alison who wears a black wig and holds a cigarette in a long holder. He removes the fangs. Lawrence gives her a glass of champagne then kisses her on the cheek and walks away. Sydney shifts uncomfortably. He shakes his head. They sip their drinks and stare straight ahead. Sydney looks at Alison and sighs."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The sun shines on Sydney's red brick building. He is in the kitchen making a fryup. Alison comes in wearing his oversized pajamas. Rubbing her neck she looks at the black and white photo Richard was inspecting. He turns back to the stove and continues to cook. Alison sits at the table. She looks at the bacon sausage egg tomatoes beans and toast. She runs off with a hand over her mouth. Sydney plumps a cushion on his leather sofa and takes his father's book from the coffee table. In doing so he knocks Alison's handbag to the floor. The contents tumble out and he scrabbles to collect them. He picks up Alison's red notebook. It is embossed with a gold image of a butterfly. He wrinkles his nose. With white face paint fangs and a cape he carries a glass of wine as he finds Elena dressed as Marlene Dietrich. She stands chatting. Sydney walks away. A person with an Elvis Presley costume kisses a nun. He heads over to Alison who wears a black wig and holds a cigarette in a long holder. He removes the fangs. Lawrence gives her a glass of champagne then kisses her on the cheek and walks away. Sydney shifts uncomfortably. He shakes his head. They sip their drinks and stare straight ahead. Sydney looks at Alison and sighs."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The sun shines on Sydney's red brick building. He is in the kitchen making a fryup. Alison comes in wearing his oversized pajamas. Rubbing her neck she looks at the black and white photo Richard was inspecting. He turns back to the stove and continues to cook. Lawrence gives her a glass of champagne then kisses her on the cheek and walks away. Sydney shifts uncomfortably. He shakes his head. They sip their drinks and stare straight ahead. Sydney looks at Alison and sighs."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The moon beams on Cairo's blue stone tower. She's in the library organizing a collection of stamps. Oliver enters sporting her miniature cloak. Scratching his chin, he gazes at the green and yellow sketch Julia was admiring. She glances back at the computer and continues to type. Oliver reclines on the recliner. He stares at the lettuce, crackers, jam, oranges, popcorn, and milk. He bolts away with a hat over his eyes. Cairo fluffs a pillow on his velvet armchair and grabs his sister's map from the dining chair. In doing so, he drops Oliver's backpack to the carpet. The items spill out, and he scrambles to gather them. He lifts Oliver's blue ledger. It's stamped with a silver outline of a sunflower. He peeks around suspiciously, then flips it open and begins to jot down notes. He glances up again to find Oliver observing him. He nods and leans back. He begins to arrange his belongings from the dining chair. The melody of Casablanca. Holding the disc, he gazes up with glee. She grabs the worn-out vinyl cover from him. He closes her eyes and grins as she places the disc in. With a cheeky grin, Cairo begins to hop. He spins and reaches Oliver his arm. They twirl. Cairo's charming father seems to observe from the painting on the mantelpiece, as Oliver lets out a laugh and twirls a playful little twist with Cairo. She grips him by the arm and lowers it past his shoulder. Surrounded by tall brown fences and other abandoned warehouses. Cairo's tower is overshadowed by the watchtowers in the distance. Oliver reclines in his cubicle as Martin sifts through hats with a different craftsman. Cairo eavesdrops at the wall. Hearing Oliver leave the workspace, he bolts for a side door, triggering the buzzer. He pulls the handle and glances back. A huddle of engineers assembles and turns away. He taps the plaque on the wall. He grabs a nature journal from a counter. The huddle disperses but Oliver stays put. She observes him stride away. Toward his bedroom window. He sticks some artificial whiskers on. He twitches his ears. With red fur paint, whiskers, and a coat, he clutches a cup of cocoa as he encounters Bianca dressed as Audrey Hepburn. She stands laughing. Cairo drifts away. Someone in a Marilyn Monroe outfit high-fives a chef. He ambles over to Oliver, who sports a red mask and grips a monocle on a short chain. He pulls the whiskers off. Francine hands him a mug of cider, then high-fives her on the hand and drifts away. Cairo fidgets awkwardly. He nods side-to-side. They sip their tea and gaze sideways. Cairo turns to Oliver and yawns."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Sydney is in his kitchen cooking breakfast, while Alison, in his pajamas, notices a black and white photo he's examining. Feeling unwell, she rushes away. Sydney accidentally knocks her handbag, spilling its contents, and secretly reads her red notebook. Alison catches him, shrugs, and starts collecting her things. They share a lighthearted moment, dancing to the soundtrack of \"La Dolce Vita.\" Later, Alison works at her desk when Sydney, eavesdropping, accidentally sets off a fire alarm and quickly hides. At a costume party, Sydney sees Alison with Lawrence, who gives her champagne and a cheek kiss, leaving Sydney unsettled as they silently drink together."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Sydney looks at Alison and sighs They sip their drinks and stare straight ahead  He shakes his head  Sydney shifts uncomfortably  Lawrence gives her a glass of champagne then kisses her on the cheek and walks away  He removes the fangs  He heads over to Alison who wears a black wig and holds a cigarette in a long holder  A person with an Elvis Presley costume kisses a nun  Sydney walks away  She stands chatting  With white face paint fangs and a cape he carries a glass of wine as he finds Elena dressed as Marlene Dietrich  He wrinkles his nose  He sticks some fake fangs in  She watches him head off Into his bathroom mirror  The crowd disperses but Alison remains  He takes a wildlife book from a shelf  He taps the sign on the door  A crowd of office workers convenes and turns back  He closes the door and turns back  Hearing Alison cross the office he darts for a fire exit setting off the alarm  Sydney listens at the door  Alison sits at her desk as Ingrid goes through dresses with another model  Sydney's building is dwarfed by the skyscrapers on the horizon  Nestled between lush green trees and other crumbling apartment blocks  He takes her by the hand and raises it above his head  Sydney's pretty mother seems to watch from the photograph on the shelving unit as Alison cracks a smile and dances a cheeky little jive with Sydney  They dance  He turns and offers Alison his hand  Wearing a wry smile Sydney starts to dance  She closes her eyes and smiles as he puts the record on  He takes the battered record sleeve from her  Holding the record she looks up with a smile  The soundtrack to Le Dolce Vita  She starts to gather her things from the coffee table  She shrugs and takes a seat  He looks up again to find Alison watching him  He glances about furtively then opens it and starts to read  It's embossed with a gold image of a butterfly  He picks up Alison's red notebook  The contents tumble out and he scrabbles to collect them  In doing so he knocks Alison's handbag to the floor  Sydney plumps a cushion on his leather sofa and takes his father's book from the coffee table  She runs off with a hand over her mouth  She looks at the bacon sausage egg tomatoes beans and toast  Alison sits at the table  He turns back to the stove and continues to cook  Rubbing her neck she looks at the black and white photo Richard was inspecting  Alison comes in wearing his oversized pajamas  He's in the kitchen making a fryup  The sun shines on Sydney's red brick building "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He is in the kitchen making a fryup The sun shines on Sydney's red brick building Rubbing her neck she looks at the black and white photo Richard was inspecting Alison comes in wearing his oversized pajamas Alison sits at the table He turns back to the stove and continues to cook She runs off with a hand over her mouth She looks at the bacon sausage egg tomatoes beans and toast In doing so he knocks Alison's handbag to the floor Sydney plumps a cushion on his leather sofa and takes his father's book from the coffee table He picks up Alison's red notebook The contents tumble out and he scrabbles to collect them He glances about furtively then opens it and starts to read It is embossed with a gold image of a butterfly She shrugs and takes a seat He looks up again to find Alison watching him The soundtrack to Le Dolce Vita She starts to gather her things from the coffee table He takes the battered record sleeve from her Holding the record she looks up with a smile Wearing a wry smile Sydney starts to dance She closes her eyes and smiles as he puts the record on They dance He turns and offers Alison his hand He takes her by the hand and raises it above his head Sydney's pretty mother seems to watch from the photograph on the shelving unit as Alison cracks a smile and dances a cheeky little jive with Sydney Sydney's building is dwarfed by the skyscrapers on the horizon Nestled between lush green trees and other crumbling apartment blocks Sydney listens at the door Alison sits at her desk as Ingrid goes through dresses with another model He closes the door and turns back Hearing Alison cross the office he darts for a fire exit setting off the alarm He taps the sign on the door A crowd of office workers convenes and turns back The crowd disperses but Alison remains He takes a wildlife book from a shelf He sticks some fake fangs in She watches him head off Into his bathroom mirror With white face paint fangs and a cape he carries a glass of wine as he finds Elena dressed as Marlene Dietrich He wrinkles his nose Sydney walks away She stands chatting He heads over to Alison who wears a black wig and holds a cigarette in a long holder A person with an Elvis Presley costume kisses a nun Lawrence gives her a glass of champagne then kisses her on the cheek and walks away He removes the fangs He shakes his head Sydney shifts uncomfortably Sydney looks at Alison and sighs They sip their drinks and stare straight ahead"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He takes her by the hand and raises it above his head  Nestled between lush green trees and other crumbling apartment blocks  Sydney's building is dwarfed by the skyscrapers on the horizon  Alison sits at her desk as Ingrid goes through dresses with another model  Sydney listens at the door  Hearing Alison cross the office he darts for a fire exit setting off the alarm  He closes the door and turns back  A crowd of office workers convenes and turns back  He taps the sign on the door  He takes a wildlife book from a shelf  The crowd disperses but Alison remains  She watches him head off Into his bathroom mirror  He sticks some fake fangs in  He wrinkles his nose  With white face paint fangs and a cape he carries a glass of wine as he finds Elena dressed as Marlene Dietrich  She stands chatting  Sydney walks away  A person with an Elvis Presley costume kisses a nun  He heads over to Alison who wears a black wig and holds a cigarette in a long holder  He removes the fangs  Lawrence gives her a glass of champagne then kisses her on the cheek and walks away  Sydney shifts uncomfortably  He shakes his head  They sip their drinks and stare straight ahead  Sydney looks at Alison and sighs The sun shines on Sydney's red brick building  He's in the kitchen making a fryup  Alison comes in wearing his oversized pajamas  Rubbing her neck she looks at the black and white photo Richard was inspecting  He turns back to the stove and continues to cook  Alison sits at the table  She looks at the bacon sausage egg tomatoes beans and toast  She runs off with a hand over her mouth  Sydney plumps a cushion on his leather sofa and takes his father's book from the coffee table  In doing so he knocks Alison's handbag to the floor  The contents tumble out and he scrabbles to collect them  He picks up Alison's red notebook  It's embossed with a gold image of a butterfly  He glances about furtively then opens it and starts to read  He looks up again to find Alison watching him  She shrugs and takes a seat  She starts to gather her things from the coffee table  The soundtrack to Le Dolce Vita  Holding the record she looks up with a smile  He takes the battered record sleeve from her  She closes her eyes and smiles as he puts the record on  Wearing a wry smile Sydney starts to dance  He turns and offers Alison his hand  They dance  Sydney's pretty mother seems to watch from the photograph on the shelving unit as Alison cracks a smile and dances a cheeky little jive with Sydney "
        }
      ]
    }
  ]
}