{
  "ground_truth": "The locker door is plastered with photos and cuttings. She pulls out a folder and some pages fall to the floor as a boy comes by. Juno grins at her friend talking to a fat bearded teacher. In class, Bleeker swallows some Tic Tacs as Juno appears by his side clutching her folders. Another boy stands on the other side of the work table. A second girl turns up. Amanda leaves Josh open-mouthed. Bleeker suppresses a smile. Later, Juno dials a number. She vigorously shakes the phone and something falls out. She frowns at the phone. Juno throws up in a decorative urn. Juno's little sister sprinkles her food. Liberty Bell smiles slowly. Juno plods away past Su-Chin. Juno stops in her tracks. She shrugs and walks on towards the door of the Women Now Center. A punk girl sits in reception playing on her game console. Juno wanders into the lobby and steps up to the counter. Juno nods obediently. Juno takes the questionnaire clipboard to a padded leather bench and sits down. As she starts to fill in the form, she becomes aware of a black woman seated nearby crumbing her fingers against her clipboard. A woman painting her nails, another scratching her arm, another using a nail file add to the crescendo of sound. Juno drops her pen. Su-Chin brightens. They sit on a park bench scouring the paper. Leah hands pipe-smoking Juno an ad. Bleeker is lying on his bed, looking at the photo of Juno in his yearbook. His other hand is clasped around a piece of cloth. Bleeker's solidly built double-chinned mother closes the door of his bedroom. He goes back to gazing at Juno's picture and brings his class pen from behind his head. Scrunched in his fingers, he's holding the knickers she wore and discarded on the day they had sex. At Juno's house, Leah watches apprehensively as Juno paces in front of her dad and her stepmom. Mac and Bren brace themselves. Juno looks them both in the eye. Leah pulls a face. Juno meets her dad's bewildered gaze, then lets her head drop for a second before speaking. Mac shakes his head as she turns on her heels and hightails upstairs with Leah behind her. He runs his hands over his face. A slim young woman arranges some white hydrangeas in a glass vase. White cuffed hands straighten a glass photo frame. She places some aromatic sticks into a bottle. Mac with Juno beside him drives his blue Previa through the gates of the affluent looking Glacial Valley estate. With a ring on the fourth finger of her left hand, she fans out the display of coffee table magazines, straightens two monogram tan towels, and wipes a banister rail as Mac drives past a number of substantial houses set back from the road.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The cabinet hatch is covered with photographs and clippings. She draws out a dossier and some sheets tumble to the ground as a lad comes by. Juno beams at her companion conversing with a hefty bearded instructor. In class, Bleeker gulps some Tic Tacs as Juno emerges by his side gripping her dossiers. Another lad stands on the other side of the work desk. A second girl turns up. Amanda exits Josh agape. Bleeker stifles a grin. Later, Juno dials a numeral. She energetically rattles the device and something drops out. She scowls at the device. Juno regurgitates in a decorative vase. Juno's small sibling sprinkles her nourishment. Liberty Bell beams slowly. Juno trudges away past Su-Chin. Juno halts in her steps. She shrugs and ambles on toward the entrance of the Women Now Center. A punk girl sits in reception engaging with her game console. Juno meanders into the lobby and steps up to the counter. Juno nods compliantly. Juno takes the questionnaire clipboard to a cushioned leather bench and sits down. As she starts to fill in the document, she becomes aware of a black woman seated nearby crumbing her digits against her clipboard. A woman painting her nails, another scratching her limb, another using a nail file adds to the crescendo of sound. Juno drops her pen. Su-Chin brightens. They sit on a park bench scouring the paper. Leah hands pipe-smoking Juno an advertisement. Bleeker is lying on his cot, looking at the photograph of Juno in his yearbook. His other hand is clasped around a piece of fabric. Bleeker's solidly built double-chinned mother shuts the door of his chamber. He goes back to gazing at Juno's portrait and brings his class pen from behind his cranium. Scrunched in his fingers, he's holding the underwear she wore and discarded on the day they had intercourse. At Juno's abode, Leah watches apprehensively as Juno strides in front of her dad and her stepmom. Mac and Bren brace themselves. Juno looks them both in the eye. Leah pulls a grimace. Juno meets her dad's bewildered gaze, then lets her head drop for a moment before speaking. Mac shakes his head as she pivots on her heels and hightails upstairs with Leah trailing her. He runs his hands over his visage. A slim young woman arranges some white hydrangeas in a glass vase. White cuffed hands straighten a glass photo frame. She places some aromatic sticks into a bottle. Mac with Juno beside him drives his blue Previa through the gates of the affluent looking Glacial Valley estate. With a ring on the fourth finger of her left hand, she fans out the display of coffee table magazines, straightens two monogram tan towels, and wipes a banister rail as Mac drives past a number of substantial houses set back from the road."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The locker door is covered with photos and cuttings. A folder is pulled out by her, and some pages are dropped to the floor as a boy comes by. Her friend is grinned at by Juno while talking to a fat bearded teacher. In class, some Tic Tacs are swallowed by Bleeker as Juno appears by his side clutching her folders. The other side of the work table is occupied by another boy. A second girl shows up. Amanda leaves Josh open-mouthed. A smile is suppressed by Bleeker. Later, a number is dialed by Juno. The phone is shaken vigorously by her and something falls out. The phone is frowned at by her. A decorative urn is thrown up in by Juno. Juno's little sister sprinkles her food. A slow smile is given by Liberty Bell. Su-Chin is passed by Juno plodding away. Her tracks are stopped in by Juno. A shrug is given by her, and she walks on towards the door of the Women Now Center. A punk girl is seated in reception playing on her game console. The lobby is wandered into by Juno, and the counter is stepped up to. An obedient nod is given by Juno. The questionnaire clipboard is taken by Juno to a padded leather bench and sat down on. As the form is started to be filled in, a black woman is noticed by her, seated nearby crumbing her fingers against her clipboard. Painting her nails, another woman, another scratching her arm, and another using a nail file contribute to the crescendo of sound. Her pen is dropped by Juno. Su-Chin brightens. A park bench is sat on by them, scouring the paper. An ad is handed to pipe-smoking Juno by Leah. Bleeker lies on his bed, looking at the photo of Juno in his yearbook. A piece of cloth is clasped around by his other hand. Bleeker's solidly built double-chinned mother closes the door of his bedroom. He goes back to gazing at Juno's picture, and his class pen is brought from behind his head. In his fingers is scrunched the knickers she wore and discarded on the day they had sex. At Juno's house, Leah watches apprehensively as Juno paces in front of her dad and her stepmom. They brace themselves, Mac and Bren. Both of them are looked in the eye by Juno. A face is pulled by Leah. Her dad's bewildered gaze is met by Juno, then her head is dropped for a second before speaking. Mac shakes his head as she turns on her heels and hightails upstairs with Leah behind her. His hands are run over his face by him. Some white hydrangeas are arranged in a glass vase by a slim young woman. A glass photo frame is straightened by white cuffed hands. Some aromatic sticks are placed into a bottle by her. Mac drives his blue Previa with Juno beside him through the gates of the affluent-looking Glacial Valley estate. With a ring on the fourth finger of her left hand, the display of coffee table magazines is fanned out, two monogram tan towels are straightened, and a banister rail is wiped by her as Mac drives past a number of substantial houses set back from the road."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The locker door is covered with photos and cuttings. She grabs a folder, and some pages fall as a boy walks by. Juno grins at a friend talking to a bearded teacher. In class, Bleeker swallows Tic Tacs as Juno joins him with her folders. Another boy stands at the table, joined by a second girl. Amanda leaves Josh stunned. Bleeker hides a smile. Later, Juno dials a number, shakes the phone, and something drops. She frowns at it and vomits in an ornamental urn. Her little sister sprinkles food as Liberty Bell smiles. Juno walks past Su-Chin, stops, shrugs, and heads to the Women Now Center. A punk girl plays a game console at reception. Juno enters the lobby, approaches the counter, nods, takes a questionnaire clipboard to a padded bench, and starts filling it out. She notices a woman crumbling her fingers against her clipboard, while others paint nails, scratch, or file, adding to the noise. Juno drops her pen as Su-Chin brightens. They scour a paper on a bench. Leah gives pipe-smoking Juno an ad. Bleeker lies on his bed, looking at Juno's yearbook photo and holding a piece of cloth. His mother closes his bedroom door. He returns to gazing at Juno’s picture, holding the knickers she wore the day they had sex. At Juno's house, Leah watches as Juno paces before her dad and stepmom. Mac and Bren brace themselves. Juno faces them, meets her dad's confused gaze, then drops her head before speaking. Mac shakes his head as Juno heads upstairs with Leah behind. He runs his hands over his face. A young woman arranges hydrangeas in a vase, straightens a photo frame, and places aromatic sticks in a bottle. Mac, with Juno, drives through the Glacial Valley estate. A woman with a ring arranges magazines, straightens towels, and wipes a rail as Mac passes substantial houses."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The locker door is covered in photos and cuttings. She grabs a folder, dropping pages as a boy passes. Juno grins at a friend talking to a bearded teacher. In class, Bleeker swallows Tic Tacs as Juno joins him with folders. Another boy and a girl appear. Amanda leaves Josh speechless. Bleeker hides a smile. Later, Juno dials a number, shakes the phone, frowning as something falls out. Juno vomits in an urn. Her sister sprinkles food, and Liberty Bell smiles. Juno passes Su-Chin, pauses, shrugs, then heads to the Women Now Center. A punk girl plays a console in reception. Juno enters, nods, takes a clipboard to a bench, and starts the form. She notices a black woman crumbing her fingers, as others create a crescendo with grooming sounds. Juno drops her pen. Su-Chin brightens. On a park bench, Leah gives pipe-smoking Juno an ad. Bleeker, in bed, looks at Juno's yearbook photo, holding a cloth. His mother closes his bedroom door. He resumes gazing at her picture, holding her discarded knickers from their past encounter. At Juno's house, Leah watches as Juno paces before her dad and stepmom. Mac and Bren brace themselves as Juno locks eyes with them, then drops her head before speaking. Leah reacts. Juno meets her dad's confused gaze, turns, and heads upstairs with Leah. He rubs his face. A young woman arranges hydrangeas, straightens a photo frame, and places aromatic sticks into a bottle. Mac, with Juno, drives his blue Previa through Glacial Valley estate gates past substantial houses. A woman with a ring adjusts magazines, towels, and wipes a banister as they pass."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The door of the locker is thoroughly adorned with an array of photos and cuttings, giving it a colorful and eclectic appearance. As she reaches inside to pull out a folder, a few unfastened pages slip out of it and tumble to the floor, right at the exact moment when a boy happens to walk by. Juno flashes a wide grin at her friend, who is engrossed in conversation with a rather hefty, bearded teacher. Once in class, Bleeker swallows a handful of Tic Tacs just as Juno suddenly appears beside him, clutching her folders tightly. On the other side of the work table, yet another boy stands. A second girl then makes her appearance. Amanda's actions leave Josh standing there with his mouth agape in disbelief. Bleeker tries to hide a smile from forming on his lips. Later on, Juno dials a number frantically. She shakes the phone vigorously, and to her surprise, something falls out of it, causing her to frown in confusion at the device. In a dramatic manner, Juno vomits into a decorative urn. Meanwhile, Juno's little sister is seen sprinkling her food, and Liberty Bell slowly breaks into a smile. Juno trudges away, passing by Su-Chin on her way. She momentarily stops in her tracks, then simply shrugs her shoulders and continues walking towards the entrance of the Women Now Center. A punk girl, immersed in her own world, is seated in the reception area, absorbed in playing on her game console. Juno meanders into the lobby and steps up to the counter. She nods obediently in acknowledgment. She then takes the questionnaire clipboard and moves to a padded leather bench, where she sits down. As she begins to fill out the form, she becomes acutely aware of a black woman seated nearby, crumbling her fingers rhythmically against her own clipboard. The sounds of a woman painting her nails, another one scratching her arm, and yet another using a nail file contribute to the growing crescendo of noise in the room. Juno, in the frazzling cacophony, accidentally drops her pen. Su-Chin brightens noticeably. They sit together on a park bench, intently scouring the newspaper. Leah hands the pipe-smoking Juno an ad. Elsewhere, Bleeker lies sprawled on his bed, gazing intently at the photograph of Juno in his yearbook. In his other hand, he clasps a small piece of cloth. Bleeker's robust, double-chinned mother quietly closes the door to his bedroom. He returns his gaze to Juno's image and retrieves his class pen from behind his head. Scrunched tightly in his fingers are the knickers she had worn and left behind on the day they had sex. Back at Juno's house, Leah watches with nervous anticipation as Juno paces back and forth in front of her dad and her stepmom. Mac and Bren brace themselves for the conversation. Juno looks both of them directly in the eye. Leah contorts her face into a grimace. Juno meets her dad’s puzzled gaze and lets her head drop momentarily, before finally speaking. Mac shakes his head as she turns on her heels and quickly ascends the stairs with Leah right behind her. He runs his hands wearily over his face. Nearby, a slim young woman diligently arranges some white hydrangeas in a pristine glass vase. Her white-cuffed hands carefully straighten a glass photo frame. She places some aromatic sticks into a decorative bottle. Mac, with Juno seated beside him, drives his blue Previa through the gates of the affluent-looking Glacial Valley estate. With a ring adorning the fourth finger of her left hand, she elegantly fans out a display of coffee table magazines, straightens two monogrammed tan towels, and wipes a banister rail as Mac's vehicle passes by a number of grand, substantial houses set back from the road."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The door of the locker is thoroughly adorned with a captivating array of photos and cuttings, each one contributing to its vibrant, colorful, and eclectic overall appearance. As she reaches inside the locker to extract a folder, several unfastened pages suddenly slip out of it and flutter to the floor, coincidentally at the precise moment when a boy happens to be walking by. Juno beams a wide grin at her friend, who is currently deeply engrossed in conversation with a rather hefty, bearded teacher. Once in the class, Bleeker quickly swallows a handful of Tic Tacs just as Juno appears unexpectedly beside him, tightly clutching her collection of folders. On the opposite side of the work table, another boy is standing. Subsequently, a second girl makes her presence known. Amanda's actions leave Josh standing there, with his mouth agape, in utter disbelief. Bleeker attempts to hide a smile that is threatening to form on his lips. Later on, Juno dials a number frantically, shaking the phone vigorously, and to her surprise, something falls out of it, causing her to frown in puzzled confusion at the device. In a dramatic moment, Juno then vomits into a decorative urn. Meanwhile, Juno's little sister is seen sprinkling her food, and Liberty Bell gradually breaks into a smile. Juno trudges away, passing by Su-Chin on her path. She pauses momentarily in her tracks, then simply shrugs her shoulders and continues walking determinedly towards the entrance of the Women Now Center. A punk girl, completely immersed in her own world, is seated in the reception area, absorbed in playing a game on her console. Juno meanders into the lobby and steps up to the counter, nodding obediently in acknowledgment. She then takes hold of the questionnaire clipboard and moves over to a padded leather bench, where she sits herself down. As she begins to fill out the form, she becomes acutely aware of a black woman seated nearby, her fingers crumbling rhythmically against her own clipboard. The sounds of a woman painting her nails, another scratching her arm, and yet another methodically using a nail file contribute to the growing crescendo of noise filling the room. Juno, caught in the frazzling cacophony, accidentally drops her pen. Su-Chin brightens noticeably. They sit together on a park bench, intently scouring the pages of the newspaper. Leah hands the pipe-smoking Juno an ad. Elsewhere, Bleeker lies sprawled comfortably on his bed, gazing with intensity at Juno's photograph in his yearbook. In his other hand, he clasps a small piece of cloth. Bleeker's robust, double-chinned mother quietly closes the door to his bedroom. He returns his attentive gaze to Juno's image and retrieves his class pen from behind his head. Tightly scrunched in his fingers are the knickers she had worn and left behind on the day they had been intimate. Back at Juno's house, Leah watches with nervous anticipation as Juno paces back and forth in front of her dad and her stepmom. Mac and Bren brace themselves mentally for the upcoming conversation. Juno looks both of them directly in the eye. Leah contorts her face into a grimace. Juno meets her dad’s puzzled gaze and momentarily lets her head drop before finally speaking. Mac shakes his head as she turns on her heels and quickly ascends the stairs with Leah right behind her. He runs his hands wearily over his face. Nearby, a slim young woman is diligently arranging some white hydrangeas in a pristine glass vase. Her white-cuffed hands carefully straighten a glass photo frame. She places some aromatic sticks into a decorative bottle. Meanwhile, Mac, with Juno seated beside him, drives his blue Previa through the gates of the affluent-looking Glacial Valley estate. With a ring prominently adorning the fourth finger of her left hand, she elegantly fans out a display of coffee table magazines, straightens two monogrammed tan towels, and wipes a banister rail as Mac's vehicle glides by a number of grand, substantial houses modestly set back from the road."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The locker door is covered with an assortment of photos and cuttings, creating a collage of memories and inspirations. She reaches into the locker, grasping a folder, but as she pulls it out, several pages slip from her grasp and cascade to the floor just as a boy walks by, momentarily glancing at the scene. Juno, standing nearby, can't help but grin as she observes her friend engaging in animated conversation with a rotund, bearded teacher. In class, Bleeker, feeling the need to refresh his breath, quickly swallows a handful of Tic Tacs. At that moment, Juno appears by his side, her arms burdened with folders. Another boy positions himself on the opposite side of the shared work table, creating a slight sense of symmetry. A second girl joins the group, contributing to the social dynamic. Amid this, Amanda makes a statement that leaves Josh speechless, his mouth agape in astonishment. Bleeker's lips twitch slightly as he suppresses a smile at the unfolding drama. Later, Juno firmly dials a number on her phone, only to find herself shaking it vigorously in frustration when something unexpectedly falls out. She directs a frown at the device, perplexed by its malfunction. In a sudden turn of events, Juno finds herself rushing to a decorative urn, where she unceremoniously throws up. Elsewhere, Juno's little sister casually sprinkles something on her food, exhibiting a carefree attitude. Liberty Bell, witnessing the scene, lets a slow smile spread across her face as if savoring a private joke. With a sense of determination, Juno trudges past Su-Chin, her steps heavy and deliberate. Suddenly, she halts, as if a thought strikes her mid-stride. She gives a small, nonchalant shrug and continues her journey, heading toward the entrance of the Women Now Center. Inside, a punk girl lounges in reception, absorbed in her game console, fingers deftly manipulating the buttons. Juno meanders into the lobby, taking in her surroundings before approaching the counter with purpose. She nods in acknowledgment of the instructions given, her expression one of compliance. Armed with a clipboard holding a questionnaire, Juno finds a padded leather bench and settles down to begin her task. As she fills in the form, she becomes acutely aware of a black woman nearby, who is methodically crumbing her fingers against her own clipboard, creating a rhythmic pattern. The soundscape is further enriched by another woman meticulously painting her nails, a third scratching her arm with slight agitation, and a fourth using a nail file in smooth strokes, all contributing to an ensemble of subtle noises. Distracted, Juno drops her pen, which alerts Su-Chin to the moment, causing her face to brighten. They later find themselves sitting together on a park bench, eyes scanning the newspaper for information of interest. As Leah hands Juno, who is engrossed in smoking a pipe, an ad, a scene unfolds elsewhere with Bleeker lying on his bed. He stares intently at the photo of Juno in his yearbook, his eyes tracing familiar features. In his other hand, he holds a scrap of cloth, a tangible memory of their shared intimacy. His solidly built, double-chinned mother enters briefly, only to close the door softly behind her. Left alone, Bleeker returns to his contemplation of Juno's image and reaches for his class pen, which he stores behind his head. Clutched in his fingers are the knickers she discarded on the day of their encounter, a souvenir laden with significance. In another setting, at Juno's house, Leah stands by, watching with a mix of anticipation and anxiety as Juno paces nervously before her dad and stepmom, Mac and Bren. The parents brace themselves for whatever revelation is about to come. Juno bravely makes eye contact with both of them, facing the reality of the situation. Leah, observing the tension, can't help but make a face in reaction. Juno finally breaks the intense gaze she shares with her dad, allowing her head to drop momentarily before gathering the words she needs to say. Mac shakes his head in a mix of disbelief and resignation as Juno swiftly turns on her heels, making a speedy exit upstairs with Leah trailing closely behind. Left to process the encounter, Mac draws his hands over his face in a gesture of weariness. Meanwhile, a slim young woman elsewhere carefully arranges white hydrangeas in a glass vase, ensuring each blossom is perfectly positioned. Her white cuffed hands methodically straighten a glass photo frame, aligning it just so. She deftly places aromatic sticks into a bottle, adding to the ambiance. Mac, with Juno at his side, drives his blue Previa through the gates of the upscale Glacial Valley estate, marked by its affluence. As they move past the well-appointed houses set back from the road, a woman with a ring glinting on the fourth finger of her left hand gracefully fans out a collection of coffee table magazines, ensuring they are visually appealing. She efficiently straightens two monogrammed tan towels before her gaze turns to the banister rail, which she wipes meticulously, every action contributing to the pristine environment as Mac continues to navigate through the neighborhood."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The locker door is covered with photos and cuttings as she retrieves a folder, dropping some pages accidentally when a boy passes by. Juno grins at her friend conversing with a bearded teacher. In class, Bleeker swallows Tic Tacs as Juno joins him, holding her folders. Another boy and a girl join them at the work table, leaving Amanda to surprise Josh, while Bleeker hides a smile. Later, Juno dials a number, shakes the phone until something falls out, and frowns. She then rushes to a decorative urn to vomit while her little sister, Liberty Bell, sprinkles her food and smiles slowly. Juno walks past Su-Chin, pausing briefly before continuing toward the Women Now Center. Inside, a punk girl plays on a console in reception as Juno approaches the counter, nods, and takes a questionnaire to a bench. As she begins filling it out, she notices the ambient sounds of others around her, dropping her pen in distraction. Outside, she sits on a park bench with Su-Chin, examining the paper as Leah hands Juno an ad. Meanwhile, Bleeker lies on his bed, looking at Juno's photo in his yearbook while holding a piece of cloth. His mother closes his bedroom door, and he returns to gazing at Juno’s picture, clutching the knickers she discarded on the day they were intimate. At Juno's house, Leah watches anxiously as Juno faces her dad and stepmom, Mac and Bren, making eye contact before speaking. Mac shakes his head as Juno quickly leaves, followed by Leah, while he rubs his face in frustration. Elsewhere, a young woman arranges white hydrangeas and organizes decorative items. Mac drives his blue Previa through the upscale Glacial Valley estate, where a woman with a ring adjusts magazines and towels as they pass opulent houses set back from the road."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The locker door is plastered with photos and cuttings, a common practice in high schools where students personalize their space with snapshots of friends and articles from favorite magazines. She pulls out a folder and some pages fall to the floor as a boy comes by, perhaps a classmate rushing to his next lesson. Juno grins at her friend, who is deep in conversation with a fat bearded teacher, known for his engaging history lectures. In class, Bleeker swallows some Tic Tacs, the iconic small mints packaged in a distinctive box, as Juno appears by his side clutching her folders. Another boy stands on the other side of the work table, organizing his notes for the upcoming group project. A second girl turns up, joining the bustling activity of the classroom. Amanda leaves Josh open-mouthed with her sharp wit and unexpected comment. Bleeker suppresses a smile, trying to stay focused on the task at hand. Later, Juno dials a number, her fingers moving quickly from muscle memory. She vigorously shakes the phone, a model known for its occasional battery issues, and something falls out. She frowns at the phone, frustrated by its unreliability. Juno throws up in a decorative urn, a white porcelain piece adorned with blue floral patterns, catching the occupants by surprise. Juno's little sister sprinkles her food with extra salt, an old habit she picked up from their grandmother. Liberty Bell, named after the famous symbol of American independence, smiles slowly, enjoying the lively family dinner. Juno plods away past Su-Chin, a fellow student and part-time activist known for her passionate protests. Juno stops in her tracks as she realizes she forgot something important, then shrugs and walks on towards the door of the Women Now Center, a local clinic providing counseling services. A punk girl sits in reception playing on her game console, the latest handheld Nintendo device. Juno wanders into the lobby and steps up to the counter, where a receptionist hands her the necessary forms. Juno nods obediently, aware of the protocol. Juno takes the questionnaire clipboard to a padded leather bench and sits down. As she starts to fill in the form, she becomes aware of a black woman seated nearby crumbing her fingers against her clipboard, looking nervous about the appointment. A woman painting her nails, another scratching her arm, and another using a nail file add to the crescendo of sound in the waiting room. Juno drops her pen, startled by the cacophony. Su-Chin brightens, her eyes lighting up with a new idea. They sit on a park bench scouring the paper, intensely searching for interesting articles or job opportunities. Leah hands pipe-smoking Juno an ad, highlighting an event that catches their interest. Bleeker is lying on his bed, looking at the photo of Juno in his yearbook, remembering their high school days. His other hand is clasped around a piece of cloth, a sentimental token from their memorable past. Bleeker's solidly built double-chinned mother closes the door of his bedroom softly, respecting his privacy. He goes back to gazing at Juno's picture and brings his class pen, a gift from his friends, from behind his head. Scrunched in his fingers, he's holding the knickers she wore and discarded on the day they had sex, a moment both awkward and significant in their young lives. At Juno's house, Leah watches apprehensively as Juno paces in front of her dad and her stepmom, Bren, who are trying to process the situation. Mac and Bren brace themselves, preparing for what Juno has to say. Juno looks them both in the eye, gathering her courage. Leah pulls a face, worried about Juno's revelation. Juno meets her dad's bewildered gaze, then lets her head drop for a second before speaking, her voice steady but anxious. Mac shakes his head as she turns on her heels and hightails upstairs with Leah behind her, sharing a moment of silent solidarity. He runs his hands over his face, contemplating the changes ahead. A slim young woman arranges some white hydrangeas in a glass vase, adding elegance to the room. White cuffed hands straighten a glass photo frame, capturing family memories. She places some aromatic sticks into a bottle, filling the air with a soothing scent. Mac with Juno beside him drives his blue Previa through the gates of the affluent looking Glacial Valley estate, where manicured lawns and luxurious cars are part of the everyday scenery. With a ring on the fourth finger of her left hand, she fans out the display of coffee table magazines, straightens two monogram tan towels, and wipes a banister rail as Mac drives past a number of substantial houses set back from the road, showcasing the wealth that defines this neighborhood."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The locker door is plastered with photos and cuttings. She pulls out a folder and some pages fall to the floor. as a boy comes by. Juno grins at her friend talking to a fat bearded teacher. In class Bleeker swallows some Tic Tacs as Juno appears by his side clutching her folders. Another boy stands on the other side of the work table. A second girl turns up. Amanda leaves Josh openmouthed. Bleeker suppresses a smile. Later Juno dials a number. She vigorously shakes the phone and something falls out. She frowns at the phone. Juno throws up in a decorative urn. Juno's little sister sprinkles her food. Liberty Bell smiles slowly. Juno plods away past SuChin. Juno stops in her tracks. She shrugs and walks on towards the door of the Women Now Center. A punk girl sits in reception playing on her game console. Juno wanders into the lobby and steps up to the counter. Juno nods obediently. Juno takes the questionnaire clipboard to a padded leather bench and sits down. As she starts to fill in the form she becomes aware of a black woman seated nearby crumbing her fingers against her clipboard. A woman painting her nails another scratching her arm another using a nail file. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. add to the crescendo of sound. Juno drops her pen. SuChin brightens. They sit on a park bench scouring the paper. Leah hands pipesmoking Juno an ad. Bleeker is lying on his bed looking at the photo of Juno in his yearbook. His other hand is clasped around a piece of cloth. Bleeker's solidly built doublechinned mother closes the door of his bedroom. He goes back to gazing at Juno's picture and brings his class pen from behind his head. Scrunched in his fingers he is holding the knickers she wore and discarded on the day they had sex. At Juno's house Leah watches apprehensively as Juno paces in front of her dad and her stepmom. Mac and Bren brace themselves. Juno looks them both in the eye. Leah pulls a face. Juno meets her dad's bewildered gaze. then let us her head drop for a second before speaking. Mac shakes his head as she turns on her heels and hightails upstairs with Leah behind her. He runs his hands over his face. A slim young woman arranges some white hydrangeas in a glass vase. White cuffed hands straighten a glass photo frame. She places some aromatic sticks into a bottle. Mac with Juno beside him drives his blue Previa through the gates of the affluent looking Glacial Valley estate. With a ring on the fourth finger of her left hand she fans out the display of coffee table. magazines straightens two monogram tan towels and wipes a banister rail. as Mac drives past a number of substantial houses set back from the road."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The locker door is plastered with photos and cuttings. She pulls out a folder and some pages fall to the floor. as a boy comes by. Juno grins at her friend talking to a fat bearded teacher. In class Bleeker swallows some Tic Tacs as Juno appears by his side clutching her folders. Another boy stands on the other side of the work table. A second girl turns up. Amanda leaves Josh openmouthed. Bleeker suppresses a smile. Later Juno dials a number. She vigorously shakes the phone and something falls out. She frowns at the phone. Juno throws up in a decorative urn. Juno's little sister sprinkles her food. Liberty Bell smiles slowly. Juno plods away past SuChin. Juno stops in her tracks. She shrugs and walks on towards the door of the Women Now Center. A punk girl sits in reception playing on her game console. Juno wanders into the lobby and steps up to the counter. Juno nods obediently. Juno takes the questionnaire clipboard to a padded leather bench and sits down. As she starts to fill in the form she becomes aware of a black woman seated nearby crumbing her fingers against her clipboard. A woman painting her nails another scratching her arm another using a nail file. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. add to the crescendo of sound. Juno drops her pen. SuChin brightens. They sit on a park bench scouring the paper. Leah hands pipesmoking Juno an ad. Bleeker is lying on his bed looking at the photo of Juno in his yearbook. His other hand is clasped around a piece of cloth. Bleeker's solidly built doublechinned mother closes the door of his bedroom. He goes back to gazing at Juno's picture and brings his class pen from behind his head. Scrunched in his fingers he is holding the knickers she wore and discarded on the day they had sex. At Juno's house Leah watches apprehensively as Juno paces in front of her dad and her stepmom. Mac and Bren brace themselves. Juno looks them both in the eye. Leah pulls a face. Juno meets her dad's bewildered gaze. then let us her head drop for a second before speaking. Mac shakes his head as she turns on her heels and hightails upstairs with Leah behind her. He runs his hands over his face. A slim young woman arranges some white hydrangeas in a glass vase. White cuffed hands straighten a glass photo frame. She places some aromatic sticks into a bottle. Mac with Juno beside him drives his blue Previa through the gates of the affluent looking Glacial Valley estate. With a ring on the fourth finger of her left hand she fans out the display of coffee table. magazines straightens two monogram tan towels and wipes a banister rail. as Mac drives past a number of substantial houses set back from the road."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The locker door is plastered with photos and cuttings. She pulls out a folder and some pages fall to the floor. as a boy comes by. Juno grins at her friend talking to a fat bearded teacher. In class Bleeker swallows some Tic Tacs as Juno appears by his side clutching her folders. Another boy stands on the other side of the work table. A second girl turns up. Amanda leaves Josh openmouthed. Bleeker suppresses a smile. Later Juno dials a number. She vigorously shakes the phone and something falls out. She frowns at the phone. Juno looks them both in the eye. Leah pulls a face. Juno meets her dad's bewildered gaze. then let us her head drop for a second before speaking. Mac shakes his head as she turns on her heels and hightails upstairs with Leah behind her. He runs his hands over his face. A slim young woman arranges some white hydrangeas in a glass vase. White cuffed hands straighten a glass photo frame. She places some aromatic sticks into a bottle. Mac with Juno beside him drives his blue Previa through the gates of the affluent looking Glacial Valley estate. With a ring on the fourth finger of her left hand she fans out the display of coffee table. magazines straightens two monogram tan towels and wipes a banister rail. as Mac drives past a number of substantial houses set back from the road."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The locker door is plastered with photos and cuttings. She pulls out a folder and some pages fall to the floor. as a boy comes by. Juno grins at her friend talking to a fat bearded teacher. In class Bleeker swallows some Tic Tacs as Juno appears by his side clutching her folders. She places some aromatic sticks into a bottle. Mac with Juno beside him drives his blue Previa through the gates of the affluent looking Glacial Valley estate. With a ring on the fourth finger of her left hand she fans out the display of coffee table. magazines straightens two monogram tan towels and wipes a banister rail. as Mac drives past a number of substantial houses set back from the road."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The ceiling hatch is covered with sketches and carvings. He extracts a widget and some marbles tumble to the carpet as a girl strolls past. Milo chuckles at his buddy whispering to a skinny tattooed dancer. In the workshop, Skipper gulps down some jelly beans as Milo manifests by her shoulder clutching his binders. A girl lingers on the opposite side of the garden fence. A third boy shows up. Oliver departs Daisy tongue-tied. Skipper masks a giggle. Later, Milo punches in a code. He vigorously taps the remote and something pops out. He glowers at the remote. Milo spills juice into a crystalline goblet. Milo's older brother sprinkles his cereal. Liberty Cap grins slowly. Milo trudges away past Ka-Chow. Milo pauses mid-step. He shrugs and strolls onward towards the gateway of the Creators Here Hub. A goth teenager lounges in arrival, tapping on her tablet. Milo meanders into the atrium and climbs up to the lectern. Milo grins obediently. Milo takes the survey brochure to a velvet-lined stool and settles down. As he begins to scribble on the sheet, he notices a tall man seated nearby drumming his thumbs against his pamphlet. A man braiding his hair, another tapping his foot, another twiddling a bracelet add to the symphony of noise. Milo drops his pencil. Ka-Chow beams. They perch on a grassy knoll scanning the catalog. Jenna hands newspaper-reading Milo a flyer. Skipper is sprawled on her hammock, peering at the drawing of Milo in her scrapbook. Her other foot is entangled in a piece of string. Skipper's wiry-framed pear-shaped brother shuts the curtain of her dormitory. She resumes peering at Milo's image and retrieves her sketching marker from behind her ear. Tangled in her toes, she's clutching the mittens he wore and relinquished on the afternoon they danced. At Milo’s mansion, Jenna observes nervously as Milo struts before her uncle and her aunt. Joe and Bea ready themselves. Milo stares them both in the chin. Jenna makes a grimace. Milo catches her uncle's puzzled expression, then dips her head briefly before uttering a word. Joe shakes his ears as she pivots and scampers upstairs with Jenna tailing her. He brushes his ears with his hands. A robust old gentleman arranges some yellow lilies in a metal bucket. Black sleeved elbows polish a metal mirror stand. He places some fragrant candles into a pot. Joe with Milo beside him maneuvers his green scooter through the archway of the sprawling humble Dusty Field subdivision. With a bracelet on the third finger of her right hand, she arranges the stack of board game boxes, aligns three initialed teal coasters, and dusts a lamp post as Joe cruises past a plethora of quaint cottages tucked away from the lane."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The locker door is filled with photos as Juno pulls out a folder, dropping some pages. She grins at her friend talking to a teacher. In class, Bleeker swallows Tic Tacs beside Juno. Later, Juno dials a number, shakes the phone, and frowns when something falls out. Feeling unwell, she vomits in an urn. Juno's sister smiles as Juno walks away and heads to the Women Now Center. There, a punk girl is gaming, and Juno sits with a questionnaire, aware of others around her. Dropping her pen, she and Su-Chin scour a paper. Leah gives Juno an ad while Bleeker, in his room, gazes at Juno's photo, holding a piece of cloth. His mother closes his door as he reminisces about their past encounter. At Juno's house, Leah watches Juno confront her parents. Juno meets her dad’s bewildered gaze and then goes upstairs with Leah. Mac and Juno later drive through the upscale Glacial Valley estate, observing the luxurious surroundings."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "as Mac drives past a number of substantial houses set back from the road magazines straightens two monogram tan towels and wipes a banister rail With a ring on the fourth finger of her left hand she fans out the display of coffee table Mac with Juno beside him drives his blue Previa through the gates of the affluent looking Glacial Valley estate She places some aromatic sticks into a bottle White cuffed hands straighten a glass photo frame A slim young woman arranges some white hydrangeas in a glass vase He runs his hands over his face Mac shakes his head as she turns on her heels and hightails upstairs with Leah behind her then let us her head drop for a second before speaking Juno meets her dad's bewildered gaze Leah pulls a face Juno looks them both in the eye Mac and Bren brace themselves At Juno's house Leah watches apprehensively as Juno paces in front of her dad and her stepmom Scrunched in his fingers he is holding the knickers she wore and discarded on the day they had sex He goes back to gazing at Juno's picture and brings his class pen from behind his head Bleeker's solidly built doublechinned mother closes the door of his bedroom His other hand is clasped around a piece of cloth Bleeker is lying on his bed looking at the photo of Juno in his yearbook Leah hands pipesmoking Juno an ad They sit on a park bench scouring the paper SuChin brightens Juno drops her pen add to the crescendo of sound A woman painting her nails another scratching her arm another using a nail file As she starts to fill in the form she becomes aware of a black woman seated nearby crumbing her fingers against her clipboard Juno takes the questionnaire clipboard to a padded leather bench and sits down Juno nods obediently Juno wanders into the lobby and steps up to the counter A punk girl sits in reception playing on her game console She shrugs and walks on towards the door of the Women Now Center Juno stops in her tracks Juno plods away past SuChin Liberty Bell smiles slowly Juno's little sister sprinkles her food Juno throws up in a decorative urn She frowns at the phone She vigorously shakes the phone and something falls out Later Juno dials a number Bleeker suppresses a smile Amanda leaves Josh openmouthed A second girl turns up Another boy stands on the other side of the work table In class Bleeker swallows some Tic Tacs as Juno appears by his side clutching her folders Juno grins at her friend talking to a fat bearded teacher as a boy comes by She pulls out a folder and some pages fall to the floor The locker door is plastered with photos and cuttings"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "She pulls out a folder and some pages fall to the floor The locker door is plastered with photos and cuttings In class Bleeker swallows some Tic Tacs as Juno appears by his side clutching her folders as a boy comes by Juno grins at her friend talking to a fat bearded teacher A second girl turns up Another boy stands on the other side of the work table Bleeker suppresses a smile Amanda leaves Josh openmouthed She vigorously shakes the phone and something falls out Later Juno dials a number Juno throws up in a decorative urn She frowns at the phone Liberty Bell smiles slowly Juno's little sister sprinkles her food Juno stops in her tracks Juno plods away past SuChin A punk girl sits in reception playing on her game console She shrugs and walks on towards the door of the Women Now Center Juno nods obediently Juno wanders into the lobby and steps up to the counter As she starts to fill in the form she becomes aware of a black woman seated nearby crumbing her fingers against her clipboard Juno takes the questionnaire clipboard to a padded leather bench and sits down add to the crescendo of sound A woman painting her nails another scratching her arm another using a nail file SuChin brightens Juno drops her pen Leah hands pipesmoking Juno an ad They sit on a park bench scouring the paper His other hand is clasped around a piece of cloth Bleeker is lying on his bed looking at the photo of Juno in his yearbook He goes back to gazing at Juno's picture and brings his class pen from behind his head Bleeker's solidly built doublechinned mother closes the door of his bedroom At Juno's house Leah watches apprehensively as Juno paces in front of her dad and her stepmom Scrunched in his fingers he is holding the knickers she wore and discarded on the day they had sex Juno looks them both in the eye Mac and Bren brace themselves Juno meets her dad's bewildered gaze Leah pulls a face Mac shakes his head as she turns on her heels and hightails upstairs with Leah behind her then let us her head drop for a second before speaking A slim young woman arranges some white hydrangeas in a glass vase He runs his hands over his face She places some aromatic sticks into a bottle White cuffed hands straighten a glass photo frame With a ring on the fourth finger of her left hand she fans out the display of coffee table Mac with Juno beside him drives his blue Previa through the gates of the affluent looking Glacial Valley estate as Mac drives past a number of substantial houses set back from the road magazines straightens two monogram tan towels and wipes a banister rail"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Juno drops her pen SuChin brightens They sit on a park bench scouring the paper Leah hands pipesmoking Juno an ad Bleeker is lying on his bed looking at the photo of Juno in his yearbook His other hand is clasped around a piece of cloth Bleeker's solidly built doublechinned mother closes the door of his bedroom He goes back to gazing at Juno's picture and brings his class pen from behind his head Scrunched in his fingers he is holding the knickers she wore and discarded on the day they had sex At Juno's house Leah watches apprehensively as Juno paces in front of her dad and her stepmom Mac and Bren brace themselves Juno looks them both in the eye Leah pulls a face Juno meets her dad's bewildered gaze then let us her head drop for a second before speaking Mac shakes his head as she turns on her heels and hightails upstairs with Leah behind her He runs his hands over his face A slim young woman arranges some white hydrangeas in a glass vase White cuffed hands straighten a glass photo frame She places some aromatic sticks into a bottle Mac with Juno beside him drives his blue Previa through the gates of the affluent looking Glacial Valley estate With a ring on the fourth finger of her left hand she fans out the display of coffee table magazines straightens two monogram tan towels and wipes a banister rail as Mac drives past a number of substantial houses set back from the road The locker door is plastered with photos and cuttings She pulls out a folder and some pages fall to the floor as a boy comes by Juno grins at her friend talking to a fat bearded teacher In class Bleeker swallows some Tic Tacs as Juno appears by his side clutching her folders Another boy stands on the other side of the work table A second girl turns up Amanda leaves Josh openmouthed Bleeker suppresses a smile Later Juno dials a number She vigorously shakes the phone and something falls out She frowns at the phone Juno throws up in a decorative urn Juno's little sister sprinkles her food Liberty Bell smiles slowly Juno plods away past SuChin Juno stops in her tracks She shrugs and walks on towards the door of the Women Now Center A punk girl sits in reception playing on her game console Juno wanders into the lobby and steps up to the counter Juno nods obediently Juno takes the questionnaire clipboard to a padded leather bench and sits down As she starts to fill in the form she becomes aware of a black woman seated nearby crumbing her fingers against her clipboard A woman painting her nails another scratching her arm another using a nail file add to the crescendo of sound"
        }
      ]
    }
  ]
}