{
  "ground_truth": "As she runs up to the Lorings' front door, she smoothes down the hem of the skirt she wears over her jeans and peers in through one of the two oval leaded windows. She shows Mark the image. Mark seems to lose himself in the music, then he looks at Juno. Juno notices a VHS. He snatches the tape from her, and they watch the film where a sinister man drives a stake through a woman's stomach. Juno shows Vanessa the picture, and Vanessa studies the image lengthwise and sideways, then looks across at Mark, who shrugs brutally. Vanessa stands with her arms tightly folded. He places Juno's bag over her shoulder and opens the door to let her out. Vanessa gives her husband a tight smile. It's dark by the time Juno arrives home, sipping from a drinks carton. Bren is cutting out pictures of dogs, and as Bren goes back to her paper dogs, Juno pours the dregs of her drink into Bren's ornament. Outside, on the snowy street, Juno stops the Previa and eases off her grey overskirt. Bleeker's mother opens her front door, and Juno races up the stairs, outrunning Bleeker's mother and getting to Bleeker's room before her. Bleeker reaches for a box. Juno eases herself into a chair with her legs apart and slides onto the floor next to him. They both look away awkwardly, and Juno suddenly looks glum. At her home, Vanessa, in an old T-shirt with her hair pulled back in a ponytail, stands before a bare wall. Mark, standing next to her with his arms folded, looks glum. Playing nervously with the chain around her neck, Vanessa turns to the wall behind her, and Mark stares bleakly at the wall. Juno and Leah are in the mall, crouching down behind a glass balcony. Vanessa is joking around with a friend's little girl in the mall play area. Leah sucks in her cheeks, stands up, and looks elsewhere, but Juno stays where she is, gazing down at Vanessa playing with the little girl, and a soft smile spreads across her face. They walk into Vanessa, who shakes her head in awe. Juno winces and then plants Vanessa's hand on her belly. Vanessa shakes her head, and her beautiful sculpted face tightens self-consciously. Then, she drops to her knees in front of Juno, and with a nervous glance about her, she places her hands on Juno's belly. Her eyes widen excitedly, and Juno, standing over her, watches her with a mixture of fondness and pride as Vanessa gazes at the swollen belly like a love-struck puppy. Bren, at the sewing machine, cuts the top of a pair of jeans and sews on an elasticated band, giving a satisfied smile as she tests the elastic.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "As she dashes up to the Lorings' entrance door, she smoothes down the edge of the skirt she wears over her denim and peers in through one of the two oval leaded panes. She displays Mark the picture. Mark appears to lose himself in the melody, then he glances at Juno. Juno observes a VHS. He grabs the cassette from her, and they watch the movie where a sinister man drives a stake through a woman's abdomen. Juno shows Vanessa the snapshot, and Vanessa examines the image lengthwise and sideways, then looks across at Mark, who shrugs harshly. Vanessa stands with her arms tightly folded. He places Juno's bag over her shoulder and opens the door to let her out. Vanessa gives her spouse a tight smile. It's dark by the time Juno gets home, sipping from a drinks carton. Bren is cutting out images of canines, and as Bren returns to her paper canines, Juno pours the remnants of her drink into Bren's ornament. Outside, on the snowy road, Juno halts the Previa and eases off her grey overskirt. Bleeker's mother opens her entrance door, and Juno races up the stairs, outrunning Bleeker's mother and getting to Bleeker's room prior to her. Bleeker reaches for a box. Juno lowers herself into a chair with her legs apart and slides onto the floor next to him. They both look away awkwardly, and Juno suddenly looks melancholy. At her residence, Vanessa, in an old T-shirt with her hair pulled back in a ponytail, stands before a bare wall. Mark, standing next to her with his arms folded, looks melancholy. Playing nervously with the chain around her neck, Vanessa turns to the wall behind her, and Mark stares bleakly at the wall. Juno and Leah are in the mall, crouching down behind a glass railing. Vanessa is joking around with a friend's little girl in the mall play area. Leah sucks in her cheeks, stands up, and looks elsewhere, but Juno stays where she is, gazing down at Vanessa playing with the little girl, and a soft smile spreads across her face. They walk into Vanessa, who shakes her head in wonder. Juno winces and then plants Vanessa's hand on her belly. Vanessa shakes her head, and her beautiful sculpted face tightens self-consciously. Then, she drops to her knees in front of Juno, and with a nervous glance about her, she places her hands on Juno's belly. Her eyes widen excitedly, and Juno, standing over her, watches her with a mixture of fondness and pride as Vanessa gazes at the swollen belly like a love-struck puppy. Bren, at the sewing machine, cuts the top of a pair of jeans and sews on an elasticated band, giving a satisfied smile as she tests the elastic."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "As she runs up to the Lorings' front door, the hem of the skirt she wears over her jeans is smoothed down by her, and one of the two oval leaded windows is peered through by her. The image is shown to Mark by her. Mark seems to lose himself in the music; then Juno is looked at by him. A VHS is noticed by Juno. The tape is snatched from her by him, and the film where a sinister man drives a stake through a woman's stomach is watched by them. The picture is shown to Vanessa by Juno, and the image is studied lengthwise and sideways by Vanessa, then she looks across at Mark, who brutally shrugs. Vanessa stands with her arms tightly folded. Juno's bag is placed over her shoulder by him, and the door is opened by him to let her out. A tight smile is given by Vanessa to her husband. It's dark by the time Juno arrives home, sipping from a drinks carton. Pictures of dogs are cut out by Bren, and as Bren goes back to her paper dogs, the dregs of her drink are poured by Juno into Bren's ornament. Outside, on the snowy street, the Previa is stopped by Juno, and her grey overskirt is eased off by her. Bleeker's mother opens her front door, and the stairs are raced up by Juno, outrunning Bleeker's mother and getting to Bleeker's room before her. A box is reached for by Bleeker. Juno eases herself into a chair with her legs apart and slides onto the floor next to him. They both look away awkwardly, and Juno suddenly looks glum. At her home, Vanessa, in an old T-shirt with her hair pulled back in a ponytail, stands before a bare wall. Mark, standing next to her with his arms folded, looks glum. Playing nervously with the chain around her neck, the wall behind her is turned to by Vanessa, and the wall is stared at bleakly by Mark. Juno and Leah are in the mall, crouching down behind a glass balcony. Vanessa is joking around with a friend's little girl in the mall play area. Leah sucks in her cheeks, stands up, and looks elsewhere, but Vanessa is stayed gazed down at by Juno, playing with the little girl, and a soft smile spreads across her face. They walk into Vanessa, who shakes her head in awe. A wince is given by Juno, and then Vanessa's hand is planted on her belly by her. Vanessa shakes her head, and her beautiful sculpted face tightens self-consciously. Then, she drops to her knees in front of Juno, and with a nervous glance about her, her hands are placed on Juno's belly. Her eyes widen excitedly, and Juno, standing over her, watches her with a mixture of fondness and pride as Vanessa gazes at the swollen belly like a love-struck puppy. Bren, at the sewing machine, cuts the top of a pair of jeans and sews on an elasticated band, giving a satisfied smile as the elastic is tested by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "As she approaches the Lorings' front door, she smoothes her skirt over her jeans and peers through an oval leaded window. She shows Mark an image, and he loses himself in the music before looking at Juno. Juno notices a VHS, and they watch a film where a sinister man drives a stake through a woman's stomach. Juno shows Vanessa the picture, and Vanessa examines it, then looks at Mark, who shrugs. Vanessa stands with folded arms. He places Juno's bag over her shoulder and opens the door for her. Vanessa gives her husband a tight smile. It's dark when Juno arrives home, sipping from a drink carton. Bren is cutting out pictures of dogs, and Juno pours her drink's dregs into Bren's ornament. Outside, Juno stops the Previa and removes her grey overskirt. Bleeker's mother opens her door, and Juno races upstairs, reaching Bleeker's room first. Bleeker reaches for a box, and Juno slides onto the floor next to him. They look away awkwardly, and Juno suddenly looks glum. At home, Vanessa, in an old T-shirt with her hair in a ponytail, stands before a bare wall. Mark, next to her with folded arms, looks glum. Vanessa nervously plays with her necklace and turns to the wall, while Mark stares bleakly. Juno and Leah are in the mall, crouching behind a glass balcony. Vanessa jokes with a friend's little girl in the play area. Leah stands up and looks elsewhere, but Juno stays, smiling softly at Vanessa. They walk to Vanessa, who shakes her head in awe. Juno winces and places Vanessa's hand on her belly. Vanessa's face tightens self-consciously, then she kneels and places her hands on Juno's belly, eyes widening excitedly. Juno watches with fondness and pride as Vanessa gazes at her belly like a love-struck puppy. Bren, at the sewing machine, cuts jeans and sews on an elastic band, smiling as she tests it."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Juno smoothes her skirt over jeans and peers through the Lorings' window. She shows Mark an image, and he loses himself in music before noticing a VHS. He grabs the tape, and they watch a sinister film. Juno shows Vanessa the picture; Vanessa studies it and looks at Mark, who shrugs. Vanessa stands with folded arms. Mark places Juno's bag on her shoulder and opens the door. Vanessa gives a tight smile. Juno arrives home in the dark, sipping a drink. Bren cuts out dog pictures, and Juno pours her drink's dregs into Bren's ornament. Outside, Juno removes her overskirt. At Bleeker's, she races upstairs, reaching his room first. They sit awkwardly, and Juno looks glum. At home, Vanessa, in an old T-shirt, stands before a bare wall with Mark, both looking glum. Vanessa nervously plays with her necklace. At the mall, Juno and Leah crouch behind a balcony, watching Vanessa play with a child. Juno smiles softly. They approach Vanessa, who shakes her head. Juno places Vanessa's hand on her belly. Vanessa kneels, excitedly touching Juno's belly, while Juno watches with fondness. Bren sews an elastic band onto jeans, smiling as she tests it."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As she hurriedly runs up to the Lorings' front door, she takes a moment to smooth down the hem of the skirt she is wearing over her jeans. She then peers in through one of the two oval leaded windows, trying to catch a glimpse inside. She proceeds to show Mark the image she has brought. Mark seems to become completely absorbed in the music, losing himself in its rhythm, before he turns his attention back to Juno. Juno's eyes catch sight of a VHS tape. He quickly snatches the tape from her grasp, and together they watch the film, which features a sinister man driving a stake through a woman's stomach. Juno then shows Vanessa the picture, and Vanessa examines the image both lengthwise and sideways, scrutinizing it carefully before glancing across at Mark, who responds with a brutal shrug. Vanessa stands there with her arms tightly folded across her chest. He places Juno's bag over her shoulder and opens the door to let her out. Vanessa gives her husband a tight, restrained smile. By the time Juno arrives home, it is already dark outside, and she is sipping from a drinks carton. Bren is busy cutting out pictures of dogs, and as Bren returns to her paper dogs, Juno pours the remaining dregs of her drink into one of Bren's ornaments. Outside, on the snowy street, Juno stops the Previa and carefully eases off her grey overskirt. Bleeker's mother opens her front door, and Juno races up the stairs, managing to outrun Bleeker's mother and reaching Bleeker's room before she does. Bleeker reaches for a box, and Juno eases herself into a chair, sitting with her legs apart before sliding onto the floor next to him. They both look away awkwardly, and Juno suddenly appears glum. At her own home, Vanessa, dressed in an old T-shirt with her hair pulled back in a ponytail, stands before a bare wall. Mark, standing next to her with his arms folded, also looks glum. Playing nervously with the chain around her neck, Vanessa turns to face the wall behind her, while Mark stares bleakly at the same wall. Juno and Leah are at the mall, crouching down behind a glass balcony. Vanessa is joking around with a friend's little girl in the mall's play area. Leah sucks in her cheeks, stands up, and looks elsewhere, but Juno remains where she is, gazing down at Vanessa as she plays with the little girl, and a soft smile gradually spreads across her face. They walk over to Vanessa, who shakes her head in awe. Juno winces slightly and then places Vanessa's hand on her belly. Vanessa shakes her head, and her beautifully sculpted face tightens with self-consciousness. Then, she drops to her knees in front of Juno, and with a nervous glance around her, she places her hands on Juno's belly. Her eyes widen with excitement, and Juno, standing over her, watches her with a mixture of fondness and pride as Vanessa gazes at the swollen belly like a love-struck puppy. Meanwhile, Bren, at the sewing machine, cuts the top off a pair of jeans and sews on an elasticated band, giving a satisfied smile as she tests the elasticity of her handiwork."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As she hurriedly makes her way up to the elegant front door of the Lorings' residence, she pauses for a brief moment to ensure that the hem of the skirt she has thoughtfully chosen to wear over her jeans is smoothed down properly. She then leans closer to one of the two beautifully crafted oval leaded windows, hoping to get a sneak peek inside. Afterward, she proceeds to show Mark the image she has brought with her. Mark appears to become completely engrossed and utterly absorbed in the music, allowing himself to lose touch with reality as he immerses in its captivating rhythm, before he eventually turns his full attention back to Juno. Juno's eyes happen to catch sight of a VHS tape lying nearby. In a swift motion, he snatches the tape from her grasp, and together, they proceed to watch the film. The movie features a sinister man menacingly driving a stake through a woman's stomach. Juno then shares the picture with Vanessa, who examines the image meticulously, both lengthwise and sideways, scrutinizing it with care before casting a glance toward Mark, who responds with an indifferent and brutal shrug. Vanessa stands there with her arms tightly folded across her chest, exuding a sense of composure. He places Juno's bag over her shoulder and respectfully opens the door to let her out. Vanessa offers her husband a tight, restrained smile, reflecting her mixed emotions. By the time Juno arrives back at her home, it is already dark outside, and she is casually sipping from a drinks carton. Bren is occupied with the meticulous task of cutting out pictures of various dogs, and as Bren returns her focus to her paper dogs, Juno casually pours the remaining dregs of her drink into one of Bren's ornamental pieces. Outside, on the snowy street, Juno brings the Previa to a stop and carefully eases off her grey overskirt. Bleeker's mother opens the front door to her home, and Juno races swiftly up the stairs, managing to outrun Bleeker's mother and reaching Bleeker's room before she can catch up. Bleeker reaches over for a box, while Juno eases herself into a chair, sitting with her legs apart before gradually sliding onto the floor next to him. They both avert their gazes awkwardly, and Juno suddenly appears to be glum. At her own home, Vanessa, dressed in an old, comfortable T-shirt with her hair neatly pulled back in a ponytail, stands in front of a bare wall, contemplating it. Mark, standing beside her with his arms sternly folded, also looks glum. Nervously playing with the chain around her neck, Vanessa turns to face the wall behind her for a change of perspective, while Mark continues to stare bleakly at the same wall. Meanwhile, Juno and Leah are at the bustling mall, crouched down behind a glass balcony. Vanessa is playfully joking around with a friend's little girl in the lively play area of the mall. Leah sucks in her cheeks thoughtfully, stands up, and looks elsewhere, but Juno remains where she is, gazing down at Vanessa as she engages playfully with the little girl, a soft smile gradually spreading across her face. They walk over to Vanessa, who shakes her head in awe at the moment. Juno winces slightly and then gently places Vanessa's hand on her belly. Vanessa shakes her head again, her beautifully sculpted face tightening with a hint of self-consciousness. Then, she drops to her knees in front of Juno, and with a nervous glance around her surroundings, she places her hands tenderly on Juno's belly. Her eyes widen with excitement as she feels the life within, and Juno, standing elegantly over her, watches her with a mixture of fondness and pride, observing Vanessa as she gazes at the swollen belly like a love-struck puppy. Meanwhile, Bren, seated at the sewing machine, carefully cuts the top off a pair of jeans and skillfully sews on an elasticated band, giving a satisfied smile as she tests the elasticity of her handiwork with precision and care."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As she approaches the Lorings' front door with a quickened pace, she takes a moment to smooth down the hem of the skirt she wears over her jeans, ensuring it sits just right, before leaning in to peer through one of the two oval leaded windows, trying to catch a glimpse of the interior. She then presents an image to Mark, who, after a moment of being absorbed in the music, shifts his focus to Juno. Juno's attention is caught by a VHS tape, and Mark swiftly snatches it from her grasp. Together, they watch the film, captivated by the scene where a sinister man drives a stake through a woman's stomach. Juno then shows the picture to Vanessa, who examines it thoroughly, turning it lengthwise and sideways, before casting a glance at Mark, who responds with a dismissive shrug. Vanessa stands there, her arms tightly folded across her chest, exuding a sense of tension. Mark then gently places Juno's bag over her shoulder and opens the door, allowing her to step out. Vanessa offers her husband a tight, restrained smile. By the time Juno arrives home, darkness has fallen, and she sips from a drinks carton as she enters. Inside, Bren is busy cutting out pictures of dogs, and as she returns to her paper dogs, Juno casually pours the remnants of her drink into one of Bren's ornaments. Outside, on the snowy street, Juno brings the Previa to a stop and carefully eases off her grey overskirt. As Bleeker's mother opens her front door, Juno races up the stairs with urgency, managing to outrun Bleeker's mother and reach Bleeker's room ahead of her. Bleeker reaches for a box, and Juno eases herself into a chair, spreading her legs apart before sliding onto the floor next to him. They both avert their gazes awkwardly, and Juno's expression suddenly turns glum. Meanwhile, at her home, Vanessa stands before a bare wall, dressed in an old T-shirt with her hair pulled back in a ponytail, while Mark stands beside her with his arms folded, looking equally glum. Vanessa nervously fiddles with the chain around her neck, then turns to face the wall behind her, as Mark stares bleakly at it. In the mall, Juno and Leah crouch down behind a glass balcony, observing the scene below. Vanessa is in the play area, joking around with a friend's little girl. Leah sucks in her cheeks, stands up, and looks elsewhere, but Juno remains where she is, watching Vanessa play with the little girl, and a soft smile gradually spreads across her face. They approach Vanessa, who shakes her head in awe. Juno winces slightly before taking Vanessa's hand and placing it on her belly. Vanessa shakes her head, her beautifully sculpted face tightening with self-consciousness. Then, she drops to her knees in front of Juno, and with a nervous glance around, she places her hands on Juno's belly. Her eyes widen with excitement, and Juno, standing over her, observes with a blend of fondness and pride as Vanessa gazes at the swollen belly like a love-struck puppy. Meanwhile, Bren, seated at the sewing machine, carefully cuts the top of a pair of jeans and sews on an elasticated band, giving a satisfied smile as she tests the elasticity of her handiwork."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As Juno approaches the Lorings' front door, she adjusts her skirt over her jeans and peers through the oval leaded windows. She shares an image with Mark, who momentarily loses himself in the music before noticing Juno's interest in a VHS tape. They watch a film together, featuring a sinister scene, before Juno shows the picture to Vanessa. Vanessa examines it thoughtfully, then exchanges a tense glance with Mark. Vanessa stands with her arms folded as Mark helps Juno with her bag and opens the door for her departure, offering Vanessa a tight smile. \n\nBy the time Juno arrives home, it's dark, and she sips from a drink carton while Bren cuts out pictures of dogs. Juno pours the remnants of her drink into Bren's ornament before heading outside. On the snowy street, she stops the Previa and removes her grey overskirt. At Bleeker's house, Juno races up the stairs, reaching Bleeker's room ahead of his mother. As Bleeker retrieves a box, Juno settles into a chair and then slides to the floor beside him, both feeling awkward. \n\nMeanwhile, at her home, Vanessa stands in an old T-shirt with her hair in a ponytail, facing a bare wall with Mark beside her, both looking glum. Vanessa nervously plays with her necklace as Mark stares at the wall. Later, at the mall, Juno and Leah crouch behind a glass balcony, watching Vanessa play with a friend's little girl. Leah eventually stands and looks away, but Juno remains, smiling softly at the scene. They approach Vanessa, who shakes her head in awe. Juno winces but places Vanessa's hand on her belly. Vanessa, self-conscious, drops to her knees and places her hands on Juno's belly, her eyes widening with excitement. Juno watches with fondness and pride as Vanessa gazes at her belly with adoration.\n\nBack at home, Bren works at the sewing machine, altering a pair of jeans by adding an elasticated band, smiling with satisfaction as she tests the elastic."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "As she runs up to the Lorings' front door, she smoothes down the hem of the skirt she wears over her jeans, a fashion trend that gained popularity in the late 2000s for its quirky style, and peers in through one of the two oval leaded windows crafted by a local artisan known for her intricate glasswork. She shows Mark the image, a recent ultrasound picture that reveals the baby's profile. Mark seems to lose himself in the music, a melancholy tune from the 90s, then he looks at Juno. Juno notices a VHS, a relic of a time before streaming services became ubiquitous. He snatches the tape from her, and they watch the film where a sinister man drives a stake through a woman's stomach, a classic horror scene reminiscent of vintage slasher films. Juno shows Vanessa the picture, and Vanessa studies the image lengthwise and sideways, then looks across at Mark, who shrugs brutally, as though the weight of impending responsibilities is beginning to settle on his shoulders. Vanessa stands with her arms tightly folded, a posture that indicates her indecision and anxiety. He places Juno's bag over her shoulder and opens the door to let her out. Vanessa gives her husband a tight smile that conceals the tension beneath her calm exterior. It's dark by the time Juno arrives home in her suburban neighborhood, sipping from a drinks carton branded with her favorite organic juice. Bren, an avid scrapbooker, is cutting out pictures of dogs, and as Bren goes back to her paper dogs, Juno pours the dregs of her drink into Bren's ornament, a quirky vase shaped like a dog. Outside, on the snowy street, Juno stops the Previa, a popular minivan model during the 1990s, and eases off her grey overskirt. Bleeker's mother, known for her warm hospitality, opens her front door, and Juno races up the stairs, outrunning Bleeker's mother and getting to Bleeker's room before her. Bleeker reaches for a box, which contains an eclectic collection of vintage vinyl records. Juno eases herself into a chair with her legs apart and slides onto the floor next to him. They both look away awkwardly, and Juno suddenly looks glum as she contemplates the changes ahead. At her home, Vanessa, in an old T-shirt with her hair pulled back in a ponytail, stands before a bare wall where a nursery is soon to be decorated. Mark, standing next to her with his arms folded, looks glum, reflecting the reality of impending parenthood. Playing nervously with the chain around her neck, Vanessa turns to the wall behind her, a blank canvas for the life they are about to bring into their home, and Mark stares bleakly at the wall. Juno and Leah, known for their mischievous antics, are in the mall, crouching down behind a glass balcony. Vanessa is joking around with a friend's little girl in the mall play area, which is filled with brightly colored climbing frames. Leah sucks in her cheeks, stands up, and looks elsewhere, but Juno stays where she is, gazing down at Vanessa playing with the little girl, and a soft smile spreads across her face as she envisions Vanessa as the nurturing mother she hopes she will be. They walk into Vanessa, who shakes her head in awe, overwhelmed by the moment. Juno winces and then plants Vanessa's hand on her belly, feeling the flutter of a kick under her palm. Vanessa shakes her head, and her beautiful sculpted face tightens self-consciously. Then, she drops to her knees in front of Juno, and with a nervous glance about her, she places her hands on Juno's belly. Her eyes widen excitedly, and Juno, standing over her, watches her with a mixture of fondness and pride as Vanessa gazes at the swollen belly like a love-struck puppy, imagining the life soon to join theirs. Bren, at the sewing machine, cuts the top of a pair of jeans and sews on an elasticated band, a practical alteration for Juno's expanding waistline, giving a satisfied smile as she tests the elastic."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "As she runs up to the Lorings' front door she smoothes down the hem of the skirt she wears over her jeans and peers in through one of the two oval leaded windows. She shows Mark the image. Mark seems to lose himself in the music. then he looks at Juno. Juno notices a VHS. He snatches the tape from her and they watch the film where a sinister man drives a stake through a woman's stomach. Juno shows Vanessa the picture and Vanessa studies the image lengthwise and sideways then looks across at Mark who shrugs brutally. Vanessa stands with her arms tightly folded. He places Juno's bag over her shoulder and opens the door to let her out. Vanessa gives her husband a tight smile. It is dark by the time Juno arrives home sipping from a drinks carton. Bren is cutting out pictures of dogs and as Bren goes back to her paper dogs Juno pours the dregs of her drink into Bren's ornament. Outside on the snowy street Juno stops the Previa and eases off her grey overskirt. Bleeker's mother opens her front door and Juno races up the stairs outrunning Bleeker's mother and getting to Bleeker's room before her. Bleeker reaches for a box. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Juno eases herself into a chair with her legs apart and slides onto the floor next to him. They both look away awkwardly and Juno suddenly looks glum. At her home Vanessa in an old Tshirt with her hair pulled back in a ponytail stands before a bare wall. Mark standing next to her with his arms folded looks glum. Playing nervously with the chain around her neck. Vanessa turns to the wall behind her and Mark stares bleakly at the wall. Juno and Leah are in the mall crouching down behind a glass balcony. Vanessa is joking around with a friend's little girl in the mall play area. Leah sucks in her cheeks stands up and looks elsewhere but Juno stays where she is gazing down at. Vanessa playing with the little girl and a soft smile spreads across her face. They walk into Vanessa who shakes her head in awe. Juno winces and then plants Vanessa's hand on her belly. Vanessa shakes her head and her beautiful sculpted face tightens selfconsciously. Then she drops to her knees in front of Juno and with a nervous glance about her she places her hands on Juno's belly. Her eyes widen excitedly and Juno standing over her watches her with a mixture of fondness and pride as Vanessa gazes at the swollen belly like a lovestruck puppy. Bren at the sewing machine cuts the top of a pair of jeans and sews on an elasticated band giving a satisfied smile as she tests the elastic."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "As she runs up to the Lorings' front door she smoothes down the hem of the skirt she wears over her jeans and peers in through one of the two oval leaded windows. She shows Mark the image. Mark seems to lose himself in the music. then he looks at Juno. Juno notices a VHS. He snatches the tape from her and they watch the film where a sinister man drives a stake through a woman's stomach. Juno shows Vanessa the picture and Vanessa studies the image lengthwise and sideways then looks across at Mark who shrugs brutally. Vanessa stands with her arms tightly folded. He places Juno's bag over her shoulder and opens the door to let her out. Vanessa gives her husband a tight smile. It is dark by the time Juno arrives home sipping from a drinks carton. Bren is cutting out pictures of dogs and as Bren goes back to her paper dogs Juno pours the dregs of her drink into Bren's ornament. Outside on the snowy street Juno stops the Previa and eases off her grey overskirt. Bleeker's mother opens her front door and Juno races up the stairs outrunning Bleeker's mother and getting to Bleeker's room before her. Bleeker reaches for a box. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Juno eases herself into a chair with her legs apart and slides onto the floor next to him. They both look away awkwardly and Juno suddenly looks glum. At her home Vanessa in an old Tshirt with her hair pulled back in a ponytail stands before a bare wall. Mark standing next to her with his arms folded looks glum. Playing nervously with the chain around her neck. Vanessa turns to the wall behind her and Mark stares bleakly at the wall. Juno and Leah are in the mall crouching down behind a glass balcony. Vanessa is joking around with a friend's little girl in the mall play area. Leah sucks in her cheeks stands up and looks elsewhere but Juno stays where she is gazing down at. Vanessa playing with the little girl and a soft smile spreads across her face. They walk into Vanessa who shakes her head in awe. Juno winces and then plants Vanessa's hand on her belly. Vanessa shakes her head and her beautiful sculpted face tightens selfconsciously. Then she drops to her knees in front of Juno and with a nervous glance about her she places her hands on Juno's belly. Her eyes widen excitedly and Juno standing over her watches her with a mixture of fondness and pride as Vanessa gazes at the swollen belly like a lovestruck puppy. Bren at the sewing machine cuts the top of a pair of jeans and sews on an elasticated band giving a satisfied smile as she tests the elastic."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "As she runs up to the Lorings' front door she smoothes down the hem of the skirt she wears over her jeans and peers in through one of the two oval leaded windows. She shows Mark the image. Mark seems to lose himself in the music. then he looks at Juno. Juno notices a VHS. He snatches the tape from her and they watch the film where a sinister man drives a stake through a woman's stomach. Juno shows Vanessa the picture and Vanessa studies the image lengthwise and sideways then looks across at Mark who shrugs brutally. Vanessa stands with her arms tightly folded. Leah sucks in her cheeks stands up and looks elsewhere but Juno stays where she is gazing down at. Vanessa playing with the little girl and a soft smile spreads across her face. They walk into Vanessa who shakes her head in awe. Juno winces and then plants Vanessa's hand on her belly. Vanessa shakes her head and her beautiful sculpted face tightens selfconsciously. Then she drops to her knees in front of Juno and with a nervous glance about her she places her hands on Juno's belly. Her eyes widen excitedly and Juno standing over her watches her with a mixture of fondness and pride as Vanessa gazes at the swollen belly like a lovestruck puppy. Bren at the sewing machine cuts the top of a pair of jeans and sews on an elasticated band giving a satisfied smile as she tests the elastic."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "As she runs up to the Lorings' front door she smoothes down the hem of the skirt she wears over her jeans and peers in through one of the two oval leaded windows. She shows Mark the image. Mark seems to lose himself in the music. Vanessa shakes her head and her beautiful sculpted face tightens selfconsciously. Then she drops to her knees in front of Juno and with a nervous glance about her she places her hands on Juno's belly. Her eyes widen excitedly and Juno standing over her watches her with a mixture of fondness and pride as Vanessa gazes at the swollen belly like a lovestruck puppy. Bren at the sewing machine cuts the top of a pair of jeans and sews on an elasticated band giving a satisfied smile as she tests the elastic."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "As he cycles up to the Thompson's garage, he straightens the strap of the hat he wears over his overalls and squints in through one of the three square stained glass panels. He displays Julia the sketch. Julia seems to lose herself in the painting, then she glances at Rina. Rina spots a DVD. She grabs the disc from him, and they view the animation where a cheerful lad plants a seed in a giant cat's paw. Rina presents Oliver the diagram, and Oliver inspects the sketch diagonally and upside down, then peers over at Julia, who grimaces playfully. Oliver stands with his hands loosely clasped. She places Rina's scarf over his neck and pulls the gate to let him in. Oliver flashes his wife a wide grin. It's misty by the time Rina reaches the park, munching from a snack pouch. Cal is cutting out shapes of cats, and as Cal returns to her paper cats, Rina spills the last of her snack into Cal's vase. Inside, on the damp path, Rina halts the bicycle and pulls off her orange raincoat. Dylan's father unlocks his garage, and Rina races through the garden, outpacing Dylan's father and sliding to Dylan's shed before him. Dylan grabs for a basket. Rina lowers herself onto a bench with her feet together and shifts onto the rug beside her. They both glance aside shyly, and Rina suddenly appears grumpy. At her garden, Oliver, in a vintage hoodie with his hair tied back in a bun, stands before a cluttered fence. Julia, standing next to him with her hands on hips, looks grumpy. Twirling nervously with the bracelet around his wrist, Oliver turns to the fence beside him, and Julia gazes blankly at the fence. Rina and Sam are in the park, lying down behind a wooden bench. Oliver is joking around with a cousin's young boy in the school play area. Sam puffs out her lips, sits down, and faces sideways, but Rina remains where she is, staring down at Oliver playing with the young boy, and a wide grin covers her face. They stroll up to Oliver, who tilts his head in disbelief. Rina shudders and then presses Oliver's foot on her lap. Oliver tilts his head, and his rugged worn-out face tightens bashfully. Then, he collapses to his elbows in front of Rina, and with a cautious peek around him, he places his feet on Rina's knees. His face brightens eagerly, and Rina, looming over him, observes him with a mix of warmth and satisfaction as Oliver gazes at the growing lap like an amused kitten. Cal, at the easel, trims the hem of a shirt and sews on a decorative patch, giving a contented grin as she tests the patch."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Juno hurries to the Lorings' door, adjusts her skirt, and peers inside. She and Mark get absorbed in a disturbing VHS tape. Juno shows Vanessa a picture, leading to an awkward exchange. Mark escorts Juno out, and Vanessa forces a smile. After returning home, Juno pours out her drink and removes her overskirt. She rushes to Bleeker's room, sitting beside him awkwardly, feeling suddenly glum. At Vanessa's, she and Mark stand silently, both looking somber. Later, at the mall, Juno watches Vanessa play with a friend's child, smiling softly. She and Leah greet Vanessa, who reacts emotionally when Juno places her hand on her belly. Vanessa drops to her knees, excitedly touching Juno’s belly as Juno observes with pride. Meanwhile, Bren alters a pair of jeans with an elastic band, pleased with her work."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Bren at the sewing machine cuts the top of a pair of jeans and sews on an elasticated band giving a satisfied smile as she tests the elastic Her eyes widen excitedly and Juno standing over her watches her with a mixture of fondness and pride as Vanessa gazes at the swollen belly like a lovestruck puppy  Then she drops to her knees in front of Juno and with a nervous glance about her she places her hands on Juno's belly  Vanessa shakes her head and her beautiful sculpted face tightens selfconsciously  Juno winces and then plants Vanessa's hand on her belly  They walk into Vanessa who shakes her head in awe  Vanessa playing with the little girl and a soft smile spreads across her face  Leah sucks in her cheeks stands up and looks elsewhere but Juno stays where she is gazing down at  Vanessa is joking around with a friend's little girl in the mall play area  Juno and Leah are in the mall crouching down behind a glass balcony  Vanessa turns to the wall behind her and Mark stares bleakly at the wall  Playing nervously with the chain around her neck  Mark standing next to her with his arms folded looks glum  At her home Vanessa in an old Tshirt with her hair pulled back in a ponytail stands before a bare wall  They both look away awkwardly and Juno suddenly looks glum  Juno eases herself into a chair with her legs apart and slides onto the floor next to him  Bleeker reaches for a box  Bleeker's mother opens her front door and Juno races up the stairs outrunning Bleeker's mother and getting to Bleeker's room before her  Outside on the snowy street Juno stops the Previa and eases off her grey overskirt  Bren is cutting out pictures of dogs and as Bren goes back to her paper dogs Juno pours the dregs of her drink into Bren's ornament  It's dark by the time Juno arrives home sipping from a drinks carton  Vanessa gives her husband a tight smile  He places Juno's bag over her shoulder and opens the door to let her out  Vanessa stands with her arms tightly folded  Juno shows Vanessa the picture and Vanessa studies the image lengthwise and sideways then looks across at Mark who shrugs brutally  He snatches the tape from her and they watch the film where a sinister man drives a stake through a woman's stomach  Juno notices a VHS  Mark seems to lose himself in the music then he looks at Juno  She shows Mark the image  As she runs up to the Lorings' front door she smoothes down the hem of the skirt she wears over her jeans and peers in through one of the two oval leaded windows "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "She shows Mark the image As she runs up to the Lorings' front door she smoothes down the hem of the skirt she wears over her jeans and peers in through one of the two oval leaded windows then he looks at Juno Mark seems to lose himself in the music He snatches the tape from her and they watch the film where a sinister man drives a stake through a woman's stomach Juno notices a VHS Vanessa stands with her arms tightly folded Juno shows Vanessa the picture and Vanessa studies the image lengthwise and sideways then looks across at Mark who shrugs brutally Vanessa gives her husband a tight smile He places Juno's bag over her shoulder and opens the door to let her out Bren is cutting out pictures of dogs and as Bren goes back to her paper dogs Juno pours the dregs of her drink into Bren's ornament It is dark by the time Juno arrives home sipping from a drinks carton Bleeker's mother opens her front door and Juno races up the stairs outrunning Bleeker's mother and getting to Bleeker's room before her Outside on the snowy street Juno stops the Previa and eases off her grey overskirt Juno eases herself into a chair with her legs apart and slides onto the floor next to him Bleeker reaches for a box At her home Vanessa in an old Tshirt with her hair pulled back in a ponytail stands before a bare wall They both look away awkwardly and Juno suddenly looks glum Playing nervously with the chain around her neck Mark standing next to her with his arms folded looks glum Juno and Leah are in the mall crouching down behind a glass balcony Vanessa turns to the wall behind her and Mark stares bleakly at the wall Leah sucks in her cheeks stands up and looks elsewhere but Juno stays where she is gazing down at Vanessa is joking around with a friend's little girl in the mall play area They walk into Vanessa who shakes her head in awe Vanessa playing with the little girl and a soft smile spreads across her face Vanessa shakes her head and her beautiful sculpted face tightens selfconsciously Juno winces and then plants Vanessa's hand on her belly Her eyes widen excitedly and Juno standing over her watches her with a mixture of fondness and pride as Vanessa gazes at the swollen belly like a lovestruck puppy Then she drops to her knees in front of Juno and with a nervous glance about her she places her hands on Juno's belly Bren at the sewing machine cuts the top of a pair of jeans and sews on an elasticated band giving a satisfied smile as she tests the elastic"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They both look away awkwardly and Juno suddenly looks glum  At her home Vanessa in an old Tshirt with her hair pulled back in a ponytail stands before a bare wall  Mark standing next to her with his arms folded looks glum  Playing nervously with the chain around her neck  Vanessa turns to the wall behind her and Mark stares bleakly at the wall  Juno and Leah are in the mall crouching down behind a glass balcony  Vanessa is joking around with a friend's little girl in the mall play area  Leah sucks in her cheeks stands up and looks elsewhere but Juno stays where she is gazing down at  Vanessa playing with the little girl and a soft smile spreads across her face  They walk into Vanessa who shakes her head in awe  Juno winces and then plants Vanessa's hand on her belly  Vanessa shakes her head and her beautiful sculpted face tightens selfconsciously  Then she drops to her knees in front of Juno and with a nervous glance about her she places her hands on Juno's belly  Her eyes widen excitedly and Juno standing over her watches her with a mixture of fondness and pride as Vanessa gazes at the swollen belly like a lovestruck puppy  Bren at the sewing machine cuts the top of a pair of jeans and sews on an elasticated band giving a satisfied smile as she tests the elastic As she runs up to the Lorings' front door she smoothes down the hem of the skirt she wears over her jeans and peers in through one of the two oval leaded windows  She shows Mark the image  Mark seems to lose himself in the music then he looks at Juno  Juno notices a VHS  He snatches the tape from her and they watch the film where a sinister man drives a stake through a woman's stomach  Juno shows Vanessa the picture and Vanessa studies the image lengthwise and sideways then looks across at Mark who shrugs brutally  Vanessa stands with her arms tightly folded  He places Juno's bag over her shoulder and opens the door to let her out  Vanessa gives her husband a tight smile  It's dark by the time Juno arrives home sipping from a drinks carton  Bren is cutting out pictures of dogs and as Bren goes back to her paper dogs Juno pours the dregs of her drink into Bren's ornament  Outside on the snowy street Juno stops the Previa and eases off her grey overskirt  Bleeker's mother opens her front door and Juno races up the stairs outrunning Bleeker's mother and getting to Bleeker's room before her  Bleeker reaches for a box  Juno eases herself into a chair with her legs apart and slides onto the floor next to him "
        }
      ]
    }
  ]
}