{
  "ground_truth": "Juno, wearing the adapted jeans, comes down the school with her hands long in the pockets of her baggy tartan parker as her fellow students, staring at her belly, clear a path to let her pass. Mark is at home composing. In the school canteen, the two girls eat their lunch in an empty school awards booth while Leah gazes adoringly at the tubby bearded teacher. At his locker, Bleeker knocks back as Juno waddles up to him and looks him straight in the eye. Bleeker's eye shift as he glances in Katrina's direction, and his head drops miserably. Juno strides away with her canvas bag over her shoulder, leaving Bleeker standing by his locker, watching her glumly. Juno hoists herself up into her dad's Previa, puts on some lip balm, and starts the engine. Meanwhile, Mark, surfing on his PC, sees the blue van pull up outside as Juno follows him downstairs, and he leads her into a cluttered basement room. She reads a title and her hands grab his waist. He brings the up to his neck, and with his hands round her waist, her belly touching his, she closes her eyes and rests her head on his chest as they slowly sway together. Mark, with his chin brushing against her hair, seems unsettled as Juno looks up startled and stares at him in bewilderment. Vanessa, loaded down with shopping, comes into her pristine white kitchen while Mark lowers his gaze. Juno starts to go and bolts out of the door, clutching her belly as she waddles out to the Previa. Mark, in his rock T-shirt over a long-sleeved undershirt, looks coldly at Vanessa and goes back to his room, and Vanessa sinks down on the stairs and gazes unhappily into space. Beneath a cloudy sky, Juno drives under a road bridge, passing a freight train on one side. She pulls off the main carriageway onto the soft shoulder, next to a sward of dull green grass dotted with patches of spring snow, runs her hand over her own belly as she gives into tears, and crammed in behind the wheel, seems oblivious of the passing cars as she rubs her belly under her thick tartan coat, her eyes staring straight ahead, not looking at anything in particular, and she starts to calm down. The car lights flash, and she pulls back onto the road and drives off. Up in his room, Bleeker is playing his guitar after dark. On the bonnet of the van, with her head resting on the sloping front windscreen and her hands tucked behind her back, Juno stares up at the sky. She suddenly raises herself onto her elbows, climbs back into the van, rummages behind her to find a crumpled receipt, smoothes it out on the steering wheel of the van, and starts to write on it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Juno, wearing the modified jeans, descends the school with her hands deep in the pockets of her loose tartan parka as her fellow students, staring at her abdomen, clear a path to let her proceed. Mark is at home creating. In the school cafeteria, the two girls consume their lunch in an empty school awards booth while Leah gazes admiringly at the chubby bearded instructor. At his locker, Bleeker leans back as Juno waddles up to him and looks him straight in the eye. Bleeker's eyes shift as he glances in Katrina's direction, and his head drops dejectedly. Juno strides away with her canvas bag over her shoulder, leaving Bleeker standing by his locker, observing her dismally. Juno hoists herself up into her dad's Previa, applies some lip balm, and starts the engine. Meanwhile, Mark, browsing on his PC, notices the blue van pull up outside as Juno follows him downstairs, and he leads her into a cluttered basement room. She reads a headline and her hands seize his waist. He brings them up to his neck, and with his hands around her waist, her abdomen touching his, she closes her eyes and rests her head on his chest as they slowly sway together. Mark, with his chin brushing against her hair, seems unsettled as Juno looks up startled and stares at him in confusion. Vanessa, loaded down with purchases, enters her immaculate white kitchen while Mark lowers his gaze. Juno starts to leave and bolts out of the door, clutching her abdomen as she waddles out to the Previa. Mark, in his rock T-shirt over a long-sleeved undershirt, looks coldly at Vanessa and returns to his room, and Vanessa sinks down on the stairs and gazes unhappily into space. Beneath a cloudy sky, Juno drives under a road bridge, passing a freight train on one side. She pulls off the main road onto the soft shoulder, next to a sward of dull green grass dotted with patches of spring snow, runs her hand over her own abdomen as she gives into tears, and crammed in behind the wheel, seems oblivious to the passing cars as she rubs her abdomen under her thick tartan coat, her eyes staring straight ahead, not looking at anything in particular, and she starts to calm down. The car lights flash, and she pulls back onto the road and drives off. Up in his room, Bleeker is playing his guitar after dark. On the hood of the van, with her head resting on the sloping front windscreen and her hands tucked behind her back, Juno stares up at the sky. She suddenly raises herself onto her elbows, climbs back into the van, searches behind her to find a crumpled receipt, smoothes it out on the steering wheel of the van, and starts to write on it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Juno, wearing the adapted jeans, is seen coming down the school with her hands long in the pockets of her baggy tartan parker as a path is cleared by her fellow students, who stare at her belly, to let her pass. Home compositions are being created by Mark. In the school canteen, their lunch is eaten by the two girls in an empty school awards booth while Leah adoringly gazes at the tubby bearded teacher. At his locker, Juno is knocked back by Bleeker as she waddles up to him and looks him straight in the eye. Bleeker shifts his eye as Katrina’s direction is glanced at by him, and his head is miserably dropped. Bleeker is left standing by his locker as Juno strides away with her canvas bag over her shoulder, watching her glumly. Juno hoists herself up into her dad's Previa, some lip balm is put on, and the engine is started by her. Meanwhile, the blue van is seen pulling up outside on his PC by Mark, as she follows him downstairs, and he leads her into a cluttered basement room. A title is read by her, and his waist is grabbed by her hands. The hands are brought up to his neck by him, and with his hands round her waist, her belly touching his, her eyes are closed, and she rests her head on his chest as they sway together slowly. Juno is looked at up startled and is stared at in bewilderment by Mark, with his chin brushing against her hair, who seems unsettled. Vanessa, loaded down with shopping, enters into her pristine white kitchen while his gaze is lowered by Mark. Juno starts to go and bolts out of the door, her belly is clutched as she waddles out to the Previa. Vanessa is looked at coldly by Mark, in his rock T-shirt over a long-sleeved undershirt, and he goes back to his room, while the stairs are sunk down on by Vanessa who gazes unhappily into space. Beneath a cloudy sky, under a road bridge, Juno is driven as a freight train is passed on one side. The main carriageway is pulled off by her onto the soft shoulder, next to a sward of dull green grass dotted with patches of spring snow, her hand is run over her own belly as she gives into tears, and crammed in behind the wheel, she seems oblivious of the passing cars as her belly is rubbed under her thick tartan coat, her eyes staring straight ahead, not looking at anything in particular, and she starts to calm down. The car lights are flashed, and the road is pulled back onto by her and she drives off. After dark, his guitar is played by Bleeker up in his room. On the bonnet of the van, with her head resting on the sloping front windscreen and her hands tucked behind her back, the sky is stared up at by Juno. Suddenly she raises herself onto her elbows, climbs back into the van, rummages behind her to find a crumpled receipt, smoothes it out on the steering wheel of the van, and starts to write on it."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Juno, in adapted jeans, walks through school with her hands deep in her baggy tartan parka pockets as students clear a path, staring at her belly. Mark is at home composing. In the canteen, two girls eat lunch in an empty awards booth while Leah admires a tubby bearded teacher. At his locker, Bleeker looks away as Juno approaches, then drops his head miserably. Juno leaves with her canvas bag, and Bleeker watches her glumly. Juno climbs into her dad's Previa, applies lip balm, and starts the engine. Meanwhile, Mark sees the blue van outside and leads Juno to a cluttered basement. She reads a title, grabs his waist, and they sway together, her belly touching his. Mark seems unsettled as Juno looks up, bewildered. Vanessa enters her pristine kitchen with shopping as Mark lowers his gaze. Juno bolts out, clutching her belly, and drives off in the Previa. Mark, in a rock T-shirt, looks coldly at Vanessa, who sinks onto the stairs, gazing unhappily. Under a cloudy sky, Juno drives past a freight train, pulls onto the shoulder, and, oblivious to passing cars, rubs her belly under her coat, calming down. The car lights flash, and she drives off. Bleeker plays guitar after dark. On the van's bonnet, Juno stares at the sky, then climbs back in, finds a crumpled receipt, smoothes it on the steering wheel, and starts writing."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Juno, in adapted jeans and a baggy tartan parka, walks through school as students clear a path, staring at her belly. Mark is composing at home. In the canteen, two girls eat lunch while Leah admires a bearded teacher. At his locker, Bleeker looks at Juno, then glances at Katrina, dropping his head. Juno leaves with her canvas bag, and Bleeker watches her sadly. Juno gets into her dad's Previa, applies lip balm, and starts the engine. Mark sees her arrive and leads her to a cluttered basement. They sway together, but Mark seems unsettled. Vanessa enters the kitchen with shopping as Juno leaves, clutching her belly. Mark returns to his room, and Vanessa sits on the stairs, unhappy. Juno drives under a bridge, pulls off the road, and cries, rubbing her belly. She calms down, rejoins the road, and drives off. Bleeker plays guitar in his room. Juno lies on the van's bonnet, then writes on a crumpled receipt inside."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Juno, dressed in her uniquely styled adapted jeans, makes her way down the bustling school corridor with her hands deeply buried in the pockets of her oversized, baggy tartan parker. As she moves forward, her fellow students, their eyes fixated on her noticeably protruding belly, instinctively clear a path, allowing her to pass through without obstruction. Meanwhile, Mark is at home, fully immersed in the creative process of composing music. In the school canteen, two girls sit together, enjoying their lunch in the solitude of an empty school awards booth, while Leah gazes with admiration at the tubby, bearded teacher nearby. At his locker, Bleeker is taken aback as Juno approaches him with a determined waddle, meeting his gaze directly. Bleeker's eyes shift uneasily as he glances over in Katrina's direction, and his head drops in a gesture of misery. Juno, with her canvas bag slung over her shoulder, strides away confidently, leaving Bleeker standing by his locker, watching her departure with a sense of gloom. \n\nJuno then hoists herself up into her dad's Previa, applies some lip balm with care, and starts the engine. Meanwhile, Mark, while surfing on his PC, notices the familiar blue van pulling up outside. Juno follows him downstairs, and he leads her into a cluttered basement room filled with various items. She reads a title and instinctively places her hands on his waist. He gently brings them up to his neck, and with his hands encircling her waist, her belly pressing against his, she closes her eyes and rests her head on his chest as they sway together slowly. Mark, with his chin lightly brushing against her hair, appears unsettled as Juno looks up, startled, and stares at him in bewilderment. Vanessa, burdened with shopping bags, enters her immaculate white kitchen just as Mark lowers his gaze. Juno begins to leave, bolting out of the door, clutching her belly protectively as she waddles out to the Previa. Mark, wearing a rock T-shirt over a long-sleeved undershirt, casts a cold look at Vanessa before retreating back to his room, while Vanessa sinks down on the stairs, gazing unhappily into the void of space.\n\nBeneath a sky filled with clouds, Juno drives under a road bridge, passing a freight train that rumbles along on one side. She veers off the main carriageway onto the soft shoulder, coming to a stop next to a sward of dull green grass dotted with patches of lingering spring snow. She runs her hand over her own belly as she succumbs to tears, and crammed in behind the wheel, she seems oblivious to the passing cars as she rubs her belly beneath her thick tartan coat, her eyes staring straight ahead, unfocused on anything in particular, and she gradually begins to calm down. The car lights flash, signaling her to pull back onto the road, and she drives off. Later, up in his room, Bleeker is playing his guitar in the darkness of night. On the bonnet of the van, with her head resting on the sloping front windscreen and her hands tucked behind her back, Juno gazes up at the expansive sky. Suddenly, she raises herself onto her elbows, climbs back into the van, and rummages behind her to find a crumpled receipt. She smoothes it out on the steering wheel of the van and begins to write on it, her thoughts pouring onto the paper."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Juno, dressed in her uniquely styled and creatively designed adapted jeans, confidently makes her way down the bustling, crowded school corridor, her hands deeply and securely buried in the protective pockets of her oversized, baggy tartan parker. As she moves forward, her fellow students, with their eyes intently fixated on her noticeably protruding belly, instinctively and almost automatically clear a path, allowing her to pass through without any obstruction. Meanwhile, Mark is at home, fully engrossed and deeply immersed in the creative process of composing music. Over in the school canteen, two girls sit together, enjoying and savoring their lunch in the solitude of an otherwise empty school awards booth, while Leah gazes with admiration and interest at the tubby, bearded teacher nearby. At his locker, Bleeker is taken aback as Juno approaches him with a determined and purposeful waddle, meeting his gaze directly and unwaveringly. Bleeker's eyes shift uneasily as he cautiously glances over in Katrina's direction, and his head drops in a gesture of pure misery. Juno, with her canvas bag slung casually over her shoulder, strides away with confidence, leaving Bleeker standing by his locker, watching her departure with a sense of gloom and despondency.\n\nJuno then hoists herself up into her dad's Previa, carefully and meticulously applies some lip balm with care, and starts the engine with determination. Meanwhile, Mark, while leisurely surfing on his PC, notices the familiar and recognizable blue van pulling up outside. Juno follows him downstairs, and he leads her into a cluttered basement room filled with various assorted items. She reads a title and instinctively places her hands gently on his waist. He gently brings them up to his neck, and with his hands tenderly encircling her waist, her belly pressing against his, she closes her eyes and rests her head on his chest as they sway together slowly. Mark, with his chin lightly and softly brushing against her hair, appears unsettled and uneasy as Juno looks up, startled, and stares at him in bewilderment and confusion. Vanessa, burdened with shopping bags, enters her immaculate white kitchen just as Mark lowers his gaze. Juno begins to leave, bolting hurriedly out of the door, clutching her belly protectively as she waddles out to the Previa. Mark, wearing a rock T-shirt over a long-sleeved undershirt, casts a cold, disinterested look at Vanessa before retreating back to his room, while Vanessa sinks down on the stairs, gazing unhappily into the void of space, lost in thought.\n\nBeneath a sky filled with clouds, Juno drives under a road bridge, passing a freight train that rumbles along noisily on one side. She veers off the main carriageway onto the soft shoulder, coming to a stop next to a sward of dull green grass dotted with patches of lingering spring snow. She runs her hand gently over her own belly as she succumbs to tears, and crammed in behind the wheel, she seems oblivious to the passing cars as she rubs her belly beneath her thick tartan coat, her eyes staring straight ahead, unfocused on anything in particular, and she gradually begins to calm down. The car lights flash insistently, signaling her to pull back onto the road, and she drives off. Later, up in his room, Bleeker is playing his guitar in the darkness of the quiet night. On the bonnet of the van, with her head resting on the sloping front windscreen and her hands tucked securely behind her back, Juno gazes thoughtfully up at the expansive sky. Suddenly, she raises herself onto her elbows, climbs back into the van, and rummages behind her to find a crumpled receipt. She smoothes it out carefully on the steering wheel of the van and begins to write on it, her thoughts pouring onto the paper in a steady stream."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Juno, dressed in her adapted jeans, makes her way down the school corridor with her hands deeply buried in the pockets of her baggy tartan parker. As she moves forward, her fellow students, their eyes fixated on her belly, instinctively part to create a clear path for her to pass through. Meanwhile, Mark is at home, fully immersed in composing music. In the school canteen, Juno and her friend Leah sit together, eating their lunch in the solitude of an empty school awards booth. Leah's attention is captivated by the sight of a tubby bearded teacher, whom she gazes at with adoration. At his locker, Bleeker is startled as Juno approaches him with a waddle, meeting his gaze directly. Bleeker's eyes shift uncomfortably as he glances towards Katrina, and his head drops in a display of misery. Juno, with her canvas bag slung over her shoulder, strides away, leaving Bleeker standing by his locker, watching her departure with a glum expression. Juno then hoists herself up into her dad's Previa, applies some lip balm, and starts the engine. Meanwhile, Mark, while surfing on his PC, notices the blue van pulling up outside. Juno follows him downstairs, and he leads her into a cluttered basement room. She reads a title, and her hands instinctively grab his waist. He guides her hands up to his neck, and with his hands encircling her waist, her belly pressing against his, she closes her eyes and rests her head on his chest as they sway slowly together. Mark, with his chin brushing against her hair, appears unsettled, prompting Juno to look up, startled, and stare at him in bewilderment. Vanessa, burdened with shopping bags, enters her pristine white kitchen just as Mark lowers his gaze. Juno begins to leave, bolting out of the door while clutching her belly, and waddles out to the Previa. Mark, wearing a rock T-shirt over a long-sleeved undershirt, casts a cold look at Vanessa before retreating to his room, while Vanessa sinks down on the stairs, gazing unhappily into space. Beneath a cloudy sky, Juno drives under a road bridge, passing a freight train on one side. She veers off the main carriageway onto the soft shoulder, next to a sward of dull green grass dotted with patches of spring snow. She runs her hand over her own belly, succumbing to tears, and crammed in behind the wheel, she seems oblivious to the passing cars as she rubs her belly under her thick tartan coat, her eyes staring straight ahead, unfocused, until she begins to calm down. The car lights flash, and she pulls back onto the road, driving off. Up in his room, Bleeker plays his guitar after dark. On the bonnet of the van, with her head resting on the sloping front windscreen and her hands tucked behind her back, Juno stares up at the sky. Suddenly, she raises herself onto her elbows, climbs back into the van, rummages behind her to find a crumpled receipt, smoothes it out on the steering wheel of the van, and begins to write on it."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Juno, wearing adapted jeans and a baggy tartan parka, walks through school as her fellow students clear a path, staring at her belly. Meanwhile, Mark is at home composing. In the school canteen, Juno and Leah eat lunch in an empty awards booth while Leah admires a teacher. At his locker, Bleeker looks dejected as Juno approaches, meets his gaze, and then walks away, leaving him watching her glumly. Juno gets into her dad's Previa, applies lip balm, and starts the engine. Mark, surfing on his PC, notices the blue van outside as Juno follows him to a cluttered basement room. They sway together, her head on his chest, but Mark seems unsettled when Juno looks up at him in bewilderment. Vanessa enters her kitchen with shopping as Mark lowers his gaze and returns to his room, leaving Vanessa to sit on the stairs, gazing unhappily. Under a cloudy sky, Juno drives past a freight train, pulls onto the shoulder, and, overwhelmed with emotion, rubs her belly and calms down. She then drives off. Later, Bleeker plays guitar in his room after dark. Juno, lying on the van's bonnet, stares at the sky, then climbs back inside, finds a crumpled receipt, smoothes it out, and starts writing on it."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Juno, wearing the adapted jeans—tailored specially to accommodate her growing pregnancy—comes down the school hallway with her hands long in the pockets of her baggy tartan parker, which recalls the punk fashion of the 1970s, as her fellow students, staring at her belly, clear a path to let her pass. Mark is at home composing music, likely working on one of his garage band songs that he hopes will help him escape his mundane life. In the school canteen, the two girls eat their lunch in an empty school awards booth, dusty and filled with trophies from past sports victories, while Leah gazes adoringly at the tubby bearded teacher who is known for his engaging history lessons. At his locker, Bleeker, wearing his cross-country team jersey symbolizing his passion for running, knocks back as Juno waddles up to him and looks him straight in the eye. Bleeker's eyes shift as he glances in Katrina's direction, who is known for her competitive cheerleading prowess, and his head drops miserably. Juno strides away with her canvas bag over her shoulder, a bag covered in patches from various bands, leaving Bleeker standing by his locker, watching her glumly. Juno hoists herself up into her dad's Previa, a reliable old minivan known for its spacious interior, puts on some cherry-flavored lip balm, and starts the engine. Meanwhile, Mark, surfing on his PC, sees the blue van pull up outside as Juno follows him downstairs, and he leads her into a cluttered basement room, filled with the paraphernalia of his music hobby. She reads a title, perhaps of a classic rock song they both adore, and her hands grab his waist. He brings them up to his neck, and with his hands round her waist, her belly touching his, she closes her eyes and rests her head on his chest as they slowly sway together. Mark, with his chin brushing against her hair, seems unsettled as Juno looks up startled and stares at him in bewilderment. Vanessa, loaded down with shopping from the upscale organic grocery store nearby, comes into her pristine white kitchen while Mark lowers his gaze. Juno starts to go and bolts out of the door, clutching her belly as she waddles out to the Previa. Mark, in his rock T-shirt over a long-sleeved undershirt—a style reminiscent of grunge music—looks coldly at Vanessa and goes back to his room, and Vanessa sinks down on the stairs and gazes unhappily into space. Beneath a cloudy sky, Juno drives under a road bridge, a common passage for commuters, passing a freight train on one side. She pulls off the main carriageway onto the soft shoulder, next to a sward of dull green grass dotted with patches of spring snow, runs her hand over her own belly as she gives into tears, and crammed in behind the wheel, seems oblivious of the passing cars as she rubs her belly under her thick tartan coat, her eyes staring straight ahead, not looking at anything in particular, and she starts to calm down. The car lights flash, reminding her of the many late-night drives she's taken to clear her head, and she pulls back onto the road and drives off. Up in his room, Bleeker is playing his guitar after dark, strumming the chords of a song he wrote. On the bonnet of the van, with her head resting on the sloping front windscreen and her hands tucked behind her back, Juno stares up at the sky scattered with stars. She suddenly raises herself onto her elbows, climbs back into the van, rummages behind her to find a crumpled receipt from the local diner where she often goes for fries, smoothes it out on the steering wheel of the van, and starts to write on it."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Juno wearing the adapted jeans comes down the school with her hands long in the pockets of her baggy tartan parker as her fellow students staring at her belly clear a path to let her pass  Mark is at home composing  In the school canteen the two girls eat their lunch in an empty school awards booth while Leah gazes adoringly at the tubby bearded teacher  she closes her eyes and rests her head on his chest as they slowly sway together  Mark with his chin brushing against her hair seems unsettled as Juno looks up startled and stares at him in bewilderment  Vanessa loaded down with shopping comes into her pristine white kitchen while Mark lowers his gaze  Juno starts to go and bolts out of the door clutching her belly as she waddles out to the Previa  Mark in his rock Tshirt over a longsleeved undershirt looks coldly at Vanessa and goes back to his room and Vanessa sinks down on the stairs and gazes unhappily into space  Beneath a cloudy sky Juno drives under a road bridge passing a freight train on one side  She pulls off the main carriageway onto the soft shoulder next to a sward of dull green grass dotted with patches of spring  snow runs her hand over her own belly as she gives into tears and crammed in behind the wheel seems oblivious of the passing cars as she rubs her belly under her thick tartan coat her eyes staring straight ahead not looking at anything in particular and she starts to calm down  The car lights flash and she pulls back onto the road and drives off  Up in his room  Bleeker is playing his guitar after dark  On the bonnet of the van with her head resting on the sloping front windscreen and her hands tucked behind her back  At his locker Bleeker knocks back as Juno waddles up to him and looks him straight in the eye  Bleeker's eye shift as he glances in Katrina's direction and his head drops miserably  Juno strides away with her canvas bag over her shoulder leaving Bleeker standing by his locker watching her glumly  Juno hoists herself up into her dad's Previa puts on some lip balm and starts the engine  Meanwhile Mark surfing on his PC sees the blue van pull up outside as Juno follows him downstairs and he leads her into a cluttered basement room  She reads a title and her hands grab his waist  He brings the up to his neck and with his hands round her waist her belly touching his  she closes her eyes and rests her head on his chest as they slowly sway together  Mark with his chin brushing against her hair seems unsettled as Juno looks up startled and stares at him in bewilderment  Vanessa loaded down with shopping comes into her pristine white kitchen while Mark lowers his gaze  Juno starts to go and bolts out of the door clutching her belly as she waddles out to the Previa  Mark in his rock Tshirt over a longsleeved undershirt looks coldly at Vanessa and goes back to his room and Vanessa sinks down on the stairs and gazes unhappily into space  Beneath a cloudy sky Juno drives under a road bridge passing a freight train on one side  She pulls off the main carriageway onto the soft shoulder next to a sward of dull green grass dotted with patches of spring  snow runs her hand over her own belly as she gives into tears and crammed in behind the wheel seems oblivious of the passing cars as she rubs her belly under her thick tartan coat her eyes staring straight ahead not looking at anything in particular and she starts to calm down  The car lights flash and she pulls back onto the road and drives off  Up in his room  Bleeker is playing his guitar after dark  On the bonnet of the van with her head resting on the sloping front windscreen and her hands tucked behind her back  Juno stares up at the sky  She suddenly raises herself onto her elbows climbs back into the van rummages behind her to find a crumpled receipt smoothes it out on the steering wheel of the van and starts to write on it"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Juno wearing the adapted jeans comes down the school with her hands long in the pockets of her baggy tartan parker as her fellow students staring at her belly clear a path to let her pass. Mark is at home composing. In the school canteen the two girls eat their lunch in an empty school awards booth while Leah gazes adoringly at the tubby bearded teacher. At his locker Bleeker knocks back as Juno waddles up to him and looks him straight in the eye. Bleeker's eye shift as he glances in Katrina's direction and his head drops miserably. Juno strides away with her canvas bag over her shoulder leaving Bleeker standing by his locker watching her glumly. Juno hoists herself up into her dad's Previa puts on some lip balm and starts the engine. Meanwhile Mark surfing on his PC sees the blue van pull up outside as Juno follows him downstairs and he leads her into a cluttered basement room. She reads a title and her hands grab his waist. He brings the up to his neck and with his hands round her waist her belly touching his. she closes her eyes and rests her head on his chest as they slowly sway together. Mark with his chin brushing against her hair seems unsettled as Juno looks up startled and stares at him in bewilderment. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Vanessa loaded down with shopping comes into her pristine white kitchen while Mark lowers his gaze. Juno starts to go and bolts out of the door clutching her belly as she waddles out to the Previa. Mark in his rock Tshirt over a longsleeved undershirt looks coldly at Vanessa and goes back to his room and Vanessa sinks down on the stairs and gazes unhappily into space. Beneath a cloudy sky Juno drives under a road bridge passing a freight train on one side. She pulls off the main carriageway onto the soft shoulder next to a sward of dull green grass dotted with patches of spring. snow runs her hand over her own belly as she gives into tears and crammed in behind the wheel seems oblivious of the passing cars as she rubs her belly under her thick tartan coat her eyes staring straight ahead not looking at anything in particular and she starts to calm down. The car lights flash and she pulls back onto the road and drives off. Up in his room. Bleeker is playing his guitar after dark. On the bonnet of the van with her head resting on the sloping front windscreen and her hands tucked behind her back. Juno stares up at the sky. She suddenly raises herself onto her elbows climbs back into the van rummages behind her to find a crumpled receipt smoothes it out on the steering wheel of the van and starts to write on it."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Juno wearing the adapted jeans comes down the school with her hands long in the pockets of her baggy tartan parker as her fellow students staring at her belly clear a path to let her pass. Mark is at home composing. In the school canteen the two girls eat their lunch in an empty school awards booth while Leah gazes adoringly at the tubby bearded teacher. At his locker Bleeker knocks back as Juno waddles up to him and looks him straight in the eye. Bleeker's eye shift as he glances in Katrina's direction and his head drops miserably. Juno strides away with her canvas bag over her shoulder leaving Bleeker standing by his locker watching her glumly. Juno hoists herself up into her dad's Previa puts on some lip balm and starts the engine. Meanwhile Mark surfing on his PC sees the blue van pull up outside as Juno follows him downstairs and he leads her into a cluttered basement room. She reads a title and her hands grab his waist. He brings the up to his neck and with his hands round her waist her belly touching his. she closes her eyes and rests her head on his chest as they slowly sway together. Mark with his chin brushing against her hair seems unsettled as Juno looks up startled and stares at him in bewilderment. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Vanessa loaded down with shopping comes into her pristine white kitchen while Mark lowers his gaze. Juno starts to go and bolts out of the door clutching her belly as she waddles out to the Previa. Mark in his rock Tshirt over a longsleeved undershirt looks coldly at Vanessa and goes back to his room and Vanessa sinks down on the stairs and gazes unhappily into space. Beneath a cloudy sky Juno drives under a road bridge passing a freight train on one side. She pulls off the main carriageway onto the soft shoulder next to a sward of dull green grass dotted with patches of spring. snow runs her hand over her own belly as she gives into tears and crammed in behind the wheel seems oblivious of the passing cars as she rubs her belly under her thick tartan coat her eyes staring straight ahead not looking at anything in particular and she starts to calm down. The car lights flash and she pulls back onto the road and drives off. Up in his room. Bleeker is playing his guitar after dark. On the bonnet of the van with her head resting on the sloping front windscreen and her hands tucked behind her back. Juno stares up at the sky. She suddenly raises herself onto her elbows climbs back into the van rummages behind her to find a crumpled receipt smoothes it out on the steering wheel of the van and starts to write on it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Juno wearing the adapted jeans comes down the school with her hands long in the pockets of her baggy tartan parker as her fellow students staring at her belly clear a path to let her pass. Mark is at home composing. In the school canteen the two girls eat their lunch in an empty school awards booth while Leah gazes adoringly at the tubby bearded teacher. At his locker Bleeker knocks back as Juno waddles up to him and looks him straight in the eye. Bleeker's eye shift as he glances in Katrina's direction and his head drops miserably. Juno strides away with her canvas bag over her shoulder leaving Bleeker standing by his locker watching her glumly. The car lights flash and she pulls back onto the road and drives off. Up in his room. Bleeker is playing his guitar after dark. On the bonnet of the van with her head resting on the sloping front windscreen and her hands tucked behind her back. Juno stares up at the sky. She suddenly raises herself onto her elbows climbs back into the van rummages behind her to find a crumpled receipt smoothes it out on the steering wheel of the van and starts to write on it."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Juno wearing the adapted jeans comes down the school with her hands long in the pockets of her baggy tartan parker as her fellow students staring at her belly clear a path to let her pass. Mark is at home composing. In the school canteen the two girls eat their lunch in an empty school awards booth while Leah gazes adoringly at the tubby bearded teacher. Juno stares up at the sky. She suddenly raises herself onto her elbows climbs back into the van rummages behind her to find a crumpled receipt smoothes it out on the steering wheel of the van and starts to write on it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Carlos, wearing the adapted jeans, comes down the school with his hands long in the pockets of his baggy tartan parker as his fellow students, staring at his belly, clear a path to let him pass. The cat is at home composing. In the school canteen, the two trees eat their lunch in an empty school awards booth while Leah gazes adoringly at the tubby bearded lawnmower. At his locker, the bird knocks back as Carlos waddles up to him and looks him straight in the eye. The bird's eye shifts as he glances in the dog's direction, and his head drops miserably. Carlos strides away with his canvas bag over his shoulder, leaving the bird standing by his locker, watching him glumly. Carlos hoists himself up into his dad's Previa, puts on some lip balm, and starts the engine. Meanwhile, the cat, surfing on his PC, sees the blue van pull up outside as Carlos follows him downstairs, and he leads him into a cluttered basement room. He reads a title and his hands grab the cat's waist. The cat brings them up to his neck, and with his hands round his waist, his belly touching his, he closes his eyes and rests his head on the cat's chest as they slowly sway together. The cat, with his chin brushing against his hair, seems unsettled as Carlos looks up startled and stares at him in bewilderment. The camel, loaded down with shopping, comes into her pristine white kitchen while the cat lowers his gaze. Carlos starts to go and bolts out of the door, clutching his belly as he waddles out to the Previa. The cat, in his rock T-shirt over a long-sleeved undershirt, looks coldly at the camel and goes back to his room, and the camel sinks down on the stairs and gazes unhappily into space. Beneath a cloudy sky, Carlos drives under a road bridge, passing a freight train on one side. He pulls off the main carriageway onto the soft shoulder, next to a sward of dull green grass dotted with patches of spring snow, runs his hand over his own belly as he gives into tears, and crammed in behind the wheel, seems oblivious of the passing cars as he rubs his belly under his thick tartan coat, his eyes staring straight ahead, not looking at anything in particular, and he starts to calm down. The car lights flash, and he pulls back onto the road and drives off. Up in his room, the bird is playing his guitar after dark. On the bonnet of the van, with his head resting on the sloping front windscreen and his hands tucked behind his back, Carlos stares up at the sky. He suddenly raises himself onto his elbows, climbs back into the van, rummages behind him to find a crumpled receipt, smoothes it out on the steering wheel of the van, and starts to write on it."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Juno, wearing the altered overalls, comes down the library with her hands deep in the pockets of her floral raincoat as her fellow students, staring at her backpack, step aside to let her pass. Mark is at home painting. In the library nook, the two girls eat their lunch in an empty science exhibit while Leah gazes adoringly at the lanky bald librarian. At his bike rack, Bleeker hesitates as Juno waddles up to him and looks him straight in the eye. Bleeker's eyes shift as he glances in Katrina's direction, and his head drops miserably. Juno strides away with her wicker basket over her shoulder, leaving Bleeker standing by his bike rack, watching her glumly. Juno hoists herself up into her dad's pickup, puts on some hand cream, and starts the engine. Meanwhile, Mark, editing on his tablet, sees the red car pull up outside as Juno follows him downstairs, and he leads her into a cluttered attic room. She reads a sign and her hands grab his elbow. He brings them up to his neck, and with his hands round her elbow, her backpack touching his, she closes her eyes and rests her head on his shoulder as they slowly sway together. Mark, with his chin brushing against her scarf, seems unsettled as Juno looks up startled and stares at him in bewilderment. Vanessa, loaded down with books, comes into her pristine white living room while Mark lowers his gaze. Juno starts to go and bolts out of the door, clutching her backpack as she waddles out to the pickup. Mark, in his sports jersey over a long-sleeved undershirt, looks coldly at Vanessa and goes back to his room, and Vanessa sinks down on the couch and gazes unhappily into space. Beneath a cloudy sky, Juno drives under a pedestrian bridge, passing a convoy of bikes on one side. She pulls off the main boulevard onto the gravel path next to a patch of dull green moss dotted with patches of autumn leaves, runs her hand over her own backpack as she gives into tears, and crammed in behind the wheel, seems oblivious of the passing bikes as she rubs her backpack under her thick floral coat, her eyes staring straight ahead, not looking at anything in particular, and she starts to calm down. The car lights flash, and she pulls back onto the road and drives off. Up in his room, Bleeker is playing his violin after dark. On the tailgate of the pickup, with her head resting on the sloping rear window and her hands tucked behind her head, Juno stares up at the sky. She suddenly raises herself onto her elbows, climbs back into the pickup, rummages behind her to find a crumpled napkin, smoothes it out on the steering wheel of the pickup, and starts to write on it."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Juno, wearing the adapted jeans, leaps through the school with her hands waving in the pockets of her baggy tartan parker as her fellow students, staring at her belly, sketch a path to let her pass. Mark is at home painting. In the school canteen, the two girls sketch their lunch in an empty school awards booth while Leah laughs adoringly at the tubby bearded teacher. At his locker, Bleeker twirls as Juno dances up to him and winks him straight in the eye. Bleeker's eye twitches as he peers in Katrina's direction, and his head lifts miserably. Juno skips away with her canvas bag over her shoulder, leaving Bleeker standing by his locker, observing her glumly. Juno leaps herself up into her dad's Previa, applies some lip balm, and revs the engine. Meanwhile, Mark, jogging on his PC, spots the blue van swing up outside as Juno trails him downstairs, and he guides her into a cluttered basement room. She recites a title and her hands pat his waist. He nudges the up to his neck, and with his hands around her waist, her belly brushing his, she shuts her eyes and nestles her head on his chest as they gently float together. Mark, with his chin grazing against her hair, seems rattled as Juno glances up startled and squints at him in bewilderment. Vanessa, burdened down with shopping, enters her pristine white kitchen while Mark raises his gaze. Juno finishes and dashes out of the door, cradling her belly as she bounds out to the Previa. Mark, in his rock T-shirt over a long-sleeved undershirt, glances coldly at Vanessa and returns to his room, and Vanessa collapses down on the stairs and peers unhappily into space. Beneath a cloudy sky, Juno glides under a road bridge, passing a freight train on one side. She swerves off the main carriageway onto the soft shoulder, next to a sward of dull green grass dotted with patches of spring snow, pats her hand over her own belly as she yields into tears, and crammed in behind the wheel, seems unaware of the passing cars as she massages her belly under her thick tartan coat, her eyes gazing straight ahead, not focusing on anything in particular, and she begins to settle down. The car lights flicker, and she swerves back onto the road and zooms off. Up in his room, Bleeker is tuning his guitar after dark. On the bonnet of the van, with her head nestled on the sloping front windscreen and her hands crossed behind her back, Juno gazes up at the sky. She suddenly straightens herself onto her elbows, clambers back into the van, fumbles behind her to find a crumpled receipt, smoothes it out on the steering wheel of the van, and starts to doodle on it."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Marble, wearing the adjusted sneakers, descends the hospital with its fingers deep in the pockets of its oversized plaid jacket as its fellow umbrellas, staring at its backpack, clear a path to let it pass. Pencil is at the library composing. In the hospital cafeteria, the two phones eat their breakfast in an empty hospital trophy cabinet while Canvas gazes adoringly at the thin glasses-wearing bookcase. At its drawer, Stapler knocks back as Marble waddles up to it and looks it straight in the nose. Stapler's nose shifts as it glances in Collar's direction, and its elbow drops miserably. Marble strides away with its leather folder over its leg, leaving Stapler standing by its drawer, watching it glumly. Marble hoists itself up into its uncle's Desk, puts on some perfume, and starts the radio. Meanwhile, Pencil, surfing on its tablet, sees the green bicycle pull up outside as Marble follows it upstairs, and it leads Marble into a cluttered attic room. It reads a headline and its fingers grab its knee. It brings them up to its chin, and with its fingers around its shoulder, its backpack touching its, it closes its ears and rests its mouth on its elbow as they slowly sway together. Pencil, with its knee brushing against its sleeve, seems unsettled as Marble looks up startled and stares at it in bewilderment. Chair, loaded down with cushions, comes into its pristine black dining room while Pencil lowers its gaze. Marble starts to go and bolts out of the window, clutching its backpack as it waddles out to the Desk. Pencil, in its jazz sneakers over a short-sleeved jacket, looks coldly at Chair and goes back to its attic, and Chair sinks down on the bookshelf and gazes unhappily into space. Beneath a cloudy forest, Marble drives under a pedestrian walkway, passing a cargo plane on one side. It pulls off the main corridor onto the soft carpet, next to a patch of dull red carpet dotted with patches of summer leaves, runs its hand over its own backpack as it gives into laughter, and crammed in behind the bicycle, seems oblivious of the passing buses as it rubs its backpack under its thick plaid sweater, its glasses staring straight ahead, not looking at anything in particular, and it starts to calm down. The bicycle bell rings, and it pulls back onto the corridor and drives off. Up in its attic, Stapler is playing its violin after dark. On the edge of the bicycle, with its mouth resting on the sloping rear window and its fingers tucked behind its chest, Marble stares up at the forest. It suddenly raises itself onto its shoulders, climbs back into the bicycle, rummages behind its to find a crumpled magazine, smoothes it out on the steering wheel of the bicycle, and starts to write on it."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Max, wearing the mismatched shorts, glides down the park with his elbows swinging in the pockets of his oversized plaid hoodie as his fellow campers, whispering about his backpack, part a path to let him glide. Lily is at work baking. In the park pavilion, the two boys chew their sandwiches in a deserted park bench while Alex glances curiously at the lanky ponytailed counselor. At his bike rack, Jamie fidgets nervously as Max shuffles up to him and peers him straight in the eye. Jamie's focus shifts as he peers in Sarah's direction, and his shoulders slump wearily. Max drifts away with his messenger bag across his back, leaving Jamie lingering by his bike rack, gazing after him blankly. Max boosts himself up into his uncle's SUV, applies some sunblock, and revs the engine. Meanwhile, Lily, scrolling on her tablet, spots the red jeep park out front as Max follows her upstairs, and she guides him into a cluttered attic room. He scans a headline and his arms encircle her waist. She draws them up to her neck, and with her arms around his shoulders, her backpack brushing his, she closes her eyes and rests her forehead on his cheeks as they quietly lean together. Lily, with her cheek brushing against his shoulder, seems flustered as Max looks up surprised and studies her in confusion. Daniel, burdened with groceries, arrives in his spotless blue kitchen while Lily averts her gaze. Max decides to leave and dashes out of the door, clutching his backpack as he shuffles out to the SUV. Lily, in her graphic hoodie over a short-sleeved top, looks distantly at Daniel and returns to her rucksack, and Daniel sinks down on the porch and stares distantly into space. Beneath a starry sky, Max cycles over a wooden bridge, passing a jogger on one side. He steers off the main path onto the grassy verge, next to a patch of worn gray gravel dotted with clusters of autumn leaves, runs his fingers over his own backpack as he succumbs to laughter, and hunched behind the handlebars, seems oblivious of the passing bikers as he pats his backpack under his thick plaid coat, his gaze fixed ahead, not focusing on anything specific, and he starts to relax. The street lamps flicker, and he cycles back onto the path and pedals away. Up in his room, Jamie is strumming his ukulele after sunset. On the rooftop of the jeep, with her chin resting on the sloping windshield and her fingers tucked behind her ears, Max gazes out at the skyline. He suddenly lifts himself onto his knees, climbs back into the jeep, digs behind him to locate a crumpled map, flattens it out on the steering wheel of the jeep, and starts to sketch on it."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Juno, wearing the adapted sweater, ascends the playground with her hands deep in the sleeves of her oversized polka-dot jacket as her fellow students, glancing at her knees, create a path to let her through. Mark is at home doodling. In the school library, the two girls sip their milkshakes in an empty classroom while Leah looks admiringly at the lanky bald librarian. At his desk, Bleeker jumps back as Juno waddles up to him and observes him directly in the face. Bleeker's eyes dart as he peers in Katrina's direction, and his shoulders slump sadly. Juno skips away with her leather backpack over her shoulder, leaving Bleeker standing by his desk, watching her dejectedly. Juno climbs into her dad's truck, applies some hand lotion, and cranks the radio. Meanwhile, Mark, scrolling on his tablet, sees the green bus park outside as Juno trails him downstairs, and he guides her into a cluttered attic room. She scans a headline and her hands clasp his arm. He brings them up to his face, and with his hands around her arm, her knees grazing his, she closes her eyes and leans her head on his shoulder as they gently sway together. Mark, with his forehead brushing against her ear, seems uneasy as Juno looks up astonished and gazes at him in confusion. Vanessa, burdened with groceries, enters her immaculate grey dining room while Mark averts his eyes. Juno begins to leave and dashes out of the entrance, clutching her knees as she waddles out to the truck. Mark, in his sports hoodie over a short-sleeved shirt, looks indifferently at Vanessa and retreats to his studio, and Vanessa collapses on the sofa and stares despondently into nothing. Beneath a clear sky, Juno drives over a railway bridge, passing a convoy on one side. She veers off the main track onto the gravel, next to a patch of bright blue flowers scattered with hints of autumn leaves, runs her hand over her own knees as she gives in to laughter, and crammed in behind the controls, seems unaware of the passing bikes as she pats her knees under her thin polka-dot scarf, her eyes staring straight ahead, not focusing on anything specific, and she begins to relax. The truck lights flicker, and she merges back onto the path and drives away. Up in his room, Bleeker is strumming his ukulele after sunset. On the roof of the bus, with her head resting on the flat back window and her hands tucked under her head, Juno gazes up at the stars. She suddenly hoists herself onto her feet, climbs back into the bus, rummages beside her to find a crumpled napkin, flattens it out on the dashboard of the bus, and starts to sketch on it."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Luna, donning the mismatched sneakers, floats up the mountain with her elbows tucked in the sleeves of her oversized striped cape as her fellow hikers, glancing at her backpack, part the trail to let her ascend. Tom is at the cabin painting. In the mountain lodge, the two rabbits snack on their berries in an abandoned mountaintop cabin while Lucy gawks lovingly at the pudgy horned guide. At the trailhead, Buster trips forward as Luna bounces over to him and glances him directly in the tooth. Buster's tooth shifts as he peeks in Frida's direction, and his knees slump joylessly. Luna glides away with her rucksack slung across her torso, leaving Buster leaning against the trailhead, observing her drearily. Luna hauls herself onto her uncle's scooter, applies some sunscreen, and revs the engine. Meanwhile, Tom, sketching on his tablet, spots the red scooter park outside as Luna trails him upslope, and he directs her into a crowded treehouse. She scans a label and her fingers clasp his wrist. He draws them to his chin, and with his arms encircling her shoulders, her backpack pressing his, she closes her ears and rests her foot on his knee as they slowly rock together. Tom, with his nose grazing against her hood, seems perturbed as Luna peers up confused and gapes at him in puzzlement. Valerie, weighed down with gear, enters her spotless black conservatory while Tom averts his gaze. Luna starts to dash and sprints out of the door, gripping her backpack as she bounces out to the scooter. Tom, in his sport jersey under a wooly vest, glances bitterly at Valerie and retreats to his den, and Valerie sinks onto the couch and stares despondently into the void. Beneath a dim sky, Luna maneuvers under an old tunnel, bypassing a cargo ship on one side. She swerves off the main trail onto the rough shoulder, beside a field of faded yellow weeds speckled with flakes of winter frost, runs her foot over her own backpack as she gives in to sobs, and wedged in behind the handlebars, seems oblivious to the wandering owls as she pats her backpack under her thick striped cloak, her gaze fixed directly forward, not focusing on anything in sight, and she starts to settle down. The scooter horn echoes, and she merges back onto the trail and speeds away. Up in his attic, Buster is plucking his banjo after dusk. On the hood of the scooter, with her knee resting on the angled rear window and her arms crossed behind her neck, Luna gazes up at the clouds. She abruptly lifts herself onto her heels, hops back onto the scooter, searches behind her to find a wrinkled flyer, flattens it on the handlebars of the scooter, and begins to scribble on it."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Juno walks through school, wearing adapted jeans and a tartan parker, as classmates stare at her pregnant belly. Bleeker is at his locker, showing disappointment as Juno approaches and then leaves him behind. Meanwhile, Mark is at home, composing on his computer. Juno meets Mark in his cluttered basement, and they sway together, causing Juno confusion as Mark seems unsettled. Vanessa arrives home carrying groceries, and Mark returns to his room, leaving Vanessa dejected. Juno leaves to her dad's van, overwhelmed, she pulls over and cries, soothing her belly. She eventually calms down, resumes driving, and later, Juno writes on a crumpled receipt, staring at the sky. Bleeker plays guitar in his room, lost in thought."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She suddenly raises herself onto her elbows climbs back into the van rummages behind her to find a crumpled receipt smoothes it out on the steering wheel of the van and starts to write on it Juno stares up at the sky  On the bonnet of the van with her head resting on the sloping front windscreen and her hands tucked behind her back  Bleeker is playing his guitar after dark  Up in his room  The car lights flash and she pulls back onto the road and drives off  snow runs her hand over her own belly as she gives into tears and crammed in behind the wheel seems oblivious of the passing cars as she rubs her belly under her thick tartan coat her eyes staring straight ahead not looking at anything in particular and she starts to calm down  She pulls off the main carriageway onto the soft shoulder next to a sward of dull green grass dotted with patches of spring  Beneath a cloudy sky Juno drives under a road bridge passing a freight train on one side  Mark in his rock Tshirt over a longsleeved undershirt looks coldly at Vanessa and goes back to his room and Vanessa sinks down on the stairs and gazes unhappily into space  Juno starts to go and bolts out of the door clutching her belly as she waddles out to the Previa  Vanessa loaded down with shopping comes into her pristine white kitchen while Mark lowers his gaze  Mark with his chin brushing against her hair seems unsettled as Juno looks up startled and stares at him in bewilderment  she closes her eyes and rests her head on his chest as they slowly sway together  He brings the up to his neck and with his hands round her waist her belly touching his  She reads a title and her hands grab his waist  Meanwhile Mark surfing on his PC sees the blue van pull up outside as Juno follows him downstairs and he leads her into a cluttered basement room  Juno hoists herself up into her dad's Previa puts on some lip balm and starts the engine  Juno strides away with her canvas bag over her shoulder leaving Bleeker standing by his locker watching her glumly  Bleeker's eye shift as he glances in Katrina's direction and his head drops miserably  At his locker Bleeker knocks back as Juno waddles up to him and looks him straight in the eye  In the school canteen the two girls eat their lunch in an empty school awards booth while Leah gazes adoringly at the tubby bearded teacher  Mark is at home composing  Juno wearing the adapted jeans comes down the school with her hands long in the pockets of her baggy tartan parker as her fellow students staring at her belly clear a path to let her pass "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "In the school canteen the two girls eat their lunch in an empty school awards booth while Leah gazes adoringly at the tubby bearded teacher  On the bonnet of the van with her head resting on the sloping front windscreen and her hands tucked behind her back  Vanessa loaded down with shopping comes into her pristine white kitchen while Mark lowers his gaze  Meanwhile Mark surfing on his PC sees the blue van pull up outside as Juno follows him downstairs and he leads her into a cluttered basement room  Up in his room  Beneath a cloudy sky Juno drives under a road bridge passing a freight train on one side  She pulls off the main carriageway onto the soft shoulder next to a sward of dull green grass dotted with patches of spring  She suddenly raises herself onto her elbows climbs back into the van rummages behind her to find a crumpled receipt smoothes it out on the steering wheel of the van and starts to write on it The car lights flash and she pulls back onto the road and drives off  He brings the up to his neck and with his hands round her waist her belly touching his  Mark with his chin brushing against her hair seems unsettled as Juno looks up startled and stares at him in bewilderment  Juno stares up at the sky  Mark in his rock Tshirt over a longsleeved undershirt looks coldly at Vanessa and goes back to his room and Vanessa sinks down on the stairs and gazes unhappily into space  snow runs her hand over her own belly as she gives into tears and crammed in behind the wheel seems oblivious of the passing cars as she rubs her belly under her thick tartan coat her eyes staring straight ahead not looking at anything in particular and she starts to calm down  Mark is at home composing  At his locker Bleeker knocks back as Juno waddles up to him and looks him straight in the eye  Bleeker is playing his guitar after dark  Juno hoists herself up into her dad's Previa puts on some lip balm and starts the engine  Bleeker's eye shift as he glances in Katrina's direction and his head drops miserably  She reads a title and her hands grab his waist  she closes her eyes and rests her head on his chest as they slowly sway together  Juno starts to go and bolts out of the door clutching her belly as she waddles out to the Previa  Juno strides away with her canvas bag over her shoulder leaving Bleeker standing by his locker watching her glumly  Juno wearing the adapted jeans comes down the school with her hands long in the pockets of her baggy tartan parker as her fellow students staring at her belly clear a path to let her pass "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Vanessa loaded down with shopping comes into her pristine white kitchen while Mark lowers his gaze  Juno starts to go and bolts out of the door clutching her belly as she waddles out to the Previa  Mark in his rock Tshirt over a longsleeved undershirt looks coldly at Vanessa and goes back to his room and Vanessa sinks down on the stairs and gazes unhappily into space  Beneath a cloudy sky Juno drives under a road bridge passing a freight train on one side  She pulls off the main carriageway onto the soft shoulder next to a sward of dull green grass dotted with patches of spring  snow runs her hand over her own belly as she gives into tears and crammed in behind the wheel seems oblivious of the passing cars as she rubs her belly under her thick tartan coat her eyes staring straight ahead not looking at anything in particular and she starts to calm down  The car lights flash and she pulls back onto the road and drives off  Up in his room  Bleeker is playing his guitar after dark  On the bonnet of the van with her head resting on the sloping front windscreen and her hands tucked behind her back  Juno stares up at the sky  She suddenly raises herself onto her elbows climbs back into the van rummages behind her to find a crumpled receipt smoothes it out on the steering wheel of the van and starts to write on it Juno wearing the adapted jeans comes down the school with her hands long in the pockets of her baggy tartan parker as her fellow students staring at her belly clear a path to let her pass  Mark is at home composing  In the school canteen the two girls eat their lunch in an empty school awards booth while Leah gazes adoringly at the tubby bearded teacher  At his locker Bleeker knocks back as Juno waddles up to him and looks him straight in the eye  Bleeker's eye shift as he glances in Katrina's direction and his head drops miserably  Juno strides away with her canvas bag over her shoulder leaving Bleeker standing by his locker watching her glumly  Juno hoists herself up into her dad's Previa puts on some lip balm and starts the engine  Meanwhile Mark surfing on his PC sees the blue van pull up outside as Juno follows him downstairs and he leads her into a cluttered basement room  She reads a title and her hands grab his waist  He brings the up to his neck and with his hands round her waist her belly touching his  she closes her eyes and rests her head on his chest as they slowly sway together  Mark with his chin brushing against her hair seems unsettled as Juno looks up startled and stares at him in bewilderment "
        }
      ]
    }
  ]
}