{
  "ground_truth": "A set of swings and a climbing frame stand in a rural backyard, along with a picnic table and a brick barbecue, overlooked by an upstairs window. Inside, a framed photo on a bedside table shows a smiling family: mum, dad, a young boy, and a girl. The dad wears a clerical collar. Suddenly, the same man leans up on his elbows in bed, his eyes darting feverishly around the simply furnished room. He relaxes and sits up. The man, Graham Hess, comes out of his bedroom wearing a black t-shirt and pajama bottoms. He walks along the landing in his bare feet and comes to a closed door with some hand-drawn children's pictures stuck to it. Graham pauses for a moment to listen at the door, then returns to his bedroom, picking up some discarded socks on the way. He's in his mid-40s with short dark hair and a rugged handsome face. Graham crosses the bathroom and stares out of the door, his toothbrush in his mouth. He strides across the landing, opens the door to the children's room, and glances around. A younger man in a similar rural-style bedroom suddenly jolts and tumbles out of bed. He jumps to his feet and strains to listen. Graham rushes out of his wooden farmhouse and heads towards a whitewashed barn, while the younger man runs down a flight of steps from the other floor. Graham and the young man, Merrill, charge through a field of tall green maize. They stop when they reach a gap and look along a clear pathway, which cuts through the crop. A dark-haired girl of about six-years-old stands a little further down the path. The two men run over to her, and Graham grabs her by the arms. Merrill picks up Bo, and Graham dashes on through the maize. He reaches a fair-haired boy of about 10, who stares glassily across the field. Graham turns Morgan's head to face him. Morgan puts his hand around his father's jaw and turns his head to face in the direction he had been staring. Graham stands and slowly walks through the maize, followed by Merrill, who's still carrying Bo in his arms. Graham stops and glances around anxiously. He swallows hard and tentatively steps forward onto a sea of flattened maize stalks. Graham stares in wonder as he, Merrill, Morgan, and Bo come to the perimeter of a vast circular expanse of flattened maize. Two large Alsatians pace around uneasily in the center. An aerial view shows Graham and his family standing in the circle, which is about 100 yards in diameter. Another crop circle lies beside it, the same size but with a small semi-circle of maize still standing within it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A collection of swings and a climbing framework stand in a rural backyard, along with a picnic table and a brick grille, overlooked by an upstairs pane. Inside, a framed photograph on a bedside stand shows a smiling kin: mum, dad, a young lad, and a girl. The dad wears a clerical collar. Suddenly, the same man leans up on his elbows in bed, his eyes darting feverishly around the simply furnished chamber. He relaxes and sits up. The man, Graham Hess, emerges from his bedroom wearing a black t-shirt and pajama bottoms. He walks along the landing in his bare feet and arrives at a closed gate with some hand-drawn children's illustrations stuck to it. Graham pauses for a moment to listen at the door, then returns to his bedroom, picking up some discarded socks on the way. He's in his mid-40s with short dark hair and a rugged handsome visage. Graham crosses the lavatory and stares out of the gate, his toothbrush in his mouth. He strides across the landing, opens the door to the children's chamber, and glances around. A younger man in a similar rural-style bedroom suddenly jolts and tumbles out of bed. He jumps to his feet and strains to listen. Graham rushes out of his wooden farmhouse and heads towards a whitewashed barn, while the younger man runs down a flight of steps from the other floor. Graham and the young man, Merrill, charge through a field of tall green corn. They stop when they reach a gap and look along a clear pathway, which cuts through the crop. A dark-haired girl of about six-years-old stands a little further down the path. The two men run over to her, and Graham grabs her by the arms. Merrill picks up Bo, and Graham dashes on through the corn. He reaches a fair-haired lad of about 10, who stares glassily across the field. Graham turns Morgan's head to face him. Morgan puts his hand around his father's jaw and turns his head to face in the direction he had been staring. Graham stands and slowly walks through the corn, followed by Merrill, who's still carrying Bo in his arms. Graham stops and glances around anxiously. He swallows hard and tentatively steps forward onto a sea of flattened maize stalks. Graham stares in wonder as he, Merrill, Morgan, and Bo come to the perimeter of a vast circular expanse of flattened maize. Two large Alsatians pace around uneasily in the center. An aerial view shows Graham and his family standing in the circle, which is about 100 yards in diameter. Another crop circle lies beside it, the same size but with a small semi-circle of maize still standing within it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A set of swings and a climbing frame are stood in a rural backyard, along with a picnic table and a brick barbecue, which an upstairs window overlooks. Inside, a framed photo on a bedside table is shown to a smiling family: mum, dad, a young boy, and a girl. A clerical collar is worn by the dad. Suddenly, the same man is seen to lean up on his elbows in bed, his eyes darting feverishly around the simply furnished room. He is relaxed and he sits up. Graham Hess, the man, is seen to come out of his bedroom wearing a black t-shirt and pajama bottoms. Along the landing, he is walked in his bare feet, and he comes to a closed door with some hand-drawn children's pictures stuck to it. Graham is paused for a moment to listen at the door, then his bedroom is returned to, and some discarded socks are picked up by him on the way. He's in his mid-40s with short dark hair and a rugged handsome face. The bathroom is crossed by Graham, and he is stared out of the door, his toothbrush in his mouth. The landing is strided across by him, the door to the children's room is opened by him, and he is glanced around. A younger man in a similar rural-style bedroom suddenly is jolted and tumbled out of bed. He jumps to his feet and listens with strain. Graham rushes out of his wooden farmhouse and heads toward a whitewashed barn, while the younger man runs down a flight of steps from the other floor. Through a field of tall green maize, Graham and the young man, Merrill, are charged. They stop when they reach a gap and look along a clear pathway, which the crop cuts through. A dark-haired girl of about six-years-old is stood a little further down the path. The two men are run over to her, and she is grabbed by Graham by the arms. Bo is picked up by Merrill, and Graham dashes on through the maize. A fair-haired boy of about 10 is reached by him, who stares glassily across the field. Morgan's head is turned by Graham to face him. Morgan puts his hand around his father's jaw and turns Graham's head to face in the direction Morgan had been staring. Graham stands and slowly walks through the maize, and Merrill follows him, carrying Bo in his arms. Anxiously, Graham is glanced around and he stops. He swallows hard and is tentatively stepping forward onto a sea of flattened maize stalks. In wonder, Graham stares as Merrill, Morgan, Bo, and he come to the perimeter of a vast circular expanse of flattened maize. Two large Alsatians are seen to pace around uneasily in the center. An aerial view shows Graham and his family as they stand in the circle, which is about 100 yards in diameter. Another crop circle lies beside it, which the same size but within it, a small semi-circle of maize is still standing."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Swings, a climbing frame, a picnic table, and a brick barbecue occupy a rural backyard, visible from an upstairs window. Inside, a bedside table holds a framed photo of a smiling family: mom, dad, a young boy, and a girl. The dad wears a clerical collar. Abruptly, the man, Graham Hess, rises in bed, eyes darting feverishly in the simply furnished room. He relaxes, sits up, and exits his room in a black t-shirt and pajama bottoms. Barefoot, he approaches a door adorned with children's drawings, listens briefly, then returns to his room, picking up socks. In his mid-40s, with short dark hair, he crosses to the bathroom, toothbrush in mouth, and opens the children's room door. A younger man in another bedroom jolts awake and listens. Graham rushes from the farmhouse toward a whitewashed barn, while Merrill, the younger man, descends steps. Together, they run through a field of tall maize, stopping at a pathway. A dark-haired girl, about six, stands there. Graham and Merrill run to her; Graham grabs her arms while Merrill picks up Bo. They continue to a fair-haired boy, about 10, gazing across the field. Graham turns Morgan's head to him as Morgan redirects his gaze. As they proceed, Graham anxiously steps onto flattened maize stalks, witnessing a vast circle. Alsatians pace in its center. From above, Graham's family stands in a 100-yard diameter circle, a similar one beside it with a small semi-circle of standing maize."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Swings, a climbing frame, a picnic table, and a brick barbecue sit in a rural backyard. Inside, a bedside photo shows a smiling family: mum, dad with a clerical collar, a boy, and a girl. The dad, Graham Hess, wakes feverishly, then relaxes and exits his room in a black t-shirt and pajama bottoms. He pauses by a door with children's drawings, listens, and returns to his room, picking up socks. In his mid-40s, rugged and dark-haired, Graham brushes his teeth and glances into a children's room. A younger man in another bedroom wakes suddenly. Graham rushes from his farmhouse to a barn while the younger man, Merrill, follows. They run through tall maize, stopping at a gap to see a path. They find a dark-haired girl, Bo, on the path, and Graham grabs her while Merrill carries her. They reach a fair-haired boy, Morgan, who stares across the field. Morgan directs Graham's gaze. Graham, Merrill, Morgan, and Bo walk through the maize, stopping at a circular area of flattened stalks. Graham tentatively enters, followed by Merrill carrying Bo. In the center, two Alsatians pace. From above, Graham's family stands in a 100-yard-wide circle with another similar circle beside it, partly standing."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In a picturesque and serene rural backyard, there stands a classic set of swings and an adventurous climbing frame, accompanied by a quaint picnic table and a robust brick barbecue. This charming scene is all overlooked by an upstairs window. Moving inside the house, one might notice a framed photograph resting on a bedside table. This picture captures the cherished image of a smiling family: a mother, a father, a young boy, and a girl. Notably, the father is wearing a clerical collar, indicating his profession. Suddenly, this same man abruptly leans up on his elbows in bed, his eyes scanning feverishly around the modestly furnished room. He eventually relaxes and sits up straight. The man, whose name is Graham Hess, emerges from his bedroom, dressed casually in a black t-shirt and pajama bottoms. He quietly walks along the landing in his bare feet until he reaches a closed door, which has a collection of hand-drawn children's pictures stuck to its surface. Graham pauses momentarily to listen intently at the door, then decides to return to his bedroom, picking up a few discarded socks along the way. Graham is a man in his mid-40s with a ruggedly handsome face, characterized by short dark hair. \n\nAs Graham crosses the bathroom area, he takes a moment to stare out of the door, with a toothbrush still in his mouth. He confidently strides across the landing, opens the door to the children's room, and takes a quick glance around. Nearby, a younger man in a similarly decorated rural-style bedroom suddenly jolts awake and tumbles out of bed. He quickly jumps to his feet, straining his ears to listen. Without lingering, Graham rushes out of the wooden farmhouse and heads straight towards a whitewashed barn, while the younger man, Merrill, rapidly descends a flight of steps from the other floor. Together, Graham and Merrill sprint through a vast field of tall, green maize plants. They come to an abrupt stop when they reach a gap and gaze along a clear pathway that cuts through the crop. Standing a little further down the path is a dark-haired girl of about six years old. The two men quickly run over to her, and Graham urgently grabs her by the arms. Merrill swiftly picks up Bo, and Graham continues to dash through the maize. Eventually, he reaches a fair-haired boy of about 10 years old, who is staring glassily across the field. Graham gently turns Morgan's head to make him face him. Morgan then places his hand around his father's jaw, turning his head to face in the direction he had been staring. Graham then stands up and begins to walk cautiously through the maize, followed closely by Merrill, who is still carrying Bo in his arms. Graham pauses and glances around the area with a sense of anxiety. He swallows hard and takes a tentative step forward onto a seemingly sea of flattened maize stalks. Graham stares in wonderment as he, alongside Merrill, Morgan, and Bo, approaches the perimeter of a vast circular expanse of flattened maize. In the center, two large Alsatians pace around uneasily. An aerial view reveals Graham and his family standing within the large circle, which measures approximately 100 yards in diameter. Another crop circle lies beside it, the same size but with a small semi-circle of maize still standing within its perimeter."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In a picturesque and serenely tranquil rural backyard, there stands an invitingly classic set of swings, complemented by an adventurous climbing frame. Nearby, one can also find a quaint and charming picnic table, alongside a robustly built brick barbecue. This enchanting scene is thoughtfully overlooked by an upstairs window that offers a perfect vantage point. Moving inside the house, one might observe a framed photograph carefully resting on a bedside table. This picture beautifully captures a cherished image of a smiling family: a mother, a father, a young boy, and a little girl. Notably, the father is distinguished by a clerical collar, which subtly indicates his professional role. Suddenly, this very same man abruptly leans up on his elbows while in bed, his eyes feverishly scanning around the modestly furnished room. Eventually, he begins to relax before sitting up straight. The man, who is known as Graham Hess, emerges from his bedroom, dressed casually and comfortably in a black t-shirt and pajama bottoms. He quietly makes his way along the landing, walking on his bare feet until he reaches a closed door, which has a collection of hand-drawn children's pictures affixed to its surface. Graham pauses for a moment, listening intently at the door, then decides to return to his bedroom, picking up a few discarded socks scattered along the way. Graham is a man in his mid-40s with a ruggedly handsome face, characterized by his short dark hair.\n\nAs Graham crosses the bathroom area, he takes a momentary pause to gaze out of the door, with a toothbrush still poised in his mouth. He then confidently strides across the landing, opens the door to the children's room, and takes a quick glance around. Nearby, in a similarly decorated rural-style bedroom, a younger man suddenly jolts awake and tumbles out of bed. He quickly jumps to his feet, straining his ears as he listens intently. Without lingering or hesitating, Graham rushes out of the wooden farmhouse and heads directly towards a whitewashed barn, while the younger man, Merrill, rapidly descends a flight of steps from another floor. Together, Graham and Merrill sprint as fast as they can through a vast field of tall, green maize plants. They come to an abrupt stop when they reach a gap and gaze along a clear pathway that cuts through the crop. Standing a little further down this path is a dark-haired girl of about six years old. The two men quickly run over to her, and Graham urgently grabs her by the arms. Merrill swiftly picks up Bo in his arms, and Graham continues to dash energetically through the maize. Eventually, he reaches a fair-haired boy of about 10 years old, who is staring glassily across the field. Graham gently turns Morgan's head to make him face him directly. Morgan then places his small hand around his father's jaw, turning his head to face in the direction he had been staring. Graham then stands up, beginning to walk cautiously through the maize, closely followed by Merrill, who is still carrying Bo in his arms. Graham pauses and glances around the area with a palpable sense of anxiety. He swallows hard and takes a tentative step forward onto what seems like a sea of flattened maize stalks. Graham stares in wonderment as he, alongside Merrill, Morgan, and Bo, approaches the perimeter of a vast circular expanse of flattened maize. In the center of this circle, two large Alsatians pace around uneasily. An aerial view reveals Graham and his family standing within the large circle, which measures approximately 100 yards in diameter. Another crop circle lies beside it, identical in size but featuring a small semi-circle of maize still standing within its perimeter."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In a serene rural backyard, a set of swings and a climbing frame are perfectly positioned alongside a picnic table and a brick barbecue, all of which are overlooked by an upstairs window. Inside this window, there is a bedroom where a framed photo sits on a bedside table, capturing a smiling family comprising a mum, dad, a young boy, and a girl, with the dad donning a clerical collar. Suddenly, in a moment of abrupt awareness, the same man from the photo leans up on his elbows in bed, his eyes scanning feverishly around the simply furnished room. As a wave of calmness washes over him, he relaxes and proceeds to sit up. This man, Graham Hess, clad in a black t-shirt and pajama bottoms, emerges from his bedroom and walks along the landing in his bare feet, coming to a halt at a closed door adorned with hand-drawn children's pictures. He pauses momentarily to listen intently at the door, decides not to enter, and then retraces his steps back to his bedroom, picking up some discarded socks along the way. Graham, a man in his mid-40s with short dark hair and a rugged handsome face, crosses into the bathroom and momentarily stares out the door, toothbrush in mouth, before taking purposeful strides across the landing to open the door to the children's room. He casts a quick glance around the room before a sudden noise draws attention to a younger man in a similar rural-style bedroom who jolts awake, tumbles out of bed, and jumps to his feet, straining to understand what he's hearing. Meanwhile, Graham hastens out of his wooden farmhouse and makes his way towards a whitewashed barn, as the younger man, Merrill, races down a flight of steps from another floor. Together, Graham and Merrill charge through a field of tall green maize, only stopping when they reach a gap that reveals a clear pathway slicing through the crop. Ahead stands a dark-haired girl, approximately six years old, further down the path. The two men sprint over to her, with Graham reaching her first and gently grasping her arms. Merrill quickly lifts Bo up, and Graham, determined, rushes on through the maize until he reaches a fair-haired boy, about 10 years old, who is staring intently across the field with glazed eyes. Graham gently turns Morgan's head to face him, but Morgan places his hand around his father's jaw, redirecting Graham's gaze to align with his own. As comprehension dawns, Graham stands and begins to walk slowly through the sea of maize, Merrill trailing behind, still carrying Bo in his arms. As Graham halts, he surveys the surroundings anxiously, swallowing hard before he tentatively steps forward onto a vast area of flattened maize stalks. In a moment of awe and wonder, Graham, Merrill, Morgan, and Bo arrive at the perimeter of a massive circular expanse where the maize has been entirely flattened, while two large Alsatians pace restlessly in the center. An aerial perspective reveals the scene with Graham and his family standing within the circle, approximately 100 yards in diameter, and another crop circle situated beside it, identical in size but distinguished by a small semi-circle of standing maize at its core."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A rural backyard features swings, a climbing frame, a picnic table, and a brick barbecue, all visible from an upstairs window. Inside a bedroom, a framed photo on a bedside table depicts a smiling family: mum, dad, a young boy, and a girl, with the dad in a clerical collar. Suddenly, the same man, Graham Hess, wakes up, sits up in bed, and, after surveying the simple room, exits wearing a black t-shirt and pajama bottoms. As he walks barefoot along the landing, he pauses at a door adorned with children's drawings, listens briefly, and then returns to his bedroom, picking up some socks. In his mid-40s, with short dark hair and ruggedly handsome features, Graham brushes his teeth while glancing out the bathroom door before crossing the landing to the children's room for a quick look. Meanwhile, a younger man in another rural-style bedroom startles awake, listens intently, and then hurries downstairs. Graham rushes out of his farmhouse toward a whitewashed barn, joined by the younger man, Merrill. Together, they sprint through a field of maize, stopping at a gap with a clear pathway. Down the path, they spot a six-year-old girl. The men run to her; Graham grabs her arms, and Merrill lifts Bo as Graham continues through the maize to a fair-haired boy who gazes across the field. Graham redirects Morgan's attention, and Morgan guides his father’s gaze to what he was staring at. Graham, joined by Merrill with Bo, walks through the maize, stopping at a vast circle of flattened maize stalks. In awe, they stand at the perimeter, observing two large Alsatians pacing uneasily in the center. An aerial view reveals the family at the circle's edge, 100 yards in diameter, adjacent to another crop circle of the same size with a small standing semi-circle of maize."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A set of swings and a climbing frame stand in a rural backyard, typical of homes nestled in the expansive countryside known for its serene landscapes, along with a picnic table and a brick barbecue, structures that often host family gatherings, overlooked by an upstairs window which offers a sweeping view of the surrounding fields. Inside, a framed photo on a bedside table shows a smiling family: mum, dad, a young boy, and a girl. The dad wears a clerical collar, indicating his role as a priest or pastor in a local church community. Suddenly, the same man leans up on his elbows in bed, his eyes darting feverishly around the simply furnished room, which is adorned with rustic wooden furniture common in rural homes. He relaxes and sits up. The man, Graham Hess, a former Episcopal priest who left the ministry after a personal tragedy, comes out of his bedroom wearing a black t-shirt and pajama bottoms. He walks along the landing in his bare feet, feeling the cool hardwood floors beneath him, and comes to a closed door with some hand-drawn children's pictures stuck to it, showcasing the creativity of his children. Graham pauses for a moment to listen at the door, then returns to his bedroom, picking up some discarded socks on the way. He's in his mid-40s with short dark hair and a rugged handsome face that hints at a life spent mostly outdoors. Graham crosses the bathroom and stares out of the door, his toothbrush in his mouth, the minty taste lingering as he surveys his home. He strides across the landing, opens the door to the children's room, and glances around, noting the peacefulness that contrasts with his earlier tension. A younger man in a similar rural-style bedroom, reflecting the simplicity and functionality needed in a working farmhouse, suddenly jolts and tumbles out of bed. He jumps to his feet and strains to listen. Graham rushes out of his wooden farmhouse, originally built in the early 20th century as part of a homesteading effort, and heads towards a whitewashed barn, once used for housing livestock but now renovated for storage, while the younger man runs down a flight of steps from the other floor. Graham and the young man, Merrill, his brother who moved in to help with the farm after a failed baseball career, charge through a field of tall green maize, grown in neat rows for harvest season. They stop when they reach a gap and look along a clear pathway, which cuts through the crop. A dark-haired girl of about six-years-old stands a little further down the path. The two men run over to her, and Graham grabs her by the arms. Merrill picks up Bo, the little girl known for her quirky habit of leaving half-full glasses of water around the house, and Graham dashes on through the maize. He reaches a fair-haired boy of about 10, who stares glassily across the field. Graham turns Morgan's head to face him, sensing something extraordinary in his son's expression. Morgan puts his hand around his father's jaw and turns his head to face in the direction he had been staring. Graham stands and slowly walks through the maize, shadowed by Merrill, who's still carrying Bo in his arms. Graham stops and glances around anxiously, noticing the rustling of maize leaves in the breeze. He swallows hard and tentatively steps forward onto a sea of flattened maize stalks. Graham stares in wonder as he, Merrill, Morgan, and Bo come to the perimeter of a vast circular expanse of flattened maize, recognizing it as a crop circle, a phenomenon often attributed to extraterrestrial activity or human pranksters. Two large Alsatians, known for their herding instincts, pace around uneasily in the center. An aerial view shows Graham and his family standing in the circle, which is about 100 yards in diameter, a staggering sight that seems to defy simple explanation. Another crop circle lies beside it, the same size but with a small semi-circle of maize still standing within it, creating an intricate pattern whose meaning is elusive."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A set of swings and a climbing frame stand in a rural backyard along with a picnic table and a brick barbecue overlooked by an upstairs window. Inside a framed photo on a bedside table shows a smiling family mum dad a young boy and a girl. The dad wears a clerical collar. Suddenly the same man leans up on his elbows in bed his eyes darting feverishly around the simply furnished room. He relaxes and sits up. The man Graham Hess comes out of his bedroom wearing a black tshirt and pajama bottoms. He walks along the landing in his bare feet and comes to a closed door with some handdrawn children's pictures stuck to it. Graham pauses for a moment to listen at the door then returns to his bedroom picking up some discarded socks on the way. He is in his mid40s with short dark hair and a rugged handsome face. Graham crosses the bathroom and stares out of the door his toothbrush in his mouth. He strides across the landing opens the door to the children's room and glances around. A younger man in a similar ruralstyle bedroom suddenly jolts and tumbles out of bed. He jumps to his feet and strains to listen. Graham rushes out of his wooden farmhouse and heads towards a whitewashed barn while the younger man runs down a flight of steps from the other floor. Graham and the young man. Merrill charge through a field of tall green maize. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. They stop when they reach a gap and look along a clear pathway which cuts through the crop. A darkhaired girl of about sixyearsold stands a little further down the path. The two men run over to her and Graham grabs her by the arms. Merrill picks up Bo and Graham dashes on through the maize. He reaches a fairhaired boy of about 10 who stares glassily across the field. Graham turns Morgan's head to face him. Morgan puts his hand around his father's jaw and turns his head to face in the direction he had been staring. Graham stands and slowly walks through the maize followed by Merrill who is still carrying Bo in his arms. Graham stops and glances around anxiously. He swallows hard and tentatively steps forward onto a sea of flattened maize stalks. Graham stares in wonder as he Merrill. Morgan and Bo come to the perimeter of a vast circular expanse of flattened maize. Two large Alsatians pace around uneasily in the center. An aerial view shows Graham and his family standing in the circle which is about 100 yards in diameter. Another crop circle lies beside it. the same size but with a small semicircle of maize still standing within it."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A set of swings and a climbing frame stand in a rural backyard along with a picnic table and a brick barbecue overlooked by an upstairs window. Inside a framed photo on a bedside table shows a smiling family mum dad a young boy and a girl. The dad wears a clerical collar. Suddenly the same man leans up on his elbows in bed his eyes darting feverishly around the simply furnished room. He relaxes and sits up. The man Graham Hess comes out of his bedroom wearing a black tshirt and pajama bottoms. He walks along the landing in his bare feet and comes to a closed door with some handdrawn children's pictures stuck to it. Graham pauses for a moment to listen at the door then returns to his bedroom picking up some discarded socks on the way. He is in his mid40s with short dark hair and a rugged handsome face. Graham crosses the bathroom and stares out of the door his toothbrush in his mouth. He strides across the landing opens the door to the children's room and glances around. A younger man in a similar ruralstyle bedroom suddenly jolts and tumbles out of bed. He jumps to his feet and strains to listen. Graham rushes out of his wooden farmhouse and heads towards a whitewashed barn while the younger man runs down a flight of steps from the other floor. Graham and the young man. Merrill charge through a field of tall green maize. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. They stop when they reach a gap and look along a clear pathway which cuts through the crop. A darkhaired girl of about sixyearsold stands a little further down the path. The two men run over to her and Graham grabs her by the arms. Merrill picks up Bo and Graham dashes on through the maize. He reaches a fairhaired boy of about 10 who stares glassily across the field. Graham turns Morgan's head to face him. Morgan puts his hand around his father's jaw and turns his head to face in the direction he had been staring. Graham stands and slowly walks through the maize followed by Merrill who is still carrying Bo in his arms. Graham stops and glances around anxiously. He swallows hard and tentatively steps forward onto a sea of flattened maize stalks. Graham stares in wonder as he Merrill. Morgan and Bo come to the perimeter of a vast circular expanse of flattened maize. Two large Alsatians pace around uneasily in the center. An aerial view shows Graham and his family standing in the circle which is about 100 yards in diameter. Another crop circle lies beside it. the same size but with a small semicircle of maize still standing within it."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A set of swings and a climbing frame stand in a rural backyard along with a picnic table and a brick barbecue overlooked by an upstairs window. Inside a framed photo on a bedside table shows a smiling family mum dad a young boy and a girl. The dad wears a clerical collar. Suddenly the same man leans up on his elbows in bed his eyes darting feverishly around the simply furnished room. He relaxes and sits up. The man Graham Hess comes out of his bedroom wearing a black tshirt and pajama bottoms. He walks along the landing in his bare feet and comes to a closed door with some handdrawn children's pictures stuck to it. Graham pauses for a moment to listen at the door then returns to his bedroom picking up some discarded socks on the way. Graham stops and glances around anxiously. He swallows hard and tentatively steps forward onto a sea of flattened maize stalks. Graham stares in wonder as he Merrill. Morgan and Bo come to the perimeter of a vast circular expanse of flattened maize. Two large Alsatians pace around uneasily in the center. An aerial view shows Graham and his family standing in the circle which is about 100 yards in diameter. Another crop circle lies beside it. the same size but with a small semicircle of maize still standing within it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A set of swings and a climbing frame stand in a rural backyard along with a picnic table and a brick barbecue overlooked by an upstairs window. Inside a framed photo on a bedside table shows a smiling family mum dad a young boy and a girl. The dad wears a clerical collar. Suddenly the same man leans up on his elbows in bed his eyes darting feverishly around the simply furnished room. An aerial view shows Graham and his family standing in the circle which is about 100 yards in diameter. Another crop circle lies beside it. the same size but with a small semicircle of maize still standing within it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A collection of scooters and a slide stand in a bustling courtyard, alongside a chessboard and a metal grill, observed by a streetlight. Outside, a crumpled map on a coffee table displays a thoughtful couple: a pilot, a chef, a young cat, and a bird. The pilot wears a flower crown. Abruptly, the same person flips up on their hands on a bench, their fingers twitching calmly around the colorfully decorated area. They tense and stand up. The person, Arthur Lane, strolls out of their kitchen wearing a blue hoodie and jogging shorts. They amble along the promenade in their bright shoes and approach an open window with some printed travel brochures taped to it. Arthur hesitates for an instant to whistle at the window, then ventures back to the kitchen, retrieving some forgotten slippers on the journey. They're in their early 30s with long blonde hair and a quirky amused expression. Arthur maneuvers through the garage and peers out of the window, their comb in their hand. They march across the promenade, swings open the window to the children's playroom, and peers inside. An older woman in a similar suburban-style living room suddenly leaps and rolls out of an armchair. She springs to her feet and yawns to taste. Arthur jogs out of their brick villa and strides towards a yellowish greenhouse, while the older woman skips up a series of ladders to the attic. Arthur and the older woman, Sandra, glide through a meadow of short purple lavender. They pause when they reach an opening and observe a covered bridge, which zigzags through the flowers. A blonde cat of about two-years-old lounges a little further down the bridge. The two people trot over to it, and Arthur nudges it by the ears. Sandra scoops up Max, and Arthur leaps on across the lavender. They find a dark-haired rabbit of about 5, who gazes vacantly over the meadow. Arthur rotates Lily's paws to face them. Lily places their elbow around their parent's shoulder and rotates their face to focus in the direction they had been gazing. Arthur stands and gently hops through the lavender, shadowed by Sandra, who's still cradling Max in their hands. Arthur halts and peers around curiously. They gulp quietly and gingerly stroll onward onto a sheet of trampled purple petals. Arthur gawks in amazement as they, Sandra, Lily, and Max wander to the boundary of a tremendous oval patch of flattened lavender. Two small squirrels dance around merrily in the middle. A panoramic shot shows Arthur and their guild lounging in the field, which is about 300 feet in length. Another floral pattern reveals itself beside it, the same dimensions but with a tiny quarter-moon of lavender still flourishing within it."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A rural backyard features swings, a climbing frame, a picnic table, and a barbecue, overseen by an upstairs window. Inside, a photo of a smiling family with dad in a clerical collar is seen on a bedside table. Graham Hess, the dad, wakes abruptly, glances around his simple bedroom, and checks a children's room adorned with drawings before heading outside. In his 40s, with rugged features, Graham and his brother Merrill rush through a maize field upon seeing something unusual. They find Graham's daughter Bo and son Morgan standing in the crop. Graham turns Morgan's attention, and both face the same direction with concern. As Graham, Merrill carrying Bo, and Morgan navigate through the field, they discover a vast, circular area of flattened maize with pacing Alsatians in the center. The aerial view reveals another crop circle with a small semi-circle still standing beside it."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "the same size but with a small semicircle of maize still standing within it Another crop circle lies beside it An aerial view shows Graham and his family standing in the circle which is about 100 yards in diameter Two large Alsatians pace around uneasily in the center Morgan and Bo come to the perimeter of a vast circular expanse of flattened maize Graham stares in wonder as he Merrill He swallows hard and tentatively steps forward onto a sea of flattened maize stalks Graham stops and glances around anxiously Graham stands and slowly walks through the maize followed by Merrill who is still carrying Bo in his arms Morgan puts his hand around his father's jaw and turns his head to face in the direction he had been staring Graham turns Morgan's head to face him He reaches a fairhaired boy of about 10 who stares glassily across the field Merrill picks up Bo and Graham dashes on through the maize The two men run over to her and Graham grabs her by the arms A darkhaired girl of about sixyearsold stands a little further down the path They stop when they reach a gap and look along a clear pathway which cuts through the crop Merrill charge through a field of tall green maize Graham and the young man Graham rushes out of his wooden farmhouse and heads towards a whitewashed barn while the younger man runs down a flight of steps from the other floor He jumps to his feet and strains to listen A younger man in a similar ruralstyle bedroom suddenly jolts and tumbles out of bed He strides across the landing opens the door to the children's room and glances around Graham crosses the bathroom and stares out of the door his toothbrush in his mouth He is in his mid40s with short dark hair and a rugged handsome face Graham pauses for a moment to listen at the door then returns to his bedroom picking up some discarded socks on the way He walks along the landing in his bare feet and comes to a closed door with some handdrawn children's pictures stuck to it The man Graham Hess comes out of his bedroom wearing a black tshirt and pajama bottoms He relaxes and sits up Suddenly the same man leans up on his elbows in bed his eyes darting feverishly around the simply furnished room The dad wears a clerical collar Inside a framed photo on a bedside table shows a smiling family mum dad a young boy and a girl A set of swings and a climbing frame stand in a rural backyard along with a picnic table and a brick barbecue overlooked by an upstairs window"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Inside a framed photo on a bedside table shows a smiling family mum dad a young boy and a girl A set of swings and a climbing frame stand in a rural backyard along with a picnic table and a brick barbecue overlooked by an upstairs window Suddenly the same man leans up on his elbows in bed his eyes darting feverishly around the simply furnished room The dad wears a clerical collar The man Graham Hess comes out of his bedroom wearing a black tshirt and pajama bottoms He relaxes and sits up Graham pauses for a moment to listen at the door then returns to his bedroom picking up some discarded socks on the way He walks along the landing in his bare feet and comes to a closed door with some handdrawn children's pictures stuck to it Graham crosses the bathroom and stares out of the door his toothbrush in his mouth He is in his mid40s with short dark hair and a rugged handsome face A younger man in a similar ruralstyle bedroom suddenly jolts and tumbles out of bed He strides across the landing opens the door to the children's room and glances around Graham rushes out of his wooden farmhouse and heads towards a whitewashed barn while the younger man runs down a flight of steps from the other floor He jumps to his feet and strains to listen Merrill charge through a field of tall green maize Graham and the young man A darkhaired girl of about sixyearsold stands a little further down the path They stop when they reach a gap and look along a clear pathway which cuts through the crop Merrill picks up Bo and Graham dashes on through the maize The two men run over to her and Graham grabs her by the arms Graham turns Morgan's head to face him He reaches a fairhaired boy of about 10 who stares glassily across the field Graham stands and slowly walks through the maize followed by Merrill who is still carrying Bo in his arms Morgan puts his hand around his father's jaw and turns his head to face in the direction he had been staring He swallows hard and tentatively steps forward onto a sea of flattened maize stalks Graham stops and glances around anxiously Morgan and Bo come to the perimeter of a vast circular expanse of flattened maize Graham stares in wonder as he Merrill An aerial view shows Graham and his family standing in the circle which is about 100 yards in diameter Two large Alsatians pace around uneasily in the center the same size but with a small semicircle of maize still standing within it Another crop circle lies beside it"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They stop when they reach a gap and look along a clear pathway which cuts through the crop A darkhaired girl of about sixyearsold stands a little further down the path The two men run over to her and Graham grabs her by the arms Merrill picks up Bo and Graham dashes on through the maize He reaches a fairhaired boy of about 10 who stares glassily across the field Graham turns Morgan's head to face him Morgan puts his hand around his father's jaw and turns his head to face in the direction he had been staring Graham stands and slowly walks through the maize followed by Merrill who is still carrying Bo in his arms Graham stops and glances around anxiously He swallows hard and tentatively steps forward onto a sea of flattened maize stalks Graham stares in wonder as he Merrill Morgan and Bo come to the perimeter of a vast circular expanse of flattened maize Two large Alsatians pace around uneasily in the center An aerial view shows Graham and his family standing in the circle which is about 100 yards in diameter Another crop circle lies beside it the same size but with a small semicircle of maize still standing within it A set of swings and a climbing frame stand in a rural backyard along with a picnic table and a brick barbecue overlooked by an upstairs window Inside a framed photo on a bedside table shows a smiling family mum dad a young boy and a girl The dad wears a clerical collar Suddenly the same man leans up on his elbows in bed his eyes darting feverishly around the simply furnished room He relaxes and sits up The man Graham Hess comes out of his bedroom wearing a black tshirt and pajama bottoms He walks along the landing in his bare feet and comes to a closed door with some handdrawn children's pictures stuck to it Graham pauses for a moment to listen at the door then returns to his bedroom picking up some discarded socks on the way He is in his mid40s with short dark hair and a rugged handsome face Graham crosses the bathroom and stares out of the door his toothbrush in his mouth He strides across the landing opens the door to the children's room and glances around A younger man in a similar ruralstyle bedroom suddenly jolts and tumbles out of bed He jumps to his feet and strains to listen Graham rushes out of his wooden farmhouse and heads towards a whitewashed barn while the younger man runs down a flight of steps from the other floor Graham and the young man Merrill charge through a field of tall green maize"
        }
      ]
    }
  ]
}