{
  "ground_truth": "Ray is still staring ahead, and then he lowers his eyes and frowns as Graham regards him closely. Ray bows his head and reflects, his guilty eyes reluctant to confront Graham's gaze. Slowly, he turns and takes a breath, his doleful eyes lingering on Graham, then starts the engine and sits back in his seat while Graham stares. Ray peers earnestly at Graham, whose eyes moisten a little as he fights with his emotions. With his lips curled and features crumpled, Ray nods sufferingly before dropping his gaze as Graham turns to face Ray's clapboard home. At the farmhouse, in the closet under the stairs, Merrill is still watching TV, his brow creased with worry and lips slightly apart. Merrill moves his chair right up to the television and watches the camcorder footage of his hysterical young children inside the house, who are gathered by French windows pointing to the backyard, where tables laden with party food lie abandoned. The camera focuses on tall bushes at the back of the yard before returning to the interior and following the children as they swarm to another window. Merrill watches in frustration as a boy looks out on a narrow passageway, and the camera focuses on the passage. A lanky, dark figure with a human appearance steps across the passage and out of view, prompting Merrill to recoil, cupping a hand to his face in shock as he backs away from the TV. The film is rewound, and Merrill sits back down in front of the TV, watching with his mouth gaping as the picture freezes on the creature, the image flickering slightly. Graham enters Ray's house, pausing outside the open kitchen door, and steps timidly into the room, where chairs lie turned on the floor and tables wedge against the door leading into the pantry. A shadow passes under the door as Graham treads hesitantly toward it, accompanied by a sound. Graham stares intently at the gap under the door, and the shadow stops moving. He eyes the door anxiously, swallows, nods to himself, closes his eyes, and mouths \"Patty Wagon\" self-charmingly. The shadow under the door remains still as Graham glances briefly away from the door incredulously. Then, with his head turned wearily to one side and tucked defensively back a little, Graham drops delicately to a kneeling position, bends down, and, pressing his face to the tiles, peers under the pantry door, finding nothing but shards of glass. Kneeling up again and sighing with relief, he spots some chopped vegetables sitting on a worktop and a large kitchen knife lying next to them, which he contemplates for a moment before reaching out and grabbing it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Ray is still gazing ahead, and then he lowers his eyes and scowls as Graham observes him intently. Ray inclines his head and contemplates, his culpable eyes hesitant to meet Graham's look. Gradually, he pivots and inhales, his melancholy eyes lingering on Graham, then ignites the motor and reclines in his chair while Graham stares. Ray glances earnestly at Graham, whose eyes dampen slightly as he struggles with his feelings. With his lips curled and features crumpled, Ray nods sufferingly before dropping his gaze as Graham turns to face Ray's clapboard dwelling. At the farmhouse, in the closet under the stairs, Merrill is still watching TV, his brow furrowed with concern and lips slightly parted. Merrill shifts his seat right up to the television and watches the camcorder footage of his frantic young offspring inside the dwelling, who are clustered by French windows pointing to the backyard, where tables laden with festivity food lie deserted. The camera focuses on tall shrubs at the back of the yard before returning to the interior and following the children as they swarm to another window. Merrill observes in exasperation as a boy views a narrow passageway, and the camera focuses on the lane. A lanky, dark figure with a human semblance strides across the passage and out of sight, prompting Merrill to recoil, cupping a hand to his visage in astonishment as he retreats from the TV. The film is rewound, and Merrill sits back down in front of the TV, watching with his mouth agape as the picture freezes on the creature, the image flickering slightly. Graham enters Ray's residence, pausing outside the open kitchen door, and steps timidly into the space, where chairs lie overturned on the floor and tables wedge against the door leading into the pantry. A silhouette passes under the door as Graham treads cautiously toward it, accompanied by a noise. Graham stares intently at the gap under the door, and the shadow halts. He eyes the door nervously, swallows, nods to himself, closes his eyes, and mouths \"Patty Wagon\" self-charmingly. The shadow under the door remains still as Graham glances briefly away from the door incredulously. Then, with his head turned wearily to one side and tucked defensively back slightly, Graham descends delicately to a kneeling position, bends down, and, pressing his face to the tiles, peers under the pantry door, finding nothing but fragments of glass. Kneeling up again and exhaling with reassurance, he notices some chopped vegetables sitting on a worktop and a large kitchen knife lying adjacent to them, which he reflects on momentarily before reaching out and seizing it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Ray is still stared at by Graham, and then Ray's eyes are lowered and his frown is noticed by Graham as he closely regards Ray. His head is bowed by Ray as he reflects, his guilty eyes are reluctant to confront Graham's gaze. Slowly, a breath is taken by him and he turns, his doleful eyes lingering on Graham, then the engine is started by him and he sits back in his seat while Graham stares. Ray peers earnestly at Graham, whose eyes moisten a little as he fights with his emotions. With his lips curled and features crumpled, suffering is nodded by Ray before his gaze is dropped as Graham turns to face Ray's clapboard home. At the farmhouse, in the closet under the stairs, the TV is still watched by Merrill, his brow creased with worry and lips slightly apart. Merrill moves his chair right up to the television and watches the camcorder footage of his hysterical young children inside the house, who are gathered by French windows pointing to the backyard, where tables laden with party food have been abandoned. The camera focuses on tall bushes at the back of the yard before it returns to the interior and follows the children as they swarm to another window. Frustration is watched by Merrill as a boy looks out on a narrow passageway, and the passage is focused on by the camera. A lanky, dark figure with a human appearance steps across the passage and out of view, prompting Merrill to recoil, cupping a hand to his face in shock as he backs away from the TV. The film is rewound by him, and he sits back down in front of the TV, watching with his mouth gaping as the picture freezes on the creature, the image flickering slightly. Ray's house is entered by Graham, pausing outside the open kitchen door, and he timidly steps into the room, where chairs have been turned on the floor and tables wedge against the door leading into the pantry. A shadow passes under the door as Graham treads hesitantly toward it, accompanied by a sound. The gap under the door is stared at intently by Graham, and the shadow stops moving. He eyes the door anxiously, swallows, nods to himself, and, self-charmingly, \"Patty Wagon\" is mouthed by him. The shadow under the door remains still as the door is glanced at by Graham briefly and incredulously. Then, with his head turned wearily to one side and tucked defensively back a little, a delicate drop to a kneeling position is performed by Graham, and he bends down. Pressing his face to the tiles, under the pantry door is peered by him, finding nothing but shards of glass. Kneeling up again and sighing with relief, he spots some chopped vegetables sitting on a worktop, and a large kitchen knife lying next to them is contemplated by him for a moment before he reaches out and grabs it."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Ray stares ahead, then lowers his eyes and frowns as Graham watches him closely. Ray bows his head, avoiding Graham's gaze. He turns, breathes deeply, and starts the engine, his eyes lingering on Graham, who fights his emotions. Ray nods with a pained expression before looking away as Graham faces Ray's home. At the farmhouse, Merrill watches TV, worried, as camcorder footage shows his hysterical children by French windows pointing to the backyard, where tables with party food are abandoned. The camera focuses on bushes, then follows the children to another window. Merrill watches in frustration as a boy looks out at a passageway, where a dark figure appears, causing Merrill to recoil in shock. He rewinds the film, watching the creature's image freeze. Graham enters Ray's house, pausing at the kitchen door, where chairs are overturned and tables block the pantry door. A shadow passes under the door as Graham approaches, staring at the gap. He swallows, nods, and mouths \"Patty Wagon\" for comfort. The shadow remains still as Graham kneels, peers under the door, and sees only glass shards. Relieved, he notices chopped vegetables and a large knife on the worktop, which he grabs after a moment's thought."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Ray stares ahead, lowers his eyes, and frowns as Graham watches him. Ray bows his head, avoiding Graham's gaze, then turns, breathes, and starts the engine while Graham stares. Ray looks at Graham, whose eyes moisten with emotion. Ray nods sadly, dropping his gaze as Graham faces Ray's home. At the farmhouse, Merrill watches TV, worried, as camcorder footage shows his children by French windows pointing to the backyard with abandoned party food. The camera focuses on bushes, then follows the children to another window. Merrill watches as a boy looks at a passageway, where a dark figure appears, causing Merrill to recoil in shock. He rewinds the film, watching the creature's image freeze. Graham enters Ray's house, pausing at the kitchen door, where chairs are overturned and tables block the pantry door. A shadow passes under the door as Graham approaches, staring at the gap. He swallows, nods, and mouths \"Patty Wagon.\" The shadow stops, and Graham kneels, peers under the door, and sees only glass shards. Relieved, he notices chopped vegetables and a knife, which he grabs."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Ray continues to fix his gaze straight ahead, maintaining his focus for a moment longer before he eventually lowers his eyes and frowns deeply, all while Graham observes him with a keen and attentive eye. Ray bows his head in a gesture of contemplation, his eyes filled with guilt and hesitance, unwilling to meet Graham's penetrating gaze. With a slow and deliberate motion, he turns his body and takes a deep breath, his sorrowful eyes lingering on Graham for a moment longer. He then starts the engine of the vehicle and settles back into his seat, while Graham continues to stare at him intently. Ray looks earnestly at Graham, whose eyes begin to moisten slightly as he struggles to keep his emotions in check. With his lips curling and his features crumpling in a display of inner turmoil, Ray nods with a sense of suffering before dropping his gaze once more, as Graham turns his attention to face Ray's modest clapboard home. \n\nMeanwhile, at the farmhouse, in the small closet located under the stairs, Merrill remains seated, watching television with a furrowed brow and lips slightly parted in concern. Merrill moves his chair closer to the television screen, focusing intently on the camcorder footage that shows his young children in a state of hysteria inside the house. The children are gathered near the French windows, pointing anxiously toward the backyard, where tables once laden with party food now lie abandoned and forgotten. The camera shifts its focus to the tall bushes at the back of the yard before returning to the interior, following the children as they swarm toward another window. Merrill watches with growing frustration as a boy peers out into a narrow passageway, and the camera captures the scene. A lanky, dark figure, resembling a human, steps across the passage and quickly moves out of view, causing Merrill to recoil in shock, cupping a hand to his face as he backs away from the television. The film is rewound, and Merrill resumes his seat in front of the TV, his mouth agape as he watches the image freeze on the creature, the picture flickering slightly.\n\nGraham enters Ray's house, pausing momentarily outside the open kitchen door, and then steps cautiously into the room. Inside, chairs are overturned on the floor, and tables are wedged against the door leading into the pantry. A shadow passes under the door as Graham approaches it with hesitant steps, accompanied by a faint sound. Graham stares intently at the gap beneath the door, and the shadow comes to a halt. He eyes the door with anxiety, swallows hard, nods to himself in reassurance, closes his eyes, and mouths the words \"Patty Wagon\" in a self-charming manner. The shadow under the door remains motionless as Graham briefly glances away from the door in disbelief. Then, with his head turned wearily to one side and tucked defensively back a little, Graham gently lowers himself to a kneeling position. He bends down, pressing his face to the cool tiles, and peers under the pantry door, finding nothing but shards of glass scattered on the floor. Kneeling up again and exhaling a sigh of relief, he notices some chopped vegetables sitting on a worktop and a large kitchen knife lying next to them. He contemplates the knife for a moment before reaching out and grabbing it with determination."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Ray, with a stoic expression on his face, continues to maintain his unwavering gaze directly ahead, focusing intently for a little while longer. Eventually, he lowers his eyes, his brows drawing together in a deep frown. All the while, Graham watches him with a sharp and attentive eye, taking in every subtle shift in Ray's demeanor. Ray, bowing his head in a thoughtful manner, exudes an aura of contemplation, his eyes filled with the unmistakable signs of guilt and hesitance, seemingly unwilling to meet Graham’s penetrating and insightful gaze. With a slow, deliberate motion, he turns his body slightly, drawing in a deep, calming breath, his sorrowful eyes lingering on Graham just a moment longer. He then starts the engine of the vehicle, the mechanical rumble echoing softly as he settles back into his seat. Graham continues to fix his intense stare on Ray, observing him with a mix of concern and empathy. Ray looks earnestly at Graham, whose eyes begin to moisten slightly despite his struggles to keep his emotions firmly in check. With his lips curling and his features crumpling in a vivid display of inner turmoil, Ray nods with a sense of suffering and resignation before lowering his gaze once more. In response, Graham turns his attention away, directing his focus toward Ray’s modest clapboard home.\n\nMeanwhile, within the confines of the farmhouse, situated in the small, cramped closet located beneath the stairs, Merrill remains seated, his eyes glued to the television screen. His brow is furrowed, and his lips are slightly parted, conveying an air of concern and worry. Merrill shifts his chair closer to the television, trying to get a better view of the camcorder footage that plays out in front of him. On the screen, his young children are visibly distressed, their voices filled with hysteria as they move about the inside of the house. The children are gathered near the large French windows, their small hands pointing anxiously toward the backyard, where tables that were once abundantly laden with party food now lie abandoned and forgotten. The camera shifts, refocusing on the tall, dense bushes at the rear of the yard before swinging back to the interior, following the children as they swarm toward another window. Merrill watches with growing frustration as one of the boys peers cautiously out into the narrow passageway. The camera captures the moment when a lanky, dark figure—vaguely resembling a human form—steps across the passage and quickly vanishes from view. This sudden appearance causes Merrill to recoil in shock, his hand flying up to cup his face as he backs away from the television in disbelief. The film is rewound, and Merrill, his mouth agape, resumes his seat in front of the TV, eyes wide as he watches the image freeze on the elusive creature, the picture flickering slightly.\n\nGraham makes his way into Ray’s house, coming to a brief halt outside the open kitchen door, before cautiously stepping into the room. Inside, the scene is one of disarray—chairs lie overturned on the floor, and tables are wedged against the door leading into the pantry. A shadow passes under the pantry door as Graham approaches with hesitant steps, his movement accompanied by a faint, indiscernible sound. Graham fixes his intense stare on the gap beneath the door, noting how the shadow suddenly comes to a halt. With a mixture of anxiety and determination, he eyes the door, swallows hard, and nods to himself as a form of self-reassurance. Closing his eyes momentarily, he mouths the words “Patty Wagon” in an effort to calm his nerves. The shadow under the door remains motionless as Graham glances away briefly, filled with disbelief. Then, with his head turned wearily to one side and tucked defensively back, Graham gently lowers himself into a kneeling position. He bends down carefully, pressing his face against the cool, hard tiles, peering under the pantry door, and finds nothing but shards of glass scattered across the floor. Kneeling up again, he exhales a deep sigh of relief. His eyes then catch sight of some chopped vegetables sitting on a nearby worktop, with a large kitchen knife lying next to them. He contemplates the knife for a moment, his mind racing, before reaching out and grabbing it with a renewed sense of determination."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Ray continues to stare straight ahead, his gaze fixed and unwavering, until he gradually lowers his eyes, a frown forming on his face as he becomes aware of Graham's close scrutiny. With a sense of introspection, Ray bows his head, his eyes filled with guilt and hesitance, avoiding direct eye contact with Graham. Slowly, he turns his body, taking a deep breath, his sorrowful eyes lingering on Graham for a moment longer before he starts the engine of the vehicle. He then leans back into his seat, settling in as Graham continues to stare at him. Ray looks earnestly at Graham, whose eyes begin to moisten slightly as he struggles to contain his emotions. With his lips curling and his facial features crumpling in distress, Ray nods in a manner that conveys his suffering, before dropping his gaze once more as Graham shifts his attention to Ray's clapboard home. Meanwhile, at the farmhouse, Merrill is seated in the closet under the stairs, his eyes fixed on the television screen, his brow furrowed with worry and his lips slightly parted. He moves his chair closer to the TV, intently watching the camcorder footage that shows his hysterical young children inside the house. The children are gathered by the French windows, pointing towards the backyard, where tables laden with party food have been left abandoned. The camera pans to focus on the tall bushes at the back of the yard before returning to the interior, following the children as they rush to another window. Merrill watches with growing frustration as a boy peers out into a narrow passageway, and the camera zooms in on the passage. Suddenly, a lanky, dark figure with a human-like appearance steps across the passage and disappears from view, causing Merrill to recoil in shock, his hand cupping his face as he backs away from the TV. The film is rewound, and Merrill resumes his position in front of the TV, his mouth agape as he watches the image freeze on the creature, the picture flickering slightly. At Ray's house, Graham enters cautiously, pausing outside the open kitchen door before stepping timidly into the room. He observes the disarray, with chairs overturned on the floor and tables pushed against the door leading into the pantry. As he treads hesitantly toward the door, a shadow passes underneath, accompanied by a sound that catches his attention. Graham stares intently at the gap under the door, noticing that the shadow has stopped moving. He eyes the door with anxiety, swallows hard, nods to himself in reassurance, closes his eyes, and mouths the words \"Patty Wagon\" as a self-charming mantra. The shadow remains still as Graham briefly glances away from the door in disbelief. Then, with his head turned wearily to one side and tucked defensively back, he gently lowers himself into a kneeling position. He bends down, pressing his face against the cool tiles, and peers under the pantry door, only to find shards of glass scattered on the floor. Relieved, he kneels up again and sighs, his eyes catching sight of some chopped vegetables on a worktop and a large kitchen knife lying beside them. He contemplates the knife for a moment before reaching out decisively to grab it."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Ray, still staring ahead, lowers his eyes and frowns as Graham regards him closely. Bowing his head in reflection, Ray avoids Graham's gaze, then turns, takes a breath, and starts the engine, his eyes lingering on Graham. As Graham's eyes moisten with emotion, Ray nods with a pained expression before dropping his gaze while Graham turns toward Ray's clapboard home. At the farmhouse, Merrill, worried, watches TV in the closet under the stairs. He moves closer to the screen, viewing camcorder footage of his hysterical children pointing to the backyard, where tables with party food lie abandoned. The camera shifts from the bushes to the children swarming to another window. Merrill watches in frustration as a boy looks out at a passageway, where a lanky, dark figure briefly appears, causing Merrill to recoil in shock. He rewinds the film and watches again, mouth agape, as the image freezes on the creature. Meanwhile, Graham enters Ray's house, pausing at the open kitchen door. He steps into the room, where overturned chairs and tables block the pantry door. A shadow passes under the door as Graham approaches cautiously, staring at the gap. He swallows, nods to himself, and mouths \"Patty Wagon\" for reassurance. The shadow remains still as Graham glances away incredulously. He then kneels, peers under the pantry door, and finds only glass shards. Relieved, he notices chopped vegetables and a large kitchen knife on the worktop, which he contemplates before reaching for it."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Ray is still staring ahead, and then he lowers his eyes and frowns as Graham regards him closely. Ray bows his head and reflects, his guilty eyes reluctant to confront Graham's gaze. Graham, whose family has lived in the rural area for generations, embodies the weight of shared history and local tradition. Slowly, Ray turns and takes a breath, his doleful eyes lingering on Graham, then starts the engine—a classic 1970s pickup truck that Ray painstakingly restored—and sits back in his seat while Graham stares. Ray peers earnestly at Graham, whose eyes moisten a little as he fights with his emotions that stem partly from their childhood friendship, now strained by recent tensions. With his lips curled and features crumpled, Ray nods sufferingly before dropping his gaze as Graham turns to face Ray's clapboard home, a structure typical of the early 20th century with its weathered wood siding. At the farmhouse, in the closet under the stairs, Merrill is still watching TV, his brow creased with worry and lips slightly apart. Merrill moves his chair right up to the television, an older model with a slightly curved screen, and watches the camcorder footage of his hysterical young children inside the house, who are gathered by French windows pointing to the backyard, where tables laden with party food lie abandoned. The camera focuses on tall bushes—rhododendrons common to the region—at the back of the yard before returning to the interior and following the children as they swarm to another window. Merrill watches in frustration as a boy looks out on a narrow passageway, and the camera focuses on the passage. A lanky, dark figure with a human appearance steps across the passage and out of view, prompting Merrill to recoil, cupping a hand to his face in shock as he backs away from the TV. The film is rewound, and Merrill sits back down in front of the TV, watching with his mouth gaping as the picture freezes on the creature, the image flickering slightly due to the tape's age. Graham enters Ray's house, pausing outside the open kitchen door, and steps timidly into the room, where chairs lie turned on the floor and tables wedge against the door leading into the pantry. A shadow passes under the door as Graham treads hesitantly toward it, accompanied by a sound that recalls the creaking of old houses settling. Graham stares intently at the gap under the door, and the shadow stops moving. He eyes the door anxiously, swallows, nods to himself, closes his eyes, and mouths \"Patty Wagon\" self-charmingly—a phrase from his childhood used to instill courage. The shadow under the door remains still as Graham glances briefly away from the door incredulously. Then, with his head turned wearily to one side and tucked defensively back a little, Graham drops delicately to a kneeling position, bends down, and, pressing his face to the tiles, peers under the pantry door, finding nothing but shards of glass likely from a broken window during the commotion. Kneeling up again and sighing with relief, he spots some chopped vegetables sitting on a worktop and a large kitchen knife lying next to them, an odd sight in an otherwise chaotic room, which he contemplates for a moment before reaching out and grabbing it."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Ray bows his head and reflects his guilty eyes reluctant to confront Graham's gaze  Slowly he turns and takes a breath his doleful eyes lingering on  Graham then starts the engine and sits back in his seat while Graham stares  Ray peers earnestly at Graham whose eyes moisten a little as he fights with his emotions  With his lips curled and features crumpled Ray nods sufferingly before dropping his gaze as Graham turns to face Ray's clapboard home  At the farmhouse in the closet under the stairs Merrill is still watching TV his brow creased with worry and lips slightly apart  Merrill moves his chair right up to the television and watches the camcorder footage of his hysterical young children inside the house who are gathered by French windows pointing to the backyard where tables laden with party food lie abandoned  The camera focuses on tall bushes at the back of the yard before returning to the interior and following the children as they swarm to another window  Merrill watches in frustration as a boy looks out on a narrow passageway and the camera focuses on the passage  A lanky dark figure with a human appearance steps across the passage and out of view prompting Merrill to recoil cupping a hand to his face in shock as he backs away from the TV  Ray is still staring ahead and then he lowers his eyes and frowns as Graham regards him closely  Ray bows his head and reflects his guilty eyes reluctant to confront Graham's gaze  Slowly he turns and takes a breath his doleful eyes lingering on  Graham then starts the engine and sits back in his seat while Graham stares  Ray peers earnestly at Graham whose eyes moisten a little as he fights with his emotions  With his lips curled and features crumpled Ray nods sufferingly before dropping his gaze as Graham turns to face Ray's clapboard home  At the farmhouse in the closet under the stairs Merrill is still watching TV his brow creased with worry and lips slightly apart  Merrill moves his chair right up to the television and watches the camcorder footage of his hysterical young children inside the house who are gathered by French windows pointing to the backyard where tables laden with party food lie abandoned  The camera focuses on tall bushes at the back of the yard before returning to the interior and following the children as they swarm to another window  Merrill watches in frustration as a boy looks out on a narrow passageway and the camera focuses on the passage  A lanky dark figure with a human appearance steps across the passage and out of view prompting Merrill to recoil cupping a hand to his face in shock as he backs away from the TV  The film is rewound and Merrill sits back down in front of the TV watching with his mouth gaping as the picture freezes on the creature the image flickering slightly  Graham enters Ray's house pausing outside the open kitchen door and steps timidly into the room where chairs lie turned on the floor and tables wedge against the door leading into the pantry  A shadow passes under the door as Graham treads hesitantly toward it accompanied by a sound  Graham stares intently at the gap under the door and the shadow stops moving  He eyes the door anxiously swallows nods to himself closes his eyes and mouths Patty Wagon selfcharmingly  The shadow under the door remains still as Graham glances briefly away from the door incredulously  Then with his head turned wearily to one side and tucked defensively back a little Graham drops delicately to a kneeling position bends down and pressing his face to the tiles peers under the pantry door finding nothing but shards of glass  Kneeling up again and sighing with relief he spots some chopped vegetables sitting on a worktop and a large kitchen knife lying next to them which he contemplates for a moment before reaching out and grabbing it"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Ray is still staring ahead and then he lowers his eyes and frowns as Graham regards him closely. Ray bows his head and reflects his guilty eyes reluctant to confront Graham's gaze. Slowly he turns and takes a breath his doleful eyes lingering on. Graham then starts the engine and sits back in his seat while Graham stares. Ray peers earnestly at Graham whose eyes moisten a little as he fights with his emotions. With his lips curled and features crumpled Ray nods sufferingly before dropping his gaze as Graham turns to face Ray's clapboard home. At the farmhouse in the closet under the stairs Merrill is still watching TV his brow creased with worry and lips slightly apart. Merrill moves his chair right up to the television and watches the camcorder footage of his hysterical young children inside the house who are gathered by French windows pointing to the backyard where tables laden with party food lie abandoned. The camera focuses on tall bushes at the back of the yard before returning to the interior and following the children as they swarm to another window. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Merrill watches in frustration as a boy looks out on a narrow passageway and the camera focuses on the passage. A lanky dark figure with a human appearance steps across the passage and out of view prompting Merrill to recoil cupping a hand to his face in shock as he backs away from the TV. The film is rewound and Merrill sits back down in front of the TV watching with his mouth gaping as the picture freezes on the creature the image flickering slightly. Graham enters Ray's house pausing outside the open kitchen door and steps timidly into the room where chairs lie turned on the floor and tables wedge against the door leading into the pantry. A shadow passes under the door as Graham treads hesitantly toward it accompanied by a sound. Graham stares intently at the gap under the door and the shadow stops moving. He eyes the door anxiously swallows nods to himself closes his eyes and mouths Patty Wagon selfcharmingly. The shadow under the door remains still as Graham glances briefly away from the door incredulously. Then with his head turned wearily to one side and tucked defensively back a little Graham drops delicately to a kneeling position bends down and pressing his face to the tiles peers under the pantry door finding nothing but shards of glass. Kneeling up again and sighing with relief he spots some chopped vegetables sitting on a worktop and a large kitchen knife lying next to them which he contemplates for a moment before reaching out and grabbing it."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Ray is still staring ahead and then he lowers his eyes and frowns as Graham regards him closely. Ray bows his head and reflects his guilty eyes reluctant to confront Graham's gaze. Slowly he turns and takes a breath his doleful eyes lingering on. Graham then starts the engine and sits back in his seat while Graham stares. Ray peers earnestly at Graham whose eyes moisten a little as he fights with his emotions. With his lips curled and features crumpled Ray nods sufferingly before dropping his gaze as Graham turns to face Ray's clapboard home. At the farmhouse in the closet under the stairs Merrill is still watching TV his brow creased with worry and lips slightly apart. Merrill moves his chair right up to the television and watches the camcorder footage of his hysterical young children inside the house who are gathered by French windows pointing to the backyard where tables laden with party food lie abandoned. The camera focuses on tall bushes at the back of the yard before returning to the interior and following the children as they swarm to another window. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Merrill watches in frustration as a boy looks out on a narrow passageway and the camera focuses on the passage. A lanky dark figure with a human appearance steps across the passage and out of view prompting Merrill to recoil cupping a hand to his face in shock as he backs away from the TV. The film is rewound and Merrill sits back down in front of the TV watching with his mouth gaping as the picture freezes on the creature the image flickering slightly. Graham enters Ray's house pausing outside the open kitchen door and steps timidly into the room where chairs lie turned on the floor and tables wedge against the door leading into the pantry. A shadow passes under the door as Graham treads hesitantly toward it accompanied by a sound. Graham stares intently at the gap under the door and the shadow stops moving. He eyes the door anxiously swallows nods to himself closes his eyes and mouths Patty Wagon selfcharmingly. The shadow under the door remains still as Graham glances briefly away from the door incredulously. Then with his head turned wearily to one side and tucked defensively back a little Graham drops delicately to a kneeling position bends down and pressing his face to the tiles peers under the pantry door finding nothing but shards of glass. Kneeling up again and sighing with relief he spots some chopped vegetables sitting on a worktop and a large kitchen knife lying next to them which he contemplates for a moment before reaching out and grabbing it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Ray is still staring ahead and then he lowers his eyes and frowns as Graham regards him closely. Ray bows his head and reflects his guilty eyes reluctant to confront Graham's gaze. Slowly he turns and takes a breath his doleful eyes lingering on. Graham then starts the engine and sits back in his seat while Graham stares. Ray peers earnestly at Graham whose eyes moisten a little as he fights with his emotions. Graham stares intently at the gap under the door and the shadow stops moving. He eyes the door anxiously swallows nods to himself closes his eyes and mouths Patty Wagon selfcharmingly. The shadow under the door remains still as Graham glances briefly away from the door incredulously. Then with his head turned wearily to one side and tucked defensively back a little Graham drops delicately to a kneeling position bends down and pressing his face to the tiles peers under the pantry door finding nothing but shards of glass. Kneeling up again and sighing with relief he spots some chopped vegetables sitting on a worktop and a large kitchen knife lying next to them which he contemplates for a moment before reaching out and grabbing it."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Ray is still staring ahead and then he lowers his eyes and frowns as Graham regards him closely. Ray bows his head and reflects his guilty eyes reluctant to confront Graham's gaze. Then with his head turned wearily to one side and tucked defensively back a little Graham drops delicately to a kneeling position bends down and pressing his face to the tiles peers under the pantry door finding nothing but shards of glass. Kneeling up again and sighing with relief he spots some chopped vegetables sitting on a worktop and a large kitchen knife lying next to them which he contemplates for a moment before reaching out and grabbing it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The owl is still staring ahead, and then it lowers its eyes and frowns as the squirrel regards it closely. The owl bows its head and reflects, its guilty eyes reluctant to confront the squirrel's gaze. Slowly, it turns and takes a breath, its doleful eyes lingering on the squirrel, then starts the engine and sits back in its seat while the squirrel stares. The owl peers earnestly at the squirrel, whose eyes moisten a little as it fights with its emotions. With its lips curled and features crumpled, the owl nods sufferingly before dropping its gaze as the squirrel turns to face the owl's clapboard home. At the farmhouse, in the closet under the stairs, the dolphin is still watching TV, its brow creased with worry and lips slightly apart. The dolphin moves its chair right up to the television and watches the camcorder footage of its hysterical young children inside the house, who are gathered by French windows pointing to the backyard, where tables laden with party food lie abandoned. The camera focuses on tall bushes at the back of the yard before returning to the interior and following the children as they swarm to another window. The dolphin watches in frustration as a rabbit looks out on a narrow passageway, and the camera focuses on the passage. A lanky, dark figure with a human appearance steps across the passage and out of view, prompting the dolphin to recoil, cupping a hand to its face in shock as it backs away from the TV. The film is rewound, and the dolphin sits back down in front of the TV, watching with its mouth gaping as the picture freezes on the creature, the image flickering slightly. The squirrel enters the owl's house, pausing outside the open kitchen door, and steps timidly into the room, where chairs lie turned on the floor and tables wedge against the door leading into the pantry. A shadow passes under the door as the squirrel treads hesitantly toward it, accompanied by a sound. The squirrel stares intently at the gap under the door, and the shadow stops moving. It eyes the door anxiously, swallows, nods to itself, closes its eyes, and mouths \"Patty Wagon\" self-charmingly. The shadow under the door remains still as the squirrel glances briefly away from the door incredulously. Then, with its head turned wearily to one side and tucked defensively back a little, the squirrel drops delicately to a kneeling position, bends down, and, pressing its face to the tiles, peers under the pantry door, finding nothing but shards of glass. Kneeling up again and sighing with relief, it spots some chopped vegetables sitting on a worktop and a large kitchen knife lying next to them, which it contemplates for a moment before reaching out and grabbing it."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Ray is still staring ahead, and then he lowers his eyes and frowns as Graham regards him closely. Ray bows his head and reflects, his guilty eyes reluctant to confront Graham's gaze. Slowly, he turns and takes a breath, his doleful eyes lingering on Graham, then starts the lawnmower and sits back in his chair while Graham stares. Ray peers earnestly at Graham, whose eyes moisten a little as he fights with his emotions. With his lips curled and features crumpled, Ray nods sufferingly before dropping his gaze as Graham turns to face Ray's igloo. At the greenhouse, in the cabinet under the sink, Merrill is still watching a fish tank, his brow creased with worry and lips slightly apart. Merrill moves his chair right up to the aquarium and watches the security footage of his hysterical young children inside the cave, who are gathered by sliding doors pointing to the alley, where benches laden with picnic supplies lie abandoned. The camera focuses on tall trees at the back of the alley before returning to the interior and following the children as they swarm to another window. Merrill watches in frustration as a boy looks out on a narrow hallway, and the camera focuses on the hallway. A lanky, dark figure with a human appearance steps across the hallway and out of view, prompting Merrill to recoil, cupping a hand to his face in shock as he backs away from the aquarium. The film is rewound, and Merrill sits back down in front of the aquarium, watching with his mouth gaping as the picture freezes on the creature, the image flickering slightly. Graham enters Ray's tent, pausing outside the open garage door, and steps timidly into the room, where rugs lie turned on the floor and sofas wedge against the door leading into the attic. A shadow passes under the door as Graham treads hesitantly toward it, accompanied by a sound. Graham stares intently at the gap under the door, and the shadow stops moving. He eyes the door anxiously, swallows, nods to himself, closes his eyes, and mouths \"Soda Pop\" self-charmingly. The shadow under the door remains still as Graham glances briefly away from the door incredulously. Then, with his head turned wearily to one side and tucked defensively back a little, Graham drops delicately to a kneeling position, bends down, and, pressing his face to the carpet, peers under the attic door, finding nothing but scraps of paper. Kneeling up again and sighing with relief, he spots some peeled potatoes sitting on a countertop and a large frying pan lying next to them, which he contemplates for a moment before reaching out and grabbing it."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Ray is still staring ahead, and then he scratches his cheek and grins as Graham observes him closely. Ray raises his head and imagines, his guilty eyes reluctant to engage with Graham's gaze. Slowly, he pivots and whistles, his doleful eyes lingering on Graham, then revs the engine and reclines in his seat while Graham blinks. Ray squints thoughtfully at Graham, whose eyes brighten a little as he wrestles with his emotions. With his lips pursed and features relaxed, Ray winks playfully before averting his gaze as Graham turns to face Ray's clapboard home. At the farmhouse, in the closet under the stairs, Merrill is still munching on snacks, his brow furrowed with concentration and lips slightly parted. Merrill slides his chair away from the television and analyzes the camcorder footage of his giggling young children inside the house, who are gathered by French windows pointing to the backyard, where tables laden with party hats lie scattered. The camera zooms in on tall bushes at the back of the yard before returning to the interior and following the children as they tiptoe to another window. Merrill sighs in exasperation as a boy peers out on a narrow passageway, and the camera pans to the passage. A lanky, dark figure with a human appearance strolls across the passage and out of view, prompting Merrill to chuckle, rubbing a hand on his chin in disbelief as he leans away from the TV. The film is fast-forwarded, and Merrill leans back down in front of the TV, watching with his mouth pursed as the picture freezes on the creature, the image wavering slightly. Graham enters Ray's house, pausing outside the open kitchen door, and shuffles silently into the room, where chairs lie upright on the floor and tables lean against the door leading into the pantry. A shadow slides under the door as Graham steps carefully toward it, accompanied by a whistle. Graham glances intensely at the gap under the door, and the shadow shifts slightly. He examines the door nervously, inhales, nods to himself, closes his eyes, and mouths \"Patty Wagon\" soothingly. The shadow under the door remains unmoved as Graham looks briefly away from the door curiously. Then, with his head turned confidently to one side and tucked securely back a little, Graham drops gracefully to a squatting position, leans down, and, pressing his face to the tiles, peers under the pantry door, finding nothing but a scattering of papers. Standing up again and exhaling with relief, he spots some ripe fruits sitting on a worktop and a large kitchen knife lying next to them, which he considers for a moment before reaching out and lifting it."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The bicycle is still staring ahead, and then it lowers its book and frowns as the pineapple regards it closely. The bicycle bows its wheel and reflects, its guilty pages reluctant to confront the pineapple's gaze. Slowly, it turns and takes a breath, its doleful pages lingering on the pineapple, then starts the blender and sits back in its hammock while the pineapple stares. The bicycle peers earnestly at the pineapple, whose pages moisten a little as it fights with its emotions. With its wheels curled and features crumpled, the bicycle nods sufferingly before dropping its gaze as the pineapple turns to face the bicycle's lighthouse. At the flowerpot, in the drawer under the bed, the umbrella is still watching a lamp, its stem creased with worry and leaves slightly apart. The umbrella moves its couch right up to the lamp and watches the smartphone footage of its hysterical young rabbits inside the treehouse, who are gathered by velvet curtains pointing to the bathtub, where jars laden with pizza lie abandoned. The microphone focuses on tiny flowers at the back of the bathtub before returning to the interior and following the rabbits as they swarm to another curtain. The umbrella watches in frustration as a noodle looks out on a narrow corridor, and the microphone focuses on the corridor. A short, furry cloud with an animal appearance steps across the corridor and out of view, prompting the umbrella to recoil, cupping a wheel to its balloon in shock as it backs away from the lamp. The film is rewound, and the umbrella sits back down in front of the lamp, watching with its spoon gaping as the picture freezes on the specter, the image flickering slightly. The pineapple enters the bicycle's lighthouse, pausing outside the open garage window, and steps timidly into the forest, where mirrors lie turned on the carpet and lamps wedge against the curtain leading into the suitcase. A whisper passes under the curtain as the pineapple treads hesitantly toward it, accompanied by a thunderstorm. The pineapple stares intently at the gap under the curtain, and the whisper stops moving. It eyes the curtain anxiously, swallows, nods to itself, closes its wheels, and mouths \"Jelly Couch\" self-charmingly. The whisper under the curtain remains still as the pineapple glances briefly away from the curtain incredulously. Then, with its cloud turned wearily to one side and tucked defensively back a little, the pineapple drops delicately to a kneeling position, bends down, and, pressing its cloud to the cushions, peers under the suitcase curtain, finding nothing but feathers of paper. Kneeling up again and sighing with relief, it spots some folded maps sitting on a shelf and a large wooden spoon lying next to them, which it contemplates for a moment before reaching out and grabbing it."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Sam is still gazing ahead, and then he raises his eyes and grins as Mark observes him intently. Sam shakes his head and muses, his curious eyes hesitant to meet Mark's gaze. Gradually, he pivots and exhales, his wistful eyes resting on Mark, then kills the engine and leans forward in his seat while Mark glances. Sam gazes wistfully at Mark, whose eyes brighten a little as he wrestles with his feelings. With his lips stretched and features brightened, Sam shakes thoughtfully before lifting his gaze as Mark shifts to admire Sam's brick house. At the farmhouse, in the attic above the garage, John is still playing video games, his forehead relaxed with focus and lips slightly parted. John shifts his chair away from the console and plays the camcorder footage of his laughing young children outside the garage, who are gathered by sliding doors pointing to the driveway, where bicycles laden with groceries lie unattended. The camera pans to dense trees at the front of the property before returning to the exterior and following the children as they trot to another doorway. John plays in bewilderment as a girl peers out on a wide alleyway, and the camera pans to the alley. A short, bright figure with an animal appearance hops across the alley and out of sight, prompting John to leap, covering his mouth in awe as he steps toward the console. The film is fast-forwarded, and John stands up in front of the console, playing with his mouth closed as the picture freezes on the entity, the image shimmering slightly. Mark leaves Sam's house, pausing inside the closed living room door, and moves boldly out of the room, where rugs lie straight on the floor and desks stand against the window leading into the garden. A shadow sways above the window as Mark walks confidently away from it, accompanied by a murmur. Mark glances vaguely at the ceiling above the window, and the shadow continues moving. He eyes the window eagerly, breathes deeply, nods to himself, opens his eyes, and whispers \"Magic Carpet\" self-assuredly. The shadow above the window moves as Mark gazes briefly toward the window curiously. Then, with his head lifted happily to one side and extended steadily forward a little, Mark rises eagerly to a standing position, stretches up, and, pressing his face to the tiles, gazes above the garden door, finding nothing but leaves and petals. Standing again and smiling with delight, he spots some spices sitting on a counter and a small spoon lying beside them, which he considers for a moment before reaching out and tossing it."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Ray is still staring ahead, and then he lifts his chin and grins as Graham examines him curiously. Ray raises his head and imagines, his innocent eyes eager to meet Graham's gaze. Gradually, he swivels and exhales, his hopeful eyes resting on Graham, then stops the bicycle and leans forward on his seat while Graham laughs. Ray glances cheerfully at Graham, whose eyes brighten a little as he plays with his emotions. With his lips pursed and features relaxed, Ray shakes his head sympathetically before raising his gaze as Graham turns to glance at Ray's brick house. At the lake house, in the attic above the garage, Merrill is still listening to the radio, his brow smooth with calm and lips tightly sealed. Merrill drags his chair far from the stereo and listens to the cassette recording of his ecstatic young children outside the barn, who are huddled by bay windows pointing to the front yard, where baskets filled with party toys lie scattered. The recorder zooms in on short hedges at the side of the yard before moving to the exterior and following the children as they wander to another door. Merrill listens in amusement as a girl peers through a wide alleyway, and the recorder zooms in on the alley. A stocky, bright figure with a feline appearance leaps across the alley and into view, prompting Merrill to chuckle, covering a hand to his face in delight as he walks towards the stereo. The recording pauses, and Merrill stands up from the stereo, listening with his mouth closed as the sound stills on the creature, the audio crackling slightly. Graham leaves Ray's house, pausing inside the closed dining room door, and skips confidently out of the hallway, where paintings hang upright on the wall and tables rest against the door leading to the basement. A light flickers above the door as Graham paces vigorously toward it, accompanied by a whisper. Graham listens avidly to the noise above the door, and the light fades out. He touches the door eagerly, sniffs, nods to himself, opens his eyes, and whispers \"Magic Carpet\" self-approvingly. The light above the door stays dark as Graham focuses intently on the door seriously. Then, with his head tilted proudly to one side and held assertively forward a little, Graham rises gracefully to a standing position, leans up, and, pressing his ear to the wall, listens above the basement door, hearing nothing but the hum of bees. Standing upright again and exhaling with satisfaction, he spots some ripe fruits resting on a counter and a small pencil lying next to them, which he considers for a moment before reaching out and sketching with it."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Jasper is still gazing upward, and then he raises his chin and smiles as Neville observes him distantly. Jasper lifts his gaze and imagines, his innocent nose eager to avoid Neville's laughter. Quickly, he spins and holds a whistle, his cheerful nose drifting away from Neville, then halts the bicycle and leaps forward in his hammock while Neville yawns. Jasper grins shyly at Neville, whose nose dries a little as he giggles with his balloons. With his eyebrows arched and features smoothed, Jasper shakes gladly before lifting his chuckle as Neville dances to witness Jasper's stone cottage. At the barn, in the drawer beside the couch, Oliver is still reading the newspaper, his smile relaxed with calm and chin gently closed. Oliver pushes his sofa closer to the bookcase and reads the scrapbook images of his joyful old pets outside the stable, which are clustered by wooden gates gesturing to the orchard, where blankets covered with picnic snacks lie forgotten. The photograph zooms in on short fences at the side of the park before moving to the barn and following the pets as they race to another painting. Oliver reads in amazement as a cat peeks out on a wide boulevard, and the photograph paints the street. A squat, bright creature with a feline costume hops across the boulevard and into sight, prompting Oliver to laugh, placing a paw to his toe in delight as he bounces toward the bookcase. The newspaper is discarded, and Oliver leaps across from the bookcase, reading with his nose grinning as the painting disappears on the dancer, the color vanishing completely. Neville skips Jasper's cottage, resting behind the closed garage window, and dances cheerfully into the garden, where blankets stand upright on the ceiling and couches lean against the curtain leading into the basement. A light shines over the curtain as Neville leaps boldly away from it, accompanied by a rhythm. Neville sings softly about the gap above the curtain, and the light starts flashing. He turns the curtain joyfully, sings, shakes to himself, opens his ears, and whispers \"Pony Express\" self-jovially. The light over the curtain continues shimmering as Neville gazes briefly toward the curtain regretfully. Then, with his leg leaped forward to one side and held cheerfully outward a lot, Neville lifts gently to a standing position, taps up, and, pressing his toes to the carpet, gazes over the basement curtain, discovering everything except fragments of cloth. Standing down again and chuckling with humor, he notes some baked bread sitting on a mantelpiece and a small garden spade resting next to it, which he disregards for a moment before reaching down and tossing it."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ray struggles with guilt as he exchanges an emotional gaze with Graham before starting the car engine. At the farmhouse, Merrill watches TV footage of his panicked children as they point at party tables left outside. The camera then shows a dark, human-like figure in the backyard, causing Merrill to recoil in shock. Replaying the footage, Merrill watches in disbelief as the screen freezes on the mysterious creature. Meanwhile, Graham cautiously enters Ray's disordered house, noticing shadows and sounds under a pantry door. Reassuring himself, Graham kneels to look under the door, finding only broken glass. Relieved, he notices vegetables and a large kitchen knife on the counter, which he takes after some thought."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Kneeling up again and sighing with relief he spots some chopped vegetables sitting on a worktop and a large kitchen knife lying next to them which he contemplates for a moment before reaching out and grabbing it Then with his head turned wearily to one side and tucked defensively back a little Graham drops delicately to a kneeling position bends down and pressing his face to the tiles peers under the pantry door finding nothing but shards of glass  The shadow under the door remains still as Graham glances briefly away from the door incredulously  He eyes the door anxiously swallows nods to himself closes his eyes and mouths Patty Wagon selfcharmingly  Graham stares intently at the gap under the door and the shadow stops moving  A shadow passes under the door as Graham treads hesitantly toward it accompanied by a sound  Graham enters Ray's house pausing outside the open kitchen door and steps timidly into the room where chairs lie turned on the floor and tables wedge against the door leading into the pantry  The film is rewound and Merrill sits back down in front of the TV watching with his mouth gaping as the picture freezes on the creature the image flickering slightly  A lanky dark figure with a human appearance steps across the passage and out of view prompting Merrill to recoil cupping a hand to his face in shock as he backs away from the TV  Merrill watches in frustration as a boy looks out on a narrow passageway and the camera focuses on the passage  The camera focuses on tall bushes at the back of the yard before returning to the interior and following the children as they swarm to another window  Merrill moves his chair right up to the television and watches the camcorder footage of his hysterical young children inside the house who are gathered by French windows pointing to the backyard where tables laden with party food lie abandoned  At the farmhouse in the closet under the stairs Merrill is still watching TV his brow creased with worry and lips slightly apart  With his lips curled and features crumpled Ray nods sufferingly before dropping his gaze as Graham turns to face Ray's clapboard home  Ray peers earnestly at Graham whose eyes moisten a little as he fights with his emotions  Graham then starts the engine and sits back in his seat while Graham stares  Slowly he turns and takes a breath his doleful eyes lingering on  Ray bows his head and reflects his guilty eyes reluctant to confront Graham's gaze  Ray is still staring ahead and then he lowers his eyes and frowns as Graham regards him closely "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The film is rewound and Merrill sits back down in front of the TV watching with his mouth gaping as the picture freezes on the creature the image flickering slightly  Graham stares intently at the gap under the door and the shadow stops moving  A lanky dark figure with a human appearance steps across the passage and out of view prompting Merrill to recoil cupping a hand to his face in shock as he backs away from the TV  The camera focuses on tall bushes at the back of the yard before returning to the interior and following the children as they swarm to another window  He eyes the door anxiously swallows nods to himself closes his eyes and mouths Patty Wagon selfcharmingly  Ray bows his head and reflects his guilty eyes reluctant to confront Graham's gaze  Graham enters Ray's house pausing outside the open kitchen door and steps timidly into the room where chairs lie turned on the floor and tables wedge against the door leading into the pantry  With his lips curled and features crumpled Ray nods sufferingly before dropping his gaze as Graham turns to face Ray's clapboard home  The shadow under the door remains still as Graham glances briefly away from the door incredulously  Slowly he turns and takes a breath his doleful eyes lingering on  Kneeling up again and sighing with relief he spots some chopped vegetables sitting on a worktop and a large kitchen knife lying next to them which he contemplates for a moment before reaching out and grabbing it Ray peers earnestly at Graham whose eyes moisten a little as he fights with his emotions  Merrill watches in frustration as a boy looks out on a narrow passageway and the camera focuses on the passage  Merrill moves his chair right up to the television and watches the camcorder footage of his hysterical young children inside the house who are gathered by French windows pointing to the backyard where tables laden with party food lie abandoned  Graham then starts the engine and sits back in his seat while Graham stares  A shadow passes under the door as Graham treads hesitantly toward it accompanied by a sound  At the farmhouse in the closet under the stairs Merrill is still watching TV his brow creased with worry and lips slightly apart  Then with his head turned wearily to one side and tucked defensively back a little Graham drops delicately to a kneeling position bends down and pressing his face to the tiles peers under the pantry door finding nothing but shards of glass  Ray is still staring ahead and then he lowers his eyes and frowns as Graham regards him closely "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A lanky dark figure with a human appearance steps across the passage and out of view prompting Merrill to recoil cupping a hand to his face in shock as he backs away from the TV  The film is rewound and Merrill sits back down in front of the TV watching with his mouth gaping as the picture freezes on the creature the image flickering slightly  Graham enters Ray's house pausing outside the open kitchen door and steps timidly into the room where chairs lie turned on the floor and tables wedge against the door leading into the pantry  A shadow passes under the door as Graham treads hesitantly toward it accompanied by a sound  Graham stares intently at the gap under the door and the shadow stops moving  He eyes the door anxiously swallows nods to himself closes his eyes and mouths Patty Wagon selfcharmingly  The shadow under the door remains still as Graham glances briefly away from the door incredulously  Then with his head turned wearily to one side and tucked defensively back a little Graham drops delicately to a kneeling position bends down and pressing his face to the tiles peers under the pantry door finding nothing but shards of glass  Kneeling up again and sighing with relief he spots some chopped vegetables sitting on a worktop and a large kitchen knife lying next to them which he contemplates for a moment before reaching out and grabbing it Ray is still staring ahead and then he lowers his eyes and frowns as Graham regards him closely  Ray bows his head and reflects his guilty eyes reluctant to confront Graham's gaze  Slowly he turns and takes a breath his doleful eyes lingering on  Graham then starts the engine and sits back in his seat while Graham stares  Ray peers earnestly at Graham whose eyes moisten a little as he fights with his emotions  With his lips curled and features crumpled Ray nods sufferingly before dropping his gaze as Graham turns to face Ray's clapboard home  At the farmhouse in the closet under the stairs Merrill is still watching TV his brow creased with worry and lips slightly apart  Merrill moves his chair right up to the television and watches the camcorder footage of his hysterical young children inside the house who are gathered by French windows pointing to the backyard where tables laden with party food lie abandoned  The camera focuses on tall bushes at the back of the yard before returning to the interior and following the children as they swarm to another window  Merrill watches in frustration as a boy looks out on a narrow passageway and the camera focuses on the passage "
        }
      ]
    }
  ]
}