{
  "ground_truth": "Behind him, shrubs growing outside the farmhouse are buffeted by the growing wind. Merrill eyes the crops suspiciously, then retreats. He picks up the cotton sack, jogs up the steps to the farmhouse veranda, and hits indoors. Morgan and Bo are glued to the TV screen in the closet. Graham and Merrill arrive. They stand and watch. Graham looks uneasy. Merrill is deep in thought. The presenter shifts fearfully. Unflinching, Graham stares directly at the television screen. Standing rooted to the floor, Graham continues to scrutinize the images on the TV, his features sagging mournfully as he reflects on the presenter's words. He wanders off, leaving Merrill alone with Morgan and Bo. The two children are mesmerized by the screen. Merrill kneels down on the floor beside them. Looking up at Merrill, pale with worry, Morgan turns back to the TV. Graham is now in the room. He moves to a window, which is being partially boarded up on the inside, and peers out. He then takes a plank of old wood and secures it over the window, blocking out the light completely. Outside, the silver pipes of a wind chime knock against each other. Then, more chimes are disturbed by the strengthening breeze. Graham sits indoors in dim lights, staring and failing me ahead. Merrill sauces into the room and stops next to Morgan and Bo, who are standing against a wall. Graham nods. Graham smiles. Graham turns to look at his brother. Graham beams. His lips spread into a smile. Later, in the dimly lit kitchen, pans and bowls, one full of empty eggshells, are stacked up into two sinks. On a worktop lies a sharp knife along with a skinned onion, some potato peel on top of a tomato. Graham, Merrill, and the two children sit silently at the dinner table in the next room. Shifting awkwardly in his chair, Graham casts a fleeting glance at the others. Graham's taken aback. Graham's lips tremble slightly. Morgan's eyes are swollen. He reaches over and stabs his fork into a piece of molten toast, then sits back down. Merrill watches in disbelief as Graham tucks into his mount of food. Bo, sitting next to him, is in tears. Upset, Graham winces as he eats. Observing him, Morgan gets up from his chair and goes to his dad who is now throwing down his fork and sobbing uncontrollably. Morgan leans into his father who hugs him tightly, then pulls Bo to his other side. Merrill is staring self-consciously at his plate when Graham's hand reaches out and tucks him in the family embrace. Graham's body rocks as he cries. At the other end of the table, the red lines on the baby monitor begin to flash.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Behind him, bushes developing outside the farmhouse are battered by the increasing wind. Merrill regards the produce suspiciously, then withdraws. He grabs the cotton sack, trots up the steps to the farmhouse porch, and heads indoors. Morgan and Bo are glued to the TV display in the closet. Graham and Merrill arrive. They stand and observe. Graham appears uneasy. Merrill is deep in contemplation. The announcer shifts fearfully. Unyielding, Graham gazes directly at the television display. Standing rooted to the ground, Graham continues to examine the visuals on the TV, his features drooping mournfully as he ponders the announcer's words. He roams off, leaving Merrill alone with Morgan and Bo. The two youngsters are transfixed by the display. Merrill kneels down on the ground beside them. Looking up at Merrill, pale with worry, Morgan turns back to the TV. Graham is now in the chamber. He moves to a window, which is being partially boarded up on the interior, and peers out. He then takes a plank of old lumber and fastens it over the window, obstructing the light completely. Outside, the silver tubes of a wind chime clatter against each other. Then, more chimes are disturbed by the intensifying breeze. Graham sits indoors in dim illumination, staring and failing me ahead. Merrill sauces into the chamber and stops next to Morgan and Bo, who are standing against a wall. Graham nods. Graham grins. Graham turns to look at his sibling. Graham beams. His lips spread into a grin. Later, in the dimly lit kitchen, pans and bowls, one full of empty eggshells, are stacked up into two basins. On a worktop lies a sharp knife along with a skinned onion, some potato peel on top of a tomato. Graham, Merrill, and the two youngsters sit silently at the dining table in the next chamber. Shifting awkwardly in his seat, Graham casts a fleeting glance at the others. Graham's taken aback. Graham's lips quiver slightly. Morgan's eyes are swollen. He reaches over and stabs his fork into a piece of molten toast, then sits back down. Merrill observes in disbelief as Graham tucks into his mound of food. Bo, sitting next to him, is in tears. Upset, Graham winces as he eats. Watching him, Morgan gets up from his seat and goes to his dad who is now throwing down his fork and weeping uncontrollably. Morgan leans into his father who embraces him tightly, then pulls Bo to his other side. Merrill is staring self-consciously at his plate when Graham's hand reaches out and tucks him into the family embrace. Graham's body rocks as he cries. At the other end of the table, the red lines on the baby monitor commence to flash."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Behind him, the shrubs that are being buffeted by the growing wind are growing outside the farmhouse. The crops are eyed suspiciously by Merrill, then he retreats. The cotton sack is picked up by him, the steps to the farmhouse veranda are jogged up, and indoors he hits. The TV screen in the closet is being focused on by Morgan and Bo. Graham and Merrill arrive. They stand and watch. Uneasy feelings are sensed by Graham. Merrill is deep in thought. The presenter shifts fearfully. The television screen is stared at directly by Graham, unflinching. Standing rooted to the floor, the images on the TV are scrutinized by Graham, his features sagging mournfully as the presenter's words are reflected upon. He wanders off, leaving Morgan and Bo alone with Merrill. The screen mesmerizes the two children. The floor beside them is knelt down on by Merrill. Looking up at Morgan, pale with worry, Merrill is turned back to the TV. Graham is now in the room. To a window, he moves, which partially boards up are being secured on the inside, and the outside is peered out of. A plank of old wood is then taken by him and it is secured over the window, blocking out the light completely. The silver pipes of a wind chime are knocked against each other outside. Then, the strengthening breeze disturbs more chimes. Indoors, Graham sits in dim lights, staring and failing me ahead. The room is entered by Merrill who sauces in and stops next to Morgan and Bo, who are standing against a wall. A nod is given by Graham. A smile is shown by Graham. Graham turns to look at his brother. Graham beams. A smile is spread into by his lips. Later, in the dimly lit kitchen, pans and bowls, one full of empty eggshells, are stacked up into two sinks. On a worktop, a sharp knife lies along with a skinned onion, some potato peel on top of a tomato. The dinner table in the next room is silently sat at by Graham, Merrill, and the two children. An awkward shift in his chair is made by Graham, casting a fleeting glance at the others. Graham is taken aback. His lips tremble slightly. Morgan's eyes are swollen. His fork is stabbed into a piece of molten toast, then he sits back down. In disbelief, Merrill watches as Graham tucks into his mount of food. Bo, sitting next to him, is in tears. As Graham eats, he winces, upset. Observing him, his chair is left by Morgan, who goes to his dad who is now throwing down his fork and sobbing uncontrollably. Morgan leans into his father who is hugged tightly, then Bo is pulled to his other side. Self-conscious staring at his plate is done by Merrill when Graham's hand reaches out and includes him in the family embrace. As Graham cries, his body rocks. At the other end of the table, red lines on the baby monitor begin to flash."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Shrubs around the farmhouse sway in the wind. Merrill glances at the crops, then picks up the cotton sack and heads inside. Morgan and Bo are fixated on the TV in the closet. Graham and Merrill join them, watching as the presenter speaks nervously. Graham, looking uneasy, focuses on the TV. He leaves, leaving Merrill with the children. Morgan, worried, looks up at Merrill before returning to the screen. Graham boards up the window, blocking the light, as chimes tinkle outside. Indoors, Graham sits in dim light, reflecting deeply, then joins Merrill, Morgan, and Bo by the wall. Graham smiles and nods at his brother. In the kitchen, dishes are piled in the sink. Graham, Merrill, and the kids sit at the dinner table. Graham shifts awkwardly and glances at them, surprised. Morgan's eyes are swollen as he stabs toast. Graham eats, distressed, while Merrill watches. Bo cries, and Graham visibly winces. Morgan approaches his father, who sobs uncontrollably and hugs his children tightly. Merrill eventually joins the family embrace as Graham cries. At the table's other end, the baby monitor's red lines begin to flash."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Shrubs outside the farmhouse sway in the wind. Merrill suspiciously eyes the crops and retreats, carrying a cotton sack, and enters the farmhouse. Morgan and Bo are fixated on the TV in the closet. Graham and Merrill join them, with Graham appearing uneasy and Merrill pensive. The presenter seems fearful, but Graham stares at the screen, absorbing the presenter's words mournfully. He wanders off, leaving Merrill with the children, who are engrossed in the screen. Worried, Morgan glances at Merrill before returning attention to the TV. Graham, now inside, boards up the window, blocking all light as wind chimes clatter outside. In dim light, Graham sits, lost in thought. Merrill joins Morgan and Bo, who are against a wall. Graham nods, smiles, and then beams at his brother. In the dim kitchen, dishes are piled, and Graham, Merrill, and the children eat silently. Graham shifts awkwardly, glancing at the others, then is shocked as Morgan stabs toast and Merrill watches Graham eat. Upset, Bo cries as Graham struggles through his meal. Morgan approaches his sobbing father, who embraces his children tightly. Merrill, self-conscious, joins the family embrace as Graham cries. At the table's end, the baby monitor's red lines flash."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Behind him, the shrubs that are growing outside the quaint farmhouse are being heavily buffeted by the increasingly strong wind. Merrill casts a suspicious gaze at the crops, then decides to retreat. He picks up the somewhat worn cotton sack, jogs briskly up the wooden steps leading to the farmhouse veranda, and quickly heads indoors. Inside, Morgan and Bo are intently glued to the flickering TV screen in the cramped closet. Graham and Merrill soon arrive at the scene. They stand and watch in silence. Graham appears uneasy, his discomfort evident. Meanwhile, Merrill is visibly deep in thought. The presenter on the screen shifts fearfully, conveying an unsettling atmosphere. Unflinching and with determination, Graham stares directly at the images on the TV screen. Standing rooted firmly to the floor, Graham continues to scrutinize the images, his facial features sagging mournfully as he introspects on the presenter's words. He wanders off the scene, leaving Merrill alone with Morgan and Bo, who remain mesmerized by the ongoing broadcast. Merrill kneels down onto the floor beside them. Looking up at Merrill, her face pale with worry, Morgan turns her attention back to the TV. Graham re-enters the room. He moves towards a window, which is being partially boarded up on the inside, and peers cautiously out. He then takes an old, weathered plank of wood and secures it firmly over the window, blocking out the light entirely. Outside, the metallic silver pipes of a wind chime knock rhythmically against each other. Then, more chimes are disturbed by the strengthening breeze. Graham sits indoors in the dim, muted lights, staring ahead and failing me as he broods. Merrill saunters into the room and stops next to Morgan and Bo, who are standing silently against a wall. Graham gives a nod of acknowledgment. Graham offers a faint smile. Graham turns to look at his brother, and his face breaks into a beam. His lips spread into a warm smile. Later, in the dimly lit kitchen, various pans and bowls, one of which is full of empty eggshells, are stacked up haphazardly into the two sinks. On a nearby worktop lies a sharp knife along with a freshly skinned onion, and some potato peel rests on top of a tomato. Graham, Merrill, and the two children sit silently at the dinner table in the adjacent room. Shifting awkwardly in his chair, Graham casts a fleeting, worried glance at the others. Graham is taken aback, as his lips tremble slightly. Morgan's eyes are visibly swollen. He reaches over and stabs his fork into a piece of molten toast, then sits back down with a thud. Merrill watches in disbelief as Graham tucks into his substantial mount of food. Bo, sitting next to him, is in tears and visibly distressed. Upset, Graham winces with discomfort as he continues to eat. Observing him cautiously, Morgan gets up from his chair and approaches his father, who is now throwing down his fork and sobbing uncontrollably. Morgan leans into his father, who hugs him tightly, pulling Bo to his other side in a protective embrace. Merrill, meanwhile, is staring self-consciously at his plate when Graham's hand reaches out and includes him in the warm family embrace. Graham's body rocks as he cries deeply. At the other end of the table, the red lines on the baby monitor begin to flash urgently."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Behind him, the dense shrubs that are steadily growing outside the quaint, rustic farmhouse find themselves being heavily buffeted by the increasingly strong and forceful wind. With a flicker of suspicion in his eyes, Merrill casts a suspicious gaze at the crops swaying wildly, then decides to retreat. He carefully picks up the somewhat worn and weathered cotton sack and subsequently jogs briskly up the wooden steps leading to the farmhouse veranda before quickly heading indoors for shelter. Once inside, Morgan and Bo are intently glued to the flickering TV screen, which occupies the cramped and confined closet space. Graham and Merrill soon arrive at the scene, standing together to watch in silence. Graham appears uneasy, his discomfort evident on his face, while Merrill, on the other hand, is visibly deep in thought. On the screen, the presenter shifts fearfully, conveying an unsettling and anxious atmosphere. Unflinching and with determination, Graham stares directly at the images on the TV screen. Standing rooted firmly to the floor, Graham continues to scrutinize the images, his facial features sagging mournfully as he introspects on the presenter's haunting words. He eventually wanders off the scene, leaving Merrill alone with Morgan and Bo, who both remain mesmerized by the ongoing broadcast. Merrill kneels down onto the floor beside them, providing silent companionship. Looking up at Merrill, her face pale with worry and concern, Morgan turns her attention back to the TV. Graham re-enters the room eventually. He makes his way towards a nearby window, which is being partially boarded up on the inside, and peers out cautiously. He then takes an old, weathered plank of wood and secures it firmly over the window, blocking out the light entirely and enhancing the dimness. Outside, the metallic silver pipes of a wind chime knock rhythmically against each other. Gradually, more chimes are disturbed by the strengthening and relentless breeze. Graham sits indoors in the dim, muted lights, his gaze staring ahead blankly as he broods. Merrill saunters into the room and stops next to Morgan and Bo, who are standing silently and motionlessly against a wall. Graham offers a nod of acknowledgment followed by a faint smile. He turns to look at his brother, and his face breaks into a beam, his lips spreading into a warm smile as well. Later on, in the dimly lit kitchen, various pans and bowls, one of which is full of empty eggshells, are stacked up haphazardly into the two sinks. On a nearby worktop lies a sharp knife along with a freshly skinned onion, and some potato peel rests carelessly on top of a tomato. Graham, Merrill, and the two children sit silently at the dinner table in the adjacent room. Shifting awkwardly in his chair, Graham casts a fleeting, worried glance at the others. Taken aback, Graham's lips tremble slightly. Morgan's eyes are visibly swollen. He reaches over and stabs his fork into a piece of molten toast, then sits back down with a thud. Merrill watches in disbelief as Graham tucks into his substantial mound of food. Bo, sitting next to him, is in tears and visibly distressed. Upset, Graham winces with discomfort yet continues to eat. Observing him cautiously, Morgan gets up from his chair and approaches his father, who is now throwing down his fork and sobbing uncontrollably. Morgan leans into his father, who hugs him tightly, pulling Bo to his other side in a protective embrace. Meanwhile, Merrill is staring self-consciously at his own plate when Graham's hand reaches out and includes him in the warm family embrace. Graham's body rocks as he cries deeply, overwhelmed with emotion. At the other end of the table, the red lines on the baby monitor begin to flash urgently, signaling with intensity."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Behind him, the shrubs outside the farmhouse are whipped back and forth by the increasing wind. Merrill casts a suspicious look at the crops, his eyes narrowing as he assesses the situation, before deciding to retreat. He bends down to pick up the cotton sack, hoisting it over his shoulder as he jogs up the steps to the farmhouse veranda. With a swift motion, he opens the door and steps indoors, leaving the wind behind. Inside, Morgan and Bo are sitting intently, their eyes glued to the TV screen in the closet, their expressions absorbed and focused. Graham and Merrill soon join them, entering the room and coming to a halt beside the children. They stand quietly, gazing at the screen. Graham's face reflects unease, his brow furrowing slightly, while Merrill stands deep in thought, his mind processing the unfolding scenes. The presenter on the TV screen shifts fearfully, his body tense, amplifying the gravity of the situation. Graham stands firm, his gaze locked on the television, his eyes unblinking as he continues to scrutinize the images. His features droop mournfully as he reflects on the presenter’s words, the weight of the moment settling heavily on him. The sense of urgency prompts him to slowly wander off, leaving Merrill alone with the entranced children. Merrill lowers himself to the floor beside them, his presence a silent comfort. Morgan, pale with worry, glances up at him briefly before turning back to the engrossing scenes on the TV. Graham, having moved to another room, stations himself by a window that has partially been boarded up from the inside. He peers out, assessing the situation outside before securing a plank of old wood over the window and blocking out the light completely. The sound of silver pipes clinking against each other drifts in from outside as the wind chime is tossed around by the strengthening breeze. With the room now dimly lit, Graham sits indoors, his gaze unfocused and his thoughts failing him. Merrill enters the room quietly, coming to a stop next to Morgan and Bo, who stand pressed against a wall, their expressions a mix of fear and uncertainty. Graham nods slightly, acknowledging Merrill, while a faint smile tugs at his lips. He turns his head towards his brother, his expression softening into a warm beam. Gradually, his lips spread into a genuine smile, the brief moment of solace lighting up his face. Later, in the dimly lit kitchen, various kitchenware are stacked haphazardly in the two sinks—pans and bowls, one filled with empty eggshells. On the worktop lies a sharp knife beside a skinned onion, some potato peel resting atop a tomato. In the next room, Graham, Merrill, and the children sit silently around the dinner table, the atmosphere heavy and subdued. Graham shifts awkwardly in his chair, his eyes darting around as he casts a fleeting glance at the others. A moment of surprise catches him off guard, and his lips tremble slightly. Morgan’s eyes, puffy and red, glance down as he picks up his fork, stabbing it into a piece of molten toast before sitting back down. Merrill watches in disbelief, his eyes wide as Graham begins to tuck into his mountain of food. Bo, sitting next to him, is overwhelmed and begins to cry. Graham’s expression shifts to one of distress as he winces, each bite feeling heavier. Observing his father, Morgan rises from his chair and approaches Graham, who, in a surge of emotion, throws down his fork and begins to sob uncontrollably. Morgan leans into him, and Graham envelops him in a tight embrace, then reaches out to pull Bo close to his other side. Meanwhile, Merrill sits quietly, staring self-consciously at his plate, when Graham's hand reaches out, drawing him into the family embrace. The family holds each other, Graham’s body rocking as he cries, releasing the pent-up emotions. At the other end of the table, unnoticed by the family, the red lines on the baby monitor begin to flash silently, signaling yet another concern."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Behind him, the shrubs outside the farmhouse sway in the growing wind. Merrill suspiciously surveys the crops and retreats, grabbing a cotton sack as he jogs up the steps to the farmhouse veranda and enters. Inside, Morgan and Bo are engrossed in the TV screen in the closet, with Graham and Merrill joining them. Graham appears uneasy while Merrill is contemplative. As the presenter speaks fearfully, Graham remains steadfastly attentive, his expression growing sorrowful. After some time, he departs, leaving Merrill with the captivated children. Morgan, worried, glances at Merrill before returning to the TV. Graham re-enters, approaches a window partially boarded from the inside, peers out, and then secures it with a plank, blocking out the light entirely. Outside, wind chimes clink in the strengthening breeze.\n\nIn the dimly lit room, alongside the sounds of chimes, Graham sits deep in thought while Merrill joins Morgan and Bo standing against a wall. Graham acknowledges them with a nod and a smile, eventually looking at Merrill with a beaming expression. In the dim kitchen, pans and bowls filled with empty eggshells clutter the sinks, and a sharp knife with a skinned onion and potato peel on a tomato lies on the worktop. The family sits silently at the dinner table until Graham, feeling awkward, glances around before reacting with surprise and trembling lips. Morgan, with swollen eyes, stabs a piece of toast with his fork. Merrill watches in disbelief as Graham begins to eat despite Bo's tears. Upset, Graham winces with each bite. Morgan approaches his father, who, overwhelmed, throws down his fork and cries. Morgan leans into him for a hug, bringing Bo in as well. Merrill watches self-consciously until Graham extends his arms to include him in the family embrace, his body rocking with sobs. At the table's end, the baby monitor flashes with red lines."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Behind him, shrubs growing outside the farmhouse, a rustic building known for its weathered charm and long history in the area, are buffeted by the growing wind. Merrill, a cautious man who has seen too many unpredictable seasons, eyes the crops suspiciously, then retreats. He picks up the cotton sack, historically used for carrying produce during harvest, jogs up the steps to the farmhouse veranda, and hits indoors. Morgan and Bo, two siblings with an insatiable curiosity, are glued to the TV screen in the closet, a makeshift hideout where they've created a safe space. Graham and Merrill arrive. They stand and watch, their attention captured by the vivid images on the screen. Graham, a man burdened with recent family tragedies, looks uneasy. Merrill is deep in thought. The presenter, reporting from a scene of crisis, shifts fearfully. Unflinching, Graham stares directly at the television screen, where disturbing news unravels. Standing rooted to the floor, Graham continues to scrutinize the images on the TV, his features sagging mournfully as he reflects on the presenter's words of despair. He wanders off, leaving Merrill alone with Morgan and Bo. The two children, transfixed and seeking answers, are mesmerized by the screen. Merrill kneels down on the floor beside them. Looking up at Merrill, pale with worry from the troubling broadcast, Morgan turns back to the TV. Graham is now in the room. He moves to a window, which is being partially boarded up on the inside to protect against the anticipated storm, and peers out. He then takes a plank of old wood, salvaged from the barn that once stood nearby, and secures it over the window, blocking out the light completely. Outside, the silver pipes of a wind chime, a relic from Graham's late wife who adored its melody, knock against each other. Then, more chimes are disturbed by the strengthening breeze, heralding the coming tempest. Graham sits indoors in dim lights, staring and failing me ahead, weighed down by the gravity of the unfolding situation. Merrill sauces into the room and stops next to Morgan and Bo, who are standing against a wall seeking comfort in the familiar surroundings. Graham nods in understanding. Graham smiles, attempting to convey reassurance. Graham turns to look at his brother, whose presence is both grounding and a reminder of shared burdens. Graham beams. His lips spread into a smile, though it barely masks his inner turmoil. Later, in the dimly lit kitchen, pans and bowls, one full of empty eggshells from the morning's breakfast, are stacked up into two sinks. On a worktop lies a sharp knife, essential for the recently prepared meal, along with a skinned onion, some potato peel on top of a tomato, remnants of their hurried dinner preparation. Graham, Merrill, and the two children sit silently at the dinner table in the next room, a space that once echoed with laughter and warmth. Shifting awkwardly in his chair, Graham casts a fleeting glance at the others. Graham's taken aback by the somber, shared silence. Graham's lips tremble slightly, a sign of his struggle to maintain composure. Morgan's eyes are swollen from earlier bouts of tears. He reaches over and stabs his fork into a piece of molten toast, then sits back down, the toast a comfort food amidst the chaos. Merrill watches in disbelief as Graham tucks into his mount of food, an attempt to find solace in habitual actions. Bo, sitting next to him, is in tears, overwhelmed by the fear and uncertainty. Upset, Graham winces as he eats, the food tasteless amidst his grief. Observing him, Morgan gets up from his chair and goes to his dad who is now throwing down his fork and sobbing uncontrollably, the weight of their predicament finally breaking him. Morgan leans into his father who hugs him tightly, seeking refuge in his son’s embrace, then pulls Bo to his other side for the same comfort. Merrill is staring self-consciously at his plate when Graham's hand reaches out and tucks him in the family embrace, signaling their shared strength and unity. Graham's body rocks as he cries, the emotional release overwhelming. At the other end of the table, the red lines on the baby monitor begin to flash, indicating an unexpected signal from an adjacent room, perhaps a sign of hope or a call to action."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "They stand and watch Behind him shrubs growing outside the farmhouse are buffeted by the growing wind Merrill eyes the crops suspiciously then retreats He picks up the cotton sack jogs up the steps to the farmhouse veranda and hits indoors Morgan and Bo are glued to the TV screen in the closet Graham and Merrill arrive They stand and watch Graham looks uneasy Merrill is deep in thought The presenter shifts fearfully He picks up the cotton sack jogs up the steps to the farmhouse veranda and hits indoors At the other end of the table the red lines on the baby monitor begin to flash He then takes a plank of old wood and secures it over the window blocking out the light completely Unflinching Graham stares directly at the television screen Merrill is staring selfconsciously at his plate when Graham's hand reaches out and tucks him in Standing rooted to the floor Graham continues to scrutinize the images on the TV his features sagging mournfully as he reflects on the presenter's words He wanders off leaving Merrill alone with Morgan and Bo Morgan turns back to the TV The two children are mesmerized by the screen Merrill kneels down on the floor beside them Looking up at Merrill pale with worry The presenter shifts fearfully Looking up at Merrill pale with worry Morgan turns back to the TV Graham is now in the room He moves to a window which is being partially boarded up on the inside and peers out He then takes a plank of old wood and secures it over the window blocking out the light completely Outside the silver pipes of a wind chime knock against each other He moves to a window which is being partially boarded up on the inside and peers out Then more chimes are disturbed by the strengthening breeze He reaches over and stabs his fork into a piece of molten toast then sits back down Graham sits indoors in dim lights staring and failing me ahead Merrill sauces into the room and stops next to Morgan and Bo who are standing against a wall Graham nods Merrill eyes the crops suspiciously then retreats Merrill kneels down on the floor beside them Graham smiles Graham turns to look at his brother Observing him Morgan gets up from his chair and goes to his dad who is now throwing down his fork and sobbing uncontrollably Graham beams His lips spread into a smile Later in the dimly lit kitchen pans and bowls one full of empty eggshells are stacked up into two sinks On a worktop lies a sharp knife along with a skinned onion some potato peel on top of a tomato Behind him shrubs growing outside the farmhouse are buffeted by the growing wind Graham Merrill and the two children sit silently at the dinner table in the next room The two children are mesmerized by the screen Then more chimes are disturbed by the strengthening breeze Merrill is deep in thought He wanders off leaving Merrill alone with Morgan and Bo Shifting awkwardly in his chair Graham casts a fleeting glance at the others Graham's taken aback the family embrace Graham's lips tremble slightly Morgan's eyes are swollen He reaches over and stabs his fork into a piece of molten toast then sits back down Merrill watches in disbelief as Graham tucks into his mount of food Bo sitting next to him is in tears Morgan's eyes are swollen Upset Graham winces as he eats Observing him Morgan gets up from his chair and goes to his dad who is now throwing down his fork and sobbing uncontrollably Graham turns to look at his brother Morgan leans into his father who hugs him tightly then pulls Bo to his other side Bo sitting next to him is in tears Graham looks uneasy Merrill is staring selfconsciously at his plate when Graham's hand reaches out and tucks him in the family embrace Graham's body rocks as he cries Shifting awkwardly in his chair Graham casts a fleeting glance at the others At the other end of the table the red lines on the baby monitor begin to flash"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Behind him shrubs growing outside the farmhouse are buffeted by the growing wind. Merrill eyes the crops suspiciously then retreats. He picks up the cotton sack jogs up the steps to the farmhouse veranda and hits indoors. Morgan and Bo are glued to the TV screen in the closet. Graham and Merrill arrive. They stand and watch. Graham looks uneasy. Merrill is deep in thought. The presenter shifts fearfully. Unflinching. Graham stares directly at the television screen. Standing rooted to the floor. Graham continues to scrutinize the images on the TV his features sagging mournfully as he reflects on the presenter's words. He wanders off leaving Merrill alone with Morgan and Bo. The two children are mesmerized by the screen. Merrill kneels down on the floor beside them. Looking up at Merrill pale with worry. Morgan turns back to the TV. Graham is now in the room. He moves to a window which is being partially boarded up on the inside and peers out. He then takes a plank of old wood and secures it over the window blocking out the light completely. Outside the silver pipes of a wind chime knock against each other. Then more chimes are disturbed by the strengthening breeze. Graham sits indoors in dim lights staring and failing me ahead. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Merrill sauces into the room and stops next to Morgan and Bo who are standing against a wall. Graham nods. Graham smiles. Graham turns to look at his brother. Graham beams. His lips spread into a smile. Later in the dimly lit kitchen pans and bowls one full of empty eggshells are stacked up into two sinks. On a worktop lies a sharp knife along with a skinned onion. some potato peel on top of a tomato. Graham Merrill and the two children sit silently at the dinner table in the next room. Shifting awkwardly in his chair Graham casts a fleeting glance at the others. Graham's taken aback. Graham's lips tremble slightly. Morgan's eyes are swollen. He reaches over and stabs his fork into a piece of molten toast then sits back down. Merrill watches in disbelief as Graham tucks into his mount of food. Bo sitting next to him is in tears. Upset Graham winces as he eats. Observing him Morgan gets up from his chair and goes to his dad who is now throwing down his fork and sobbing uncontrollably. Morgan leans into his father who hugs him tightly then pulls Bo to his other side. Merrill is staring selfconsciously at his plate when Graham's hand reaches out and tucks him in. the family embrace. Graham's body rocks as he cries. At the other end of the table the red lines on the baby monitor begin to flash."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Behind him shrubs growing outside the farmhouse are buffeted by the growing wind. Merrill eyes the crops suspiciously then retreats. He picks up the cotton sack jogs up the steps to the farmhouse veranda and hits indoors. Morgan and Bo are glued to the TV screen in the closet. Graham and Merrill arrive. They stand and watch. Graham looks uneasy. Merrill is deep in thought. The presenter shifts fearfully. Unflinching. Graham stares directly at the television screen. Standing rooted to the floor. Graham continues to scrutinize the images on the TV his features sagging mournfully as he reflects on the presenter's words. He wanders off leaving Merrill alone with Morgan and Bo. The two children are mesmerized by the screen. Merrill kneels down on the floor beside them. Looking up at Merrill pale with worry. Morgan turns back to the TV. Graham is now in the room. He moves to a window which is being partially boarded up on the inside and peers out. He then takes a plank of old wood and secures it over the window blocking out the light completely. Outside the silver pipes of a wind chime knock against each other. Then more chimes are disturbed by the strengthening breeze. Graham sits indoors in dim lights staring and failing me ahead. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Merrill sauces into the room and stops next to Morgan and Bo who are standing against a wall. Graham nods. Graham smiles. Graham turns to look at his brother. Graham beams. His lips spread into a smile. Later in the dimly lit kitchen pans and bowls one full of empty eggshells are stacked up into two sinks. On a worktop lies a sharp knife along with a skinned onion. some potato peel on top of a tomato. Graham Merrill and the two children sit silently at the dinner table in the next room. Shifting awkwardly in his chair Graham casts a fleeting glance at the others. Graham's taken aback. Graham's lips tremble slightly. Morgan's eyes are swollen. He reaches over and stabs his fork into a piece of molten toast then sits back down. Merrill watches in disbelief as Graham tucks into his mount of food. Bo sitting next to him is in tears. Upset Graham winces as he eats. Observing him Morgan gets up from his chair and goes to his dad who is now throwing down his fork and sobbing uncontrollably. Morgan leans into his father who hugs him tightly then pulls Bo to his other side. Merrill is staring selfconsciously at his plate when Graham's hand reaches out and tucks him in. the family embrace. Graham's body rocks as he cries. At the other end of the table the red lines on the baby monitor begin to flash."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Behind him shrubs growing outside the farmhouse are buffeted by the growing wind. Merrill eyes the crops suspiciously then retreats. He picks up the cotton sack jogs up the steps to the farmhouse veranda and hits indoors. Morgan and Bo are glued to the TV screen in the closet. Graham and Merrill arrive. They stand and watch. Graham looks uneasy. Merrill is deep in thought. The presenter shifts fearfully. Unflinching. Graham stares directly at the television screen. Standing rooted to the floor. Graham's lips tremble slightly. Morgan's eyes are swollen. He reaches over and stabs his fork into a piece of molten toast then sits back down. Merrill watches in disbelief as Graham tucks into his mount of food. Bo sitting next to him is in tears. Upset Graham winces as he eats. Observing him Morgan gets up from his chair and goes to his dad who is now throwing down his fork and sobbing uncontrollably. Morgan leans into his father who hugs him tightly then pulls Bo to his other side. Merrill is staring selfconsciously at his plate when Graham's hand reaches out and tucks him in. the family embrace. Graham's body rocks as he cries. At the other end of the table the red lines on the baby monitor begin to flash."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Behind him shrubs growing outside the farmhouse are buffeted by the growing wind. Merrill eyes the crops suspiciously then retreats. He picks up the cotton sack jogs up the steps to the farmhouse veranda and hits indoors. Morgan and Bo are glued to the TV screen in the closet. Graham and Merrill arrive. Morgan leans into his father who hugs him tightly then pulls Bo to his other side. Merrill is staring selfconsciously at his plate when Graham's hand reaches out and tucks him in. the family embrace. Graham's body rocks as he cries. At the other end of the table the red lines on the baby monitor begin to flash."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Behind the squirrel, shrubs growing outside the farmhouse are buffeted by the growing wind. The rabbit eyes the crops suspiciously, then retreats. The rabbit picks up the cotton sack, jogs up the steps to the farmhouse veranda, and hits indoors. The cat and the goat are glued to the TV screen in the closet. The owl and the rabbit arrive. They stand and watch. The owl looks uneasy. The rabbit is deep in thought. The tortoise shifts fearfully. Unflinching, the owl stares directly at the television screen. Standing rooted to the floor, the owl continues to scrutinize the images on the TV, his features sagging mournfully as he reflects on the tortoise's words. The owl wanders off, leaving the rabbit alone with the cat and the goat. The two children are mesmerized by the screen. The rabbit kneels down on the floor beside them. Looking up at the rabbit, pale with worry, the cat turns back to the TV. The owl is now in the room. The owl moves to a window, which is being partially boarded up on the inside, and peers out. The owl then takes a plank of old wood and secures it over the window, blocking out the light completely. Outside, the silver pipes of a wind chime knock against each other. Then, more chimes are disturbed by the strengthening breeze. The owl sits indoors in dim lights, staring and failing me ahead. The rabbit sauces into the room and stops next to the cat and the goat, who are standing against a wall. The owl nods. The owl smiles. The owl turns to look at his brother. The owl beams. His lips spread into a smile. Later, in the dimly lit kitchen, pans and bowls, one full of empty eggshells, are stacked up into two sinks. On a worktop lies a sharp knife along with a skinned onion, some potato peel on top of a tomato. The owl, the rabbit, and the two children sit silently at the dinner table in the next room. Shifting awkwardly in his chair, the owl casts a fleeting glance at the others. The owl's taken aback. The owl's lips tremble slightly. The cat's eyes are swollen. He reaches over and stabs his fork into a piece of molten toast, then sits back down. The rabbit watches in disbelief as the owl tucks into his mount of food. The goat, sitting next to him, is in tears. Upset, the owl winces as he eats. Observing him, the cat gets up from his chair and goes to his dad who is now throwing down his fork and sobbing uncontrollably. The cat leans into his father who hugs him tightly, then pulls the goat to his other side. The rabbit is staring self-consciously at his plate when the owl's hand reaches out and tucks him in the family embrace. The owl's body rocks as he cries. At the other end of the table, the red lines on the baby monitor begin to flash."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Behind him, cacti growing outside the greenhouse are buffeted by the growing wind. Merrill eyes the flowers suspiciously, then retreats. He picks up the canvas bag, jogs up the steps to the greenhouse porch, and heads indoors. Morgan and Bo are glued to the tablet screen in the pantry. Graham and Merrill arrive. They stand and watch. Graham looks uneasy. Merrill is deep in thought. The radio host shifts fearfully. Unflinching, Graham stares directly at the tablet screen. Standing rooted to the floor, Graham continues to scrutinize the images on the tablet, his features sagging mournfully as he reflects on the radio host's words. He wanders off, leaving Merrill alone with Morgan and Bo. The two children are mesmerized by the screen. Merrill kneels down on the floor beside them. Looking up at Merrill, pale with worry, Morgan turns back to the tablet. Graham is now in the room. He moves to a window, which is being partially covered with paper on the inside, and peers out. He then takes a piece of cardboard and secures it over the window, blocking out the light completely. Outside, the bronze tubes of a wind spinner knock against each other. Then, more spinners are disturbed by the strengthening breeze. Graham sits indoors in dim lights, staring and failing ahead. Merrill wanders into the room and stops next to Morgan and Bo, who are standing against a wall. Graham nods. Graham smiles. Graham turns to look at his brother. Graham beams. His lips spread into a smile. Later, in the dimly lit kitchen, baskets and pitchers, one full of empty acorn shells, are stacked up into two sinks. On a worktop lies a butter knife along with a peeled kiwi, some carrot shavings on top of a cucumber. Graham, Merrill, and the two children sit silently at the dinner table in the next room. Shifting awkwardly in his chair, Graham casts a fleeting glance at the others. Graham's taken aback. Graham's lips tremble slightly. Morgan's eyes are swollen. He reaches over and stabs his fork into a piece of burnt waffle, then sits back down. Merrill watches in disbelief as Graham tucks into his heap of food. Bo, sitting next to him, is in tears. Upset, Graham winces as he eats. Observing him, Morgan gets up from his chair and goes to his dad who is now throwing down his fork and sobbing uncontrollably. Morgan leans into his father who hugs him tightly, then pulls Bo to his other side. Merrill is staring self-consciously at his plate when Graham's hand reaches out and tucks him in the family embrace. Graham's body rocks as he cries. At the other end of the table, the blue lights on the weather radio begin to flash."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Behind him, shrubs growing outside the farmhouse are caressed by the gentle wind. Merrill scans the crops cautiously, then advances. He grabs the cotton sack, skips up the steps to the farmhouse veranda, and leaps indoors. Morgan and Bo are engrossed in the TV screen in the closet. Graham and Merrill enter. They sit and listen. Graham seems relaxed. Merrill is lost in thought. The presenter speaks cheerfully. Unwavering, Graham turns away from the television screen. Standing confidently on the floor, Graham continues to admire the images on the TV, his features lighting up joyfully as he contemplates the presenter's words. He strolls away, leaving Merrill alone with Morgan and Bo. The two children are captivated by the screen. Merrill reclines on the floor beside them. Peering at Merrill, flushed with excitement, Morgan turns back to the TV. Graham is now in the room. He approaches a window, which is being fully opened on the inside, and glances out. He then grabs a plank of old wood and props it beside the window, allowing the light to flow completely. Outside, the silver pipes of a wind chime resonate harmoniously. Then, more chimes are stirred by the gentle breeze. Graham relaxes indoors in bright lights, gazing contentedly ahead. Merrill skips into the room and kneels next to Morgan and Bo, who are leaning against a wall. Graham waves. Graham chuckles. Graham glances at his brother. Graham grins. His lips spread into a laugh. Later, in the brightly lit kitchen, pans and bowls, one full of cracked eggshells, are lined up neatly in two sinks. On a worktop lies a blunt knife along with a whole onion, some carrot peels on top of a cucumber. Graham, Merrill, and the two children sit animatedly at the dinner table in the next room. Settling comfortably in his chair, Graham gazes steadily at the others. Graham's intrigued. Graham's lips twitch slightly. Morgan's eyes are glistening. He reaches over and slices his fork through a piece of cold toast, then stands up. Merrill observes in amusement as Graham nibbles on his pile of food. Bo, sitting next to him, is giggling. Delighted, Graham smiles as he eats. Observing him, Morgan rises from his chair and moves to his dad who is now setting aside his fork and laughing blissfully. Morgan leans into his father who embraces him tightly, then pulls Bo to his other side. Merrill is eyeing curiously at his plate when Graham's hand reaches out and brings him into the family embrace. Graham's body sways as he laughs. At the other end of the table, the red lines on the baby monitor begin to illuminate."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Behind the mailbox, curtains flapping outside the castle are buffeted by the growing breeze. The pineapple eyes the playground suspiciously, then retreats. The pineapple picks up the wool blanket, jogs up the steps to the castle porch, and hits indoors. The spatula and the pencil are glued to the radio in the attic. The fork and the pineapple arrive. They stand and watch. The fork looks uneasy. The pineapple is deep in thought. The car shifts fearfully. Unflinching, the fork stares directly at the telephone pole. Standing rooted to the floor, the fork continues to scrutinize the images on the radio, its features sagging mournfully as it reflects on the car's words. It wanders off, leaving the pineapple alone with the spatula and the pencil. The two rabbits are mesmerized by the pole. The pineapple kneels down on the floor beside them. Looking up at the pineapple, pale with worry, the spatula turns back to the pole. The fork is now in the garden. It moves to a curtain, which is being partially boarded up on the outside, and peers out. It then takes a plank of old wood and secures it over the curtain, blocking out the moon completely. Outside, the golden wheels of a bicycle knock against each other. Then, more bicycles are disturbed by the strengthening wind. The fork sits indoors in dim lights, staring and failing me ahead. The pineapple whistles into the backyard and stops next to the spatula and the pencil, who are standing against a hedge. The fork nods. The fork smiles. The fork turns to look at its sister. The fork beams. Its lips spread into a grin. Later, in the dimly lit library, papers and scrolls, one full of empty envelopes, are stacked up into two buckets. On a desk lies a dull pencil along with a peeled apple, some grape skin on top of a zucchini. The fork, the pineapple, and the two rabbits sit silently at the picnic blanket in the next orchard. Shifting awkwardly in its bench, the fork casts a fleeting glance at the others. The fork's taken aback. The fork's lips tremble slightly. The spatula's eyes are swollen. It reaches over and stabs its spoon into a piece of molten jelly, then sits back down. The pineapple watches in disbelief as the fork tucks into its heap of stew. The pencil, sitting next to it, is in tears. Upset, the fork winces as it eats. Observing it, the spatula gets up from its bench and goes to its uncle who is now throwing down its spoon and sobbing uncontrollably. The spatula leans into its relative who hugs it tightly, then pulls the pencil to its other side. The pineapple is staring self-consciously at its napkin when the fork's hand reaches out and tucks it in the family embrace. The fork's body rocks as it cries. At the other end of the blanket, the blue lights on the guitar strings begin to flash."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Behind him, hedges blossoming outside the schoolhouse are swayed by the intensifying breeze. Harriet glances at the gardens warily, then withdraws. She takes up the woolen scarf, marches up the steps to the schoolhouse porch, and slips indoors. Laura and Max are riveted to the radio broadcast in the pantry. Theo and Harriet arrive. They remain and observe. Theo looks anxious. Harriet is absorbed in contemplation. The announcer fidgets nervously. Unwavering, Theo gazes straight at the radio set. Standing fixed to the floor, Theo persists in examining the sounds from the radio, his expression drooping sorrowfully as he ponders the announcer's message. He rambles away, leaving Harriet alone with Laura and Max. The two children are captivated by the broadcast. Harriet crouches down on the floor beside them. Looking up at Harriet, pale with anxiety, Laura turns back to the radio. Theo is now in the space. He shifts to a door, which is being partially curtained on the inside, and gazes out. He then acquires a strip of worn cloth and drapes it over the door, shutting out the light entirely. Outside, the aluminum bars of a weather vane clang against each other. Then, more chimes are rattled by the strengthening gust. Theo sits indoors in muted lights, gazing and failing me ahead. Harriet glides into the area and halts next to Laura and Max, who are leaning against a wall. Theo nods. Theo grins. Theo turns to glance at his sister. Theo glows. His lips stretch into a grin. Later, in the dimly lit pantry, pots and cups, one full of broken eggshells, are lined up into two basins. On a counter lies a blunt spoon along with a peeled carrot, some apple skin on top of a cucumber. Theo, Harriet, and the two children sit quietly at the supper table in the adjoining area. Fidgeting awkwardly in his chair, Theo casts a quick glance at the others. Theo's startled. Theo's lips quiver slightly. Laura's eyes are puffed. She reaches over and pierces her knife into a piece of burnt pancake, then sits back down. Harriet stares in disbelief as Theo digs into his heap of food. Max, sitting beside him, is in tears. Distressed, Theo winces as he chews. Observing him, Laura gets up from her chair and goes to her uncle who is now putting down his knife and wailing uncontrollably. Laura leans into her uncle who embraces her firmly, then pulls Max to his other side. Harriet is gazing self-consciously at her plate when Theo's arm reaches out and includes her in the family embrace. Theo's body sways as he weeps. At the other edge of the table, the green lines on the digital clock begin to blink."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Behind him, cacti sprouting outside the cabin are swayed by the swelling breeze. Merrill eyes the flowers skeptically, then advances. He picks up the burlap sack, skips up the steps to the cabin porch, and jumps indoors. Morgan and Bo are fixated on the radio in the attic. Graham and Merrill arrive. They stand and observe. Graham looks uneasy. Merrill is pondering deeply. The presenter shifts anxiously. Unblinking, Graham gazes directly at the radio dial. Standing posed like a statue, Graham continues to assess the sounds from the radio, his features drooping sadly as he considers the presenter’s words. He drifts away, leaving Merrill behind with Morgan and Bo. The two children are hypnotized by the broadcast. Merrill crouches down on the floor beside them. Looking up at Merrill, pale with concern, Morgan returns to the radio. Graham is now in the area. He approaches a window, which is being partially curtained from the outside, and gazes out. He then picks up a curtain rod and affixes it over the window, blocking out the light entirely. Outside, the brass bells of a wind ornament clang against each other. Then, more chimes are disrupted by the intensifying wind. Graham sits indoors in dim ambience, glaring and missing me ahead. Merrill slides into the area and pauses next to Morgan and Bo, who are leaning against a wall. Graham nods. Graham grins. Graham turns to regard his brother. Graham beams. His lips widen into a grin. Later, in the dimly lit pantry, jars and bowls, one full of broken corn husks, are piled up into two basins. On a countertop lies a dull spoon along with a peeled apple, some banana peel on top of a carrot. Graham, Merrill, and the two children sit wordlessly at the dining table in the adjacent room. Fidgeting restlessly in his seat, Graham casts a quick look at the others. Graham is astonished. Graham’s lips quiver slightly. Morgan's eyes are puffy. He reaches over and jabs his spoon into a piece of burnt bread, then sits back down. Merrill watches incredulously as Graham digs into his heap of food. Bo, sitting beside him, is weeping. Upset, Graham grimaces as he eats. Watching him, Morgan rises from his chair and goes to his dad who is now dropping his spoon and crying uncontrollably. Morgan leans into his father who hugs him tightly, then pulls Bo to his other side. Merrill is staring self-consciously at his glass when Graham's hand reaches out and draws him into the family hug. Graham's body sways as he weeps. At the other end of the table, the blue lights on the baby monitor begin to blink."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Beside her, lamps tumbling near the aquarium are splashed by the swirling mist. Violet scans the paintings hesitantly, then ambles away. She grabs the woolen scarf, skips up the ramp to the gallery foyer, and tumbles indoors. Peter and Sue are transfixed by the radio dial in the attic. Chloe and Violet enter. They pause and observe. Chloe looks nervous. Violet is lost in contemplation. The mechanic retreats hesitantly. Resolute, Chloe gazes straight at the radio dial. Standing tethered to the carpet, Chloe continues to examine the sketches on the radio, her expression drooping sadly as she contemplates the mechanic's tales. She meanders away, leaving Violet alone with Peter and Sue. The duo is hypnotized by the dial. Violet crouches down on the tiles next to them. Looking over at Violet, pale with anxiety, Peter turns back to the radio. Chloe is now back in the chamber. She shifts to a curtain, which is being partly draped on the exterior, and glimpses out. She then grabs a strip of faded fabric and drapes it over the curtain, shrouding the glow entirely. Inside, the brass wires of a harp rattle against each other. Then, more strings are rattled by the intensifying gust. Chloe sits outdoors in faint shadows, gazing and losing myself onward. Violet prances into the chamber and settles beside Peter and Sue, who are leaning against a post. Chloe nods. Chloe grins. Chloe rotates to glance at her sister. Chloe beams. Her mouth stretches into a grin. Later, in the dimly lit pantry, utensils and saucers, one filled with shattered seashells, are piled up into two tubs. On a counter rests a blunt spoon along with a peeled apple, some carrot shavings on top of a pepper. Chloe, Violet, and the couple sit quietly at the dining bench in the adjacent alley. Squirming uncomfortably in her stool, Chloe darts a fleeting gaze at the group. Chloe's astonished. Chloe's mouth quivers slightly. Peter's cheeks are puffy. He leans over and jabs his skewer into a slice of charred pastry, then settles back in. Violet observes incredulously as Chloe digs into her heap of snacks. Sue, sitting beside her, is sobbing. Distressed, Chloe grimaces as she munches. Watching her, Peter rises from his stool and approaches his mom who is now flinging down her skewer and weeping uncontrollably. Peter nestles into his mother who embraces him warmly, then draws Sue to her opposite side. Violet is gawking unsurely at her bowl when Chloe's limb stretches out and nestles her in the communal cuddle. Chloe's frame sways as she laments. At the opposite edge of the bench, the green displays on the mobile receiver start to flicker."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Graham, Merrill, Morgan, and Bo face growing tension as they watch unsettling news on TV, reacting with concern and contemplation. Graham boards up windows against the increasing wind, while wind chimes clatter outside. In the dimly lit kitchen, the family shares a tense dinner. Graham is taken aback, visibly affected by the situation, leading to an emotional breakdown. Morgan comforts him, joined by Bo, as Graham pulls Merrill into a familial embrace, offering solace despite the surrounding chaos. Meanwhile, the baby monitor's red lines flash ominously, underscoring the mounting unease."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "At the other end of the table the red lines on the baby monitor begin to flash Graham's body rocks as he cries the family embrace Merrill is staring selfconsciously at his plate when Graham's hand reaches out and tucks him in Morgan leans into his father who hugs him tightly then pulls Bo to his other side Observing him Morgan gets up from his chair and goes to his dad who is now throwing down his fork and sobbing uncontrollably Upset Graham winces as he eats Bo sitting next to him is in tears Merrill watches in disbelief as Graham tucks into his mount of food He reaches over and stabs his fork into a piece of molten toast then sits back down Morgan's eyes are swollen Graham's lips tremble slightly Graham's taken aback Shifting awkwardly in his chair Graham casts a fleeting glance at the others Graham Merrill and the two children sit silently at the dinner table in the next room some potato peel on top of a tomato On a worktop lies a sharp knife along with a skinned onion Later in the dimly lit kitchen pans and bowls one full of empty eggshells are stacked up into two sinks His lips spread into a smile Graham beams Graham turns to look at his brother Graham smiles Graham nods Merrill sauces into the room and stops next to Morgan and Bo who are standing against a wall Graham sits indoors in dim lights staring and failing me ahead Then more chimes are disturbed by the strengthening breeze Outside the silver pipes of a wind chime knock against each other He then takes a plank of old wood and secures it over the window blocking out the light completely He moves to a window which is being partially boarded up on the inside and peers out Graham is now in the room Morgan turns back to the TV Looking up at Merrill pale with worry Merrill kneels down on the floor beside them The two children are mesmerized by the screen He wanders off leaving Merrill alone with Morgan and Bo Graham continues to scrutinize the images on the TV his features sagging mournfully as he reflects on the presenter's words Standing rooted to the floor Graham stares directly at the television screen Unflinching The presenter shifts fearfully Merrill is deep in thought Graham looks uneasy They stand and watch Graham and Merrill arrive Morgan and Bo are glued to the TV screen in the closet He picks up the cotton sack jogs up the steps to the farmhouse veranda and hits indoors Merrill eyes the crops suspiciously then retreats Behind him shrubs growing outside the farmhouse are buffeted by the growing wind"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Looking up at Merrill pale with worry Merrill watches in disbelief as Graham tucks into his mount of food Graham is now in the room Standing rooted to the floor Graham and Merrill arrive He then takes a plank of old wood and secures it over the window blocking out the light completely They stand and watch Graham Merrill and the two children sit silently at the dinner table in the next room Graham's body rocks as he cries He picks up the cotton sack jogs up the steps to the farmhouse veranda and hits indoors the family embrace He wanders off leaving Merrill alone with Morgan and Bo The presenter shifts fearfully Bo sitting next to him is in tears Merrill is deep in thought At the other end of the table the red lines on the baby monitor begin to flash Morgan turns back to the TV Graham smiles On a worktop lies a sharp knife along with a skinned onion Graham nods Graham looks uneasy Upset Graham winces as he eats Graham continues to scrutinize the images on the TV his features sagging mournfully as he reflects on the presenter's words Behind him shrubs growing outside the farmhouse are buffeted by the growing wind Morgan and Bo are glued to the TV screen in the closet Merrill sauces into the room and stops next to Morgan and Bo who are standing against a wall His lips spread into a smile Observing him Morgan gets up from his chair and goes to his dad who is now throwing down his fork and sobbing uncontrollably Morgan's eyes are swollen Graham's taken aback He moves to a window which is being partially boarded up on the inside and peers out Later in the dimly lit kitchen pans and bowls one full of empty eggshells are stacked up into two sinks Graham sits indoors in dim lights staring and failing me ahead Graham beams He reaches over and stabs his fork into a piece of molten toast then sits back down Merrill is staring selfconsciously at his plate when Graham's hand reaches out and tucks him in The two children are mesmerized by the screen Morgan leans into his father who hugs him tightly then pulls Bo to his other side Graham's lips tremble slightly Graham stares directly at the television screen Outside the silver pipes of a wind chime knock against each other Merrill kneels down on the floor beside them Merrill eyes the crops suspiciously then retreats Graham turns to look at his brother Then more chimes are disturbed by the strengthening breeze some potato peel on top of a tomato Shifting awkwardly in his chair Graham casts a fleeting glance at the others Unflinching"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Merrill sauces into the room and stops next to Morgan and Bo who are standing against a wall Graham nods Graham smiles Graham turns to look at his brother Graham beams His lips spread into a smile Later in the dimly lit kitchen pans and bowls one full of empty eggshells are stacked up into two sinks On a worktop lies a sharp knife along with a skinned onion some potato peel on top of a tomato Graham Merrill and the two children sit silently at the dinner table in the next room Shifting awkwardly in his chair Graham casts a fleeting glance at the others Graham's taken aback Graham's lips tremble slightly Morgan's eyes are swollen He reaches over and stabs his fork into a piece of molten toast then sits back down Merrill watches in disbelief as Graham tucks into his mount of food Bo sitting next to him is in tears Upset Graham winces as he eats Observing him Morgan gets up from his chair and goes to his dad who is now throwing down his fork and sobbing uncontrollably Morgan leans into his father who hugs him tightly then pulls Bo to his other side Merrill is staring selfconsciously at his plate when Graham's hand reaches out and tucks him in the family embrace Graham's body rocks as he cries At the other end of the table the red lines on the baby monitor begin to flash Behind him shrubs growing outside the farmhouse are buffeted by the growing wind Merrill eyes the crops suspiciously then retreats He picks up the cotton sack jogs up the steps to the farmhouse veranda and hits indoors Morgan and Bo are glued to the TV screen in the closet Graham and Merrill arrive They stand and watch Graham looks uneasy Merrill is deep in thought The presenter shifts fearfully Unflinching Graham stares directly at the television screen Standing rooted to the floor Graham continues to scrutinize the images on the TV his features sagging mournfully as he reflects on the presenter's words He wanders off leaving Merrill alone with Morgan and Bo The two children are mesmerized by the screen Merrill kneels down on the floor beside them Looking up at Merrill pale with worry Morgan turns back to the TV Graham is now in the room He moves to a window which is being partially boarded up on the inside and peers out He then takes a plank of old wood and secures it over the window blocking out the light completely Outside the silver pipes of a wind chime knock against each other Then more chimes are disturbed by the strengthening breeze Graham sits indoors in dim lights staring and failing me ahead"
        }
      ]
    }
  ]
}