{
  "ground_truth": "She walks over to the torch, picks it up, and shines it at Merrill, who's stacking crates and live sacks of dog food in front of the chute. He slides wearily down his barricade to the ground. Spotting a can of dog food on the floor, he picks it up and, rising slightly, reaches up beside him to slap it on top of the pile of sacks. Sitting back down on the floor, he looks across at Bo, and then picks up his torch, using it to search the basement for the others. The beam illuminates his brother, sitting on the floor, leaning against a pillar. Morgan is sitting between Graham's legs, his head pushed back into his father's chest. Merrill's eyes widened in alarm. Graham has one hand on Morgan's chest, the other gripping his son's shoulder. Bo stares at them wide-eyed. Graham rests his head against Morgan's. Bo goes to sit on Merrill's lap, tears welling in her eyes. Morgan holds the knees of his father's jeans tightly as he struggles with his breathing. Graham lifts his head slightly and stares angrily into the distance. His lips quiver. Merrill wheels Morgan on, mouthing silent words of earnest prayer. Morgan relaxes his grip on his father's jeans. Morgan lies back, his breathing returning to normal. Merrill stares across at them, blinking rapidly. He swallows. He turns his off. Bo turns hers off. In Graham's mind, he reaches the scene of the accident. Caroline talks to him. He stares at the ground, his lips trembling. Caroline nods. She smiles bleakly. Graham walks slowly past a police car and a huddle of policemen standing over Ray who's sitting on the ground, head bowed. A little way beyond is Ray's Ford pickup truck smashed into the tree, stretched into any of the front and a couple of paramedics standing by. They turn to look at Graham as he approaches. Back in the basement, the main light is on. Graham looks up. Merrill walks over to the radio. Graham stares blearily down at the floor. Graham looks up at Merrill in shock. Graham gets to his feet and takes a step towards his brother. Graham looks reflectively down at the ground. Merrill regards him accusingly. Graham frowns and shakes his head. Merrill steps towards him. Graham nods numbly, his mouth agape. They turn to look at Morgan asleep on the floor, his head resting on folded blankets. Graham glances at the door. Suddenly, thinking of something, Graham walks over to Morgan, and crouching down, lifts up the back of the boy's beige and brown check shirt. Graham glances up in relieved surprise and pulls the baby monitor out of the back pocket of Morgan's jeans.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She strides over to the flashlight, lifts it up, and directs it at Merrill, who's piling crates and sealed bags of canine nourishment in front of the passage. He slides tiredly down his defense to the ground. Noticing a can of canine nourishment on the floor, he lifts it up and, rising slightly, reaches up beside him to smack it on top of the heap of bags. Sitting back down on the floor, he gazes across at Bo, and then lifts up his flashlight, utilizing it to sweep the cellar for the others. The ray illuminates his sibling, sitting on the floor, leaning against a column. Morgan is sitting between Graham's legs, his head pushed back into his father's chest. Merrill's eyes widened in fear. Graham has one hand on Morgan's chest, the other clutching his son's shoulder. Bo stares at them wide-eyed. Graham rests his head against Morgan's. Bo goes to sit on Merrill's lap, tears welling in her eyes. Morgan grips the knees of his father's jeans tightly as he struggles with his respiration. Graham raises his head slightly and stares angrily into the expanse. His lips tremble. Merrill wheels Morgan on, mouthing silent words of earnest entreaty. Morgan loosens his grip on his father's jeans. Morgan reclines back, his respiration normalizing. Merrill gazes across at them, blinking rapidly. He swallows. He turns his off. Bo turns hers off. In Graham's mind, he reaches the scene of the mishap. Caroline speaks to him. He gazes at the ground, his lips quivering. Caroline nods. She smiles somberly. Graham strides slowly past a police car and a cluster of policemen standing over Ray who's sitting on the ground, head bowed. A little way beyond is Ray's Ford pickup truck smashed into the tree, stretched into any of the front and a couple of paramedics standing by. They turn to look at Graham as he approaches. Back in the cellar, the main light is on. Graham gazes up. Merrill strides over to the radio. Graham stares groggily down at the floor. Graham gazes up at Merrill in shock. Graham gets to his feet and takes a step towards his sibling. Graham gazes pensively down at the ground. Merrill regards him reproachfully. Graham frowns and shakes his head. Merrill steps towards him. Graham nods numbly, his mouth agape. They turn to gaze at Morgan asleep on the floor, his head resting on folded covers. Graham glances at the door. Suddenly, thinking of something, Graham strides over to Morgan, and crouching down, lifts up the back of the boy's beige and brown check shirt. Graham glances up in relieved surprise and pulls the baby monitor out of the back pocket of Morgan's jeans."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She walks over to the torch, and it is picked up by her, then shined at Merrill, who's stacking crates and live sacks of dog food in front of the chute. He slides wearily down to the ground from his barricade. A can of dog food is spotted by him on the floor, and it is picked up by him, and, rising slightly, he reaches up beside him to slap it on top of the pile of sacks. Sitting back down on the floor, Bo is looked across at by him, and then his torch is picked up, and it is used by him to search the basement for the others. His brother is illuminated by the beam, sitting on the floor, leaning against a pillar. Morgan sits between Graham's legs, his head pushed back into his father's chest. Merrill's eyes widen in alarm. One of Graham's hands is placed on Morgan's chest, and the other grips his son's shoulder. They are stared at wide-eyed by Bo. Graham's head is rested against Morgan's. Bo goes to sit on Merrill's lap, tears welling in her eyes. The knees of his father's jeans are held tightly by Morgan as his breathing is struggled with. Graham's head is lifted slightly, and he stares angrily into the distance. His lips quiver. Merrill mouths silent words of earnest prayer as he wheels Morgan on. The grip on his father's jeans is relaxed by Morgan. Morgan lies back, his breathing returning to normal. They are stared at across by Merrill, blinking rapidly. He swallows. His torch is turned off by him. Bo turns hers off. In Graham's mind, the scene of the accident is reached by him. Caroline talks to him. The ground is stared at by him, his lips trembling. A nod is given by Caroline. A bleak smile is given by her. Graham walks slowly past a police car and a huddle of policemen standing over Ray, who's sitting on the ground, head bowed. A little way beyond, Ray's Ford pickup truck is seen smashed into the tree, stretched into the front, and a couple of paramedics stand by. They turn to look at Graham as he approaches. Back in the basement, the main light is turned on. Graham looks up. Merrill walks over to the radio. The floor is stared down at blearily by Graham. Graham looks up at Merrill in shock. Graham gets to his feet and takes a step towards his brother. The ground is looked at reflectively by Graham. He is regarded accusingly by Merrill. Graham frowns and shakes his head. Merrill steps towards him. Graham nods numbly, his mouth agape. They turn to look at Morgan asleep on the floor, his head resting on folded blankets. The door is glanced at by Graham. Suddenly, thinking of something, Morgan is walked over to by Graham, and crouching down, the back of the boy's beige and brown check shirt is lifted up by him. Relieved surprise is glanced up with by Graham, and the baby monitor is pulled out by him from the back pocket of Morgan's jeans."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She walks to the torch, picks it up, and shines it at Merrill, stacking crates and dog food sacks by the chute. He slides wearily down, spots a can on the floor, and places it on top of the sacks. Sitting again, he shines the torch, illuminating his brother leaning against a pillar with Morgan between Graham's legs. Merrill, alarmed, watches Graham, who holds Morgan's chest and shoulder. Bo, teary-eyed, sits on Merrill's lap. Morgan grips his father's jeans tightly, struggling to breathe. Graham lifts his head, staring distantly, lips quivering. Merrill silently prays, and Morgan's grip loosens as his breathing normalizes. Merrill blinks rapidly, turning off his torch, followed by Bo. Graham remembers the accident scene—Caroline speaks, nods, and smiles bleakly. Graham walks past police, seeing Ray and his smashed pickup. Back in the basement, the main light is on. Graham looks at Merrill in shock, then rises and steps forward. Merrill regards him accusingly. Graham nods numbly, glancing at Morgan sleeping on folded blankets. Inspired, Graham checks Morgan's shirt, finding the baby monitor in his back pocket, relieved."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She picks up the torch and shines it at Merrill, stacking crates and dog food sacks by the chute. He slides wearily down, spots a can, and places it on the pile. Sitting, he shines the torch, illuminating his brother leaning against a pillar with Morgan between Graham's legs. Graham grips Morgan's chest and shoulder while Merrill looks alarmed. Bo sits on Merrill's lap, teary-eyed. Morgan struggles to breathe, clenching his father's jeans. Graham lifts his head, lips quivering, while Merrill mouths prayers. Morgan's breathing normalizes, and Merrill stares, blinking. Merrill and Bo turn off their torches. In a memory, Graham reaches an accident scene, seeing Caroline. She nods and smiles bleakly. He walks past police and Ray by a wrecked truck. Back in the basement, the main light is on. Graham stares at the floor, then looks at Merrill in shock. Getting up, he steps toward Merrill, who regards him accusingly. They turn to Morgan asleep. Thinking of something, Graham lifts Morgan's shirt, retrieves the baby monitor."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She confidently walks over to the nearby torch, carefully picks it up, and directs its light toward Merrill, who is busy stacking crates and arranging heavy sacks of dog food in a neat barricade in front of the chute. Weary from his efforts, he slides dejectedly down his makeshift wall to the ground. Noticing a can of dog food lying on the floor, he picks it up and, with a slight rise, reaches up beside him to place it on top of the growing pile of sacks. Settling back down on the floor, he casts a glance across at Bo, then retrieves his torch, using its beam to meticulously search the dimly lit basement for the others. The beam sweeps across the room and illuminates his brother, who is seated on the floor, leaning wearily against a pillar for support. Morgan is securely nestled between Graham's legs, his head lovingly tilted back against his father's chest. Merrill's eyes widen in sudden alarm. Graham holds one hand protectively on Morgan's chest, the other gripping his son's shoulder firmly. Bo, eyes open wide with concern, stares at them intently. Graham gently rests his head against Morgan's. Overcome with emotion, Bo moves to sit on Merrill's lap, tears filling her eyes. As Morgan struggles with his breathing, he clings tightly to the knees of his father's jeans. Graham lifts his head slightly, staring angrily into the distance, his lips quivering with a mix of emotions. Merrill, earnest in his concern, mouths silent prayers as he watches over them. Gradually, Morgan relaxes his grip as his breathing returns to a normal pace. Merrill, unable to look away, blinks rapidly and swallows. He turns his flashlight off, and Bo follows suit, switching hers off as well. In a flashback within Graham's mind, he envisions the scene of the accident. Caroline speaks to him softly. He gazes downward at the ground, his lips trembling with unspoken words. Caroline gives him a nod, offering a bleak, supportive smile. Graham walks slowly past a parked police car and a group of policemen who are gathered around Ray, who is sitting dejectedly on the ground, his head bowed. A short distance away is Ray's Ford pickup truck, its front end smashed into a tree, with a couple of paramedics standing by. They turn to face Graham as he approaches the scene. Back in the familiar confines of the basement, the main light suddenly flickers on. Graham looks up, momentarily blinded by the brightness. Merrill walks over to the radio with purpose. Graham, still adjusting, stares blearily down at the floor. He then looks up at Merrill, shock clear in his expression. Slowly, Graham rises to his feet and takes a tentative step towards his brother. Graham, deep in thought, glances reflectively down at the ground. Merrill meets his gaze, an accusatory look in his eyes. Graham frowns in response and shakes his head, conflicted. Merrill steps decisively towards him. Graham nods numbly, his mouth slightly agape with realization. They both turn to observe Morgan peacefully asleep on the floor, his head resting comfortably on folded blankets. Graham's eyes wander to the door. Suddenly, an idea strikes him, and with determined purpose, Graham walks over to Morgan. Crouching down, he gently lifts up the back of the boy's beige and brown checkered shirt. Graham looks up, a wave of relieved surprise washing over him as he discovers and retrieves the baby monitor tucked away in the back pocket of Morgan's jeans."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She strides confidently over to the nearby torch, carefully reaching out to pick it up, and with deliberate precision, directs its illuminating beam of light toward Merrill. He is busily engaged in the task of stacking crates and meticulously arranging heavy sacks of dog food, creating a neat and functional barricade right in front of the chute. Weary from his strenuous efforts, he allows himself to slide dejectedly down his makeshift wall until he reaches the ground, a gesture echoing his fatigue. His gaze falls upon a can of dog food that is lying on the floor, almost out of place. He picks it up and, with a slight rise of effort, stretches upwards to place it atop the growing pile of sacks. Settling back down on the floor, he casts a thoughtful glance across at Bo. He then retrieves his torch, using its steady beam to meticulously scour the dimly lit and shadowy basement in search of the others. The beam sweeps methodically across the room and comes to rest on his brother, who is seated on the floor, leaning wearily and heavily against a pillar for much-needed support. Morgan is securely nestled between Graham's legs, his head lovingly tilted back against his father's comforting chest. Merrill's eyes suddenly and dramatically widen in alarm at the sight. Graham holds one hand protectively on Morgan's chest, the other gripping his son's shoulder firmly and reassuringly. Bo, her eyes reflecting wide concern, stares at them intently, her worry evident. Graham gently rests his head against Morgan's, a gesture of solidarity and comfort. Overcome with a wave of emotion, Bo moves to sit on Merrill's lap, tears welling up and filling her eyes. As Morgan struggles with his breathing, he clings tightly to the fabric of his father's jeans, a desperate hold. Graham lifts his head slightly, staring into the distance with anger and mixed emotions, his lips quivering. Merrill, earnest in his concern, silently mouths prayers as he watches over them. Gradually, as time passes, Morgan relaxes his grip as his breathing returns to a more normal pace. Merrill, unable to look away, blinks rapidly and swallows, conveying a silent measure of relief. He turns his flashlight off with a click, and Bo follows his lead, switching hers off as well, plunging them into darkness. Within Graham's mind, a vivid flashback unfolds, taking him to the scene of the accident. Caroline speaks to him softly, her voice echoing gently. He gazes downward at the ground, his lips trembling with unspoken words and heavy emotions. Caroline gives him a nod, offering a bleak yet supportive smile that resonates. Graham walks slowly past a parked police car and a group of policemen gathered closely around Ray, who is sitting dejectedly on the ground, his head bowed in despondency. A short distance away, Ray's Ford pickup truck is clearly visible, its front end smashed into a tree, with a couple of paramedics standing by, their attention focused. They turn to face Graham as he approaches the somber scene. Back in the familiar and shadowy confines of the basement, the main light suddenly flickers on, flooding the room with unexpected brightness. Graham looks up, momentarily blinded by the sudden influx of light. Merrill walks over to the radio with a sense of purpose in his stride. Graham, still adjusting to the brightness, stares blearily down at the floor, trying to regain his bearings. He then looks up at Merrill, shock clearly etched on his features. Slowly, Graham rises to his feet and takes a tentative step toward his brother, the movement deliberate. Deep in thought, Graham glances reflectively down at the ground, contemplating. Merrill meets his gaze, an accusatory look reflected in his eyes. Graham frowns in response, shaking his head, visibly conflicted by the exchange. Merrill steps decisively towards him, closing the distance. Graham nods numbly, his mouth slightly agape as realization dawns upon him. They both turn in unison to observe Morgan, who is now peacefully asleep on the floor, his head resting comfortably on folded blankets. Graham's eyes wander thoughtfully to the door, and suddenly, an idea strikes him with clarity. With determined purpose, Graham walks over to Morgan. Crouching down, he gently lifts up the back of the boy's beige and brown checkered shirt. Graham looks up, a wave of relieved surprise washing over him, as he discovers and retrieves the baby monitor tucked away in the back pocket of Morgan's jeans."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She steadily walks over to where the torch is resting, carefully picks it up in her hand, and directs its beam toward Merrill, who is in the middle of industriously stacking crates alongside live sacks of dog food directly in front of the chute. Exhaustion overtakes him as he slides wearily down his makeshift barricade to sit on the ground. His eyes catch the sight of a can of dog food lying on the floor near him, so he bends slightly forward to pick it up and then, rising just enough to reach the top of the pile, he casually slaps it on top of the heap. Settling back down onto the floor, he shifts his gaze across the room to Bo, only to then reach for his torch to scan the basement for the others. The beam sweeps across the room and lands on his brother, who is seated on the floor with his back leaning against a sturdy pillar. Right between Graham's legs, Morgan sits with his head comfortably nestled back against his father's chest, creating a moment of shared comfort. Merrill's eyes widen in sudden alarm as he comprehends the scene unfolding before him. Graham's one hand is steadily placed on Morgan's chest while the other firmly grips his son's shoulder, a silent gesture of reassurance. Meanwhile, Bo stares at them with wide eyes, absorbing the gravity of the situation. Graham, seeking solace, gently rests his head against Morgan's. With a heart full of emotion, Bo moves to sit on Merrill's lap, her eyes brimming with unshed tears. Morgan clings tightly to his father's jeans, fingers digging in as he grapples with his struggle for breath. Graham lifts his head slightly, his anger seething just beneath the surface as he casts an intense stare into the distance, his lips quivering with unspoken words. Merrill, sensing the gravity of the moment, turns his attention to Morgan, mouthing a fervent, silent prayer for his nephew's well-being. With gradual relief, Morgan releases his grip on his father's jeans, allowing himself to lie back as his breathing slowly returns to normal, eliciting a collective sigh of relief from everyone present. Merrill continues to watch, his eyes blinking rapidly in a mix of gratitude and disbelief. He swallows hard, almost as if to reset himself, and decisively switches off his torch; Bo follows suit, turning hers off as well. In Graham's mind, a vivid scene unfolds as he mentally transports himself to the site of the accident. He listens as Caroline speaks to him, her words permeating his consciousness. His gaze focuses intensely on the ground, his lips trembling with the weight of past emotions. Caroline offers a nod of understanding, her smile tinged with a hint of sorrow. In his memory, Graham walks slowly past a parked police car, and a cluster of policemen stand huddled together, overseeing Ray, who sits on the ground with his head bowed in remorse. Not far away, Ray's Ford pickup truck sits mangled against a tree, the front end completely crushed while a couple of paramedics stand nearby, their attention momentarily diverted as they glance at Graham's approach. Snapping back to the present in the basement, the main light flickers to life. Graham raises his head to take in the change in the room’s illumination, while Merrill makes his way over to the radio. Graham, still processing everything, stares blearily down at the floor, lost in contemplation. When he looks up at Merrill, shock registers on his face, stirring him into action. Graham pushes himself to his feet, taking a purposeful step toward his brother with newfound resolve. He pauses for a moment to look reflectively down at the ground, a frown etching his features as he shakes his head, processing the events. Merrill steps closer, an accusatory edge in his demeanor. Graham, overwhelmed by the moment, nods numbly and leaves his mouth agape, words failing him. Both brothers turn their attention to Morgan, now resting peacefully on the floor with his head cushioned on folded blankets. Graham's eyes briefly dart to the door, a sudden thought sparking to life within him. Compelled by this realization, he walks over to where Morgan lies and gently crouches down. He carefully lifts the back of the boy's beige and brown check shirt, his heart swelling with hope. With a glance of relieved surprise, he reaches into the back pocket of Morgan's jeans and pulls out the baby monitor, a symbol of their shared vigilance and love."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She walks over to the torch, picks it up, and shines it at Merrill, who is stacking crates and sacks of dog food in front of the chute. Exhausted, he slides down to the ground, spots a can of dog food, and adds it to the pile before sitting back down and using his torch to locate the others in the basement. The beam reveals his brother sitting on the floor with Morgan nestled between Graham’s legs. Merrill notices Graham, with a hand on Morgan's chest and shoulder, resting his head against the boy. Bo joins Merrill, sitting on his lap tearfully, while Morgan clings to his father's jeans, struggling with his breathing. Graham stares into the distance with quivering lips, prompting Merrill to silently pray. As Morgan relaxes and breathes normally again, Merrill watches them, turning off his torch as Bo follows suit. In his mind, Graham revisits the accident scene, listening as Caroline speaks to him while he observes the surroundings with trembling lips. Continuing past the police and the crash site, he approaches paramedics standing by Ray's crashed truck. Back in the basement, the main light is on, and Graham looks up, then at Merrill by the radio. Surprised, Graham stands and steps toward his brother, exchanging a reflective and accusatory glance. They turn their focus to Morgan, asleep on the floor. Graham, suddenly inspired, checks Morgan and discovers a baby monitor in his jeans' back pocket, feeling relieved."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She walks over to the torch, a heavy-duty flashlight often used in dimly lit or emergency situations, picks it up, and shines it at Merrill, who's stacking crates and large sacks of dog food in front of the chute, a sloped channel designed to direct and guide materials to a lower level. He slides wearily down his barricade to the ground. Spotting a can of dog food on the floor, a staple for feeding pets in many households, he picks it up and, rising slightly, reaches up beside him to slap it on top of the pile of sacks. Sitting back down on the floor, he looks across at Bo, a young girl known for her wide-eyed innocence, and then picks up his torch, using it to search the basement, a dimly lit, often cluttered underground space in a building, for the others. The beam illuminates his brother, sitting on the floor, leaning against a pillar, which provides structural support to the building. Morgan is sitting between Graham's legs, his head pushed back into his father's chest, seeking comfort and security. Merrill's eyes widened in alarm. Graham has one hand on Morgan's chest, the other gripping his son's shoulder in a protective manner. Bo stares at them wide-eyed. Graham rests his head against Morgan's. Bo goes to sit on Merrill's lap, tears welling in her eyes, reflecting her emotional vulnerability in the tense situation. Morgan holds the knees of his father's jeans tightly as he struggles with his breathing, indicating his distress and need for reassurance. Graham lifts his head slightly and stares angrily into the distance. His lips quiver. Merrill wheels Morgan on, mouthing silent words of earnest prayer, a testament to his hope for his brother's well-being. Morgan relaxes his grip on his father's jeans. Morgan lies back, his breathing returning to normal, a sign of relief to all present. Merrill stares across at them, blinking rapidly. He swallows. He turns his off, implying his flashlight, indicating that the tension has eased. Bo turns hers off. In Graham's mind, he reaches the scene of the accident, a traumatic event that changed his life. Caroline talks to him, her voice echoing with memories. He stares at the ground, his lips trembling. Caroline nods. She smiles bleakly, a reflection of shared past sorrows. Graham walks slowly past a police car and a huddle of policemen standing over Ray who's sitting on the ground, head bowed in regret. A little way beyond is Ray's Ford pickup truck, a robust vehicle known for its utility, smashed into the tree, a common cause of road accidents, stretched into any of the front and a couple of paramedics standing by, ready to assist any injured. They turn to look at Graham as he approaches. Back in the basement, the main light is on, a sign that the worst of the crisis is over. Graham looks up. Merrill walks over to the radio, a means of communication that could bring news or relief in the tense atmosphere. Graham stares blearily down at the floor. Graham looks up at Merrill in shock. Graham gets to his feet and takes a step towards his brother. Graham looks reflectively down at the ground. Merrill regards him accusingly, reflecting underlying tensions between them. Graham frowns and shakes his head. Merrill steps towards him. Graham nods numbly, his mouth agape, as if accepting an unsettling truth. They turn to look at Morgan asleep on the floor, his head resting on folded blankets, a makeshift bed providing him comfort. Graham glances at the door, contemplating their next move. Suddenly, thinking of something, Graham walks over to Morgan, and crouching down, lifts up the back of the boy's beige and brown check shirt. Graham glances up in relieved surprise and pulls the baby monitor, a device used to listen to sounds made by an infant, out of the back pocket of Morgan's jeans, bringing a sense of relief and connection."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She walks over to the torch picks it up and shines it at Merrill who is stacking crates and live sacks of dog food in front of the chute. He slides wearily down his barricade to the ground. Spotting a can of dog food on the floor he picks it up and rising slightly reaches up beside him to slap it on top of the pile of sacks. Sitting back down on the floor he looks across at Bo and then picks up his torch using it to search the basement for the others. The beam illuminates his brother sitting on the floor leaning against a pillar. Morgan is sitting between Graham's legs his head pushed back into his father's chest. Merrill's eyes widened in alarm. Graham has one hand on Morgan's chest the other gripping his son's shoulder. Bo stares at them. wideeyed. Graham rests his head against Morgan's. Bo goes to sit on Merrill's lap tears welling in her eyes. Morgan holds the knees of his father's jeans tightly as he struggles with his breathing. Graham lifts his head slightly and stares angrily into the distance. His lips quiver. Merrill wheels Morgan on mouthing silent words of earnest prayer. Morgan relaxes his grip on his father's jeans. Morgan lies back his breathing returning to normal. Merrill stares across at them blinking rapidly. He swallows. He turns his off. Bo turns hers off. In Graham's mind he reaches the scene of the accident. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Caroline talks to him. He stares at the ground his lips trembling. Caroline nods. She smiles bleakly. Graham walks slowly past a police car and a huddle of policemen standing over. Ray who is sitting on the ground head bowed. A little way beyond is Ray's Ford pickup truck smashed into the tree stretched into any of the front and a couple of paramedics standing by. They turn to look at Graham as he approaches. Back in the basement the main light is on. Graham looks up. Merrill walks over to the radio. Graham stares blearily down at the floor. Graham looks up at Merrill in shock. Graham gets to his feet and takes a step towards his brother. Graham looks reflectively down at the ground. Merrill regards him accusingly. Graham frowns and shakes his head. Merrill steps towards him. Graham nods numbly his mouth agape. They turn to look at Morgan asleep on the floor his head resting on folded blankets. Graham glances at the door. Suddenly thinking of something. Graham walks over to Morgan and crouching down lifts up the back of the boy's beige and brown check shirt. Graham glances up in relieved surprise and pulls the baby monitor out of the back pocket of Morgan's jeans."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She walks over to the torch picks it up and shines it at Merrill who is stacking crates and live sacks of dog food in front of the chute. He slides wearily down his barricade to the ground. Spotting a can of dog food on the floor he picks it up and rising slightly reaches up beside him to slap it on top of the pile of sacks. Sitting back down on the floor he looks across at Bo and then picks up his torch using it to search the basement for the others. The beam illuminates his brother sitting on the floor leaning against a pillar. Morgan is sitting between Graham's legs his head pushed back into his father's chest. Merrill's eyes widened in alarm. Graham has one hand on Morgan's chest the other gripping his son's shoulder. Bo stares at them. wideeyed. Graham rests his head against Morgan's. Bo goes to sit on Merrill's lap tears welling in her eyes. Morgan holds the knees of his father's jeans tightly as he struggles with his breathing. Graham lifts his head slightly and stares angrily into the distance. His lips quiver. Merrill wheels Morgan on mouthing silent words of earnest prayer. Morgan relaxes his grip on his father's jeans. Morgan lies back his breathing returning to normal. Merrill stares across at them blinking rapidly. He swallows. He turns his off. Bo turns hers off. In Graham's mind he reaches the scene of the accident. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Caroline talks to him. He stares at the ground his lips trembling. Caroline nods. She smiles bleakly. Graham walks slowly past a police car and a huddle of policemen standing over. Ray who is sitting on the ground head bowed. A little way beyond is Ray's Ford pickup truck smashed into the tree stretched into any of the front and a couple of paramedics standing by. They turn to look at Graham as he approaches. Back in the basement the main light is on. Graham looks up. Merrill walks over to the radio. Graham stares blearily down at the floor. Graham looks up at Merrill in shock. Graham gets to his feet and takes a step towards his brother. Graham looks reflectively down at the ground. Merrill regards him accusingly. Graham frowns and shakes his head. Merrill steps towards him. Graham nods numbly his mouth agape. They turn to look at Morgan asleep on the floor his head resting on folded blankets. Graham glances at the door. Suddenly thinking of something. Graham walks over to Morgan and crouching down lifts up the back of the boy's beige and brown check shirt. Graham glances up in relieved surprise and pulls the baby monitor out of the back pocket of Morgan's jeans."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She walks over to the torch picks it up and shines it at Merrill who is stacking crates and live sacks of dog food in front of the chute. He slides wearily down his barricade to the ground. Spotting a can of dog food on the floor he picks it up and rising slightly reaches up beside him to slap it on top of the pile of sacks. Sitting back down on the floor he looks across at Bo and then picks up his torch using it to search the basement for the others. The beam illuminates his brother sitting on the floor leaning against a pillar. Morgan is sitting between Graham's legs his head pushed back into his father's chest. Merrill's eyes widened in alarm. Graham has one hand on Morgan's chest the other gripping his son's shoulder. Bo stares at them. wideeyed. Graham rests his head against Morgan's. Bo goes to sit on Merrill's lap tears welling in her eyes. Graham looks up at Merrill in shock. Graham gets to his feet and takes a step towards his brother. Graham looks reflectively down at the ground. Merrill regards him accusingly. Graham frowns and shakes his head. Merrill steps towards him. Graham nods numbly his mouth agape. They turn to look at Morgan asleep on the floor his head resting on folded blankets. Graham glances at the door. Suddenly thinking of something. Graham walks over to Morgan and crouching down lifts up the back of the boy's beige and brown check shirt. Graham glances up in relieved surprise and pulls the baby monitor out of the back pocket of Morgan's jeans."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She walks over to the torch picks it up and shines it at Merrill who is stacking crates and live sacks of dog food in front of the chute. He slides wearily down his barricade to the ground. Spotting a can of dog food on the floor he picks it up and rising slightly reaches up beside him to slap it on top of the pile of sacks. Sitting back down on the floor he looks across at Bo and then picks up his torch using it to search the basement for the others. The beam illuminates his brother sitting on the floor leaning against a pillar. They turn to look at Morgan asleep on the floor his head resting on folded blankets. Graham glances at the door. Suddenly thinking of something. Graham walks over to Morgan and crouching down lifts up the back of the boy's beige and brown check shirt. Graham glances up in relieved surprise and pulls the baby monitor out of the back pocket of Morgan's jeans."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "She saunters over to the lantern, lifts it, and flashes it at Denise, who's arranging baskets and stuffed bags of cat kibble beside the ladder. She tumbles lazily off her fortification to the dirt. Noticing a tin of cat kibble on the carpet, she grabs it, and standing slightly, extends it overhead to drop it atop the stack of bags. Perching back on the carpet, she peers at Lee, and then grabs her lantern, sweeping it around the attic to locate the rest. The glow reveals her sibling, sprawled on the carpet, leaning on a column. Robin is nestled between Alex's limbs, his head pressed into his parent's torso. Denise's eyes enlarged in distress. Alex has one hand on Robin's back, the other clutching his offspring's elbow. Lee observes them wide-eyed. Alex rests his cheek against Robin's. Lee goes to perch on Denise's lap, tears brimming in her eyes. Robin squeezes the cuffs of his parent's slacks tightly as he wrestles with his inhales. Alex lifts his cheek slightly and gazes irately into the void. His lips tremble. Denise wheels Robin on, mouthing silent wishes of fervent hope. Robin loosens his grip on his parent's slacks. Robin reclines, his breaths stabilizing. Denise gazes at them, blinking swiftly. She gulps. She switches hers off. Lee switches hers off. In Alex's thoughts, he arrives at the scene of the mishap. Margaret chats with him. He gazes at the earth, his lips quivering. Margaret nods. She grins faintly. Alex strolls leisurely past a fire truck and a cluster of officers towering over Sam who's crouched on the earth, head drooping. A short distance yonder is Sam's Chevy minivan crumpled into the bush, stretched into any of the grille and a duo of EMTs standing by. They pivot to gaze at Alex as he nears. Back in the attic, the primary bulb is aglow. Alex glances up. Denise traipses over to the stereo. Alex stares groggily downward at the carpet. Alex glances up at Denise in disbelief. Alex rises to his feet and steps towards his sibling. Alex gazes thoughtfully downward at the earth. Denise regards him accusingly. Alex furrows his brows and shakes his head. Denise strides towards him. Alex nods vacantly, his mouth agape. They pivot to observe Robin dozing on the carpet, his head propped on bunched quilts. Alex glances at the hatch. Suddenly, pondering something, Alex ambles over to Robin, and kneeling, lifts up the hem of the child's plaid and brown check jacket. Alex beams upward in relieved astonishment and extracts the walkie-talkie from the hip pocket of Robin's slacks."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In the dimly lit basement, Merrill wearily stacks crates and sacks of dog food to form a barricade. He sits down and uses a torch to check on his brother Graham and nephew Morgan, who is struggling to breathe while leaning against Graham. Bo, tearful, sits on Merrill's lap as Graham comforts Morgan, who eventually relaxes his grip and breathes normally. In a moment of reflection, Graham recalls a traumatic accident scene involving Caroline and Ray. Merrill and Graham exchange tense, silent glances, processing their emotions. Suddenly, Graham, realizing something, checks Morgan's pocket and finds a baby monitor, feeling relieved."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Graham glances up in relieved surprise and pulls the baby monitor out of the back pocket of Morgan's jeans Graham walks over to Morgan and crouching down lifts up the back of the boy's beige and brown check shirt Suddenly thinking of something Graham glances at the door They turn to look at Morgan asleep on the floor his head resting on folded blankets Graham nods numbly his mouth agape Merrill steps towards him Graham frowns and shakes his head Merrill regards him accusingly Graham looks reflectively down at the ground Graham gets to his feet and takes a step towards his brother Graham looks up at Merrill in shock Graham stares blearily down at the floor Merrill walks over to the radio Graham looks up Back in the basement the main light is on They turn to look at Graham as he approaches A little way beyond is Ray's Ford pickup truck smashed into the tree stretched into any of the front and a couple of paramedics standing by Ray who is sitting on the ground head bowed Graham walks slowly past a police car and a huddle of policemen standing over She smiles bleakly Caroline nods He stares at the ground his lips trembling Caroline talks to him In Graham's mind he reaches the scene of the accident Bo turns hers off He turns his off He swallows Merrill stares across at them blinking rapidly Morgan lies back his breathing returning to normal Morgan relaxes his grip on his father's jeans Merrill wheels Morgan on mouthing silent words of earnest prayer His lips quiver Graham lifts his head slightly and stares angrily into the distance Morgan holds the knees of his father's jeans tightly as he struggles with his breathing Bo goes to sit on Merrill's lap tears welling in her eyes Graham rests his head against Morgan's wideeyed Bo stares at them Graham has one hand on Morgan's chest the other gripping his son's shoulder Merrill's eyes widened in alarm Morgan is sitting between Graham's legs his head pushed back into his father's chest The beam illuminates his brother sitting on the floor leaning against a pillar Sitting back down on the floor he looks across at Bo and then picks up his torch using it to search the basement for the others Spotting a can of dog food on the floor he picks it up and rising slightly reaches up beside him to slap it on top of the pile of sacks He slides wearily down his barricade to the ground She walks over to the torch picks it up and shines it at Merrill who is stacking crates and live sacks of dog food in front of the chute"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He slides wearily down his barricade to the ground She walks over to the torch picks it up and shines it at Merrill who is stacking crates and live sacks of dog food in front of the chute Sitting back down on the floor he looks across at Bo and then picks up his torch using it to search the basement for the others Spotting a can of dog food on the floor he picks it up and rising slightly reaches up beside him to slap it on top of the pile of sacks Morgan is sitting between Graham's legs his head pushed back into his father's chest The beam illuminates his brother sitting on the floor leaning against a pillar Graham has one hand on Morgan's chest the other gripping his son's shoulder Merrill's eyes widened in alarm wideeyed Bo stares at them Bo goes to sit on Merrill's lap tears welling in her eyes Graham rests his head against Morgan's Graham lifts his head slightly and stares angrily into the distance Morgan holds the knees of his father's jeans tightly as he struggles with his breathing Merrill wheels Morgan on mouthing silent words of earnest prayer His lips quiver Morgan lies back his breathing returning to normal Morgan relaxes his grip on his father's jeans He swallows Merrill stares across at them blinking rapidly Bo turns hers off He turns his off Caroline talks to him In Graham's mind he reaches the scene of the accident Caroline nods He stares at the ground his lips trembling Graham walks slowly past a police car and a huddle of policemen standing over She smiles bleakly A little way beyond is Ray's Ford pickup truck smashed into the tree stretched into any of the front and a couple of paramedics standing by Ray who is sitting on the ground head bowed Back in the basement the main light is on They turn to look at Graham as he approaches Merrill walks over to the radio Graham looks up Graham looks up at Merrill in shock Graham stares blearily down at the floor Graham looks reflectively down at the ground Graham gets to his feet and takes a step towards his brother Graham frowns and shakes his head Merrill regards him accusingly Graham nods numbly his mouth agape Merrill steps towards him Graham glances at the door They turn to look at Morgan asleep on the floor his head resting on folded blankets Graham walks over to Morgan and crouching down lifts up the back of the boy's beige and brown check shirt Suddenly thinking of something Graham glances up in relieved surprise and pulls the baby monitor out of the back pocket of Morgan's jeans"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He stares at the ground his lips trembling Caroline nods She smiles bleakly Graham walks slowly past a police car and a huddle of policemen standing over Ray who is sitting on the ground head bowed A little way beyond is Ray's Ford pickup truck smashed into the tree stretched into any of the front and a couple of paramedics standing by They turn to look at Graham as he approaches Back in the basement the main light is on Graham looks up Merrill walks over to the radio Graham stares blearily down at the floor Graham looks up at Merrill in shock Graham gets to his feet and takes a step towards his brother Graham looks reflectively down at the ground Merrill regards him accusingly Graham frowns and shakes his head Merrill steps towards him Graham nods numbly his mouth agape They turn to look at Morgan asleep on the floor his head resting on folded blankets Graham glances at the door Suddenly thinking of something Graham walks over to Morgan and crouching down lifts up the back of the boy's beige and brown check shirt Graham glances up in relieved surprise and pulls the baby monitor out of the back pocket of Morgan's jeans She walks over to the torch picks it up and shines it at Merrill who is stacking crates and live sacks of dog food in front of the chute He slides wearily down his barricade to the ground Spotting a can of dog food on the floor he picks it up and rising slightly reaches up beside him to slap it on top of the pile of sacks Sitting back down on the floor he looks across at Bo and then picks up his torch using it to search the basement for the others The beam illuminates his brother sitting on the floor leaning against a pillar Morgan is sitting between Graham's legs his head pushed back into his father's chest Merrill's eyes widened in alarm Graham has one hand on Morgan's chest the other gripping his son's shoulder Bo stares at them wideeyed Graham rests his head against Morgan's Bo goes to sit on Merrill's lap tears welling in her eyes Morgan holds the knees of his father's jeans tightly as he struggles with his breathing Graham lifts his head slightly and stares angrily into the distance His lips quiver Merrill wheels Morgan on mouthing silent words of earnest prayer Morgan relaxes his grip on his father's jeans Morgan lies back his breathing returning to normal Merrill stares across at them blinking rapidly He swallows He turns his off Bo turns hers off In Graham's mind he reaches the scene of the accident Caroline talks to him"
        }
      ]
    }
  ]
}