{
  "ground_truth": "A path leads from the side of the circle, splitting into two prongs. A third crop circle has two straight lines at either side, and a circle of maize remaining in the center, with another path leading off from its side. It splits into three larger prongs, the central one of which points towards a smaller circle. Graham is on the phone as he looks out of his window at the yard. He bows his head. Graham steps into the kitchen, where one of the dogs lies on the floor near a puddle of liquid. Morgan and Bo lead the Alsatian into the backyard. Graham crosses the kitchen and pulls some paper towels off a roll, dabbing at the urine and saturating the towels. Then, he stands and walks back across the kitchen. A dark-haired woman in a police uniform leans casually in a doorway leading to the front hall, as Carolyn sighs wearily and gazes at Graham. In the yard, Morgan's at the smoking barbecue, where he sticks a fork in a chicken wing and turns it over. One of the Alsatians watches Morgan from the veranda while the other one, Houdini, lies slumped in the yard with Bo kneeling in front of him. Morgan walks across to Bo as she drinks from a large glass of water, kneels beside his sister, drinks from the tall glass, and then gives her the glass. Bo carefully pours the water into a metal dog bowl and slides it across the grass to Houdini. The Alsatian suddenly jerks his head up towards Bo, causing her to jump back in shock and Morgan to frown. Bo stands as Houdini stands up, causing Bo to freeze. The stalks all lie in the same direction, and Graham shakes his head. Carolyn looks across the field as Graham stares thoughtfully into space, rises, and slowly walks towards the edge of the circle. Carolyn stands and watches him with a slightly puzzled expression. Graham gazes across the field and then he and Carolyn emerge through the tall green crop, looking around anxiously. Graham spots something over to his left, strides briskly towards it with a concerned expression, and Carolyn follows him as they break into a jog. Houdini lies motionless on the ground near the climbing frame, with Morgan kneeling beside him and a barbecue fork sticking out of Houdini's throat. Morgan holds an asthma inhaler as he stares down at the dog, then looks up at his father through puffy red eyes. Bo sits up on a platform on the climbing frame, with her knees drawn tightly up to her chin, wearing blue sneakers and jeans under her pale flowery dress. Morgan looks back down and takes a puff of his inhaler while Graham stares at his son and crouches down beside Houdini.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here is the transformed text with each word replaced by an exact synonym:\n\nA trail directs from the edge of the circle, dividing into two tines. A third crop circle has two straight routes at either flank, and a circle of corn remaining in the middle, with another trail directing off from its flank. It divides into three larger tines, the central one of which aims towards a smaller circle. Graham is on the handset as he peers out of his pane at the yard. He inclines his head. Graham steps into the kitchen, where one of the canines lies on the ground near a pool of fluid. Morgan and Bo guide the German Shepherd into the backyard. Graham traverses the kitchen and pulls some paper towels off a coil, blotting at the urine and soaking the towels. Then, he stands and strides back across the kitchen. A dark-haired woman in a police attire leans nonchalantly in a doorway leading to the front hall, as Carolyn exhales tiredly and gazes at Graham. In the yard, Morgan's at the sizzling grill, where he jabs a fork in a chicken wing and turns it over. One of the German Shepherds observes Morgan from the porch while the other one, Houdini, lies slumped in the yard with Bo kneeling in front of him. Morgan strides across to Bo as she drinks from a large tumbler of water, kneels beside his sister, drinks from the tall tumbler, and then gives her the tumbler. Bo cautiously pours the water into a metal dog dish and pushes it across the lawn to Houdini. The German Shepherd suddenly jerks his head up towards Bo, causing her to leap back in shock and Morgan to scowl. Bo stands as Houdini rises, causing Bo to freeze. The stalks all lie in the same bearing, and Graham shakes his head. Carolyn gazes across the field as Graham stares pensively into space, rises, and gradually walks towards the margin of the circle. Carolyn stands and watches him with a slightly perplexed expression. Graham stares across the field and then he and Carolyn emerge through the tall green crop, glancing around anxiously. Graham notices something over to his left, strides briskly towards it with a concerned expression, and Carolyn follows him as they break into a jog. Houdini lies inert on the ground near the climbing frame, with Morgan kneeling beside him and a barbecue fork protruding out of Houdini's throat. Morgan grips an asthma inhaler as he stares down at the dog, then glances up at his father through swollen red eyes. Bo sits up on a platform on the climbing frame, with her knees drawn snugly up to her chin, wearing blue sneakers and jeans under her pale floral dress. Morgan glances back down and takes a puff of his inhaler while Graham stares at his son and crouches down beside Houdini."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A path is led from the side of the circle and is split into two prongs. Two straight lines on either side and a circle of maize remain in the center of a third crop circle, with another path that is led off from its side. Three larger prongs are split from it, and the central one is pointed towards a smaller circle. The phone is used by Graham as he looks out of his window at the yard. His head is bowed by him. The kitchen is entered by Graham, where the floor is occupied by one of the dogs lying near a puddle of liquid. The Alsatian is led by Morgan and Bo into the backyard. The kitchen is crossed by Graham, and some paper towels are pulled off a roll by him, dabbing them at the urine and saturating the towels. Then, the kitchen is walked back across by him. A doorway leading to the front hall is casually leaned in by a dark-haired woman in a police uniform, as a weary sigh is let out by Carolyn while she gazes at Graham. In the yard, Morgan is at the smoking barbecue, where a fork is stuck in a chicken wing and it is turned over by him. Morgan is watched by one of the Alsatians from the veranda while Houdini, the other one, is slumped in the yard with Bo kneeling in front of him. The walk is crossed by Morgan to Bo as she drinks from a large glass of water; he kneels beside his sister, drinks from the tall glass, and then the glass is given to her by him. The water is carefully poured by Bo into a metal dog bowl, and it is slid across the grass to Houdini. Bo is startled when Houdini suddenly jerks his head up at her, causing Morgan to frown. Bo stands as Houdini stands up, which causes her to freeze. All the stalks are lying in the same direction, and Graham shakes his head. Carolyn looks across the field as Graham, who stares thoughtfully into space, rises and slowly walks towards the edge of the circle. He is watched by Carolyn, who stands with a slightly puzzled expression. The field is gazed across by Graham, and then he and Carolyn emerge through the tall green crop, looking around anxiously. Something is spotted by Graham over to his left, and with a concerned expression, he strides briskly towards it, followed by Carolyn as they break into a jog. The ground near the climbing frame is occupied by Houdini, who lies motionless, with Morgan kneeling beside him and a barbecue fork sticking out of Houdini's throat. An asthma inhaler is held by Morgan as he stares down at the dog, then looks up at his father through puffy red eyes. Bo sits up on a platform on the climbing frame, with her knees drawn tightly up to her chin, wearing blue sneakers and jeans under her pale flowery dress. Down is looked by Morgan, and a puff of his inhaler is taken by him while his son is stared at by Graham, who crouches down beside Houdini."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A path extends from the circle and splits into two prongs. Another crop circle features two straight lines and a central maize circle with a path branching into three larger prongs, the center one leading to a smaller circle. Graham, on the phone, looks at his yard. In the kitchen, he finds a puddle near a dog and cleans it with paper towels. Morgan and Bo lead the dog outside. A dark-haired policewoman watches Graham. In the yard, Morgan tends to the barbecue, turns a chicken wing, and shares a drink with Bo. She pours water into a bowl for Houdini, who startles her by jerking up. The stalks lie aligned, and Graham ponders, then walks toward the circle's edge, with Carolyn observing. They move anxiously through the field until Graham sees something and hurries with Carolyn. They find Houdini motionless with a fork in his throat and Morgan kneeling with an inhaler, looking at Graham. Bo sits on the climbing frame, with knees to her chin, wearing blue sneakers and jeans under a dress. Morgan uses his inhaler as Graham crouches beside Houdini."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A path splits from the circle into two prongs, and a third crop circle has two straight lines with a maize circle in the center and another path leading from its side, splitting into three prongs towards a smaller circle. Graham, on the phone, gazes out his window, bows his head, then enters the kitchen where a dog lies near a puddle. Morgan and Bo lead the Alsatian outside. Graham cleans the urine with paper towels, then returns across the kitchen. A policewoman leans in the doorway, as Carolyn sighs and watches Graham. Outside, Morgan turns a chicken wing on the barbecue while the Alsatians watch. Houdini lies with Bo kneeling in front of him. Morgan joins Bo, shares water, then Bo pours it into a dog bowl for Houdini. The dog jerks his head, startling Bo and making Morgan frown. Bo stands as Houdini stands and the stalks lie in the same direction, causing Graham to shake his head. Carolyn watches Graham, puzzled, as he walks towards the field's edge. They emerge through the crop, looking around worriedly. Graham spots something and moves briskly toward it, with Carolyn jogging behind. They find Houdini motionless with a barbecue fork in his throat, Morgan kneeling with an inhaler, puffy eyes, and Bo on a climbing frame platform in blue sneakers and jeans. Graham stares at Morgan, crouching beside Houdini."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A well-trodden path meanders from the side of the circle, skillfully branching into two distinct prongs. In a nearby location, a third crop circle is marked by two steadfast straight lines on either side. Intriguingly, a circle of untouched maize stands prominently in the center, with an additional path branching out from its side. This path further diverges into three larger prongs, the central one of which distinctly directs attention towards a smaller circle. As these phenomena unfold, Graham finds himself on the phone, gazing thoughtfully out of his window at the scene in the yard. With a sense of weariness, he bows his head. Entering the kitchen, Graham sees one of the dogs sprawled comfortably on the floor, close to a small puddle of liquid. Meanwhile, Morgan and Bo guide the Alsatian into the expanse of the backyard. Graham strides across the kitchen, efficiently pulling some paper towels off the roll and using them to dab at the puddle of urine, saturating the absorbent towels in the process. After accomplishing this, he rises to his feet and walks back across the kitchen. In the doorway that connects to the front hall, a dark-haired woman clad in a police uniform leans casually, observing the scene with a laid-back demeanor. Carolyn, in the room, sighs with weariness while her eyes rest on Graham. Out in the yard, Morgan tends to the smoking barbecue, skillfully inserting a fork into a succulent chicken wing and turning it over with care. One of the Alsatians keeps a watchful eye on Morgan from the vantage point of the veranda, while the other Alsatian, affectionately named Houdini, lies in a slumped pose on the grass, with Bo kneeling attentively in front of him. Morgan approaches Bo, who sips from an oversized glass of water. He kneels beside his sister, takes a drink from the tall glass, and then hands it back to her. Bo, with delicate care, pours the water into a metallic dog bowl and slides it gently across the grass towards Houdini. Suddenly, the Alsatian jerks his head up towards Bo, causing her to jump back in surprise, and prompting Morgan to frown in response. Bo rises to her feet just as Houdini stands as well, and Bo freezes momentarily in response. Observing the circle once more, the stalks of the crops all lie uniformly in the same direction, prompting Graham to shake his head in bewilderment. Carolyn, observing from a distance, looks across the field with a gaze that follows Graham as he stares into the air thoughtfully, eventually rising to his feet and slowly moving towards the perimeter of the circle. Carolyn watches him with a slightly puzzled expression, filled with curiosity. As Graham gazes across the sprawling field, he and Carolyn emerge through the dense, tall green crop, casting anxious glances around. Graham's keen eyes spot something off to his left, and he briskly strides towards it with a focused and concerned expression. Carolyn follows closely behind as they both break into a light jog. They come upon Houdini, lying motionless on the ground near the climbing frame. Morgan is kneeling beside the dog, and a barbecue fork is tragically protruding from Houdini's throat. Morgan, clutching an asthma inhaler, looks down at the dog with a sorrowful expression before lifting his gaze with puffy red eyes to meet his father's. Meanwhile, Bo is perched on a platform of the climbing frame, her knees drawn up tightly to her chin. She is wearing blue sneakers and jeans under a delicate pale flowery dress. Morgan diverts his gaze back to Houdini, taking a puff from his inhaler while Graham stares intently at his son and crouches down beside the motionless Alsatian."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A frequently traversed, well-trodden path winds its way from the side of the circle, skillfully branching into two distinct prongs, creating a clear division in the landscape. Nearby, in a closely situated location, a third crop circle is distinctly marked by two steadfast, unwavering straight lines on either side. Intriguingly and prominently, a circle of untouched, unblemished maize stands in the center, with an additional path branching out gracefully from its side. This path further diverges, spreading into three larger prongs, the central one of which distinctly commands attention towards a smaller, distant circle. As these fascinating phenomena unfold outside, Graham finds himself engaged in a phone conversation, gazing thoughtfully out of his window at the unfolding scene in the yard below him. With a deep sense of weariness, he bows his head solemnly. Entering the cozy kitchen, Graham's eyes fall on one of the dogs sprawled comfortably, in a relaxed manner, on the floor, near a small puddle of liquid that has formed. Meanwhile, Morgan and Bo are seen guiding the Alsatian into the expansive, open space of the backyard. Graham strides confidently across the kitchen, efficiently pulling a few paper towels off the roll and using them to dab at the puddle of urine, saturating the absorbent towels in the process. After accomplishing this task, he rises to his feet and walks back across the kitchen. In the doorway that leads to the front hall, a dark-haired woman clad in a crisp police uniform leans casually, observing the scene with a laid-back demeanor. Carolyn, present in the room, sighs with a noticeable weariness while her eyes rest on Graham thoughtfully. Out in the yard, Morgan tends to the smoking barbecue, skillfully inserting a fork into a succulent, juicy chicken wing and turning it over with care and precision. One of the Alsatians keeps a watchful, vigilant eye on Morgan from the comfortable vantage point of the veranda, while the other Alsatian, affectionately named Houdini, lies in a slumped, relaxed pose on the grass, with Bo kneeling attentively in front of him. Morgan approaches Bo, who is slowly sipping from an oversized glass of water. He kneels beside his sister, takes a refreshing drink from the tall glass, and then hands it back to her. Bo, with delicate care and precision, pours the water into a shiny metallic dog bowl and slides it gently across the grass towards Houdini. Suddenly, the Alsatian jerks his head up towards Bo, causing her to jump back in surprise, and prompting Morgan to frown in response. Bo rises to her feet just as Houdini stands as well, and Bo freezes momentarily in response. Observing the circle once more, the stalks of the crops all lie uniformly in the same direction, prompting Graham to shake his head in bewilderment. Carolyn, observing from a distance, looks across the field with a gaze that follows Graham as he stares into the air thoughtfully, eventually rising to his feet and slowly moving towards the perimeter of the circle. Carolyn watches him with a slightly puzzled expression, filled with curiosity. As Graham gazes across the sprawling, expansive field, he and Carolyn emerge through the dense, tall green crop, casting anxious, searching glances around. Graham's keen, observant eyes spot something off to his left, and he briskly strides towards it with a focused and concerned expression. Carolyn follows closely behind as they both break into a light jog. They come upon Houdini, lying motionless on the ground near the climbing frame. Morgan is kneeling beside the dog, and a barbecue fork is tragically protruding from Houdini's throat. Morgan, clutching an asthma inhaler, looks down at the dog with a sorrowful expression before lifting his gaze with puffy, red eyes to meet his father's. Meanwhile, Bo is perched on a platform of the climbing frame, her knees drawn up tightly to her chin. She is wearing comfortable blue sneakers and jeans under a delicate, pale flowery dress. Morgan diverts his gaze back to Houdini, taking a deep puff from his inhaler while Graham stares intently at his son and crouches down beside the motionless Alsatian."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A path extends from the side of the circle, diverging into two distinct prongs. A third crop circle features two parallel lines on either side, enclosing a circle of maize in the center, with a path veering off from its edge. This path further splits into three larger prongs, with the central one directing towards a smaller circle. Inside the house, Graham is engaged in a phone conversation while his eyes wander out of the window, taking in the view of the yard; a sense of contemplation leads him to bow his head slightly. Transitioning from the window to the interior of his home, Graham steps into the kitchen where he notices one of the dogs lying on the floor beside a puddle of liquid. Meanwhile, Morgan and Bo guide the Alsatian dog into the backyard. Graham, taking swift action, crosses the kitchen, reaches for a roll of paper towels hanging nearby, and carefully tears off a few sheets. He bends down to dab at the urine, allowing the towels to absorb the liquid, before straightening up to walk back across the kitchen. A dark-haired woman, donned in a police uniform, leans nonchalantly in the doorway that leads to the front hall, while Carolyn exhales a weary sigh, casting a gaze at Graham laden with fatigue. Out in the yard, Morgan tends to the smoking barbecue, skillfully sticking a fork into a chicken wing and flipping it over. An Alsatian observes Morgan from the veranda, as the other dog, Houdini, lies slumped on the yard's grass with Bo knelt before him. Shifting his focus from the grill, Morgan traverses to Bo, who is sipping from a large glass of water. He kneels beside her, takes a gulp from the tall glass, and then hands it back to his sister. Bo, with careful movements, pours the water into a metal dog bowl, nudging it across the grass towards Houdini. In a sudden burst of energy, the Alsatian jerks his head up towards Bo, prompting her to jump back in fright, causing Morgan to frown with concern. As Bo regains her composure, she stands while Houdini rises too, prompting her to freeze in place. Outside in the field, the crop stalks lie uniformly in one direction, prompting Graham to shake his head in disbelief. Carolyn shifts her gaze across the field as Graham, lost in a thoughtful trance, stands up and meanders towards the circle's edge. Carolyn, with a slightly puzzled look, stands to watch him. As they emerge through the tall green crop, both Graham and Carolyn cast anxious glances around. Graham spots something to his left, his eyes narrowing with concern as he strides purposefully towards it, quickly transitioning into a jog, with Carolyn following suit. As they approach, they find Houdini lying motionless on the ground near the climbing frame. Morgan is kneeling beside the dog, a barbecue fork protruding from Houdini's throat. Clutching an asthma inhaler, Morgan stares down at the dog in front of him, his eyes swollen and red with emotion, before lifting his gaze to meet his father's eyes. Meanwhile, Bo is seated up on a platform on the climbing frame, her knees tightly drawn to her chin, clad in blue sneakers and jeans beneath her pale, flowery dress. Morgan lowers his gaze once more and takes a puff of his inhaler. Graham, deeply affected, focuses his attention on his son, before crouching down beside the still form of Houdini."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A path from the circle splits into two prongs, with a third crop circle featuring straight lines on either side and a central circle of maize. Another path leads off, splitting into three larger prongs, with the central one pointing towards a smaller circle. Graham, on the phone, looks out his window at the yard, bows his head, and then enters the kitchen to find one of the dogs near a puddle. Morgan and Bo guide the Alsatian into the backyard, while Graham cleans the urine with paper towels before encountering a woman in a police uniform. In the yard, Morgan tends to a smoking barbecue, turning a chicken wing as the Alsatians observe. Bo and Morgan share a drink before Bo pours the water into a dog bowl for Houdini, who suddenly jerks his head, startling Bo. The family stands frozen as Houdini rises. The stalks in the field all lie in the same direction, prompting Graham to shake his head. Carolyn joins Graham as he contemplates the field and approaches the circle's edge. They emerge through the tall crop, anxiously observing the surroundings. Spotting something, Graham strides towards it with concern, and Carolyn follows as they jog. They find Houdini motionless near the climbing frame, with a barbecue fork in his throat. Morgan kneels beside him, holding an asthma inhaler, and looks tearfully at his father. Bo sits on the climbing frame, knees drawn to her chin, observing the scene. Graham crouches by Houdini, taking in the distressing sight."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A path leads from the side of the crop circle, an enigmatic phenomenon often attributed to natural causes or human activity, splitting into two prongs. A third crop circle, which has intrigued researchers for its geometric precision, has two straight lines at either side, and a circle of maize remaining in the center, typical of patterns found in fields worldwide, with another path leading off from its side. It splits into three larger prongs, the central one of which points towards a smaller circle, reminiscent of formations studied in Wiltshire, England. Graham, who recently moved to this rural area known for its vast cornfields, is on the phone as he looks out of his window at the yard. He bows his head, reflecting on the day's unusual events. Graham steps into the kitchen, where one of the dogs, a reliable Alsatian, lies on the floor near a puddle of liquid. Morgan and Bo, who help care for the family pets, lead the Alsatian into the backyard. Graham crosses the kitchen and pulls some paper towels off a roll, dabbing at the urine and saturating the towels, a routine cleanup in a household with pets. Then, he stands and walks back across the kitchen. A dark-haired woman in a police uniform, Officer Carolyn known for her diligence in the small-town police force, leans casually in a doorway leading to the front hall, as Carolyn sighs wearily and gazes at Graham. In the yard, Morgan's at the smoking barbecue, a common activity for the family during weekend gatherings, where he sticks a fork in a chicken wing and turns it over. One of the Alsatians watches Morgan from the veranda while the other one, Houdini, named for his knack for escaping confinement, lies slumped in the yard with Bo kneeling in front of him. Morgan walks across to Bo as she drinks from a large glass of water, kneels beside his sister, drinks from the tall glass, and then gives her the glass. Bo carefully pours the water into a metal dog bowl and slides it across the grass to Houdini, hoping it will revive him. The Alsatian suddenly jerks his head up towards Bo, causing her to jump back in shock and Morgan to frown. Bo stands as Houdini stands up, causing Bo to freeze in disbelief. The stalks all lie in the same direction, a characteristic often used to determine the authenticity of crop circles, and Graham shakes his head. Carolyn looks across the field as Graham stares thoughtfully into space, rises, and slowly walks towards the edge of the circle. Carolyn stands and watches him with a slightly puzzled expression. Graham gazes across the field and then he and Carolyn emerge through the tall green crop, looking around anxiously, aware of the strange occurrences happening around them. Graham spots something over to his left, strides briskly towards it with a concerned expression, and Carolyn follows him as they break into a jog. Houdini lies motionless on the ground near the climbing frame, a wooden structure the children often play on, with Morgan kneeling beside him and a barbecue fork sticking out of Houdini's throat, a shocking and tragic scene. Morgan holds an asthma inhaler, a vital tool for his health, as he stares down at the dog, then looks up at his father through puffy red eyes. Bo sits up on a platform on the climbing frame, with her knees drawn tightly up to her chin, wearing blue sneakers and jeans under her pale flowery dress, a stark contrast to the grim scene below. Morgan looks back down and takes a puff of his inhaler while Graham stares at his son and crouches down beside Houdini, trying to comprehend the day's events."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A path leads from the side of the circle splitting into two prongs. A third crop circle has two straight lines at either side and a circle of maize remaining in the center with another path leading off from its side. It splits into three larger prongs the central one of which points towards a smaller circle. Graham is on the phone as he looks out of his window at the yard. He bows his head. Graham steps into the kitchen where one of the dogs lies on the floor near a puddle of liquid. Morgan and Bo lead the Alsatian into the backyard. Graham crosses the kitchen and pulls some paper towels off a roll dabbing at the urine and saturating the towels. Then he stands and walks back across the kitchen. A darkhaired woman in a police uniform leans casually in a doorway leading to the front hall as Carolyn sighs wearily and gazes at Graham. In the yard Morgan's at the smoking barbecue where he sticks a fork in a chicken wing and turns it over. One of the Alsatians watches Morgan from the veranda while the other one Houdini lies slumped in the yard with Bo kneeling in front of him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Morgan walks across to Bo as she drinks from a large glass of water kneels beside his sister drinks from the tall glass and then gives her the glass. Bo carefully pours the water into a metal dog bowl and slides it across the grass to Houdini. The Alsatian suddenly jerks his head up towards Bo causing her to jump back in shock and Morgan to frown. Bo stands as Houdini stands up causing Bo to freeze. The stalks all lie in the same direction and Graham shakes his head. Carolyn looks across the field as Graham stares thoughtfully into space rises and slowly walks towards the edge of the circle. Carolyn stands and watches him with a slightly puzzled expression. Graham gazes across the field and then he and Carolyn emerge through the tall green crop looking around anxiously. Graham spots something over to his left strides briskly towards it with a concerned expression and Carolyn follows him as they break into a jog. Houdini lies motionless on the ground near the climbing frame with Morgan kneeling beside him and a barbecue fork sticking out of Houdini's throat. Morgan holds an asthma inhaler as he stares down at the dog then looks up at his father through puffy red eyes. Bo sits up on a platform on the climbing frame with her knees drawn tightly up to her chin wearing blue sneakers and jeans under her pale flowery dress. Morgan looks back down and takes a puff of his inhaler while Graham stares at his son and crouches down beside Houdini."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A path leads from the side of the circle splitting into two prongs. A third crop circle has two straight lines at either side and a circle of maize remaining in the center with another path leading off from its side. It splits into three larger prongs the central one of which points towards a smaller circle. Graham is on the phone as he looks out of his window at the yard. He bows his head. Graham steps into the kitchen where one of the dogs lies on the floor near a puddle of liquid. Morgan and Bo lead the Alsatian into the backyard. Graham crosses the kitchen and pulls some paper towels off a roll dabbing at the urine and saturating the towels. Then he stands and walks back across the kitchen. A darkhaired woman in a police uniform leans casually in a doorway leading to the front hall as Carolyn sighs wearily and gazes at Graham. In the yard Morgan's at the smoking barbecue where he sticks a fork in a chicken wing and turns it over. One of the Alsatians watches Morgan from the veranda while the other one Houdini lies slumped in the yard with Bo kneeling in front of him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Morgan walks across to Bo as she drinks from a large glass of water kneels beside his sister drinks from the tall glass and then gives her the glass. Bo carefully pours the water into a metal dog bowl and slides it across the grass to Houdini. The Alsatian suddenly jerks his head up towards Bo causing her to jump back in shock and Morgan to frown. Bo stands as Houdini stands up causing Bo to freeze. The stalks all lie in the same direction and Graham shakes his head. Carolyn looks across the field as Graham stares thoughtfully into space rises and slowly walks towards the edge of the circle. Carolyn stands and watches him with a slightly puzzled expression. Graham gazes across the field and then he and Carolyn emerge through the tall green crop looking around anxiously. Graham spots something over to his left strides briskly towards it with a concerned expression and Carolyn follows him as they break into a jog. Houdini lies motionless on the ground near the climbing frame with Morgan kneeling beside him and a barbecue fork sticking out of Houdini's throat. Morgan holds an asthma inhaler as he stares down at the dog then looks up at his father through puffy red eyes. Bo sits up on a platform on the climbing frame with her knees drawn tightly up to her chin wearing blue sneakers and jeans under her pale flowery dress. Morgan looks back down and takes a puff of his inhaler while Graham stares at his son and crouches down beside Houdini."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A path leads from the side of the circle splitting into two prongs. A third crop circle has two straight lines at either side and a circle of maize remaining in the center with another path leading off from its side. It splits into three larger prongs the central one of which points towards a smaller circle. Graham is on the phone as he looks out of his window at the yard. He bows his head. Graham steps into the kitchen where one of the dogs lies on the floor near a puddle of liquid. Carolyn stands and watches him with a slightly puzzled expression. Graham gazes across the field and then he and Carolyn emerge through the tall green crop looking around anxiously. Graham spots something over to his left strides briskly towards it with a concerned expression and Carolyn follows him as they break into a jog. Houdini lies motionless on the ground near the climbing frame with Morgan kneeling beside him and a barbecue fork sticking out of Houdini's throat. Morgan holds an asthma inhaler as he stares down at the dog then looks up at his father through puffy red eyes. Bo sits up on a platform on the climbing frame with her knees drawn tightly up to her chin wearing blue sneakers and jeans under her pale flowery dress. Morgan looks back down and takes a puff of his inhaler while Graham stares at his son and crouches down beside Houdini."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A path leads from the side of the circle splitting into two prongs. A third crop circle has two straight lines at either side and a circle of maize remaining in the center with another path leading off from its side. Morgan holds an asthma inhaler as he stares down at the dog then looks up at his father through puffy red eyes. Bo sits up on a platform on the climbing frame with her knees drawn tightly up to her chin wearing blue sneakers and jeans under her pale flowery dress. Morgan looks back down and takes a puff of his inhaler while Graham stares at his son and crouches down beside Houdini."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A track winds away from the trunk of the square, branching into two tendrils. A fifth stone plaza has two curvy hedges at either side, and a ring of corn remaining in the middle, with another track winding off from its edge. It branches into three wider tendrils, the central one of which gestures towards a tinier square. Eliza is on the bicycle as she peers out of her doorway at the garage. She lifts her chin. Eliza marches into the dining room, where one of the cats lounges on the couch near a puddle of paint. Jake and Pat guide the poodle into the alley. Eliza strides across the dining room and tears some napkins off a dispenser, blotting at the paint and soaking the napkins. Next, she rises and hops back across the dining room. A blonde gentleman in a firefighting outfit leans comfortably in a passageway leading to the main corridor, as Walter groans softly and glances at Eliza. In the garden, Jake's at the sizzling grill, where he jabs a spade in a hot dog and flips it over. One of the poodles observes Jake from the terrace while the other one, Houdini, lounges sprawled in the garden with Pat crouching beside him. Jake skips over to Pat as she sips from a small jug of lemonade, crouches next to his sibling, sips from the short jug, and then hands her the jug. Pat delicately empties the lemonade into a crystal cat dish and nudges it across the dirt to Houdini. The poodle abruptly snaps his muzzle up towards Pat, prompting her to leap back in surprise and Jake to grimace. Pat rises as Houdini jumps up, prompting Pat to recoil. The reeds all recline in the same position, and Eliza nods her chin. Walter peers across the meadow as Eliza glares thoughtfully into the void, gets up, and swiftly rushes towards the middle of the square. Walter gets up and views her with a mildly bewildered expression. Eliza peers across the meadow and then she and Walter surface through the towering yellow grass, glancing around nervously. Eliza glimpses something over to her right, treads briskly towards it with a concerned demeanor, and Walter follows her as they burst into a sprint. Houdini reclines inert on the earth near the ladder, with Jake crouching beside him and a grill skewer embedded in Houdini's neck. Jake clutches a stress ball as he gazes down at the feline, then gazes up at his parent through teary blue eyes. Pat perches up on a stool on the ladder, with her elbows drawn snugly to her feet, wearing red boots and shorts under her dark floral blouse. Jake gazes back down and takes a squeeze of his stress ball while Eliza gazes at her child and kneels down beside Houdini."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A path branches into two prongs, with a third crop circle featuring straight lines and a central circle of maize. Graham, on the phone, glances out the window at the yard and then steps into the kitchen, cleaning up after a dog. Carolyn, a police officer, watches him. Outside, Morgan cooks at the barbecue while Bo and Houdini, the Alsatian, interact. Bo gets startled by Houdini, who suddenly stands up. Graham examines the crop formations, deep in thought, then jogs with Carolyn toward Houdini, who lies motionless with a barbecue fork in his throat. Morgan, beside the dog, uses his asthma inhaler, looking distressed. Bo sits on a climbing frame, drawn into herself, while Graham crouches beside the dog, concerned."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Morgan looks back down and takes a puff of his inhaler while Graham stares at his son and crouches down beside Houdini Bo sits up on a platform on the climbing frame with her knees drawn tightly up to her chin wearing blue sneakers and jeans under her pale flowery dress Morgan holds an asthma inhaler as he stares down at the dog then looks up at his father through puffy red eyes Houdini lies motionless on the ground near the climbing frame with Morgan kneeling beside him and a barbecue fork sticking out of Houdini's throat Graham spots something over to his left strides briskly towards it with a concerned expression and Carolyn follows him as they break into a jog Graham gazes across the field and then he and Carolyn emerge through the tall green crop looking around anxiously Carolyn stands and watches him with a slightly puzzled expression Carolyn looks across the field as Graham stares thoughtfully into space rises and slowly walks towards the edge of the circle The stalks all lie in the same direction and Graham shakes his head Bo stands as Houdini stands up causing Bo to freeze The Alsatian suddenly jerks his head up towards Bo causing her to jump back in shock and Morgan to frown Bo carefully pours the water into a metal dog bowl and slides it across the grass to Houdini Morgan walks across to Bo as she drinks from a large glass of water kneels beside his sister drinks from the tall glass and then gives her the glass One of the Alsatians watches Morgan from the veranda while the other one Houdini lies slumped in the yard with Bo kneeling in front of him In the yard Morgan's at the smoking barbecue where he sticks a fork in a chicken wing and turns it over A darkhaired woman in a police uniform leans casually in a doorway leading to the front hall as Carolyn sighs wearily and gazes at Graham Then he stands and walks back across the kitchen Graham crosses the kitchen and pulls some paper towels off a roll dabbing at the urine and saturating the towels Morgan and Bo lead the Alsatian into the backyard Graham steps into the kitchen where one of the dogs lies on the floor near a puddle of liquid He bows his head Graham is on the phone as he looks out of his window at the yard It splits into three larger prongs the central one of which points towards a smaller circle A third crop circle has two straight lines at either side and a circle of maize remaining in the center with another path leading off from its side A path leads from the side of the circle splitting into two prongs"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "A third crop circle has two straight lines at either side and a circle of maize remaining in the center with another path leading off from its side A path leads from the side of the circle splitting into two prongs Graham is on the phone as he looks out of his window at the yard It splits into three larger prongs the central one of which points towards a smaller circle Graham steps into the kitchen where one of the dogs lies on the floor near a puddle of liquid He bows his head Graham crosses the kitchen and pulls some paper towels off a roll dabbing at the urine and saturating the towels Morgan and Bo lead the Alsatian into the backyard A darkhaired woman in a police uniform leans casually in a doorway leading to the front hall as Carolyn sighs wearily and gazes at Graham Then he stands and walks back across the kitchen One of the Alsatians watches Morgan from the veranda while the other one Houdini lies slumped in the yard with Bo kneeling in front of him In the yard Morgan's at the smoking barbecue where he sticks a fork in a chicken wing and turns it over Bo carefully pours the water into a metal dog bowl and slides it across the grass to Houdini Morgan walks across to Bo as she drinks from a large glass of water kneels beside his sister drinks from the tall glass and then gives her the glass Bo stands as Houdini stands up causing Bo to freeze The Alsatian suddenly jerks his head up towards Bo causing her to jump back in shock and Morgan to frown Carolyn looks across the field as Graham stares thoughtfully into space rises and slowly walks towards the edge of the circle The stalks all lie in the same direction and Graham shakes his head Graham gazes across the field and then he and Carolyn emerge through the tall green crop looking around anxiously Carolyn stands and watches him with a slightly puzzled expression Houdini lies motionless on the ground near the climbing frame with Morgan kneeling beside him and a barbecue fork sticking out of Houdini's throat Graham spots something over to his left strides briskly towards it with a concerned expression and Carolyn follows him as they break into a jog Bo sits up on a platform on the climbing frame with her knees drawn tightly up to her chin wearing blue sneakers and jeans under her pale flowery dress Morgan holds an asthma inhaler as he stares down at the dog then looks up at his father through puffy red eyes Morgan looks back down and takes a puff of his inhaler while Graham stares at his son and crouches down beside Houdini"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Bo carefully pours the water into a metal dog bowl and slides it across the grass to Houdini The Alsatian suddenly jerks his head up towards Bo causing her to jump back in shock and Morgan to frown Bo stands as Houdini stands up causing Bo to freeze The stalks all lie in the same direction and Graham shakes his head Carolyn looks across the field as Graham stares thoughtfully into space rises and slowly walks towards the edge of the circle Carolyn stands and watches him with a slightly puzzled expression Graham gazes across the field and then he and Carolyn emerge through the tall green crop looking around anxiously Graham spots something over to his left strides briskly towards it with a concerned expression and Carolyn follows him as they break into a jog Houdini lies motionless on the ground near the climbing frame with Morgan kneeling beside him and a barbecue fork sticking out of Houdini's throat Morgan holds an asthma inhaler as he stares down at the dog then looks up at his father through puffy red eyes Bo sits up on a platform on the climbing frame with her knees drawn tightly up to her chin wearing blue sneakers and jeans under her pale flowery dress Morgan looks back down and takes a puff of his inhaler while Graham stares at his son and crouches down beside Houdini A path leads from the side of the circle splitting into two prongs A third crop circle has two straight lines at either side and a circle of maize remaining in the center with another path leading off from its side It splits into three larger prongs the central one of which points towards a smaller circle Graham is on the phone as he looks out of his window at the yard He bows his head Graham steps into the kitchen where one of the dogs lies on the floor near a puddle of liquid Morgan and Bo lead the Alsatian into the backyard Graham crosses the kitchen and pulls some paper towels off a roll dabbing at the urine and saturating the towels Then he stands and walks back across the kitchen A darkhaired woman in a police uniform leans casually in a doorway leading to the front hall as Carolyn sighs wearily and gazes at Graham In the yard Morgan's at the smoking barbecue where he sticks a fork in a chicken wing and turns it over One of the Alsatians watches Morgan from the veranda while the other one Houdini lies slumped in the yard with Bo kneeling in front of him Morgan walks across to Bo as she drinks from a large glass of water kneels beside his sister drinks from the tall glass and then gives her the glass"
        }
      ]
    }
  ]
}