{
  "ground_truth": "Morgan takes Graham's hand and steps over Houdini, and they gaze down at the dead dog; Graham puts his hand on Morgan's shoulder, but Morgan brushes it away and trudges off solemnly. Graham steps up to the climbing frame and looks searchingly at Bo, who remains in a tight ball, staring down at the ground; he gently lifts her off the platform and holds her against his shoulder, carrying Bo back to the farmhouse as Merrill emerges, carrying a bowl and a bag of feed. Graham walks past him, climbs onto the veranda, and walks through the front door of the house. Merrill looks over to the climbing frame with a confused expression; he's in his early 30s with short dark hair and a boyish face. Merrill puts down the bag of feed and unties Isabel, the other Alsatian, from the veranda steps, leading her across the yard as Caroline pulls the barbecue fork from Houdini's throat. A wire wind chime in the shape of a beaming sun hangs on the veranda and swings mournfully in the soft breeze. That night, the farmhouse stands in darkness beneath a black sky. Graham lies on his side in bed, his eyes suddenly open as he stares ahead; Bo gazes at him. Graham pads across the landing to the children's bedroom, holding Bo by the hand, as they come to the open bedroom door and step into the darkened room, where Morgan lies half off his bed in an uncomfortable looking heap. Bo shuffles off to her bed, and Graham gently lifts Morgan up and lies him on his back, then walks across the bedroom and sits beside Bo on her bed. He gazes at her and looks her up and down; Bo looks at him through wide bright eyes, and a sadness falls across Graham's face as he looks at his daughter, then glances over at the bedroom window. A shadowy figure stands by a chimney pot on the barn roof, and Graham jumps to his feet. Downstairs in the lounge, Merrill is asleep in an armchair when Graham touches his shoulder, waking Merrill, who looks up at his brother in confusion. Graham and Merrill are by the front door, and Merrill opens the door; an outside light comes on, and they rush out and split up. Merrill comes to the back of the house as a dust bin is tipped over up ahead, while Graham runs along the side of the house, and the brothers meet up again at the front of the house. They stop and look around breathlessly when a sound on the roof of the house attracts their attention; Merrill keeps his gaze fixed firmly on the farmhouse roof as he paces backwards down the gloomy yard, trying to get a better view.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Morgan grasps Graham's palm and strides over Houdini, and they stare down at the lifeless canine; Graham places his palm on Morgan's shoulder, but Morgan brushes it away and trudges off mournfully. Graham advances to the climbing structure and looks intently at Bo, who remains in a tight sphere, staring down at the earth; he tenderly lifts her off the platform and holds her against his shoulder, carrying Bo back to the farmhouse as Merrill appears, carrying a bowl and a bag of fodder. Graham walks past him, ascends onto the veranda, and walks through the front door of the house. Merrill glances over to the climbing structure with a puzzled expression; he's in his early 30s with short dark hair and a youthful face. Merrill places down the bag of fodder and unties Isabel, the other Alsatian, from the veranda steps, leading her across the yard as Caroline pulls the barbecue fork from Houdini's throat. A wire wind chime in the figure of a beaming sun hangs on the veranda and swings mournfully in the gentle breeze. That night, the farmhouse stands in shadow beneath a black sky. Graham lies on his side in bed, his eyes suddenly open as he stares ahead; Bo gazes at him. Graham pads across the landing to the children's bedroom, holding Bo by the hand, as they arrive at the open bedroom door and step into the dim room, where Morgan lies half off his bed in an uncomfortable looking heap. Bo shuffles off to her bed, and Graham gently lifts Morgan up and lies him on his back, then walks across the bedroom and sits beside Bo on her bed. He gazes at her and looks her up and down; Bo looks at him through wide bright eyes, and a sorrow falls across Graham's face as he looks at his daughter, then glances over at the bedroom window. A shadowy figure stands by a chimney pot on the barn roof, and Graham leaps to his feet. Downstairs in the lounge, Merrill is asleep in an armchair when Graham touches his shoulder, waking Merrill, who looks up at his sibling in bewilderment. Graham and Merrill are by the front door, and Merrill opens the door; an outside light comes on, and they rush out and separate. Merrill comes to the rear of the house as a dust bin is tipped over up ahead, while Graham runs along the side of the house, and the brothers meet up again at the front of the house. They halt and look around breathlessly when a noise on the roof of the house draws their attention; Merrill keeps his gaze fixed firmly on the farmhouse roof as he paces backwards down the gloomy yard, trying to get a better view."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Graham's hand is taken by Morgan, who steps over Houdini, and the dead dog is gazed down at by them; Morgan's shoulder is touched by Graham's hand, but it is brushed away by Morgan, who trudges off solemnly. The climbing frame is approached by Graham, who looks searchingly at Bo, who remains in a tight ball, staring down at the ground; Bo is gently lifted off the platform by him and held against his shoulder, carrying Bo back to the farmhouse as Merrill emerges, carrying a bowl and a bag of feed. Merrill is walked past by Graham, who climbs onto the veranda and walks through the front door of the house. The climbing frame is looked over to by Merrill with a confused expression; he's in his early 30s with short dark hair and a boyish face. The bag of feed is put down by Merrill, who unties Isabel, the other Alsatian, from the veranda steps and leads her across the yard as Caroline pulls the barbecue fork from Houdini's throat. On the veranda, a wire wind chime in the shape of a beaming sun hangs and swings mournfully in the soft breeze. That night, the farmhouse is stood in darkness beneath a black sky. Graham lies on his side in bed, his eyes suddenly open as he stares ahead; Bo gazes at him. The landing is padded across by Graham to the children's bedroom, holding Bo by the hand, as they come to the open bedroom door and step into the darkened room, where Morgan lies half off his bed in an uncomfortable-looking heap. Bo shuffles off to her bed, and Morgan is gently lifted up by Graham and lied on his back, then Graham walks across the bedroom and sits beside Bo on her bed. She is gazed at by him, and she is looked up and down; Bo looks at him through wide bright eyes, and a sadness falls across Graham's face as he looks at his daughter, then his glance is directed over at the bedroom window. A shadowy figure stands by a chimney pot on the barn roof, and Graham jumps to his feet. Downstairs in the lounge, Merrill is asleep in an armchair when his shoulder is touched by Graham, waking Merrill, who looks up at his brother in confusion. Graham and Merrill are by the front door, and the door is opened by Merrill; an outside light comes on, and they rush out and split up. Merrill comes to the back of the house as a dust bin is tipped over up ahead, while Merrill runs along the side of the house, and the brothers meet up again at the front of the house. They stop and look around breathlessly when their attention is attracted by a sound on the roof of the house; the farmhouse roof is kept under the firm gaze of Merrill as he paces backward down the gloomy yard, trying to get a better view."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Morgan takes Graham's hand and steps over Houdini, gazing down at the deceased dog. Graham places a hand on Morgan's shoulder, but Morgan brushes it off and walks away solemnly. Graham approaches the climbing frame, looks at Bo curled into a tight ball, and gently lifts her, carrying her back to the farmhouse. Merrill, in his early 30s with short dark hair, emerges carrying a bowl and feed bag. Graham enters the house as Merrill unties Isabel, the other Alsatian, from the veranda, leading her across the yard while Caroline removes the barbecue fork from Houdini's throat. A sun-shaped wind chime swings in the breeze. That night, the farmhouse is dark under a black sky. Graham awakens, staring ahead, Bo watching him. He leads Bo to the children’s dark room, where Morgan lies awkwardly half off his bed. Bo goes to her bed, and Graham gently settles Morgan before sitting beside Bo, sadness crossing his face as he looks at her. He then notices a shadowy figure by the chimney on the barn roof, startling him. Downstairs, Graham wakes Merrill from an armchair, and they head to the front door. An outside light turns on, and they rush out, splitting up. Merrill reaches the house's back as a dust bin tips over, while Graham runs alongside the house. The brothers regroup at the front, looking around when a noise on the roof grabs their attention. Merrill fixes his gaze on the roof, backing down the yard to get a clearer view."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Morgan takes Graham's hand, steps over Houdini, and they gaze at the dead dog. Graham places a hand on Morgan's shoulder, but Morgan dismisses it and trudges off. Graham lifts Bo from the climbing frame and carries her to the farmhouse as Merrill, in his early 30s with short hair, emerges with feed. Graham passes him, enters the house, and Merrill unties Isabel, the Alsatian. Caroline removes the fork from Houdini's throat as a sun-shaped wind chime sways in the breeze. That night, the farmhouse is dark. Graham, awake in bed, joins Bo in the children's room, where Morgan lies uncomfortably. He settles Morgan and sits by Bo, then notices a figure on the barn roof. Startled, he wakes Merrill, asleep downstairs. They rush outside, separate, and regroup at the front. A noise on the roof draws their attention, and Merrill steps back, watching the roof closely."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Morgan gently clasps Graham's hand, carefully stepping over Houdini, and together they gaze solemnly down at the lifeless dog. In a gesture of comfort, Graham places his hand on Morgan's shoulder, but Morgan, burdened by emotion, brushes it away and trudges off with a heavy heart. Graham then approaches the climbing frame and looks searchingly at Bo, who remains curled up tightly in a small ball, her eyes fixed intently on the ground. He gently lifts her off the platform and cradles her against his shoulder, carrying a weary Bo back to the farmhouse just as Merrill emerges, holding a bowl and a bag of feed in his hands. Graham walks past him, ascending the steps onto the veranda and then through the welcoming front door of the house. Merrill glances over at the climbing frame with a bewildered expression; he is in his early 30s, with short dark hair and a youthful, boyish face. Placing down the bag of feed, Merrill unties Isabel, the other Alsatian, from the veranda steps and leads her across the yard while Caroline pulls the barbecue fork from Houdini's throat. A wire wind chime, artfully crafted in the form of a beaming sun, hangs from the veranda and swings mournfully in the gentle breeze. That night, the farmhouse is enveloped in darkness beneath a vast, black sky. Graham lies on his side in bed, his eyes suddenly snapping open as he stares ahead; nearby, Bo gazes intently at him. Graham quietly pads across the landing to the children's bedroom, holding Bo's hand, as they reach the open bedroom door and step into the dimly lit room, where Morgan lies awkwardly half off his bed in an uncomfortable heap. Bo shuffles off to her own bed, and Graham tenderly lifts Morgan up, settling him on his back before walking across the bedroom to sit beside Bo on her bed. He gazes at her, taking in her wide, bright eyes, and a somber sadness descends upon Graham's face as he looks at his daughter, then casts a glance over at the bedroom window. His eyes catch a shadowy figure standing ominously by a chimney pot on the barn roof, causing Graham to leap to his feet. Downstairs in the lounge, Merrill is dozing in an armchair when Graham's touch on his shoulder wakes him, prompting Merrill to look up at his brother in confusion. Together, Graham and Merrill stand by the front door, and as Merrill opens it, an outside light flickers on, prompting them to rush out and separate. Merrill moves to the rear of the house just as a dustbin is toppled over up ahead, while Graham dashes along the house's side, and the two brothers converge again at the front. Panting breathlessly, they halt and survey their surroundings when a noise from the roof of the house captures their attention; Merrill keeps his gaze fixed unwaveringly on the farmhouse roof, pacing backwards through the dimly lit yard in an attempt to gain a clearer view."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Morgan tenderly clasps Graham's hand, taking great care as she steps over the lifeless form of Houdini. Together, they gazed down with solemnity at the motionless dog laying there. Seeking to offer some comfort, Graham gently places his hand upon Morgan's shoulder, yet Morgan, heavy with emotion and burdened by her feelings, brushes it aside and slowly trudges away, her heart weighed down with sorrow. Graham then approaches the climbing frame and directs a searching look at Bo, who remains snugly curled up in a very small, tight ball, her gaze fixed intently on the ground beneath her. He gently lifts her from the platform, cradling her tenderly against his shoulder, and carries a weary Bo back toward the farmhouse, arriving just as Merrill emerges, holding a bowl in one hand and a bag of animal feed in the other. Graham proceeds past him, making his way up the steps and onto the wide, welcoming veranda, before stepping through the front door of the house. Merrill turns his head to glance over at the climbing frame with a look of bewilderment; a man in his early 30s, he has short dark hair and possesses a youthful, boyish face. After placing the bag of feed down, Merrill unties Isabel, the other Alsatian, from where she is secured to the veranda steps and leads her across the yard. Meanwhile, Caroline retrieves the barbecue fork, pulling it from Houdini's throat. A wire wind chime, crafted with artistic flair in the shape of a beaming sun, gracefully swings and sways mournfully in the gentle breeze. That evening, the farmhouse is enveloped in profound darkness beneath a vast, unending, black sky. Graham lies on his side in bed, his eyes suddenly snapping open to stare ahead intently; nearby, Bo stares at him with an intense gaze. Graham quietly pads across the landing, holding Bo's hand gently, as they together reach the open bedroom door and step into the dimly lit room. There, Morgan lies awkwardly half off his bed in a disheveled, uncomfortable heap. Bo shuffles off to her own bed, and Graham tenderly lifts Morgan, settling him comfortably on his back before crossing the bedroom to sit beside Bo on her bed. He gazes intently at her, taking in the sight of her wide, bright eyes, and a somber sadness descends upon Graham's face. As he looks at his daughter, he then casts a glance over toward the bedroom window. His eyes catch a glimpse of a shadowy figure standing ominously by a chimney pot on the barn roof, a sight that causes Graham to leap to his feet with urgency. Downstairs in the lounge, Merrill is dozing lightly in an armchair when Graham's touch on his shoulder rouses him, prompting Merrill to look up at his brother with puzzled confusion. Together, Graham and Merrill stand by the front door, and as Merrill opens it, an outside light flickers on, prompting the brothers to rush out and separate swiftly. Merrill moves toward the rear of the house just as a dustbin is knocked over up ahead, while Graham dashes along the side of the house. The two brothers then converge again at the front, panting breathlessly as they halt to survey their surroundings intently. Their attention is captured by a sudden noise from the roof of the house; Merrill keeps his gaze unwaveringly fixed on the farmhouse roof, pacing backwards through the dimly lit yard in an attempt to gain a clearer view of whatever might be there."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Morgan carefully takes Graham's hand and steps over Houdini, their eyes fixing mournfully on the lifeless dog lying before them. In an attempt to comfort him, Graham gently places his hand on Morgan's shoulder, but Morgan, overwhelmed and resolute, brushes the comforting gesture aside and solemnly trudges away, each step heavy with sadness. Meanwhile, Graham approaches the climbing frame with a searching look, his eyes landing on Bo, who remains curled into a tight ball, her gaze locked onto the ground below her. With a tender and careful movement, he gently lifts Bo off the platform and nestles her against his shoulder, ensuring she feels secure in his hold. Carrying her back to the farmhouse, they pass Merrill, who emerges from within, holding a bowl and a bag of feed in his hands. As Graham walks past, he ascends the steps to the veranda and steps through the front door into the house's comforting interior. Merrill, momentarily confused, shifts his gaze to the climbing frame, his boyish features caught in contemplation as he stands in his early 30s, with short dark hair. He sets down the bag of feed and proceeds to untie Isabel, the other Alsatian, from where she is secured to the veranda steps, leading her gently across the yard. During this time, Caroline removes the barbecue fork lodged in Houdini's throat with careful deliberation. A wire wind chime, crafted in the likeness of a beaming sun, hangs from the veranda and swings mournfully in the soft breeze, adding a melancholic note to the scene. As night falls, darkness envelops the farmhouse beneath a vast black sky. In this stillness, Graham lies on his side in bed, his eyes abruptly opening, gazing into the distance as Bo watches him intently. Quietly, Graham rises and, holding Bo's hand, pads across the landing toward the children's bedroom. They reach the open door and step into the dimly lit room, where Morgan lies half off his bed in an uncomfortable heap. Bo quietly shuffles off to her own bed while Graham tenderly lifts Morgan, repositioning him gently onto his back for a more restful sleep. He then crosses the bedroom to sit beside Bo on her bed, taking a moment to gaze at her. His eyes trace her face as she regards him with wide, bright eyes, her innocence a stark contrast to the sadness that descends upon Graham's features. Looking from her to the bedroom window, his attention is caught by a shadowy figure standing by a chimney pot on the barn roof. Startled, Graham jumps to his feet and quietly makes his way downstairs to the lounge, where Merrill is slumbering in an armchair. Graham lightly touches Merrill's shoulder, rousing him from sleep, and Merrill looks up at his brother with confusion etched on his face. Together, they stand by the front door, where Merrill opens it, triggering an outside light that floods the entrance as they rush out, instinctively splitting up to cover more ground. Merrill circles to the back of the house just as a dust bin tips over ahead of him, creating a sudden clatter. Simultaneously, Graham sprints along the side of the house, and the two brothers eventually converge at the front. They halt momentarily, scanning their surroundings with bated breath before a noise from the roof captures their attention. Merrill fixates on the farmhouse roof, stepping backward into the shadowy yard to gain a clearer view, his eyes never leaving the mysterious commotion above."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Morgan steps over Houdini, taking Graham's hand as they look down at the dead dog. When Graham tries to comfort Morgan by placing a hand on his shoulder, Morgan brushes it off and walks away solemnly. Graham approaches the climbing frame, where Bo is curled up, then gently lifts her and carries her back to the farmhouse. As they head inside, Merrill appears with a bowl and a bag of feed. Graham passes him, climbs onto the veranda, and enters the house. Merrill, looking confused, puts down the feed and unties Isabel, the other Alsatian, leading her across the yard as Caroline removes a barbecue fork from Houdini's throat. The veranda's sun-shaped wire wind chime swings mournfully in the breeze.\n\nThat night, the farmhouse is dark under a black sky. Graham is lying in bed, suddenly alert as Bo watches him. He takes Bo's hand and walks to the children's bedroom, where Morgan is half off his bed. Graham lifts Morgan back onto the bed and then sits beside Bo, observing her with sadness. He glances at the window and notices a shadowy figure by a chimney pot on the barn roof, prompting him to jump up.\n\nDownstairs, Merrill is asleep in an armchair until Graham wakes him. They head to the front door, which Merrill opens, triggering the outside light, and rush outside, splitting up to investigate. Merrill heads to the back of the house as a dust bin tips over, while Graham runs along the side. They reunite at the front, breathlessly searching for the source of a noise on the roof. Merrill paces backward, keeping his eyes fixed on the roof, trying to get a better view."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Morgan takes Graham's hand and steps over Houdini, named presumably after the famous escape artist due to his notorious ability to slip out of any enclosure, and they gaze down at the dead dog; Graham puts his hand on Morgan's shoulder, but Morgan brushes it away and trudges off solemnly, his heart heavy with grief. Graham steps up to the climbing frame, a rusting relic from when the playground was first built in the 1970s, and looks searchingly at Bo, who remains in a tight ball, staring down at the ground; he gently lifts her off the platform and holds her against his shoulder, carrying Bo back to the old clapboard farmhouse, built by their grandfather, as Merrill emerges, carrying a bowl and a bag of feed meant for the chickens they keep in a coop at the edge of the yard. Graham walks past him, climbs onto the creaky wooden veranda, and walks through the front door of the house. Merrill looks over to the climbing frame with a confused expression; he's in his early 30s with short dark hair and a boyish face that often betrays his serious demeanor. Merrill puts down the bag of feed and unties Isabel, the other Alsatian, from the veranda steps, leading her across the yard as Caroline, their niece who helps out on weekends, pulls the barbecue fork from Houdini's throat. A wire wind chime in the shape of a beaming sun, a gift from Graham’s late wife during one of their spontaneous road trips, hangs on the veranda and swings mournfully in the soft breeze. That night, the farmhouse stands in darkness beneath a black sky spattered with stars. Graham lies on his side in bed, his eyes suddenly open as he stares ahead; Bo gazes at him with the innocent concern only a child can have. Graham pads across the landing to the children's bedroom, holding Bo by the hand, as they come to the open bedroom door and step into the darkened room, where Morgan lies half off his bed in an uncomfortable looking heap after tossing and turning from a restless night. Bo shuffles off to her bed, and Graham gently lifts Morgan up and lies him on his back, then walks across the bedroom and sits beside Bo on her bed, remembering how she loves stories about faraway lands before sleep. He gazes at her and looks her up and down; Bo looks at him through wide bright eyes, and a sadness falls across Graham's face as he looks at his daughter, then glances over at the bedroom window. A shadowy figure stands by a chimney pot on the barn roof, and Graham jumps to his feet, his heart pounding with an unexpected surge of adrenaline. Downstairs in the lounge, Merrill is asleep in an armchair when Graham touches his shoulder, waking Merrill, who looks up at his brother in confusion, still half-dreaming of their childhood escapades. Graham and Merrill are by the front door, and Merrill opens the door; an outside light comes on, activated by a motion sensor they installed for extra security, and they rush out and split up. Merrill comes to the back of the house as a dust bin is tipped over up ahead, while Graham runs along the side of the house, and the brothers meet up again at the front of the house. They stop and look around breathlessly when a sound on the roof of the house, likely the mischievous raccoons known to scavenge in the area, attracts their attention; Merrill keeps his gaze fixed firmly on the farmhouse roof as he paces backwards down the gloomy yard, trying to get a better view under the pale light of the full moon."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Morgan takes Graham's hand and steps over Houdini and they gaze down at the dead dog. Graham puts his hand on Morgan's shoulder but Morgan brushes it away and trudges off solemnly. Graham steps up to the climbing frame and looks searchingly at Bo who remains in a tight ball staring down at the ground. he gently lifts her off the platform and holds her against his shoulder carrying Bo back to the farmhouse as Merrill emerges carrying a bowl and a bag of feed. Graham walks past him climbs onto the veranda and walks through the front door of the house. Merrill looks over to the climbing frame with a confused expression. he is in his early 30s with short dark hair and a boyish face. Merrill puts down the bag of feed and unties Isabel. the other Alsatian from the veranda steps leading her across the yard as Caroline pulls the barbecue fork from Houdini's throat. A wire wind chime in the shape of a beaming sun hangs on the veranda and swings mournfully in the soft breeze. That night the farmhouse stands in darkness beneath a black sky. Graham lies on his side in bed his eyes suddenly open as he stares ahead. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Bo gazes at him. Graham pads across the landing to the children's bedroom holding Bo by the hand as they come to the open bedroom door and step into the darkened room where Morgan lies half off his bed in an uncomfortable looking heap. Bo shuffles off to her bed and Graham gently lifts Morgan up and lies him on his back then walks across the bedroom and sits beside Bo on her bed. He gazes at her and looks her up and down. Bo looks at him through wide bright eyes and a sadness falls across Graham's face as he looks at his daughter then glances over at the bedroom window. A shadowy figure stands by a chimney pot on the barn roof and Graham jumps to his feet. Downstairs in the lounge Merrill is asleep in an armchair when Graham touches his shoulder waking Merrill who looks up at his brother in confusion. Graham and Merrill are by the front door and Merrill opens the door. an outside light comes on and they rush out and split up. Merrill comes to the back of the house as a dust bin is tipped over up ahead while Graham runs along the side of the house and the brothers meet up again at the front of the house. They stop and look around breathlessly when a sound on the roof of the house attracts their attention. Merrill keeps his gaze fixed firmly on the farmhouse roof as he paces backwards down the gloomy yard trying to get a better view."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Morgan takes Graham's hand and steps over Houdini and they gaze down at the dead dog. Graham puts his hand on Morgan's shoulder but Morgan brushes it away and trudges off solemnly. Graham steps up to the climbing frame and looks searchingly at Bo who remains in a tight ball staring down at the ground. he gently lifts her off the platform and holds her against his shoulder carrying Bo back to the farmhouse as Merrill emerges carrying a bowl and a bag of feed. Graham walks past him climbs onto the veranda and walks through the front door of the house. Merrill looks over to the climbing frame with a confused expression. he is in his early 30s with short dark hair and a boyish face. Merrill puts down the bag of feed and unties Isabel. the other Alsatian from the veranda steps leading her across the yard as Caroline pulls the barbecue fork from Houdini's throat. A wire wind chime in the shape of a beaming sun hangs on the veranda and swings mournfully in the soft breeze. That night the farmhouse stands in darkness beneath a black sky. Graham lies on his side in bed his eyes suddenly open as he stares ahead. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Bo gazes at him. Graham pads across the landing to the children's bedroom holding Bo by the hand as they come to the open bedroom door and step into the darkened room where Morgan lies half off his bed in an uncomfortable looking heap. Bo shuffles off to her bed and Graham gently lifts Morgan up and lies him on his back then walks across the bedroom and sits beside Bo on her bed. He gazes at her and looks her up and down. Bo looks at him through wide bright eyes and a sadness falls across Graham's face as he looks at his daughter then glances over at the bedroom window. A shadowy figure stands by a chimney pot on the barn roof and Graham jumps to his feet. Downstairs in the lounge Merrill is asleep in an armchair when Graham touches his shoulder waking Merrill who looks up at his brother in confusion. Graham and Merrill are by the front door and Merrill opens the door. an outside light comes on and they rush out and split up. Merrill comes to the back of the house as a dust bin is tipped over up ahead while Graham runs along the side of the house and the brothers meet up again at the front of the house. They stop and look around breathlessly when a sound on the roof of the house attracts their attention. Merrill keeps his gaze fixed firmly on the farmhouse roof as he paces backwards down the gloomy yard trying to get a better view."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Morgan takes Graham's hand and steps over Houdini and they gaze down at the dead dog. Graham puts his hand on Morgan's shoulder but Morgan brushes it away and trudges off solemnly. Graham steps up to the climbing frame and looks searchingly at Bo who remains in a tight ball staring down at the ground. he gently lifts her off the platform and holds her against his shoulder carrying Bo back to the farmhouse as Merrill emerges carrying a bowl and a bag of feed. Graham walks past him climbs onto the veranda and walks through the front door of the house. Merrill looks over to the climbing frame with a confused expression. Downstairs in the lounge Merrill is asleep in an armchair when Graham touches his shoulder waking Merrill who looks up at his brother in confusion. Graham and Merrill are by the front door and Merrill opens the door. an outside light comes on and they rush out and split up. Merrill comes to the back of the house as a dust bin is tipped over up ahead while Graham runs along the side of the house and the brothers meet up again at the front of the house. They stop and look around breathlessly when a sound on the roof of the house attracts their attention. Merrill keeps his gaze fixed firmly on the farmhouse roof as he paces backwards down the gloomy yard trying to get a better view."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Morgan takes Graham's hand and steps over Houdini and they gaze down at the dead dog. Graham puts his hand on Morgan's shoulder but Morgan brushes it away and trudges off solemnly. Graham steps up to the climbing frame and looks searchingly at Bo who remains in a tight ball staring down at the ground. They stop and look around breathlessly when a sound on the roof of the house attracts their attention. Merrill keeps his gaze fixed firmly on the farmhouse roof as he paces backwards down the gloomy yard trying to get a better view."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Jordan grabs Leslie's umbrella and hops over Ringo, and they peer up at the singing cat; Leslie places his foot on Jordan's elbow, but Jordan shrugs it off and skips away cheerfully. Leslie hops over to the bouncy castle and glances playfully at Max, who remains in a loose spiral, gazing up at the sky; he softly lifts her off the seesaw and holds her against his elbow, dragging Max back to the pavilion as Alex appears, dragging a box and a jar of marbles. Leslie skips past him, jumps onto the patio, and skips through the side window of the cabin. Alex glances over to the bouncy castle with a puzzled grin; he's in his late 40s with long blond curls and an elderly face. Alex drops the jar of marbles and unties Hector, the other poodle, from the patio railing, guiding her through the lot as Danielle extracts the skewer from Ringo's paw. A wooden bell in the shape of a smiling star dangles on the patio and swings joyfully in the gentle gust. That evening, the cabin stands in brightness beneath a white moon. Leslie lies on his back in bed, his ears suddenly closed as he squints up; Max peers at him. Leslie crawls across the corridor to the adults' kitchen, holding Max by the ear, as they come to the closed kitchen window and step into the brightly lit hall, where Jordan lies half under his couch in a comfortable looking bundle. Max rolls off to her couch, and Leslie gently nudges Jordan down and sits him on his feet, then tiptoes across the kitchen and leans beside Max on her couch. He squints at her and surveys her side to side; Max peers at him through narrow dark eyes, and a happiness rises across Leslie's face as he scowls at his son, then peers over at the kitchen hallway. A clear shape sits by a gutter pipe on the shed floor, and Leslie leaps to his knees. Upstairs in the attic, Alex is awake in a stool when Leslie taps his knee, nudging Alex, who glances down at his cousin in surprise. Leslie and Alex are by the balcony, and Alex pulls the window; an inside lamp goes off, and they tiptoe in and join up. Alex heads to the front of the cabin as a haystack is picked up down behind, while Leslie walks past the back of the cabin, and the cousins join up again at the back of the cabin. They start and glance away lazily when a light on the floor of the cabin diverts their glance; Alex keeps his gaze moving slowly past the pavilion floor as he trots forwards through the bright lot, trying to spot a worse angle."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Morgan takes Graham's hand and steps over Houdini, the dead dog, but brushes off Graham's comforting gesture. Graham lifts Bo from a platform and carries her back to the farmhouse, passing Merrill, who is puzzled and carrying a bowl and feed. Merrill, in his early 30s, unties Isabel, another dog, while Caroline removes a barbecue fork from Houdini's throat. A wire sun-shaped wind chime sways in the breeze. That night, Graham, lying awake in bed, leads Bo to the children's room where Morgan sleeps uncomfortably. Graham settles Morgan and sits by Bo, feeling sad as he looks at her. He notices a shadowy figure on the barn roof and alerts Merrill, who is sleeping in the lounge. They rush outside and split up, searching around the house until noise from the roof draws their attention. Merrill, pacing backward, tries to get a better view of the roof."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Merrill keeps his gaze fixed firmly on the farmhouse roof as he paces backwards down the gloomy yard trying to get a better view They stop and look around breathlessly when a sound on the roof of the house attracts their attention Merrill comes to the back of the house as a dust bin is tipped over up ahead while Graham runs along the side of the house and the brothers meet up again at the front of the house an outside light comes on and they rush out and split up Graham and Merrill are by the front door and Merrill opens the door Downstairs in the lounge Merrill is asleep in an armchair when Graham touches his shoulder waking Merrill who looks up at his brother in confusion A shadowy figure stands by a chimney pot on the barn roof and Graham jumps to his feet Bo looks at him through wide bright eyes and a sadness falls across Graham's face as he looks at his daughter then glances over at the bedroom window He gazes at her and looks her up and down Bo shuffles off to her bed and Graham gently lifts Morgan up and lies him on his back then walks across the bedroom and sits beside Bo on her bed Graham pads across the landing to the children's bedroom holding Bo by the hand as they come to the open bedroom door and step into the darkened room where Morgan lies half off his bed in an uncomfortable looking heap Bo gazes at him Graham lies on his side in bed his eyes suddenly open as he stares ahead That night the farmhouse stands in darkness beneath a black sky A wire wind chime in the shape of a beaming sun hangs on the veranda and swings mournfully in the soft breeze the other Alsatian from the veranda steps leading her across the yard as Caroline pulls the barbecue fork from Houdini's throat Merrill puts down the bag of feed and unties Isabel he is in his early 30s with short dark hair and a boyish face Merrill looks over to the climbing frame with a confused expression Graham walks past him climbs onto the veranda and walks through the front door of the house he gently lifts her off the platform and holds her against his shoulder carrying Bo back to the farmhouse as Merrill emerges carrying a bowl and a bag of feed Graham steps up to the climbing frame and looks searchingly at Bo who remains in a tight ball staring down at the ground Graham puts his hand on Morgan's shoulder but Morgan brushes it away and trudges off solemnly Morgan takes Graham's hand and steps over Houdini and they gaze down at the dead dog"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Graham puts his hand on Morgan's shoulder but Morgan brushes it away and trudges off solemnly Morgan takes Graham's hand and steps over Houdini and they gaze down at the dead dog he gently lifts her off the platform and holds her against his shoulder carrying Bo back to the farmhouse as Merrill emerges carrying a bowl and a bag of feed Graham steps up to the climbing frame and looks searchingly at Bo who remains in a tight ball staring down at the ground Merrill looks over to the climbing frame with a confused expression Graham walks past him climbs onto the veranda and walks through the front door of the house Merrill puts down the bag of feed and unties Isabel he is in his early 30s with short dark hair and a boyish face A wire wind chime in the shape of a beaming sun hangs on the veranda and swings mournfully in the soft breeze the other Alsatian from the veranda steps leading her across the yard as Caroline pulls the barbecue fork from Houdini's throat Graham lies on his side in bed his eyes suddenly open as he stares ahead That night the farmhouse stands in darkness beneath a black sky Graham pads across the landing to the children's bedroom holding Bo by the hand as they come to the open bedroom door and step into the darkened room where Morgan lies half off his bed in an uncomfortable looking heap Bo gazes at him He gazes at her and looks her up and down Bo shuffles off to her bed and Graham gently lifts Morgan up and lies him on his back then walks across the bedroom and sits beside Bo on her bed A shadowy figure stands by a chimney pot on the barn roof and Graham jumps to his feet Bo looks at him through wide bright eyes and a sadness falls across Graham's face as he looks at his daughter then glances over at the bedroom window Graham and Merrill are by the front door and Merrill opens the door Downstairs in the lounge Merrill is asleep in an armchair when Graham touches his shoulder waking Merrill who looks up at his brother in confusion Merrill comes to the back of the house as a dust bin is tipped over up ahead while Graham runs along the side of the house and the brothers meet up again at the front of the house an outside light comes on and they rush out and split up Merrill keeps his gaze fixed firmly on the farmhouse roof as he paces backwards down the gloomy yard trying to get a better view They stop and look around breathlessly when a sound on the roof of the house attracts their attention"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Bo gazes at him Graham pads across the landing to the children's bedroom holding Bo by the hand as they come to the open bedroom door and step into the darkened room where Morgan lies half off his bed in an uncomfortable looking heap Bo shuffles off to her bed and Graham gently lifts Morgan up and lies him on his back then walks across the bedroom and sits beside Bo on her bed He gazes at her and looks her up and down Bo looks at him through wide bright eyes and a sadness falls across Graham's face as he looks at his daughter then glances over at the bedroom window A shadowy figure stands by a chimney pot on the barn roof and Graham jumps to his feet Downstairs in the lounge Merrill is asleep in an armchair when Graham touches his shoulder waking Merrill who looks up at his brother in confusion Graham and Merrill are by the front door and Merrill opens the door an outside light comes on and they rush out and split up Merrill comes to the back of the house as a dust bin is tipped over up ahead while Graham runs along the side of the house and the brothers meet up again at the front of the house They stop and look around breathlessly when a sound on the roof of the house attracts their attention Merrill keeps his gaze fixed firmly on the farmhouse roof as he paces backwards down the gloomy yard trying to get a better view Morgan takes Graham's hand and steps over Houdini and they gaze down at the dead dog Graham puts his hand on Morgan's shoulder but Morgan brushes it away and trudges off solemnly Graham steps up to the climbing frame and looks searchingly at Bo who remains in a tight ball staring down at the ground he gently lifts her off the platform and holds her against his shoulder carrying Bo back to the farmhouse as Merrill emerges carrying a bowl and a bag of feed Graham walks past him climbs onto the veranda and walks through the front door of the house Merrill looks over to the climbing frame with a confused expression he is in his early 30s with short dark hair and a boyish face Merrill puts down the bag of feed and unties Isabel the other Alsatian from the veranda steps leading her across the yard as Caroline pulls the barbecue fork from Houdini's throat A wire wind chime in the shape of a beaming sun hangs on the veranda and swings mournfully in the soft breeze That night the farmhouse stands in darkness beneath a black sky Graham lies on his side in bed his eyes suddenly open as he stares ahead"
        }
      ]
    }
  ]
}