{
  "ground_truth": "Bo points at it, and Graham falters, opening the book. Graham looks uncertain, nodding dubiously as he takes the book from Morgan and starts to leaf through the pages, while Morgan and Bo look on. On one page is a simple sketch of an extraterrestrial with a teardrop-shaped head and large catlike eyes. On another page is a picture of a bluey-green alien with an angular jaw and black almond-shaped eyes. On a third page, a gloomy nighttime drawing depicts a UFO firing two red laser beams into a wooden farmhouse, which is on fire, with flames pouring from the upstairs windows. Lying on the lawn of the pictured house are three shadowy bodies, an adult and two children. Morgan and Bo are staring at the picture as Graham's eyes flick pensively from side to side, and they all jump back. Taking the book, he leaves and answers the phone on the landing. Graham stands stock still with the telephone receiver still pressed to his ear and glances down the landing into a room containing a dressmaker's dummy. Now clothed, Graham plods downstairs, takes a coat from the closet where Merrill is still glued to the TV, and then picks up some keys. Merrill looks confused. From the bedroom, Morgan is looking at clouds through a telescope as Bo stands beside him. Bo nods with a worried expression, gives a slow deliberate nod, hugs his arm, and avoids eye contact. Graham knocks at the house of Vet Ray Reddy. He opens the screen door, peers through slats in the wooden door behind it, then gingerly closes the screen as Graham gently releases the handle. Stepping back from the door, his keen eye scans from left to right. He turns and treads calmly along the wooden veranda surrounding the house. Reaching the closed window, he stops and looks through the glass into an office, where the compact ruin is deserted, and the solid dark wood desk is clattered with papers. Graham's gaze alights on a wooden chair lying upturned on the floor beside the lampshade, with its toppled vase on a small round table above and the naked bulb still glowing brightly, viewing the scene with restrained alarm. Then, backing away, he turns and spots the brown Chevy 4x4 parked on a short driveway with a figure at the wheel. Graham approaches the vehicle cautiously across a lawn, leaning over to get a view of its occupant. The passenger side window is lowered as Graham puts both hands on the sill and leans in with an inquisitive frown. Ray, the Asian man who stayed in town, sits with one hand clamped to the steering wheel, rocking nervously and staring numbly ahead. In the back are bundles of clothes which Graham eyes questioningly. Returning his attention to the front, he notices a blood stain on Ray's check shirt.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Bo indicates at it, and Graham hesitates, unsealing the tome. Graham appears unsure, acknowledging skeptically as he receives the tome from Morgan and begins to flip through the leaves, while Morgan and Bo observe. On one leaf is a straightforward illustration of an extraterrestrial with a droplet-shaped cranium and substantial feline eyes. On another leaf is an image of a bluish-green alien with an angular chin and dark almond-shaped eyes. On a third leaf, a dismal nocturnal drawing portrays a UFO projecting two crimson laser rays into a timber farmhouse, which is ablaze, with flames streaming from the upstairs apertures. Sprawled on the grass of the depicted domicile are three shadowy cadavers, an adult and two juveniles. Morgan and Bo are gazing at the image as Graham's eyes dart thoughtfully from flank to flank, and they all recoil. Grasping the tome, he departs and responds to the telephone on the landing. Graham stands motionless with the telephone receiver still pressed to his ear and glances down the landing into a chamber containing a tailor's mannequin. Now attired, Graham trudges downstairs, takes a coat from the closet where Merrill is still glued to the TV, and then picks up some keys. Merrill looks perplexed. From the bedroom, Morgan is gazing at clouds through a telescope as Bo stands beside him. Bo nods with an anxious demeanor, gives a slow deliberate nod, embraces his arm, and avoids ocular contact. Graham raps at the domicile of Vet Ray Reddy. He opens the screen door, peers through slats in the timber door behind it, then cautiously closes the screen as Graham gently releases the handle. Stepping back from the door, his keen eye surveys from left to right. He turns and treads calmly along the wooden veranda encompassing the dwelling. Reaching the sealed window, he halts and peers through the glass into an office, where the compact wreck is unoccupied, and the sturdy dark wood desk is cluttered with documents. Graham's gaze settles on a timber chair lying overturned on the flooring beside the lampshade, with its toppled vase on a small round table above and the exposed bulb still glowing brightly, viewing the scene with controlled alarm. Then, retreating, he turns and observes the brown Chevy 4x4 stationed on a short driveway with a figure at the wheel. Graham approaches the vehicle cautiously across a lawn, leaning over to get a view of its occupant. The passenger side window is lowered as Graham places both hands on the sill and leans in with an inquisitive frown. Ray, the Asian man who remained in town, sits with one hand clamped to the steering wheel, rocking nervously and staring vacantly ahead. In the rear are bundles of garments which Graham eyes questioningly. Returning his attention to the front, he notices a blood mark on Ray's checkered shirt."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "It is pointed at by Bo, and the book is faltered open by Graham. An uncertain look is given by Graham, and he nods dubiously, as the book is taken from Morgan and the pages are started to be leafed through by him, while they are looked on by Morgan and Bo. A simple sketch of an extraterrestrial with a teardrop-shaped head and large catlike eyes is on one page. On another page, a bluey-green alien with an angular jaw and black almond-shaped eyes is pictured. On a third page, a gloomy nighttime drawing depicts a UFO firing two red laser beams into a wooden farmhouse, which has flames pouring from the upstairs windows as it is set on fire. Three shadowy bodies, an adult and two children, are lying on the lawn of the pictured house. The picture is stared at by Morgan and Bo while Graham's pensive eyes flick from side to side, and all of them jump back. The book is taken by him as he leaves and answers the phone on the landing. The telephone receiver is still pressed to his ear as Graham stands stock still and glances down the landing into a room containing a dressmaker's dummy. Now clothed, the stairs are plodded down by Graham, a coat is taken from the closet where Merrill is glued to the TV, and some keys are picked up by him. Confusion is shown by Merrill. Clouds are looked at through a telescope from the bedroom by Morgan, as Bo stands beside him. A worried expression is nodded by Bo, who gives a slow deliberate nod, hugs his arm, and avoids eye contact. The house of Vet Ray Reddy is knocked on by Graham. The screen door is opened by him, slats in the wooden door behind it are peered through, then the screen is gingerly closed as the handle is gently released by Graham. Stepping back from the door, his keen eye is scanned from left to right by him. He turns and treads calmly along the wooden veranda surrounding the house. Reaching the closed window, he stops and looks through the glass into an office, where papers clatter the solid dark wood desk and a wooden chair lies upturned on the floor beside the lampshade, with its toppled vase on a small round table above and the naked bulb glowing brightly, viewing the scene with restrained alarm. Then, backing away, he turns and spots the brown Chevy 4x4 parked on a short driveway with a figure at the wheel. The vehicle is approached cautiously by Graham across a lawn, leaning over to get a view of its occupant. The passenger side window is lowered as both hands are put on the sill by Graham, who leans in with an inquisitive frown. Ray, the Asian man who stayed in town, sits with one hand clamped to the steering wheel, rocking nervously and staring numbly ahead. Bundles of clothes are eyed questioningly by Graham in the back. Returning his attention to the front, he notices a blood stain on Ray's check shirt."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Bo points, and Graham hesitantly opens the book, nodding uncertainly as he takes it from Morgan and flips through the pages while Morgan and Bo watch. One page shows a sketch of an alien with a teardrop-shaped head and large catlike eyes. Another depicts a blue-green alien with an angular jaw and black almond-shaped eyes. A third page shows a nighttime scene of a UFO firing red lasers at a burning farmhouse, with flames pouring from the windows and three shadowy bodies on the lawn. Morgan and Bo stare at the picture as Graham's eyes flick pensively, and they all jump back. Graham takes the book, leaves, and answers the phone on the landing. He stands still with the receiver to his ear, glancing into a room with a dressmaker's dummy. Clothed, he heads downstairs, takes a coat from the closet where Merrill is glued to the TV, and picks up some keys. Merrill looks confused. In the bedroom, Morgan looks at clouds through a telescope as Bo stands beside him, nods worriedly, hugs his arm, and avoids eye contact. Graham knocks at Vet Ray Reddy's house, peers through the screen door, then closes it gently. He steps back, scans the area, and walks along the veranda. At a window, he looks into an empty office with a cluttered desk and an upturned chair beside a glowing lamp. Alarmed, he backs away and spots a brown Chevy 4x4 with a figure inside. Graham approaches cautiously, leans in with a frown, and sees Ray, an Asian man, nervously rocking with one hand on the wheel. In the back are bundles of clothes, and Graham notices a blood stain on Ray's check shirt."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Bo points; Graham hesitantly opens the book Morgan hands him, flipping pages uncertainly while both look on. One page shows a sketch of an alien with teardrop head and catlike eyes; another features a blue-green alien with angular jaw and black almond eyes. A third depicts a UFO shooting red lasers at a burning farmhouse, three shadowy bodies outside. Graham, Morgan, and Bo recoil. Graham takes the book, answers a phone call on the landing, glancing nervously toward a room with a dressmaker's dummy. Later dressed, Graham heads downstairs, retrieves a coat near Merrill watching TV, and picks up keys; Merrill appears confused. Morgan views clouds through a telescope from the bedroom; Bo stands worriedly beside, hugging his arm and avoiding eye contact. Graham knocks at vet Ray Reddy’s house; no response. He carefully retreats along the veranda, peers into a deserted, disordered office through a window, noting an overturned chair, toppled vase, and bright bulb. Spotting Ray’s parked Chevy 4x4, Graham cautiously approaches, leaning to peer inside. Ray sits gripping the wheel anxiously, staring blankly ahead; Graham notices bundled clothes in the backseat and a bloodstain on Ray's checked shirt."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Bo gestures towards the object, prompting Graham to hesitate momentarily before he opens the book. Graham appears uncertain, nodding with a hint of doubt as he accepts the book from Morgan and begins to flip through its pages, all the while Morgan and Bo watch intently. On one of the pages, there is a straightforward sketch depicting an extraterrestrial being with a teardrop-shaped head and large, catlike eyes. Another page reveals an image of a bluey-green alien characterized by an angular jaw and black, almond-shaped eyes. Yet another page presents a somber nighttime illustration showing a UFO emitting two red laser beams into a wooden farmhouse, which is engulfed in flames, with fire pouring out from the upstairs windows. On the lawn of the depicted house lie three shadowy figures, an adult and two children. Morgan and Bo fix their gaze on the picture as Graham's eyes move thoughtfully from side to side, and suddenly, they all recoil in surprise. Taking the book with him, Graham exits the room and answers the ringing phone on the landing. He stands completely still, the telephone receiver pressed to his ear, and glances down the landing into a room where a dressmaker's dummy is situated. Now dressed, Graham descends the stairs slowly, retrieves a coat from the closet where Merrill remains engrossed in the television, and then picks up a set of keys. Merrill appears bewildered. Meanwhile, from the bedroom, Morgan is peering at the clouds through a telescope, with Bo standing beside him. Bo nods with a worried expression, gives a slow, deliberate nod, hugs his arm tightly, and avoids making eye contact. Graham proceeds to knock at the house of Vet Ray Reddy. He opens the screen door, peers cautiously through the slats of the wooden door behind it, then gently closes the screen as Graham softly releases the handle. Stepping back from the door, his sharp eyes scan the surroundings from left to right. He turns and walks calmly along the wooden veranda that encircles the house. Upon reaching a closed window, he pauses and peers through the glass into an office, where the compact ruin is deserted, and the solid dark wood desk is cluttered with scattered papers. Graham's gaze settles on a wooden chair lying overturned on the floor beside a lampshade, with its toppled vase on a small round table above, and the naked bulb still glowing brightly, casting light on the scene with a sense of restrained alarm. Then, retreating, he turns and notices the brown Chevy 4x4 parked on a short driveway with a figure seated at the wheel. Graham approaches the vehicle cautiously, crossing the lawn and leaning over to get a better view of its occupant. The passenger side window is lowered as Graham places both hands on the sill and leans in with an inquisitive frown. Ray, the Asian man who remained in town, sits with one hand gripping the steering wheel, rocking nervously and staring blankly ahead. In the back are bundles of clothes, which Graham eyes with a questioning look. Shifting his focus back to the front, he observes a blood stain on Ray's checkered shirt."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Bo, with a subtle and intriguing gesture, directs attention towards the intriguing object, prompting Graham to experience a brief moment of hesitation before he decides to open the book. Graham’s expression conveys an air of uncertainty; he nods with a slight hint of doubt as he accepts the book handed to him by Morgan, and then he cautiously begins to flip through its pages. All the while, Morgan and Bo maintain an intense, focused watch over him. Within the book, on one of the pages, there is a simple yet evocative sketch illustrating an extraterrestrial being. The being is depicted with a teardrop-shaped head adorned with large, captivating catlike eyes. As Graham continues to explore the contents, another page uncovers an image of a bluey-green alien. This alien is characterized by a distinctively angular jawline and striking black, almond-shaped eyes. Yet another page dramatically presents a poignant nighttime scene displaying a UFO. This UFO ominously emits two vivid red laser beams directed at a wooden farmhouse that is already consumed by flames, with fire vividly pouring out from the upstairs windows. On the lawn in front of the house, three shadowy figures are visible—an adult along with two children. Morgan and Bo's eyes remain fixed intently on this vivid picture as Graham's gaze darts thoughtfully from side to side. Suddenly, they all collectively recoil in a state of surprise. Keeping the book in his possession, Graham exits the room and moves quickly to answer the ringing phone located on the landing. He stands motionless, pressing the telephone receiver to his ear, and glances down the landing into a room where a dressmaker’s dummy is conspicuously placed. Now dressed, Graham descends the stairs slowly. He retrieves a coat from the closet where Merrill remains deeply engrossed in watching television, and then Graham picks up a set of keys. Merrill appears bewildered by these actions. Meanwhile, from the bedroom, Morgan is intently observing the clouds through a telescope with Bo standing close beside him. Bo nods with a worried, anxious expression, offering a slow, deliberate nod as he embraces his own arm tightly and carefully avoids making direct eye contact. Graham proceeds to knock on the door at the house of Vet Ray Reddy. He cautiously opens the screen door, peering through the slats of the wooden door behind it, before gently closing the screen again as Graham quietly releases the handle. He steps back from the door, his sharp, observant eyes scanning the surroundings meticulously from left to right. He then turns and walks calmly along the wooden veranda that wraps around the entirety of the house. Upon reaching a closed window, he pauses briefly to peer through the glass into an office, where the compact space appears deserted, and the solid dark wood desk is a cluttered mess piled high with scattered papers. Graham's gaze soon settles on a particular wooden chair lying overturned on the floor beside a lampshade, accompanied by its toppled vase on a small round table above. A naked bulb still glows brightly, casting its light on the scene with an aura of restrained alarm. Then, with a slight retreat, he turns and notices the brown Chevy 4x4 parked on a short driveway, where a figure is seated at the wheel. Graham approaches the vehicle with caution, crossing over the lawn and leaning in to get a better, clearer view of its occupant. The passenger side window is lowered, allowing Graham to place both hands on the sill as he leans in with an inquisitive frown. Ray, the Asian man who remained in town, is sitting there with one hand gripping the steering wheel. He is rocking nervously, staring blankly ahead. In the back are bundles of clothes, which Graham eyes with a curious, questioning look. Shifting his focus back to the front once more, he observes a troubling bloodstain marring Ray's checkered shirt."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Bo extends his finger to point at the object, prompting Graham to hesitate momentarily before he opens the book. With a look of uncertainty, Graham nods with a hint of doubt, accepting the book from Morgan and beginning to flip through its pages, all while Morgan and Bo watch intently. As he turns the pages, he encounters a simple sketch depicting an extraterrestrial with a teardrop-shaped head and large, catlike eyes. Continuing to the next page, he finds an illustration of a bluey-green alien characterized by an angular jaw and black, almond-shaped eyes. On yet another page, he discovers a somber nighttime drawing showing a UFO emitting two red laser beams into a wooden farmhouse engulfed in flames, with fire pouring from the upstairs windows. The scene is further intensified by the presence of three shadowy bodies lying on the lawn of the depicted house, representing an adult and two children. Morgan and Bo fix their gaze on this picture, while Graham's eyes dart pensively from side to side, and suddenly, they all recoil in surprise. Clutching the book, Graham exits the room and proceeds to answer the ringing phone on the landing. He stands motionless with the telephone receiver pressed to his ear, casting a glance down the landing into a room where a dressmaker's dummy is visible. Now dressed, Graham descends the stairs, retrieves a coat from the closet where Merrill remains engrossed in the TV, and picks up a set of keys. Merrill appears bewildered by the situation. Meanwhile, in the bedroom, Morgan peers through a telescope at the clouds, with Bo standing beside him. Bo, wearing a worried expression, gives a slow, deliberate nod, hugs Morgan's arm, and avoids making eye contact. Graham then knocks on the door of Vet Ray Reddy's house. He opens the screen door and peers through the slats of the wooden door behind it, then carefully closes the screen as Graham gently releases the handle. Stepping back from the door, Graham's sharp eyes scan the surroundings from left to right. He turns and walks calmly along the wooden veranda that encircles the house. Upon reaching a closed window, he pauses to peer through the glass into an office, observing the compact, deserted space where a solid dark wood desk is cluttered with papers. His gaze settles on a wooden chair lying upturned on the floor beside a lampshade, with a toppled vase on a small round table above and a naked bulb still glowing brightly, all of which he views with restrained alarm. Then, retreating from the window, he turns and notices a brown Chevy 4x4 parked on a short driveway with a figure seated at the wheel. Graham approaches the vehicle cautiously across the lawn, leaning over to get a better view of its occupant. The passenger side window is lowered, and Graham places both hands on the sill, leaning in with an inquisitive frown. Inside, Ray, the Asian man who remained in town, sits with one hand gripping the steering wheel, rocking nervously and staring blankly ahead. In the back of the vehicle are bundles of clothes, which Graham observes with a questioning look. Shifting his focus back to the front, he spots a blood stain on Ray's checkered shirt."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Bo points at the book, prompting Graham to take it from Morgan and leaf through the pages, while Morgan and Bo watch. The book contains sketches of extraterrestrials and a dramatic nighttime scene of a UFO attacking a farmhouse, with shadowy bodies on the lawn. As Graham's eyes scan the images, they all jump back. Graham then leaves with the book to answer a phone call on the landing. Standing still with the receiver to his ear, he glances into a room with a dressmaker's dummy. Afterward, he heads downstairs, retrieves a coat and keys from the closet, where Merrill is engrossed in the TV. Meanwhile, Morgan observes clouds through a telescope with Bo, who nods worriedly, hugs his arm, and avoids eye contact. Graham knocks at Vet Ray Reddy's house, peers through the screen door, and then steps back to survey the surroundings. He looks through a window into a deserted office, noting the disarray with restrained alarm. Spotting a brown Chevy 4x4 in the driveway, he approaches cautiously and leans in to see Ray, who sits nervously at the wheel. Graham notices bundles of clothes in the back and a blood stain on Ray's shirt."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Bo points at it, and Graham falters, opening the book. Graham, an experienced pastor in their small rural town, looks uncertain, nodding dubiously as he takes the book from Morgan and starts to leaf through the pages. Morgan and Bo look on with wide eyes. On one page is a simple sketch of an extraterrestrial, reminiscent of the classic \"Grey\" aliens widely popularized in science fiction, with a teardrop-shaped head and large catlike eyes. On another page is a picture of a bluey-green alien with an angular jaw and black almond-shaped eyes, suggestive of the creature designs in well-known sci-fi films. On a third page, a gloomy nighttime drawing depicts a UFO firing two red laser beams into a wooden farmhouse, a scene that echoes many reported UFO encounters and abduction stories, which is on fire, with flames pouring from the upstairs windows. Lying on the lawn of the pictured house are three shadowy bodies, an adult and two children, evoking a sense of dread and loss. Morgan and Bo are staring at the picture as Graham's eyes flick pensively from side to side, and they all jump back. Taking the book, he leaves and answers the phone on the landing, a vintage rotary model common in older homes. Graham stands stock still with the telephone receiver still pressed to his ear and glances down the landing into a room containing a dressmaker's dummy, suggesting someone in the house has a hobby or profession in garment making. Now clothed, Graham plods downstairs, takes a coat from the closet where Merrill, his younger brother and a former minor league baseball player, is still glued to the TV, captivated by the ongoing news coverage of mysterious crop circles appearing worldwide, and then picks up some keys. Merrill looks confused. From the bedroom, Morgan is looking at clouds through a telescope, a common pastime for children fascinated by space, as Bo stands beside him. Bo, empathetic and intuitive despite her young age, nods with a worried expression, gives a slow deliberate nod, hugs his arm, and avoids eye contact. Graham knocks at the house of Vet Ray Reddy, a local veterinarian known for his skill with animals. He opens the screen door, peers through slats in the wooden door behind it, then gingerly closes the screen as Graham gently releases the handle. Stepping back from the door, his keen eye scans from left to right. He turns and treads calmly along the wooden veranda surrounding the house, designed in a style typical of rural architecture. Reaching the closed window, he stops and looks through the glass into an office, where the compact ruin is deserted, and the solid dark wood desk, reminiscent of mid-century craftsmanship, is clattered with papers. Graham's gaze alights on a wooden chair lying upturned on the floor beside the lampshade, with its toppled vase on a small round table above and the naked bulb still glowing brightly, viewing the scene with restrained alarm. Then, backing away, he turns and spots the brown Chevy 4x4, a durable vehicle often used in rural areas for its reliability, parked on a short driveway with a figure at the wheel. Graham approaches the vehicle cautiously across a lawn, leaning over to get a view of its occupant. The passenger side window is lowered as Graham puts both hands on the sill and leans in with an inquisitive frown. Ray, the Asian man who stayed in town after moving from a bustling city, sits with one hand clamped to the steering wheel, rocking nervously and staring numbly ahead. In the back are bundles of clothes, suggesting a hurried escape, which Graham eyes questioningly. Returning his attention to the front, he notices a blood stain on Ray's check shirt, an unsettling detail that hints at a recent violent encounter."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Bo points at it and Graham falters  opening the book  Graham looks uncertain nodding dubiously as he takes the book from Morgan and starts to leaf through the pages  on the landing  Graham stands stock still with the telephone receiver still pressed to his ear and glances down the landing into a room containing a dressmaker's dummy  Now clothed Graham plods downstairs takes a coat from the closet where Merrill is still glued to the TV and then picks up some keys  Merrill looks confused  From the bedroom Morgan is looking at clouds through a telescope as Bo stands beside him  Bo nods with a worried expression gives a slow deliberate nod hugs his arm and avoids eye contact  Graham knocks at the house of Vet Ray Reddy  He opens the screen door peers through slats in the wooden door behind it then gingerly closes the screen as Graham gently releases the handle  Stepping back from the door his keen eye scans from left to right  He turns and treads calmly along the wooden veranda surrounding the house  Reaching the closed window he stops and looks through the glass into an office where the compact ruin is deserted and the solid dark wood desk is clattered with papers  Graham's gaze alights on a wooden chair lying upturned on the floor beside the lampshade with its toppled vase on a small round table above and the naked bulb still glowing brightly viewing the scene with restrained alarm  Then backing away he turns and spots the brown Chevy 4x4 parked on a short driveway with a figure at the wheel  Graham approaches the vehicle cautiously across a lawn leaning over to get a view of its occupant  while Morgan and Bo look on  On one page is a simple sketch of an extraterrestrial with a teardropshaped head and large catlike eyes  On another page is a picture of a blueygreen alien with an angular jaw and black almondshaped eyes  On a third page a gloomy nighttime drawing depicts a UFO firing two red laser beams into a wooden farmhouse which is on fire with flames pouring from the upstairs windows  Lying on the lawn of the pictured house are three shadowy bodies an adult and two children  Morgan and Bo are staring at the picture as Graham's eyes flick pensively from side to side and they all jump back  Taking the book he leaves and answers the phone  on the landing  Graham stands stock still with the telephone receiver still pressed to his ear and glances down the landing into a room containing a dressmaker's dummy  Now clothed Graham plods downstairs takes a coat from the closet where Merrill is still glued to the TV and then picks up some keys  Merrill looks confused  From the bedroom Morgan is looking at clouds through a telescope as Bo stands beside him  Bo nods with a worried expression gives a slow deliberate nod hugs his arm and avoids eye contact  Graham knocks at the house of Vet Ray Reddy  He opens the screen door peers through slats in the wooden door behind it then gingerly closes the screen as Graham gently releases the handle  Stepping back from the door his keen eye scans from left to right  He turns and treads calmly along the wooden veranda surrounding the house  Reaching the closed window he stops and looks through the glass into an office where the compact ruin is deserted and the solid dark wood desk is clattered with papers  Graham's gaze alights on a wooden chair lying upturned on the floor beside the lampshade with its toppled vase on a small round table above and the naked bulb still glowing brightly viewing the scene with restrained alarm  Then backing away he turns and spots the brown Chevy 4x4 parked on a short driveway with a figure at the wheel  Graham approaches the vehicle cautiously across a lawn leaning over to get a view of its occupant  The passenger side window is lowered as Graham puts both hands on the sill and leans in with an inquisitive frown  Ray the Asian man who stayed in town sits with one hand clamped to the steering wheel rocking nervously and staring numbly ahead  In the back are bundles of clothes which Graham eyes questioningly  Returning his attention to the front he notices a blood stain on Ray's check shirt"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Bo points at it and Graham falters. opening the book. Graham looks uncertain nodding dubiously as he takes the book from Morgan and starts to leaf through the pages. while Morgan and Bo look on. On one page is a simple sketch of an extraterrestrial with a teardropshaped head and large catlike eyes. On another page is a picture of a blueygreen alien with an angular jaw and black almondshaped eyes. On a third page a gloomy nighttime drawing depicts a UFO firing two red laser beams into a wooden farmhouse which is on fire with flames pouring from the upstairs windows. Lying on the lawn of the pictured house are three shadowy bodies an adult and two children. Morgan and Bo are staring at the picture as Graham's eyes flick pensively from side to side and they all jump back. Taking the book he leaves and answers the phone. on the landing. Graham stands stock still with the telephone receiver still pressed to his ear and glances down the landing into a room containing a dressmaker's dummy. Now clothed Graham plods downstairs takes a coat from the closet where Merrill is still glued to the TV and then picks up some keys. Merrill looks confused. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. From the bedroom Morgan is looking at clouds through a telescope as Bo stands beside him. Bo nods with a worried expression gives a slow deliberate nod hugs his arm and avoids eye contact. Graham knocks at the house of Vet Ray Reddy. He opens the screen door peers through slats in the wooden door behind it then gingerly closes the screen as Graham gently releases the handle. Stepping back from the door his keen eye scans from left to right. He turns and treads calmly along the wooden veranda surrounding the house. Reaching the closed window he stops and looks through the glass into an office where the compact ruin is deserted and the solid dark wood desk is clattered with papers. Graham's gaze alights on a wooden chair lying upturned on the floor beside the lampshade with its toppled vase on a small round table above and the naked bulb still glowing brightly viewing the scene with restrained alarm. Then backing away he turns and spots the brown Chevy 4x4 parked on a short driveway with a figure at the wheel. Graham approaches the vehicle cautiously across a lawn leaning over to get a view of its occupant. The passenger side window is lowered as Graham puts both hands on the sill and leans in with an inquisitive frown. Ray the Asian man who stayed in town sits with one hand clamped to the steering wheel rocking nervously and staring numbly ahead. In the back are bundles of clothes which Graham eyes questioningly. Returning his attention to the front he notices a blood stain on Ray's check shirt."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Bo points at it and Graham falters. opening the book. Graham looks uncertain nodding dubiously as he takes the book from Morgan and starts to leaf through the pages. while Morgan and Bo look on. On one page is a simple sketch of an extraterrestrial with a teardropshaped head and large catlike eyes. On another page is a picture of a blueygreen alien with an angular jaw and black almondshaped eyes. On a third page a gloomy nighttime drawing depicts a UFO firing two red laser beams into a wooden farmhouse which is on fire with flames pouring from the upstairs windows. Lying on the lawn of the pictured house are three shadowy bodies an adult and two children. Morgan and Bo are staring at the picture as Graham's eyes flick pensively from side to side and they all jump back. Taking the book he leaves and answers the phone. on the landing. Graham stands stock still with the telephone receiver still pressed to his ear and glances down the landing into a room containing a dressmaker's dummy. Now clothed Graham plods downstairs takes a coat from the closet where Merrill is still glued to the TV and then picks up some keys. Merrill looks confused. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. From the bedroom Morgan is looking at clouds through a telescope as Bo stands beside him. Bo nods with a worried expression gives a slow deliberate nod hugs his arm and avoids eye contact. Graham knocks at the house of Vet Ray Reddy. He opens the screen door peers through slats in the wooden door behind it then gingerly closes the screen as Graham gently releases the handle. Stepping back from the door his keen eye scans from left to right. He turns and treads calmly along the wooden veranda surrounding the house. Reaching the closed window he stops and looks through the glass into an office where the compact ruin is deserted and the solid dark wood desk is clattered with papers. Graham's gaze alights on a wooden chair lying upturned on the floor beside the lampshade with its toppled vase on a small round table above and the naked bulb still glowing brightly viewing the scene with restrained alarm. Then backing away he turns and spots the brown Chevy 4x4 parked on a short driveway with a figure at the wheel. Graham approaches the vehicle cautiously across a lawn leaning over to get a view of its occupant. The passenger side window is lowered as Graham puts both hands on the sill and leans in with an inquisitive frown. Ray the Asian man who stayed in town sits with one hand clamped to the steering wheel rocking nervously and staring numbly ahead. In the back are bundles of clothes which Graham eyes questioningly. Returning his attention to the front he notices a blood stain on Ray's check shirt."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Bo points at it and Graham falters. opening the book. Graham looks uncertain nodding dubiously as he takes the book from Morgan and starts to leaf through the pages. while Morgan and Bo look on. On one page is a simple sketch of an extraterrestrial with a teardropshaped head and large catlike eyes. On another page is a picture of a blueygreen alien with an angular jaw and black almondshaped eyes. On a third page a gloomy nighttime drawing depicts a UFO firing two red laser beams into a wooden farmhouse which is on fire with flames pouring from the upstairs windows. Graham's gaze alights on a wooden chair lying upturned on the floor beside the lampshade with its toppled vase on a small round table above and the naked bulb still glowing brightly viewing the scene with restrained alarm. Then backing away he turns and spots the brown Chevy 4x4 parked on a short driveway with a figure at the wheel. Graham approaches the vehicle cautiously across a lawn leaning over to get a view of its occupant. The passenger side window is lowered as Graham puts both hands on the sill and leans in with an inquisitive frown. Ray the Asian man who stayed in town sits with one hand clamped to the steering wheel rocking nervously and staring numbly ahead. In the back are bundles of clothes which Graham eyes questioningly. Returning his attention to the front he notices a blood stain on Ray's check shirt."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Bo points at it and Graham falters. opening the book. Graham looks uncertain nodding dubiously as he takes the book from Morgan and starts to leaf through the pages. Ray the Asian man who stayed in town sits with one hand clamped to the steering wheel rocking nervously and staring numbly ahead. In the back are bundles of clothes which Graham eyes questioningly. Returning his attention to the front he notices a blood stain on Ray's check shirt."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A cat points at it, and a robot falters, opening the book. The robot looks uncertain, nodding dubiously as it takes the book from a dog and starts to leaf through the pages, while the dog and a cat look on. On one page is a simple sketch of an extraterrestrial with a teardrop-shaped head and large catlike eyes. On another page is a picture of a bluey-green alien with an angular jaw and black almond-shaped eyes. On a third page, a gloomy nighttime drawing depicts a UFO firing two red laser beams into a wooden farmhouse, which is on fire, with flames pouring from the upstairs windows. Lying on the lawn of the pictured house are three shadowy bodies, an adult and two children. The dog and a cat are staring at the picture as the robot's eyes flick pensively from side to side, and they all jump back. Taking the book, a tree leaves and answers the phone on the landing. The robot stands stock still with the telephone receiver still pressed to its ear and glances down the landing into a room containing a dressmaker's dummy. Now clothed, the robot plods downstairs, takes a coat from the closet where a squirrel is still glued to the TV, and then picks up some keys. The squirrel looks confused. From the bedroom, a dog is looking at clouds through a telescope as a cat stands beside it. A cat nods with a worried expression, gives a slow deliberate nod, hugs its arm, and avoids eye contact. The robot knocks at the house of Vet Ray Reddy. It opens the screen door, peers through slats in the wooden door behind it, then gingerly closes the screen as the robot gently releases the handle. Stepping back from the door, its keen eye scans from left to right. It turns and treads calmly along the wooden veranda surrounding the house. Reaching the closed window, it stops and looks through the glass into an office, where the compact ruin is deserted, and the solid dark wood desk is clattered with papers. The robot's gaze alights on a wooden chair lying upturned on the floor beside the lampshade, with its toppled vase on a small round table above and the naked bulb still glowing brightly, viewing the scene with restrained alarm. Then, backing away, it turns and spots the brown Chevy 4x4 parked on a short driveway with a figure at the wheel. The robot approaches the vehicle cautiously across a lawn, leaning over to get a view of its occupant. The passenger side window is lowered as the robot puts both hands on the sill and leans in with an inquisitive frown. A ghost, the Asian man who stayed in town, sits with one hand clamped to the steering wheel, rocking nervously and staring numbly ahead. In the back are bundles of clothes which the robot eyes questioningly. Returning its attention to the front, it notices a blood stain on the ghost's check shirt."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Bo points at it, and Graham falters, opening the journal. Graham looks uncertain, nodding dubiously as he takes the journal from Morgan and starts to leaf through the recipes, while Morgan and Bo look on. On one page is a simple sketch of a mythical creature with a diamond-shaped head and large owlish eyes. On another page is a picture of a maroon-and-gold creature with a square jaw and white grapefruit-shaped eyes. On a third page, a gloomy nighttime drawing depicts a biplane firing two blue water jets into a stone cottage, which is on fire, with smoke pouring from the upstairs windows. Lying on the beach of the pictured cottage are three shadowy figures, an elder and two teens. Morgan and Bo are staring at the picture as Graham's eyes flick pensively from side to side, and they all jump back. Taking the journal, he leaves and answers the phone on the hallway. Graham stands stock still with the telephone receiver still pressed to his ear and glances down the hallway into a room containing a coat rack. Now dressed, Graham plods downstairs, takes a scarf from the coat rack where Merrill is still glued to the computer, and then picks up some glasses. Merrill looks confused. From the study, Morgan is looking at stars through binoculars as Bo stands beside him. Bo nods with a worried expression, gives a slow deliberate nod, hugs his arm, and avoids eye contact. Graham knocks at the barn of Vet Ray Reddy. He opens the flap door, peers through slats in the wooden door behind it, then gingerly closes the flap as Graham gently releases the handle. Stepping back from the door, his keen eye scans from left to right. He turns and treads calmly along the stone patio surrounding the barn. Reaching the closed skylight, he stops and looks through the glass into a workshop, where the compact chaos is deserted, and the solid metal workbench is cluttered with tools. Graham's gaze alights on a metal stool lying upturned on the floor beside the lampshade, with its toppled urn on a small square table above and the naked bulb still glowing brightly, viewing the scene with restrained alarm. Then, backing away, he turns and spots the blue Volkswagen sedan parked on a gravel path with a figure at the wheel. Graham approaches the vehicle cautiously across a garden, leaning over to get a view of its occupant. The passenger side window is lowered as Graham puts both hands on the sill and leans in with an inquisitive frown. Ray, the Pacific Islander who stayed in town, sits with one hand clamped to the steering wheel, rocking nervously and staring numbly ahead. In the back are bundles of blankets which Graham eyes questioningly. Returning his attention to the front, he notices a muddy stain on Ray's flannel jacket."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Bo gestures at it, and Graham hesitates, closing the book. Graham feels uncertain, shaking his head doubtfully as he hands the book to Morgan and begins to skim through the pages, while Morgan and Bo observe. On one page is a simple outline of an extraterrestrial with a teardrop-shaped head and large catlike eyes. On another page is an image of a bluey-green alien with an angular jaw and black almond-shaped eyes. On a third page, a dreary nighttime scene depicts a UFO spraying two red streams of light into a wooden farmhouse, which is smoldering, with smoke wafting from the upstairs windows. Sprawled on the lawn of the depicted house are three shadowy figures, an adult and two children. Morgan and Bo are gazing at the picture as Graham's eyes move contemplatively from side to side, and they all recoil. Handing over the book, he departs and hangs up the phone on the landing. Graham stands immobile with the telephone receiver still resting against his ear and glances down the landing into a room containing a dressmaker's dummy. Now clothed, Graham ambles downstairs, retrieves a coat from the closet where Merrill is still engrossed in the TV, and then grabs some keys. Merrill seems perplexed. From the bedroom, Morgan is peering at clouds through a telescope as Bo stands beside him. Bo shakes his head with a worried expression, gives a slow deliberate head shake, holds his arm, and avoids eye contact. Graham taps at the house of Vet Ray Reddy. He opens the screen door, peers through slats in the wooden door behind it, then gradually closes the screen as Graham lightly touches the handle. Retreating from the door, his sharp eye surveys from left to right. He pivots and walks steadily along the wooden veranda surrounding the house. Reaching the closed window, he halts and peers through the glass into an office, where the compact ruin is deserted, and the solid dark wood desk is cluttered with papers. Graham's gaze settles on a wooden chair resting on the floor beside the lampshade, with its fallen vase on a small round table above and the bare bulb still glowing brightly, regarding the scene with subdued concern. Then, withdrawing, he turns and notices the brown Chevy 4x4 parked on a short driveway with a figure at the wheel. Graham nears the vehicle cautiously across a lawn, leaning over to get a view of its occupant. The passenger side window is raised as Graham places both hands on the sill and leans in with a curious frown. Ray, the Asian man who stayed in town, sits with one hand grasping the steering wheel, swaying anxiously and staring blankly ahead. In the back are bundles of clothes which Graham observes inquisitively. Redirecting his attention to the front, he spots a blood stain on Ray's check shirt."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Leo points at it, and Riley falters, opening the magazine. Riley looks uncertain, nodding dubiously as he takes the magazine from Jordan and starts to leaf through the articles, while Jordan and Leo look on. On one page is a simple sketch of a mythical creature with a teardrop-shaped head and large catlike eyes. On another page is a picture of a red-blue dragon with an angular jaw and black almond-shaped eyes. On a third page, a gloomy nighttime drawing depicts a spaceship firing two red laser beams into a wooden castle, which is on fire, with smoke pouring from the upstairs windows. Lying on the lawn of the pictured castle are three shadowy figures, an adult and two animals. Jordan and Leo are staring at the picture as Riley's eyes flick pensively from side to side, and they all jump back. Taking the magazine, he leaves and answers the horn on the balcony. Riley stands stock still with the horn receiver still pressed to his ear and glances down the balcony into a room containing a tailor's mannequin. Now clothed, Riley plods downstairs, takes a cape from the cupboard where Taylor is still glued to the monitor, and then picks up some tokens. Taylor looks perplexed. From the chamber, Jordan is looking at mountains through a periscope as Leo stands beside him. Leo nods with a worried expression, gives a slow deliberate nod, hugs his arm, and avoids eye contact. Riley knocks at the abode of Chef Max Perry. He opens the screen window, peers through slats in the wooden gate behind it, then gingerly closes the screen as Riley gently releases the latch. Stepping back from the gate, his keen eye scans from left to right. He turns and treads calmly along the wooden porch surrounding the abode. Reaching the closed portal, he stops and looks through the glass into a study, where the compact chaos is deserted, and the solid elm cabinet is clattered with journals. Riley's gaze alights on a wooden armchair lying upturned on the floor beside the lampshade, with its toppled pitcher on a small oval table above and the naked bulb still glowing brightly, viewing the scene with restrained alarm. Then, backing away, he turns and spots the green van parked on a short pathway with a silhouette at the helm. Riley approaches the carriage cautiously across a yard, leaning over to get a view of its rider. The rider's side window is lowered as Riley puts both hands on the sill and leans in with an inquisitive frown. Max, the European man who stayed in the village, sits with one hand clamped to the steering gear, rocking nervously and staring numbly ahead. In the rear are bundles of fabric which Riley eyes questioningly. Returning his attention to the front, he notices a mud stain on Max's plaid vest."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Bo gestures at it, and Graham hesitates, closing the book. Graham looks suspicious, shaking his head skeptically as he hands the book to Morgan and begins to skim through the pages, while Morgan and Bo observe. On one page is a simple sketch of a mythological creature with a diamond-shaped head and large owl-like eyes. On another page is a picture of a red-orange monster with a rounded chin and white circular eyes. On a third page, a vibrant daytime drawing depicts a dragon breathing two green fire streams onto a brick barn, which is ablaze, with smoke billowing from the downstairs windows. Lying on the porch of the pictured barn are three faint bodies, an elder and two teenagers. Morgan and Bo are studying the image as Graham's eyes dart cautiously from side to side, and they all recoil. Dropping the book, he stays and ignores the door on the landing. Graham stands immobile with the telephone receiver still hovering near his chin and glances up the stairs into a room containing a mannequin. Now unclothed, Graham ambles upstairs, hangs a coat in the closet where Merrill is still glued to the window, and then drops some coins. Merrill looks perplexed. From the attic, Morgan is peering at stars through binoculars as Bo stands beside him. Bo shakes his head with a relieved expression, gives a quick involuntary nod, pats his shoulder, and maintains eye contact. Graham taps at the door of Farmer Ray Reddy. He closes the screen door, peeks through slats in the wooden fence behind it, then briskly opens the screen as Graham abruptly drops the handle. Lunging forward from the door, his sharp nose scans from right to left. He turns and strides briskly across the wooden porch surrounding the office. Reaching the open window, he halts and squints through the glass into the kitchen, where the spacious mess is bustling, and the light brown mahogany desk is scattered with folders. Graham's stare settles on a metal bench lying upside down on the ground beside the curtain, with its chipped vase on a large oval shelf below and the dim lightbulb still flickering softly, assessing the scene with growing curiosity. Then, moving closer, he turns and notices the red Ford pickup parked on a long street with a child at the wheel. Graham approaches the vehicle quickly across the sidewalk, squatting down to get a view of its driver. The driver's side window is raised as Graham puts both feet on the tires and leans in with a suspicious smile. Ray, the European woman who visited town, sits with one foot tapping on the dashboard, bobbing eagerly and glancing distractedly aside. In the front are piles of books which Graham scrutinizes doubtfully. Redirecting his gaze to the back, he spots a tear on Ray's denim jacket."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Bo gestures at it, and Graham hesitates, unwrapping the parcel. Graham looks unsure, shaking his head skeptically as he receives the parcel from Morgan and begins to flick through the contents, while Morgan and Bo observe intently. On one side is a basic diagram of a robotic figure with a hexagon-shaped head and large owl-like eyes. On another side is an image of a coral-colored robot with a triangular chin and red diamond-shaped eyes. On a third side, a somber evening painting illustrates a drone releasing two yellow streamers onto a brick cottage, which is ablaze, with sparks streaming from the attic apertures. Resting on the grass of the depicted property are three indistinct forms, an adult and two young ones. Morgan and Bo are fixated on the painting as Graham's eyes dart cautiously from corner to corner, and they all leap backward. Holding the parcel, he departs and listens to the radio on the staircase. Graham stands frozen with the headset still pressed to his ear and peers down the staircase into a chamber containing a tailor's form. Now clad, Graham ambles downstairs, retrieves a scarf from the wardrobe where Merrill is still engrossed in the stereo, and then picks up a pair of goggles. Merrill looks perplexed. From the study, Morgan is observing clouds through a periscope as Bo stands next to him. Bo shakes his head with concern, gives a slow considerate shake, squeezes his elbow, and avoids direct gaze. Graham taps at the residence of Doctor Ray Reddy. He unhooks the screen gate, squints through gaps in the wooden gate behind it, then cautiously shuts the screen as Graham leisurely releases the lever. Stepping away from the gate, his discerning gaze sweeps from side to side. He pivots and strolls softly along the wooden porch encircling the residence. Arriving at the closed shutter, he pauses and peers through the glass into a workstation, where the compact disarray is empty, and the heavy dark timber desk is strewn with scrolls. Graham's glance falls on a wooden stool lying overturned on the floor beside the chandelier, with its toppled jug on a small circular stand above and the bare bulb still shining brightly, regarding the scene with contained surprise. Then, retreating, he pivots and spots the maroon Jeep 4x4 parked on a narrow pathway with a silhouette at the helm. Graham makes his way towards the automobile carefully across a meadow, leaning over to get a glimpse of its tenant. The passenger side shutter is lowered as Graham places both hands on the ledge and leans in with a curious squint. Ray, the Asian man who lingered in town, sits with one hand gripping the dashboard, swaying anxiously and staring blankly forward. In the rear are stacks of blankets which Graham eyes quizzically. Returning his focus to the front, he notices a smear of mud on Ray's plaid jacket."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Trevor signals at it, and Millie hesitates, unlocking the suitcase. Millie looks doubtful, shaking her head slightly as she grabs the suitcase from Jamie and begins to sift through the envelopes, while Jamie and Trevor observe. On one envelope is a straightforward doodle of a mythical creature with a hexagonal-shaped body and enormous owl-like feathers. On another envelope is an image of a yellow-orange monster with a rounded beak and glaring triangle-shaped pupils. On a third envelope, a murky dawn depiction shows a spaceship launching three blue lightning bolts into a concrete tower, which is ablaze, with smoke billowing from the ground-level windows. Sprawled in the garden of the illustrated home are two blurry mannequins, one elder and one infant. Jamie and Trevor are gazing at the image as Millie’s eyes dart warily from place to place, and they all spring back. Grabbing the suitcase, she exits and answers the horn on the balcony. Millie stands perfectly still with the trumpet still pressed to her lip and peers down the balcony into a chamber containing a cobbler's mannequin. Now dressed, Millie trudges upstairs, grabs a sweater from the drawer where Nigel is still affixed to the radio, and then seizes some books. Nigel appears perplexed. From the attic, Jamie is gazing at stars through binoculars as Trevor stands beside him. Trevor shakes his head with a startled expression, offers a rapid cursory shake, pats his shoulder, and looks away. Millie taps at the window of Dr. Steve Yung. He opens the porch door, glances through holes in the steel hatch behind it, then cautiously shuts the hatch as Millie silently releases the knob. Stepping forward to the porch, her quick glance scans from corner to corner. She pivots and strides briskly along the marble veranda facing the garage. Reaching the open hatch, she pauses and peers through the glass into a studio, where the massive wreckage is vacant, and the glossy black iron shelf is crammed with sketches. Millie’s gaze settles on a stone stool lying overturned on the ceiling beside the chandelier, with its broken pot on a vast rectangular sofa below and the covered bulb still flickering dimly, assessing the scene with muted surprise. Then, inching forward, she pivots and notices the white sedan parked on a slanted highway with a person at the steering column. Millie advances toward the bicycle slowly across a sidewalk, bending over to glimpse its driver. The driver's seat hatch is lifted as Millie places one elbow on the edge and peers inside with a curious smirk. Steve, the European woman who stayed nearby, sits with one knee clutched to the armrest, shaking quietly and gazing blankly elsewhere. In the trunk are piles of newspapers which Millie examines inquisitively. Shifting her focus to the back, she observes a smear on Steve’s denim vest."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Graham takes a book from Morgan, inspecting its pages depicting aliens and a UFO setting a farmhouse ablaze, with three shadowy bodies lying outside. Disturbed, Graham picks up a phone, but stands still, glancing at a dressmaker's dummy. Downstairs, he dons a coat as Merrill stays glued to the TV. Meanwhile, Morgan, looking through a telescope, shares a worried glance with Bo. Graham knocks at Vet Ray Reddy's house but finds it deserted, with a chaotic office visible through a window. His focus shifts to Ray's parked Chevy 4x4. Approaching cautiously, he finds Ray inside, nervously gripping the wheel with a bloodstained shirt, while bundles of clothes lie in the back."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Returning his attention to the front he notices a blood stain on Ray's check shirt In the back are bundles of clothes which Graham eyes questioningly  Ray the Asian man who stayed in town sits with one hand clamped to the steering wheel rocking nervously and staring numbly ahead  The passenger side window is lowered as Graham puts both hands on the sill and leans in with an inquisitive frown  Graham approaches the vehicle cautiously across a lawn leaning over to get a view of its occupant  Then backing away he turns and spots the brown Chevy 4x4 parked on a short driveway with a figure at the wheel  Graham's gaze alights on a wooden chair lying upturned on the floor beside the lampshade with its toppled vase on a small round table above and the naked bulb still glowing brightly viewing the scene with restrained alarm  Reaching the closed window he stops and looks through the glass into an office where the compact ruin is deserted and the solid dark wood desk is clattered with papers  He turns and treads calmly along the wooden veranda surrounding the house  Stepping back from the door his keen eye scans from left to right  He opens the screen door peers through slats in the wooden door behind it then gingerly closes the screen as Graham gently releases the handle  Graham knocks at the house of Vet Ray Reddy  Bo nods with a worried expression gives a slow deliberate nod hugs his arm and avoids eye contact  From the bedroom Morgan is looking at clouds through a telescope as Bo stands beside him  Merrill looks confused  Now clothed Graham plods downstairs takes a coat from the closet where Merrill is still glued to the TV and then picks up some keys  Graham stands stock still with the telephone receiver still pressed to his ear and glances down the landing into a room containing a dressmaker's dummy  on the landing  Taking the book he leaves and answers the phone  Morgan and Bo are staring at the picture as Graham's eyes flick pensively from side to side and they all jump back  Lying on the lawn of the pictured house are three shadowy bodies an adult and two children  On a third page a gloomy nighttime drawing depicts a UFO firing two red laser beams into a wooden farmhouse which is on fire with flames pouring from the upstairs windows  On another page is a picture of a blueygreen alien with an angular jaw and black almondshaped eyes  On one page is a simple sketch of an extraterrestrial with a teardropshaped head and large catlike eyes  while Morgan and Bo look on  Graham looks uncertain nodding dubiously as he takes the book from Morgan and starts to leaf through the pages  opening the book  Bo points at it and Graham falters "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Then backing away he turns and spots the brown Chevy 4x4 parked on a short driveway with a figure at the wheel  Taking the book he leaves and answers the phone  Lying on the lawn of the pictured house are three shadowy bodies an adult and two children  Stepping back from the door his keen eye scans from left to right  Graham's gaze alights on a wooden chair lying upturned on the floor beside the lampshade with its toppled vase on a small round table above and the naked bulb still glowing brightly viewing the scene with restrained alarm  Bo points at it and Graham falters  Ray the Asian man who stayed in town sits with one hand clamped to the steering wheel rocking nervously and staring numbly ahead  Reaching the closed window he stops and looks through the glass into an office where the compact ruin is deserted and the solid dark wood desk is clattered with papers  On another page is a picture of a blueygreen alien with an angular jaw and black almondshaped eyes  Returning his attention to the front he notices a blood stain on Ray's check shirt Bo nods with a worried expression gives a slow deliberate nod hugs his arm and avoids eye contact  Merrill looks confused  In the back are bundles of clothes which Graham eyes questioningly  Graham knocks at the house of Vet Ray Reddy  He opens the screen door peers through slats in the wooden door behind it then gingerly closes the screen as Graham gently releases the handle  From the bedroom Morgan is looking at clouds through a telescope as Bo stands beside him  opening the book  Morgan and Bo are staring at the picture as Graham's eyes flick pensively from side to side and they all jump back  He turns and treads calmly along the wooden veranda surrounding the house  Graham stands stock still with the telephone receiver still pressed to his ear and glances down the landing into a room containing a dressmaker's dummy  Graham approaches the vehicle cautiously across a lawn leaning over to get a view of its occupant  Now clothed Graham plods downstairs takes a coat from the closet where Merrill is still glued to the TV and then picks up some keys  Graham looks uncertain nodding dubiously as he takes the book from Morgan and starts to leaf through the pages  while Morgan and Bo look on  on the landing  The passenger side window is lowered as Graham puts both hands on the sill and leans in with an inquisitive frown  On a third page a gloomy nighttime drawing depicts a UFO firing two red laser beams into a wooden farmhouse which is on fire with flames pouring from the upstairs windows  On one page is a simple sketch of an extraterrestrial with a teardropshaped head and large catlike eyes "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "From the bedroom Morgan is looking at clouds through a telescope as Bo stands beside him  Bo nods with a worried expression gives a slow deliberate nod hugs his arm and avoids eye contact  Graham knocks at the house of Vet Ray Reddy  He opens the screen door peers through slats in the wooden door behind it then gingerly closes the screen as Graham gently releases the handle  Stepping back from the door his keen eye scans from left to right  He turns and treads calmly along the wooden veranda surrounding the house  Reaching the closed window he stops and looks through the glass into an office where the compact ruin is deserted and the solid dark wood desk is clattered with papers  Graham's gaze alights on a wooden chair lying upturned on the floor beside the lampshade with its toppled vase on a small round table above and the naked bulb still glowing brightly viewing the scene with restrained alarm  Then backing away he turns and spots the brown Chevy 4x4 parked on a short driveway with a figure at the wheel  Graham approaches the vehicle cautiously across a lawn leaning over to get a view of its occupant  The passenger side window is lowered as Graham puts both hands on the sill and leans in with an inquisitive frown  Ray the Asian man who stayed in town sits with one hand clamped to the steering wheel rocking nervously and staring numbly ahead  In the back are bundles of clothes which Graham eyes questioningly  Returning his attention to the front he notices a blood stain on Ray's check shirt Bo points at it and Graham falters  opening the book  Graham looks uncertain nodding dubiously as he takes the book from Morgan and starts to leaf through the pages  while Morgan and Bo look on  On one page is a simple sketch of an extraterrestrial with a teardropshaped head and large catlike eyes  On another page is a picture of a blueygreen alien with an angular jaw and black almondshaped eyes  On a third page a gloomy nighttime drawing depicts a UFO firing two red laser beams into a wooden farmhouse which is on fire with flames pouring from the upstairs windows  Lying on the lawn of the pictured house are three shadowy bodies an adult and two children  Morgan and Bo are staring at the picture as Graham's eyes flick pensively from side to side and they all jump back  Taking the book he leaves and answers the phone  on the landing  Graham stands stock still with the telephone receiver still pressed to his ear and glances down the landing into a room containing a dressmaker's dummy  Now clothed Graham plods downstairs takes a coat from the closet where Merrill is still glued to the TV and then picks up some keys  Merrill looks confused "
        }
      ]
    }
  ]
}