{
  "ground_truth": "Jamal and Latika stare at each other. The guard presses the intercom and approaches to open the gates. Latika quickly moves inside the house. Jamal enters an expensively furnished marble living room and sees Latika behind the glass partition separating the room from a kitchen and approaches. She removes her dark glasses and stands expectantly as he steps from behind the partition. They both stand stock still, and she takes a sharp intake of breath. She smiles as he moves towards her, then they embrace each other tightly. Suddenly, she looks scared and backs away, and he looks at her shocked. A silver Mercedes pulls up to the house. As Javed steps into the living room, Latika puts an apron over Jamal’s neck. Javed walks straight into the kitchen and levels his malevolent gaze at Latika. He points to the game show on TV, walks into the living room, and sits down in front of a widescreen TV. He switches on the cricket game. Latika nervously prepares a sandwich for Javed. Jamal spreads a concoction of preservatives onto a slice of bread as Latika dumps a limp piece of lettuce on the plate, and Jamal and Latika exchange nervous glances. He grabs her hand. She breaks his hold, lifts the plate, and takes it to Javed. She passes in front of the TV, and Javed shoos her out of the way back to the kitchen. Javed watches the game and throws his drink. Jamal looks pleadingly at Latika. Javed, still transfixed by the cricket game, takes a bite of his sandwich, looks disgusted, and spits it out onto the plate. He walks into the kitchen, glares at Jamal, and goes back to the cricket, swearing under his breath. Latika pushes Jamal toward the door, slowly shakes her head, and pushes him out of the door. He remains in the courtyard looking back at her. Jamal takes a deep breath and raises his eyes upwards. The cricket match replays. He tenses his jaw muscles and hands back the check to the host. Jamal looks out of a train window as it races through the city. The train pulls into a large station, and he jumps off. Hundreds of passengers alight from the train and throng on the platforms. An enormous station clock shows five minutes to five. Now the clock shows five-fifteen. As Jamal moves along the walkway looking down on the platform, he scans the busy platforms and looks at the overhead clock. He rests his head on his hands in despair, then he squats down. Latika appears on the platform, looking around her. Jamal looks up and catches sight of her. He stands up immediately, and she looks very anxious.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Jamal and Latika gaze at one another. The guard depresses the intercom and nears to unlock the gates. Latika swiftly moves inside the residence. Jamal enters an lavishly adorned marble parlor and notices Latika behind the glass barrier separating the room from a kitchen and nears. She removes her dark spectacles and stands expectantly as he steps from behind the barrier. They both stand immobile, and she takes a sharp intake of breath. She grins as he moves towards her, then they clasp one another firmly. Suddenly, she looks frightened and retreats, and he looks at her shocked. A silver Mercedes pulls up to the residence. As Javed steps into the parlor, Latika places an apron over Jamal’s neck. Javed strides directly into the kitchen and levels his malevolent stare at Latika. He gestures to the game show on TV, strides into the parlor, and sits down in front of a widescreen television. He activates the cricket match. Latika nervously prepares a sandwich for Javed. Jamal spreads a mixture of preservatives onto a slice of bread as Latika dumps a limp piece of lettuce on the platter, and Jamal and Latika swap nervous glances. He grasps her hand. She breaks his grip, lifts the platter, and takes it to Javed. She passes in front of the television, and Javed shoos her out of the path back to the kitchen. Javed observes the match and throws his beverage. Jamal looks pleadingly at Latika. Javed, still riveted by the cricket match, takes a bite of his sandwich, looks disgusted, and expels it onto the platter. He strides into the kitchen, glares at Jamal, and returns to the cricket, swearing under his breath. Latika pushes Jamal toward the threshold, slowly shakes her head, and urges him out of the threshold. He remains in the courtyard staring back at her. Jamal takes a deep breath and raises his eyes skyward. The cricket match replays. He tightens his jaw muscles and hands back the cheque to the host. Jamal looks out of a train window as it races through the metropolis. The train pulls into a large terminus, and he leaps off. Hundreds of travelers alight from the train and throng on the platforms. An enormous station clock displays five minutes to five. Now the clock displays five-fifteen. As Jamal moves along the walkway gazing down on the platform, he surveys the bustling platforms and looks at the overhead clock. He rests his head on his hands in despair, then he squats down. Latika appears on the platform, looking around her. Jamal looks up and catches glimpse of her. He stands up immediately, and she looks very anxious."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Each other is stared at by Jamal and Latika. The intercom is pressed by the guard, and the gates are approached to be opened by him. The house is quickly moved into by Latika. An expensively furnished marble living room is entered by Jamal, who sees Latika behind the glass partition separating the room from a kitchen, and she is approached by him. Her dark glasses are removed by her, and she stands expectantly as he steps from behind the partition. Stock still, they both stand, and a sharp intake of breath is taken by her. A smile is given by her as he moves towards her, then they are embraced tightly by each other. Suddenly, a scared look appears on her face, and she backs away, shocking him. A silver Mercedes is pulled up to the house by someone. As the living room is stepped into by Javed, an apron is put over Jamal’s neck by Latika. Straight into the kitchen is walked by Javed, and his malevolent gaze levels at Latika. The game show on TV is pointed to by him, and he walks into the living room, sitting down in front of a widescreen TV. The cricket game is switched on by him. Nervously, a sandwich for Javed is prepared by Latika. A concoction of preservatives is spread onto a slice of bread by Jamal as a limp piece of lettuce is dumped on the plate by Latika, and nervous glances are exchanged by Jamal and Latika. Her hand is grabbed by him. His hold is broken by her as the plate is lifted, and it is taken to Javed by her. The TV is passed in front of by her, and she is shooed out of the way back to the kitchen by Javed. The game is watched by Javed, and the drink is thrown by him. A pleading look is given by Jamal to Latika. Still transfixed by the cricket game, Javed takes a bite of his sandwich, finds it disgusting, and spits it out onto the plate. The kitchen is walked into by him, Jamal is glared at, and swearing under his breath, he goes back to the cricket. Jamal is pushed toward the door by Latika, and her head is slowly shaken as he is pushed out of the door. In the courtyard, he remains looking back at her. A deep breath is taken by Jamal, and his eyes are raised upwards. The cricket match is replayed. His jaw muscles are tensed, and the check is handed back to the host by him. Out of a train window, Jamal looks as the train races through the city. A large station is pulled into by the train, and he jumps off. Hundreds of passengers alight from the train and throng on the platforms. Five minutes to five is shown by an enormous station clock. Now, five-fifteen is shown by the clock. Along the walkway, Jamal moves, looking down on the platform, scanning the busy platforms and looking at the overhead clock. In despair, his head is rested on his hands by him, then he squats down. On the platform, Latika appears, looking around her. Upward is Jamal looking, and he catches sight of her. Up immediately, he stands, and a very anxious look is seen on her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Jamal and Latika exchange glances as a guard opens the gates. Latika rushes inside, and Jamal enters a marble-furnished living room, seeing her behind a glass partition in the kitchen. She removes her sunglasses, and they stand still before she smiles. As they embrace, she suddenly looks scared, backing away as a silver Mercedes arrives. Javed enters, and Latika nervously prepares a sandwich while Jamal helps, exchanging worried glances. She serves Javed, who watches cricket on TV. Displeased with the sandwich, Javed spits it out, glares at Jamal, curses under his breath, and returns to watching cricket. Latika pushes Jamal toward the door, shaking her head, and he exits, looking back at her. In the courtyard, Jamal takes a deep breath and hands back a check to the host. On a train, he gazes out at the city and jumps off at a busy station showing five minutes to five. As the clock moves to five-fifteen, Jamal scans the platforms in despair. Latika appears, and he immediately stands upon seeing her, noting her anxious expression."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Jamal and Latika stare at each other. The guard presses the intercom and opens the gates. Latika enters the house quickly. Jamal enters a lavish marble living room, sees Latika behind a glass partition leading to a kitchen, and approaches. She removes her glasses and stands expectantly as he steps forward. They remain still, she breathes sharply, smiles, and they embrace tightly. Suddenly, she looks scared and backs away, shocking Jamal. A silver Mercedes arrives. Javed enters the living room, and Latika puts an apron on Jamal. Javed glares at Latika, points at the TV game show, and switches it to cricket. Nervously, Latika prepares a sandwich, Jamal spreads preservatives, and they exchange worried glances. She takes the sandwich to Javed, who shoos her away. Javed watches the game, spits out the sandwich in disgust, glares at Jamal, and returns to the game, swearing. Latika pushes Jamal toward the door, shaking her head, and he exits, looking back. Jamal takes a deep breath and returns the check to the host. He looks out of a train window racing through the city, disembarks at a large station at five-fifteen, and scans the platform in despair. Latika appears, looking around anxiously, and Jamal stands up immediately."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Jamal and Latika find themselves in a moment of fixed attention, staring deeply into each other's eyes. Meanwhile, the guard presses the intercom button, initiating communication, and then makes his way over to the gates to unlock and open them. In a swift motion, Latika hurries inside the house, leaving Jamal to enter next. Upon stepping inside, Jamal finds himself in a lavishly decorated living room, the floor gleaming with expensive marble. His gaze shifts to see Latika standing behind a glass partition which separates this plush room from the adjacent kitchen, and he moves towards her.\n\nAs Latika removes her dark sunglasses, she stands with an air of expectation, watching Jamal closely as he emerges from behind the glass divide. Both of them remain utterly still, almost statuesque, until she suddenly draws in a sharp breath. She breaks into a smile as Jamal walks closer, and they warmly embrace each other in a tight, affectionate hug. But the moment shifts abruptly; Latika's expression turns to one of fear, and she steps back, causing Jamal to look at her in bewilderment. Just then, a sleek silver Mercedes comes to a stop in front of the house.\n\nJaved makes his entrance into the living room, prompting Latika, in a nervous gesture, to place an apron over Jamal's neck. Without delay, Javed strides purposefully into the kitchen, casting a menacing look at Latika. He gestures disdainfully towards the game show displayed on the television before he moves to the living room to settle himself in front of an enormous widescreen TV. Once seated, he switches the channel to a live cricket match.\n\nLatika, visibly tense, begins to prepare a simple sandwich for Javed. Jamal, in coordination, spreads a mixture of preservatives onto a slice of bread, while Latika adds a slightly wilted piece of lettuce onto the plate. They exchange anxious looks, their nerves apparent. In a gesture of support, Jamal reaches for her hand, but she gently breaks away, grabs the plate, and carries it over to Javed. As she walks past the TV, Javed dismissively shoos her away to return to the kitchen.\n\nFocused on the cricket game, Javed casually throws his drink, displaying his impatience. Jamal, sensing the tension, looks at Latika with a pleading expression. Javed, still engrossed by the game, bites into the sandwich, scrunches up his face in distaste, and spits it out with dissatisfaction. He storms into the kitchen, glaring at Jamal with hostility before returning to the cricket broadcast, muttering curses under his breath. \n\nLatika, understanding the precarious situation, subtly pushes Jamal towards the door. She shakes her head slowly and steadily, indicating that he must leave, and gently but firmly ushers him out. Once outside, Jamal lingers in the courtyard, casting a longing glance back at her. He draws in a deep breath, a mix of anxiety and determination crossing his features, before lifting his eyes upwards in contemplation. Meanwhile, the cricket match continues on the screen.\n\nJamal's thoughts race, evident as he tightens his jaw muscles. He returns the check to the host, signaling his resolve. The scene shifts to him gazing out of a train window, watching the urban landscape blur by as the train speeds through the bustling city. When the train duly arrives at a large, busy station, Jamal jumps off among the flood of passengers disembarking onto the crowded platforms. An enormous station clock looms overhead, showing five minutes to five. A short while later, time advances to five-fifteen.\n\nAs Jamal makes his way along a raised walkway, he scans the packed platforms below, his eyes frequently darting to the overhead clock, reflecting his anxious thoughts. He eventually lowers his head into his hands, succumbing to a moment of despair, then sinks into a squat. Suddenly, Latika appears on the platform, her eyes scanning the crowd. Jamal, spotting her, leaps to his feet in an instant. Latika, looking noticeably anxious, locks eyes with him, bringing a new energy to their reunion."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Jamal and Latika find themselves caught in an intense, focused moment of fixed attention, completely absorbed as they stare deeply into each other's eyes. Meanwhile, nearby, the guard decisively presses the intercom button, initiating a line of communication, and then methodically makes his way over to the gates to unlock and swing them open. In a swift, fluid motion, Latika hurriedly makes her way inside the house, leaving Jamal to follow closely behind. Upon stepping inside, Jamal finds himself in a lavishly decorated living room, the floor gleaming brilliantly with luxurious, expensive marble. His gaze shifts slightly to notice Latika standing behind a glass partition that beautifully separates this plush, opulent room from the adjacent, well-appointed kitchen, and he moves with a sense of purpose towards her.\n\nAs Latika removes her dark sunglasses, she stands expectantly, exuding an air of anticipation while watching Jamal closely as he emerges from behind the glass divide. Both of them remain utterly still, almost statuesque in their posture, until she suddenly draws in a sharp, audible breath. She then breaks into a radiant smile as Jamal draws closer, and they warmly embrace each other in a tight, affectionate hug that speaks volumes. But the tender moment shifts abruptly; Latika's expression transforms into one of sudden fear, and she steps back, causing Jamal to look at her in sheer bewilderment. Just at that moment, a sleek, silver Mercedes comes to a smooth stop in front of the house.\n\nJaved makes his entrance into the elegantly furnished living room, prompting Latika, in a nervous reflex, to place an apron over Jamal's neck. Without any delay, Javed strides purposefully into the kitchen, casting a menacing, chilling look at Latika. He gestures disdainfully towards the game show being displayed on the television before making his way into the expansive living room to settle himself comfortably in front of an enormous widescreen TV. Once seated, he switches the channel hastily to a live cricket match.\n\nLatika, visibly tense and uneasy, begins to hurriedly prepare a simple sandwich for Javed. Jamal, in coordination with her, spreads a mixture of preservatives onto a slice of bread, while Latika adds a slightly wilted piece of lettuce onto the plate. They exchange anxious, worried looks, their nerves clearly palpable. In a small gesture of support, Jamal reaches for her hand, but she gently breaks away, discreetly grabs the plate, and carries it over to Javed. As she walks past the enormous TV screen, Javed dismissively shoos her away, signaling for her to return to the kitchen.\n\nCompletely focused on the cricket game, Javed casually throws his drink aside in a display of impatience. Jamal, sensing the mounting tension, looks at Latika with a pleading, imploring expression. Javed, still entirely engrossed by the game, bites into the sandwich, then scrunches up his face in utter distaste before spitting it out with dissatisfaction. He storms angrily into the kitchen, glaring hostilely at Jamal before returning to the cricket broadcast, muttering curses under his breath.\n\nLatika, fully understanding the precarious situation, subtly nudges Jamal towards the door. She shakes her head slowly and steadily, silently indicating that he must leave, and gently but firmly ushers him out. Once outside, Jamal lingers in the expansive courtyard, casting a longing, wistful glance back at her. He draws in a deep, contemplative breath, a mix of anxiety and determination crossing his features, before lifting his eyes upwards in thoughtful contemplation. Meanwhile, the cricket match continues to play on the screen.\n\nJamal's thoughts race, evident as he clenches his jaw muscles tightly. He returns the check to the host, signaling his unwavering resolve. The scene then shifts to him gazing out of a train window, watching the urban landscape blur into motion as the train speeds through the bustling, vibrant city. When the train duly arrives at a large, busy station, Jamal jumps off among the flood of passengers disembarking onto the crowded platforms. An enormous station clock looms overhead, its hands showing five minutes to five. A short while later, the time advances quickly to five-fifteen.\n\nAs Jamal makes his way along a raised, narrow walkway, he scans the packed platforms below, his eyes frequently darting to the overhead clock, each glance reflecting his anxious, racing thoughts. He eventually lowers his head into his hands, succumbing to a moment of hopeless despair, before sinking into a dejected squat. Suddenly, Latika appears on the bustling platform, her eyes tirelessly scanning the crowd. Jamal, spotting her instantly, leaps to his feet in an instant. Latika, looking noticeably anxious and tense, locks eyes with him, bringing a fresh, invigorating energy to their much-anticipated reunion."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Jamal and Latika lock eyes, their gazes steady and unbroken, conveying a deep connection. As the guard presses the intercom button, the mechanism buzzes to life, signaling the gates to release. He approaches steadily to open them, and Latika seizes the moment to swiftly move inside the house, her steps light and quick. Jamal follows her entry into the house and finds himself in an opulently decorated marble living room, where he takes a moment to absorb the sheer luxury surrounding him. His eyes are drawn to Latika, who is positioned behind a glass partition that forms a transparent barrier between the living room and the adjacent kitchen, and he instinctively approaches her. Latika, sensing his presence, removes her dark glasses, and stands poised, her demeanor expectant as Jamal steps forward, emerging from behind the partition to join her. Both stand immobilized, seemingly frozen in time, as she inhales sharply, a quick intake of breath that signifies the intensity of the moment. A smile blossoms on her face as Jamal closes the distance between them, leading to a heartfelt embrace where their arms wrap tightly around each other, conveying affection and longing. Abruptly, Latika's expression shifts to one of fear, and she instinctively backs away from Jamal, whose face mirrors her emotion with a look of shock. Outside, a sleek silver Mercedes glides to a halt at the house, its presence ominous. Javed enters the living room with a commanding air, prompting Latika to deftly slip an apron over Jamal's neck, transforming his appearance quickly. Javed strides into the kitchen, his gaze malevolent and unwavering as it fixes on Latika, causing her to tense visibly. He gestures dismissively toward the television displaying a game show before walking back into the living room to settle into a seat before a large widescreen TV. With remote in hand, he switches channels to the cricket game, becoming engrossed in the unfolding match. Meanwhile, Latika, her nerves palpable, begins the task of preparing a sandwich for Javed, each movement deliberate and careful. Jamal assists by spreading a layer of preservatives onto a slice of bread, his actions precise, while Latika adds a limp piece of lettuce to the plate. They exchange nervous, telegraphic glances, their eyes communicating silent messages. In a spontaneous gesture, Jamal reaches for Latika's hand, but she gently breaks his hold, determinedly lifts the prepared plate, and heads to Javed. As she crosses before the TV, Javed impatiently waves her aside, urging her back to the kitchen. Javed, his attention riveted on the game, hurls his drink in frustration as the match intensifies. Jamal, standing nearby, casts a pleading look toward Latika, his expression beseeching for reassurance or guidance. Javed, still captivated by the game, takes an experimental bite of his sandwich, recoils with a look of disgust, and forcefully ejects the contents, spitting them onto the plate. Rising abruptly, he storms into the kitchen, directing a withering glare at Jamal, a silent warning reverberating in the air before he returns to his seat, muttering angrily under his breath. Confronted with the tension, Latika gently but firmly pushes Jamal toward the door, subtly shaking her head as a signal of caution, and eventually insists on pushing him out entirely. Left standing alone in the courtyard, Jamal hesitates for a moment, looking back with lingering affection. He draws a deep breath, his chest expanding as if gathering resolve, and shifts his gaze upwards, a silent prayer or plea in his eyes. As the cricket match replays on a distant screen, Jamal tightens his jaw, his muscles clenching with determination, and returns a check to the host, an action filled with defiance. In a new setting, Jamal gazes pensively out of a train window, watching as the cityscape blurs past, a fast-moving tapestry. The train pulls into a vast station, the rhythm of progress halting, and Jamal swiftly disembarks, a solitary figure amidst the throng. The platforms teem with hundreds of passengers, a bustling sea of life, all converging and diverging in a complex dance. An enormous station clock prominently displays the time, showing five minutes to five, ticking with relentless certainty. Time advances, and the clock now reflects five-fifteen, each minute swallowed by the station's ceaseless activity. As Jamal moves along, walking at an elevated vantage point, he peers down at the bustling platforms, his eyes flicking from face to face while checking the overhead clock with growing urgency. He pauses, a sense of despair overtaking him, and rests his head in his hands, feeling momentarily defeated, before squatting down, his energy momentarily spent. At this pivotal moment, Latika materializes on the platform, her gaze searching her surroundings, scanning the sea of faces with anxious anticipation. Jamal, head still bowed, senses her presence, looks up, and immediately catches sight of her, the recognition instant and electrifying. Prompted by her appearance, he stands abruptly, his posture straight and alert, while Latika, standing amidst the crowd, appears profoundly anxious, her unease tempered only by the sudden awareness of Jamal's presence."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jamal and Latika exchange a meaningful look as the guard opens the gates, allowing Latika to enter the house quickly. Jamal follows into the lavishly furnished living room, noticing Latika behind a glass partition in the kitchen. She removes her glasses, and as he approaches, they pause until she smiles and they embrace. Suddenly anxious, she pulls away as a silver Mercedes arrives, and Javed enters. Latika hastily puts an apron on Jamal before Javed directs a threatening gaze at her and points to the TV, where a game show plays. Javed then switches to a cricket match and sits down. Nervously, Latika prepares a sandwich while exchanging tense glances with Jamal. When she takes the sandwich to Javed, he dismisses her from the TV's view. Watching the match, Javed throws his drink in disgust after tasting the sandwich. He glares at Jamal in the kitchen before returning to the cricket. Latika gently guides Jamal to the door, signaling him to leave. Outside, Jamal pauses in the courtyard, takes a deep breath, and then returns the game show check to the host. He is then seen on a train racing through the city, eventually arriving at a bustling station. Amid the crowd, he checks the overhead clock and, feeling despondent, squats down. At that moment, Latika appears on the platform, and upon spotting her, Jamal stands immediately, noticing her anxious demeanor."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Jamal and Latika stare at each other, both aware of the heavy history that ties them together. The guard, hired to maintain the security of this grand estate, presses the intercom and approaches to open the gates, aware of the protocol required for such high-profile residences. Latika quickly moves inside the house, which is situated in an affluent suburb known for its luxurious homes. Jamal enters an expensively furnished marble living room, a testament to the wealth of its owner, and sees Latika behind the glass partition separating the room from a kitchen equipped with the latest culinary technology. He approaches, intrigued by the opulence. She removes her dark glasses, designer frames that hid the anxiety in her eyes, and stands expectantly as he steps from behind the partition. They both stand stock still, a moment heavy with the emotions of past encounters, and she takes a sharp intake of breath. She smiles as he moves towards her, evidence of the bond despite looming danger, then they embrace each other tightly. Suddenly, she looks scared and backs away, sensing the imminent threat from Javed's return, and he looks at her shocked. A silver Mercedes, a symbol of power and wealth, pulls up to the house. As Javed, known for his controlling nature, steps into the living room, Latika puts an apron over Jamal’s neck as a hastily conceived disguise. Javed walks straight into the kitchen, leveling his malevolent gaze at Latika that betrays his suspicion. He points to the game show on TV, a popular show known for its dramatic tension, and then walks into the living room, sitting down in front of a widescreen TV to switch on the cricket game, an obsession that often consumes his evenings. Latika nervously prepares a sandwich for Javed, while Jamal spreads a concoction of preservatives onto a slice of bread, recalling a time when simple meals didn't carry such weight, as Latika dumps a limp piece of lettuce on the plate, and Jamal and Latika exchange nervous glances, aware of the risks. He grabs her hand with a silent plea for courage. She breaks his hold, understanding the necessity of their charade, lifts the plate, and takes it to Javed, who is engrossed in the game. She passes in front of the TV, a faux pas in Javed's eyes, and Javed shoos her out of the way back to the kitchen. Javed watches the game, his focus impenetrable, and throws his drink in irritation. Jamal looks pleadingly at Latika, aware of the limited time they have. Javed, still transfixed by the cricket game, which has been a longtime passion of his, takes a bite of his sandwich, looks disgusted, and spits it out onto the plate, his temper flaring. He walks into the kitchen, glares at Jamal as if to assert dominance, and goes back to the cricket, swearing under his breath about the incompetence around him. Latika pushes Jamal toward the door, signaling the end of this brief reunion, slowly shakes her head, and pushes him out of the door. He remains in the courtyard looking back at her, feeling the weight of separation once again. Jamal takes a deep breath and raises his eyes upwards, contemplating his next move. The cricket match replays, echoing a cycle he seems unable to escape. He tenses his jaw muscles and hands back the check to the host, symbolizing his rejection of both monetary gain and deceit. Jamal looks out of a train window as it races through the city, a sprawling urban landscape that offers both anonymity and hope. The train pulls into a large station, bustling with life and energy, and he jumps off. Hundreds of passengers alight from the train and throng on the platforms, embodying the relentless flow of life. An enormous station clock shows five minutes to five, marking time in a way that feels both urgent and surreal. Now the clock shows five-fifteen, and Jamal feels the passing minutes acutely. As Jamal moves along the walkway looking down on the platform, lost in a sea of unfamiliar faces, he scans the busy platforms and looks at the overhead clock, willing it to stop. He rests his head on his hands in despair, overwhelmed by the moment, then he squats down, feeling the weight of his choices. Latika appears on the platform, looking around her through a crowd for a familiar face. Jamal looks up and catches sight of her, hope rekindling in an instant. He stands up immediately, and she looks very anxious, the urgency of their meeting clear in her eyes."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Jamal and Latika stare at each other. The guard presses the intercom and approaches to open the gates. Latika quickly moves inside the house. Jamal enters an expensively furnished marble living room and sees Latika behind the glass partition separating the room from a kitchen and approaches. She removes her dark glasses and stands expectantly as he steps from behind the partition. They both stand stock still and she takes a sharp intake of breath. She smiles as he moves towards her. then they embrace each other tightly. Suddenly she looks scared and backs away and he looks at her shocked. A silver Mercedes pulls up to the house. As Javed steps into the living room Latika puts an apron over Jamal’s neck. Javed walks straight into the kitchen and levels his malevolent gaze at Latika. He points to the game show on TV walks into the living room and sits down in front of a widescreen TV. He switches on the cricket game. Latika nervously prepares a sandwich for Javed. Jamal spreads a concoction of preservatives onto a slice of bread as Latika dumps a limp piece of lettuce on the plate and Jamal and Latika exchange nervous glances. He grabs her hand. She breaks his hold lifts the plate and takes it to Javed. She passes in front of the TV and Javed shoos her out of the way back to the kitchen. Javed watches the game and throws his drink. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Jamal looks pleadingly at Latika. Javed still transfixed by the cricket game takes a bite of his sandwich looks disgusted and spits it out onto the plate. He walks into the kitchen glares at Jamal and goes back to the cricket swearing under his breath. Latika pushes Jamal toward the door slowly shakes her head and pushes him out of the door. He remains in the courtyard looking back at her. Jamal takes a deep breath and raises his eyes upwards. The cricket match replays. He tenses his jaw muscles and hands back the check to the host. Jamal looks out of a train window as it races through the city. The train pulls into a large station and he jumps off. Hundreds of passengers alight from the train and throng on the platforms. An enormous station clock shows five minutes to five. Now the clock shows fivefifteen. As Jamal moves along the walkway looking down on the platform he scans the busy platforms and looks at the overhead clock. He rests his head on his hands in despair. then he squats down. Latika appears on the platform looking around her. Jamal looks up. and catches sight of her. He stands up immediately and she looks very anxious."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Jamal and Latika stare at each other. The guard presses the intercom and approaches to open the gates. Latika quickly moves inside the house. Jamal enters an expensively furnished marble living room and sees Latika behind the glass partition separating the room from a kitchen and approaches. She removes her dark glasses and stands expectantly as he steps from behind the partition. They both stand stock still and she takes a sharp intake of breath. She smiles as he moves towards her. then they embrace each other tightly. Suddenly she looks scared and backs away and he looks at her shocked. A silver Mercedes pulls up to the house. As Javed steps into the living room Latika puts an apron over Jamal’s neck. Javed walks straight into the kitchen and levels his malevolent gaze at Latika. He points to the game show on TV walks into the living room and sits down in front of a widescreen TV. He switches on the cricket game. Latika nervously prepares a sandwich for Javed. Jamal spreads a concoction of preservatives onto a slice of bread as Latika dumps a limp piece of lettuce on the plate and Jamal and Latika exchange nervous glances. He grabs her hand. She breaks his hold lifts the plate and takes it to Javed. She passes in front of the TV and Javed shoos her out of the way back to the kitchen. Javed watches the game and throws his drink. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Jamal looks pleadingly at Latika. Javed still transfixed by the cricket game takes a bite of his sandwich looks disgusted and spits it out onto the plate. He walks into the kitchen glares at Jamal and goes back to the cricket swearing under his breath. Latika pushes Jamal toward the door slowly shakes her head and pushes him out of the door. He remains in the courtyard looking back at her. Jamal takes a deep breath and raises his eyes upwards. The cricket match replays. He tenses his jaw muscles and hands back the check to the host. Jamal looks out of a train window as it races through the city. The train pulls into a large station and he jumps off. Hundreds of passengers alight from the train and throng on the platforms. An enormous station clock shows five minutes to five. Now the clock shows fivefifteen. As Jamal moves along the walkway looking down on the platform he scans the busy platforms and looks at the overhead clock. He rests his head on his hands in despair. then he squats down. Latika appears on the platform looking around her. Jamal looks up. and catches sight of her. He stands up immediately and she looks very anxious."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Jamal and Latika stare at each other. The guard presses the intercom and approaches to open the gates. Latika quickly moves inside the house. Jamal enters an expensively furnished marble living room and sees Latika behind the glass partition separating the room from a kitchen and approaches. She removes her dark glasses and stands expectantly as he steps from behind the partition. They both stand stock still and she takes a sharp intake of breath. She smiles as he moves towards her. then they embrace each other tightly. Suddenly she looks scared and backs away and he looks at her shocked. A silver Mercedes pulls up to the house. Hundreds of passengers alight from the train and throng on the platforms. An enormous station clock shows five minutes to five. Now the clock shows fivefifteen. As Jamal moves along the walkway looking down on the platform he scans the busy platforms and looks at the overhead clock. He rests his head on his hands in despair. then he squats down. Latika appears on the platform looking around her. Jamal looks up. and catches sight of her. He stands up immediately and she looks very anxious."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Jamal and Latika stare at each other. The guard presses the intercom and approaches to open the gates. Latika quickly moves inside the house. Jamal enters an expensively furnished marble living room and sees Latika behind the glass partition separating the room from a kitchen and approaches. Latika appears on the platform looking around her. Jamal looks up. and catches sight of her. He stands up immediately and she looks very anxious."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Benny and Clara blink at one another. The clown taps the megaphone and dashes to close the curtains. Clara slowly dances outside the barn. Benny penetrates a lavishly decorated crystal dining room and notices Clara beyond the wooden fence separating the arena from a pantry and advances. She adjusts her bright hat and sits optimistically as he leaps over the fence. They both freeze completely, and she takes a loud gulp of air. She frowns as he slides away from her, then they high-five each other loosely. Abruptly, she appears confident and skips forward, and he stares at her, pleased. A golden minivan speeds away from the barn. As Felix dashes out of the dining room, Clara wraps a scarf around Benny’s wrist. Felix prances towards the pantry and softens his mellow gaze on Clara. He gestures to the board game by the radio, sprints into the dining room, and crawls behind a small radio. He tunes into the ocean documentary. Clara eagerly cooks a pie for Felix. Benny drizzles a mixture of spices onto a strip of bacon as Clara flings a crisp piece of kale into the oven, and Benny and Clara trade eager glances. He releases her elbow. She maintains his grip, drops the oven, and brings it to Felix. She walks behind the radio, and Felix beckons her closer to the pantry. Felix listens to the documentary and tosses his hat. Benny gazes indifferently at Clara. Felix, still absorbed by the ocean documentary, nibbles one piece of his pie, seems thrilled, and swallows it with delight. He marches into the pantry, smiles at Benny, and returns to the ocean, singing under his breath. Clara pulls Benny away from the window, rapidly nods her head, and ushers him into the window. He remains in the garden, staring forward at her. Benny exhales slowly and lowers his shoulders downwards. The ocean scene continues. He clenches his eyelid muscles and hands forward the map to the navigator. Benny looks out of a car window as it glides through the desert. The car pulls out of a narrow junction, and he climbs on. Dozens of tourists emerge onto the car and mill around the alleyways. A tiny alleyway bell tolls six minutes to midnight. Now the bell tolls six-twenty. As Benny wanders along the street scanning up at the alleyways, he examines the empty streets and checks the lingering bell. He drops his chin into his arms in frustration, then he perches up. Clara emerges into the alleyway, peering near her. Benny glances down and notices her. He crouches down instantly, and she seems very relaxed."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jamal and Latika exchange a tense gaze as the guard prepares to open the gate. Inside an opulent marble living room, they embrace, but Latika quickly pulls away, afraid. A silver Mercedes arrives, and Javed enters, casting a menacing look at Latika. As Javed immerses himself in a cricket game, Latika and Jamal tensely prepare a meal, exchanging nervous glances. Latika delivers the sandwich to Javed, who is displeased and returns to the game, cursing. Latika then pushes Jamal towards the exit, silently urging him to leave. Outside, Jamal looks back at her before departing. Later, on a train, he contemplates his situation. As he arrives at a bustling station, he anxiously searches for Latika. Despairing under an enormous clock, Jamal finally spots Latika on the platform, and they lock eyes, both filled with emotion."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He stands up immediately and she looks very anxious and catches sight of her Jamal looks up Latika appears on the platform looking around her then he squats down He rests his head on his hands in despair As Jamal moves along the walkway looking down on the platform he scans the busy platforms and looks at the overhead clock Now the clock shows fivefifteen An enormous station clock shows five minutes to five Hundreds of passengers alight from the train and throng on the platforms The train pulls into a large station and he jumps off Jamal looks out of a train window as it races through the city He tenses his jaw muscles and hands back the check to the host The cricket match replays Jamal takes a deep breath and raises his eyes upwards He remains in the courtyard looking back at her Latika pushes Jamal toward the door slowly shakes her head and pushes him out of the door He walks into the kitchen glares at Jamal and goes back to the cricket swearing under his breath Javed still transfixed by the cricket game takes a bite of his sandwich looks disgusted and spits it out onto the plate Jamal looks pleadingly at Latika Javed watches the game and throws his drink She passes in front of the TV and Javed shoos her out of the way back to the kitchen She breaks his hold lifts the plate and takes it to Javed He grabs her hand Jamal spreads a concoction of preservatives onto a slice of bread as Latika dumps a limp piece of lettuce on the plate and Jamal and Latika exchange nervous glances Latika nervously prepares a sandwich for Javed He switches on the cricket game He points to the game show on TV walks into the living room and sits down in front of a widescreen TV Javed walks straight into the kitchen and levels his malevolent gaze at Latika As Javed steps into the living room Latika puts an apron over Jamal’s neck A silver Mercedes pulls up to the house Suddenly she looks scared and backs away and he looks at her shocked then they embrace each other tightly She smiles as he moves towards her They both stand stock still and she takes a sharp intake of breath She removes her dark glasses and stands expectantly as he steps from behind the partition Jamal enters an expensively furnished marble living room and sees Latika behind the glass partition separating the room from a kitchen and approaches Latika quickly moves inside the house The guard presses the intercom and approaches to open the gates Jamal and Latika stare at each other"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The guard presses the intercom and approaches to open the gates Jamal and Latika stare at each other Jamal enters an expensively furnished marble living room and sees Latika behind the glass partition separating the room from a kitchen and approaches Latika quickly moves inside the house They both stand stock still and she takes a sharp intake of breath She removes her dark glasses and stands expectantly as he steps from behind the partition then they embrace each other tightly She smiles as he moves towards her A silver Mercedes pulls up to the house Suddenly she looks scared and backs away and he looks at her shocked Javed walks straight into the kitchen and levels his malevolent gaze at Latika As Javed steps into the living room Latika puts an apron over Jamal’s neck He switches on the cricket game He points to the game show on TV walks into the living room and sits down in front of a widescreen TV Jamal spreads a concoction of preservatives onto a slice of bread as Latika dumps a limp piece of lettuce on the plate and Jamal and Latika exchange nervous glances Latika nervously prepares a sandwich for Javed She breaks his hold lifts the plate and takes it to Javed He grabs her hand Javed watches the game and throws his drink She passes in front of the TV and Javed shoos her out of the way back to the kitchen Javed still transfixed by the cricket game takes a bite of his sandwich looks disgusted and spits it out onto the plate Jamal looks pleadingly at Latika Latika pushes Jamal toward the door slowly shakes her head and pushes him out of the door He walks into the kitchen glares at Jamal and goes back to the cricket swearing under his breath Jamal takes a deep breath and raises his eyes upwards He remains in the courtyard looking back at her He tenses his jaw muscles and hands back the check to the host The cricket match replays The train pulls into a large station and he jumps off Jamal looks out of a train window as it races through the city An enormous station clock shows five minutes to five Hundreds of passengers alight from the train and throng on the platforms As Jamal moves along the walkway looking down on the platform he scans the busy platforms and looks at the overhead clock Now the clock shows fivefifteen then he squats down He rests his head on his hands in despair Jamal looks up Latika appears on the platform looking around her He stands up immediately and she looks very anxious and catches sight of her"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Jamal looks pleadingly at Latika Javed still transfixed by the cricket game takes a bite of his sandwich looks disgusted and spits it out onto the plate He walks into the kitchen glares at Jamal and goes back to the cricket swearing under his breath Latika pushes Jamal toward the door slowly shakes her head and pushes him out of the door He remains in the courtyard looking back at her Jamal takes a deep breath and raises his eyes upwards The cricket match replays He tenses his jaw muscles and hands back the check to the host Jamal looks out of a train window as it races through the city The train pulls into a large station and he jumps off Hundreds of passengers alight from the train and throng on the platforms An enormous station clock shows five minutes to five Now the clock shows fivefifteen As Jamal moves along the walkway looking down on the platform he scans the busy platforms and looks at the overhead clock He rests his head on his hands in despair then he squats down Latika appears on the platform looking around her Jamal looks up and catches sight of her He stands up immediately and she looks very anxious Jamal and Latika stare at each other The guard presses the intercom and approaches to open the gates Latika quickly moves inside the house Jamal enters an expensively furnished marble living room and sees Latika behind the glass partition separating the room from a kitchen and approaches She removes her dark glasses and stands expectantly as he steps from behind the partition They both stand stock still and she takes a sharp intake of breath She smiles as he moves towards her then they embrace each other tightly Suddenly she looks scared and backs away and he looks at her shocked A silver Mercedes pulls up to the house As Javed steps into the living room Latika puts an apron over Jamal’s neck Javed walks straight into the kitchen and levels his malevolent gaze at Latika He points to the game show on TV walks into the living room and sits down in front of a widescreen TV He switches on the cricket game Latika nervously prepares a sandwich for Javed Jamal spreads a concoction of preservatives onto a slice of bread as Latika dumps a limp piece of lettuce on the plate and Jamal and Latika exchange nervous glances He grabs her hand She breaks his hold lifts the plate and takes it to Javed She passes in front of the TV and Javed shoos her out of the way back to the kitchen Javed watches the game and throws his drink"
        }
      ]
    }
  ]
}