{
  "ground_truth": "The teacher sees Salim and Jamal. The boys fight over the book, and he grabs the book and whacks it over Jamal's head. In the present day, back in the police station, Srinivas inserts a VHS into a player. Jamal is slumped in a chair opposite the inspector's desk, and Srinivas slaps Jamal, who then stares at the ground. The inspector points the remote control at the TV. The five-year-old Jamal squats over a hole in a makeshift shanty toilet while Salim sits guard outside. A man rushes down towards the toilets as Prakash leans over painfully. Jamal pulls his pants up, and old clips of Amitabh's 70's action films play. A helicopter flies over Jamal's roofless loo. Salim jams his chair against the door, locking Jamal in. Through a hole in the wall, Jamal sees hundreds of men, women, and children flock to the runway. He kicks the door in vain and takes out of his pocket a creased photo of his hero, Amitabh Bachchan. He looks down through the hole in the floor to the cesspit beneath, looks from the cesspit to the photo and back, then pinches his nose and jumps, keeping one arm aloft to hold the photo clear of the effluent. Amitabh descends from his helicopter to cheering crowds. Jamal appears covered from head to toe in excrement, dashes towards Amitabh, making his way through the crowds of photographers and onlookers. Salim stands at the front of the crowd, hemmed in by security. In the distance, we see Jamal running, holding onto his photo of Amitabh. The crowd parts for stinking Jamal, who makes straight for Amitabh. Salim stares at his brother in disbelief as people hold their noses. Amitabh signs the photo and hands it back to Jamal. A hazy orange sun rises above the teeming streets, slums, and skyscrapers of Mumbai. Jamal's mother scrubs him with soap while Salim looks back at his brother mischievously and disappears. A man sits next to a film projector in a cinema as Salim enters the projectionist's booth and shows him Jamal's autographed photo of Amitabh. The man thrusts the photo into the light from the projector, hands Salim two coins, and Salim winks and salutes the man, then bumps into Jamal outside. Jamal is on the video, and the policemen stare at him. Jamal concentrates hard and smiles briefly. Trains speed through a slum as Jamal's mother washes brightly colored clothing in a pool while young Jamal and Salim frolic in the water. Their mother smiles at the two boys playing but suddenly turns to look at the trains, worried and scared. The train passes by, revealing a crowd of men wielding clubs, knives, and axes running towards them, and people drop what they are doing and flee.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The educator notices Salim and Jamal. The lads tussle over the tome, and he seizes the tome and smacks it over Jamal's cranium. In the contemporary era, back in the constabulary station, Srinivas inserts a VHS into a device. Jamal is slouched in a seat opposite the inspector's bureau, and Srinivas strikes Jamal, who then gazes at the ground. The inspector aims the remote control at the TV. The five-year-old Jamal crouches over a pit in a makeshift shack latrine while Salim sits watch outside. A man dashes down towards the latrines as Prakash bends over agonizingly. Jamal pulls his trousers up, and vintage clips of Amitabh's 70's action flicks play. A chopper soars over Jamal's roofless lavatory. Salim jams his seat against the entrance, fastening Jamal in. Through an aperture in the barrier, Jamal observes hundreds of men, women, and children throng to the airstrip. He kicks the entrance in vain and takes out of his pocket a wrinkled snapshot of his idol, Amitabh Bachchan. He glances down through the aperture in the flooring to the cesspool beneath, looks from the cesspool to the snapshot and back, then pinches his nose and leaps, keeping one limb aloft to hold the snapshot clear of the sewage. Amitabh descends from his chopper to applauding throngs. Jamal appears covered from head to toe in filth, sprints towards Amitabh, making his way through the throngs of photographers and spectators. Salim stands at the forefront of the throng, hemmed in by security. In the distance, we observe Jamal running, holding onto his snapshot of Amitabh. The throng parts for reeking Jamal, who makes straight for Amitabh. Salim gawks at his sibling in incredulity as people hold their noses. Amitabh signs the snapshot and hands it back to Jamal. A misty amber sun ascends above the swarming avenues, slums, and high-rises of Mumbai. Jamal's mother scrubs him with soap while Salim glances back at his sibling mischievously and vanishes. A man sits adjacent to a cinema projector as Salim enters the projectionist's cabin and shows him Jamal's autographed snapshot of Amitabh. The man thrusts the snapshot into the light from the projector, hands Salim two coins, and Salim winks and salutes the man, then bumps into Jamal outside. Jamal is on the video, and the constables gaze at him. Jamal focuses intently and grins briefly. Trains race through a slum as Jamal's mother washes vibrantly hued garments in a pool while young Jamal and Salim cavort in the water. Their mother smiles at the two lads playing but suddenly turns to gaze at the trains, anxious and frightened. The train passes by, revealing a throng of men wielding clubs, daggers, and hatchets running towards them, and people drop what they are doing and flee."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The teacher sees Salim and Jamal. The book is fought over by the boys, and it is grabbed by him and whacked over Jamal's head. In the present day, back in the police station, a VHS is inserted into a player by Srinivas. Jamal slumps in a chair opposite the inspector's desk, and Srinivas slaps Jamal, who stares at the ground afterward. The remote control is pointed at the TV by the inspector. The five-year-old Jamal squats over a hole in a makeshift shanty toilet while the guard is sat outside by Salim. A man rushes down towards the toilets as Prakash leans over painfully. Jamal's pants are pulled up by him, and old clips of Amitabh's 70's action films play. A helicopter is flown over Jamal's roofless loo. The door is jammed by Salim's chair, locking Jamal in. Through a hole in the wall, hundreds of men, women, and children are seen by Jamal flocking to the runway. The door is kicked in vain, and a creased photo of his hero, Amitabh Bachchan, is taken out of his pocket by him. The hole in the floor to the cesspit beneath is looked down through by him; he looks from the cesspit to the photo and back, then the nose is pinched by him and a jump is made, keeping one arm aloft to hold the photo clear of the effluent. Amitabh descends from his helicopter to cheering crowds. Jamal appears covered from head to toe in excrement and dashes towards Amitabh, making his way through the crowds of photographers and onlookers. Salim stands at the front of the crowd, hemmed in by security. Jamal is seen running in the distance, holding onto his photo of Amitabh. The crowd parts for stinking Jamal, who makes straight for Amitabh. Salim stares at his brother in disbelief as their noses are held by people. The photo is signed by Amitabh and handed back to Jamal. A hazy orange sun rises above the teeming streets, slums, and skyscrapers of Mumbai. Jamal is scrubbed with soap by his mother while Salim looks back at his brother mischievously and disappears. A man sits next to a film projector in a cinema as Salim shows him Jamal's autographed photo of Amitabh after entering the projectionist's booth. The photo is thrust into the light from the projector by the man, who hands Salim two coins, and Salim winks and salutes the man, then bumps into Jamal outside. Jamal is on the video, and at him the policemen stare. Jamal concentrates hard and smiles briefly. Trains speed through a slum as brightly colored clothing is washed by Jamal's mother in a pool while the young Jamal and Salim frolic in the water. The two boys are smiled at by their mother while they play, but she suddenly turns to look at the trains, worried and scared. The train passes by, revealing a crowd of men wielding clubs, knives, and axes running towards them, and what they are doing is dropped and people flee."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The teacher notices Salim and Jamal fighting over a book, grabs it, and whacks Jamal on the head. In the present, at the police station, Srinivas plays a VHS. Jamal slumps in a chair opposite the inspector, who points a remote at the TV. Five-year-old Jamal squats over a makeshift toilet while Salim guards outside. A man rushes toward the toilets as Jamal pulls his pants up; old clips of Amitabh's films play. A helicopter flies over Jamal. Salim locks him in, and Jamal sees a crowd through a wall hole. He takes a photo of Amitabh from his pocket, pinches his nose, and jumps into the cesspit, holding the photo high. Amitabh arrives, and Jamal, covered in excrement, runs through the crowd. Salim watches in disbelief as people hold their noses. Amitabh signs Jamal's photo. A hazy sun rises over Mumbai. Jamal's mother scrubs him clean while Salim disappears. In a cinema, Salim shows Jamal's autographed photo to a projector operator, who gives him coins. Salim bumps into Jamal outside. On video, policemen watch Jamal, who briefly smiles. Trains speed by as their mother washes clothes, and Jamal and Salim play in water. She smiles but then turns worried as a train passes, revealing armed men. People panic and flee."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The teacher sees Salim and Jamal fighting over a book and hits Jamal with it. At the police station, Srinivas inserts a VHS. Jamal slumps in a chair opposite the inspector. Srinivas slaps Jamal, who stares at the ground. The inspector points the remote at the TV. Five-year-old Jamal squats over a hole in a shanty toilet as Salim guards outside. A man rushes to the toilets while Prakash winces. Jamal pulls up his pants; old Amitabh films play. A helicopter flies over Jamal’s roofless loo. Salim locks Jamal in. Through a hole in the wall, Jamal sees people flocking to the runway. He kicks the door and takes out a creased Amitabh photo. He pinches his nose, jumps into the cesspit, keeping the photo clear. Amitabh descends his helicopter to cheering crowds. Jamal, covered in excrement, rushes through the crowd toward Amitabh. Salim, hemmed by security, watches Jamal run with his photo. The crowd parts for stinking Jamal, who reaches Amitabh. Amitabh signs the photo and returns it. The sun rises over Mumbai. Jamal's mother scrubs him with soap. Salim mischievously looks at Jamal and disappears. A man sits near a cinema projector as Salim shows Jamal's autographed Amitabh photo. The man holds the photo in the projector light, gives Salim two coins, and Salim salutes, bumping into Jamal outside. Jamal is on the video as policemen watch him. He concentrates and smiles briefly. Trains speed through a slum; Jamal's mother washes colorful clothes while young Jamal and Salim play. Their mother smiles but suddenly turns, worried, as a train reveals men with clubs approaching, causing panic."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The teacher catches a glimpse of Salim and Jamal, who are embroiled in a heated tussle over the possession of a book. With decisive action, the teacher intervenes by seizing the book and subsequently delivers a firm whack over Jamal's head with it. In the present day, back at the police station, Srinivas methodically inserts a VHS tape into the player. Jamal, appearing defeated, is slumped in a chair opposite the inspector's desk. Srinivas follows this by delivering a sharp slap to Jamal, prompting him to stare dejectedly at the ground. The inspector, with a hint of authority, directs the remote control towards the television screen. The scene shifts to a five-year-old Jamal squatting over a rudimentary hole in a makeshift shanty toilet while Salim dutifully sits guard outside. Suddenly, a man rushes down in the direction of the toilets as Prakash leans over with an expression of pain. Jamal hurriedly pulls his pants up as he hears old clips of Amitabh's action films from the 70s playing. Overhead, a helicopter flies past, casting a shadow over Jamal's roofless loo. Salim mischievously jams his chair against the door, effectively locking Jamal inside. Through a small hole in the wall, Jamal witnesses hundreds of men, women, and children flock to the bustling runway. Desperately, he kicks at the door in vain and retrieves from his pocket a creased and cherished photo of his hero, Amitabh Bachchan. He gazes down through the hole in the floor to the cesspit beneath him, comparing the grim sight to his beloved photo, and back again. Resolutely, he pinches his nose, jumps into the muck, and keeps one arm raised high to keep the photo untouched by the effluent. As Amitabh descends from his helicopter to the roar of cheering crowds, Jamal emerges, completely covered from head to toe in foul-smelling excrement. He dashes determinedly toward Amitabh, navigating his way through the throngs of photographers and enthusiastic onlookers. Salim stands positioned at the forefront of the crowd, managed by security. In the distance, we catch a glimpse of Jamal running, clutching tightly onto his treasured photo of Amitabh. The crowd parts, making way for the stinking Jamal, who heads straight for Amitabh. Salim stares at his brother in sheer disbelief as those around clutch their noses to block the stench. Amitabh gracefully signs the photo and hands it back to the eager Jamal. In the background, a hazy orange sun rises majestically above the bustling streets, sprawling slums, and towering skyscrapers of Mumbai. Jamal's mother scrubs him vigorously with soap while Salim sneaks a mischievous look back at his brother and then vanishes. Meanwhile, a man settles beside a film projector in a cinema as Salim confidently enters the projectionist's booth and proudly shows him Jamal's autographed photo of Amitabh. The man thrusts the photo into the projector's light, examines it, and then hands Salim two shiny coins. Salim, feeling triumphant, winks and salutes the man before bumping into Jamal outside. On the video, Jamal appears, capturing the attention of the policemen as they stare intently at him. Jamal focuses deeply, his mind engrossed in the situation, and allows himself a brief smile. In another scene, trains race past a vibrant slum as Jamal's mother diligently washes brightly colored clothing in a pool, while young Jamal and Salim frolic joyfully in the water. Their mother watches them with a warm smile but suddenly shifts her attention to the trains, a look of worry and fear crossing her face. A train thunders past, revealing a menacing crowd of men brandishing clubs, knives, and axes, charging towards them, prompting people to abandon their activities and flee in panic."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The teacher happens to catch sight of Salim and Jamal, who are caught up in an intense and heated struggle over who should rightfully possess a particular book. With decisive and swift action, the teacher steps in, firmly intervening by grabbing hold of the book. He then proceeds to deliver a solid whack over Jamal's head using the very book in question. Transitioning to the present day, back within the walls of the police station, Srinivas carefully and methodically inserts a VHS tape into the player. Jamal, who appears utterly defeated, is slumped down in a chair directly facing the inspector's desk. Srinivas follows this by delivering a sharp and abrupt slap to Jamal, causing him to stare with a sense of dejection at the ground. The inspector, exuding a hint of authoritative presence, points the remote control decisively towards the television screen. The scene then shifts to a young Jamal, just five years old, squatting over a primitive hole in an improvised shanty toilet, while Salim dutifully sits as a guard outside. Suddenly, a man hurries down towards the toilets as Prakash leans over, expressing visible pain. Jamal scrambles to pull his pants up quickly as he hears the familiar old clips of Amitabh's action films from the lively 70s playing. Overhead, a helicopter flies by, casting a shadow over Jamal's roofless, makeshift loo. Salim mischievously jams his chair against the door, effectively trapping Jamal inside. Through a small hole in the wall, Jamal gazes out to witness hundreds of men, women, and children flocking to the bustling runway. In desperation, he kicks at the door, but to no avail, so he retrieves from his pocket a creased and cherished photograph of his hero, the iconic Amitabh Bachchan. He gazes down through the floor's hole to the cesspit beneath him, comparing the grim sight before him to his beloved photograph, and back again. Resolutely, he pinches his nose, bravely jumps into the muck, and keeps one arm raised high, ensuring the photo remains untouched by the foul effluent. As Amitabh descends elegantly from his helicopter to the thunderous roar of cheering crowds, Jamal emerges, covered entirely from top to bottom in foul-smelling excrement. He dashes with determination toward Amitabh, skillfully navigating his way through the throngs of photographers and enthusiastic onlookers. Salim stands prominently at the forefront of the crowd, under the careful watch of security. In the distance, we catch a fleeting glimpse of Jamal running, clutching tightly onto his treasured photograph of Amitabh. The crowd parts, making way for the stinking Jamal as he heads straight for Amitabh. Salim stares at his brother with sheer disbelief as those around clutch their noses, trying to block out the overpowering stench. Amitabh gracefully signs the photograph and hands it back to the eager and ecstatic Jamal. In the background, a hazy orange sun rises majestically above the bustling streets, sprawling slums, and towering skyscrapers of Mumbai. Jamal's mother energetically scrubs him with soap while Salim sneaks a mischievous look over his shoulder at his brother before disappearing from view. Meanwhile, a man settles down beside a film projector within a cinema, as Salim confidently enters the projectionist's booth, proudly showcasing Jamal's autographed photograph of Amitabh. The man thrusts the photo into the projector's light, inspects it carefully, and then hands Salim two shiny coins. Salim, feeling triumphant, winks and salutes the man before bumping into Jamal outside. On the video, Jamal's image appears, capturing the attention of the policemen, who stare intently at him. Jamal focuses deeply, his mind thoroughly engrossed in the situation, allowing himself the briefest of smiles. In another vivid scene, trains race past a vibrant and colorful slum as Jamal's mother diligently washes brightly colored clothing in a clear pool, while young Jamal and Salim frolic joyfully in the water. Their mother watches them with a warm and affectionate smile but then suddenly shifts her attention to the trains, a look of worry and fear briefly crossing her face. A train thunders past, revealing a menacing crowd of men wielding clubs, knives, and axes, charging toward them, which prompts people to abandon their activities and scatter in panic."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The teacher, upon setting his eyes on Salim and Jamal, observes the boys embroiled in a struggle over the possession of a book. As the squabble intensifies, the teacher intervenes decisively, seizing the book from them and, in a swift motion, brings it down upon Jamal's head with a whack. Fast forward to the present day, Jamal finds himself in a police station, where Srinivas methodically inserts a VHS tape into a player. Jamal sits slumped in a chair directly across from the inspector's desk, displaying a demeanor of weariness and resignation. In a sudden act, Srinivas slaps Jamal, prompting him to lower his gaze to the ground, lost in thought or perhaps humiliation. Observing this interaction, the inspector raises the remote control, aiming it at the television to activate it. The narrative shifts backward in time, showcasing a five-year-old Jamal squatting over a hole in a rudimentary shanty toilet, while his brother, Salim, assumes the role of lookout just outside. A man comes rushing towards the toilets with urgency as Prakash leans over in visible discomfort. Amidst these unfolding events, Jamal pulls up his pants, juxtaposed with old clips of Amitabh's iconic 70's action films playing in the background. Overhead, a helicopter in flight traverses the sky above Jamal's roofless, makeshift loo. Meanwhile, Salim mischievously wedges his chair against the door, effectively trapping Jamal inside. Peering through a small hole in the wall, Jamal glimpses a throng of men, women, and children converging upon a nearby runway. In a fruitless attempt to escape, Jamal kicks at the obstructed door before resigning to retrieve from his pocket a worn, creased photograph of his idol, Amitabh Bachchan. His eyes dart from the pit of waste below to his cherished photo and back again as he resolves to pinch his nose and leap, holding the photograph aloft to preserve it from the foul depths. As Amitabh descends from his helicopter to the adulation of the gathered crowd, Jamal emerges, covered in filth from head to toe, yet undeterred, races towards his idol through the throng of photographers and spectators. Salim, positioned at the front of the crowd, finds himself penned in by security personnel, while at a remove, Jamal charges forward, clutching his beloved photo of Amitabh. The crowd, repulsed but intrigued, parts to allow the odorous Jamal a direct path to Amitabh. Salim, witnessing this spectacle, gazes at his brother in a mix of disbelief and awe, as those around hold their noses. Amitabh graciously signs the photo and returns it to a jubilant Jamal. As a hazy orange sun ascends over the bustling streets, sprawling slums, and towering skyscrapers of Mumbai, Jamal's mother vigorously scrubs him clean with soap, while Salim watches with a glint of mischief in his eyes before vanishing from sight. Transitioning to a dimly lit cinema, a man sits beside a film projector when Salim enters the booth and presents him with Jamal's prized, autographed photograph of Amitabh. The man, intrigued, thrusts the photo into the projector's beam of light, then exchanges it for two coins, which he hands to Salim. With a wink and a salute, Salim acknowledges the transaction and nonchalantly bumps into Jamal outside. On the television screen, Jamal appears, drawing the focused attention of the policemen who gaze at him intently. Jamal, concentrating deeply, allows a brief smile to flit across his face. Outside, trains rush past the slum, where Jamal's mother is busy washing vibrantly colored clothing in a pool, as young Jamal and Salim play spiritedly in the water nearby. Their mother, smiling at her playful sons, suddenly shifts her attention towards the trains, her expression transforming into one of fear and concern. As a train rolls by, it reveals a looming threat: a crowd of men armed with clubs, knives, and axes advances toward them, inciting panic as people hastily abandon their activities to flee the impending danger."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The teacher sees Salim and Jamal fighting over a book and intervenes by hitting Jamal with it. In the present, at the police station, Srinivas inserts a VHS while Jamal, across from the inspector, is slapped and stares at the ground. The inspector activates the TV, showing young Jamal in a shanty toilet with Salim on guard. A man rushes towards them, and Jamal quickly dresses as Amitabh's action films play. Salim locks Jamal in, and Jamal sees crowds gathering through the wall. Desperate, he compares his photo of Amitabh to the cesspit below, pinches his nose, and jumps in, protecting the photo. Amidst cheering crowds, Amitabh descends from a helicopter, and Jamal, covered in excrement, runs toward him, parting the crowd. Amitabh signs Jamal's photo, and a hazy sun rises over Mumbai. Jamal's mother scrubs him clean while Salim mischievously vanishes. In a cinema, Salim shows Jamal's autographed photo to a man, who pays Salim before he bumps into Jamal outside. The policemen watch Jamal on video as he concentrates and briefly smiles. Trains rush by as Jamal's mother washes clothes, and the boys play. Her joy turns to fear as men with weapons approach, prompting panic among the people."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The teacher sees Salim and Jamal, who are known in their neighborhood for their mischievous antics. The boys fight over the book, and he grabs the book and whacks it over Jamal's head, a technique he learned from years of dealing with unruly students. In the present day, back in the bustling Mumbai police station, Srinivas, an experienced officer known for his unorthodox methods, inserts a VHS into a player. Jamal is slumped in a chair opposite the inspector's desk, the atmosphere thick with tension, and Srinivas slaps Jamal, who then stares at the ground, his mind racing with thoughts. The inspector, a man with a reputation for being thorough, points the remote control at the TV. The five-year-old Jamal squats over a hole in a makeshift shanty toilet, a common sight in the overcrowded Dharavi slums, while Salim sits guard outside. A man rushes down towards the toilets as Prakash, a local resident known for his constant ailments, leans over painfully. Jamal pulls his pants up, and an old clip of Amitabh's 70's action films, which have a cult following in India, plays. A helicopter, hired by a local businessman to attract attention, flies over Jamal's roofless loo. Salim jams his chair against the door, locking Jamal in, a mischievous grin on his face. Through a hole in the wall, Jamal sees hundreds of men, women, and children flock to the runway, eager to catch a glimpse of the superstar. He kicks the door in vain and takes out of his pocket a creased photo of his hero, Amitabh Bachchan, an icon of Indian cinema. He looks down through the hole in the floor to the cesspit beneath, looks from the cesspit to the photo and back, then pinches his nose and jumps, keeping one arm aloft to hold the photo clear of the effluent, determined to meet his idol. Amitabh descends from his helicopter to cheering crowds, a scene reminiscent of his film premieres. Jamal appears covered from head to toe in excrement, dashes towards Amitabh, making his way through the crowds of photographers and onlookers who have gathered in excitement. Salim stands at the front of the crowd, hemmed in by security, his eyes wide with shock. In the distance, we see Jamal running, holding onto his photo of Amitabh as if it were a priceless treasure. The crowd parts for stinking Jamal, who makes straight for Amitabh, his determination unwavering. Salim stares at his brother in disbelief as people hold their noses, the stench overwhelming. Amitabh, amused and impressed by Jamal's audacity, signs the photo and hands it back to Jamal. A hazy orange sun rises above the teeming streets, slums, and skyscrapers of Mumbai, a city of stark contrasts. Jamal's mother scrubs him with soap beside their small tenement while Salim looks back at his brother mischievously and disappears, his mind already scheming. A man sits next to a film projector in a cinema, the air filled with the smell of popcorn, as Salim enters the projectionist's booth and shows him Jamal's autographed photo of Amitabh, knowing its value. The man thrusts the photo into the light from the projector, inspecting it closely, hands Salim two coins, and Salim winks and salutes the man, then bumps into Jamal outside, eager to share his spoils. Jamal is on the video, and the policemen, intrigued by his story, stare at him. Jamal concentrates hard and smiles briefly, recalling the unlikely journey he has taken. Trains speed through a slum, the rhythm of city life, as Jamal's mother washes brightly colored clothing in a pool while young Jamal and Salim frolic in the water, their laughter echoing through the streets. Their mother smiles at the two boys playing but suddenly turns to look at the trains, worried and scared, sensing trouble. The train passes by, revealing a crowd of men wielding clubs, knives, and axes running towards them, and people drop what they are doing and flee, fear rippling through the community."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The teacher sees Salim and Jamal. The boys fight over the book and he grabs the book and whacks it over Jamal's head. In the present day back in the police station Srinivas inserts a VHS into a player. Jamal is slumped in a chair opposite the inspector's desk and Srinivas slaps Jamal who then stares at the ground. The inspector points the remote control at the TV. The fiveyearold Jamal squats over a hole in a makeshift shanty toilet while Salim sits guard outside. A man rushes down towards the toilets as Prakash leans over painfully. Jamal pulls his pants up and old clips of Amitabh's 70's action films play. A helicopter flies over Jamal's roofless loo. Salim jams his chair against the door locking Jamal in. Through a hole in the wall Jamal sees hundreds of men women and children flock to the runway. He kicks the door in vain and takes out of his pocket a creased photo of his hero Amitabh Bachchan. He looks down through the hole in the floor to the cesspit beneath looks from the cesspit to the photo and back then pinches his nose and jumps keeping one arm aloft to hold the photo clear of the effluent. Amitabh descends from his helicopter to cheering crowds. Jamal appears covered from head to toe in excrement dashes towards Amitabh making his way through the crowds of photographers and onlookers. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Salim stands at the front of the crowd hemmed in by security. In the distance we see Jamal running holding onto his photo of Amitabh. The crowd parts for stinking Jamal who makes straight for Amitabh. Salim stares at his brother in disbelief as people hold their noses. Amitabh signs the photo and hands it back to Jamal. A hazy orange sun rises above the teeming streets slums and skyscrapers of Mumbai. Jamal's mother scrubs him with soap while Salim looks back at his brother mischievously and disappears. A man sits next to a film projector in a cinema as Salim enters the projectionist's booth and shows him Jamal's autographed photo of Amitabh. The man thrusts the photo into the light from the projector hands Salim two coins and Salim winks and salutes. the man then bumps into Jamal outside. Jamal is on the video and the policemen stare at him. Jamal concentrates hard and smiles briefly. Trains speed through a slum as Jamal's mother washes brightly colored clothing in a pool while young. Jamal and Salim frolic in the water. Their mother smiles at the two boys playing but suddenly turns to look at the trains worried and scared. The train passes by revealing a crowd of men wielding clubs knives and axes running towards them and people drop what they are doing and flee."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The teacher sees Salim and Jamal. The boys fight over the book and he grabs the book and whacks it over Jamal's head. In the present day back in the police station Srinivas inserts a VHS into a player. Jamal is slumped in a chair opposite the inspector's desk and Srinivas slaps Jamal who then stares at the ground. The inspector points the remote control at the TV. The fiveyearold Jamal squats over a hole in a makeshift shanty toilet while Salim sits guard outside. A man rushes down towards the toilets as Prakash leans over painfully. Jamal pulls his pants up and old clips of Amitabh's 70's action films play. A helicopter flies over Jamal's roofless loo. Salim jams his chair against the door locking Jamal in. Through a hole in the wall Jamal sees hundreds of men women and children flock to the runway. He kicks the door in vain and takes out of his pocket a creased photo of his hero Amitabh Bachchan. He looks down through the hole in the floor to the cesspit beneath looks from the cesspit to the photo and back then pinches his nose and jumps keeping one arm aloft to hold the photo clear of the effluent. Amitabh descends from his helicopter to cheering crowds. Jamal appears covered from head to toe in excrement dashes towards Amitabh making his way through the crowds of photographers and onlookers. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Salim stands at the front of the crowd hemmed in by security. In the distance we see Jamal running holding onto his photo of Amitabh. The crowd parts for stinking Jamal who makes straight for Amitabh. Salim stares at his brother in disbelief as people hold their noses. Amitabh signs the photo and hands it back to Jamal. A hazy orange sun rises above the teeming streets slums and skyscrapers of Mumbai. Jamal's mother scrubs him with soap while Salim looks back at his brother mischievously and disappears. A man sits next to a film projector in a cinema as Salim enters the projectionist's booth and shows him Jamal's autographed photo of Amitabh. The man thrusts the photo into the light from the projector hands Salim two coins and Salim winks and salutes. the man then bumps into Jamal outside. Jamal is on the video and the policemen stare at him. Jamal concentrates hard and smiles briefly. Trains speed through a slum as Jamal's mother washes brightly colored clothing in a pool while young. Jamal and Salim frolic in the water. Their mother smiles at the two boys playing but suddenly turns to look at the trains worried and scared. The train passes by revealing a crowd of men wielding clubs knives and axes running towards them and people drop what they are doing and flee."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The teacher sees Salim and Jamal. The boys fight over the book and he grabs the book and whacks it over Jamal's head. In the present day back in the police station Srinivas inserts a VHS into a player. Jamal is slumped in a chair opposite the inspector's desk and Srinivas slaps Jamal who then stares at the ground. The inspector points the remote control at the TV. The fiveyearold Jamal squats over a hole in a makeshift shanty toilet while Salim sits guard outside. A man rushes down towards the toilets as Prakash leans over painfully. Jamal pulls his pants up and old clips of Amitabh's 70's action films play. The man thrusts the photo into the light from the projector hands Salim two coins and Salim winks and salutes. the man then bumps into Jamal outside. Jamal is on the video and the policemen stare at him. Jamal concentrates hard and smiles briefly. Trains speed through a slum as Jamal's mother washes brightly colored clothing in a pool while young. Jamal and Salim frolic in the water. Their mother smiles at the two boys playing but suddenly turns to look at the trains worried and scared. The train passes by revealing a crowd of men wielding clubs knives and axes running towards them and people drop what they are doing and flee."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The teacher sees Salim and Jamal. The boys fight over the book and he grabs the book and whacks it over Jamal's head. In the present day back in the police station Srinivas inserts a VHS into a player. Trains speed through a slum as Jamal's mother washes brightly colored clothing in a pool while young. Jamal and Salim frolic in the water. Their mother smiles at the two boys playing but suddenly turns to look at the trains worried and scared. The train passes by revealing a crowd of men wielding clubs knives and axes running towards them and people drop what they are doing and flee."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The giraffe spots Lucy and Gracie. The girls argue over the skateboard, and it snatches the skateboard and tosses it over Gracie's shoulders. In the current moment, back in the library, Officer Patel places a cassette into a stereo. Gracie is sprawled in a bean bag opposite the librarian's desk, and Patel nudges Gracie, who then gazes at the ceiling. The librarian aims the flashlight at the radio. The two-year-old Gracie kneels over a sandbox in a dilapidated playground while Lucy keeps watch nearby. A cat sprints towards the swings as Kevin leans over cautiously. Gracie pulls her hat on, and old snapshots of Leonardo's 90’s comedies play. A drone hovers over Gracie's topless tent. Lucy wedges her jacket against the gate, trapping Gracie inside. Through a gap in the fence, Gracie observes hundreds of cats, dogs, and raccoons swarm towards the parking lot. She pushes the gate uselessly and pulls from her bag a crumpled poster of her idol, Leonardo DiCaprio. She glances down through the gap in the ground to the muddy puddle below, looks from the puddle to the poster and back, then holds her breath and leaps, keeping one leg raised to shield the poster from the sludge. Leonardo descends from his drone to applauding fans. Gracie emerges covered from head to toe in mud, dashes towards Leonardo, weaving her way through the crowds of tourists and spectators. Lucy stands at the front of the crowd, boxed in by guards. In the distance, we see Gracie sprinting, clutching her poster of Leonardo. The crowd scatters for filthy Gracie, who heads directly for Leonardo. Lucy watches her sister in astonishment as people cover their faces. Leonardo scribbles on the poster and returns it to Gracie. A foggy blue moon rises above the bustling roads, markets, and skyscrapers of Tokyo. Gracie's father sprays her with a hose while Lucy glances at her sister mischievously and vanishes. A rabbit rests next to a lantern projector in a theater as Lucy slips into the technician's cabin and presents him Gracie's signed poster of Leonardo. The rabbit thrusts the poster into the glow from the lamp, grants Lucy two marbles, and Lucy nods and salutes the rabbit, then collides with Gracie outside. Gracie is on the screen, and the librarians gape at her. Gracie focuses intensely and grins briefly. Bicycles zoom through a neighborhood as Gracie's father washes vividly painted toys in a fountain while tiny Gracie and Lucy cavort in the puddle. Their father chuckles at the two girls splashing but suddenly turns to glance at the bicycles, anxious and concerned. The bicycle zips by, revealing a swarm of children wielding sticks, spoons, and rakes running towards them, and people abandon what they are building and dash away."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The teacher sees Salim and Jamal fighting over a book and hits Jamal with it. In the police station, Srinivas inserts a VHS, and Jamal sits slumped in front of the inspector. A flashback shows five-year-old Jamal in a shanty toilet, locked in by Salim as a helicopter with Amitabh Bachchan lands nearby. Jamal jumps into a cesspit to save a photo of his hero, emerges covered in excrement, and runs through the crowd to get Amitabh’s autograph. Back home, their mother bathes Jamal, while Salim mischievously sells the signed photo for coins. In the present, Jamal concentrates as policemen watch him on video. Meanwhile, his mother, worried, watches trains pass, revealing a violent mob approaching, causing panic and flight among people."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The train passes by revealing a crowd of men wielding clubs knives and axes running towards them and people drop what they are doing and flee Their mother smiles at the two boys playing but suddenly turns to look at the trains worried and scared Jamal and Salim frolic in the water Trains speed through a slum as Jamal's mother washes brightly colored clothing in a pool while young Jamal concentrates hard and smiles briefly Jamal is on the video and the policemen stare at him the man then bumps into Jamal outside The man thrusts the photo into the light from the projector hands Salim two coins and Salim winks and salutes A man sits next to a film projector in a cinema as Salim enters the projectionist's booth and shows him Jamal's autographed photo of Amitabh Jamal's mother scrubs him with soap while Salim looks back at his brother mischievously and disappears A hazy orange sun rises above the teeming streets slums and skyscrapers of Mumbai Amitabh signs the photo and hands it back to Jamal Salim stares at his brother in disbelief as people hold their noses The crowd parts for stinking Jamal who makes straight for Amitabh In the distance we see Jamal running holding onto his photo of Amitabh Salim stands at the front of the crowd hemmed in by security Jamal appears covered from head to toe in excrement dashes towards Amitabh making his way through the crowds of photographers and onlookers Amitabh descends from his helicopter to cheering crowds He looks down through the hole in the floor to the cesspit beneath looks from the cesspit to the photo and back then pinches his nose and jumps keeping one arm aloft to hold the photo clear of the effluent He kicks the door in vain and takes out of his pocket a creased photo of his hero Amitabh Bachchan Through a hole in the wall Jamal sees hundreds of men women and children flock to the runway Salim jams his chair against the door locking Jamal in A helicopter flies over Jamal's roofless loo Jamal pulls his pants up and old clips of Amitabh's 70's action films play A man rushes down towards the toilets as Prakash leans over painfully The fiveyearold Jamal squats over a hole in a makeshift shanty toilet while Salim sits guard outside The inspector points the remote control at the TV Jamal is slumped in a chair opposite the inspector's desk and Srinivas slaps Jamal who then stares at the ground In the present day back in the police station Srinivas inserts a VHS into a player The boys fight over the book and he grabs the book and whacks it over Jamal's head The teacher sees Salim and Jamal"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The boys fight over the book and he grabs the book and whacks it over Jamal's head The teacher sees Salim and Jamal Jamal is slumped in a chair opposite the inspector's desk and Srinivas slaps Jamal who then stares at the ground In the present day back in the police station Srinivas inserts a VHS into a player The fiveyearold Jamal squats over a hole in a makeshift shanty toilet while Salim sits guard outside The inspector points the remote control at the TV Jamal pulls his pants up and old clips of Amitabh's 70's action films play A man rushes down towards the toilets as Prakash leans over painfully Salim jams his chair against the door locking Jamal in A helicopter flies over Jamal's roofless loo He kicks the door in vain and takes out of his pocket a creased photo of his hero Amitabh Bachchan Through a hole in the wall Jamal sees hundreds of men women and children flock to the runway Amitabh descends from his helicopter to cheering crowds He looks down through the hole in the floor to the cesspit beneath looks from the cesspit to the photo and back then pinches his nose and jumps keeping one arm aloft to hold the photo clear of the effluent Salim stands at the front of the crowd hemmed in by security Jamal appears covered from head to toe in excrement dashes towards Amitabh making his way through the crowds of photographers and onlookers The crowd parts for stinking Jamal who makes straight for Amitabh In the distance we see Jamal running holding onto his photo of Amitabh Amitabh signs the photo and hands it back to Jamal Salim stares at his brother in disbelief as people hold their noses Jamal's mother scrubs him with soap while Salim looks back at his brother mischievously and disappears A hazy orange sun rises above the teeming streets slums and skyscrapers of Mumbai The man thrusts the photo into the light from the projector hands Salim two coins and Salim winks and salutes A man sits next to a film projector in a cinema as Salim enters the projectionist's booth and shows him Jamal's autographed photo of Amitabh Jamal is on the video and the policemen stare at him the man then bumps into Jamal outside Trains speed through a slum as Jamal's mother washes brightly colored clothing in a pool while young Jamal concentrates hard and smiles briefly Their mother smiles at the two boys playing but suddenly turns to look at the trains worried and scared Jamal and Salim frolic in the water The train passes by revealing a crowd of men wielding clubs knives and axes running towards them and people drop what they are doing and flee"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "In the distance we see Jamal running holding onto his photo of Amitabh The crowd parts for stinking Jamal who makes straight for Amitabh Salim stares at his brother in disbelief as people hold their noses Amitabh signs the photo and hands it back to Jamal A hazy orange sun rises above the teeming streets slums and skyscrapers of Mumbai Jamal's mother scrubs him with soap while Salim looks back at his brother mischievously and disappears A man sits next to a film projector in a cinema as Salim enters the projectionist's booth and shows him Jamal's autographed photo of Amitabh The man thrusts the photo into the light from the projector hands Salim two coins and Salim winks and salutes the man then bumps into Jamal outside Jamal is on the video and the policemen stare at him Jamal concentrates hard and smiles briefly Trains speed through a slum as Jamal's mother washes brightly colored clothing in a pool while young Jamal and Salim frolic in the water Their mother smiles at the two boys playing but suddenly turns to look at the trains worried and scared The train passes by revealing a crowd of men wielding clubs knives and axes running towards them and people drop what they are doing and flee The teacher sees Salim and Jamal The boys fight over the book and he grabs the book and whacks it over Jamal's head In the present day back in the police station Srinivas inserts a VHS into a player Jamal is slumped in a chair opposite the inspector's desk and Srinivas slaps Jamal who then stares at the ground The inspector points the remote control at the TV The fiveyearold Jamal squats over a hole in a makeshift shanty toilet while Salim sits guard outside A man rushes down towards the toilets as Prakash leans over painfully Jamal pulls his pants up and old clips of Amitabh's 70's action films play A helicopter flies over Jamal's roofless loo Salim jams his chair against the door locking Jamal in Through a hole in the wall Jamal sees hundreds of men women and children flock to the runway He kicks the door in vain and takes out of his pocket a creased photo of his hero Amitabh Bachchan He looks down through the hole in the floor to the cesspit beneath looks from the cesspit to the photo and back then pinches his nose and jumps keeping one arm aloft to hold the photo clear of the effluent Amitabh descends from his helicopter to cheering crowds Jamal appears covered from head to toe in excrement dashes towards Amitabh making his way through the crowds of photographers and onlookers Salim stands at the front of the crowd hemmed in by security"
        }
      ]
    }
  ]
}