{
  "ground_truth": "Maman kneels at the entrance and strokes Salim's foot, waking him up and handing him a Coke. Jamal also wakes and is given a Coke, and Maman pats him on the back, smiling. The boys grin and gulp down their drinks. A minibus drives through lush countryside, full of scruffy street kids gazing out the windows. The bus arrives at a large, dilapidated residence where numerous children play in the yard, some on crutches and others on swings. Salim smiles, and the children on the bus jump around excitedly. Maman watches as the children are fed a hot meal, while Jamal catches Maman staring at the new arrivals. In the evening, Maman lines up the new children and closes his eyes, listening to Arvind sing before patting him on the head. Arvind moves back in line, and Salim steps out to sing, but Maman screws up his face and buries his head in his hands. He strikes Latika and punches Punnoose's thighs as everyone laughs. The next day, Salim sits with Punnoose in the bus, intently watching a group of kids on a Mumbai street, then approaches the gang of children, claps his hands, and slaps a giggling child before snatching a baby from her and pretending to drop it in front of Latika. The gang of children run into the busy street, some limping with crutches and others with missing hands, shaking containers at people to beg for money or food. Latika, wearing an eye patch, begs at a stationary car window. At midnight in Maman's compound, Jamal points at some dried chillies, and Latika, wearing rubber gloves, picks up and crushes them in her palms. She sneaks into the dormitory, where all the children are sleeping, finds Salim sleeping naked under a thin sheet, and carefully stuffs the chillies over his groin before sneaking back to her side of the dormitory. Salim jerks awake and dashes to the tap, dousing his groin in cold water, while Punnoose wakes up and points at Latika. Jamal and Latika giggle and smile at each other. A bearded henchman lights a candle as Arvind sings for Maman, who holds up his hand. Punnoose shakes a bottle into a cloth and quickly smothers Arvind's face with it. Salim looks on, eyes wide and mouth agape, as Arvind collapses and Punnoose lifts his limp body to a table. Salim obeys, while the bearded man burns a sizzling liquid in a spoon over the flame.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Maman kneels at the portal and caresses Salim's foot, rousing him and handing him a Coke. Jamal also awakens and is given a Coke, and Maman pats him on the back, beaming. The boys grin and quaff down their beverages. A minibus cruises through verdant countryside, full of scruffy street kids gazing out the panes. The bus reaches a large, dilapidated domicile where numerous children frolic in the yard, some on crutches and others on swings. Salim beams, and the children on the bus bounce around eagerly. Maman observes as the children are served a hot repast, while Jamal notices Maman staring at the new arrivals. In the evening, Maman lines up the new children and closes his eyes, listening to Arvind sing before patting him on the head. Arvind moves back in line, and Salim steps out to sing, but Maman contorts his face and buries his head in his hands. He strikes Latika and punches Punnoose's thighs as everyone laughs. The next day, Salim sits with Punnoose in the bus, intently observing a group of kids on a Mumbai street, then approaches the gang of children, claps his hands, and slaps a giggling child before snatching a baby from her and pretending to drop it in front of Latika. The gang of children rush into the bustling street, some hobbling with crutches and others with missing hands, shaking containers at people to beg for money or food. Latika, wearing an eye patch, begs at a stationary car pane. At midnight in Maman's compound, Jamal points at some dried chillies, and Latika, wearing rubber gloves, picks up and crushes them in her palms. She sneaks into the dormitory, where all the children are sleeping, finds Salim sleeping naked under a thin sheet, and carefully stuffs the chillies over his groin before sneaking back to her side of the dormitory. Salim jerks awake and dashes to the tap, dousing his groin in cold water, while Punnoose wakes up and points at Latika. Jamal and Latika chuckle and smile at each other. A bearded henchman lights a candle as Arvind sings for Maman, who holds up his hand. Punnoose shakes a bottle into a cloth and quickly smothers Arvind's face with it. Salim looks on, eyes wide and mouth agape, as Arvind collapses and Punnoose lifts his limp body to a table. Salim complies, while the bearded man burns a sizzling liquid in a spoon over the flame."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Maman kneels at the entrance, and Salim's foot is stroked to wake him up, and a Coke is handed to him. Jamal is also woken by Maman and receives a Coke, and Jamal is patted on the back with a smile. The drinks are gulped down by the grinning boys. Lush countryside is driven through by a minibus, which is full of scruffy street kids who gaze out the windows. A large, dilapidated residence is arrived at by the bus, where numerous children play in the yard, some on crutches and others on swings. A smile spreads on Salim's face, and excitement makes the children on the bus jump around. The children are watched by Maman as they are fed a hot meal, while Jamal stares at the new arrivals whom Maman watches. In the evening, the new children are lined up by Maman, and his eyes are closed to listen to Arvind sing before he pats Arvind on the head. The line is moved back into by Arvind, and a song is begun by Salim, but Maman screws up his face and buries his head in his hands. Latika is struck by him, and the thighs of Punnoose are punched amidst everyone’s laughter. The next day, Punnoose sits with Salim on the bus, a group of kids on a Mumbai street being intently watched by them. Salim approaches the gang of children, hand claps and slaps a giggling child before a baby is snatched from her by him, pretending to drop it in front of Latika. The busy street is run into by the gang of children, some limping with crutches and others with missing hands, and containers are shaken at people to beg for money or food. At a stationary car window, Latika, who wears an eye patch, begs. At midnight in Maman's compound, Jamal points at some dried chillies, and they are picked up and crushed by Latika, who wears rubber gloves. She sneaks into the dormitory, where all the children sleep, and a thin sheet is found covering Salim, who is sleeping naked, before the chillies are carefully stuffed over his groin by her. The other side of the dormitory is sneaked back to by Latika. Salim jerks awake, and his groin is doused in cold water as he dashes to the tap, while Latika is pointed at by Punnoose, who wakes up. Jamal and Latika giggle and exchange smiles. A candle is lit by a bearded henchman as Arvind sings for Maman, who holds up his hand. A bottle is shaken into a cloth by Punnoose, who quickly smothers Arvind's face with it. Salim looks on, eyes wide and mouth agape, as Arvind collapses and his limp body is lifted to a table by Punnoose. Salim obeys, while the bearded man burns a sizzling liquid in a spoon over the flame."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Maman kneels at the entrance, waking Salim by stroking his foot and handing him a Coke, then does the same for Jamal. The boys smile and drink. A minibus carrying street kids arrives at a large, worn residence filled with playing children. Salim smiles as they enter, and Maman observes while the kids eat. In the evening, Maman listens to Arvind sing, pats him on the head, and reacts negatively to Salim's attempt. He hits Latika and Punnoose amid laughter. The next day, Salim sits with Punnoose on the bus, watches a group of kids, then approaches them, slaps a giggling child, and pretends to drop a baby. The kids beg in the busy street, some limping, others with missing hands. Latika, with an eye patch, begs at a car window. At midnight, Jamal points at dried chillies, and Latika crushes them, sneaks into the dormitory, and places them on Salim, who wakes and runs to rinse himself. Jamal and Latika giggle. Later, a henchman lights a candle as Arvind sings for Maman. Punnoose smothers Arvind with a cloth, and Salim watches, stunned, as Arvind collapses and is lifted to a table. Salim follows orders while the bearded man heats a liquid in a spoon over the flame."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Maman awakens Salim and Jamal, giving them Cokes. The boys drink happily. A minibus travels through lush countryside with street kids, arriving at a worn-out house where children play; some use crutches. Salim smiles. Maman watches them eat, and Jamal notices him observing newcomers. At night, Maman listens to Arvind sing and pats him. Salim sings, and Maman reacts negatively, hitting Latika and Punnoose. Salim later observes and joins street kids begging. Latika, wearing an eye patch, begs at car windows. At night, Latika grinds chillies over sleeping Salim, who awakes in discomfort, wetting his groin. Jamal and Latika giggle. A henchman lights a candle while Arvind sings for Maman, who signals Punnoose to subdue him with a cloth. Salim witnesses this, watching as Punnoose takes Arvind to a table. Salim obeys as a man heats a liquid over the flame."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Maman, with a gentle demeanor, kneels down gracefully at the entrance and tenderly strokes Salim's foot to rouse him from his slumber before handing him a chilled Coke. Similarly, Jamal is stirred awake and graciously receives his own refreshing Coke, which prompts Maman to give him an affectionate pat on the back while smiling warmly. The boys respond with wide grins and eagerly gulp down their fizzy drinks with delight. Meanwhile, a minibus travels through the beautiful, lush countryside, packed with scruffy street kids who gaze out the windows with curious eyes. This bus soon reaches its destination, a large but visibly dilapidated residence where a multitude of children are playing energetically in the yard. Among them, some of the children rely on crutches while others enjoy the swings. Salim's face lights up with a smile, and the children aboard the bus bounce around in excitement. Maman observes as these children are served a hot, nourishing meal, while Jamal notices Maman's intent gaze directed at the new arrivals. As evening approaches, Maman lines up the newcomers and, with a sense of ceremony, closes his eyes to listen as Arvind sings beautifully before giving him a gentle pat on the head. Arvind dutifully returns to his place in line, and Salim steps forward to perform his song. However, Maman reacts with displeasure, screwing up his face and burying his head in his hands. In a moment of violence, he strikes Latika and punches Punnoose's thighs, provoking laughter from the onlookers. The following day, Salim is seen seated on the bus alongside Punnoose, watching a group of kids on a busy Mumbai street with intense focus. He approaches the gang of children, claps his hands loudly, and playfully slaps a giggling child prior to snatching a baby from her arms and pretending to drop it in front of Latika in jest. The gang of children quickly disperse into the bustling street; some are hobbling on crutches, and others are missing hands, as they shake containers at passersby in a bid to solicit money or food. Latika, distinctive with her eye patch, begs at the window of a stationary car. At the stroke of midnight within Maman's compound, Jamal points discreetly at some dried chillies, prompting Latika, who is wearing protective rubber gloves, to pick them up and crush them carefully in her palms. She then stealthily sneaks into the dormitory where all the children are peacefully sleeping, locates Salim lying unclothed under a thin sheet, and meticulously stuffs the crushed chillies over his groin. Satisfied with her prank, she silently retreats to her side of the dormitory. Salim awakens with a start and rushes to the tap, splashing cold water onto his groin, while Punnoose awakens and knowingly points at Latika. Jamal and Latika share a conspiratorial giggle and exchange smiles. A bearded henchman lights a candle during this time, providing a backdrop for Arvind's singing performance for Maman, who signals for him to stop by raising his hand. Simultaneously, Punnoose shakes a bottle's contents into a cloth and swiftly covers Arvind's face, rendering him unconscious. Salim watches, his eyes wide with shock and mouth agape, as Arvind collapses and is carried by Punnoose over to a table. Following instructions, Salim complies, while the bearded man burns a sizzling liquid in a spoon over the candle's flame."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Maman, with her gentle and kind demeanor, gracefully kneels down at the entrance and tenderly strokes Salim’s foot with a soft touch to rouse him gently from his slumber before handing him a chilled can of Coke. In a similar fashion, Jamal is stirred awake from his sleep and graciously receives his own refreshing Coke, prompting Maman to give him an affectionate pat on the back while smiling warmly and kindly. The boys respond to this gesture with wide, joyful grins, eagerly gulping down their fizzy drinks with unrestrained delight. Meanwhile, a minibus makes its way through the beautiful, lush countryside, packed full with scruffy street kids who glance out of the windows with curious and wide-eyed expressions. This bus soon reaches its intended destination, a large yet visibly dilapidated residence where a multitude of children are playing energetically and joyfully in the yard. Among these lively children, some rely on crutches for support while others are enjoying the swings. Salim's face lights up with a bright smile, and the children aboard the bus bounce around in visible excitement. Maman observes attentively as these children are served a hot and nourishing meal, all the while Jamal notices Maman's intent gaze specifically directed at the new arrivals. As the evening approaches and the day draws closer to an end, Maman lines up the newcomers and, with a sense of ceremony and anticipation, closes his eyes to listen as Arvind sings beautifully, before giving him a gentle pat on the head in approval. Arvind dutifully returns to his place in line, making way for Salim, who steps forward to perform his song. However, Maman reacts with visible displeasure, screwing up his face in disappointment and burying his head in his hands. In a sudden moment of violence, he strikes Latika and punches Punnoose’s thighs, provoking embarrassing laughter from the onlookers. The following day, Salim is seen seated quietly on the bus alongside Punnoose, watching a group of kids on a busy Mumbai street with an intense focus. He approaches the gang of children, claps his hands loudly to get their attention, and playfully slaps a giggling child before snatching a baby from her arms and pretending, in jest, to drop it in front of Latika. The gang of children quickly disperse into the bustling, lively street; some are hobbling on crutches, while others are missing hands, as they shake containers at passersby in a hopeful bid to solicit money or food. Latika, distinctive with her eye patch, begs at the window of a stationary car. At the stroke of midnight within the confines of Maman’s compound, Jamal points discreetly with a whisper at some dried chillies, prompting Latika, who is wearing protective rubber gloves, to pick them up carefully and crush them meticulously in her palms. She then stealthily sneaks into the dormitory, where all the children are peacefully sleeping, locates Salim lying unclothed under a thin sheet, and thoroughly stuffs the crushed chillies over his groin. Satisfied with her mischievous prank, she silently retreats back to her side of the dormitory. Salim awakens with a sudden start and rushes to the tap, splashing cold water onto his groin, while Punnoose awakens and knowingly points at Latika, understanding her prank. Jamal and Latika share a conspiratorial giggle and exchange knowing smiles. During this time, a bearded henchman lights a flickering candle, providing a warm, glowing backdrop for Arvind's singing performance for Maman, who signals for him to stop by raising his hand deliberately. Simultaneously, Punnoose shakes the contents of a bottle into a cloth and swiftly covers Arvind's face, rendering him immediately unconscious. Salim watches this unfold, his eyes wide with shock and his mouth agape, as Arvind collapses to the ground and is carried by Punnoose over to a table. Following instructions without hesitation, Salim complies, while the bearded man burns a sizzling liquid in a spoon over the candle's flame."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Maman lowers himself to his knees at the entrance, reaching out to gently stroke Salim's foot, which prompts Salim to gradually awaken from his slumber. As Salim's eyes open, Maman hands him a chilled Coke, and a moment later, Jamal, stirred from sleep, receives his own Coke from Maman, who affectionately pats him on the back with a smile on his face. The boys, now fully awake, exchange grins and eagerly tip their heads back, gulping down their drinks with noticeable enthusiasm. Meanwhile, a minibus makes its way through the lush expanse of countryside, its windows filled with the curious gazes of scruffy street kids taking in the scenery. The bus eventually comes to a halt in front of a sprawling, yet visibly dilapidated residence, where a lively scene unfolds as numerous children engage in play within the yard, some maneuvering around on crutches while others enjoy the swings. Salim's face lights up with a smile, and the children aboard the bus bounce around in their seats, unable to contain their excitement. Maman stands back, observing as the children are served a hot meal, his eyes darting to Jamal, who catches Maman's intent gaze directed at the newcomers. As evening descends, Maman orchestrates a lineup of the new arrivals, closing his eyes to fully immerse himself in listening to Arvind sing, then showing his approval with a gentle pat on Arvind's head. Arvind retreats to his place in line, making way for Salim to step forward and sing. However, Maman's expression turns to one of disapproval as he scrunches up his face and buries his head in his hands. In a sudden outburst, he strikes Latika and delivers a punch to Punnoose's thighs, eliciting laughter from the onlookers. The following day, Salim sits alongside Punnoose on the bus, his attention fixed on a cluster of kids gathered on a Mumbai street. He takes the initiative to approach the gang of children, clapping his hands with authority and playfully slapping a giggling child before theatrically snatching a baby from her arms and pretending to let it fall before Latika. In response, the group of children dashes into the bustling street, some hobbling with crutches, while others, missing hands, energetically shake containers in an effort to solicit money or food from passersby. Meanwhile, Latika, adorned with an eye patch, pleads for alms at the window of a stationary car. As midnight envelops Maman's compound, Jamal draws attention to a bundle of dried chillies, prompting Latika, now equipped with rubber gloves, to pick them up and meticulously crush them within her palms. With stealthy movements, she slips into the dormitory, where children lay in a deep slumber, and locates Salim, who is sleeping naked under a thin sheet. She cautiously stuffs the crushed chillies over his exposed groin, then silently retreats to her side of the dormitory. The potent sensation causes Salim to abruptly awaken, prompting him to rush to the tap and pour cold water over his groin in a desperate bid for relief. Punnoose, now awake, gestures toward Latika, signaling her involvement, while Jamal and Latika exchange amused giggles and smiles with each other. At another moment, a bearded henchman strikes a match to light a candle as Arvind begins to sing for Maman, who raises his hand in acknowledgment. Watching closely, Punnoose swiftly shakes a bottle into a cloth before deftly covering Arvind's face with it, effectively rendering him unconscious. Salim, standing transfixed, with his eyes widened and mouth agape, witnesses Arvind's body go limp and watches as Punnoose lifts him onto a table, complying with the silent order as the bearded man heats a liquid in a spoon over the candle's flame, the sizzling sound filling the room."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Maman gently awakens Salim and Jamal at the entrance, handing each a Coke, which they gratefully drink. As they travel by minibus through lush countryside, the boys, along with other scruffy street kids, look out the windows. Upon arriving at a large, worn residence filled with children, some using crutches and others on swings, Salim smiles, and the bus kids burst with excitement. Maman observes as they are served a hot meal, while Jamal notices Maman's interest in the newcomers. Later, Maman assembles the new arrivals and listens to Arvind sing, acknowledging him with a pat before reacting disapprovingly to Salim's attempt to perform. Amid laughter, he hits Latika and Punnoose. The following day, Salim observes a group of kids begging on a Mumbai street, then joins them, playfully slapping a child and teasing Latika by pretending to drop a baby. The children, some with crutches or missing hands, run into the street, shaking cans to beg. Latika, wearing an eye patch, begs at a car window. At midnight, Latika uses rubber gloves to crush dried chillies pointed out by Jamal and sneaks them into Salim's bed. Salim wakes in pain, rushes to the tap for relief, and Jamal and Latika share a conspiratorial giggle. Meanwhile, as Arvind sings for Maman, a bearded henchman lights a candle. Punnoose drugs Arvind, who collapses and is placed on a table, as Salim watches in shock while the henchman prepares a substance over a flame."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Maman, who runs a notorious orphanage known for exploiting street children, kneels at the entrance and strokes Salim's foot, waking him up and handing him a Coke, a rare treat for children in his care. Jamal also wakes and is given a Coke, and Maman pats him on the back, smiling a smile that hides his darker intentions. The boys grin and gulp down their fizzy drinks. A minibus drives through the lush countryside of rural India, full of scruffy street kids gazing out the windows, perhaps dreaming of a better life. The bus arrives at a large, dilapidated residence in Mumbai, a city bustling with stark contrasts of wealth and poverty, where numerous children play in the yard, some on crutches and others on swings, symbols of their lost innocence. Salim smiles, oblivious to the darker undertones, and the children on the bus jump around excitedly. Maman watches as the children are fed a hot meal, a luxury not often afforded to them, while Jamal catches Maman staring at the new arrivals with a calculating gaze. In the evening, Maman lines up the new children and closes his eyes, listening to Arvind sing, a momentary test of their usefulness, before patting him on the head. Arvind, whose voice echoes a hope for better days, moves back in line, and Salim steps out to sing, but Maman screws up his face and buries his head in his hands, disapprovingly. He strikes Latika, a young girl marked by resilience, and punches Punnoose's thighs as everyone laughs, masking the pain with forced humor. The next day, Salim sits with Punnoose in the bus, intently watching a group of kids on a Mumbai street, a harsh environment that hardens even the softest hearts, then approaches the gang of children, claps his hands, and slaps a giggling child before snatching a baby from her and pretending to drop it in front of Latika. The gang of children run into the busy street, some limping with crutches and others with missing hands, victims of life's brutalities, shaking containers at people to beg for money or food. Latika, wearing an eye patch after a tragic accident orchestrated by Maman, begs at a stationary car window. At midnight in Maman's compound, the place where dreams are twisted into nightmares, Jamal points at some dried chillies, and Latika, wearing rubber gloves to protect her hands, picks up and crushes them in her palms. She sneaks into the dormitory, the only sanctuary the children know, where all the children are sleeping, finds Salim sleeping naked under a thin sheet, and carefully stuffs the chillies over his groin before sneaking back to her side of the dormitory. Salim jerks awake and dashes to the tap, dousing his groin in cold water, while Punnoose wakes up and points at Latika, revealing her mischievous act. Jamal and Latika giggle and smile at each other, finding joy in small rebellions. A bearded henchman, known for his ruthless enforcement of Maman's rules, lights a candle as Arvind sings for Maman, who holds up his hand, signaling silence. Punnoose shakes a bottle into a cloth and quickly smothers Arvind's face with it, a cruel tactic used to subdue him. Salim looks on, eyes wide and mouth agape, as Arvind collapses and Punnoose lifts his limp body to a table. Salim obeys, while the bearded man burns a sizzling liquid in a spoon over the flame, a grim preparation for an unspeakable act."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Maman kneels at the entrance and strokes Salim's foot waking him up and handing him a Coke. Jamal also wakes and is given a Coke and Maman pats him on the back smiling. The boys grin and gulp down their drinks. A minibus drives through lush countryside full of scruffy street kids gazing out the windows. The bus arrives at a large dilapidated residence where numerous children play in the yard some on crutches and others on swings. Salim smiles and the children on the bus jump around excitedly. Maman watches as the children are fed a hot meal while Jamal catches Maman staring at the new arrivals. In the evening Maman lines up the new children and closes his eyes listening to Arvind sing before patting him on the head. Arvind moves back in line and Salim steps out to sing but Maman screws up his face and buries his head in his hands. He strikes Latika and punches Punnoose's thighs as everyone laughs. The next day Salim sits with Punnoose in the bus intently watching a group of kids on a Mumbai street. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. then approaches the gang of children claps his hands and slaps a giggling child before snatching a baby from her and pretending to drop it in front of Latika. The gang of children run into the busy street some limping with crutches and others with missing hands shaking containers at people to beg for money or food. Latika wearing an eye patch begs at a stationary car window. At midnight in Maman's compound Jamal points at some dried chillies and Latika wearing rubber gloves picks up and crushes them in her palms. She sneaks into the dormitory where all the children are sleeping finds Salim sleeping naked under a thin sheet and carefully stuffs the chillies over his groin before sneaking back to her side of the dormitory. Salim jerks awake and dashes to the tap dousing his groin in cold water while Punnoose wakes up and points at Latika. Jamal and Latika giggle and smile at each other. A bearded henchman lights a candle as Arvind sings for Maman who holds up his hand. Punnoose shakes a bottle into a cloth and quickly smothers Arvind's face with it. Salim looks on eyes wide and mouth agape as Arvind collapses and Punnoose lifts his limp body to a table. Salim obeys while the bearded man burns a sizzling liquid in a spoon over the flame."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Maman kneels at the entrance and strokes Salim's foot waking him up and handing him a Coke. Jamal also wakes and is given a Coke and Maman pats him on the back smiling. The boys grin and gulp down their drinks. A minibus drives through lush countryside full of scruffy street kids gazing out the windows. The bus arrives at a large dilapidated residence where numerous children play in the yard some on crutches and others on swings. Salim smiles and the children on the bus jump around excitedly. Maman watches as the children are fed a hot meal while Jamal catches Maman staring at the new arrivals. In the evening Maman lines up the new children and closes his eyes listening to Arvind sing before patting him on the head. Arvind moves back in line and Salim steps out to sing but Maman screws up his face and buries his head in his hands. He strikes Latika and punches Punnoose's thighs as everyone laughs. The next day Salim sits with Punnoose in the bus intently watching a group of kids on a Mumbai street. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. then approaches the gang of children claps his hands and slaps a giggling child before snatching a baby from her and pretending to drop it in front of Latika. The gang of children run into the busy street some limping with crutches and others with missing hands shaking containers at people to beg for money or food. Latika wearing an eye patch begs at a stationary car window. At midnight in Maman's compound Jamal points at some dried chillies and Latika wearing rubber gloves picks up and crushes them in her palms. She sneaks into the dormitory where all the children are sleeping finds Salim sleeping naked under a thin sheet and carefully stuffs the chillies over his groin before sneaking back to her side of the dormitory. Salim jerks awake and dashes to the tap dousing his groin in cold water while Punnoose wakes up and points at Latika. Jamal and Latika giggle and smile at each other. A bearded henchman lights a candle as Arvind sings for Maman who holds up his hand. Punnoose shakes a bottle into a cloth and quickly smothers Arvind's face with it. Salim looks on eyes wide and mouth agape as Arvind collapses and Punnoose lifts his limp body to a table. Salim obeys while the bearded man burns a sizzling liquid in a spoon over the flame."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Maman kneels at the entrance and strokes Salim's foot waking him up and handing him a Coke. Jamal also wakes and is given a Coke and Maman pats him on the back smiling. The boys grin and gulp down their drinks. A minibus drives through lush countryside full of scruffy street kids gazing out the windows. The bus arrives at a large dilapidated residence where numerous children play in the yard some on crutches and others on swings. Salim smiles and the children on the bus jump around excitedly. Jamal and Latika giggle and smile at each other. A bearded henchman lights a candle as Arvind sings for Maman who holds up his hand. Punnoose shakes a bottle into a cloth and quickly smothers Arvind's face with it. Salim looks on eyes wide and mouth agape as Arvind collapses and Punnoose lifts his limp body to a table. Salim obeys while the bearded man burns a sizzling liquid in a spoon over the flame."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Maman kneels at the entrance and strokes Salim's foot waking him up and handing him a Coke. Jamal also wakes and is given a Coke and Maman pats him on the back smiling. The boys grin and gulp down their drinks. Salim looks on eyes wide and mouth agape as Arvind collapses and Punnoose lifts his limp body to a table. Salim obeys while the bearded man burns a sizzling liquid in a spoon over the flame."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Ginger perches at the gateway and tickles Raj's ear, stirring him up and offering him a juice box. Peter also stirs and is handed a juice box, and Ginger taps him on the shoulder, chuckling. The boys chuckle and sip their beverages. A tractor rolls through vast farmland, full of unruly farmhands staring out the windshields. The tractor reaches a towering, tattered barn where numerous goats scamper in the field, some with bells and others in hats. Raj grins, and the goats on the tractor dance around merrily. Ginger observes as the goats munch on a cool salad, while Peter spots Ginger glancing at the brand-new animals. At dusk, Ginger lines up the fresh goats and shuts his eyes, listening to Kiran bleat before tapping her on the ear. Kiran trots back in line, and Raj trots out to bleat, but Ginger frowns and covers his ears with his paws. He yells at Priya and kicks Sam's legs as everyone chuckles. The following morning, Raj lounges with Sam on the tractor, eagerly watching a flock of hens on a Bangalore path, then ambles to the group of birds, snaps his fingers, and shakes a cackling hen before grabbing a chick from her and pretending to toss it in front of Priya. The flock of birds waddle into the bustling road, some hobbling with bells and others with missing feathers, swinging buckets at farmers to harass for seed or grain. Priya, sporting a bandana, squawks at a parked van window. At noon in Ginger's pen, Peter gestures at some dusty spices, and Priya, sporting oven mitts, scoops up and crushes them in her beak. She creeps into the silo, where all the animals are snoozing, discovers Raj sleeping curled up under a thin tarp, and gingerly sprinkles the spices over his paw before slipping back to her corner of the silo. Raj jolts awake and rushes to the trough, splashing his paw in fresh water, while Sam wakes up and gestures at Priya. Peter and Priya snicker and grin at each other. A whiskered caretaker strikes a match as Kiran bleats for Ginger, who raises his paw. Sam pours a jug into a rag and swiftly covers Kiran's beak with it. Raj watches, eyes wide and jaw dropped, as Kiran collapses and Sam hefts her floppy form to a bale. Raj complies, while the whiskered man boils a sweet syrup in a pot over the spark."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Maman wakes Salim and Jamal, giving them Cokes and smiling warmly. The boys, among other scruffy street kids, are taken to a run-down residence filled with children playing. Maman observes the new arrivals during a meal, focusing on Salim and others. At night, he listens to Arvind sing, then reacts negatively to Salim's attempt. The next day, Salim mischievously interacts with other street kids in Mumbai, who beg using various tactics. Latika, with an eye patch, also begs. Later, Latika, in a playful act of revenge, crushes dried chilies and sprinkles them over Salim while he sleeps, causing him to wake and douse himself with water. Jamal and Latika find amusement in the prank. In a disturbing scene, a henchman lights a candle as Arvind sings for Maman. Punnoose knocks Arvind out with chloroform, and Salim watches in shock as Arvind is placed on a table."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Salim obeys while the bearded man burns a sizzling liquid in a spoon over the flame Salim looks on eyes wide and mouth agape as Arvind collapses and Punnoose lifts his limp body to a table Punnoose shakes a bottle into a cloth and quickly smothers Arvind's face with it A bearded henchman lights a candle as Arvind sings for Maman who holds up his hand Jamal and Latika giggle and smile at each other Salim jerks awake and dashes to the tap dousing his groin in cold water while Punnoose wakes up and points at Latika She sneaks into the dormitory where all the children are sleeping finds Salim sleeping naked under a thin sheet and carefully stuffs the chillies over his groin before sneaking back to her side of the dormitory At midnight in Maman's compound Jamal points at some dried chillies and Latika wearing rubber gloves picks up and crushes them in her palms Latika wearing an eye patch begs at a stationary car window The gang of children run into the busy street some limping with crutches and others with missing hands shaking containers at people to beg for money or food then approaches the gang of children claps his hands and slaps a giggling child before snatching a baby from her and pretending to drop it in front of Latika The next day Salim sits with Punnoose in the bus intently watching a group of kids on a Mumbai street He strikes Latika and punches Punnoose's thighs as everyone laughs Arvind moves back in line and Salim steps out to sing but Maman screws up his face and buries his head in his hands In the evening Maman lines up the new children and closes his eyes listening to Arvind sing before patting him on the head Maman watches as the children are fed a hot meal while Jamal catches Maman staring at the new arrivals Salim smiles and the children on the bus jump around excitedly The bus arrives at a large dilapidated residence where numerous children play in the yard some on crutches and others on swings A minibus drives through lush countryside full of scruffy street kids gazing out the windows The boys grin and gulp down their drinks Jamal also wakes and is given a Coke and Maman pats him on the back smiling Maman kneels at the entrance and strokes Salim's foot waking him up and handing him a Coke"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Jamal also wakes and is given a Coke and Maman pats him on the back smiling Maman kneels at the entrance and strokes Salim's foot waking him up and handing him a Coke A minibus drives through lush countryside full of scruffy street kids gazing out the windows The boys grin and gulp down their drinks Salim smiles and the children on the bus jump around excitedly The bus arrives at a large dilapidated residence where numerous children play in the yard some on crutches and others on swings In the evening Maman lines up the new children and closes his eyes listening to Arvind sing before patting him on the head Maman watches as the children are fed a hot meal while Jamal catches Maman staring at the new arrivals He strikes Latika and punches Punnoose's thighs as everyone laughs Arvind moves back in line and Salim steps out to sing but Maman screws up his face and buries his head in his hands then approaches the gang of children claps his hands and slaps a giggling child before snatching a baby from her and pretending to drop it in front of Latika The next day Salim sits with Punnoose in the bus intently watching a group of kids on a Mumbai street Latika wearing an eye patch begs at a stationary car window The gang of children run into the busy street some limping with crutches and others with missing hands shaking containers at people to beg for money or food She sneaks into the dormitory where all the children are sleeping finds Salim sleeping naked under a thin sheet and carefully stuffs the chillies over his groin before sneaking back to her side of the dormitory At midnight in Maman's compound Jamal points at some dried chillies and Latika wearing rubber gloves picks up and crushes them in her palms Jamal and Latika giggle and smile at each other Salim jerks awake and dashes to the tap dousing his groin in cold water while Punnoose wakes up and points at Latika Punnoose shakes a bottle into a cloth and quickly smothers Arvind's face with it A bearded henchman lights a candle as Arvind sings for Maman who holds up his hand Salim obeys while the bearded man burns a sizzling liquid in a spoon over the flame Salim looks on eyes wide and mouth agape as Arvind collapses and Punnoose lifts his limp body to a table"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "then approaches the gang of children claps his hands and slaps a giggling child before snatching a baby from her and pretending to drop it in front of Latika The gang of children run into the busy street some limping with crutches and others with missing hands shaking containers at people to beg for money or food Latika wearing an eye patch begs at a stationary car window At midnight in Maman's compound Jamal points at some dried chillies and Latika wearing rubber gloves picks up and crushes them in her palms She sneaks into the dormitory where all the children are sleeping finds Salim sleeping naked under a thin sheet and carefully stuffs the chillies over his groin before sneaking back to her side of the dormitory Salim jerks awake and dashes to the tap dousing his groin in cold water while Punnoose wakes up and points at Latika Jamal and Latika giggle and smile at each other A bearded henchman lights a candle as Arvind sings for Maman who holds up his hand Punnoose shakes a bottle into a cloth and quickly smothers Arvind's face with it Salim looks on eyes wide and mouth agape as Arvind collapses and Punnoose lifts his limp body to a table Salim obeys while the bearded man burns a sizzling liquid in a spoon over the flame Maman kneels at the entrance and strokes Salim's foot waking him up and handing him a Coke Jamal also wakes and is given a Coke and Maman pats him on the back smiling The boys grin and gulp down their drinks A minibus drives through lush countryside full of scruffy street kids gazing out the windows The bus arrives at a large dilapidated residence where numerous children play in the yard some on crutches and others on swings Salim smiles and the children on the bus jump around excitedly Maman watches as the children are fed a hot meal while Jamal catches Maman staring at the new arrivals In the evening Maman lines up the new children and closes his eyes listening to Arvind sing before patting him on the head Arvind moves back in line and Salim steps out to sing but Maman screws up his face and buries his head in his hands He strikes Latika and punches Punnoose's thighs as everyone laughs The next day Salim sits with Punnoose in the bus intently watching a group of kids on a Mumbai street"
        }
      ]
    }
  ]
}