{
  "ground_truth": "The boys burst into the room. Jamal stares dumbfounded at Latika. She smiles in recognition. Maman and his henchmen stand at the door. Punnoose's face is now badly scarred. She avoids Maman's eyes but doesn't move. He reaches over and grabs her roughly. Salim draws a revolver from behind his back and points it at the men. Jamal looks astonished at his brother. Maman draws closer. Maman leers at Salim. Salim places a cushion over the gun. Jamal recoils in horror. And the men tremble. Latika rushes to take Maman's money from the floor. Jamal is rooted to the spot. The three children flee the scene. On the game show, Jamal looks deep in thought. The host points his hand at Jamal mimicking holding a gun. The scene of Maman's death replays. The host looks down at his computer screen. Young Salim, Jamal, and Latika sneak past the sleeping guard and break into a brand-new but unoccupied hotel. They run up a deceased elevator into an atrium door with an enormous gold chandelier. Inside the hotel room, Salim gleefully pours two bottles of spirit into a pot while Jamal picks a towel out of a cupboard. Jamal shakes the dusty towel and takes it to the bathroom door. Salim gulps down some beer. Salim suddenly looks solemn and leaves the room. Salim steps out onto the street. Jamal has his eyes closed and head turned away from a semi-naked Latika. She smiles as he squeezes his eyes tightly shut. She goes back into the bathroom. He keeps his eyes closed for a moment more then slowly opens them. Salim crosses a road busy with tuk-tuks, cars, bicycles, and carts. He approaches a cinema kiosk, hands over a coin, and receives the ticket. On a large balcony above the cinema, six men are drinking and playing a gambling game. None of the men notices Salim as he steps onto the balcony and swaggers over. They ignore Salim as he takes out his gun from behind his back. He points it at one of the men's heads. Salim slowly turns to face Javed, he nods. Javed beckons to Salim. In the hotel room, Jamal and Latika lie on a mattress on the floor. Latika makes graceful hand shadows on the wall. Her arms are painted in intricate gold and henna designs. They stare at each other for a long time. Salim returns to the room. Jamal and Latika snoozing on the mattress. Salim stands over Latika. Both Latika and Jamal wake up. He holds out his hand for Latika. He leans towards Latika. Jamal rushes Salim. Salim eventually overpowers the smaller Jamal and ejects him from the room. Salim emerges, pointing a gun.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The lads explode into the chamber. Jamal gazes stupefied at Latika. She grins in acknowledgment. Maman and his thugs stand at the entrance. Punnoose's visage is now severely disfigured. She dodges Maman's gaze but doesn't budge. He reaches over and seizes her harshly. Salim extracts a pistol from behind his torso and aims it at the men. Jamal looks amazed at his sibling. Maman steps nearer. Maman sneers at Salim. Salim places a pillow over the weapon. Jamal shrinks in terror. And the men shiver. Latika rushes to collect Maman's cash from the floor. Jamal is fixed to the spot. The three youngsters escape the locale. On the quiz show, Jamal looks pensive. The host directs his hand at Jamal imitating holding a pistol. The scene of Maman's demise replays. The host looks down at his computer monitor. Young Salim, Jamal, and Latika creep past the dozing guard and infiltrate a fresh but vacant inn. They dash up a defunct lift into an atrium doorway with a massive gold candelabrum. Inside the hotel suite, Salim joyfully pours two bottles of liquor into a container while Jamal selects a cloth out of a closet. Jamal agitates the dusty cloth and carries it to the washroom doorway. Salim swallows some ale. Salim abruptly looks grave and departs from the chamber. Salim steps out onto the roadway. Jamal has his eyes shut and head turned away from a semi-clothed Latika. She grins as he clenches his eyes firmly shut. She returns to the washroom. He keeps his eyes shut for an instant more then gradually opens them. Salim crosses a thoroughfare crowded with tuk-tuks, automobiles, bicycles, and carts. He approaches a movie booth, hands over a coin, and obtains the ticket. On a large terrace above the cinema, six men are drinking and playing a betting game. None of the men notices Salim as he steps onto the terrace and struts over. They disregard Salim as he takes out his pistol from behind his torso. He aims it at one of the men's heads. Salim slowly turns to confront Javed, he nods. Javed gestures to Salim. In the hotel suite, Jamal and Latika lie on a mattress on the floor. Latika creates elegant hand silhouettes on the wall. Her arms are adorned in intricate gold and henna patterns. They gaze at each other for a long while. Salim returns to the suite. Jamal and Latika dozing on the mattress. Salim stands over Latika. Both Latika and Jamal awaken. He extends his hand for Latika. He leans towards Latika. Jamal charges Salim. Salim ultimately subdues the smaller Jamal and expels him from the suite. Salim emerges, aiming a pistol."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The room was burst into by the boys. Latika is stared at dumbfounded by Jamal. A smile of recognition is offered by her. The door is stood at by Maman and his henchmen. Punnoose now has a badly scarred face. Maman's eyes are avoided by her, but she doesn't move. She is roughly grabbed by him. A revolver is drawn by Salim from behind his back and is pointed at the men. Astonishment is shown by Jamal at his brother. Closer is moved by Maman. Maman leers at Salim. A cushion is placed over the gun by Salim. Horror causes Jamal to recoil. Trembling is done by the men. Maman's money is rushed to and taken from the floor by Latika. Jamal is rooted to the spot. The scene is fled by the three children. On the game show, deep thought is shown by Jamal. Jamal is pointed at by the host with his hand mimicking holding a gun. The scene of Maman's death is replayed. The computer screen is looked down at by the host. The sleeping guard is sneaked past by young Salim, Jamal, and Latika, and a brand-new but unoccupied hotel is broken into by them. A deceased elevator is run up by them into an atrium door with an enormous gold chandelier. Inside the hotel room, two bottles of spirit are gleefully poured into a pot by Salim while a towel is picked out of a cupboard by Jamal. The dusty towel is shaken by Jamal and taken to the bathroom door. Some beer is gulped down by Salim. Salim suddenly looks solemn and the room is left by him. The street is stepped out onto by Salim. Jamal has his eyes closed and head turned away from a semi-naked Latika. A smile is given by her as he squeezes his eyes tightly shut. The bathroom is returned to by her. His eyes are kept closed by him for a moment more, then they are slowly opened. A road busy with tuk-tuks, cars, bicycles, and carts is crossed by Salim. A cinema kiosk is approached by him, a coin is handed over, and the ticket is received. On a large balcony above the cinema, drinking and playing a gambling game are done by six men. Salim is not noticed as he steps onto the balcony and swaggers over. His gun is taken out from behind his back by him and is ignored by them. The gun is pointed at one of the men's heads by Salim. Javed is faced by Salim slowly, and Salim is nodded at by him. Salim is beckoned by Javed. In the hotel room, Jamal and Latika are lying on a mattress on the floor. Graceful hand shadows are made on the wall by Latika. Intricate gold and henna designs are painted on her arms. Their eyes are locked for a long time. The room is returned to by Salim. Jamal and Latika are snoozing on the mattress. Latika is stood over by Salim. Both Latika and Jamal are woken up. For Latika, his hand is held out by him. He leans towards Latika. Salim is rushed by Jamal. The smaller Jamal is eventually overpowered by Salim, and Jamal is ejected from the room by him. Salim emerges, a gun is pointed by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The boys burst into the room, with Jamal staring dumbfounded at Latika, who smiles in recognition. Maman and his henchmen are at the door, Punnoose's face scarred. She avoids Maman's eyes, but he grabs her. Salim draws a revolver from behind and points it at them. Jamal is astonished. Salim places a cushion over the gun as the men tremble. Latika grabs Maman's money from the floor. The children flee. On the game show, Jamal looks pensive while the host mimics holding a gun. The scene of Maman's death replays. Young Salim, Jamal, and Latika sneak past a sleeping guard into an empty hotel, running to an atrium with a gold chandelier. Salim pours spirit into a pot while Jamal picks a towel and heads to the bathroom. Salim drinks beer, looks solemn, and leaves the room. On the street, he crosses through bustling traffic, buys a cinema ticket, and approaches a balcony where men gamble and drink. Salim draws his gun and points it at a man's head, then nods to Javed, who beckons him. Back in the hotel, Jamal and Latika lie on a mattress, watching her hand shadows. Her arms are painted in intricate gold and henna. They stare at each other until Salim returns, waking Jamal and Latika. Salim holds out his hand to Latika, causing Jamal to rush him. Salim overpowers Jamal and ejects him, emerging with a gun pointed."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The boys storm in. Jamal is shocked to see Latika, who smiles at him. Maman and his crew appear. Punnoose's face is scarred. Latika avoids Maman's gaze and is grabbed roughly. Salim draws a revolver at them. Jamal is amazed at his brother. Salim covers the gun with a cushion. Jamal recoils, and the men tremble. Latika grabs Maman's money, and the children flee. On the game show, Jamal is thoughtful. The host mimics holding a gun as Maman's death is recalled. The host looks at his screen. Young Salim, Jamal, and Latika sneak past a sleeping guard into a new, empty hotel, heading to a room with a chandelier. Salim pours spirits into a pot, Jamal picks a towel and shakes it. Salim drinks beer, looks serious, and leaves. Salim walks on a busy street to buy a cinema ticket. On a balcony above, six men drink and gamble, ignoring Salim as he draws his gun at one. He faces Javed, who signals to him. In the hotel, Jamal and Latika lie on a mattress, with Latika's hands casting shadows. Her arms have gold and henna designs. They gaze at each other. Salim returns, stands over the sleeping pair. Jamal and Latika awaken. Salim extends his hand to Latika, but Jamal charges. Salim overpowers Jamal and throws him out. Salim emerges, armed."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The boys abruptly and energetically burst into the room, their unexpected entrance creating a sudden flurry of activity. Jamal stands there, staring in sheer bewilderment and disbelief at Latika, who, in contrast, offers him a warm smile filled with recognition. At the entrance, Maman and his menacing henchmen stand ominously, casting long shadows as they crowd the doorway. Punnoose's face, now marked with deep and ugly scars, adds to the menacing atmosphere. Latika deliberately avoids making eye contact with Maman, yet she remains unmoving, frozen in place. Without hesitation, Maman reaches out and seizes her with a rough grip. In response, Salim reveals a hidden revolver, drawing it from behind his back, and threateningly levels it at the men. Jamal looks utterly shocked and amazed at his brother’s unexpected assertiveness. Maman steps forward, leering maliciously at Salim, who calmly and deliberately places a cushion over the gun to muffle its sound. Jamal recoils in horror at the unfolding situation, while the men tremble with fear. Seizing the moment, Latika quickly gathers Maman's scattered money from the floor. Jamal remains paralyzed, rooted to the spot by the unfolding chaos. With swift movements, the three children flee the scene, escaping the danger. Meanwhile, on the game show, Jamal appears deep in thought, wandering through memories. The host theatrically gestures towards Jamal, mimicking the act of holding a gun. A vivid replay of Maman's death scene flashes before Jamal's eyes. The host then looks down, focusing intently on his computer screen. In a different time and place, young Salim, Jamal, and Latika, acting like stealthy shadows, sneak past a sleeping guard to break into a brand-new yet unoccupied hotel. They dash excitedly up a defunct elevator and push through an atrium door adorned with an enormous, glimmering gold chandelier. Within the confines of the hotel room, Salim gleefully pours two bottles of spirit into a waiting pot, his excitement palpable. Jamming opens a cupboard and retrieves a dusty towel, shaking off the years of neglect as he carries it to the bathroom door. Salim takes a gulp of beer, savoring the moment. However, his demeanor shifts as he suddenly adopts a solemn expression, leaving the room with purpose. Salim steps out onto the bustling street, filled with a chaotic mix of tuk-tuks, cars, bicycles, and carts weaving around him. He makes his way to a cinema kiosk, hands over a coin, and receives a ticket in exchange. Above the cinema, on a large balcony, six men are engrossed in drinking and playing a lively gambling game, oblivious to Salim’s approach. Without drawing attention, Salim steps onto the balcony, swaggering towards them. Remaining unnoticed, he unholsters his gun from behind his back, aiming it with cold precision at one of the men’s heads. Salim slowly shifts his gaze, turning to face Javed, and nods in acknowledgment. Javed, in turn, beckons Salim over. Back in the hotel room, Jamal and Latika lie comfortably on a mattress spread out on the floor. Latika, with elegance, creates graceful hand shadows on the wall, her arms adorned with intricate gold and henna designs that catch the light. They gaze at each other in silence, sharing the moment for a long, drawn-out minute. Salim returns to the room, subtly changing the atmosphere. Jamal and Latika, now snoozing peacefully on the mattress, stir awake at his presence. Salim stands over Latika, extending his hand towards her. He leans in closely to Latika, creating an intimate tension. Jamal rushes at Salim in a protective, yet futile move, but Salim ultimately overpowers the smaller Jamal, forcefully ejecting him from the room. Emerging with authority, Salim points a gun decisively."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The boys, with an abruptness and energetic enthusiasm that could hardly be anticipated, suddenly burst into the room. Their unexpected entrance resulted in an immediate flurry of activity and commotion. Jamal stands there, planted firmly in place, staring with sheer bewilderment and disbelief at Latika, who, in stark contrast to his reaction, offers him a warm, welcoming smile filled with recognition. Meanwhile, at the very entrance of the room, Maman and his menacing henchmen stand with an ominous presence, their figures casting long, intimidating shadows as they crowd the doorway menacingly. The face of Punnoose, now marked by deep and ugly scars, contributes further to the threatening atmosphere. Latika deliberately avoids making any eye contact with Maman, yet despite the tension in the air, she remains completely unmoving, frozen in place as if paralyzed by the situation. \n\nWithout a moment’s hesitation, Maman reaches out toward her and seizes her with a rough, unkind grip. In response to this aggressive act, Salim reveals a hidden revolver, drawing it out from behind his back, and threateningly levels it at the menacing figures before him. Jamal looks utterly shocked and amazed by his brother’s newfound and unexpected assertiveness. Maman, undeterred, steps forward, leering maliciously at Salim, who calmly and deliberately places a cushion over the gun to muffle the sound of any potential shot. Jamal recoils in horror, overwhelmed by the chaotic and dangerous situation unfolding before his eyes. The men tremble visibly with fear at the sight. Seizing the chaotic moment, Latika quickly gathers Maman’s scattered money, which is strewn across the floor. Jamal remains immobile, as though paralyzed, rooted to the spot by the unfolding chaos. With swift, determined movements, the three children make their escape, fleeing the scene and the looming danger.\n\nMeanwhile, on the game show, Jamal appears to be deep in thought, as though lost in wandering through vivid memories. The host theatrically gestures toward Jamal, mimicking the act of holding a gun with exaggerated motions. A vivid replay of Maman’s death scene flashes vividly before Jamal’s eyes, like a haunting memory he cannot shake. The host then looks down, focusing intently on the computer screen in front of him. In a different time and place, young Salim, Jamal, and Latika, acting like stealthy shadows, sneak past a sleeping guard to break into a brand-new yet unoccupied hotel. They dash excitedly up a defunct, creaky elevator and energetically push through an atrium door adorned with an enormous, glimmering gold chandelier that catches and reflects the light. Within the confines of the hotel room, Salim gleefully pours not one, but two bottles of spirit into a waiting pot, his excitement clear and palpable. Jamal opens a cupboard and retrieves a dusty towel, shaking off the years of neglect as he carries it to the bathroom door with purpose. \n\nSalim takes a gulp of beer, savoring the moment while enjoying a brief respite. However, his demeanor shifts suddenly as he adopts a solemn expression, leaving the room with a sense of purpose. Salim steps out into the bustling street, filled with a chaotic mix of tuk-tuks, cars, bicycles, and carts weaving around him in every which way. He makes his way determinedly to a cinema kiosk, hands over a coin, and receives a ticket in exchange. Above the cinema, on a large and expansive balcony, six men are fully engrossed in drinking and playing a lively gambling game, utterly oblivious to Salim’s approach. Without drawing any unnecessary attention, Salim steps onto the balcony, swaggering towards them with confidence. Remaining unnoticed, he unholsters his gun from behind his back, aiming it with cold, unwavering precision at one of the men’s heads. Salim slowly shifts his gaze, turning deliberately to face Javed, and nods in acknowledgment. Javed, in turn, recognizes Salim’s gesture and beckons him over.\n\nBack in the hotel room, Jamal and Latika are comfortably lying together on a mattress spread out on the floor. Latika, with elegance, creates intricate and graceful hand shadows on the wall, her arms adorned with intricate gold and henna designs that catch the light beautifully. They gaze silently at each other, sharing the moment for what feels like a long, drawn-out minute of peace. Salim returns to the room, subtly altering the atmosphere with his presence. Jamal and Latika, who are now snoozing peacefully on the mattress, stir awake at the sound of his entrance. Salim stands over Latika, extending his hand gently towards her. He leans in closely to Latika, creating an intimate tension between them. Jamal rushes at Salim in a protective, yet ultimately futile move, but Salim, with his larger stature and strength, easily overpowers the smaller Jamal, forcefully ejecting him from the room. Emerging with authority, Salim points a gun decisively, exerting control over the situation."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The boys energetically burst into the room with an urgent commotion, drawing immediate attention to themselves. Jamal, taken aback, stands motionless as he locks eyes with Latika in disbelief, while Latika's familiar smile spreads across her face, signifying recognition and acknowledgment of their shared past. The doorframe fills with the imposing figures of Maman and his henchmen, making the space feel even more constricted and tense. Among them stands Punnoose, whose face is now dramatically altered by severe scars, marking the passage of time and past violence. Latika's gaze consciously avoids Maman's eyes, signaling her wariness and unspoken defiance, yet she remains fixed in her place. Without hesitation, Maman closes the distance between him and Latika, reaching out with a rough, commanding grip that captures her unwilling presence. In a sudden shift of events, Salim deftly retrieves a revolver hidden behind his back, swiftly pointing it towards the men, creating a palpable escalation in the room's tension. Jamal can only look on, shocked at his brother's daring boldness as Maman, undeterred, creeps closer still. Maman's gaze lingers provocatively on Salim, challenging him with an unnerving leer. In response, Salim carefully moves a cushion over the gun, a strategic precaution to muffle the sound of impending violence. The sight leaves Jamal recoiling in horror, while Maman's men are visibly shaken, trembling at the turn of events. Seizing the opportunity, Latika rushes forward, hurriedly gathering up the scattered bills of Maman's money from the floor. Jamal, overwrought by shock and indecision, finds himself immobilized, rooted to the spot as the three children hastily flee the chaotic scene. In stark contrast, on the game show stage, Jamal sits absorbed, deep in thought, as he processes the tumultuous memories. The host, in a dramatic gesture, extends his hand towards Jamal, mimicking the action of holding a gun, intensifying the memory's connection. The scene of Maman's death flashes in Jamal's mind, replaying with vivid clarity. Meanwhile, the host shifts his gaze downward, analyzing something on his computer screen. In a different time, young Salim, Jamal, and Latika move stealthily past a sleeping guard, expertly breaking into a pristine yet unoccupied hotel. They sprint quickly up the defunct elevator shaft, bursting through an atrium door to reveal an opulent space adorned with a magnificent gold chandelier. Once inside the hotel room, Salim eagerly uncaps two bottles of spirits, exuberantly pouring them into a large pot, while Jamal rummages through a cupboard to pull out a dusty towel. Jamal shakes the towel briskly, freeing it of dust, before carrying it purposefully to the bathroom door. As Salim indulges in a long gulp of beer, his demeanor shifts, becoming somber and thoughtful, prompting him to exit the room with a newfound purpose. Salim steps onto the bustling street, navigating through a frenetic scene of tuk-tuks, cars, bicycles, and carts in disarray. He approaches a cinema kiosk, where he hands over a coin and receives a ticket in return. Above the cinema, on an expansive balcony, six men are engrossed in drinking and a gambling game, oblivious to Salim's approach. Casually, Salim steps onto the balcony, his presence unnoticed by the men, as he confidently swaggers over. Their inattention persists as Salim reveals his gun from behind his back, directing it steadily at one of the men’s heads in a silent threat. He turns slowly to confront Javed, exchanging a nod that signifies an unspoken understanding. Javed gestures for Salim to come closer, acknowledging him in the tense atmosphere. Back in the hotel room, Jamal and Latika lie comfortably on a mattress on the floor. Latika's hands dance gracefully, casting intricate shadows on the wall, her arms adorned with ornate gold and henna designs that tell a story of tradition and beauty. They gaze into each other's eyes, their connection deepening as time stretches languidly between them. Their tranquil moment is interrupted when Salim returns to the room, his presence looming over the sleeping forms of Jamal and Latika on the mattress. As they stir awake, Salim, with an air of authority, extends his hand towards Latika, an invitation layered with complexity. He leans in, his intention clear, and Jamal, propelled by a surge of emotion, rushes at Salim in a desperate bid to protect Latika. Despite his efforts, Jamal is ultimately overpowered by the stronger Salim, who forcibly ejects him from the room, asserting his dominance. Salim then emerges from the room, his grip firm on the gun, the weapon a symbol of his newfound power."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The boys burst into the room, and Jamal is stunned to see Latika, who smiles in recognition. Maman and his henchmen, including the scarred Punnoose, stand at the door. As Maman roughly grabs Latika, Salim draws a revolver, covers it with a cushion, and points it at the men. Jamal is horrified, and the men tremble in fear. Latika quickly collects Maman’s money from the floor before the three children flee. On the game show, Jamal reflects deeply while the host mimics holding a gun, recalling the scene of Maman's death. The host glances at his computer screen. Young Salim, Jamal, and Latika sneak past a sleeping guard and break into a new but empty hotel, running up a defunct elevator into a room with a grand chandelier. Inside, Salim pours spirits into a pot while Jamal finds and shakes a dusty towel for the bathroom. Salim drinks some beer, becomes solemn, and leaves the room. As Salim crosses a busy street, Jamal, with eyes closed, tries not to look at a semi-naked Latika, who smiles and returns to the bathroom. Salim buys a cinema ticket and steps onto a balcony where men are gambling, unnoticed. He draws a gun and points it at one man's head, then turns to Javed, who acknowledges him. Meanwhile, in the hotel room, Jamal and Latika lie on a mattress, she makes hand shadows, and they gaze at each other. Salim returns, and Jamal and Latika wake up. Salim reaches for Latika, but Jamal rushes him. Salim overpowers Jamal, ejects him from the room, and emerges pointing a gun."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The boys burst into the room, once part of an old warehouse now used as a hideout. Jamal stares dumbfounded at Latika, the girl they all thought had vanished a year ago. She smiles in recognition, recalling their shared childhood in the bustling streets of Mumbai. Maman, the feared local gangster known for trafficking children, and his henchmen stand menacingly at the door. Punnoose's face is now badly scarred, a grim reminder of his previous betrayals. She avoids Maman's eyes but doesn't move, aware that defiance could mean punishment. He reaches over and grabs her roughly, his reputation for cruelty well-founded. Salim draws a revolver, an old Colt model from behind his back and points it at the men, a move echoing the bravado of Bollywood heroes. Jamal looks astonished at his brother, never having seen him this bold. Maman draws closer, his eyes blazing with anger. Maman leers at Salim, the gesture meant to intimidate. Salim places a cushion over the gun, an old trick to muffle the sound of a shot. Jamal recoils in horror, fearing the violent turn of events. And the men tremble, suddenly unsure of their advantage. Latika rushes to take Maman's money from the floor, knowing it's her only chance of freedom. Jamal is rooted to the spot, paralyzed by fear and the weight of the moment. The three children flee the scene, escaping into the chaos of the city. On the game show, Jamal, now older and wiser, looks deep in thought, trying to recall the events that shaped him. The host, a famous TV personality known for his theatrics, points his hand at Jamal mimicking holding a gun. The scene of Maman's death replays in his mind, a haunting memory. The host looks down at his computer screen, searching for the next question. Young Salim, Jamal, and Latika sneak past the sleeping guard and break into a brand-new but unoccupied hotel, a symbol of the city's rapid economic growth. They run up a deceased elevator, its power long cut off, into an atrium door with an enormous gold chandelier, a relic from the hotel's grand opening. Inside the hotel room, Salim gleefully pours two bottles of spirit into a pot, the liquid sloshing as he dreams of grandeur while Jamal picks a towel out of a cupboard, its fabric worn by time. Jamal shakes the dusty towel and takes it to the bathroom door, a makeshift curtain for privacy. Salim gulps down some beer, a contraband from the nearby market. Salim suddenly looks solemn and leaves the room, a twinge of regret crossing his face. Salim steps out onto the street, alive with the chaotic rhythm of tuk-tuks, cars, bicycles, and carts, the lifeblood of Mumbai. He approaches a cinema kiosk, hands over a coin, and receives the ticket, the cinema a temporary escape for many. On a large balcony above the cinema, six men are drinking and playing a gambling game, the clatter of dice and clinking of glasses filling the air. None of the men notices Salim as he steps onto the balcony and swaggers over, the confidence of someone with a plan. They ignore Salim as he takes out his gun from behind his back, a reminder of his resolve. He points it at one of the men's heads, his hand steady. Salim slowly turns to face Javed, a notorious enforcer in the underworld, he nods, a silent agreement. Javed beckons to Salim, signaling a new alliance. In the hotel room, Jamal and Latika lie on a mattress on the floor, exhausted but safe for the moment. Latika makes graceful hand shadows on the wall, a childhood game bringing a moment of peace. Her arms are painted in intricate gold and henna designs, a celebration of their culture. They stare at each other for a long time, the silence filled with unspoken words. Salim returns to the room, carrying the weight of his choices. Jamal and Latika snoozing on the mattress, unaware of the change in their fate. Salim stands over Latika, conflicted emotions playing on his face. Both Latika and Jamal wake up, the tension in the room palpable. He holds out his hand for Latika, offering her a chance at a different path. He leans towards Latika, his expression softening. Jamal rushes Salim, driven by instinct to protect. Salim eventually overpowers the smaller Jamal and ejects him from the room, the act sealing their fate. Salim emerges, pointing a gun, a final warning to stay away."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The boys burst into the room. Jamal stares dumbfounded at Latika. She smiles in recognition. Maman and his henchmen stand at the door. Punnoose's face is now badly scarred. She avoids Maman's eyes but does not move. He reaches over and grabs her roughly. Salim draws a revolver from behind his back and points it at the men. Jamal looks astonished at his brother. Maman draws closer. Maman leers at Salim. Salim places a cushion over the gun. Jamal recoils in horror. And the men tremble. Latika rushes to take Maman's money from the floor. Jamal is rooted to the spot. The three children flee the scene. On the game show Jamal looks deep in thought. The host points his hand at Jamal mimicking holding a gun. The scene of Maman's death replays. The host looks down at his computer screen. Young Salim. Jamal and Latika sneak past the sleeping guard and break into a brandnew but unoccupied hotel. They run up a deceased elevator into an atrium door with an enormous gold chandelier. Inside the hotel room Salim gleefully pours two bottles of spirit into a pot. while Jamal picks a towel out of a cupboard. Jamal shakes the dusty towel and takes it to the bathroom door. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Salim gulps down some beer. Salim suddenly looks solemn and leaves the room. Salim steps out onto the street. Jamal has his eyes closed and head turned away from a seminaked Latika. She smiles as he squeezes his eyes tightly shut. She goes back into the bathroom. He keeps his eyes closed for a moment more then slowly opens them. Salim crosses a road busy with tuktuks cars bicycles and carts. He approaches a cinema kiosk hands over a coin and receives the ticket. On a large balcony above the cinema six men are drinking and playing a gambling game. None of the men notices Salim as he steps onto the balcony and swaggers over. They ignore Salim as he takes out his gun from behind his back. He points it at one of the men's heads. Salim slowly turns to face Javed. he nods Javed beckons to Salim. In the hotel room Jamal and Latika lie on a mattress on the floor. Latika makes graceful hand shadows on the wall. Her arms are painted in intricate gold and henna designs. They stare at each other for a long time. Salim returns to the room. Jamal and Latika snoozing on the mattress. Salim stands over Latika. Both Latika and Jamal wake up. He holds out his hand for Latika. He leans towards Latika. Jamal rushes Salim. Salim eventually overpowers the smaller Jamal and ejects him from the room. Salim emerges pointing a gun."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The boys burst into the room. Jamal stares dumbfounded at Latika. She smiles in recognition. Maman and his henchmen stand at the door. Punnoose's face is now badly scarred. She avoids Maman's eyes but does not move. He reaches over and grabs her roughly. Salim draws a revolver from behind his back and points it at the men. Jamal looks astonished at his brother. Maman draws closer. Maman leers at Salim. Salim places a cushion over the gun. Jamal recoils in horror. And the men tremble. Latika rushes to take Maman's money from the floor. Jamal is rooted to the spot. The three children flee the scene. On the game show Jamal looks deep in thought. The host points his hand at Jamal mimicking holding a gun. The scene of Maman's death replays. The host looks down at his computer screen. Young Salim. Jamal and Latika sneak past the sleeping guard and break into a brandnew but unoccupied hotel. They run up a deceased elevator into an atrium door with an enormous gold chandelier. Inside the hotel room Salim gleefully pours two bottles of spirit into a pot. while Jamal picks a towel out of a cupboard. Jamal shakes the dusty towel and takes it to the bathroom door. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Salim gulps down some beer. Salim suddenly looks solemn and leaves the room. Salim steps out onto the street. Jamal has his eyes closed and head turned away from a seminaked Latika. She smiles as he squeezes his eyes tightly shut. She goes back into the bathroom. He keeps his eyes closed for a moment more then slowly opens them. Salim crosses a road busy with tuktuks cars bicycles and carts. He approaches a cinema kiosk hands over a coin and receives the ticket. On a large balcony above the cinema six men are drinking and playing a gambling game. None of the men notices Salim as he steps onto the balcony and swaggers over. They ignore Salim as he takes out his gun from behind his back. He points it at one of the men's heads. Salim slowly turns to face Javed. he nods Javed beckons to Salim. In the hotel room Jamal and Latika lie on a mattress on the floor. Latika makes graceful hand shadows on the wall. Her arms are painted in intricate gold and henna designs. They stare at each other for a long time. Salim returns to the room. Jamal and Latika snoozing on the mattress. Salim stands over Latika. Both Latika and Jamal wake up. He holds out his hand for Latika. He leans towards Latika. Jamal rushes Salim. Salim eventually overpowers the smaller Jamal and ejects him from the room. Salim emerges pointing a gun."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The boys burst into the room. Jamal stares dumbfounded at Latika. She smiles in recognition. Maman and his henchmen stand at the door. Punnoose's face is now badly scarred. She avoids Maman's eyes but does not move. He reaches over and grabs her roughly. Salim draws a revolver from behind his back and points it at the men. Jamal looks astonished at his brother. Maman draws closer. Maman leers at Salim. Salim places a cushion over the gun. Jamal recoils in horror. And the men tremble. he nods Javed beckons to Salim. In the hotel room Jamal and Latika lie on a mattress on the floor. Latika makes graceful hand shadows on the wall. Her arms are painted in intricate gold and henna designs. They stare at each other for a long time. Salim returns to the room. Jamal and Latika snoozing on the mattress. Salim stands over Latika. Both Latika and Jamal wake up. He holds out his hand for Latika. He leans towards Latika. Jamal rushes Salim. Salim eventually overpowers the smaller Jamal and ejects him from the room. Salim emerges pointing a gun."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The boys burst into the room. Jamal stares dumbfounded at Latika. She smiles in recognition. Maman and his henchmen stand at the door. Punnoose's face is now badly scarred. Both Latika and Jamal wake up. He holds out his hand for Latika. He leans towards Latika. Jamal rushes Salim. Salim eventually overpowers the smaller Jamal and ejects him from the room. Salim emerges pointing a gun."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The giraffes galloped into the forest. Kevin gawks bewildered at Tanya. She frowns in puzzlement. Brian and his companions hover by the archway. Samuel's jacket is now brightly patterned. She ignores Brian's gaze but stays put. He leans over and pulls her lightly. Oliver draws a bow from beneath his vest and aims it at the zebras. Kevin looks astonished at his cousin. Brian shuffles nearer. Brian scowls at Oliver. Oliver places a blanket over the bow. Kevin flinches in surprise. And the zebras whimper. Tanya rushes to grab Brian's book from the shelf. Kevin is glued to the spot. The trio of foxes escape the setting. On the talent show, Kevin appears to be in deep concentration. The judge waves his hand at Kevin mimicking holding a lantern. The rerun of Brian's surprise repeats. The judge looks down at his newspaper. Young Oliver, Kevin, and Tanya slip past the resting doorman and sneak into a brand-new but unoccupied museum. They dash up a motionless escalator into a gallery arch with a massive silver sculpture. Inside the exhibit space, Oliver joyfully drizzles two bottles of paint into a cup while Kevin selects a shirt from a drawer. Kevin flaps the ancient shirt and carries it to the kitchen portal. Oliver gulps down some juice. Oliver suddenly appears thoughtful and exits the area. Oliver strides out onto the avenue. Kevin has his eyes closed and head turned away from a semi-visible Tanya. She grimaces as he squeezes his eyes tightly shut. She returns to the kitchen. He keeps his eyes shut for a moment longer then gradually opens them. Oliver crosses a boulevard bustling with scooters, trucks, skateboards, and wagons. He approaches a theater stall, trades a pebble, and receives the ticket. On a high terrace above the theater, six giraffes are sipping and partaking in a dice game. None of the giraffes notices Oliver as he steps onto the terrace and prances over. They disregard Oliver as he retrieves his bow from beneath his vest. He aims it at one of the giraffe's heads. Oliver gradually rotates to face Jack, he nods. Jack gestures to Oliver. In the museum room, Kevin and Tanya lounge on a carpet on the ground. Tanya creates elegant paper figures on the wall. Her sleeves are covered in intricate silver and ink designs. They gaze at each other for a considerable time. Oliver returns to the space. Kevin and Tanya dozing on the rug. Oliver looms over Tanya. Both Tanya and Kevin awaken. He extends his arm for Tanya. He leans towards Tanya. Kevin dashes at Oliver. Oliver ultimately subdues the smaller Kevin and evicts him from the area. Oliver appears, aiming a bow."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The boys burst into the room, and Jamal is shocked to see Latika, who acknowledges him with a smile. Maman and his henchmen arrive, with Punnoose looking scarred. Maman grabs Latika roughly, but Salim intervenes by pointing a gun at them, causing Jamal to recoil in horror. Latika seizes Maman's money, and the three children escape. During a game show, Jamal recalls the scene of Maman's death as the host pretends to hold a gun. Young Salim, Jamal, and Latika sneak into an empty hotel. Salim drinks beer and exits solemnly, while Jamal keeps his eyes shut from a semi-naked Latika. Salim approaches a cinema, unnoticed, and pulls a gun on one of the men there. Javed invites Salim over. In the hotel room, Jamal and Latika share a moment, but Salim returns, waking them up. He offers his hand to Latika, and Jamal attacks him, but Salim overpowers and expels him, emerging with a gun."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Salim emerges pointing a gun Salim eventually overpowers the smaller Jamal and ejects him from the room Jamal rushes Salim He leans towards Latika He holds out his hand for Latika Both Latika and Jamal wake up Salim stands over Latika Jamal and Latika snoozing on the mattress Salim returns to the room They stare at each other for a long time Her arms are painted in intricate gold and henna designs Latika makes graceful hand shadows on the wall In the hotel room Jamal and Latika lie on a mattress on the floor he nods Javed beckons to Salim Salim slowly turns to face Javed He points it at one of the men's heads They ignore Salim as he takes out his gun from behind his back None of the men notices Salim as he steps onto the balcony and swaggers over On a large balcony above the cinema six men are drinking and playing a gambling game He approaches a cinema kiosk hands over a coin and receives the ticket Salim crosses a road busy with tuktuks cars bicycles and carts He keeps his eyes closed for a moment more then slowly opens them She goes back into the bathroom She smiles as he squeezes his eyes tightly shut Jamal has his eyes closed and head turned away from a seminaked Latika Salim steps out onto the street Salim suddenly looks solemn and leaves the room Salim gulps down some beer Jamal shakes the dusty towel and takes it to the bathroom door while Jamal picks a towel out of a cupboard Inside the hotel room Salim gleefully pours two bottles of spirit into a pot They run up a deceased elevator into an atrium door with an enormous gold chandelier Jamal and Latika sneak past the sleeping guard and break into a brandnew but unoccupied hotel Young Salim The host looks down at his computer screen The scene of Maman's death replays The host points his hand at Jamal mimicking holding a gun On the game show Jamal looks deep in thought The three children flee the scene Jamal is rooted to the spot Latika rushes to take Maman's money from the floor And the men tremble Jamal recoils in horror Salim places a cushion over the gun Maman leers at Salim Maman draws closer Jamal looks astonished at his brother Salim draws a revolver from behind his back and points it at the men He reaches over and grabs her roughly She avoids Maman's eyes but does not move Punnoose's face is now badly scarred Maman and his henchmen stand at the door She smiles in recognition Jamal stares dumbfounded at Latika The boys burst into the room"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Jamal stares dumbfounded at Latika The boys burst into the room Maman and his henchmen stand at the door She smiles in recognition She avoids Maman's eyes but does not move Punnoose's face is now badly scarred Salim draws a revolver from behind his back and points it at the men He reaches over and grabs her roughly Maman draws closer Jamal looks astonished at his brother Salim places a cushion over the gun Maman leers at Salim And the men tremble Jamal recoils in horror Jamal is rooted to the spot Latika rushes to take Maman's money from the floor On the game show Jamal looks deep in thought The three children flee the scene The scene of Maman's death replays The host points his hand at Jamal mimicking holding a gun Young Salim The host looks down at his computer screen They run up a deceased elevator into an atrium door with an enormous gold chandelier Jamal and Latika sneak past the sleeping guard and break into a brandnew but unoccupied hotel while Jamal picks a towel out of a cupboard Inside the hotel room Salim gleefully pours two bottles of spirit into a pot Salim gulps down some beer Jamal shakes the dusty towel and takes it to the bathroom door Salim steps out onto the street Salim suddenly looks solemn and leaves the room She smiles as he squeezes his eyes tightly shut Jamal has his eyes closed and head turned away from a seminaked Latika He keeps his eyes closed for a moment more then slowly opens them She goes back into the bathroom He approaches a cinema kiosk hands over a coin and receives the ticket Salim crosses a road busy with tuktuks cars bicycles and carts None of the men notices Salim as he steps onto the balcony and swaggers over On a large balcony above the cinema six men are drinking and playing a gambling game He points it at one of the men's heads They ignore Salim as he takes out his gun from behind his back he nods Javed beckons to Salim Salim slowly turns to face Javed Latika makes graceful hand shadows on the wall In the hotel room Jamal and Latika lie on a mattress on the floor They stare at each other for a long time Her arms are painted in intricate gold and henna designs Jamal and Latika snoozing on the mattress Salim returns to the room Both Latika and Jamal wake up Salim stands over Latika He leans towards Latika He holds out his hand for Latika Salim eventually overpowers the smaller Jamal and ejects him from the room Jamal rushes Salim Salim emerges pointing a gun"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Salim suddenly looks solemn and leaves the room Salim steps out onto the street Jamal has his eyes closed and head turned away from a seminaked Latika She smiles as he squeezes his eyes tightly shut She goes back into the bathroom He keeps his eyes closed for a moment more then slowly opens them Salim crosses a road busy with tuktuks cars bicycles and carts He approaches a cinema kiosk hands over a coin and receives the ticket On a large balcony above the cinema six men are drinking and playing a gambling game None of the men notices Salim as he steps onto the balcony and swaggers over They ignore Salim as he takes out his gun from behind his back He points it at one of the men's heads Salim slowly turns to face Javed he nods Javed beckons to Salim In the hotel room Jamal and Latika lie on a mattress on the floor Latika makes graceful hand shadows on the wall Her arms are painted in intricate gold and henna designs They stare at each other for a long time Salim returns to the room Jamal and Latika snoozing on the mattress Salim stands over Latika Both Latika and Jamal wake up He holds out his hand for Latika He leans towards Latika Jamal rushes Salim Salim eventually overpowers the smaller Jamal and ejects him from the room Salim emerges pointing a gun The boys burst into the room Jamal stares dumbfounded at Latika She smiles in recognition Maman and his henchmen stand at the door Punnoose's face is now badly scarred She avoids Maman's eyes but does not move He reaches over and grabs her roughly Salim draws a revolver from behind his back and points it at the men Jamal looks astonished at his brother Maman draws closer Maman leers at Salim Salim places a cushion over the gun Jamal recoils in horror And the men tremble Latika rushes to take Maman's money from the floor Jamal is rooted to the spot The three children flee the scene On the game show Jamal looks deep in thought The host points his hand at Jamal mimicking holding a gun The scene of Maman's death replays The host looks down at his computer screen Young Salim Jamal and Latika sneak past the sleeping guard and break into a brandnew but unoccupied hotel They run up a deceased elevator into an atrium door with an enormous gold chandelier Inside the hotel room Salim gleefully pours two bottles of spirit into a pot while Jamal picks a towel out of a cupboard Jamal shakes the dusty towel and takes it to the bathroom door Salim gulps down some beer"
        }
      ]
    }
  ]
}