{
  "ground_truth": "Latika appears and gently pushes Salim's gun down as Jamal looks incredulous, with Salim pulling her back into the room, while Jamal remains rooted to the spot. Back in the police station, the inspector and Srinivas stare at the sweating Jamal, and Srinivas grins as Jamal leans over toward the inspector. Two other uniformed policemen rush into the room and eventually subdue a raging Jamal. The inspector wipes the sweat from his hands and face. Jamal carries a tray of tea at the call center, rushing around and delivering tea to the call center workers, who all sit at computers wearing headsets. Dave rushes off to a nearby TV showing the game show and signals to everyone to start dialing the number on their mobile phones. The readout indicates it has found over 26,000 Latikas as the name scrolls across the screen, and Jamal gulps and puts on his headset, while across the room, call center managers walk around, monitoring staff calls. Back on the game show, the host shakes his head, and the director hands him a check. Jamal is ascending in a lift on the construction site of a skyscraper, where hundreds of meters above, Salim waits. Jamal arrives at the open top floor with no walls, offering panoramic views of Mumbai, and sees a guy dressed in an expensive shirt, wearing jewelry and dark glasses. Salim smiles and removes his glasses as Jamal lunges for Salim, and they both fall off the building. Jamal blinks awake from his vision and punches Salim instead. Jamal and Salim sit on the edge of the building with the vast cityscape spread out before them, and Salim is phoned, then shakes his head as he watches his brother go. At night, in Salim's apartment, both are asleep until Salim gets up. Jamal opens his eyes but lies still, then sneaks to the landing to spy on Salim downstairs as he loads a gun and watches him kneel on a mat to pray. Salim touches his forehead to the ground, then leaves his apartment block and heads for his car. As Salim drives off, Jamal appears in a tuk-tuk, following closely behind. Salim's car pulls up to a sprawling palatial house situated on the hillside surrounded by construction sites, drives through the electronic gates, and Jamal's tuk-tuk then arrives outside the gates. Jamal jumps out and watches Salim approach a beautiful woman in dark glasses standing on a balcony. Salim collects a small package from her, then drives past the gates where Jamal is hiding. The young woman notices Jamal lurking at the entrance as a guard closes the gates, and the guard goes to the gatehouse while the woman removes her glasses for a better look at Jamal.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Latika manifests and softly nudges Salim's firearm downward as Jamal appears incredulous, with Salim tugging her back into the chamber, while Jamal remains fixed to the location. Back in the police precinct, the inspector and Srinivas gaze at the perspiring Jamal, and Srinivas beams as Jamal leans over toward the inspector. Two other uniformed officers dash into the chamber and eventually restrain a furious Jamal. The inspector wipes the perspiration from his palms and visage. Jamal carries a platter of tea at the call center, rushing about and conveying tea to the call center staff, who all sit at terminals wearing headsets. Dave dashes off to a nearby TV displaying the game show and signals to everyone to start dialing the numeral on their mobile devices. The readout indicates it has found over 26,000 Latikas as the designation scrolls across the display, and Jamal gulps and dons his headset, while across the chamber, call center supervisors stroll about, observing personnel dialogues. Back on the game show, the host shakes his head, and the director hands him a cheque. Jamal is ascending in a lift on the construction site of a tower, where hundreds of meters above, Salim awaits. Jamal arrives at the open top floor with no walls, offering sweeping views of Mumbai, and sees a man clad in a pricey shirt, adorned with jewelry and dark spectacles. Salim grins and removes his spectacles as Jamal lunges for Salim, and they both tumble off the structure. Jamal blinks awake from his vision and strikes Salim instead. Jamal and Salim sit on the edge of the structure with the vast cityscape spread out before them, and Salim is called, then shakes his head as he observes his sibling depart. At night, in Salim's flat, both are asleep until Salim rises. Jamal opens his eyes but remains still, then sneaks to the landing to spy on Salim below as he loads a gun and watches him kneel on a mat to pray. Salim touches his forehead to the ground, then leaves his flat block and heads for his vehicle. As Salim drives off, Jamal manifests in a tuk-tuk, following closely behind. Salim's vehicle pulls up to an expansive palatial residence situated on the hillside surrounded by construction sites, drives through the electronic gates, and Jamal's tuk-tuk then arrives outside the gates. Jamal leaps out and watches Salim approach a stunning woman in dark spectacles standing on a balcony. Salim collects a small parcel from her, then drives past the gates where Jamal is lurking. The young woman notices Jamal skulking at the entrance as a guard closes the gates, and the guard proceeds to the gatehouse while the woman removes her spectacles for a better look at Jamal."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Latika appears and Salim's gun is gently pushed down by her as Jamal looks incredulous, with her being pulled back into the room by Salim, while Jamal remains rooted to the spot. Back in the police station, Jamal is stared at by the inspector and Srinivas, and a grin is displayed by Srinivas as Jamal leans over toward the inspector. Two other uniformed policemen rush into the room and eventually subdue him as he rages. Sweat is wiped from the inspector's hands and face. A tray of tea is carried by Jamal at the call center, and tea is delivered by him to the call center workers, who all sit at computers wearing headsets. Dave rushes off to a nearby TV showing the game show and signals to everyone to start dialing the number on their mobile phones. Over 26,000 Latikas are found by the readout as the name scrolls across the screen, and Jamal gulps and puts on his headset, while across the room, staff calls are monitored by call center managers walking around. Back on the game show, the host shakes his head, and a check is handed to him by the director. Jamal ascends in a lift on the construction site of a skyscraper, where hundreds of meters above, Salim waits. Jamal arrives at the open top floor with no walls, offering panoramic views of Mumbai, and sees a guy dressed in an expensive shirt, wearing jewelry and dark glasses. Salim smiles and his glasses are removed by him as Jamal lunges for Salim, and they both fall off the building. Jamal blinks awake from his vision and punches Salim instead. The edge of the building is sat on by Jamal and Salim with the vast cityscape spread out before them, and a phone call is received by Salim, then his head is shaken as he watches his brother go. At night, in Salim's apartment, both are asleep until Salim gets up. Jamal opens his eyes but lies still, then he sneaks to the landing to spy on Salim downstairs as a gun is loaded by him and watches Salim kneel on a mat to pray. Salim touches his forehead to the ground, then his apartment block is left by him and his car is headed for. As Salim drives off, Jamal appears in a tuk-tuk, following closely behind. Salim's car pulls up to a sprawling palatial house situated on the hillside surrounded by construction sites, drives through the electronic gates, and Jamal's tuk-tuk then arrives outside the gates. Jamal jumps out and watches him approach a beautiful woman in dark glasses standing on a balcony. A small package is collected by Salim from her, then Salim drives past the gates where Jamal is hiding. Jamal is noticed by the young woman as he lurks at the entrance as the gates are closed by a guard, and the gatehouse is approached by the guard while the woman removes her glasses for a better look at Jamal."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Latika intervenes by gently pushing Salim's gun down, while Jamal stands frozen. Back at the police station, the inspector and Srinivas watch the sweating Jamal; Srinivas grins as Jamal leans toward the inspector. Two policemen enter and eventually subdue the enraged Jamal. The inspector wipes sweat from his face and hands. At the call center, Jamal delivers tea to workers at computers. Dave hurries to a TV showing the game show and prompts everyone to dial the number on their phones. The readout displays over 26,000 Latikas as Jamal gulps, dons his headset, and managers monitor calls. On the game show, the host shakes his head as the director hands him a check. Jamal ascends a skyscraper under construction, where Salim waits. On the open top floor, Jamal sees a man in an expensive shirt with jewelry and shades. Salim smiles, removes his glasses, and Jamal lunges, causing both to nearly fall. Jamal awakens from his vision and punches Salim instead. They sit on the edge with the cityscape sprawling below; Salim shakes his head as he sees Jamal leave. At night, in Salim's apartment, Salim rises while Jamal spies on him loading a gun, then kneeling to pray. Salim exits and heads for his car, with Jamal following in a tuk-tuk. Salim arrives at a palatial house with construction nearby, drives through electronic gates, and Jamal follows. As Salim meets a woman with dark glasses on a balcony and receives a package, Jamal hides outside. The woman notices Jamal lurking as a guard closes the gates, removes her glasses to get a better look at him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Latika gently lowers Salim's gun, pulling him back as Jamal stands frozen. At the police station, the inspector and Srinivas observe Jamal, with Srinivas grinning. Two policemen subdue Jamal. The inspector wipes sweat away. Jamal serves tea at a call center; Dave signals workers to dial a game show number. Over 26,000 Latikas appear on screen; Jamal gulps and dons a headset. The game show host gets a check. Jamal ascends a skyscraper lift, meeting Salim at the top. Salim smiles as Jamal lunges, both falling off. Jamal awakens, punches Salim. They sit on the edge overlooking Mumbai. Salim gets a call, watches Jamal leave. At night, Jamal spies on Salim, sees him load a gun, pray, and leave in his car, with Jamal following in a tuk-tuk. Salim arrives at a grand house, collects a package from a woman in dark glasses. As Salim drives past, Jamal watches. The woman notices Jamal as the guard closes the gates, removing her glasses for a better look."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Latika makes her presence known and softly pushes Salim’s gun down, while Jamal looks utterly incredulous. Salim pulls her back into the room, leaving Jamal standing there, completely rooted to the spot. Meanwhile, back in the police station, the inspector and Srinivas fix their gaze on the perspiring Jamal. Srinivas grins knowingly as Jamal leans forward toward the inspector. In the midst of this, two other uniformed policemen come rushing into the room, and after a brief struggle, they manage to subdue the furious Jamal. The inspector takes a moment to wipe the sweat off his hands and face. Shifting to a busy call center, Jamal carries a tray laden with cups of tea, rushing around and diligently delivering the steaming drinks to call center workers, who are all seated at their respective computers, wearing headsets. Dave quickly darts off to a nearby television set broadcasting the game show, signaling to everyone to promptly start dialing the number displayed on their mobile phones. The readout on the screen indicates it has found over 26,000 Latikas as the name scrolls across continuously, causing Jamal to gulp nervously as he dons his own headset. Across the room, call center managers pace around, vigilantly monitoring the staff's calls. Back on the game show, the host shakes his head in disbelief, and the director steps in to hand him a check. Meanwhile, Jamal is ascending via a lift at the construction site of a towering skyscraper, and high above, hundreds of meters in the air, Salim waits. Jamal arrives at the open top floor, which has no walls, allowing for sweeping panoramic views of the vast city of Mumbai. There, he spots a man clad in an expensive shirt, adorned with jewelry and wearing dark sunglasses. Salim smiles and removes his glasses just as Jamal lunges at him, resulting in both of them toppling off the building. Suddenly, Jamal blinks awake from this vision and opts to punch Salim instead. The two brothers then sit on the edge of the building, the sprawling cityscape unfurled before them. Salim receives a phone call and shakes his head as he watches his brother depart. Later that night, within Salim’s apartment, both are asleep until Salim rises. Jamal opens his eyes, choosing to remain still, then quietly sneaks to the landing to spy on Salim downstairs. He watches as Salim loads a gun and kneels on a mat to pray, touching his forehead to the ground. Afterwards, Salim exits the apartment block and heads toward his car. As Salim drives away, Jamal emerges in a tuk-tuk, closely following him. Salim's car eventually pulls up to a sprawling, palatial house situated on a hillside, surrounded by numerous construction sites. He drives through the electronically controlled gates, and soon after, Jamal’s tuk-tuk arrives outside the gates. Jamal quickly jumps out and watches as Salim approaches a beautiful woman wearing dark glasses who stands on a balcony. Salim collects a small package from her and then drives past the gates, where Jamal continues to hide. The young woman, with keen observation, notices Jamal lingering at the entrance. As a guard moves to close the gates, she removes her glasses for a clearer look at Jamal, while the guard retreats to the gatehouse."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Latika subtly yet decisively makes her presence felt by gently pushing Salim’s gun downward, while Jamal stands there looking utterly shocked and incredulous at the unfolding situation. Salim reacts by pulling Latika back into the room, leaving Jamal standing rooted to the spot, unable to move from the shock. Meanwhile, back at the bustling police station, the inspector and Srinivas fix their intense gazes on the visibly perspiring Jamal. A knowing grin spreads across Srinivas's face as Jamal leans forward, inching closer toward the inspector. Amidst this tense atmosphere, two additional uniformed policemen burst into the room, and after a brief but intense struggle, they succeed in subduing the frantically furious Jamal. The inspector takes a moment to pause, wiping away the sweat from his hands and face, a gesture of brief reprieve in the turmoil.\n\nShifting scenes to a busy and vibrant call center, Jamal navigates the bustling environment with a tray filled with cups of hot, steaming tea. He diligently rushes around, delivering these refreshing beverages to call center workers, each engaged at their computers and speaking into their headsets. Dave, in a quick motion, darts off to a nearby television set that is broadcasting the popular game show, signaling urgently to everyone around to start dialing the displayed number on their mobile phones. The readout on the screen scrolls continuously, indicating that it has located over 26,000 individuals named Latika, causing Jamal to gulp nervously as he puts on his own headset, preparing for what is to come. Across the room, vigilant call center managers pace back and forth, closely monitoring the activity and ensuring that all calls are being handled efficiently.\n\nMeanwhile, back at the game show, the host shakes his head in disbelief, unable to comprehend the unfolding events, as the director steps forward and hands him a check. In another location, Jamal is ascending via a lift at a construction site of a towering skyscraper, and high above, hundreds of meters in the air, Salim waits, seemingly anticipating Jamal's arrival. Upon reaching the open top floor, which has no walls and offers sweeping panoramic views of the vast cityscape of Mumbai, Jamal spots a man clad in an expensive shirt, adorned with jewelry, and wearing dark sunglasses. Salim smiles, removing his sunglasses just as Jamal lunges at him with determination, resulting in both of them toppling off the edge of the building. Suddenly, Jamal snaps back to reality from this vision, choosing instead to punch Salim. The two brothers then sit together on the edge of the building, gazing out at the sprawling cityscape that unfurls before them. Salim receives a phone call, shaking his head as he watches his brother walk away.\n\nLater that night, within the confines of Salim’s apartment, both brothers are asleep until Salim gets up. Jamal, aware and alert, opens his eyes but chooses to remain still, then quietly sneaks to the landing to spy on Salim downstairs. He observes as Salim loads a gun and kneels on a mat to pray, reverently touching his forehead to the ground in contemplation. Afterwards, Salim exits the apartment block, making his way towards his car. As Salim drives away, Jamal emerges from the shadows in a tuk-tuk, closely trailing him. Eventually, Salim’s car pulls up to a sprawling, palatial house located on a picturesque hillside, surrounded by numerous construction sites. Salim drives through the electronically controlled gates, and not long after, Jamal’s tuk-tuk arrives, stopping just outside the formidable gates. Jamal quickly jumps out, watching intently as Salim approaches a beautiful woman, who is wearing dark sunglasses and stands elegantly on a balcony. Salim collects a small package from her and then continues driving past the gates, while Jamal remains hidden from view. The young woman, with her keen and observant eyes, notices Jamal lingering suspiciously at the entrance. As a guard moves to close the gates, she removes her glasses to get a clearer look at Jamal, while the guard retreats back to the gatehouse, leaving the situation to unfold further."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Latika appears in the room, moving with purpose and gently pressing down on the barrel of Salim's gun, an action that takes Jamal by surprise, leaving him standing there stunned. Salim quickly pulls Latika back into the room, causing Jamal to remain frozen in place, grappling with the unfolding events. Meanwhile, at the police station, the scene shifts to reveal the inspector and Srinivas observing Jamal intently, beads of sweat visible on Jamal's brow under their scrutiny. Srinivas gives a subtle grin as Jamal leans forward to speak to the inspector, his anxiety palpable. Suddenly, two other policemen in uniform burst into the room, swiftly moving to overpower Jamal, who is in an agitated state. They manage to subdue him as the inspector takes a moment to clean his perspiring hands and face. The narrative then shifts to a bustling call center where Jamal, balancing a tray of tea, navigates through the rows of desks, hurriedly serving tea to workers who are engrossed in their tasks at computers, headsets clamped over their ears. In the midst of this, Dave, one of the workers, quickly moves to a nearby television that is broadcasting a game show and eagerly signals to his colleagues, prompting them to start dialing a number on their mobile phones with urgency. On the TV screen, a readout shows the system identifying over 26,000 entries for the name Latika, a realization that makes Jamal gulp nervously before he dons his own headset. Across the room, call center managers briskly walk around, overseeing the activity of the staff as they handle calls. Back on the game show, the host conveys his disappointment with a shake of his head while the director hands him a check. Transitioning back to Jamal's journey, he's seen ascending in a lift within the skeletal structure of a skyscraper construction site, anticipating his encounter hundreds of meters above where Salim awaits him. When Jamal steps onto the open top floor, devoid of walls, he is greeted by a stunning panoramic view of Mumbai and spots a man clad in a luxurious shirt, accessorized with jewelry and wearing dark sunglasses. Salim offers a welcoming smile and removes his glasses just as Jamal charges at him, resulting in both brothers tumbling off the building in a dramatic sequence. However, this turns out to be a vision from which Jamal abruptly awakens, responding instead by delivering a punch to Salim. Later, the two brothers sit together on the building's edge, taking in the expansive cityscape before them. During this reflective moment, Salim receives a phone call, after which he shakes his head while watching Jamal depart. That night, in the privacy of Salim's apartment, both brothers have drifted into sleep. Salim eventually rises, causing Jamal to stir but remain motionless as he discreetly observes Salim from the landing. Jamal watches as Salim, after stealthily preparing and loading a gun, kneels on a prayer mat. Salim solemnly touches his forehead to the ground in a moment of devotion before departing his apartment block to head toward his car. Jamal, determined to follow, swiftly secures a tuk-tuk, trailing closely as Salim drives away. Arriving at an expansive, palatial house nestled on a hillside and surrounded by ongoing construction, Salim maneuvers his car through the electronically controlled gates while Jamal quietly arrives outside, concealing himself. Exiting the vehicle, Salim approaches a striking woman adorned in dark glasses, standing observantly on a balcony. After receiving a small package from her, Salim drives back past the gates, unknowing of Jamal's hidden presence. As the young woman on the balcony begins to notice Jamal's presence lingering at the entrance, a guard moves to close the gates. The woman, recognizing something is amiss, removes her glasses to gain a clearer view of Jamal, who remains in his position as the scene concludes."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Latika appears and intervenes to lower Salim's gun, while Salim pulls her back, leaving Jamal standing stunned. At the police station, the inspector and Srinivas observe a distressed Jamal, who is subdued by two rushing policemen. The inspector then wipes his sweat. At the call center, Jamal delivers tea to workers wearing headsets, while Dave alerts colleagues to dial a number displayed on a TV showing the game show. The system reveals over 26,000 results for the name Latika, prompting Jamal to gulp and put on his headset as managers supervise. On the game show, the host receives a check from the director. Jamal rides an elevator up a skyscraper construction site to meet Salim, who waits at the top. Upon arrival, Jamal sees a well-dressed man and charges at Salim, leading to both nearly falling off the building, before Jamal snaps back to reality and punches Salim. They then sit on the edge, overlooking the cityscape, and after Salim receives a call, he watches his brother leave. At night, while both sleep in Salim's apartment, Jamal wakes to find Salim preparing a gun and praying, before departing in his car. Jamal discreetly follows in a tuk-tuk. Salim arrives at a lavish hillside house, retrieves a package from a woman on the balcony, and drives past Jamal, who is hiding nearby. The woman spots Jamal as the gate closes, prompting the guard to investigate while she removes her glasses to see him better."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Latika appears and gently pushes Salim's gun down as Jamal looks incredulous. This moment occurs in a tense setting in a room filled with the echoes of past conflicts, with Salim pulling her back into the room, while Jamal remains rooted to the spot, overwhelmed by the situation. Back in the police station, a place notorious for its harsh interrogation tactics, the inspector and Srinivas, his colleague known for his keen observations, stare at the sweating Jamal. Srinivas grins as Jamal leans over toward the inspector. Two other uniformed policemen, part of the city's tough law enforcement, rush into the room and eventually subdue a raging Jamal. The inspector, accustomed to dealing with high-pressure situations, wipes the sweat from his hands and face. Jamal carries a tray of tea at the crowded call center, rushing around and delivering tea to the call center workers, who all sit at computers wearing headsets, connected to customers worldwide. Dave, an enthusiastic young worker, rushes off to a nearby TV showing the popular game show \"Who Wants to Be a Millionaire?\" and signals to everyone to start dialing the number on their mobile phones. The readout indicates it has found over 26,000 Latikas, a common name in the region, as the name scrolls across the screen, and Jamal gulps and puts on his headset, while across the room, call center managers walk around, monitoring staff calls to maintain efficiency. Back on the game show, hosted with dramatic flair, the host shakes his head, and the director hands him a check. Jamal is ascending in a lift on the construction site of a skyscraper, a symbol of Mumbai's rapid development, where hundreds of meters above, Salim waits. Jamal arrives at the open top floor with no walls, offering panoramic views of Mumbai, a sprawling metropolis with a skyline ever-changing, and sees a guy dressed in an expensive shirt, wearing jewelry and dark glasses, likely a symbol of his status. Salim smiles and removes his glasses as Jamal lunges for Salim, and they both fall off the building in his vision. Jamal blinks awake from his vision and punches Salim instead, a moment of decisive action. Jamal and Salim sit on the edge of the building with the vast cityscape spread out before them, and Salim is phoned, then shakes his head as he watches his brother go, resigned to the path they each must take. At night, in Salim's modest apartment, both are asleep until Salim gets up. Jamal opens his eyes but lies still, then sneaks to the landing to spy on Salim downstairs as he loads a gun and watches him kneel on a mat to pray, following the rituals of his faith. Salim touches his forehead to the ground, then leaves his apartment block and heads for his car, a routine that hides deeper secrets. As Salim drives off, Jamal appears in a tuk-tuk, the ubiquitous three-wheeled vehicle of the city, following closely behind. Salim's car pulls up to a sprawling palatial house situated on the hillside, an area known for its luxurious residences, surrounded by construction sites. He drives through the electronic gates, and Jamal's tuk-tuk then arrives outside the gates. Jamal jumps out and watches Salim approach a beautiful woman in dark glasses, possibly someone influential, standing on a balcony. Salim collects a small package from her, then drives past the gates where Jamal is hiding. The young woman, alert to her surroundings, notices Jamal lurking at the entrance as a guard closes the gates, and the guard goes to the gatehouse while the woman removes her glasses for a better look at Jamal, a potential threat to their dealings."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Latika appears and gently pushes Salim's gun down as Jamal looks incredulous with Salim pulling her back into the room while Jamal remains rooted to the spot. Back in the police station the inspector and Srinivas stare at the sweating Jamal and Srinivas grins as Jamal leans over toward the inspector. Two other uniformed policemen rush into the room and eventually subdue a raging Jamal. The inspector wipes the sweat from his hands and face. Jamal carries a tray of tea at the call center rushing around and delivering tea to the call center workers who all sit at computers wearing headsets. Dave rushes off to a nearby TV showing the game show and signals to everyone to start dialing the number on their mobile phones. The readout indicates it has found over 26000 Latikas as the name scrolls across the screen and Jamal gulps and puts on his headset. while across the room call center managers walk around monitoring staff calls. Back on the game show the host shakes his head and the director hands him a check. Jamal is ascending in a lift on the construction site of a skyscraper where hundreds of meters above Salim waits. Jamal arrives at the open top floor with no walls offering panoramic views of Mumbai and sees a guy dressed in an expensive shirt wearing jewelry and dark glasses. Salim smiles and removes his glasses as Jamal lunges for Salim and they both fall off the building. Jamal blinks awake from his vision and punches Salim instead. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Jamal and Salim sit on the edge of the building with the vast cityscape spread out before them and Salim is phoned. then shakes his head as he watches his brother go. At night in Salim's apartment both are asleep until Salim gets up. Jamal opens his eyes but lies still. then sneaks to the landing to spy on Salim downstairs as he loads a gun and watches him kneel on a mat to pray. Salim touches his forehead to the ground then leaves his apartment block and heads for his car. As Salim drives off Jamal appears in a tuktuk following closely behind Salim's car pulls up to a sprawling palatial house situated on the hillside surrounded by construction sites. drives through the electronic gates and Jamal's tuktuk. then arrives outside the gates. Jamal jumps out and watches Salim approach. a beautiful woman in dark glasses standing on a balcony. Salim collects a small package from her then drives past the gates where Jamal is hiding. The young woman notices Jamal lurking at the entrance as a guard closes the gates and the guard goes to the gatehouse while the woman removes her glasses for a better look at Jamal."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Latika appears and gently pushes Salim's gun down as Jamal looks incredulous with Salim pulling her back into the room while Jamal remains rooted to the spot. Back in the police station the inspector and Srinivas stare at the sweating Jamal and Srinivas grins as Jamal leans over toward the inspector. Two other uniformed policemen rush into the room and eventually subdue a raging Jamal. The inspector wipes the sweat from his hands and face. Jamal carries a tray of tea at the call center rushing around and delivering tea to the call center workers who all sit at computers wearing headsets. Dave rushes off to a nearby TV showing the game show and signals to everyone to start dialing the number on their mobile phones. The readout indicates it has found over 26000 Latikas as the name scrolls across the screen and Jamal gulps and puts on his headset. while across the room call center managers walk around monitoring staff calls. Back on the game show the host shakes his head and the director hands him a check. Jamal is ascending in a lift on the construction site of a skyscraper where hundreds of meters above Salim waits. Jamal arrives at the open top floor with no walls offering panoramic views of Mumbai and sees a guy dressed in an expensive shirt wearing jewelry and dark glasses. Salim smiles and removes his glasses as Jamal lunges for Salim and they both fall off the building. Jamal blinks awake from his vision and punches Salim instead. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Jamal and Salim sit on the edge of the building with the vast cityscape spread out before them and Salim is phoned. then shakes his head as he watches his brother go. At night in Salim's apartment both are asleep until Salim gets up. Jamal opens his eyes but lies still. then sneaks to the landing to spy on Salim downstairs as he loads a gun and watches him kneel on a mat to pray. Salim touches his forehead to the ground then leaves his apartment block and heads for his car. As Salim drives off Jamal appears in a tuktuk following closely behind Salim's car pulls up to a sprawling palatial house situated on the hillside surrounded by construction sites. drives through the electronic gates and Jamal's tuktuk. then arrives outside the gates. Jamal jumps out and watches Salim approach. a beautiful woman in dark glasses standing on a balcony. Salim collects a small package from her then drives past the gates where Jamal is hiding. The young woman notices Jamal lurking at the entrance as a guard closes the gates and the guard goes to the gatehouse while the woman removes her glasses for a better look at Jamal."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Latika appears and gently pushes Salim's gun down as Jamal looks incredulous with Salim pulling her back into the room while Jamal remains rooted to the spot. Back in the police station the inspector and Srinivas stare at the sweating Jamal and Srinivas grins as Jamal leans over toward the inspector. Two other uniformed policemen rush into the room and eventually subdue a raging Jamal. The inspector wipes the sweat from his hands and face. Jamal carries a tray of tea at the call center rushing around and delivering tea to the call center workers who all sit at computers wearing headsets. Dave rushes off to a nearby TV showing the game show and signals to everyone to start dialing the number on their mobile phones. The readout indicates it has found over 26000 Latikas as the name scrolls across the screen and Jamal gulps and puts on his headset. drives through the electronic gates and Jamal's tuktuk. then arrives outside the gates. Jamal jumps out and watches Salim approach. a beautiful woman in dark glasses standing on a balcony. Salim collects a small package from her then drives past the gates where Jamal is hiding. The young woman notices Jamal lurking at the entrance as a guard closes the gates and the guard goes to the gatehouse while the woman removes her glasses for a better look at Jamal."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Latika appears and gently pushes Salim's gun down as Jamal looks incredulous with Salim pulling her back into the room while Jamal remains rooted to the spot. Back in the police station the inspector and Srinivas stare at the sweating Jamal and Srinivas grins as Jamal leans over toward the inspector. Two other uniformed policemen rush into the room and eventually subdue a raging Jamal. a beautiful woman in dark glasses standing on a balcony. Salim collects a small package from her then drives past the gates where Jamal is hiding. The young woman notices Jamal lurking at the entrance as a guard closes the gates and the guard goes to the gatehouse while the woman removes her glasses for a better look at Jamal."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Cricket wanders and gently nudges Parrot's broom sideways as Cheetah looks bewildered, with Parrot tugging her back into the shed, while Cheetah stays frozen on the trail. Back in the library, the librarian and Curator gaze at the perspiring Cheetah, and Curator smirks as Cheetah leans over toward the librarian. Two other cloaked wizards dash into the chamber and eventually pacify a furious Cheetah. The librarian dabs the sweat from his gloves and neck. Cheetah hauls a basket of apples at the vineyard, darting around and distributing apples to the vineyard laborers, who all stoop on stools wearing broad-brimmed hats. Steve bolts off to a nearby radio broadcasting the horse race and gestures to everyone to begin punching the number on their walkie-talkies. The altimeter announces it has discovered over 26,000 Crickets as the title scrolls across the billboard, and Cheetah swallows hard and dons his visor, while across the courtyard, vineyard foremen stroll around, supervising workers' chores. Back at the horse race, the jockey shakes his mane, and the producer hands him a trophy. Cheetah is climbing in an elevator on the cliff edge of a canyon, where hundreds of feet below, Parrot waits. Cheetah arrives at the open lower ledge with no barriers, presenting sweeping vistas of Rome, and spots a feline draped in a luxurious scarf, wearing ornaments and violet spectacles. Parrot beams and discards his spectacles as Cheetah dives for Parrot, and they both tumble off the cliff. Cheetah blinks conscious from his daydream and kicks Parrot instead. Cheetah and Parrot perch on the brink of the cliff with the wide meadow sprawled out beneath them, and Parrot is messaged, then nods as he observes his sister leave. At dusk, in Parrot's bungalow, both are slumbering until Parrot rises. Cheetah opens his eyelids but stays immobile, then sneaks to the landing to eavesdrop on Parrot upstairs as he loads a violin and observes him sit on a rug to meditate. Parrot touches his whiskers to the floor, then exits his bungalow and heads for his bicycle. As Parrot pedals away, Cheetah emerges in a canoe, trailing closely behind. Parrot's bicycle pulls up to a vast regal tent perched on the plateau encircled by gardens, cycles through the arched doorways, and Cheetah's canoe then arrives beside the archways. Cheetah leaps out and observes Parrot approach a stunning woman in violet spectacles standing on a pier. Parrot collects a tiny scroll from her, then cycles past the archways where Cheetah is lurking. The young woman notices Cheetah skulking at the entrance as a sentinel closes the doorways, and the sentinel goes to the watchtower while the woman removes her spectacles for a clearer view of Cheetah."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Latika appears, gently pushing Salim's gun away as Jamal looks on in disbelief. In the police station, the inspector and Srinivas watch Jamal, who is eventually subdued by other officers. Jamal serves tea at a call center, where Dave prompts everyone to dial a TV show's number. The search reveals over 26,000 Latikas, and Jamal, wearing his headset, watches as managers oversee the staff. On a game show set, the host shakes his head while receiving a check. Jamal ascends a skyscraper construction site where Salim awaits. On the open top floor, they scuffle, and both fall. Jamal awakens from this vision and attacks Salim. Sitting on the building's edge, Salim receives a call and watches his brother leave. At night, as Salim prays after loading a gun, Jamal spies on him and follows in a tuk-tuk. Salim arrives at a palatial house, retrieves a package from a woman in dark glasses, and drives past Jamal, who hides nearby. The woman notices Jamal at the gates, removing her glasses for a clearer view as a guard closes the entrance."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The young woman notices Jamal lurking at the entrance as a guard closes the gates and the guard goes to the gatehouse while the woman removes her glasses for a better look at Jamal Salim collects a small package from her then drives past the gates where Jamal is hiding a beautiful woman in dark glasses standing on a balcony Jamal jumps out and watches Salim approach then arrives outside the gates drives through the electronic gates and Jamal's tuktuk As Salim drives off Jamal appears in a tuktuk following closely behind Salim's car pulls up to a sprawling palatial house situated on the hillside surrounded by construction sites Salim touches his forehead to the ground then leaves his apartment block and heads for his car then sneaks to the landing to spy on Salim downstairs as he loads a gun and watches him kneel on a mat to pray Jamal opens his eyes but lies still At night in Salim's apartment both are asleep until Salim gets up then shakes his head as he watches his brother go Jamal and Salim sit on the edge of the building with the vast cityscape spread out before them and Salim is phoned Jamal blinks awake from his vision and punches Salim instead Salim smiles and removes his glasses as Jamal lunges for Salim and they both fall off the building Jamal arrives at the open top floor with no walls offering panoramic views of Mumbai and sees a guy dressed in an expensive shirt wearing jewelry and dark glasses Jamal is ascending in a lift on the construction site of a skyscraper where hundreds of meters above Salim waits Back on the game show the host shakes his head and the director hands him a check while across the room call center managers walk around monitoring staff calls The readout indicates it has found over 26000 Latikas as the name scrolls across the screen and Jamal gulps and puts on his headset Dave rushes off to a nearby TV showing the game show and signals to everyone to start dialing the number on their mobile phones Jamal carries a tray of tea at the call center rushing around and delivering tea to the call center workers who all sit at computers wearing headsets The inspector wipes the sweat from his hands and face Two other uniformed policemen rush into the room and eventually subdue a raging Jamal Back in the police station the inspector and Srinivas stare at the sweating Jamal and Srinivas grins as Jamal leans over toward the inspector Latika appears and gently pushes Salim's gun down as Jamal looks incredulous with Salim pulling her back into the room while Jamal remains rooted to the spot"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Back in the police station the inspector and Srinivas stare at the sweating Jamal and Srinivas grins as Jamal leans over toward the inspector Latika appears and gently pushes Salim's gun down as Jamal looks incredulous with Salim pulling her back into the room while Jamal remains rooted to the spot The inspector wipes the sweat from his hands and face Two other uniformed policemen rush into the room and eventually subdue a raging Jamal Dave rushes off to a nearby TV showing the game show and signals to everyone to start dialing the number on their mobile phones Jamal carries a tray of tea at the call center rushing around and delivering tea to the call center workers who all sit at computers wearing headsets while across the room call center managers walk around monitoring staff calls The readout indicates it has found over 26000 Latikas as the name scrolls across the screen and Jamal gulps and puts on his headset Jamal is ascending in a lift on the construction site of a skyscraper where hundreds of meters above Salim waits Back on the game show the host shakes his head and the director hands him a check Salim smiles and removes his glasses as Jamal lunges for Salim and they both fall off the building Jamal arrives at the open top floor with no walls offering panoramic views of Mumbai and sees a guy dressed in an expensive shirt wearing jewelry and dark glasses Jamal and Salim sit on the edge of the building with the vast cityscape spread out before them and Salim is phoned Jamal blinks awake from his vision and punches Salim instead At night in Salim's apartment both are asleep until Salim gets up then shakes his head as he watches his brother go then sneaks to the landing to spy on Salim downstairs as he loads a gun and watches him kneel on a mat to pray Jamal opens his eyes but lies still As Salim drives off Jamal appears in a tuktuk following closely behind Salim's car pulls up to a sprawling palatial house situated on the hillside surrounded by construction sites Salim touches his forehead to the ground then leaves his apartment block and heads for his car then arrives outside the gates drives through the electronic gates and Jamal's tuktuk a beautiful woman in dark glasses standing on a balcony Jamal jumps out and watches Salim approach The young woman notices Jamal lurking at the entrance as a guard closes the gates and the guard goes to the gatehouse while the woman removes her glasses for a better look at Jamal Salim collects a small package from her then drives past the gates where Jamal is hiding"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Jamal and Salim sit on the edge of the building with the vast cityscape spread out before them and Salim is phoned then shakes his head as he watches his brother go At night in Salim's apartment both are asleep until Salim gets up Jamal opens his eyes but lies still then sneaks to the landing to spy on Salim downstairs as he loads a gun and watches him kneel on a mat to pray Salim touches his forehead to the ground then leaves his apartment block and heads for his car As Salim drives off Jamal appears in a tuktuk following closely behind Salim's car pulls up to a sprawling palatial house situated on the hillside surrounded by construction sites drives through the electronic gates and Jamal's tuktuk then arrives outside the gates Jamal jumps out and watches Salim approach a beautiful woman in dark glasses standing on a balcony Salim collects a small package from her then drives past the gates where Jamal is hiding The young woman notices Jamal lurking at the entrance as a guard closes the gates and the guard goes to the gatehouse while the woman removes her glasses for a better look at Jamal Latika appears and gently pushes Salim's gun down as Jamal looks incredulous with Salim pulling her back into the room while Jamal remains rooted to the spot Back in the police station the inspector and Srinivas stare at the sweating Jamal and Srinivas grins as Jamal leans over toward the inspector Two other uniformed policemen rush into the room and eventually subdue a raging Jamal The inspector wipes the sweat from his hands and face Jamal carries a tray of tea at the call center rushing around and delivering tea to the call center workers who all sit at computers wearing headsets Dave rushes off to a nearby TV showing the game show and signals to everyone to start dialing the number on their mobile phones The readout indicates it has found over 26000 Latikas as the name scrolls across the screen and Jamal gulps and puts on his headset while across the room call center managers walk around monitoring staff calls Back on the game show the host shakes his head and the director hands him a check Jamal is ascending in a lift on the construction site of a skyscraper where hundreds of meters above Salim waits Jamal arrives at the open top floor with no walls offering panoramic views of Mumbai and sees a guy dressed in an expensive shirt wearing jewelry and dark glasses Salim smiles and removes his glasses as Jamal lunges for Salim and they both fall off the building Jamal blinks awake from his vision and punches Salim instead"
        }
      ]
    }
  ]
}