{
  "ground_truth": "Under a moody blue sky with tearing white and gold clouds, a woman in Grecian style robes holds aloft a shining torch. Pages of comic magazines flip by, with words like \"bap\" and \"boom,\" and finally the word \"marvel\" appears. A ray of blue light shines, and the scene cuts to starring Tobey Maguire. It feels like someone is punching through a red, smoky tunnel, but the spider's web is always present. A muscular arm and a clenched hand are entwined in the web as the hand stretches up to catch more silk threads. A sharp-featured head, resembling a mask with long pointed ears, a humped nose, barred teeth, and a jutting jaw, appears. The opening titles continue with an animated background of skyscrapers. Two hands touch fingertips to fingertips, the picture spins, and window frames appear, revealing a large guy eating a doughnut. A youth chases a school bus, which stops to let him on; he has dark hair and spectacles. The pasty-faced young man, Timothy, makes his way down the bus while a girl with her hair in bunches and big spectacles puts her books in the empty seat beside her. Flash Thompson, with his arm around Mary Jane, nods to another student as the doughnut eater shakes his head. Young Parker keeps walking, his eyes fixed on Mary Jane, not noticing a leg stuck out in front of him, causing him to tumble to the floor and his specs to fall off. The yellow school bus rolls on, arriving outside Columbia University. As Parker approaches Mary Jane, she smiles and waves, but he realizes she was greeting her girlfriends behind him, leaving him embarrassed. A Rolls Royce pulls out, and a sulky young man clamors out to address Parker. Peter and Harry turn away, with Peter pointing his camera as Flash Thompson bumps into him. Harry goes over to Mary Jane, and Peter overhears their conversation. Harry turns to Peter and grins as the spider hovers above. A teacher leads Harry away, and Peter stares at the curious Mary Jane standing in front of the display of spiders in their transparent plastic cages. Wide-eyed, Peter gazes forlornly at her as she moves to the side of the display, and he stands in front of a TV monitor. Unbeknownst to them, the missing super spider begins to ease its way down a silky thread from its newly spun web while Mary Jane continues to pose with notes in hand. The spider inches its way down towards Peter, and as it settles on his hand, Mary Jane's friend calls to her, and she turns to leave. The spider bites Peter, who shakes it off, sending it landing on the gray carpeted floor where it scuttles away. Peter examines the bite, noticing a circle of red around the already swollen area on the back of his hand.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Beneath a sullen azure horizon with ripping ivory and gilded vapor, a lady in Grecian fashion garments elevates a gleaming flame. Leaves of graphic periodicals flip by, with expressions like \"bap\" and \"boom,\" and ultimately the term \"marvel\" emerges. A beam of azure illumination gleams, and the scene transitions to featuring Tobey Maguire. It seems like somebody is striking through a crimson, hazy passage, but the arachnid's lattice is perpetually present. A brawny limb and a clenched fist are intertwined in the lattice as the fist extends up to seize more filament strands. A sharp-contoured head, resembling a disguise with elongated pointed ears, a curved nose, barred teeth, and a protruding jaw, emerges. The initial credits proceed with an animated backdrop of skyscrapers. Two hands touch fingertips to fingertips, the image rotates, and window casings emerge, exposing a large fellow consuming a pastry. A youth pursues a school bus, which halts to let him on; he has dark locks and glasses. The pale-faced young man, Timothy, makes his path down the bus while a girl with her hair in bunches and large glasses places her texts in the vacant seat beside her. Flash Thompson, with his arm around Mary Jane, acknowledges another pupil as the pastry consumer shakes his head. Young Parker continues walking, his eyes fixed on Mary Jane, not perceiving a limb stuck out in front of him, causing him to fall to the floor and his spectacles to drop off. The yellow school bus rolls on, arriving outside Columbia University. As Parker approaches Mary Jane, she smiles and waves, but he realizes she was greeting her companions behind him, leaving him embarrassed. A Rolls Royce pulls out, and a sulky young man clamors out to address Parker. Peter and Harry turn away, with Peter pointing his camera as Flash Thompson collides with him. Harry goes over to Mary Jane, and Peter overhears their dialogue. Harry turns to Peter and grins as the arachnid hovers above. An instructor leads Harry away, and Peter stares at the curious Mary Jane standing in front of the display of arachnids in their transparent synthetic enclosures. Wide-eyed, Peter gazes despondently at her as she moves to the side of the display, and he stands in front of a TV screen. Unbeknownst to them, the missing super arachnid begins to ease its path down a silky strand from its newly spun lattice while Mary Jane continues to pose with notes in hand. The arachnid inches its way down towards Peter, and as it settles on his hand, Mary Jane's companion calls to her, and she turns to depart. The arachnid bites Peter, who shakes it off, sending it landing on the gray carpeted floor where it scurries away. Peter examines the bite, noticing a circle of crimson around the already swollen area on the back of his hand."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Under a moody blue sky with tearing white and gold clouds, a shining torch is held aloft by a woman in Grecian style robes. Pages of comic magazines are flipped by, with words like \"bap\" and \"boom,\" and finally, the word \"marvel\" appears. A ray of blue light is shone, and the scene cuts to starring Tobey Maguire. It feels like someone punches through a red, smoky tunnel, but the spider's web is always present. The web entangles a muscular arm and a clenched hand as more silk threads are caught by the hand stretching upward. A sharp-featured head, resembling a mask with long pointed ears, a humped nose, barred teeth, and a jutting jaw, is made to appear. The opening titles continue with skyscrapers being animated in the background. Fingertips are touched to fingertips by two hands, the picture is spun, and window frames are revealed, showing a large guy eating a doughnut. A school bus is chased by a youth, and he is let on when it stops; he has dark hair and spectacles. The pasty-faced young man, Timothy, makes his way down the bus as books are placed by a girl with her hair in bunches and big spectacles in the empty seat beside her. Another student is nodded to by Flash Thompson, with his arm around Mary Jane, as the doughnut eater shakes his head. Young Parker continues walking, his eyes fixated on Mary Jane, not noticing when a leg is stuck out in front of him to cause him to tumble to the floor and his specs to fall off. The yellow school bus rolls on, arriving outside Columbia University. As Mary Jane is approached by Parker, she smiles and waves, but her girlfriends behind him are realized to be the ones she was greeting, leaving him embarrassed. A Rolls Royce pulls out, and Parker is addressed by a sulky young man who clamors out. Peter and Harry turn away, with a camera being pointed by Peter as Flash Thompson bumps into him. Mary Jane is approached by Harry, and their conversation is overheard by Peter. A grin is given by Harry to Peter as the spider hovers above. Harry is led away by a teacher, and Mary Jane is stared at by Peter, who stands in front of the display of spiders in their transparent plastic cages, curious. With wide eyes, Peter gazes forlornly at her as she moves to the side of the display, and he is positioned in front of a TV monitor. The missing super spider, unbeknownst to them, begins to ease its way down a silky thread from its newly spun web while Mary Jane poses with notes in hand. Peter is approached by the spider as it inches its way down, and when it settles on his hand, Mary Jane's friend calls to her, and she turns to leave. Peter is bitten by the spider, who shakes it off, sending it landing on the gray carpeted floor where it scuttles away. A circle of red around the already swollen area on the back of his hand is noticed by Peter as he examines the bite."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Under a moody blue sky with tearing white and gold clouds, a woman in Grecian robes holds a shining torch. Comic magazine pages flip by with words like \"bap\" and \"boom,\" ending with \"marvel.\" A blue light shines, cutting to Tobey Maguire. It feels like punching through a red, smoky tunnel, with a spider's web always present. A muscular arm and clenched hand are entwined in the web, reaching for more silk threads. A sharp-featured head, resembling a mask with long ears, a humped nose, barred teeth, and a jutting jaw, appears. The opening titles continue with animated skyscrapers. Two hands touch fingertips, the picture spins, and window frames reveal a large guy eating a doughnut. A youth chases a school bus, which stops for him; he has dark hair and glasses. The pasty-faced Timothy moves down the bus while a girl with hair in bunches and big glasses places her books beside her. Flash Thompson, with his arm around Mary Jane, nods to another student as the doughnut eater shakes his head. Young Parker walks, eyes on Mary Jane, not noticing a leg tripping him, causing him to fall and lose his glasses. The yellow school bus arrives at Columbia University. As Parker approaches Mary Jane, she smiles and waves, but he realizes she was greeting her friends behind him, leaving him embarrassed. A Rolls Royce pulls up, and a sulky young man addresses Parker. Peter and Harry turn away, with Peter pointing his camera as Flash bumps into him. Harry goes to Mary Jane, and Peter overhears them. Harry grins at Peter as a spider hovers above. A teacher leads Harry away, and Peter stares at Mary Jane in front of the spider display. Wide-eyed, Peter gazes at her as she moves aside, and he stands by a TV monitor. Unbeknownst to them, the missing super spider descends on a silky thread from its web while Mary Jane poses with notes. The spider inches down to Peter, settling on his hand as Mary Jane's friend calls her away. The spider bites Peter, who shakes it off, sending it to the gray carpet where it scuttles away. Peter examines the bite, noticing a red circle around the swollen area on his hand."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Under a moody sky, a woman in Grecian robes holds a torch. Comic pages flip with words like \"bap\" and \"boom,\" ending with \"marvel.\" A blue light shines, cutting to Tobey Maguire. A red, smoky tunnel with a spider's web shows a muscular arm catching silk threads. A mask-like head appears. Titles continue with skyscrapers. Two hands touch, the picture spins, revealing a man eating a doughnut. A youth with dark hair and glasses chases a school bus. Timothy walks down the bus as a girl with bunches and glasses places books beside her. Flash Thompson nods to a student as the doughnut eater shakes his head. Parker, focused on Mary Jane, trips over a leg, losing his glasses. The bus arrives at Columbia University. Parker approaches Mary Jane, who smiles and waves at her friends, leaving him embarrassed. A sulky young man addresses Parker. Peter and Harry turn away, with Peter taking photos as Flash bumps into him. Harry talks to Mary Jane, and Peter overhears. Harry grins at Peter as a spider hovers above. A teacher leads Harry away, and Peter watches Mary Jane at a spider display. The missing super spider descends towards Peter, biting him. Mary Jane's friend calls her away. Peter examines the bite, noticing a red circle around the swollen area."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Beneath a moody, expansive blue sky adorned with tearing clouds of white and gold, a woman dressed in elegant Grecian-style robes holds aloft a brilliantly shining torch. As the scene unfolds, pages of comic magazines flip by rapidly, displaying words like \"bap\" and \"boom,\" until finally, the iconic word \"marvel\" appears prominently. A ray of blue light shines dramatically, and the scene transitions to reveal the starring actor, Tobey Maguire. It feels as though someone is forcefully punching through a red, smoky tunnel, yet the ever-present spider's web remains visible. A muscular arm, with a clenched hand, is intricately entwined in the web as the hand stretches upward to grasp more silk threads. A sharp-featured head, resembling a mask with long, pointed ears, a humped nose, barred teeth, and a jutting jaw, emerges into view. The opening titles continue to unfold against an animated backdrop of towering skyscrapers. Two hands touch, fingertip to fingertip, causing the picture to spin, and window frames appear, revealing a large man contentedly eating a doughnut. A young boy, with dark hair and spectacles, chases after a school bus, which halts to let him on board. The pasty-faced young man, named Timothy, makes his way down the aisle of the bus, while a girl with her hair styled in bunches and large spectacles places her books on the empty seat beside her. Flash Thompson, with his arm casually draped around Mary Jane, nods to another student as the doughnut eater shakes his head in disapproval. Young Parker continues walking, his eyes fixed intently on Mary Jane, oblivious to the leg stuck out in front of him, causing him to stumble to the floor and his spectacles to fall off. The yellow school bus rolls onward, eventually arriving outside the prestigious Columbia University. As Parker approaches Mary Jane, she smiles warmly and waves, but he soon realizes she was actually greeting her girlfriends standing behind him, leaving him feeling embarrassed. A luxurious Rolls Royce pulls up, and a sulky young man clamors out to address Parker. Peter and Harry turn away together, with Peter pointing his camera just as Flash Thompson bumps into him. Harry makes his way over to Mary Jane, and Peter overhears their conversation. Harry turns to Peter and grins as the spider hovers ominously above. A teacher leads Harry away, and Peter stares at the curious Mary Jane, who stands in front of the display of spiders housed in their transparent plastic cages. Wide-eyed, Peter gazes forlornly at her as she moves to the side of the display, and he positions himself in front of a TV monitor. Unbeknownst to them, the missing super spider begins to ease its way down a silky thread from its newly spun web while Mary Jane continues to pose with notes in hand. The spider inches its way down towards Peter, and as it settles on his hand, Mary Jane's friend calls to her, prompting her to turn and leave. The spider bites Peter, who instinctively shakes it off, sending it landing on the gray carpeted floor where it quickly scuttles away. Peter examines the bite closely, noticing a circle of red forming around the already swollen area on the back of his hand."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Underneath a wide, moody, and expansive blue sky, which is beautifully adorned with clouds torn in hues of white and gold, a woman gracefully dressed in elegant robes styled in the fashion of the ancient Greeks holds high a brilliantly shining torch. As this visually striking scene unfolds before us, pages from comic magazines begin to flip by rapidly, showcasing words like \"bap\" and \"boom\" with great energy and excitement, until, at last, the iconic word \"marvel\" appears prominently, almost leaping off the page. A dramatic ray of blue light shines powerfully, and the scene transitions smoothly to reveal the starring actor, Tobey Maguire, in all his glory. It almost feels as if someone is forcefully punching through a tunnel filled with swirling red smoke, yet the ever-present, intricate spider's web remains clearly visible. A muscular arm with a clenched hand is intricately entwined within this web, and the hand stretches upward as if reaching to grasp even more silk threads. Suddenly, a sharp-featured head, resembling a mask with long, pointed ears, a humped nose, barred teeth, and a jutting, prominent jaw, emerges into view. The opening titles continue to unfold gracefully against an animated backdrop depicting towering, majestic skyscrapers. As two hands reach out to touch, fingertip to fingertip, the picture spins dramatically, and window frames appear, revealing a large man contentedly eating a doughnut. Meanwhile, a young boy with dark hair and spectacles is seen chasing after a school bus, which comes to a halt to let him on board. The pasty-faced young man, whom we come to know as Timothy, makes his way diligently down the aisle of the bus, while a girl with her hair styled in charming bunches and large spectacles places her books on the empty seat beside her. Flash Thompson, with his arm casually draped around Mary Jane, nods to another student seated nearby as the doughnut eater shakes his head in disapproval. Young Parker continues walking forward, his eyes fixed intently on Mary Jane, completely oblivious to the leg stuck out in front of him, which causes him to stumble clumsily to the floor, sending his spectacles tumbling off. The yellow school bus rolls onward steadily, eventually arriving outside the prestigious halls of Columbia University. As Parker approaches Mary Jane, she smiles warmly and waves, causing his heart to flutter, but he soon realizes she was actually greeting her girlfriends standing behind him, leaving him feeling embarrassed and a bit crestfallen. A luxurious Rolls Royce then pulls up with a flourish, and a sulky young man clamors out to address Parker. Peter and Harry turn away together, with Peter pointing his camera in readiness just as Flash Thompson bumps into him. Harry casually makes his way over to Mary Jane, and Peter overhears snippets of their conversation. Harry turns to Peter, flashing a grin as the spider hovers ominously above. A teacher leads Harry away, and Peter stares longingly at the curious Mary Jane, who stands in front of a display of spiders housed in their transparent plastic cages. Wide-eyed, Peter gazes forlornly at her as she moves to the side, and he positions himself in front of a TV monitor. Unbeknownst to anyone, the missing super spider begins to ease its way down a silky thread spun from its newly created web while Mary Jane continues to pose with notes in hand. The spider gradually inches its way down towards Peter, and as it finally settles on his hand, Mary Jane's friend calls out to her, prompting her to turn and leave the scene. The spider bites Peter, who instinctively shakes it off, sending it landing on the gray carpeted floor where it quickly scuttles away from sight. Peter examines the bite closely, noticing with concern a circle of red forming around the already swollen area on the back of his hand."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Under a moody blue sky, where white and gold clouds tear through the atmosphere, a woman dressed in Grecian style robes stands with poise, holding a shining torch aloft, casting a warm glow. As this image fades, pages of comic magazines rapidly flip by, each page turning with a flick, revealing words like \"bap\" and \"boom\" in bold, colorful letters, until the word \"marvel\" prominently appears, marking a transition. A ray of blue light suddenly illuminates the scene, and the focus shifts to the name Tobey Maguire, signaling his starring role. The sensation of someone punching through a red, smoky tunnel is evoked, yet throughout this dynamic sequence, the intricate pattern of a spider's web remains a constant presence. Within this web, a muscular arm and a clenched hand are entwined, the hand stretching upward with determination to catch more silk threads. A sharp-featured head emerges, resembling a mask with long pointed ears, a humped nose, barred teeth, and a jutting jaw, adding to the dramatic imagery. The opening titles continue to unfold against an animated backdrop of towering skyscrapers. Two hands come into view, touching fingertips to fingertips, and as the picture spins, window frames materialize, revealing a large guy indulging in a doughnut. Meanwhile, a youth with dark hair and spectacles is seen chasing a school bus, which halts to allow him to board. As the pasty-faced young man, Timothy, makes his way down the aisle of the bus, a girl with her hair styled in bunches and large spectacles places her books on the empty seat beside her. Flash Thompson, with a confident arm around Mary Jane, acknowledges another student with a nod, while the doughnut eater shakes his head in disapproval. Young Parker continues his walk, his gaze fixed intently on Mary Jane, oblivious to the leg that suddenly juts out in front of him, causing him to stumble to the floor and his spectacles to fall off. The yellow school bus continues its journey, eventually arriving outside Columbia University. As Parker approaches Mary Jane, she offers a smile and a wave, but he soon realizes her greeting was intended for her girlfriends behind him, leaving him feeling embarrassed. A Rolls Royce pulls up, and a sulky young man emerges, clamoring to address Parker. Peter and Harry turn away from the scene, with Peter raising his camera just as Flash Thompson bumps into him. Harry makes his way over to Mary Jane, and Peter, standing nearby, overhears their conversation. Harry turns to Peter with a grin, while above them, a spider hovers ominously. A teacher arrives to lead Harry away, and Peter's attention shifts to the curious Mary Jane, who stands in front of a display of spiders housed in transparent plastic cages. Wide-eyed, Peter gazes forlornly at her as she moves to the side of the display, positioning himself in front of a TV monitor. Unbeknownst to them, a missing super spider begins to descend, easing its way down a silky thread from its newly spun web. Mary Jane continues to pose, notes in hand, as the spider inches closer to Peter. As it finally settles on his hand, Mary Jane's friend calls out to her, prompting her to turn and leave. In that moment, the spider bites Peter, who instinctively shakes his hand, dislodging the spider and sending it scuttling away across the gray carpeted floor. Peter examines the bite, noting the circle of red that has formed around the already swollen area on the back of his hand."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Under a moody blue sky with tearing white and gold clouds, a woman in Grecian style robes holds aloft a shining torch. Comic magazine pages flip by with words like \"bap\" and \"boom,\" culminating in the word \"marvel.\" A blue light shines, transitioning to starring Tobey Maguire. The scene evokes a sense of punching through a red, smoky tunnel, with a spider's web consistently present. A muscular arm and a clenched hand entwined in the web reach for more silk threads, while a sharp-featured head resembling a mask appears. The opening titles continue with an animated skyscraper background. Two hands touch fingertips, the picture spins, and window frames reveal a large guy eating a doughnut. A youth with dark hair and spectacles chases a school bus, which stops to let him on. Timothy, a pasty-faced young man, moves down the bus as a girl with hair in bunches and big spectacles places her books beside her. Flash Thompson, with his arm around Mary Jane, nods to another student while the doughnut eater shakes his head. Young Parker, focused on Mary Jane, trips over a leg stuck out in front of him, causing him to fall and lose his glasses. The school bus arrives at Columbia University. As Parker approaches Mary Jane, she smiles and waves, but he realizes she was greeting her girlfriends, leaving him embarrassed. A Rolls Royce pulls up, and a sulky young man addresses Parker. Peter and Harry turn away, with Peter pointing his camera as Flash Thompson bumps into him. Harry joins Mary Jane, and Peter overhears their conversation. Harry grins at Peter as a spider hovers above. A teacher leads Harry away, and Peter watches Mary Jane in front of a spider display. Wide-eyed, Peter gazes at her as she moves aside, and he stands by a TV monitor. Unbeknownst to them, a missing super spider descends on a silky thread, landing on Peter's hand as Mary Jane's friend calls her away. The spider bites Peter, who shakes it off, sending it scuttling away on the carpet. Peter examines the bite, noticing a red circle around the swollen area on his hand."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Under a moody blue sky with tearing white and gold clouds, a woman in Grecian style robes, reminiscent of the iconic Columbia Pictures logo that has been a symbol of American cinema since the 1920s, holds aloft a shining torch. Pages of comic magazines flip by, featuring iconic onomatopoeias like \"bap\" and \"boom,\" which have been staples in comic book art for decades, and finally the word \"marvel\" appears, referencing one of the largest and most successful comic book companies known for superheroes like Spider-Man. A ray of blue light shines, and the scene cuts to starring Tobey Maguire, the actor who became widely recognized for his role as Peter Parker, aka Spider-Man, in the early 2000s film series. It feels like someone is punching through a red, smoky tunnel, but the spider's web, a central symbol in Spider-Man's lore representing Peter's transformation and connection to his powers, is always present. A muscular arm and a clenched hand are entwined in the web as the hand stretches up to catch more silk threads, echoing Spider-Man's iconic ability to swing through the city using his web shooters. A sharp-featured head, resembling a mask with long pointed ears, a humped nose, barred teeth, and a jutting jaw, appears, conjuring imagery reminiscent of classic comic book villains. The opening titles continue with an animated background of skyscrapers, typical of Spider-Man's New York City setting, known for its towering skyline. Two hands touch fingertips to fingertips, a gesture often associated with trust and unity, as the picture spins, and window frames appear, revealing a large guy eating a doughnut, a common stereotype in scenes depicting casual city life. A youth chases a school bus, which stops to let him on; he has dark hair and spectacles, indicating the iconic appearance of Peter Parker before his transformation. The pasty-faced young man, Timothy, makes his way down the bus while a girl with her hair in bunches and big spectacles puts her books in the empty seat beside her, evoking a classic school setting scene. Flash Thompson, known in the comics for bullying Peter but also for his complicated relationship with him, with his arm around Mary Jane, nods to another student as the doughnut eater shakes his head. Young Parker keeps walking, his eyes fixed on Mary Jane, his longtime crush in the series, not noticing a leg stuck out in front of him, causing him to tumble to the floor and his specs to fall off, a humorous nod to Peter's clumsiness before gaining his spider-like agility. The yellow school bus rolls on, arriving outside Columbia University, which in reality is a prestigious Ivy League institution located in New York City. As Parker approaches Mary Jane, she smiles and waves, but he realizes she was greeting her girlfriends behind him, leaving him embarrassed. A Rolls Royce, symbolizing wealth and luxury, pulls out, and a sulky young man, Harry Osborn, Peter's friend and the son of wealthy industrialist Norman Osborn, clamors out to address Parker. Peter and Harry turn away, with Peter pointing his camera, a hobby that often helps him earn money as a freelance photographer, as Flash Thompson bumps into him. Harry goes over to Mary Jane, and Peter overhears their conversation, highlighting the complicated dynamics between them. Harry turns to Peter and grins as the spider, a genetically modified specimen central to Peter's origin story, hovers above. A teacher leads Harry away, and Peter stares at the curious Mary Jane standing in front of the display of spiders in their transparent plastic cages, an exhibit likely representing the cutting-edge genetic research they're visiting. Wide-eyed, Peter gazes forlornly at her as she moves to the side of the display, and he stands in front of a TV monitor. Unbeknownst to them, the missing super spider begins to ease its way down a silky thread from its newly spun web, embodying the accidental start of Peter's journey as Spider-Man, while Mary Jane continues to pose with notes in hand. The spider inches its way down towards Peter, and as it settles on his hand, Mary Jane's friend calls to her, and she turns to leave. The spider bites Peter, marking the pivotal moment of transformation in the Spider-Man storyline, who shakes it off, sending it landing on the gray carpeted floor where it scuttles away, unnoticed. Peter examines the bite, noticing a circle of red around the already swollen area on the back of his hand, the first sign of the extraordinary changes to come."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Under a moody blue sky with tearing white and gold clouds a woman in Grecian style robes holds aloft a shining torch  Pages of comic magazines flip by with words like bap and boom and finally the word marvel appears  A ray of blue light shines and the scene cuts to starring Tobey Maguire  he has dark hair and spectacles  The pastyfaced young man Timothy makes his way down the bus while a girl with her hair in bunches and big spectacles puts her books in the empty seat beside her  Flash Thompson with his arm around Mary Jane nods to another student as the doughnut eater shakes his head  Young Parker keeps walking his eyes fixed on Mary Jane not noticing a leg stuck out in front of him causing him to tumble to the floor and his specs to fall off  The yellow school bus rolls on arriving outside Columbia University  As Parker approaches Mary Jane she smiles and waves but he realizes she was greeting her girlfriends behind him leaving him embarrassed  A Rolls Royce pulls out and a sulky young man clamors out to address Parker  Peter and Harry turn away with Peter pointing his camera as Flash Thompson bumps into him  Harry goes over to Mary Jane and Peter overhears their conversation  Harry turns to Peter and grins as the spider hovers above  A teacher leads Harry away and Peter stares at the curious Mary Jane standing in front of the display of spiders in their transparent plastic cages  Wideeyed Peter gazes forlornly at her as she moves to the side of the display and he stands in front of a TV monitor  Unbeknownst to them the missing super spider begins to ease its way down a silky thread from its newly spun web while Mary Jane continues to pose with notes in hand  It feels like someone is punching through a red smoky tunnel but the spider's web is always present  A muscular arm and a clenched hand are entwined in the web as the hand stretches up to catch more silk threads  A sharpfeatured head resembling a mask with long pointed ears a humped nose barred teeth and a jutting jaw appears  The opening titles continue with an animated background of skyscrapers  Two hands touch fingertips to fingertips  the picture spins and window frames appear revealing a large guy eating a doughnut  A youth chases a school bus which stops to let him on  he has dark hair and spectacles  The pastyfaced young man Timothy makes his way down the bus while a girl with her hair in bunches and big spectacles puts her books in the empty seat beside her  Flash Thompson with his arm around Mary Jane nods to another student as the doughnut eater shakes his head  Young Parker keeps walking his eyes fixed on Mary Jane not noticing a leg stuck out in front of him causing him to tumble to the floor and his specs to fall off  The yellow school bus rolls on arriving outside Columbia University  As Parker approaches Mary Jane she smiles and waves but he realizes she was greeting her girlfriends behind him leaving him embarrassed  A Rolls Royce pulls out and a sulky young man clamors out to address Parker  Peter and Harry turn away with Peter pointing his camera as Flash Thompson bumps into him  Harry goes over to Mary Jane and Peter overhears their conversation  Harry turns to Peter and grins as the spider hovers above  A teacher leads Harry away and Peter stares at the curious Mary Jane standing in front of the display of spiders in their transparent plastic cages  Wideeyed Peter gazes forlornly at her as she moves to the side of the display and he stands in front of a TV monitor  Unbeknownst to them the missing super spider begins to ease its way down a silky thread from its newly spun web while Mary Jane continues to pose with notes in hand  The spider inches its way down towards Peter and as it settles on his hand Mary Jane's friend calls to her and she turns to leave  The spider bites Peter who shakes it off sending it landing on the gray carpeted floor where it scuttles away  Peter examines the bite noticing a circle of red around the already swollen area on the back of his hand"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Under a moody blue sky with tearing white and gold clouds a woman in Grecian style robes holds aloft a shining torch. Pages of comic magazines flip by with words like bap and boom and finally the word marvel appears. A ray of blue light shines and the scene cuts to starring Tobey Maguire. It feels like someone is punching through a red smoky tunnel but the spider's web is always present. A muscular arm and a clenched hand are entwined in the web as the hand stretches up to catch more silk threads. A sharpfeatured head resembling a mask with long pointed ears a humped nose barred teeth and a jutting jaw appears. The opening titles continue with an animated background of skyscrapers. Two hands touch fingertips to fingertips. the picture spins and window frames appear revealing a large guy eating a doughnut. A youth chases a school bus which stops to let him on. he has dark hair and spectacles. The pastyfaced young man Timothy makes his way down the bus while a girl with her hair in bunches and big spectacles puts her books in the empty seat beside her. Flash Thompson with his arm around Mary Jane nods to another student as the doughnut eater shakes his head. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Young Parker keeps walking his eyes fixed on Mary Jane not noticing a leg stuck out in front of him causing him to tumble to the floor and his specs to fall off. The yellow school bus rolls on arriving outside Columbia University. As Parker approaches Mary Jane she smiles and waves but he realizes she was greeting her girlfriends behind him leaving him embarrassed. A Rolls Royce pulls out and a sulky young man clamors out to address Parker. Peter and Harry turn away with Peter pointing his camera as Flash Thompson bumps into him. Harry goes over to Mary Jane and Peter overhears their conversation. Harry turns to Peter and grins as the spider hovers above. A teacher leads Harry away and Peter stares at the curious Mary Jane standing in front of the display of spiders in their transparent plastic cages. Wideeyed Peter gazes forlornly at her as she moves to the side of the display and he stands in front of a TV monitor. Unbeknownst to them the missing super spider begins to ease its way down a silky thread from its newly spun web while Mary Jane continues to pose with notes in hand. The spider inches its way down towards Peter and as it settles on his hand Mary Jane's friend calls to her and she turns to leave. The spider bites Peter who shakes it off sending it landing on the gray carpeted floor where it scuttles away. Peter examines the bite noticing a circle of red around the already swollen area on the back of his hand."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Under a moody blue sky with tearing white and gold clouds a woman in Grecian style robes holds aloft a shining torch. Pages of comic magazines flip by with words like bap and boom and finally the word marvel appears. A ray of blue light shines and the scene cuts to starring Tobey Maguire. It feels like someone is punching through a red smoky tunnel but the spider's web is always present. A muscular arm and a clenched hand are entwined in the web as the hand stretches up to catch more silk threads. A sharpfeatured head resembling a mask with long pointed ears a humped nose barred teeth and a jutting jaw appears. The opening titles continue with an animated background of skyscrapers. Two hands touch fingertips to fingertips. the picture spins and window frames appear revealing a large guy eating a doughnut. A youth chases a school bus which stops to let him on. he has dark hair and spectacles. The pastyfaced young man Timothy makes his way down the bus while a girl with her hair in bunches and big spectacles puts her books in the empty seat beside her. Flash Thompson with his arm around Mary Jane nods to another student as the doughnut eater shakes his head. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Young Parker keeps walking his eyes fixed on Mary Jane not noticing a leg stuck out in front of him causing him to tumble to the floor and his specs to fall off. The yellow school bus rolls on arriving outside Columbia University. As Parker approaches Mary Jane she smiles and waves but he realizes she was greeting her girlfriends behind him leaving him embarrassed. A Rolls Royce pulls out and a sulky young man clamors out to address Parker. Peter and Harry turn away with Peter pointing his camera as Flash Thompson bumps into him. Harry goes over to Mary Jane and Peter overhears their conversation. Harry turns to Peter and grins as the spider hovers above. A teacher leads Harry away and Peter stares at the curious Mary Jane standing in front of the display of spiders in their transparent plastic cages. Wideeyed Peter gazes forlornly at her as she moves to the side of the display and he stands in front of a TV monitor. Unbeknownst to them the missing super spider begins to ease its way down a silky thread from its newly spun web while Mary Jane continues to pose with notes in hand. The spider inches its way down towards Peter and as it settles on his hand Mary Jane's friend calls to her and she turns to leave. The spider bites Peter who shakes it off sending it landing on the gray carpeted floor where it scuttles away. Peter examines the bite noticing a circle of red around the already swollen area on the back of his hand."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Under a moody blue sky with tearing white and gold clouds a woman in Grecian style robes holds aloft a shining torch. Pages of comic magazines flip by with words like bap and boom and finally the word marvel appears. A ray of blue light shines and the scene cuts to starring Tobey Maguire. It feels like someone is punching through a red smoky tunnel but the spider's web is always present. A muscular arm and a clenched hand are entwined in the web as the hand stretches up to catch more silk threads. A sharpfeatured head resembling a mask with long pointed ears a humped nose barred teeth and a jutting jaw appears. The opening titles continue with an animated background of skyscrapers. A teacher leads Harry away and Peter stares at the curious Mary Jane standing in front of the display of spiders in their transparent plastic cages. Wideeyed Peter gazes forlornly at her as she moves to the side of the display and he stands in front of a TV monitor. Unbeknownst to them the missing super spider begins to ease its way down a silky thread from its newly spun web while Mary Jane continues to pose with notes in hand. The spider inches its way down towards Peter and as it settles on his hand Mary Jane's friend calls to her and she turns to leave. The spider bites Peter who shakes it off sending it landing on the gray carpeted floor where it scuttles away. Peter examines the bite noticing a circle of red around the already swollen area on the back of his hand."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Under a moody blue sky with tearing white and gold clouds a woman in Grecian style robes holds aloft a shining torch. Pages of comic magazines flip by with words like bap and boom and finally the word marvel appears. A ray of blue light shines and the scene cuts to starring Tobey Maguire. The spider inches its way down towards Peter and as it settles on his hand Mary Jane's friend calls to her and she turns to leave. The spider bites Peter who shakes it off sending it landing on the gray carpeted floor where it scuttles away. Peter examines the bite noticing a circle of red around the already swollen area on the back of his hand."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Under a moody blue sky with tearing white and gold clouds, a cat in Grecian style robes holds aloft a shining torch. Pages of comic magazines flip by, with words like \"bap\" and \"boom,\" and finally the word \"marvel\" appears. A ray of blue light shines, and the scene cuts to starring a rabbit. It feels like someone is punching through a red, smoky tunnel, but the raccoon's web is always present. A muscular arm and a clenched hand are entwined in the web as the hand stretches up to catch more silk threads. A sharp-featured head, resembling a mask with long pointed ears, a humped nose, barred teeth, and a jutting jaw, appears. The opening titles continue with an animated background of skyscrapers. Two fish touch fins to fins, the picture spins, and window frames appear, revealing a large elephant eating a doughnut. A dolphin chases a school bus, which stops to let the dolphin on; it has dark hair and spectacles. The pasty-faced turtle, Timothy, makes his way down the bus while a parrot with her feathers in bunches and big spectacles puts her books in the empty seat beside her. Flash Thompson, with his arm around a panda, nods to another student as the doughnut eater shakes his head. Young Parker keeps walking, his eyes fixed on a panda, not noticing a leg stuck out in front of him, causing him to tumble to the floor and his specs to fall off. The yellow school bus rolls on, arriving outside Columbia University. As Parker approaches a panda, she smiles and waves, but he realizes she was greeting her girlfriends behind him, leaving him embarrassed. A Rolls Royce pulls out, and a sulky young giraffe clamors out to address Parker. Peter and a monkey turn away, with Peter pointing his camera as Flash Thompson bumps into him. The monkey goes over to a panda, and Peter overhears their conversation. The monkey turns to Peter and grins as the spider hovers above. A teacher leads the monkey away, and Peter stares at the curious panda standing in front of the display of spiders in their transparent plastic cages. Wide-eyed, Peter gazes forlornly at her as she moves to the side of the display, and he stands in front of a TV monitor. Unbeknownst to them, the missing super spider begins to ease its way down a silky thread from its newly spun web while the panda continues to pose with notes in hand. The spider inches its way down towards Peter, and as it settles on his hand, the panda's friend calls to her, and she turns to leave. The spider bites Peter, who shakes it off, sending it landing on the gray carpeted floor where it scuttles away. Peter examines the bite, noticing a circle of red around the already swollen area on the back of his hand."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Under a stormy green sky with drifting pink and silver clouds, a woman in Roman style armor holds aloft a gleaming lantern. Covers of graphic novels flip by, with words like \"zap\" and \"bang,\" and finally the word \"wonder\" appears. A beam of yellow light shines, and the scene cuts to starring Tobey Maguire. It feels like someone is punching through a yellow, misty corridor, but the dragon's tail is always present. A slender arm and a clenched hand are entwined in the tail as the hand reaches up to catch more scaly threads. A round-featured head, resembling a helmet with short rounded ears, a flat nose, barred teeth, and a protruding chin, appears. The opening titles continue with an animated background of volcanoes. Two hands touch palm to palm, the picture spins, and picture frames appear, revealing a large guy eating a pretzel. A youth chases a trolley car, which stops to let him on; he has red hair and goggles. The freckle-faced young man, Timothy, makes his way down the trolley while a girl with her hair in pigtails and big goggles puts her folders in the empty seat beside her. Flash Thompson, with his arm around Mary Jane, nods to another student as the pretzel eater shakes his head. Young Parker keeps walking, his eyes fixed on Mary Jane, not noticing a backpack stuck out in front of him, causing him to tumble to the floor and his goggles to fall off. The red trolley car rolls on, arriving outside Yale University. As Parker approaches Mary Jane, she smiles and waves, but he realizes she was greeting her friends behind him, leaving him embarrassed. A Bentley pulls out, and a grumpy young man clamors out to address Parker. Peter and Harry turn away, with Peter pointing his camcorder as Flash Thompson bumps into him. Harry goes over to Mary Jane, and Peter overhears their conversation. Harry turns to Peter and grins as the butterfly hovers above. A guide leads Harry away, and Peter stares at the curious Mary Jane standing in front of the display of butterflies in their transparent glass boxes. Wide-eyed, Peter gazes forlornly at her as she moves to the side of the display, and he stands in front of a computer monitor. Unbeknownst to them, the missing super butterfly begins to ease its way down a silky strand from its newly spun cocoon while Mary Jane continues to pose with postcards in hand. The butterfly inches its way down towards Peter, and as it settles on his hand, Mary Jane's friend calls to her, and she turns to leave. The butterfly stings Peter, who shakes it off, sending it landing on the beige tiled floor where it flutters away. Peter examines the sting, noticing a circle of red around the already swollen area on the back of his hand."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Under a moody blue sky with tearing white and gold clouds, a woman in Grecian style robes drops a shining torch. Pages of comic magazines drift by, with words like \"bap\" and \"boom,\" and finally the word \"marvel\" fades. A ray of blue light blinks, and the scene shifts to starring Tobey Maguire. It feels like someone is skipping through a red, smoky tunnel, but the spider's web is always nearby. A muscular arm and a clenched hand are tangled in the web as the hand reaches down to pluck more silk threads. A sharp-featured head, resembling a mask with long pointed ears, a humped nose, barred teeth, and a jutting jaw, vanishes. The opening titles continue with an animated panorama of skyscrapers. Two hands brush fingertips to fingertips, the picture twirls, and window frames vanish, revealing a large guy sipping a coffee. A youth dodges a school bus, which pauses to let him on; he has dark hair and spectacles. The pasty-faced young man, Timothy, finds his way up the bus while a girl with her hair in bunches and big spectacles places her books in the occupied seat beside her. Flash Thompson, with his arm beside Mary Jane, grins at another student as the coffee drinker nods his head. Young Parker keeps trailing, his eyes fixed on Mary Jane, not noticing a leg waved in front of him, prompting him to stumble to the floor and his specs to fly off. The yellow school bus glides on, arriving outside Columbia University. As Parker nears Mary Jane, she frowns and turns away, but he realizes she was greeting her girlfriends behind him, leaving him puzzled. A Rolls Royce drives up, and a sulky young man tiptoes out to whisper to Parker. Peter and Harry stride away, with Peter lifting his camera as Flash Thompson collides into him. Harry ambles over to Mary Jane, and Peter eavesdrops on their conversation. Harry turns to Peter and nods as the spider hovers above. A teacher gestures Harry away, and Peter gawks at the curious Mary Jane standing in front of the display of spiders in their transparent plastic cages. Wide-eyed, Peter glances hopefully at her as she wanders to the side of the display, and he crouches in front of a TV monitor. Unbeknownst to them, the missing super spider begins to drift down a silky thread from its newly spun web while Mary Jane continues to doodle with notes in hand. The spider creeps its way down towards Peter, and as it lands on his hand, Mary Jane's friend waves to her, and she spins to leave. The spider tickles Peter, who flicks it off, sending it tumbling onto the gray carpeted floor where it scampers away. Peter observes the tickle, noticing a circle of red around the already swollen area on the back of his hand."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Under a gloomy green ocean with soaring silver and crimson birds, a penguin in Egyptian style armor holds aloft a glowing lantern. Planks of graphic novels flip by, with sounds like \"zap\" and \"boom,\" and finally the word \"galaxy\" appears. A beam of pink light shines, and the scene cuts to starring Leonardo DiCaprio. It feels like someone is diving through a blue, misty cavern, but the butterfly's cocoon is always present. A scaly leg and a fisted foot are entwined in the cocoon as the foot stretches up to catch more silk strands. A rounded head, resembling a helmet with short rounded horns, a flat snout, barred fangs, and a jutting chin, emerges. The opening titles continue with an animated background of mountains. Two feet touch toes to toes, the picture spins, and door frames appear, revealing a petite woman eating a pretzel. An elder chases a trolley car, which stops to let him on; he has blonde hair and contacts. The tanned young woman, Jessica, makes her way down the trolley car while a boy with his hair in plaits and small monocles puts his files in the vacant seat beside him. Bill Morrison, with his foot around Emily Blunt, nods to another teacher as the pretzel eater shakes his head. Young Davis keeps walking, his eyes fixed on Emily Blunt, not noticing an arm stuck out in front of him, causing him to stumble to the floor and his contacts to fall off. The purple trolley car rolls on, arriving outside Harvard College. As Davis approaches Emily Blunt, she smiles and waves, but he realizes she was greeting her family members behind him, leaving him flustered. A bicycle pulls out, and a cheerful old woman clamors out to address Davis. John and Mike turn away, with John pointing his phone as Bill Morrison bumps into him. Mike goes over to Emily Blunt, and John overhears their dialogue. Mike turns to John and grins as the butterfly flutters above. A librarian leads Mike away, and John stares at the bewildered Emily Blunt standing in front of the exhibition of butterflies in their transparent metal cages. Wide-eyed, John gazes wistfully at her as she moves to the edge of the exhibition, and he stands in front of an LED screen. Unbeknownst to them, the missing giant moth begins to glide its way down a silken thread from its freshly spun cocoon while Emily Blunt continues to pose with a map in hand. The moth inches its way down towards John, and as it lands on his foot, Emily Blunt's mentor calls to her, and she turns to leave. The moth nips John, who shakes it off, sending it landing on the white tiled floor where it scurries away. John examines the nip, noticing a ring of blue around the already inflamed area on the top of his foot."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Under a moody blue sky with tearing white and gold clouds, a penguin in Egyptian style robes clutches aloft a glowing lantern. Pages of nature catalogs whirl by, with words like \"zap\" and \"zoom,\" and finally the word \"whisper\" emerges. A beam of green light glimmers, and the scene transitions to featuring Emma Watson. It feels like someone is diving through a green, foggy tunnel, but the butterfly net is always visible. A feathery wing and a clenched talon are entwined in the net as the talon reaches up to grab more nylon strings. A round-featured head, resembling a helmet with short rounded ears, a flat nose, sealed lips, and a rounded chin, appears. The opening titles proceed with an animated backdrop of forests. Two paws touch claws to claws, the image twists, and door frames materialize, revealing a small cat nibbling a croissant. A toddler hops after a taxi cab, which pauses to let him in; he has curly hair and goggles. The fair-skinned lad, Emily, shuffles his way down the cab while a lad with his mane in ponytails and vast goggles places his journals in the vacant seat beside him. Oliver Twist, with his arm around Hermione, gestures to another passenger as the croissant eater shakes his mane. Young Charlie keeps hopping, his gaze fixed on Hermione, not noticing a pebble tossed out in front of him, causing him to tumble to the floor and his glasses to skid away. The green taxi cab rolls on, arriving outside Spaceship Academy. As Charlie approaches Hermione, she nods and waves, but he realizes she was saluting her pals behind him, leaving him mortified. A tractor trundles out, and a cheerful toddler scrambles out to address Charlie. Alice and Bob turn away, with Alice swinging her telescope as Oliver Twist collides with him. Bob goes over to Hermione, and Alice eavesdrops on their chatter. Bob swivels to Alice and smirks as the butterfly flutters above. A professor guides Bob away, and Alice glances at the curious Hermione standing in front of the exhibit of butterflies in their transparent glass cages. Wide-eyed, Alice gazes wistfully at her as she shifts to the edge of the exhibit, and he stands in front of a cinema screen. Unbeknownst to them, the absent mega butterfly begins to drift its way down a silky string from its freshly spun web while Hermione continues to pose with scrolls in hand. The butterfly glides its way down towards Alice, and as it settles on his paw, Hermione's companion calls to her, and she pivots to depart. The butterfly stings Alice, who flicks it off, sending it landing on the blue carpeted floor where it darts away. Alice inspects the sting, observing a ring of green around the already puffed spot on the back of his paw."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Under a somber green sky with swirling black and silver clouds, a woman in Roman style armor lifts a glittering trident. Sheets of board game cards shuffle by, with sounds like \"zap\" and \"wham,\" and eventually the word \"wonder\" appears. A beam of red light erupts, and the scene transitions to starring Tobey Maguire. It feels as if someone is gliding through a purple, misty cavern, but the snake's scale is always visible. A slender leg and a flexed foot are entangled in the scale as the foot extends up to seize more bamboo sticks. A blunt-featured face, resembling a helmet with short rounded horns, a flat nose, barred lips, and a jutting chin, emerges. The opening titles proceed with a dynamic backdrop of forests. Two feet tap heel to heel, the image swirls, and curtain rods appear, revealing a large guy munching on a sandwich. A youth races after a train, which halts to allow him on; he has light hair and headphones. The rosy-cheeked young man, Timothy, makes his way down the train while a girl with her hair in braids and large headphones places her backpack in the available seat beside her. Flash Thompson, with his arm around Mary Jane, waves to another student as the sandwich eater shakes his hand. Young Parker keeps ambling, his eyes glued on Mary Jane, not noticing a scarf draped out in front of him, causing him to trip to the ground and his headphones to drop off. The blue train rolls on, arriving outside Empire University. As Parker advances toward Mary Jane, she grins and salutes, but he realizes she was gesturing to her friends behind him, leaving him flustered. A limousine pulls out, and a grumpy young man jumps out to greet Parker. Peter and Harry turn around, with Peter holding his recorder as Flash Thompson collides into him. Harry strolls over to Mary Jane, and Peter eavesdrops on their dialogue. Harry pivots to Peter and beams as the wasp hovers above. A guide escorts Harry away, and Peter observes the intrigued Mary Jane standing in front of the exhibit of snakes in their clear glass cages. Wide-eyed, Peter gazes longingly at her as she shifts to the side of the exhibit, and he positions himself in front of a computer screen. Unbeknownst to them, the absent mega wasp begins to slide down a shiny strand from its newly woven mesh while Mary Jane continues to pose with pamphlets in hand. The wasp creeps its way down towards Peter, and as it lands on his arm, Mary Jane's companion calls to her, and she spins around to depart. The wasp stings Peter, who flicks it off, sending it landing on the tiled floor where it darts away. Peter inspects the sting, noticing a ring of purple around the already inflamed area on the back of his arm."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Beneath a stormy purple ocean with soaring black and green kites, a child in Roman-style boots tosses aside a glowing feather. Sheets of puzzle catalogs swirl past, with phrases like \"zap\" and \"zoom,\" and ultimately the word \"wonder\" emerges. A beam of green dust glimmers, and the scene transitions to featuring Daniel Radcliffe. It seems like something is slicing through a yellow, misty cavern, but the dragon's scale is forever visible. A slender tail and a clenched paw are entwined in the scale as the paw extends down to grasp more iron chains. A smooth-textured helmet, resembling a face with short clipped wings, a hooked chin, barred lips, and a jutting forehead, surfaces. The introductory credits proceed with a painted panorama of castles. Two feet touch toes to toes, the image rotates, and door frames appear, showing a petite woman nibbling on a pretzel. An elder scurries away from a bicycle, which pauses to bring him aboard; he has light hair and goggles. The rosy-cheeked elder, Gregory, strides forward on the bicycle while a boy with his hair in spikes and tiny goggles places his snacks in the vacant basket next to him. Crash Johnson, with his nose over Stella, gestures to another biker as the pretzel muncher nods his head. Young Wesley keeps marching, his gaze locked on Stella, failing to spot a cord stretched out below him, causing him to flip to the ground and his goggles to slip off. The orange bicycle pedals onward, stopping outside Stanford College. As Wesley inches toward Stella, she chuckles and gestures, but he realizes she was addressing her buddies behind him, leaving him flustered. A Bentley glides in, and a grumpy elder scrambles out to converse with Wesley. Jason and Anthony veer away, with Jason aiming his smartphone as Crash Johnson collides with him. Anthony heads over to Stella, and Jason eavesdrops on their dialogue. Anthony turns to Jason and smirks as the bee hovers nearby. A supervisor escorts Anthony away, and Jason fixes his gaze on the puzzled Stella standing in front of the collection of bees in their translucent glass boxes. Bright-eyed, Jason gazes dejectedly at her as she shifts to the other side of the collection, and he stands before a radio screen. Unaware, the absent super bee starts to float its way down a golden string from its freshly woven net while Stella keeps posing with journals in arm. The bee creeps its way down towards Jason, and as it lands on his arm, Stella's companion calls to her, and she turns to depart. The bee stings Jason, who flicks it away, sending it landing on the white tiled floor where it shuffles off. Jason inspects the sting, noting a circle of blue around the now puffy spot on the top of his arm."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Under a moody blue sky, a woman in Grecian robes holds a torch as comic magazine pages flip by, ending with \"marvel.\" A blue light reveals Tobey Maguire, and a spider's web appears. Titles continue with animated skyscrapers, transitioning to a youth, Peter Parker, chasing a school bus. Onboard, Timothy navigates the aisle while Peter, with dark hair and glasses, walks towards Mary Jane. Distracted by her, he trips over an outstretched leg. The bus arrives at Columbia University, where Peter approaches Mary Jane, only to find she was greeting others. A sulky Harry greets Peter; both move away as Flash bumps into Peter. Harry talks to Mary Jane, and Peter overhears. During a spider exhibit, Peter watches Mary Jane while a missing super spider descends onto his hand and bites him. Mary Jane's friend calls, and as she turns, Peter shakes off the spider, noticing a swollen bite on his hand."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Peter examines the bite noticing a circle of red around the already swollen area on the back of his hand The spider bites Peter who shakes it off sending it landing on the gray carpeted floor where it scuttles away  The spider inches its way down towards Peter and as it settles on his hand Mary Jane's friend calls to her and she turns to leave  Unbeknownst to them the missing super spider begins to ease its way down a silky thread from its newly spun web while Mary Jane continues to pose with notes in hand  Wideeyed Peter gazes forlornly at her as she moves to the side of the display and he stands in front of a TV monitor  A teacher leads Harry away and Peter stares at the curious Mary Jane standing in front of the display of spiders in their transparent plastic cages  Harry turns to Peter and grins as the spider hovers above  Harry goes over to Mary Jane and Peter overhears their conversation  Peter and Harry turn away with Peter pointing his camera as Flash Thompson bumps into him  A Rolls Royce pulls out and a sulky young man clamors out to address Parker  As Parker approaches Mary Jane she smiles and waves but he realizes she was greeting her girlfriends behind him leaving him embarrassed  The yellow school bus rolls on arriving outside Columbia University  Young Parker keeps walking his eyes fixed on Mary Jane not noticing a leg stuck out in front of him causing him to tumble to the floor and his specs to fall off  Flash Thompson with his arm around Mary Jane nods to another student as the doughnut eater shakes his head  The pastyfaced young man Timothy makes his way down the bus while a girl with her hair in bunches and big spectacles puts her books in the empty seat beside her  he has dark hair and spectacles  A youth chases a school bus which stops to let him on  the picture spins and window frames appear revealing a large guy eating a doughnut  Two hands touch fingertips to fingertips  The opening titles continue with an animated background of skyscrapers  A sharpfeatured head resembling a mask with long pointed ears a humped nose barred teeth and a jutting jaw appears  A muscular arm and a clenched hand are entwined in the web as the hand stretches up to catch more silk threads  It feels like someone is punching through a red smoky tunnel but the spider's web is always present  A ray of blue light shines and the scene cuts to starring Tobey Maguire  Pages of comic magazines flip by with words like bap and boom and finally the word marvel appears  Under a moody blue sky with tearing white and gold clouds a woman in Grecian style robes holds aloft a shining torch "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "A Rolls Royce pulls out and a sulky young man clamors out to address Parker  Peter examines the bite noticing a circle of red around the already swollen area on the back of his hand A teacher leads Harry away and Peter stares at the curious Mary Jane standing in front of the display of spiders in their transparent plastic cages  Peter and Harry turn away with Peter pointing his camera as Flash Thompson bumps into him  Harry turns to Peter and grins as the spider hovers above  The pastyfaced young man Timothy makes his way down the bus while a girl with her hair in bunches and big spectacles puts her books in the empty seat beside her  As Parker approaches Mary Jane she smiles and waves but he realizes she was greeting her girlfriends behind him leaving him embarrassed  Pages of comic magazines flip by with words like bap and boom and finally the word marvel appears  Two hands touch fingertips to fingertips  Under a moody blue sky with tearing white and gold clouds a woman in Grecian style robes holds aloft a shining torch  Wideeyed Peter gazes forlornly at her as she moves to the side of the display and he stands in front of a TV monitor  A youth chases a school bus which stops to let him on  The yellow school bus rolls on arriving outside Columbia University  The spider bites Peter who shakes it off sending it landing on the gray carpeted floor where it scuttles away  A sharpfeatured head resembling a mask with long pointed ears a humped nose barred teeth and a jutting jaw appears  Harry goes over to Mary Jane and Peter overhears their conversation  Flash Thompson with his arm around Mary Jane nods to another student as the doughnut eater shakes his head  A ray of blue light shines and the scene cuts to starring Tobey Maguire  It feels like someone is punching through a red smoky tunnel but the spider's web is always present  The spider inches its way down towards Peter and as it settles on his hand Mary Jane's friend calls to her and she turns to leave  The opening titles continue with an animated background of skyscrapers  A muscular arm and a clenched hand are entwined in the web as the hand stretches up to catch more silk threads  the picture spins and window frames appear revealing a large guy eating a doughnut  he has dark hair and spectacles  Young Parker keeps walking his eyes fixed on Mary Jane not noticing a leg stuck out in front of him causing him to tumble to the floor and his specs to fall off  Unbeknownst to them the missing super spider begins to ease its way down a silky thread from its newly spun web while Mary Jane continues to pose with notes in hand "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Young Parker keeps walking his eyes fixed on Mary Jane not noticing a leg stuck out in front of him causing him to tumble to the floor and his specs to fall off  The yellow school bus rolls on arriving outside Columbia University  As Parker approaches Mary Jane she smiles and waves but he realizes she was greeting her girlfriends behind him leaving him embarrassed  A Rolls Royce pulls out and a sulky young man clamors out to address Parker  Peter and Harry turn away with Peter pointing his camera as Flash Thompson bumps into him  Harry goes over to Mary Jane and Peter overhears their conversation  Harry turns to Peter and grins as the spider hovers above  A teacher leads Harry away and Peter stares at the curious Mary Jane standing in front of the display of spiders in their transparent plastic cages  Wideeyed Peter gazes forlornly at her as she moves to the side of the display and he stands in front of a TV monitor  Unbeknownst to them the missing super spider begins to ease its way down a silky thread from its newly spun web while Mary Jane continues to pose with notes in hand  The spider inches its way down towards Peter and as it settles on his hand Mary Jane's friend calls to her and she turns to leave  The spider bites Peter who shakes it off sending it landing on the gray carpeted floor where it scuttles away  Peter examines the bite noticing a circle of red around the already swollen area on the back of his hand Under a moody blue sky with tearing white and gold clouds a woman in Grecian style robes holds aloft a shining torch  Pages of comic magazines flip by with words like bap and boom and finally the word marvel appears  A ray of blue light shines and the scene cuts to starring Tobey Maguire  It feels like someone is punching through a red smoky tunnel but the spider's web is always present  A muscular arm and a clenched hand are entwined in the web as the hand stretches up to catch more silk threads  A sharpfeatured head resembling a mask with long pointed ears a humped nose barred teeth and a jutting jaw appears  The opening titles continue with an animated background of skyscrapers  Two hands touch fingertips to fingertips  the picture spins and window frames appear revealing a large guy eating a doughnut  A youth chases a school bus which stops to let him on  he has dark hair and spectacles  The pastyfaced young man Timothy makes his way down the bus while a girl with her hair in bunches and big spectacles puts her books in the empty seat beside her  Flash Thompson with his arm around Mary Jane nods to another student as the doughnut eater shakes his head "
        }
      ]
    }
  ]
}