{
  "ground_truth": "As the door opens, Harry enters, clutching a bouquet of flowers, and MJ quickly pulls her hand away from Peter's. Harry stares at them with a disappointed look on his face, and the three of them appear awkward. That evening, Harry strides into the dimly lit, arched Osborne living room. Hearing voices, he moves towards the stairs and climbs the grand staircase. His father, Norman, appears on the landing which encircles the room. Harry spreads his arms wide as Norman leans on the wood-carved rail, looking down and shaking his head at his son, who continues up the stairs sullenly. Harry looks at his father quizzically, and Norman steps down to him, then wraps him in his arms. Harry closes his eyes as tears well up in them. Peter rests his head on his aunt's bed, looking coy and thoughtful before turning away in alarm as he stands at a pay phone in the hospital. His eyes widen upon seeing MJ unconscious, a stiff breeze ruffling her hair and nightclothes, which rouses her. MJ gets to her feet on a metal platform high above the city lights, steps back to the edge, and manages to keep her balance. Way below her, traffic moves across the Queensboro Bridge as she stands on one of the towers of the steel structure. The Green Goblin approaches and glides over the ducking MJ, who watches him move towards a cable car filled with children and adults. The Green Goblin shoots a missile, destroying the cable-car station, and motor cars on the bridge collide. From a nearby rooftop, Spider-Man observes the chaos as a massive metal wheel flies into the air, a cable whips free, and the Roosevelt Island cable car begins to fall. The Green Goblin grabs the cable, stabilizing the car, as Spider-Man, standing on a thick strand of web tied between two flagpoles, launches himself into the air by walking down a building. He shoots webs, maneuvering along the steel girders until he lands on a metal strut. Above him, the Goblin holds MJ in one hand and the cable-car cable in the other, lifting MJ as her slippers slip off. The cable car swings in the wind, suspended solely by the Goblin's grip. The Goblin releases both MJ and the cable simultaneously. In the reflections of the large spider eyes on Spider-Man's mask, one shows MJ falling and the other the cable car full of screaming, frightened children. Spider-Man runs along the girder, leaps to catch MJ, and then swings beneath the span to ensnare the cable car in his web.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "As the portal opens, Harry enters, grasping a bouquet of blooms, and MJ quickly pulls her hand away from Peter's. Harry gazes at them with a dissatisfied expression on his visage, and the trio of them seem awkward. That evening, Harry marches into the dimly lit, arched Osborne sitting room. Hearing voices, he moves towards the stairs and ascends the grand staircase. His father, Norman, appears on the landing which surrounds the room. Harry extends his arms wide as Norman leans on the wood-carved banister, looking down and shaking his head at his offspring, who continues up the stairs morosely. Harry looks at his father questioningly, and Norman steps down to him, then enfolds him in his arms. Harry closes his eyes as tears well up in them. Peter rests his head on his aunt's bed, looking shy and reflective before turning away in shock as he stands at a pay phone in the infirmary. His eyes widen upon seeing MJ unconscious, a stiff breeze tousling her hair and nightwear, which rouses her. MJ gets to her feet on a metal platform high above the city lights, steps back to the brink, and manages to maintain her balance. Way below her, traffic moves across the Queensboro Bridge as she stands on one of the towers of the steel framework. The Green Goblin approaches and glides over the ducking MJ, who watches him move towards a cable car filled with children and adults. The Green Goblin shoots a missile, demolishing the cable-car station, and motor vehicles on the bridge collide. From a nearby rooftop, Spider-Man observes the chaos as a massive metal wheel flies into the air, a cable lashes free, and the Roosevelt Island cable car begins to fall. The Green Goblin grabs the cable, stabilizing the car, as Spider-Man, standing on a thick strand of web tied between two flagpoles, propels himself into the air by walking down a building. He shoots webs, maneuvering along the steel girders until he lands on a metal strut. Above him, the Goblin holds MJ in one hand and the cable-car cable in the other, lifting MJ as her slippers slip off. The cable car swings in the wind, suspended solely by the Goblin's grip. The Goblin releases both MJ and the cable simultaneously. In the reflections of the large arachnid eyes on Spider-Man's mask, one shows MJ plummeting and the other the cable car full of screaming, terrified children. Spider-Man runs along the girder, leaps to catch MJ, and then swings beneath the span to ensnare the cable car in his web."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "As the door is opened, Harry is seen entering, clutching a bouquet of flowers, and her hand is quickly pulled away from Peter's by MJ. They are stared at by Harry, who has a disappointed look on his face, and awkwardness is apparent among the three of them. That evening, the dimly lit, arched Osborne living room is strode into by Harry. Hearing voices, the stairs are approached by him, and the grand staircase is climbed. Norman, his father, appears on the landing which encircles the room. Harry's arms are spread wide as the wood-carved rail is leaned on by Norman, who looks down and shakes his head at his son, continuing up the stairs sullenly. His father is looked at quizzically by Harry, and Norman steps down to him, then wraps him in his arms. Harry's eyes are closed as tears well up in them. Peter’s head is rested on his aunt's bed, looking coy and thoughtful before he turns away in alarm while standing at a pay phone in the hospital. Upon seeing MJ unconscious, his eyes widen, a stiff breeze ruffling her hair and nightclothes, rousing her. MJ gets to her feet on a metal platform high above the city lights, steps back to the edge, and manages to keep her balance. Traffic is moved across the Queensboro Bridge below her as she stands on one of the towers of the steel structure. The Green Goblin is approached and glides over the ducking MJ, watching him move towards a cable car filled with children and adults. A missile is shot by the Green Goblin, destroying the cable-car station, and motor cars on the bridge are collided. The chaos is observed by Spider-Man from a nearby rooftop as a massive metal wheel flies into the air, a cable is whipped free, and the Roosevelt Island cable car begins to fall. The cable is grabbed by the Green Goblin, stabilizing the car, as Spider-Man, standing on a thick strand of web tied between two flagpoles, launches himself into the air by walking down a building. Webs are shot by him, maneuvering along the steel girders until a landing is made on a metal strut. Above him, MJ is held in one hand and the cable-car cable in the other by the Goblin, lifting MJ as her slippers slip off. The cable car in the wind is swung, suspended solely by the Goblin's grip. Both MJ and the cable are released simultaneously by the Goblin. In the reflections of the large spider eyes on Spider-Man's mask, one shows MJ falling and the other the cable car full of screaming, frightened children. Along the girder, Spider-Man runs, leaps to catch MJ, and then swings beneath the span to ensnare the cable car in his web."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "As the door opens, Harry enters with a bouquet of flowers, and MJ quickly pulls her hand from Peter's. Harry looks disappointed, creating an awkward moment. That evening, Harry walks into the dimly lit Osborne living room. Hearing voices, he ascends the grand staircase. His father, Norman, appears on the landing, leaning on the rail and shaking his head. Harry spreads his arms, looking puzzled, as Norman steps down to embrace him. Harry closes his eyes, tears welling up. Peter rests his head on his aunt's hospital bed, looking thoughtful, then turns away in alarm at a pay phone. His eyes widen as he sees MJ unconscious, a breeze ruffling her hair, waking her. MJ stands on a metal platform above city lights, balancing on the edge. Below, traffic crosses the Queensboro Bridge as she stands on a tower. The Green Goblin glides over MJ, heading for a cable car filled with people. He fires a missile, destroying the station, causing bridge cars to collide. Spider-Man watches from a rooftop as chaos unfolds, with a cable car beginning to fall. The Green Goblin grabs the cable, stabilizing it, while Spider-Man launches himself into the air, maneuvering along steel girders. The Goblin holds MJ and the cable, lifting her as her slippers slip off. The cable car swings, held only by the Goblin. He releases both MJ and the cable. Reflected in Spider-Man's mask, one eye shows MJ falling, the other the cable car with terrified children. Spider-Man runs along the girder, leaps to catch MJ, and swings beneath the span to ensnare the cable car in his web."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "As the door opens, Harry enters with flowers, and MJ quickly pulls her hand from Peter's. Harry looks disappointed, and they all seem awkward. That evening, Harry enters the dim Osborne living room, hears voices, and climbs the grand staircase. His father, Norman, appears, shaking his head at Harry, who continues up sullenly. Norman steps down, embraces Harry, who closes his eyes tearfully. Peter, at a hospital pay phone, looks alarmed seeing MJ unconscious, a breeze ruffling her hair, waking her. MJ stands on a high platform above city lights, balancing at the edge. Below, traffic crosses the Queensboro Bridge as she stands on a tower. The Green Goblin glides over MJ, heading for a cable car with children and adults. He shoots a missile, destroying the station, causing bridge collisions. Spider-Man observes from a rooftop as chaos ensues, a cable car begins to fall. The Goblin grabs the cable, stabilizing it, as Spider-Man launches himself, maneuvering along girders to a metal strut. The Goblin holds MJ and the cable, then releases both. Spider-Man's mask reflects MJ falling and the cable car with screaming children. He leaps to catch MJ, then swings to ensnare the cable car in his web."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As the door swings open with a gentle creak, Harry steps inside, tightly clutching a vibrant bouquet of flowers in his hands. In response, MJ swiftly retracts her hand from Peter's grasp. Harry fixes his gaze on them, his face etched with a look of disappointment, and the atmosphere among the three of them becomes palpably awkward. Later that evening, Harry strides purposefully into the dimly lit, elegantly arched Osborne living room. Hearing the murmur of voices, he instinctively moves towards the grand staircase and begins to ascend its impressive steps. His father, Norman, suddenly appears on the landing that gracefully encircles the room. With a wide gesture, Harry spreads his arms as Norman leans on the intricately wood-carved rail, looking down at his son and shaking his head in disapproval. Harry continues his ascent, his expression sullen and quizzical, as Norman steps down to meet him, wrapping him in a warm embrace. Harry closes his eyes, feeling the sting of tears welling up in them.\n\nMeanwhile, Peter rests his head thoughtfully on his aunt's hospital bed, appearing both coy and contemplative. Suddenly, he turns away in alarm, standing at a pay phone in the hospital corridor. His eyes widen in shock as he sees MJ lying unconscious, a stiff breeze ruffling her hair and nightclothes, which eventually rouses her. MJ slowly gets to her feet on a metal platform high above the dazzling city lights, cautiously stepping back to the edge and managing to maintain her balance. Far below her, traffic steadily moves across the Queensboro Bridge as she stands precariously on one of the towering steel structures. The Green Goblin approaches menacingly, gliding over the ducking MJ, who watches him intently as he moves towards a cable car filled with children and adults. The Green Goblin fires a missile, causing a devastating explosion at the cable-car station, and motor cars on the bridge collide in chaos. From a nearby rooftop, Spider-Man observes the unfolding mayhem as a massive metal wheel is sent flying into the air, a cable snaps free, and the Roosevelt Island cable car begins its terrifying descent. The Green Goblin seizes the cable, stabilizing the car precariously, while Spider-Man, standing on a thick strand of web stretched between two flagpoles, launches himself into the air by walking down the side of a building. He skillfully shoots webs, maneuvering along the steel girders until he lands on a sturdy metal strut. Above him, the Goblin holds MJ in one hand and the cable-car cable in the other, lifting MJ as her slippers slip off her feet. The cable car swings dangerously in the wind, suspended solely by the Goblin's grip. In a dramatic moment, the Goblin releases both MJ and the cable simultaneously. Reflected in the large spider eyes on Spider-Man's mask, one shows MJ plummeting and the other the cable car full of screaming, terrified children. Spider-Man races along the girder, leaps to catch MJ, and then swings beneath the span to skillfully ensnare the cable car in his web."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the heavy door creaks open with a gentle but noticeable sound, Harry steps inside the room with determination, tightly clutching a vibrant, colorful bouquet of flowers in his hands. In response to his sudden presence, MJ quickly retracts her hand from Peter's grasp, almost instinctively. Harry fixes his gaze intently on them, his face etched with a look of clear disappointment, and the atmosphere among the three of them immediately becomes palpably tense and awkward.\n\nLater that evening, Harry strides purposefully into the dimly lit, elegantly arched Osborne living room. Hearing the soft murmur of voices echoing throughout the room, he instinctively moves toward the grand and majestic staircase and begins to ascend its impressive, beautifully crafted steps. His father, Norman, suddenly appears on the landing that gracefully encircles the room below. With a wide, open gesture, Harry spreads his arms in greeting as Norman leans casually on the intricately wood-carved railing, looking down at his son with a disapproving shake of his head. Harry continues his ascent, his expression sullen and quizzical, while Norman steps down to meet him and envelops him in a warm, fatherly embrace. Harry closes his eyes tightly, feeling the emotional sting of tears welling up in them.\n\nMeanwhile, Peter rests his head thoughtfully on his aunt's hospital bed, appearing both reflective and contemplative. Suddenly, he turns away in alarm and finds himself standing at a pay phone in the hospital corridor, his eyes widening in shock and disbelief as he sees MJ lying unconscious. A stiff breeze unexpectedly ruffles her hair and nightclothes, gently waking her from her state. MJ slowly gets to her feet on a metal platform high above the glittering, dazzling city lights, cautiously stepping back to the edge and managing to maintain her balance. Far below her, traffic moves steadily across the Queensboro Bridge as she precariously stands on one of the towering, steel structures. The Green Goblin approaches menacingly, gliding over the ducking MJ, who watches him intently and fearfully as he moves toward a cable car filled with both children and adults.\n\nThe Green Goblin fires a missile, causing a devastating explosion at the cable-car station, while motor cars on the bridge collide in utter chaos. From a nearby rooftop, Spider-Man observes the unfolding mayhem as a massive metal wheel is sent flying into the air, a cable snaps free, and the Roosevelt Island cable car begins its terrifying, uncontrolled descent. The Green Goblin seizes the cable, stabilizing the car precariously, while Spider-Man, standing on a thick, strong strand of web stretched between two high flagpoles, launches himself into the air by walking down the side of a tall building. He skillfully shoots webs, maneuvering quickly along the steel girders until he lands securely on a sturdy metal strut. Above him, the Goblin holds MJ in one hand and the cable-car cable in the other, lifting MJ as her slippers slowly slide off her feet. The cable car swings dangerously in the wind, suspended solely by the Goblin's strong grip. In a dramatic, tense moment, the Goblin releases both MJ and the cable simultaneously. Reflected in the large, expressive spider eyes on Spider-Man's mask, one eye shows MJ plummeting and the other the cable car full of screaming, terrified children. Spider-Man races along the girder, leaps into the air to catch MJ, and then swings beneath the span to skillfully ensnare the falling cable car in his web."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the door slowly swings open, Harry steps inside, carefully holding a bouquet of flowers in his hands. His entrance prompts MJ to quickly retract her hand from Peter's, creating a sudden shift in the room's atmosphere. Harry's eyes fix on them, his face clouded with disappointment, and an awkward silence envelops the trio. Later that evening, Harry confidently strides into the dimly lit Osborne living room, its arched ceiling casting shadows across the space. Hearing the murmur of voices, he instinctively moves towards the source, approaching the grand staircase with purpose. He begins to ascend the stairs, each step echoing in the quiet room. As he reaches the landing, his father, Norman, appears above, leaning casually on the intricately carved wooden rail. Norman's eyes meet Harry's, and he shakes his head disapprovingly, causing Harry to spread his arms wide in a gesture of confusion and frustration. Despite his father's disapproval, Harry continues his ascent, his demeanor sullen and questioning. As he reaches the top, he looks at his father with a mix of curiosity and hurt. Norman steps down to meet him, closing the distance between them, and envelops Harry in a warm embrace. Overwhelmed by emotion, Harry closes his eyes, feeling tears begin to form. Meanwhile, Peter is at the hospital, resting his head thoughtfully on his aunt's bed. His expression is coy and contemplative until a sudden realization causes him to turn away in alarm. He finds himself standing at a pay phone, his eyes widening in shock as he sees MJ lying unconscious. A stiff breeze ruffles her hair and nightclothes, gently stirring her awake. MJ slowly rises to her feet, finding herself on a metal platform high above the city lights. She cautiously steps back to the edge, her heart racing as she manages to maintain her balance. Far below, the traffic flows steadily across the Queensboro Bridge, while she stands precariously on one of the steel structure's towers. Suddenly, the Green Goblin approaches, gliding menacingly over the ducking MJ, who watches in horror as he moves towards a cable car filled with children and adults. The Green Goblin fires a missile, causing a violent explosion that destroys the cable-car station, and the resulting chaos leads to motor cars on the bridge colliding. From a nearby rooftop, Spider-Man observes the unfolding disaster, his attention caught by a massive metal wheel flying into the air and a cable snapping free. The Roosevelt Island cable car begins to plummet, but the Green Goblin seizes the cable, stabilizing the car precariously. Spider-Man, standing on a thick strand of web stretched between two flagpoles, propels himself into the air by walking down the side of a building. He skillfully shoots webs, navigating along the steel girders until he lands on a metal strut. Above him, the Goblin holds MJ in one hand and the cable-car cable in the other, lifting MJ as her slippers slip off her feet. The cable car swings dangerously in the wind, suspended solely by the Goblin's grip. In a dramatic moment, the Goblin releases both MJ and the cable simultaneously. In the reflections of Spider-Man's large, expressive eyes on his mask, one shows MJ plummeting through the air, while the other captures the cable car full of screaming, terrified children. Reacting swiftly, Spider-Man races along the girder, leaping into the air to catch MJ. He then swings beneath the bridge span, expertly ensnaring the falling cable car in his web, preventing disaster."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As Harry enters with a bouquet of flowers, MJ quickly withdraws her hand from Peter's, creating an awkward moment as Harry looks on disappointedly. Later, Harry strides into the dimly lit Osborne living room, hears voices, and ascends the grand staircase. His father, Norman, appears on the landing, shaking his head as Harry approaches with open arms. Norman steps down to embrace Harry, who closes his eyes, tears welling up. Meanwhile, Peter, at a hospital pay phone, turns in alarm upon seeing MJ unconscious. She awakens on a high metal platform above the city, maintaining her balance at the edge. Below, traffic moves across the Queensboro Bridge as the Green Goblin glides over MJ, targeting a cable car filled with people. He destroys the cable-car station, causing chaos on the bridge. Spider-Man observes from a rooftop, launching himself into action as the cable car begins to fall. The Green Goblin stabilizes the car by grabbing the cable while holding MJ. As Spider-Man maneuvers along the steel girders, the Goblin releases both MJ and the cable. Spider-Man, seeing MJ and the cable car in his mask's reflections, leaps to catch MJ and swings beneath the span to secure the cable car with his web."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "As the door opens, Harry enters, clutching a bouquet of flowers, which he had picked up from the local florist known for its exquisite arrangements, and MJ quickly pulls her hand away from Peter's. Harry stares at them with a disappointed look on his face, and the three of them appear awkward. That evening, Harry strides into the dimly lit, arched Osborne living room, designed to emulate the grandiose styles of the Gilded Age mansions. Hearing voices, he moves towards the stairs and climbs the grand staircase made of mahogany wood. His father, Norman, who is the head of the multinational corporation Oscorp, appears on the landing which encircles the room. Harry spreads his arms wide as Norman leans on the wood-carved rail, looking down and shaking his head at his son, who continues up the stairs sullenly. Harry looks at his father quizzically, and Norman steps down to him, then wraps him in his arms. Harry closes his eyes as tears well up in them. Peter rests his head on his aunt's bed, looking coy and thoughtful before turning away in alarm as he stands at a pay phone in the hospital, located in the city’s busiest medical center. His eyes widen upon seeing MJ unconscious, a stiff breeze from the open window ruffling her hair and nightclothes, which rouses her. MJ gets to her feet on a metal platform high above the city lights, part of an ongoing construction site, steps back to the edge, and manages to keep her balance. Way below her, traffic moves across the Queensboro Bridge, built in the early 20th century and connecting Manhattan to Queens, as she stands on one of the towers of the steel structure. The Green Goblin, a notorious villain equipped with advanced technology, approaches and glides over the ducking MJ, who watches him move towards a cable car filled with children and adults, a common tourist attraction known for its scenic views. The Green Goblin shoots a missile, destroying the cable-car station, and motor cars on the bridge collide. From a nearby rooftop, Spider-Man observes the chaos as a massive metal wheel, part of the cable car's mechanism, flies into the air, a cable whips free, and the Roosevelt Island cable car begins to fall. The Green Goblin grabs the cable, stabilizing the car, as Spider-Man, standing on a thick strand of web tied between two flagpoles, launches himself into the air by walking down a building, a technique known as the web zip. He shoots webs, maneuvering along the steel girders until he lands on a metal strut. Above him, the Goblin holds MJ in one hand and the cable-car cable in the other, lifting MJ as her slippers, a gift from Peter, slip off. The cable car swings in the wind, suspended solely by the Goblin's grip. The Goblin releases both MJ and the cable simultaneously. In the reflections of the large spider eyes on Spider-Man's mask, one shows MJ falling and the other the cable car full of screaming, frightened children. Spider-Man runs along the girder, leaps to catch MJ, and then swings beneath the span to ensnare the cable car in his web, saving both MJ and the passengers from certain doom."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "As the door opens Harry enters clutching a bouquet of flowers and MJ quickly pulls her hand away from Peter's. Harry stares at them with a disappointed look on his face and the three of them appear awkward. That evening Harry strides into the dimly lit arched Osborne living room. Hearing voices he moves towards the stairs and climbs the grand staircase. His father Norman appears on the landing which encircles the room. Harry spreads his arms wide as Norman leans on the woodcarved rail looking down and shaking his head at his son who continues up the stairs sullenly. Harry looks at his father quizzically and Norman steps down to him then wraps him in his arms. Harry closes his eyes as tears well up in them. Peter rests his head on his aunt's bed looking coy and thoughtful before turning away in alarm as he stands at a pay phone in the hospital. His eyes widen upon seeing MJ unconscious. a stiff breeze ruffling her hair and nightclothes which rouses her. MJ gets to her feet on a metal platform high above the city lights steps back to the edge and manages to keep her balance. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Way below her traffic moves across the Queensboro Bridge as she stands on one of the towers of the steel structure. The Green Goblin approaches and glides over the ducking MJ who watches him move towards a cable car filled with children and adults. The Green Goblin shoots a missile destroying the cablecar station and motor cars on the bridge collide. From a nearby rooftop SpiderMan observes the chaos as a massive metal wheel flies into the air. a cable whips free and the Roosevelt Island cable car begins to fall. The Green Goblin grabs the cable stabilizing the car as SpiderMan standing on a thick strand of web tied between two flagpoles launches himself into the air by walking down a building. He shoots webs maneuvering along the steel girders until he lands on a metal strut. Above him the Goblin holds MJ in one hand and the cablecar cable in the other lifting MJ as her slippers slip off. The cable car swings in the wind suspended solely by the Goblin's grip. The Goblin releases both MJ and the cable simultaneously. In the reflections of the large spider eyes on SpiderMan's mask one shows MJ falling and the other the cable car full of screaming frightened children. SpiderMan runs along the girder leaps to catch MJ and then swings beneath the span to ensnare the cable car in his web."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "As the door opens Harry enters clutching a bouquet of flowers and MJ quickly pulls her hand away from Peter's. Harry stares at them with a disappointed look on his face and the three of them appear awkward. That evening Harry strides into the dimly lit arched Osborne living room. Hearing voices he moves towards the stairs and climbs the grand staircase. His father Norman appears on the landing which encircles the room. Harry spreads his arms wide as Norman leans on the woodcarved rail looking down and shaking his head at his son who continues up the stairs sullenly. Harry looks at his father quizzically and Norman steps down to him then wraps him in his arms. Harry closes his eyes as tears well up in them. Peter rests his head on his aunt's bed looking coy and thoughtful before turning away in alarm as he stands at a pay phone in the hospital. His eyes widen upon seeing MJ unconscious. a stiff breeze ruffling her hair and nightclothes which rouses her. MJ gets to her feet on a metal platform high above the city lights steps back to the edge and manages to keep her balance. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Way below her traffic moves across the Queensboro Bridge as she stands on one of the towers of the steel structure. The Green Goblin approaches and glides over the ducking MJ who watches him move towards a cable car filled with children and adults. The Green Goblin shoots a missile destroying the cablecar station and motor cars on the bridge collide. From a nearby rooftop SpiderMan observes the chaos as a massive metal wheel flies into the air. a cable whips free and the Roosevelt Island cable car begins to fall. The Green Goblin grabs the cable stabilizing the car as SpiderMan standing on a thick strand of web tied between two flagpoles launches himself into the air by walking down a building. He shoots webs maneuvering along the steel girders until he lands on a metal strut. Above him the Goblin holds MJ in one hand and the cablecar cable in the other lifting MJ as her slippers slip off. The cable car swings in the wind suspended solely by the Goblin's grip. The Goblin releases both MJ and the cable simultaneously. In the reflections of the large spider eyes on SpiderMan's mask one shows MJ falling and the other the cable car full of screaming frightened children. SpiderMan runs along the girder leaps to catch MJ and then swings beneath the span to ensnare the cable car in his web."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "As the door opens Harry enters clutching a bouquet of flowers and MJ quickly pulls her hand away from Peter's. Harry stares at them with a disappointed look on his face and the three of them appear awkward. That evening Harry strides into the dimly lit arched Osborne living room. Hearing voices he moves towards the stairs and climbs the grand staircase. His father Norman appears on the landing which encircles the room. Harry spreads his arms wide as Norman leans on the woodcarved rail looking down and shaking his head at his son who continues up the stairs sullenly. He shoots webs maneuvering along the steel girders until he lands on a metal strut. Above him the Goblin holds MJ in one hand and the cablecar cable in the other lifting MJ as her slippers slip off. The cable car swings in the wind suspended solely by the Goblin's grip. The Goblin releases both MJ and the cable simultaneously. In the reflections of the large spider eyes on SpiderMan's mask one shows MJ falling and the other the cable car full of screaming frightened children. SpiderMan runs along the girder leaps to catch MJ and then swings beneath the span to ensnare the cable car in his web."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "As the door opens Harry enters clutching a bouquet of flowers and MJ quickly pulls her hand away from Peter's. Harry stares at them with a disappointed look on his face and the three of them appear awkward. That evening Harry strides into the dimly lit arched Osborne living room. In the reflections of the large spider eyes on SpiderMan's mask one shows MJ falling and the other the cable car full of screaming frightened children. SpiderMan runs along the girder leaps to catch MJ and then swings beneath the span to ensnare the cable car in his web."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "As the portal swings open, Zoe wanders in, juggling a cluster of balloons, and Casey swiftly pushes her chair away from Alex's. Zoe gawks at them with a puzzled expression on her face, and the trio exudes discomfort. That night, Zoe strides into the dimly lit, vaulted Everton lounge. Hearing laughter, she drifts towards the hallway and scales the spiral staircase. Her mother, Lisa, emerges on the landing that encircles the space. Zoe flings her arms wide as Lisa leans on the iron railing, peering down and clucking her tongue at her daughter, who ascends the stairs morosely. Zoe peers at her mother inquisitively, and Lisa steps down to her, then enfolds her in a hug. Zoe shuts her eyes as sobs well up in them. Alex leans his cheek on his uncle's couch, appearing sly and reflective before jolting away in concern as he stands at a vending machine in the parking lot. His eyes widen upon seeing Casey asleep, a gentle gust teasing her scarf and jacket, which awakens her. Casey rises on a wooden balcony high above the city skyline, steps back to the edge, and steadies herself. Far below her, pedestrians saunter across the Brooklyn Bridge as she perches on one of the arches of the concrete structure. The Cyan Phantom approaches and floats over the crouching Casey, who observes him veer towards a tram filled with tourists and families. The Cyan Phantom fires a laser, obliterating the tram depot, and bicycles on the bridge tumble. From a distant watchtower, Night Owl witnesses the pandemonium as a giant wooden beam catapults into the sky, a rope snaps loose, and the Liberty Island tram begins to lurch. The Cyan Phantom clutches the rope, steadying the tram, as Night Owl, perched on a hefty coil of wire strung between two chimneys, propels himself into the void by jogging down a skyscraper. He hurls cables, maneuvering along the concrete supports until he plants himself on a wooden beam. Above him, the Phantom seizes Casey in one hand and the tram rope in the other, hoisting Casey as her sandals tip over. The tram sways in the gust, hanging solely by the Phantom's grasp. The Phantom lets go of both Casey and the tram abruptly. In the reflections of the oversized owl eyes on Night Owl's cowl, one reflects Casey plummeting and the other the tram packed with shrieking, terrified tourists. Night Owl dashes along the beam, vaults to snatch Casey, and then swings beneath the bridge to entangle the tram in his cord."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry enters with flowers, causing an awkward moment with MJ and Peter. Later, Harry encounters his father, Norman, who expresses disappointment before embracing him. Meanwhile, Peter is at a hospital when MJ, unconscious on a high platform above the city, is targeted by the Green Goblin. The Goblin attacks a cable car, causing destruction as Spider-Man swings into action. He observes the chaos from a rooftop and maneuvers through the steel structure to save MJ and the falling cable car. Spider-Man catches both MJ and the cable car, securing them with his web, amidst the peril orchestrated by the Goblin."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "SpiderMan runs along the girder leaps to catch MJ and then swings beneath the span to ensnare the cable car in his web In the reflections of the large spider eyes on SpiderMan's mask one shows MJ falling and the other the cable car full of screaming frightened children  The Goblin releases both MJ and the cable simultaneously  The cable car swings in the wind suspended solely by the Goblin's grip  Above him the Goblin holds MJ in one hand and the cablecar cable in the other lifting MJ as her slippers slip off  He shoots webs maneuvering along the steel girders until he lands on a metal strut  The Green Goblin grabs the cable stabilizing the car as SpiderMan standing on a thick strand of web tied between two flagpoles launches himself into the air by walking down a building  a cable whips free and the Roosevelt Island cable car begins to fall  From a nearby rooftop SpiderMan observes the chaos as a massive metal wheel flies into the air  The Green Goblin shoots a missile destroying the cablecar station and motor cars on the bridge collide  The Green Goblin approaches and glides over the ducking MJ who watches him move towards a cable car filled with children and adults  Way below her traffic moves across the Queensboro Bridge as she stands on one of the towers of the steel structure  MJ gets to her feet on a metal platform high above the city lights steps back to the edge and manages to keep her balance  a stiff breeze ruffling her hair and nightclothes which rouses her  His eyes widen upon seeing MJ unconscious  Peter rests his head on his aunt's bed looking coy and thoughtful before turning away in alarm as he stands at a pay phone in the hospital  Harry closes his eyes as tears well up in them  Harry looks at his father quizzically and Norman steps down to him then wraps him in his arms  Harry spreads his arms wide as Norman leans on the woodcarved rail looking down and shaking his head at his son who continues up the stairs sullenly  His father Norman appears on the landing which encircles the room  Hearing voices he moves towards the stairs and climbs the grand staircase  That evening Harry strides into the dimly lit arched Osborne living room  Harry stares at them with a disappointed look on his face and the three of them appear awkward  As the door opens Harry enters clutching a bouquet of flowers and MJ quickly pulls her hand away from Peter's "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Harry stares at them with a disappointed look on his face and the three of them appear awkward As the door opens Harry enters clutching a bouquet of flowers and MJ quickly pulls her hand away from Peter's Hearing voices he moves towards the stairs and climbs the grand staircase That evening Harry strides into the dimly lit arched Osborne living room Harry spreads his arms wide as Norman leans on the woodcarved rail looking down and shaking his head at his son who continues up the stairs sullenly His father Norman appears on the landing which encircles the room Harry closes his eyes as tears well up in them Harry looks at his father quizzically and Norman steps down to him then wraps him in his arms His eyes widen upon seeing MJ unconscious Peter rests his head on his aunt's bed looking coy and thoughtful before turning away in alarm as he stands at a pay phone in the hospital MJ gets to her feet on a metal platform high above the city lights steps back to the edge and manages to keep her balance a stiff breeze ruffling her hair and nightclothes which rouses her The Green Goblin approaches and glides over the ducking MJ who watches him move towards a cable car filled with children and adults Way below her traffic moves across the Queensboro Bridge as she stands on one of the towers of the steel structure From a nearby rooftop SpiderMan observes the chaos as a massive metal wheel flies into the air The Green Goblin shoots a missile destroying the cablecar station and motor cars on the bridge collide The Green Goblin grabs the cable stabilizing the car as SpiderMan standing on a thick strand of web tied between two flagpoles launches himself into the air by walking down a building a cable whips free and the Roosevelt Island cable car begins to fall Above him the Goblin holds MJ in one hand and the cablecar cable in the other lifting MJ as her slippers slip off He shoots webs maneuvering along the steel girders until he lands on a metal strut The Goblin releases both MJ and the cable simultaneously The cable car swings in the wind suspended solely by the Goblin's grip SpiderMan runs along the girder leaps to catch MJ and then swings beneath the span to ensnare the cable car in his web In the reflections of the large spider eyes on SpiderMan's mask one shows MJ falling and the other the cable car full of screaming frightened children"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Way below her traffic moves across the Queensboro Bridge as she stands on one of the towers of the steel structure  The Green Goblin approaches and glides over the ducking MJ who watches him move towards a cable car filled with children and adults  The Green Goblin shoots a missile destroying the cablecar station and motor cars on the bridge collide  From a nearby rooftop SpiderMan observes the chaos as a massive metal wheel flies into the air  a cable whips free and the Roosevelt Island cable car begins to fall  The Green Goblin grabs the cable stabilizing the car as SpiderMan standing on a thick strand of web tied between two flagpoles launches himself into the air by walking down a building  He shoots webs maneuvering along the steel girders until he lands on a metal strut  Above him the Goblin holds MJ in one hand and the cablecar cable in the other lifting MJ as her slippers slip off  The cable car swings in the wind suspended solely by the Goblin's grip  The Goblin releases both MJ and the cable simultaneously  In the reflections of the large spider eyes on SpiderMan's mask one shows MJ falling and the other the cable car full of screaming frightened children  SpiderMan runs along the girder leaps to catch MJ and then swings beneath the span to ensnare the cable car in his web As the door opens Harry enters clutching a bouquet of flowers and MJ quickly pulls her hand away from Peter's  Harry stares at them with a disappointed look on his face and the three of them appear awkward  That evening Harry strides into the dimly lit arched Osborne living room  Hearing voices he moves towards the stairs and climbs the grand staircase  His father Norman appears on the landing which encircles the room  Harry spreads his arms wide as Norman leans on the woodcarved rail looking down and shaking his head at his son who continues up the stairs sullenly  Harry looks at his father quizzically and Norman steps down to him then wraps him in his arms  Harry closes his eyes as tears well up in them  Peter rests his head on his aunt's bed looking coy and thoughtful before turning away in alarm as he stands at a pay phone in the hospital  His eyes widen upon seeing MJ unconscious  a stiff breeze ruffling her hair and nightclothes which rouses her  MJ gets to her feet on a metal platform high above the city lights steps back to the edge and manages to keep her balance "
        }
      ]
    }
  ]
}