{
  "ground_truth": "Spider-Man steps back as two more webs pull a wall down on top of him. From beneath the pile of rubble, a hand appears, followed by the Goblin's head and torso, as he hauls himself unsteadily to his feet. Then Spider-Man swoops down, dragging the villain through a trellis and smashing him against another wall. Now it's Spider-Man's turn to rain blades on his opponent, causing the Green Goblin to fall to the ground. The Green Goblin removes the hard mask with a jutting jaw, revealing Norman Osborn, and Peter, Spider-Man, stares in disbelief. The Goblin sneers as he has pressed the remote on his glove, triggering the glider with blades drawn to target Spider-Man. Spider-Man does a backward flip over it, and it heads for Norman, piercing through him and pinning him to the wall. Norman leans on the glider, then looks up at Peter, whose face is clearly visible through the torn mask, before slumping over the glider with his eyes staring wide. On the ground beside him lies the mask of the Green Goblin. Peter lowers his head and later, in the dark, lays Norman, no longer in costume, down on the sofa in the Osborn mansion study. As he does so, Harry, dressed in black, walks into the room and sees his father and the shadowy figure of Spider-Man. Harry scrabbles in the desk and finds a gun, but when he looks up, Spider-Man has gone, and the net curtains billow in the wind with the window open. On the day of Norman's funeral, after the interment, Harry is standing alone when Peter, hands in pockets, walks slowly over to his friend. Harry turns and nods acknowledgement, and Peter stares, transfixed at Harry. Peter steps forward and puts one arm, then the other around Harry, as the two friends hug. They part, and Harry turns away solemnly, with Peter watching him trudge down the path through the gravestones towards the waiting Rolls-Royce on the road. The bare trees have cast their autumnal leaves as Peter turns to see MJ and Aunt May, standing in front of his uncle's gravestone. MJ comes to join him, and hugs him as they wrap around one another. MJ breaks away, and they stand facing each other as she strokes his cheek with her gloved hand, and he stares intently at her. Standing in the middle of the graveyard with tears in her windblown face, MJ pulls his head towards her and their lips meet in a long and passionate embrace. The lingering kiss stops, and they study each other's faces as tears well in MJ's eyes. When she closes her lids, the tears roll down her cheeks, and Peter sadly turns from her and slowly walks away. MJ stands by the gravestone, sobbing, then suddenly, as if struck by a memory, she moves her hand up to her lips.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Spider-Man retreats as two additional webs yank a barrier down atop him. From underneath the heap of debris, a palm emerges, followed by the Goblin's face and chest, as he pulls himself shakily to his feet. Then Spider-Man dives down, hauling the adversary through a lattice and crashing him against another barrier. Now it's Spider-Man's turn to shower blades on his foe, causing the Green Goblin to collapse to the ground. The Green Goblin takes off the rigid mask with a protruding chin, revealing Norman Osborn, and Peter, Spider-Man, gapes in incredulity. The Goblin smirks as he has activated the remote on his glove, initiating the glider with blades drawn to aim at Spider-Man. Spider-Man performs a backward somersault over it, and it heads for Norman, stabbing through him and pinning him to the barrier. Norman leans on the glider, then glances up at Peter, whose visage is clearly visible through the torn mask, before slumping over the glider with his eyes staring wide. On the earth beside him lies the mask of the Green Goblin. Peter lowers his head and later, in the dark, lays Norman, no longer in attire, down on the couch in the Osborn mansion study. As he does so, Harry, clad in black, enters the chamber and sees his father and the shadowy figure of Spider-Man. Harry rummages in the desk and discovers a firearm, but when he looks up, Spider-Man has vanished, and the net curtains flutter in the breeze with the window open. On the day of Norman's burial, after the interment, Harry is standing alone when Peter, hands in pockets, walks slowly over to his companion. Harry turns and nods acknowledgment, and Peter gazes, captivated at Harry. Peter steps forward and places one limb, then the other around Harry, as the two companions embrace. They separate, and Harry turns away gravely, with Peter watching him plod down the path through the gravestones towards the waiting Rolls-Royce on the lane. The bare trees have cast their autumnal leaves as Peter turns to see MJ and Aunt May, standing in front of his uncle's gravestone. MJ comes to join him, and embraces him as they wrap around one another. MJ breaks away, and they stand facing each other as she caresses his cheek with her gloved hand, and he gazes intently at her. Standing in the center of the cemetery with tears in her windblown face, MJ pulls his head towards her and their lips meet in a long and fervent embrace. The lingering kiss halts, and they study each other's faces as tears well in MJ's eyes. When she closes her lids, the tears roll down her cheeks, and Peter sadly turns from her and slowly walks away. MJ stands by the gravestone, weeping, then suddenly, as if struck by a memory, she moves her hand up to her lips."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Spider-Man is stepped back by two more webs as a wall is pulled down on top of him. A hand is made to appear from beneath the pile of rubble, followed by the Goblin's head and torso, as he hauls himself unsteadily to his feet. Then the villain is swooped down upon by Spider-Man, who drags him through a trellis and smashes him against another wall. Now blades are rained on his opponent by Spider-Man, causing the Green Goblin to fall to the ground. The hard mask with a jutting jaw is removed by the Green Goblin, revealing Norman Osborn, and disbelief is stared in by Peter, Spider-Man. The remote on his glove is pressed by the Goblin as he sneers, triggering the glider with blades drawn to target Spider-Man. A backward flip is done by Spider-Man over it, and Norman is pierced through by it and pinned to the wall. The glider is leaned on by Norman, then he looks up at Peter, whose face is clearly visible through the torn mask, before he slumps over the glider with his eyes staring wide. On the ground beside him, the mask of the Green Goblin lies. His head is lowered by Peter, and later, in the dark, Norman, no longer in costume, is laid down on the sofa in the Osborn mansion study. As this is done, Harry, dressed in black, walks into the room and sees his father and the shadowy figure of Spider-Man. The desk is scrabbled in by Harry, and a gun is found, but when he looks up, Spider-Man is gone, and the net curtains are billowing in the wind with the window open. On the day of Norman's funeral, after the interment, Harry is standing alone when his friend is slowly walked over to by Peter, hands in pockets. A nod of acknowledgement is turned and given by Harry, and Peter is stared at, transfixed by Harry. Forward steps Peter and puts one arm, then the other around Harry, as a hug is shared by the two friends. They part, and Harry turns away solemnly, watched by Peter as he trudges down the path through the gravestones towards the waiting Rolls-Royce on the road. The autumnal leaves have been cast by the bare trees as MJ and Aunt May are seen by Peter, standing in front of his uncle's gravestone. MJ is come to join by him, and he is hugged as they wrap around one another. Away is broken by MJ, and they stand facing each other as his cheek is stroked with her gloved hand, and he stares intently at her. Standing in the middle of the graveyard with tears in her windblown face, his head is pulled towards her by MJ and their lips are met in a long and passionate embrace. The lingering kiss is stopped, and they study each other's faces as tears are welled in MJ's eyes. When her lids are closed, her cheeks are rolled down by the tears, and Peter sadly turns from her and slowly walks away. By the gravestone, MJ stands, sobbing, then suddenly, as if struck by a memory, up to her lips, she moves her hand."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Spider-Man steps back as webs pull a wall down on him. From the rubble, the Goblin emerges, unsteadily rising. Spider-Man swoops down, dragging the villain through a trellis and smashing him against a wall. Spider-Man then attacks, causing the Green Goblin to fall. The Goblin removes his mask, revealing Norman Osborn, and Peter, Spider-Man, stares in disbelief. The Goblin triggers his glider to target Spider-Man, but Spider-Man flips over it, and it pierces Norman, pinning him to the wall. Norman leans on the glider, looks at Peter, then slumps over, eyes wide. The Green Goblin's mask lies beside him. Peter lowers his head and later lays Norman on the sofa in the Osborn mansion. Harry, dressed in black, enters, sees his father and Spider-Man, and grabs a gun, but Spider-Man is gone, leaving the curtains billowing. At Norman's funeral, Harry stands alone when Peter approaches. Harry nods, and Peter hugs him. They part, and Harry walks away solemnly. Peter sees MJ and Aunt May by his uncle's gravestone. MJ joins him, and they embrace. MJ strokes his cheek, and they share a passionate kiss. Tears well in MJ's eyes as Peter turns and walks away. MJ stands by the gravestone, sobbing, then touches her lips as if struck by a memory."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Spider-Man steps back as webs pull a wall down on him. From the rubble, the Goblin emerges, unsteady. Spider-Man swoops down, smashing the villain against a wall and raining blades on him, causing the Goblin to fall. The Goblin removes his mask, revealing Norman Osborn, shocking Peter. The Goblin triggers his glider to target Spider-Man, but Spider-Man flips over it, and it pierces Norman, pinning him to the wall. Norman leans on the glider, looks at Peter, then slumps over. The Green Goblin's mask lies beside him. Peter lowers his head and later lays Norman on the sofa in the Osborn mansion. Harry enters, sees his father and Spider-Man, grabs a gun, but Spider-Man vanishes, leaving the curtains billowing. At Norman's funeral, Peter approaches Harry, and they hug. Harry turns away, and Peter watches him walk to a Rolls-Royce. Peter sees MJ and Aunt May by his uncle's gravestone. MJ joins Peter, and they embrace. MJ strokes his cheek, and they kiss passionately. They part, and tears well in MJ's eyes. Peter turns and walks away. MJ stands by the gravestone, sobbing, then touches her lips as if recalling a memory."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Spider-Man cautiously steps back as two additional webs are launched, pulling a massive wall down on top of him with a thunderous crash. From beneath the heavy pile of rubble, a hand emerges, followed by the Goblin's head and torso, as he laboriously hauls himself unsteadily to his feet. At that moment, Spider-Man swoops down with agility, dragging the villain through a trellis and forcefully smashing him against another wall. Now, it is Spider-Man's turn to unleash a barrage of blades upon his opponent, causing the Green Goblin to collapse to the ground. The Green Goblin then removes the hard, menacing mask with its jutting jaw, revealing the face of Norman Osborn, and Peter, who is Spider-Man, stares in utter disbelief. The Goblin sneers as he presses the remote on his glove, activating the glider with its sharp blades drawn, targeting Spider-Man. With remarkable agility, Spider-Man performs a backward flip over it, and the glider heads straight for Norman, piercing through him and pinning him to the wall. Norman leans heavily on the glider, then looks up at Peter, whose face is clearly visible through the torn mask, before slumping over the glider with his eyes staring wide open. On the ground beside him lies the mask of the Green Goblin. Peter lowers his head in sorrow and later, in the darkened room, gently lays Norman, now no longer in costume, down on the sofa in the Osborn mansion study. As he does so, Harry, dressed in somber black attire, walks into the room and sees his father and the shadowy figure of Spider-Man. Harry frantically scrabbles in the desk and finds a gun, but when he looks up, Spider-Man has vanished, and the net curtains billow in the wind with the window left open. On the day of Norman's funeral, after the solemn interment, Harry is standing alone when Peter, with his hands in his pockets, walks slowly over to his friend. Harry turns and nods in acknowledgment, and Peter stares, transfixed by Harry. Peter steps forward and gently puts one arm, then the other, around Harry, as the two friends embrace in a heartfelt hug. They part, and Harry turns away solemnly, with Peter watching him trudge down the path through the gravestones towards the waiting Rolls-Royce parked on the road. The bare trees have cast their autumnal leaves as Peter turns to see MJ and Aunt May, standing in front of his uncle's gravestone. MJ comes to join him, and they embrace as they wrap around one another. MJ breaks away, and they stand facing each other as she tenderly strokes his cheek with her gloved hand, and he stares intently at her. Standing in the middle of the graveyard with tears on her windblown face, MJ pulls his head towards her, and their lips meet in a long and passionate embrace. The lingering kiss comes to a stop, and they study each other's faces as tears well up in MJ's eyes. When she closes her lids, the tears roll down her cheeks, and Peter, filled with sadness, turns away from her and slowly walks away. MJ stands by the gravestone, sobbing, then suddenly, as if struck by a poignant memory, she moves her hand up to her lips."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Spider-Man, with careful and deliberate caution, steps backward just in time as two more webs are launched at him, their force causing a massive wall to crash down on top of him with a deafening, thunderous sound. From beneath the heavy and overwhelming pile of rubble, a hand slowly emerges, followed by the Goblin's head and torso. He laboriously pulls himself up, struggling to gain his balance as he unsteadily rises to his feet. In that crucial moment, Spider-Man, exhibiting remarkable agility, swoops down swiftly, dragging the villain through a trellis and smashing him forcefully against another imposing wall. It is now Spider-Man's turn to unleash a relentless barrage of sharp blades upon his foe, which causes the Green Goblin to collapse heavily to the ground. The Green Goblin, with deliberate intent, removes the hard, menacing mask with its distinct jutting jaw, revealing the face of none other than Norman Osborn, and Peter, who is the man beneath the Spider-Man suit, stares in complete and utter disbelief. The Goblin sneers with a sinister grin as he presses the remote on his glove, activating the menacing glider with its sharp, lethal blades drawn and ready, targeting Spider-Man. With astounding agility and precision, Spider-Man executes a backward flip over it, and the glider charges straight toward Norman, piercing through him with deadly force and pinning him against the wall. Norman leans heavily on the glider, looks up at Peter, whose face is now clearly visible through his torn mask, and then slumps lifelessly over the glider with eyes wide open. On the ground beside him lies the iconic mask of the Green Goblin. Peter lowers his head in deep sorrow and, later, in the dimly lit room, gently lays Norman, now without his formidable costume, down on the sofa in the Osborn mansion's somber study. As he does this, Harry, dressed in somber black attire, walks into the shadowy room and sees both his father and the silhouette of Spider-Man. Harry frantically rummages through the desk, desperately searching for a gun, but when he looks up, Spider-Man has vanished, and the delicate net curtains billow softly in the wind, with the window left open. On the solemn day of Norman's funeral, after the mournful interment, Harry stands alone, deep in thought, when Peter, with his hands tucked in his pockets, slowly walks over to his grieving friend. Harry turns to face Peter and nods in acknowledgment, while Peter stands transfixed, gazing at Harry. Peter steps forward and gently wraps one arm, then the other, around Harry, as the two friends share a heartfelt and meaningful embrace. They part ways, and Harry turns away solemnly, with Peter watching as he trudges down the path through the gravestones toward the waiting, elegant Rolls-Royce parked on the road. The bare trees have cast their autumnal leaves on the ground as Peter turns to see MJ and Aunt May standing in front of his uncle's gravestone. MJ approaches to join him, and they embrace warmly and tightly as their arms wrap around each other. MJ breaks away, and they stand facing each other as she tenderly strokes Peter's cheek with her gloved hand, while he stares intently into her eyes. Standing in the middle of the graveyard, with tears glistening on her windblown face, MJ gently pulls Peter's head toward her, and their lips meet in a lingering and passionate embrace. The kiss lingers and eventually comes to an end, and they study each other's faces as tears begin to well up in MJ's eyes. When she closes her eyes, the tears roll gently down her cheeks, and Peter, his heart heavy with sadness, turns away from her and slowly walks into the distance. MJ stands by the gravestone, sobbing softly, then suddenly, as if struck by a poignant memory, she raises her hand thoughtfully to her lips."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Spider-Man takes a cautious step back as two additional webs shoot out, gripping the wall and yanking it down, causing it to collapse heavily on top of him. From beneath the chaotic pile of rubble, a hand emerges, followed by the Goblin's head and torso, as he struggles and strains to pull himself unsteadily to his feet. In a swift and agile motion, Spider-Man swoops down from above, seizing the villain and dragging him forcefully through a trellis, smashing him against another wall with a resounding crash. Now, seizing the opportunity, Spider-Man unleashes a barrage of blades upon his opponent, causing the Green Goblin to lose his balance and fall to the ground. The Green Goblin, with a deliberate motion, removes the hard mask with its jutting jaw, revealing the face of Norman Osborn beneath, and Peter, as Spider-Man, stares in disbelief at the unexpected revelation. The Goblin sneers with a sinister expression as he presses the remote on his glove, activating the glider with its blades drawn, setting it on a deadly course toward Spider-Man. With remarkable agility, Spider-Man executes a backward flip over the oncoming glider, which continues its trajectory toward Norman, piercing through him and pinning him to the wall. Norman leans heavily on the glider, then looks up at Peter, whose face is clearly visible through the torn mask, before slumping over the glider with his eyes wide open in a lifeless stare. On the ground beside him lies the mask of the Green Goblin, a silent testament to the battle that has just unfolded. Peter lowers his head in a moment of somber reflection and later, under the cover of darkness, gently lays Norman, now stripped of his costume, down on the sofa in the Osborn mansion study. As he does so, Harry, dressed in black, enters the room and is confronted with the sight of his father and the shadowy figure of Spider-Man. In a frantic search, Harry scrabbles through the desk and finds a gun, but when he looks up, Spider-Man has vanished, leaving only the billowing net curtains and the open window as evidence of his departure. On the day of Norman's funeral, after the interment, Harry stands alone in contemplation when Peter, with his hands in his pockets, walks slowly over to his friend. Harry turns and nods in acknowledgment, and Peter, transfixed, stares at Harry. Peter steps forward, extending one arm, then the other, around Harry, and the two friends embrace in a moment of shared grief. They part, and Harry turns away solemnly, with Peter watching him as he trudges down the path through the gravestones toward the waiting Rolls-Royce on the road. The bare trees have shed their autumnal leaves, creating a somber backdrop as Peter turns to see MJ and Aunt May standing in front of his uncle's gravestone. MJ approaches to join him, and they wrap around one another in a comforting hug. MJ breaks away, and they stand facing each other as she gently strokes his cheek with her gloved hand, and he gazes intently at her. Standing in the middle of the graveyard, with tears streaming down her windblown face, MJ pulls his head toward her, and their lips meet in a long and passionate embrace. The lingering kiss comes to a halt, and they study each other's faces as tears well up in MJ's eyes. When she closes her lids, the tears roll down her cheeks, and Peter, with a heavy heart, turns away from her and slowly walks away. MJ remains by the gravestone, sobbing, then suddenly, as if struck by a poignant memory, she moves her hand up to her lips, lost in thought."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Spider-Man narrowly escapes as a wall collapses on him, only to counterattack by smashing the Green Goblin through a trellis and into a wall. In the ensuing battle, Spider-Man's assault forces the Goblin to the ground, where he reveals himself as Norman Osborn. As Peter, shocked, watches, Norman activates his glider to attack Spider-Man, but Peter evades it, causing the glider to impale Norman instead. Norman, fatally wounded, acknowledges Peter before collapsing. Later, Peter lays Norman's body on a sofa in the Osborn mansion, where Harry discovers them. Harry reaches for a gun, but Spider-Man has already vanished, leaving the curtains fluttering in the open window. At Norman's funeral, Peter approaches Harry, and they share a solemn embrace before Harry departs. Peter then joins MJ and Aunt May at his uncle's grave. MJ and Peter share a heartfelt hug, which turns into a passionate kiss. As they part, MJ's tears flow, and Peter, filled with sorrow, walks away. MJ, left standing by the gravestone, touches her lips, lost in thought."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Spider-Man, the iconic superhero who first appeared in Marvel Comics in 1962, steps back as two more webs pull a wall down on top of him, a classic move from his storied battles throughout New York City. From beneath the pile of rubble, a hand appears, followed by the notorious villain Green Goblin's head and torso, as he hauls himself unsteadily to his feet. Then Spider-Man swoops down with the agility honed from years of crime-fighting, dragging the villain through a trellis, a common garden structure that cracks under the force, and smashing him against another wall. Now it's Spider-Man's turn to rain blades on his opponent, a tactic reminiscent of the Goblin's own weaponry, causing the Green Goblin to fall to the ground. The Green Goblin removes the hard mask with a jutting jaw, revealing Norman Osborn, a wealthy industrialist and father of Peter's best friend, and Peter, Spider-Man, stares in disbelief. The Goblin sneers as he has pressed the remote on his glove, triggering the glider with blades drawn, a piece of advanced technology designed by Oscorp, to target Spider-Man. Spider-Man does a backward flip over it, a move perfected through his acrobatic skill, and it heads for Norman, piercing through him and pinning him to the wall, a twist of fate that leaves Spider-Man shaken. Norman leans on the glider, then looks up at Peter, whose face is clearly visible through the torn mask, before slumping over the glider with his eyes staring wide. On the ground beside him lies the mask of the Green Goblin, a symbol of the dual life Norman led. Peter lowers his head and later, in the dark, lays Norman, no longer in costume, down on the sofa in the Osborn mansion study, a room filled with relics of the Osborn legacy. As he does so, Harry Osborn, dressed in black, walks into the room and sees his father and the shadowy figure of Spider-Man. Harry scrabbles in the desk, which contains a gun kept for emergencies, but when he looks up, Spider-Man has gone, and the net curtains billow in the wind with the window open, reminiscent of how Spider-Man vanishes without a trace. On the day of Norman's funeral, after the interment in a family plot marked by gravestones bearing the Osborn name, Harry is standing alone when Peter, hands in pockets, walks slowly over to his friend. Harry turns and nods acknowledgement, and Peter stares, transfixed at Harry. Peter steps forward and puts one arm, then the other around Harry, as the two friends hug, a rare moment of connection in the wake of tragedy. They part, and Harry turns away solemnly, with Peter watching him trudge down the path through the gravestones towards the waiting Rolls-Royce on the road, a luxury car befitting the Osborn family's wealth. The bare trees have cast their autumnal leaves as Peter turns to see MJ and Aunt May, standing in front of his uncle Ben's gravestone, a man whose legendary wisdom guides Peter even after his death. MJ comes to join him and hugs him as they wrap around one another, offering comfort in a time of grief. MJ breaks away, and they stand facing each other as she strokes his cheek with her gloved hand, a tender gesture amidst the somber setting, and he stares intently at her. Standing in the middle of the graveyard with tears in her windblown face, MJ, whose love for Peter is as enduring as it is troubled, pulls his head towards her and their lips meet in a long and passionate embrace. The lingering kiss stops, and they study each other's faces as tears well in MJ's eyes. When she closes her lids, the tears roll down her cheeks, and Peter sadly turns from her and slowly walks away, burdened by the weight of his dual identity. MJ stands by the gravestone, sobbing, then suddenly, as if struck by a memory of their shared past, she moves her hand up to her lips, contemplating the depth of their connection."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "SpiderMan steps back as two more webs pull a wall down on top of him  From beneath the pile of rubble a hand appears followed by the Goblin's head and torso as he hauls himself unsteadily to his feet  Then SpiderMan swoops down dragging the villain through a trellis and smashing him against another wall  Peter lowers his head and later in the dark lays Norman no longer in costume down on the sofa in the Osborn mansion study  As he does so Harry dressed in black walks into the room and sees his father and the shadowy figure of SpiderMan  Harry scrabbles in the desk and finds a gun but when he looks up SpiderMan has gone and the net curtains billow in the wind with the window open  On the day of Norman's funeral after the interment Harry is standing alone when Peter hands in pockets walks slowly over to his friend  Harry turns and nods acknowledgement and Peter stares transfixed at Harry  Peter steps forward and puts one arm then the other around Harry as the two friends hug  They part and Harry turns away solemnly with Peter watching him trudge down the path through the gravestones towards the waiting RollsRoyce on the road  The bare trees have cast their autumnal leaves as Peter turns to see MJ and Aunt May standing in front of his uncle's gravestone  MJ comes to join him and hugs him as they wrap around one another  MJ breaks away and they stand facing each other as she strokes his cheek with her gloved hand and he stares intently at her  Standing in the middle of the graveyard with tears in her windblown face MJ pulls his head towards her and their lips meet in a long and passionate embrace  The lingering kiss stops and they study each other's faces as tears well in MJ's eyes  When she closes her lids the tears roll down her cheeks and Peter sadly turns from her and slowly walks away  Now it's SpiderMan's turn to rain blades on his opponent causing the Green Goblin to fall to the ground  The Green Goblin removes the hard mask with a jutting jaw revealing Norman Osborn and Peter  SpiderMan stares in disbelief  The Goblin sneers as he has pressed the remote on his glove triggering the glider with blades drawn to target SpiderMan  SpiderMan does a backward flip over it and it heads for Norman piercing through him and pinning him to the wall  Norman leans on the glider then looks up at Peter whose face is clearly visible through the torn mask before slumping over the glider with his eyes staring wide  On the ground beside him lies the mask of the Green Goblin  Peter lowers his head and later in the dark lays Norman no longer in costume down on the sofa in the Osborn mansion study  As he does so Harry dressed in black walks into the room and sees his father and the shadowy figure of SpiderMan  Harry scrabbles in the desk and finds a gun but when he looks up SpiderMan has gone and the net curtains billow in the wind with the window open  On the day of Norman's funeral after the interment Harry is standing alone when Peter hands in pockets walks slowly over to his friend  Harry turns and nods acknowledgement and Peter stares transfixed at Harry  Peter steps forward and puts one arm then the other around Harry as the two friends hug  They part and Harry turns away solemnly with Peter watching him trudge down the path through the gravestones towards the waiting RollsRoyce on the road  The bare trees have cast their autumnal leaves as Peter turns to see MJ and Aunt May standing in front of his uncle's gravestone  MJ comes to join him and hugs him as they wrap around one another  MJ breaks away and they stand facing each other as she strokes his cheek with her gloved hand and he stares intently at her  Standing in the middle of the graveyard with tears in her windblown face MJ pulls his head towards her and their lips meet in a long and passionate embrace  The lingering kiss stops and they study each other's faces as tears well in MJ's eyes  When she closes her lids the tears roll down her cheeks and Peter sadly turns from her and slowly walks away  MJ stands by the gravestone sobbing then suddenly as if struck by a memory  she moves her hand up to her lips"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "SpiderMan steps back as two more webs pull a wall down on top of him. From beneath the pile of rubble a hand appears followed by the Goblin's head and torso as he hauls himself unsteadily to his feet. Then SpiderMan swoops down dragging the villain through a trellis and smashing him against another wall. Now it is SpiderMan's turn to rain blades on his opponent causing the Green Goblin to fall to the ground. The Green Goblin removes the hard mask with a jutting jaw revealing Norman Osborn and Peter. SpiderMan stares in disbelief. The Goblin sneers as he has pressed the remote on his glove triggering the glider with blades drawn to target SpiderMan. SpiderMan does a backward flip over it and it heads for Norman piercing through him and pinning him to the wall. Norman leans on the glider then looks up at Peter whose face is clearly visible through the torn mask before slumping over the glider with his eyes staring wide. On the ground beside him lies the mask of the Green Goblin. Peter lowers his head and later in the dark lays Norman no longer in costume down on the sofa in the Osborn mansion study. As he does so Harry dressed in black walks into the room and sees his father and the shadowy figure of SpiderMan. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Harry scrabbles in the desk and finds a gun but when he looks up SpiderMan has gone and the net curtains billow in the wind with the window open. On the day of Norman's funeral after the interment Harry is standing alone when Peter hands in pockets walks slowly over to his friend. Harry turns and nods acknowledgement and Peter stares transfixed at Harry. Peter steps forward and puts one arm then the other around Harry as the two friends hug. They part and Harry turns away solemnly with Peter watching him trudge down the path through the gravestones towards the waiting RollsRoyce on the road. The bare trees have cast their autumnal leaves as Peter turns to see MJ and Aunt May standing in front of his uncle's gravestone. MJ comes to join him and hugs him as they wrap around one another. MJ breaks away and they stand facing each other as she strokes his cheek with her gloved hand and he stares intently at her. Standing in the middle of the graveyard with tears in her windblown face MJ pulls his head towards her and their lips meet in a long and passionate embrace. The lingering kiss stops and they study each other's faces as tears well in MJ's eyes. When she closes her lids the tears roll down her cheeks and Peter sadly turns from her and slowly walks away. MJ stands by the gravestone sobbing then suddenly as if struck by a memory. she moves her hand up to her lips."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "SpiderMan steps back as two more webs pull a wall down on top of him. From beneath the pile of rubble a hand appears followed by the Goblin's head and torso as he hauls himself unsteadily to his feet. Then SpiderMan swoops down dragging the villain through a trellis and smashing him against another wall. Now it is SpiderMan's turn to rain blades on his opponent causing the Green Goblin to fall to the ground. The Green Goblin removes the hard mask with a jutting jaw revealing Norman Osborn and Peter. SpiderMan stares in disbelief. The Goblin sneers as he has pressed the remote on his glove triggering the glider with blades drawn to target SpiderMan. SpiderMan does a backward flip over it and it heads for Norman piercing through him and pinning him to the wall. Norman leans on the glider then looks up at Peter whose face is clearly visible through the torn mask before slumping over the glider with his eyes staring wide. On the ground beside him lies the mask of the Green Goblin. Peter lowers his head and later in the dark lays Norman no longer in costume down on the sofa in the Osborn mansion study. As he does so Harry dressed in black walks into the room and sees his father and the shadowy figure of SpiderMan. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Harry scrabbles in the desk and finds a gun but when he looks up SpiderMan has gone and the net curtains billow in the wind with the window open. On the day of Norman's funeral after the interment Harry is standing alone when Peter hands in pockets walks slowly over to his friend. Harry turns and nods acknowledgement and Peter stares transfixed at Harry. Peter steps forward and puts one arm then the other around Harry as the two friends hug. They part and Harry turns away solemnly with Peter watching him trudge down the path through the gravestones towards the waiting RollsRoyce on the road. The bare trees have cast their autumnal leaves as Peter turns to see MJ and Aunt May standing in front of his uncle's gravestone. MJ comes to join him and hugs him as they wrap around one another. MJ breaks away and they stand facing each other as she strokes his cheek with her gloved hand and he stares intently at her. Standing in the middle of the graveyard with tears in her windblown face MJ pulls his head towards her and their lips meet in a long and passionate embrace. The lingering kiss stops and they study each other's faces as tears well in MJ's eyes. When she closes her lids the tears roll down her cheeks and Peter sadly turns from her and slowly walks away. MJ stands by the gravestone sobbing then suddenly as if struck by a memory. she moves her hand up to her lips."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "SpiderMan steps back as two more webs pull a wall down on top of him. From beneath the pile of rubble a hand appears followed by the Goblin's head and torso as he hauls himself unsteadily to his feet. Then SpiderMan swoops down dragging the villain through a trellis and smashing him against another wall. Now it is SpiderMan's turn to rain blades on his opponent causing the Green Goblin to fall to the ground. The Green Goblin removes the hard mask with a jutting jaw revealing Norman Osborn and Peter. SpiderMan stares in disbelief. MJ comes to join him and hugs him as they wrap around one another. MJ breaks away and they stand facing each other as she strokes his cheek with her gloved hand and he stares intently at her. Standing in the middle of the graveyard with tears in her windblown face MJ pulls his head towards her and their lips meet in a long and passionate embrace. The lingering kiss stops and they study each other's faces as tears well in MJ's eyes. When she closes her lids the tears roll down her cheeks and Peter sadly turns from her and slowly walks away. MJ stands by the gravestone sobbing then suddenly as if struck by a memory. she moves her hand up to her lips."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "SpiderMan steps back as two more webs pull a wall down on top of him. From beneath the pile of rubble a hand appears followed by the Goblin's head and torso as he hauls himself unsteadily to his feet. When she closes her lids the tears roll down her cheeks and Peter sadly turns from her and slowly walks away. MJ stands by the gravestone sobbing then suddenly as if struck by a memory. she moves her hand up to her lips."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The Hulk steps back as two more webs pull a wall down on top of him. From beneath the pile of rubble, a hand appears, followed by the Joker's head and torso, as he hauls himself unsteadily to his feet. Then the Hulk swoops down, dragging the villain through a trellis and smashing him against another wall. Now it's the Hulk's turn to rain blades on his opponent, causing the Red Skull to fall to the ground. The Red Skull removes the hard mask with a jutting jaw, revealing Lex Luthor, and Clark, the Hulk, stares in disbelief. The Red Skull sneers as he has pressed the remote on his glove, triggering the glider with blades drawn to target the Hulk. The Hulk does a backward flip over it, and it heads for Lex, piercing through him and pinning him to the wall. Lex leans on the glider, then looks up at Clark, whose face is clearly visible through the torn mask, before slumping over the glider with his eyes staring wide. On the ground beside him lies the mask of the Red Skull. Clark lowers his head and later, in the dark, lays Lex, no longer in costume, down on the sofa in the Luthor mansion study. As he does so, Bruce, dressed in black, walks into the room and sees his father and the shadowy figure of the Hulk. Bruce scrabbles in the desk and finds a gun, but when he looks up, the Hulk has gone, and the net curtains billow in the wind with the window open. On the day of Lex's funeral, after the interment, Bruce is standing alone when Clark, hands in pockets, walks slowly over to his friend. Bruce turns and nods acknowledgement, and Clark stares, transfixed at Bruce. Clark steps forward and puts one arm, then the other around Bruce, as the two friends hug. They part, and Bruce turns away solemnly, with Clark watching him trudge down the path through the gravestones towards the waiting Rolls-Royce on the road. The bare trees have cast their autumnal leaves as Clark turns to see Diana and Aunt June, standing in front of his uncle's gravestone. Diana comes to join him, and hugs him as they wrap around one another. Diana breaks away, and they stand facing each other as she strokes his cheek with her gloved hand, and he stares intently at her. Standing in the middle of the graveyard with tears in her windblown face, Diana pulls his head towards her and their lips meet in a long and passionate embrace. The lingering kiss stops, and they study each other's faces as tears well in Diana's eyes. When she closes her lids, the tears roll down her cheeks, and Clark sadly turns from her and slowly walks away. Diana stands by the gravestone, sobbing, then suddenly, as if struck by a memory, she moves her hand up to her lips."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Spider-Man steps back as two more ropes pull a tree down on top of him. From beneath the pile of foliage, a hand appears, followed by the Goblin's shoulder and knees, as he hauls himself unsteadily to his feet. Then Spider-Man swoops down, dragging the villain through a fence and smashing him against another tree. Now it's Spider-Man's turn to rain feathers on his opponent, causing the Green Goblin to fall to the ground. The Green Goblin removes the soft hat with a wide brim, revealing Norman Osborn, and Peter, Spider-Man, stares in disbelief. The Goblin sneers as he has pressed the remote on his boot, triggering the scooter with feathers drawn to target Spider-Man. Spider-Man does a backward flip over it, and it heads for Norman, piercing through him and pinning him to the tree. Norman leans on the scooter, then looks up at Peter, whose face is clearly visible through the torn scarf, before slumping over the scooter with his eyes staring wide. On the ground beside him lies the hat of the Green Goblin. Peter lowers his head and later, in the dark, lays Norman, no longer in disguise, down on the hammock in the Osborn mansion library. As he does so, Harry, dressed in white, walks into the room and sees his father and the shadowy figure of Spider-Man. Harry scrabbles in the bookshelf and finds a knife, but when he looks up, Spider-Man has gone, and the sheer drapes billow in the wind with the door open. On the day of Norman's funeral, after the ceremony, Harry is standing alone when Peter, hands in pockets, walks slowly over to his friend. Harry turns and nods acknowledgement, and Peter stares, transfixed at Harry. Peter steps forward and puts one arm, then the other around Harry, as the two friends hug. They part, and Harry turns away solemnly, with Peter watching him trudge down the path through the flowers towards the waiting bicycle on the road. The bare branches have cast their autumnal flowers as Peter turns to see MJ and Aunt May, standing in front of his uncle's statue. MJ comes to join him, and hugs him as they wrap around one another. MJ breaks away, and they stand facing each other as she strokes his cheek with her gloved hand, and he stares intently at her. Standing in the middle of the garden with tears in her windblown face, MJ pulls his head towards her and their lips meet in a long and passionate embrace. The lingering kiss stops, and they study each other's faces as tears well in MJ's eyes. When she closes her lids, the tears roll down her cheeks, and Peter sadly turns from her and slowly walks away. MJ stands by the statue, sobbing, then suddenly, as if struck by a memory, she moves her hand up to her lips."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Spider-Man retreats as two more webs yank a wall sideways beside him. From beneath the pile of rubble, a hand emerges, followed by the Goblin's head and torso, as he staggers awkwardly to his feet. Then Spider-Man glides down, pushing the villain through a trellis and tossing him against another wall. Now it's Spider-Man's turn to hurl pebbles at his opponent, prompting the Green Goblin to sink to the ground. The Green Goblin adjusts the hard mask with a jutting jaw, revealing Norman Osborn, and Peter, Spider-Man, gapes in disbelief. The Goblin smirks as he has clicked the remote on his glove, activating the glider with blades retracted to circle Spider-Man. Spider-Man executes a sideways roll over it, and it veers toward Norman, slicing into him and pinning him to the wall. Norman leans against the glider, then peers up at Peter, whose face is partially visible through the torn mask, before collapsing onto the glider with his eyes looking vacant. On the ground beside him rests the mask of the Green Goblin. Peter lowers his gaze and later, in the evening, sets Norman, no longer in costume, onto the sofa in the Osborn mansion study. As he does so, Harry, clad in black, walks into the room and sees his father and the silhouette of Spider-Man. Harry rummages in the desk and discovers a gun, but when he glances up, Spider-Man has vanished, and the net curtains flutter in the breeze with the window open. On the day of Norman's funeral, after the burial, Harry is standing alone when Peter, hands in pockets, strolls slowly over to his friend. Harry turns and nods acknowledgment, and Peter gazes, spellbound at Harry. Peter moves forward and places one arm, then the other around Harry, as the two friends embrace. They part, and Harry turns away gravely, with Peter watching him saunter down the path through the gravestones towards the waiting Rolls-Royce on the road. The bare trees have scattered their autumnal leaves as Peter turns to see MJ and Aunt May, standing in front of his uncle's gravestone. MJ comes to join him, and embraces him as they entwine around one another. MJ pulls away, and they stand facing each other as she brushes his cheek with her gloved hand, and he gazes intensely at her. Standing in the middle of the graveyard with tears on her windblown face, MJ draws his head towards her and their lips touch in a brief and gentle embrace. The fleeting kiss ends, and they examine each other's faces as tears swell in MJ's eyes. When she closes her lids, the tears trail down her cheeks, and Peter sorrowfully turns from her and slowly ambles away. MJ stands by the gravestone, weeping, then suddenly, as if stung by a memory, she raises her hand to her lips."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The mailbox steps back as two more ropes pull a fence down on top of it. From beneath the pile of cushions, an umbrella appears, followed by the stapler's handle and shaft, as it hauls itself unsteadily to its wheels. Then the mailbox swoops down, dragging the professor through a hedge and smashing it against another fence. Now it's the mailbox's turn to rain towels on its opponent, causing the stapler to fall to the carpet. The stapler removes the soft hat with a jutting rim, revealing Amanda Waller, and Doug, the mailbox, stares in disbelief. The stapler chuckles as it has pressed the device on its shoe, triggering the skateboard with pens drawn to target the mailbox. The mailbox does a backward flip over it, and it heads for Amanda, piercing through her and pinning her to the fence. Amanda leans on the skateboard, then looks up at Doug, whose face is clearly visible through the torn hat, before slumping over the skateboard with her eyes staring wide. On the carpet beside her lies the hat of the stapler. Doug lowers his head and later, in the dim light, lays Amanda, no longer in outfit, down on the recliner in the Waller villa nook. As it does so, Jake, dressed in yellow, walks into the space and sees his mother and the shadowy figure of the mailbox. Jake scrabbles in the drawer and finds a bottle, but when he looks up, the mailbox has gone, and the drapes billow in the breeze with the door open. On the day of Amanda's party, after the toast, Jake is standing solo when Doug, hands in sleeves, walks leisurely over to his teacher. Jake turns and nods acknowledgement, and Doug stares, transfixed at Jake. Doug steps forward and puts one branch, then the other around Jake, as the two colleagues hug. They part, and Jake turns away solemnly, with Doug watching him trudge down the alley through the gravestones towards the waiting bicycle on the path. The bare bushes have cast their autumnal petals as Doug turns to see Susan and Grandma Jenny, standing in front of his brother's gravestone. Susan comes to join him, and hugs him as they wrap around one another. Susan breaks away, and they stand facing each other as she strokes his elbow with her gloved hand, and he stares intently at her. Standing in the middle of the graveyard with tears in her windblown face, Susan pulls his elbow towards her and their elbows meet in a long and passionate embrace. The lingering hug stops, and they study each other's faces as tears well in Susan's eyes. When she closes her lids, the tears roll down her cheeks, and Doug sadly turns from her and slowly walks away. Susan stands by the gravestone, sobbing, then suddenly, as if struck by a memory, she moves her hand up to her elbow."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The rhino shuffles back as two more vines yank a roof down on top of him. From beneath the heap of debris, a foot emerges, followed by the Penguin's hat and legs, as he pushes himself awkwardly to his knees. Then the rhino glides down, dragging the rogue through a hedge and slamming him against a different roof. Now it's the rhino's turn to hurl snowballs at his rival, causing the Penguin to tumble to the ground. The Penguin peels off the floppy cap with a protruding beak, revealing Oswald Cobblepot, and Leo, the rhino, gapes in shock. The Penguin chuckles as he has tapped the switch on his shoe, activating the sled with icicles poised to aim at the rhino. The rhino performs a forward somersault over it, and it veers toward Oswald, puncturing through him and pinning him to the roof. Oswald leans on the sled, then glances up at Leo, whose face is clearly visible through the torn mask, before collapsing over the sled with his eyes staring wide. On the ground beside him lies the cap of the Penguin. Leo bows his head and later, at dawn, places Oswald, no longer in disguise, down on the hammock in the Cobblepot mansion parlor. As he does so, Oliver, dressed in blue, enters the room and sees his parent and the shadowy figure of the rhino. Oliver scrambles in the closet and finds a baton, but when he looks up, the rhino has vanished, and the lace curtains flutter in the breeze with the door ajar. On the morning of Oswald's service, after the ceremony, Oliver is standing alone when Leo, hands clasped, walks slowly over to his companion. Oliver turns and gestures acknowledgement, and Leo gazes, fascinated at Oliver. Leo steps nearer and puts one arm, then the other around Oliver, as the two companions hug. They separate, and Oliver turns away gravely, with Leo observing him plod down the path through the headstones towards the waiting helicopter on the street. The bare branches have cast their autumnal leaves as Leo turns to see Sally and Aunt June, standing in front of his aunt's headstone. Sally approaches him, and embraces him as they wrap around one another. Sally breaks away, and they stand facing each other as she brushes his chin with her gloved fingers, and he gazes intently at her. Standing in the midst of the cemetery with tears in her windswept face, Sally pulls his head towards her and their lips touch in a long and tender embrace. The lingering kiss ends, and they examine each other's faces as tears swell in Sally's eyes. When she closes her lids, the tears stream down her cheeks, and Leo sorrowfully turns from her and slowly strolls away. Sally stands by the headstone, weeping, then suddenly, as if struck by a memory, she raises her hand to her lips."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Spider-Man retreats as two more ropes yank a roof onto him. From beneath the heap of bricks, a foot emerges, followed by the Goblin's nose and legs, as he drags himself awkwardly to his knees. Then Spider-Man glides over, pulling the villain through a fence and crashing him into another building. Now it's Spider-Man's turn to toss feathers at his adversary, causing the Green Goblin to topple to the floor. The Green Goblin pulls off the soft mask with a protruding chin, revealing Norman Osborn, and Peter, Spider-Man, gapes in shock. The Goblin grins as he has tapped the button on his boot, activating the bicycle with feathers extended to aim at Spider-Man. Spider-Man performs a sideways flip over it, and it heads for Norman, slicing through him and pinning him to the fence. Norman leans on the bicycle, then gazes up at Peter, whose face is clearly visible through the ripped mask, before collapsing over the bicycle with his eyes staring wide. On the floor beside him lies the cap of the Green Goblin. Peter lowers his head and later, in the dim light, lays Norman, no longer in disguise, down on the couch in the Osborn mansion library. As he does so, Harry, dressed in gray, strolls into the room and sees his father and the dim figure of Spider-Man. Harry rummages in the cabinet and finds a book, but when he glances up, Spider-Man has disappeared, and the lace curtains flutter in the breeze with the door open. On the morning of Norman's memorial, after the ceremony, Harry is standing alone when Peter, hands in sleeves, wanders slowly over to his friend. Harry turns and acknowledges with a nod, and Peter gazes, entranced at Harry. Peter steps closer and puts one leg, then the other around Harry, as the two friends embrace. They separate, and Harry turns away gravely, with Peter watching him shuffle down the walkway through the monuments towards the waiting carriage on the street. The barren bushes have scattered their autumnal petals as Peter turns to see MJ and Aunt May, standing in front of his uncle's monument. MJ comes to join him, and clutches him as they intertwine around one another. MJ pulls away, and they face each other as she pats his cheek with her mittened hand, and he gazes intently at her. Standing in the center of the cemetery with tears in her windswept face, MJ pulls his head towards her and their noses meet in a long and passionate embrace. The lingering embrace ends, and they examine each other's faces as tears well in MJ's eyes. When she closes her lids, the tears roll down her cheeks, and Peter sorrowfully turns from her and slowly saunters away. MJ stands by the monument, weeping, then suddenly, as if triggered by a memory, she moves her hand up to her nose."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The astronaut hops aside as two more ropes tug a tower onto him. From beneath the heap of debris, a foot emerges, followed by the Martian's helmet and legs, as he drags himself awkwardly to his knees. Then the astronaut glides up, swinging the creature through a lattice and crushing it against another pillar. Now it's the astronaut's chance to shower arrows on his rival, causing the Red Alien to collapse to the floor. The Red Alien takes off the soft helmet with a protruding snout, unveiling Marvin Mellow, and Alex, the astronaut, gawks in shock. The Martian grins as he has tapped the toggle on his wrist, activating the saucer with arrows extended to target the astronaut. The astronaut performs a forward cartwheel over it, and it zooms towards Marvin, slicing through him and securing him to the pillar. Marvin leans on the saucer, then glances up at Alex, whose face is clearly visible through the scrapped visor, before collapsing over the saucer with his mouth wide open. On the floor beside him lies the helmet of the Red Alien. Alex lowers his hat and later, in the moonlight, places Marvin, no longer in gear, down on the chair in the Mellow mansion office. As he does so, Barry, dressed in red, enters the place and notices his brother and the dim silhouette of the astronaut. Barry rummages in the drawer and discovers a radio, but when he looks up, the astronaut has disappeared, and the sheer curtains flutter in the breeze with the door open. On the morning of Marvin's memorial, after the ceremony, Barry is standing alone when Alex, hands in sleeves, strides slowly over to his sibling. Barry rotates and nods recognition, and Alex gapes, spellbound at Barry. Alex steps forward and places one leg, then the other around Barry, as the two comrades embrace. They separate, and Barry turns away gravely, with Alex observing him shuffle down the track through the headstones towards the waiting spaceship on the horizon. The stark branches have dropped their summer blossoms as Alex turns to see Lucy and Aunt June, standing in front of his cousin's monument. Lucy comes to accompany him, and embraces him as they fold around one another. Lucy pulls away, and they stand facing each other as she caresses his forehead with her mittened hand, and he gazes deeply at her. Standing in the heart of the cemetery with mist in her breezy hair, Lucy pulls his neck towards her and their noses touch in a brief and fierce embrace. The brief hug ceases, and they examine each other's features as mist forms in Lucy's eyes. When she shuts her gaze, the mist drips down her face, and Alex ruefully turns from her and gradually shuffles away. Lucy lingers by the monument, weeping, then abruptly, as if hit by a vision, she moves her palm up to her forehead."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Spider-Man narrowly escapes a collapsing wall but quickly regains control to fight the Green Goblin. After a fierce battle, Spider-Man discovers the Goblin is Norman Osborn. Norman attempts to use his glider against Spider-Man, but it accidentally strikes him instead, leading to his downfall. Peter, unmasked, watches as Norman dies, and later places him on a sofa in the Osborn mansion. Harry Osborn, Norman's son, finds the scene and reaches for a gun, but Spider-Man has vanished. At Norman's funeral, Peter and Harry share a solemn moment, embracing before parting ways. Peter then joins MJ and Aunt May, sharing an emotional and passionate kiss with MJ. As they part, MJ's tears signal a deeper connection, while Peter walks away, leaving MJ by the gravestone, lost in her memories."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "she moves her hand up to her lips MJ stands by the gravestone sobbing then suddenly as if struck by a memory  When she closes her lids the tears roll down her cheeks and Peter sadly turns from her and slowly walks away  The lingering kiss stops and they study each other's faces as tears well in MJ's eyes  Standing in the middle of the graveyard with tears in her windblown face MJ pulls his head towards her and their lips meet in a long and passionate embrace  MJ breaks away and they stand facing each other as she strokes his cheek with her gloved hand and he stares intently at her  MJ comes to join him and hugs him as they wrap around one another  The bare trees have cast their autumnal leaves as Peter turns to see MJ and Aunt May standing in front of his uncle's gravestone  They part and Harry turns away solemnly with Peter watching him trudge down the path through the gravestones towards the waiting RollsRoyce on the road  Peter steps forward and puts one arm then the other around Harry as the two friends hug  Harry turns and nods acknowledgement and Peter stares transfixed at Harry  On the day of Norman's funeral after the interment Harry is standing alone when Peter hands in pockets walks slowly over to his friend  Harry scrabbles in the desk and finds a gun but when he looks up SpiderMan has gone and the net curtains billow in the wind with the window open  As he does so Harry dressed in black walks into the room and sees his father and the shadowy figure of SpiderMan  Peter lowers his head and later in the dark lays Norman no longer in costume down on the sofa in the Osborn mansion study  On the ground beside him lies the mask of the Green Goblin  Norman leans on the glider then looks up at Peter whose face is clearly visible through the torn mask before slumping over the glider with his eyes staring wide  SpiderMan does a backward flip over it and it heads for Norman piercing through him and pinning him to the wall  The Goblin sneers as he has pressed the remote on his glove triggering the glider with blades drawn to target SpiderMan  SpiderMan stares in disbelief  The Green Goblin removes the hard mask with a jutting jaw revealing Norman Osborn and Peter  Now it's SpiderMan's turn to rain blades on his opponent causing the Green Goblin to fall to the ground  Then SpiderMan swoops down dragging the villain through a trellis and smashing him against another wall  From beneath the pile of rubble a hand appears followed by the Goblin's head and torso as he hauls himself unsteadily to his feet  SpiderMan steps back as two more webs pull a wall down on top of him "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Peter steps forward and puts one arm then the other around Harry as the two friends hug  The lingering kiss stops and they study each other's faces as tears well in MJ's eyes  MJ breaks away and they stand facing each other as she strokes his cheek with her gloved hand and he stares intently at her  They part and Harry turns away solemnly with Peter watching him trudge down the path through the gravestones towards the waiting RollsRoyce on the road  MJ comes to join him and hugs him as they wrap around one another  As he does so Harry dressed in black walks into the room and sees his father and the shadowy figure of SpiderMan  The bare trees have cast their autumnal leaves as Peter turns to see MJ and Aunt May standing in front of his uncle's gravestone  Harry turns and nods acknowledgement and Peter stares transfixed at Harry  SpiderMan does a backward flip over it and it heads for Norman piercing through him and pinning him to the wall  SpiderMan steps back as two more webs pull a wall down on top of him  Standing in the middle of the graveyard with tears in her windblown face MJ pulls his head towards her and their lips meet in a long and passionate embrace  On the ground beside him lies the mask of the Green Goblin  MJ stands by the gravestone sobbing then suddenly as if struck by a memory  SpiderMan stares in disbelief  From beneath the pile of rubble a hand appears followed by the Goblin's head and torso as he hauls himself unsteadily to his feet  Harry scrabbles in the desk and finds a gun but when he looks up SpiderMan has gone and the net curtains billow in the wind with the window open  Then SpiderMan swoops down dragging the villain through a trellis and smashing him against another wall  Now it's SpiderMan's turn to rain blades on his opponent causing the Green Goblin to fall to the ground  she moves her hand up to her lips The Goblin sneers as he has pressed the remote on his glove triggering the glider with blades drawn to target SpiderMan  The Green Goblin removes the hard mask with a jutting jaw revealing Norman Osborn and Peter  Norman leans on the glider then looks up at Peter whose face is clearly visible through the torn mask before slumping over the glider with his eyes staring wide  Peter lowers his head and later in the dark lays Norman no longer in costume down on the sofa in the Osborn mansion study  On the day of Norman's funeral after the interment Harry is standing alone when Peter hands in pockets walks slowly over to his friend  When she closes her lids the tears roll down her cheeks and Peter sadly turns from her and slowly walks away "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "On the day of Norman's funeral after the interment Harry is standing alone when Peter hands in pockets walks slowly over to his friend  Harry turns and nods acknowledgement and Peter stares transfixed at Harry  Peter steps forward and puts one arm then the other around Harry as the two friends hug  They part and Harry turns away solemnly with Peter watching him trudge down the path through the gravestones towards the waiting RollsRoyce on the road  The bare trees have cast their autumnal leaves as Peter turns to see MJ and Aunt May standing in front of his uncle's gravestone  MJ comes to join him and hugs him as they wrap around one another  MJ breaks away and they stand facing each other as she strokes his cheek with her gloved hand and he stares intently at her  Standing in the middle of the graveyard with tears in her windblown face MJ pulls his head towards her and their lips meet in a long and passionate embrace  The lingering kiss stops and they study each other's faces as tears well in MJ's eyes  When she closes her lids the tears roll down her cheeks and Peter sadly turns from her and slowly walks away  MJ stands by the gravestone sobbing then suddenly as if struck by a memory  she moves her hand up to her lips SpiderMan steps back as two more webs pull a wall down on top of him  From beneath the pile of rubble a hand appears followed by the Goblin's head and torso as he hauls himself unsteadily to his feet  Then SpiderMan swoops down dragging the villain through a trellis and smashing him against another wall  Now it's SpiderMan's turn to rain blades on his opponent causing the Green Goblin to fall to the ground  The Green Goblin removes the hard mask with a jutting jaw revealing Norman Osborn and Peter  SpiderMan stares in disbelief  The Goblin sneers as he has pressed the remote on his glove triggering the glider with blades drawn to target SpiderMan  SpiderMan does a backward flip over it and it heads for Norman piercing through him and pinning him to the wall  Norman leans on the glider then looks up at Peter whose face is clearly visible through the torn mask before slumping over the glider with his eyes staring wide  On the ground beside him lies the mask of the Green Goblin  Peter lowers his head and later in the dark lays Norman no longer in costume down on the sofa in the Osborn mansion study  As he does so Harry dressed in black walks into the room and sees his father and the shadowy figure of SpiderMan  Harry scrabbles in the desk and finds a gun but when he looks up SpiderMan has gone and the net curtains billow in the wind with the window open "
        }
      ]
    }
  ]
}