{
  "ground_truth": "He folds them up and lays them down. He does a double take on seeing his physique in the mirror and flexes his muscles. He turns away from admiring his new body in the mirror and reaches for his shirt. Glancing through the window, he catches sight of Mary Jane, MJ, in her room in the house next door. He smiles as she primps her hair and walks back to his mirror, grinning. Coming downstairs, he places one hand on the molding, walks on the wall around the corner, and then leaps to the ground. Peter heads out and stands, staring after having witnessed the altercation between MJ and her father. He sets off down the street after the pretty young redhead who is wearing Calfland's boots, a short skirt, and a zipped cardigan. MJ marches down the sidewalk, arms folded, reaches the school bus stop, and grinds the sole of her left boot on the ground. Peter is a bit behind. MJ climbs into her friend's Ford Mustang Convertible. The school bus beats past, now chased by Peter. He makes a grab for the bus and catches hold of a poster stuck to its side. It comes away in his hand and rips its full length. The bus zooms on, leaving Peter in the middle of the street with a large portion of the poster sticking to his fingers. He looks at his hand and ponders. The imposing Osborne home is shown as Harry rushes into the study where his father is lying face down on the floor. He helps his father to a seat, leading to a flashback where Norman stares in shock. Later, Peter is having lunch at school. He looks up from his French fries and sees MJ walking towards him with a tray of food. He smiles at her, but her smile is for the people behind him. As she passes, she slips on a spilled drink. Peter leaps to his feet, catches her, then the tray, and then the food, grinning inanely. Raising her eyebrows, MJ tries to coax an answer from him, but then she walks off. Peter gawps at her retreating figure, sits back down at the table, and lets out a big sigh. He raises his right hand, a fork is sticking to his palm, and he can't shake it off, so he pulls the fork. It's attached to web-like threads coming from his wrist, and it snaps. But another web shoots across to the next table and snares a tray. Peter holds it towards him, ducks as it flies over his head, and lands on the back of Flash Thompson, who is with MJ. Covered in mush, Flash turns around as Peter makes a quick exit, tracking the tray behind him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He creases them up and places them down. He does a duplicate take upon seeing his form in the glass and bends his muscles. He turns away from admiring his recent body in the glass and extends for his shirt. Peering through the window, he spots Mary Jane, MJ, in her room in the residence next door. He grins as she arranges her hair and walks back to his glass, smiling. Descending downstairs, he places one hand on the trim, walks on the wall around the bend, and then jumps to the ground. Peter heads out and stands, gazing after having witnessed the conflict between MJ and her father. He sets off down the avenue after the attractive young redhead who is wearing Calfland's footwear, a short skirt, and a zipped sweater. MJ marches down the pavement, limbs folded, reaches the school coach halt, and grinds the sole of her left footwear on the ground. Peter is a bit behind. MJ climbs into her friend's Ford Mustang Convertible. The school coach speeds past, now pursued by Peter. He makes a grab for the coach and catches hold of a notice stuck to its side. It comes away in his hand and tears its full length. The coach dashes on, leaving Peter in the middle of the avenue with a large portion of the notice sticking to his fingers. He looks at his hand and reflects. The imposing Osborne residence is shown as Harry rushes into the study where his father is lying face down on the flooring. He assists his father to a seat, leading to a flashback where Norman stares in shock. Later, Peter is having lunch at school. He looks up from his French fries and sees MJ walking towards him with a platter of food. He grins at her, but her grin is for the people behind him. As she passes, she slips on a spilled drink. Peter jumps to his feet, catches her, then the platter, and then the food, smiling inanely. Raising her eyebrows, MJ tries to coax a response from him, but then she walks off. Peter stares at her retreating figure, sits back down at the table, and lets out a big sigh. He raises his right hand, a fork is sticking to his palm, and he can't shake it off, so he pulls the fork. It's attached to web-like filaments coming from his wrist, and it snaps. But another web shoots across to the next table and captures a platter. Peter holds it towards him, ducks as it flies over his head, and lands on the back of Flash Thompson, who is with MJ. Covered in mush, Flash turns around as Peter makes a quick exit, trailing the platter behind him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "They are folded up and laid down by him. A double take is done by him on seeing his physique in the mirror, and his muscles are flexed by him. He turns away from admiring his new body in the mirror, and his shirt is reached for. Looking through the window, Mary Jane, MJ, is caught sight of by him in her room in the house next door. She primps her hair, and he smiles while walking back to his mirror, grinning. He comes downstairs, places one hand on the molding, walks on the wall around the corner, and then leaps to the ground. Having witnessed the altercation between MJ and her father, after which he stands, Peter heads out. The pretty young redhead, who is wearing Calfland's boots, a short skirt, and a zipped cardigan, is set off down the street after by him. The sidewalk is marched down by MJ, arms folded, the school bus stop is reached, and her left boot is ground on the ground by her. Peter is a bit behind. She climbs into her friend's Ford Mustang Convertible. Past the school bus beats, now it is chased by Peter. He grabs the bus and catches hold of a poster that is stuck to its side. It is torn its full length and comes away in his hand. On zooms the bus, leaving Peter in the middle of the street with a large portion of the poster sticking to his fingers. His hand is looked at, and he ponders. Harry rushes into the study of the imposing Osborne home, where his father is lying face down on the floor. His father is helped to a seat by him, leading to a flashback where Norman stares in shock. Later, lunch is had by Peter at school. He looks up from his French fries and sees MJ walking towards him with a tray of food. A smile is given to her by him, but the people behind him receive her smile. She slips on a spilled drink as she passes. His feet are leapt to, she is caught, then the tray, and then the food, grinning inanely, by Peter. Raising her eyebrows, an answer is tried to be coaxed from Peter by MJ, but she walks off then. Her retreating figure is gawped at by Peter, who sits back down at the table and lets out a big sigh. His right hand is raised, a fork sticks to his palm, and shaking it off is impossible, so the fork is pulled by him. Web-like threads, which come from his wrist, attach it, and it snaps. But another web is shot across to the next table, and a tray is snared. The tray is held towards him by Peter; he ducks as it flies over his head, landing on Flash Thompson's back, who is with MJ. Covered in mush, Flash turns around, while Peter makes a quick exit, tracking the tray behind him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He folds clothes and, upon seeing his physique in the mirror, flexes his muscles. Turning away, he grabs his shirt and notices Mary Jane, MJ, next door. He smiles as she primps her hair, then returns to his mirror, grinning. Downstairs, he places a hand on the molding, walks on the wall around the corner, and leaps to the ground. Peter observes an altercation between MJ and her father, then follows her down the street. MJ, in Calfland boots, a short skirt, and a zipped cardigan, reaches the bus stop, grinding her boot's sole. Peter lags behind. MJ climbs into her friend's Ford Mustang Convertible. The school bus passes, and Peter chases it, grabbing a poster that rips away, leaving him with a piece. He ponders as the bus departs. At the Osborne home, Harry rushes in to help his father, leading to a flashback of Norman's shock. Later, at lunch, Peter watches MJ approach with a tray. He smiles at her, but she smiles at those behind him. As she slips on a spilled drink, Peter leaps to catch her and the food, grinning. MJ raises her eyebrows, but walks off after failing to get an answer from him. Peter sighs, notices a fork stuck to his palm, and yanks it free from web-like threads. Another web snares a tray from the next table. It lands on Flash Thompson, who is with MJ, and Peter quickly exits, trailing the tray."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He folds clothes, admires his physique in the mirror, and flexes. Turning from the mirror, Peter sees MJ next door and smiles as she fixes her hair. He descends the stairs, walks on the wall, and leaps to the ground. Outside, Peter observes MJ arguing with her father and follows her down the street. MJ, wearing Calfland's boots, a short skirt, and a zipped cardigan, reaches the bus stop, grinding her boot on the ground. She enters a friend's Mustang Convertible as Peter unsuccessfully tries to catch the school bus, tearing a poster instead. At the Osborne home, Harry rushes to his father, triggering a flashback of Norman's shock. Later, during lunch at school, Peter sees MJ approaching with a tray. She slips on a spilled drink, and Peter catches her, the tray, and the food. MJ raises her eyebrows, walks off, and Peter sighs, noticing a fork stuck to his palm with web-like threads. Pulling the fork, he accidentally snares a tray, accidentally catapulting it onto Flash Thompson, who is with MJ. Covered in mush, Flash turns as Peter quickly exits."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He carefully folds each item of clothing and then lays them meticulously down on the bed. When he catches a glimpse of his own physique in the full-length mirror, he does a double take, momentarily surprised by the changes. He can't resist flexing his muscles, turning slightly this way and that to admire his newly acquired body in the reflective surface. After savoring the moment, he turns away reluctantly from the enticing view, reaching for his shirt.\n\nAs he glances through the window, his eyes are drawn to the sight of Mary Jane, affectionately known as MJ, in her room at the neighboring house. A smile forms on his lips as he watches her absentmindedly primp her hair. Feeling buoyed, he returns to his mirror, grinning broadly at everything that has transpired. As he heads downstairs, he places one hand deftly on the molding, effortlessly walking along the wall around the corner before leaping gracefully to the ground below.\n\nPeter exits the house and comes to a halt, staring intently in the direction where he had just witnessed an upsetting altercation between MJ and her father. He quickly sets off down the street, determined to catch up with the pretty young redhead, who is fashionably wearing Calfland's boots, a short skirt that flutters with her stride, and a cardigan zipped just enough to ward off the chill. MJ walks down the sidewalk with determination, her arms folded tightly across her chest, reaching the school bus stop where she grinds the sole of her left boot into the pavement. Peter follows a short distance behind. As MJ climbs into her friend's Ford Mustang Convertible, the school bus barrels past, now pursued by Peter. He lunges for the bus, managing to grab hold of a poster that’s stuck to its side. However, it tears away in his hand, ripping dramatically along its full length. The bus speeds on, leaving Peter standing alone in the middle of the street with a large section of the poster awkwardly attached to his fingers. He looks down at his hand, lost in thought and contemplation.\n\nThe scene transitions to the imposing Osborne mansion, where Harry rushes into the grand study, finding his father lying face down on the highly polished wooden floor. He quickly helps his father into a seat, which triggers a vivid flashback where Norman stares back in utter shock. Later on, at school, Peter is sitting down to have lunch, absentmindedly picking at his French fries. He looks up and spots MJ making her way towards him, balancing a tray filled with food. He smiles hopefully at her, but her beaming smile is not directed at him; it's for the people at the table right behind him. As she moves past, her foot slips on a spilled drink, sending her off balance. Peter instantly leaps to his feet, managing to catch not only her but also her tray and all the food falling through the air, grinning inanely the entire time. Raising her eyebrows, MJ tries to get him to say something, but when he remains speechless, she simply moves on. Peter watches her go, her figure growing smaller as she departs, then sits back down at the table, releasing a deep, resigned sigh.\n\nAbsently, he raises his right hand to find a fork stubbornly sticking to his palm. Despite his efforts, he cannot shake it off, so he pulls at it firmly. It is then that he notices it's attached by web-like threads emanating from his wrist, and it finally snaps free. Yet, without warning, another web shoots out across to the neighboring table, snagging a tray. Peter pulls it back towards him, ducking just in time as it flies over his head and unceremoniously lands on the back of Flash Thompson, who is sitting with MJ. Covered in a mess of mush, Flash turns around angrily, while Peter seizes the opportunity to make a hasty exit, the tray trailing behind him like an accidental banner."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He takes great care as he meticulously folds each individual item of clothing, carefully laying them with precision on the bed. When his gaze inadvertently catches his own reflection in the expansive full-length mirror, he does a surprised double take, momentarily taken aback by the noticeable changes in his physique. Unable to resist the temptation, he flexes his muscles, turning ever so slightly from side to side, admiring his newly sculpted body in the polished reflective surface. After savoring this moment of self-appreciation, he reluctantly turns away from the enticing view, reaching over to grab his shirt.\n\nAs his eyes wander to the window, he is drawn to the sight of Mary Jane, affectionately referred to as MJ, who is in her room inside the house next door. A smile naturally forms on his lips as he watches her absentmindedly primping her hair. Feeling buoyed and uplifted, he returns to his own reflection, grinning broadly at the world and everything that has recently transpired. As he moves to head downstairs, he places one hand deftly upon the molding, effortlessly gliding along the wall around the corner before making a graceful leap to the ground below.\n\nPeter exits the house and pauses, staring intently in the direction where he had just witnessed a troubling altercation between MJ and her father. He quickly sets off down the street, determined to catch up with the pretty young redhead. She is fashionably clad in boots by Calfland, a short skirt that flutters with her every stride, and a cardigan zipped just enough to fend off the chill. MJ walks down the sidewalk with a purposeful determination, her arms tightly folded across her chest, until she reaches the school bus stop. There, she grinds the sole of her left boot into the pavement. Peter follows a short distance behind her. As MJ climbs into her friend's Ford Mustang Convertible, the school bus rushes past, now pursued by Peter. He lunges for the bus, managing to grab hold of a poster that’s awkwardly stuck to its side. However, it tears away dramatically in his hand, ripping along its entire length. The bus speeds onward, leaving Peter standing alone, right in the middle of the street, with a large section of the poster awkwardly clinging to his fingers. He looks down at his hand, lost in a moment of contemplation and thought.\n\nThe scene shifts to the imposing Osborne mansion, where Harry bursts into the grand study, only to find his father lying face down on the highly polished wooden floor. He quickly assists his father into a seat, triggering a vivid flashback in which Norman stares back at him in utter shock. Later on, at school, Peter is sitting down for lunch, absentmindedly picking at his French fries. He glances up and spots MJ walking towards him, expertly balancing a tray teeming with food. He smiles hopefully at her, but her radiant smile is unfortunately not meant for him; it’s directed at the group seated at the table right behind him. As she walks past, her foot unexpectedly slips on a spilled drink, sending her off balance. Peter instantly leaps to his feet, managing to catch not only MJ herself but also her precariously balanced tray and all the food that is cascading through the air, grinning inanely the entire time. Raising her eyebrows, MJ tries to prompt him into saying something, but when he remains speechless, she simply moves on. Peter watches her depart, her figure growing smaller in the distance, and then he sits back down at the table, releasing a deep, resigned sigh.\n\nAbsentmindedly, he raises his right hand, only to find a fork determinedly sticking to his palm. Despite his earnest efforts, he cannot shake it off, so he pulls at it firmly. It is at this moment that he notices it’s attached by web-like threads that are emanating from his wrist, which finally snap free. Yet, without any warning, another web shoots out across to the neighboring table, effectively snagging a tray. Peter pulls it back toward himself, ducking just in time as the tray flies over his head, ultimately landing with a thud on the back of Flash Thompson, who is sitting with MJ. Covered in a mess of mush, Flash turns around angrily, while Peter seizes the opportunity to make a hasty exit, the tray trailing behind him like an unintended banner."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He begins by carefully folding the items in his hands, ensuring each crease is perfect, before gently laying them down in their designated spot. As he glances up, his eyes catch his own reflection in the mirror, prompting him to take a moment and do a double take, absorbing the details of his transformed physique. With a sense of satisfaction, he flexes his muscles, admiring the definition and strength he's achieved. Tearing his gaze away from the mirror, he turns to reach for his shirt, feeling the fabric between his fingers. As he moves, his eyes casually drift towards the window, where he serendipitously catches sight of Mary Jane, known affectionately as MJ, in her room next door. A smile naturally spreads across his face as he watches her primp her hair, finding charm in the mundane act. Driven by a sense of lightheartedness, he returns to his mirror, grinning at his reflection once more. Descending the stairs, he engages with his surroundings, placing one hand on the molding for balance. With a playful twist, he transitions to walking on the wall around the corner before executing a nimble leap to, the ground below. Exiting the house, he pauses, standing motionless for a moment, as he witnesses the aftermath of an altercation between MJ and her father, the scene etching itself in his mind. Motivated by concern and curiosity, he sets off down the street, his pace quickening as he follows the captivating young redhead dressed in Calfland's boots, a short skirt, and a zipped cardigan. With a determined posture, MJ marches forward along the sidewalk, her arms firmly folded. She reaches the school bus stop where she demonstrates her impatience by grinding the sole of her left boot on the ground. Peter trails just behind, catching up to the scene as MJ climbs into her friend's Ford Mustang Convertible. The school bus zooms past, leaving Peter with a sense of urgency as he chases it down the street. In his attempt to catch up, he reaches out and grabs hold of a poster plastered to the bus's side, but as the vehicle accelerates, the poster rips away from its surface, unfurling in his grasp. The bus continues on, soon disappearing from view, while Peter stands in the middle of the street, contemplating the large portion of the poster sticking to his fingers. As he ponders his next move, the scene shifts to the imposing Osborne home, where Harry rushes into the study in a state of alarm, finding his father lying face down on the floor. With urgency, Harry helps him to a seat, sparking a flashback of Norman's shocked expression. Later, the scene transitions to a lunch setting at school, where Peter sits with a tray of food, occasionally glancing up from his French fries. His heart lifts as he sees MJ approaching with her own tray, expecting the smile she offers to be his. However, as she gets closer, it's clear her smile is directed at others behind him. Just as she passes, MJ slips on a spilled drink, and in an instant, Peter springs into action. With impressive agility, he leaps to his feet, catching her with one arm, then the tray, and finally the scattered food items, an inane grin plastered on his face. MJ, raising her eyebrows, attempts to coax an explanation from him, but without waiting for a response, she turns and walks away. Peter watches her retreat, his gaze lingering on her figure as she disappears from view. He exhales a deep sigh, sinking back into his seat at the table. Glancing down, he notices a fork clinging stubbornly to his palm. He tries to shake it off without success and resorts to pulling the fork, discovering it's attached via web-like threads emanating from his wrist. As he tugs, the web snaps, but almost immediately, another shoots across the room, ensnaring a tray on the next table. Peter instinctively pulls it towards him, ducking as it sails overhead, finally landing with an unfortunate splat on the back of Flash Thompson, who is sitting with MJ. Now covered in mush, Flash turns in anger as Peter quickly retreats, the tray trailing behind him like a guilty reminder of his unintended actions."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Peter folds his clothes, admires his physique in the mirror with a flex, and turns away to reach for his shirt. Noticing MJ through the window, he smiles as she fixes her hair. He then descends the stairs, placing a hand on the molding, walking along the wall, and leaping to the ground. After witnessing an altercation between MJ and her father, Peter follows her down the street. MJ, wearing her distinctive outfit, reaches the bus stop, grinds her boot on the ground, and climbs into her friend's Ford Mustang Convertible. The school bus rushes past, and Peter chases it, grabbing at a poster that tears away, leaving him pondering with poster pieces. Meanwhile, at the Osborne home, Harry rushes to help his father, Norman, who is face down, leading to a flashback of Norman's shock.\n\nAt school, Peter is at lunch when he spots MJ approaching with a tray of food. Smiling at her, he realizes her attention is behind him. As MJ slips on a spilled drink, Peter springs up to catch her, the tray, and her food, grinning awkwardly. MJ raises an eyebrow at his antics but walks off without an answer. Peter watches her leave, sighs, and notices a fork stuck to his palm by web-like threads from his wrist. As he pulls it loose, another web snares a tray from a nearby table, sending it flying onto Flash Thompson. Covered in mush, Flash turns as Peter makes a quick exit, dragging the tray along."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He folds them up and lays them down. He does a double take on seeing his physique in the mirror, flexing his muscles, which he has developed remarkably since his encounter with a genetically-altered spider at Midtown High School. He turns away from admiring his new body in the mirror and reaches for his shirt. Glancing through the window, he catches sight of Mary Jane, MJ, in her room in the house next door, which is known for its eclectic variety of flowers planted by her grandmother. He smiles as she primps her hair, a ritual she maintains before heading out, and walks back to his mirror, grinning. Coming downstairs, he places one hand on the molding, the intricately designed wood piece dating back to early 20th-century architecture, walks on the wall around the corner, and then leaps to the ground. Peter heads out and stands, staring after having witnessed the altercation between MJ and her father, who often disagrees with her choice of friends. He sets off down the street after the pretty young redhead who is wearing Calfland's boots, known for their durability and style among teenagers, a short skirt, and a zipped cardigan. MJ marches down the sidewalk, arms folded, reaches the school bus stop—a popular gathering spot for students— and grinds the sole of her left boot on the ground. Peter is a bit behind. MJ climbs into her friend's Ford Mustang Convertible, an iconic American muscle car known for its speed and design. The school bus beats past, now chased by Peter. He makes a grab for the bus and catches hold of a poster stuck to its side that advertises the upcoming science fair. It comes away in his hand and rips its full length. The bus zooms on, leaving Peter in the middle of the street with a large portion of the poster sticking to his fingers. He looks at his hand and ponders the mysterious adhesive properties developing on his skin. The imposing Osborne home is shown as Harry rushes into the study where his father, the influential and ambitious industrialist Norman Osborne, is lying face down on the floor. He helps his father to a seat, leading to a flashback where Norman stares in shock due to an experiment gone awry in his high-tech laboratory. Later, Peter is having lunch at school. He looks up from his French fries and sees MJ walking towards him with a tray of food. He smiles at her, but her smile is for the people behind him. As she passes, she slips on a spilled drink from the vending machine nearby. Peter leaps to his feet, catches her, then the tray, and then the food, grinning inanely. Raising her eyebrows, MJ tries to coax an answer from him about his impressive reflexes but then she walks off. Peter gawps at her retreating figure, sits back down at the table, and lets out a big sigh. He raises his right hand, a fork is sticking to his palm, and he can't shake it off, so he pulls the fork. It's attached to web-like threads coming from his wrist, and it snaps. But another web shoots across to the next table and snares a tray. Peter holds it towards him, ducks as it flies over his head, and lands on the back of Flash Thompson, who is with MJ, notorious for bullying Peter since elementary school. Covered in mush, Flash turns around as Peter makes a quick exit, tracking the tray behind him."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He folds them up and lays them down. He does a double take on seeing his physique in the mirror and flexes his muscles. He turns away from admiring his new body in the mirror and reaches for his shirt. Glancing through the window he catches sight of Mary Jane MJ in her room in the house next door. He smiles as she primps her hair and walks back to his mirror grinning. Coming downstairs he places one hand on the molding walks on the wall around the corner and then leaps to the ground. Peter heads out and stands staring after having witnessed the altercation between MJ and her father. He sets off down the street after the pretty young redhead who is wearing Calfland's boots a short skirt and a zipped cardigan. MJ marches down the sidewalk arms folded reaches the school bus stop and grinds the sole of her left boot on the ground. Peter is a bit behind. MJ climbs into her friend's Ford Mustang Convertible. The school bus beats past now chased by Peter. He makes a grab for the bus and catches hold of a poster stuck to its side. It comes away in his hand and rips its full length. The bus zooms on leaving Peter in the middle of the street with a large portion of the poster sticking to his fingers. He looks at his hand and ponders. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. The imposing Osborne home is shown as Harry rushes into the study where his father is lying face down on the floor. He helps his father to a seat leading to a flashback where Norman stares in shock. Later Peter is having lunch at school. He looks up from his French fries and sees MJ walking towards him with a tray of food. He smiles at her but her smile is for the people behind him. As she passes she slips on a spilled drink. Peter leaps to his feet catches her then the tray and then the food grinning inanely. Raising her eyebrows MJ tries to coax an answer from him but then she walks off. Peter gawps at her retreating figure sits back down at the table and let us out a big sigh. He raises his right hand. a fork is sticking to his palm and he cannot shake it off so he pulls the fork. It is attached to weblike threads coming from his wrist and it snaps. But another web shoots across to the next table and snares a tray. Peter holds it towards him ducks as it flies over his head and lands on the back of Flash Thompson who is with MJ. Covered in mush. Flash turns around as Peter makes a quick exit tracking the tray behind him."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He folds them up and lays them down. He does a double take on seeing his physique in the mirror and flexes his muscles. He turns away from admiring his new body in the mirror and reaches for his shirt. Glancing through the window he catches sight of Mary Jane MJ in her room in the house next door. He smiles as she primps her hair and walks back to his mirror grinning. Coming downstairs he places one hand on the molding walks on the wall around the corner and then leaps to the ground. Peter heads out and stands staring after having witnessed the altercation between MJ and her father. He sets off down the street after the pretty young redhead who is wearing Calfland's boots a short skirt and a zipped cardigan. MJ marches down the sidewalk arms folded reaches the school bus stop and grinds the sole of her left boot on the ground. Peter is a bit behind. MJ climbs into her friend's Ford Mustang Convertible. The school bus beats past now chased by Peter. He makes a grab for the bus and catches hold of a poster stuck to its side. It comes away in his hand and rips its full length. The bus zooms on leaving Peter in the middle of the street with a large portion of the poster sticking to his fingers. He looks at his hand and ponders. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. The imposing Osborne home is shown as Harry rushes into the study where his father is lying face down on the floor. He helps his father to a seat leading to a flashback where Norman stares in shock. Later Peter is having lunch at school. He looks up from his French fries and sees MJ walking towards him with a tray of food. He smiles at her but her smile is for the people behind him. As she passes she slips on a spilled drink. Peter leaps to his feet catches her then the tray and then the food grinning inanely. Raising her eyebrows MJ tries to coax an answer from him but then she walks off. Peter gawps at her retreating figure sits back down at the table and let us out a big sigh. He raises his right hand. a fork is sticking to his palm and he cannot shake it off so he pulls the fork. It is attached to weblike threads coming from his wrist and it snaps. But another web shoots across to the next table and snares a tray. Peter holds it towards him ducks as it flies over his head and lands on the back of Flash Thompson who is with MJ. Covered in mush. Flash turns around as Peter makes a quick exit tracking the tray behind him."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He folds them up and lays them down. He does a double take on seeing his physique in the mirror and flexes his muscles. He turns away from admiring his new body in the mirror and reaches for his shirt. Glancing through the window he catches sight of Mary Jane MJ in her room in the house next door. He smiles as she primps her hair and walks back to his mirror grinning. Coming downstairs he places one hand on the molding walks on the wall around the corner and then leaps to the ground. Peter heads out and stands staring after having witnessed the altercation between MJ and her father. He sets off down the street after the pretty young redhead who is wearing Calfland's boots a short skirt and a zipped cardigan. Peter gawps at her retreating figure sits back down at the table and let us out a big sigh. He raises his right hand. a fork is sticking to his palm and he cannot shake it off so he pulls the fork. It is attached to weblike threads coming from his wrist and it snaps. But another web shoots across to the next table and snares a tray. Peter holds it towards him ducks as it flies over his head and lands on the back of Flash Thompson who is with MJ. Covered in mush. Flash turns around as Peter makes a quick exit tracking the tray behind him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He folds them up and lays them down. He does a double take on seeing his physique in the mirror and flexes his muscles. He turns away from admiring his new body in the mirror and reaches for his shirt. Glancing through the window he catches sight of Mary Jane MJ in her room in the house next door. Peter holds it towards him ducks as it flies over his head and lands on the back of Flash Thompson who is with MJ. Covered in mush. Flash turns around as Peter makes a quick exit tracking the tray behind him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The origami crane folds itself and floats gently. The pigeon does a double take on seeing its feathers in the lake and flaps its wings. The pigeon drifts away from admiring its new plumage in the lake and reaches for its twig. Staring through the porthole, the pigeon catches sight of Tulip, TP, in her nest in the garden nearby. The pigeon chirps as she preens her wings and flutters back to its puddle, cackling. Gliding downstairs, it places one wing on the banister, hops on the roof around the chimney, and then swoops to the ground. The rabbit bounds out and pauses, gazing after having witnessed the debate between TP and her sibling. The rabbit bounces along the trail after the vibrant young bluejay who is wearing Dandelion's leaves, a short vest, and a buttoned scarf. TP paces down the path, wings folded, reaches the birdbath stop, and scrapes the tip of her left leaf on the ground. The rabbit is a bit behind. TP hops into her cousin's Oak Tree Sedan. The birdbath whizzes past, now followed by the rabbit. The rabbit makes a grab for the bath and catches hold of a leaf stuck to its side. It drifts away in its paw and tears along its spine. The bath races on, leaving the rabbit in the middle of the path with a large piece of the leaf clinging to its claws. The rabbit gazes at its paw and wonders. The grand Oakwood haven is shown as Spike dashes into the library where his parent is lying face down on the rug. He aids his parent to a perch, leading to a flashback where Maple gapes in astonishment. Later, the rabbit is munching lunch in the garden. The rabbit looks up from its carrot sticks and sees TP bouncing towards it with a basket of berries. The rabbit chirps at her, but her chirp is for the critters beyond him. As she skips by, she slips on a spilled nectar. The rabbit springs to its paws, catches her, then the basket, and then the berries, giggling foolishly. Raising her feelers, TP tries to coax an answer from it, but then she flutters off. The rabbit gawks at her retreating wings, settles back at the log, and lets out a big breath. It raises its front paw, a toothpick is clinging to its fur, and it can't shake it off, so it tugs the toothpick. It's attached to vine-like strings coming from its wrist, and it snaps. But another vine shoots across to the next log and snares a basket. The rabbit holds it towards him, ducks as it glides over its head, and lands on the shell of Tusk Bumblebee, who is with TP. Covered in goo, Tusk rotates around as the rabbit makes a speedy departure, dragging the basket behind it."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Peter admires his new physique in the mirror, then spots Mary Jane, known as MJ, next door. Smiling, he departs his house, witnessing an argument between MJ and her father. He follows MJ, who walks to the school bus stop, but she rides off in a friend's car, leaving Peter to chase the bus. Failing to catch it, he ends up with a torn poster in his hand. Meanwhile, at the Osborne home, Harry finds his father, Norman, on the floor. Later, at school, Peter sees MJ approaching during lunch but her attention is elsewhere. When she slips, Peter quickly catches MJ and her lunch, impressing her momentarily before she leaves. Frustrated, Peter notices a fork stuck to his palm via web-like threads. Trying to remove it, he accidentally snags a tray, which lands on Flash Thompson, MJ's companion, prompting Peter to make a swift escape."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Flash turns around as Peter makes a quick exit tracking the tray behind him Covered in mush Peter holds it towards him ducks as it flies over his head and lands on the back of Flash Thompson who is with MJ But another web shoots across to the next table and snares a tray It is attached to weblike threads coming from his wrist and it snaps a fork is sticking to his palm and he cannot shake it off so he pulls the fork He raises his right hand Peter gawps at her retreating figure sits back down at the table and let us out a big sigh Raising her eyebrows MJ tries to coax an answer from him but then she walks off Peter leaps to his feet catches her then the tray and then the food grinning inanely As she passes she slips on a spilled drink He smiles at her but her smile is for the people behind him He looks up from his French fries and sees MJ walking towards him with a tray of food Later Peter is having lunch at school He helps his father to a seat leading to a flashback where Norman stares in shock The imposing Osborne home is shown as Harry rushes into the study where his father is lying face down on the floor He looks at his hand and ponders The bus zooms on leaving Peter in the middle of the street with a large portion of the poster sticking to his fingers It comes away in his hand and rips its full length He makes a grab for the bus and catches hold of a poster stuck to its side The school bus beats past now chased by Peter MJ climbs into her friend's Ford Mustang Convertible Peter is a bit behind MJ marches down the sidewalk arms folded reaches the school bus stop and grinds the sole of her left boot on the ground He sets off down the street after the pretty young redhead who is wearing Calfland's boots a short skirt and a zipped cardigan Peter heads out and stands staring after having witnessed the altercation between MJ and her father Coming downstairs he places one hand on the molding walks on the wall around the corner and then leaps to the ground He smiles as she primps her hair and walks back to his mirror grinning Glancing through the window he catches sight of Mary Jane MJ in her room in the house next door He turns away from admiring his new body in the mirror and reaches for his shirt He does a double take on seeing his physique in the mirror and flexes his muscles He folds them up and lays them down"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He does a double take on seeing his physique in the mirror and flexes his muscles He folds them up and lays them down Glancing through the window he catches sight of Mary Jane MJ in her room in the house next door He turns away from admiring his new body in the mirror and reaches for his shirt Coming downstairs he places one hand on the molding walks on the wall around the corner and then leaps to the ground He smiles as she primps her hair and walks back to his mirror grinning He sets off down the street after the pretty young redhead who is wearing Calfland's boots a short skirt and a zipped cardigan Peter heads out and stands staring after having witnessed the altercation between MJ and her father Peter is a bit behind MJ marches down the sidewalk arms folded reaches the school bus stop and grinds the sole of her left boot on the ground The school bus beats past now chased by Peter MJ climbs into her friend's Ford Mustang Convertible It comes away in his hand and rips its full length He makes a grab for the bus and catches hold of a poster stuck to its side He looks at his hand and ponders The bus zooms on leaving Peter in the middle of the street with a large portion of the poster sticking to his fingers He helps his father to a seat leading to a flashback where Norman stares in shock The imposing Osborne home is shown as Harry rushes into the study where his father is lying face down on the floor He looks up from his French fries and sees MJ walking towards him with a tray of food Later Peter is having lunch at school As she passes she slips on a spilled drink He smiles at her but her smile is for the people behind him Raising her eyebrows MJ tries to coax an answer from him but then she walks off Peter leaps to his feet catches her then the tray and then the food grinning inanely He raises his right hand Peter gawps at her retreating figure sits back down at the table and let us out a big sigh It is attached to weblike threads coming from his wrist and it snaps a fork is sticking to his palm and he cannot shake it off so he pulls the fork Peter holds it towards him ducks as it flies over his head and lands on the back of Flash Thompson who is with MJ But another web shoots across to the next table and snares a tray Flash turns around as Peter makes a quick exit tracking the tray behind him Covered in mush"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The imposing Osborne home is shown as Harry rushes into the study where his father is lying face down on the floor He helps his father to a seat leading to a flashback where Norman stares in shock Later Peter is having lunch at school He looks up from his French fries and sees MJ walking towards him with a tray of food He smiles at her but her smile is for the people behind him As she passes she slips on a spilled drink Peter leaps to his feet catches her then the tray and then the food grinning inanely Raising her eyebrows MJ tries to coax an answer from him but then she walks off Peter gawps at her retreating figure sits back down at the table and let us out a big sigh He raises his right hand a fork is sticking to his palm and he cannot shake it off so he pulls the fork It is attached to weblike threads coming from his wrist and it snaps But another web shoots across to the next table and snares a tray Peter holds it towards him ducks as it flies over his head and lands on the back of Flash Thompson who is with MJ Covered in mush Flash turns around as Peter makes a quick exit tracking the tray behind him He folds them up and lays them down He does a double take on seeing his physique in the mirror and flexes his muscles He turns away from admiring his new body in the mirror and reaches for his shirt Glancing through the window he catches sight of Mary Jane MJ in her room in the house next door He smiles as she primps her hair and walks back to his mirror grinning Coming downstairs he places one hand on the molding walks on the wall around the corner and then leaps to the ground Peter heads out and stands staring after having witnessed the altercation between MJ and her father He sets off down the street after the pretty young redhead who is wearing Calfland's boots a short skirt and a zipped cardigan MJ marches down the sidewalk arms folded reaches the school bus stop and grinds the sole of her left boot on the ground Peter is a bit behind MJ climbs into her friend's Ford Mustang Convertible The school bus beats past now chased by Peter He makes a grab for the bus and catches hold of a poster stuck to its side It comes away in his hand and rips its full length The bus zooms on leaving Peter in the middle of the street with a large portion of the poster sticking to his fingers He looks at his hand and ponders"
        }
      ]
    }
  ]
}