{
  "ground_truth": "Down below, the hijacked car takes a right, gliding behind him and sending water into the air. Still, the police pursued the stolen car. Up above, Spider-Man is gaining on. He comes lower and lower until he can leap out of the roof of his uncle's car. He punches through it. Spider-Man grabs hold of the carjacker, who pulls a gun. As gunshots pepper the roof of the car, Spider-Man leaps up to the roof of a passing truck. Balancing on both feet, he keeps his eyes firmly on the stolen car, and a bridge moves ahead. Spider-Man vaults into the air, across the bridge, and lands back on the roof of the truck. Spider-Man throws himself onto the car's bonnet and punches through the windscreen. The car swerves, hits a bollard, then crashes into a set of iron gates. A posse of police cars builds up behind a smashed vehicle. The carjacker has made his escape from the vehicle and is creeping to a darkened warehouse, his gun held shakily in his left hand. As he reloads his piece, a shadow looms above his head. He's been surrounded. He shoots at the moving shadow. Trying to run from it, he fails to see Spider-Man lowering himself for a better look. At a locked door, Spider-Man catches up with him. He smashes the car thief's head into the glass panels on the door, then sends him flying across the room. The thief lunges with a knife, but Spider-Man kicks it from his grasp, knocking the balaclava off. Peter strides forward and grabs the man by the lapel. It's the thief from the arena. He remembers only too well letting the man pass and reflects on Uncle Ben lying on the ground, then backs away. The thief raises his gun and holds it to Peter's forehead. Peter knocks the hand away and twists the thief's arm, causing the gun to drop. The thief staggers back and trips. A police spotlight illuminates a second-floor window through which the thief has fallen. It moves down to pick out where he has landed face down. Peter gazes down from the darkness. The spotlight returns to the window, and his features lit up, Peter turns in horror. Police swarm all over the warehouse. They creep forward, guns held in one hand and torchlights in the other. They reach the window to find no one there. Peter is sitting with his elbows resting on his knees out in the open air, a light breeze ruffling his short dark hair, his face sad and his eyes moist. Around and beneath him, the lights of New York. He opens the front door of his home. Inside, sitting in the darkness is Aunt May, wrapped in her padded housecoat.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Down beneath, the commandeered automobile takes a right, sliding behind him and sending liquid into the air. Still, the law enforcement chased the pilfered vehicle. Up above, Spider-Man is advancing. He descends lower and lower until he can spring out of the roof of his uncle's vehicle. He punches through it. Spider-Man seizes the carjacker, who draws a firearm. As gunfire peppers the roof of the vehicle, Spider-Man jumps up to the roof of a passing lorry. Balancing on both feet, he keeps his eyes firmly on the pilfered automobile, and a bridge approaches ahead. Spider-Man vaults into the air, across the bridge, and lands back on the roof of the lorry. Spider-Man throws himself onto the automobile's hood and punches through the windshield. The vehicle veers, hits a post, then crashes into a set of iron gates. A group of law enforcement vehicles builds up behind a shattered automobile. The carjacker has made his escape from the automobile and is sneaking to a dim warehouse, his firearm held shakily in his left hand. As he reloads his piece, a shadow looms above his head. He's been surrounded. He fires at the moving shadow. Trying to flee from it, he fails to notice Spider-Man descending for a better look. At a locked entrance, Spider-Man catches up with him. He smashes the carjacker's head into the glass panels on the entrance, then sends him flying across the chamber. The carjacker lunges with a dagger, but Spider-Man kicks it from his grasp, knocking the balaclava off. Peter strides forward and seizes the man by the lapel. It's the carjacker from the arena. He recalls only too well allowing the man to pass and reflects on Uncle Ben lying on the ground, then retreats. The carjacker raises his firearm and holds it to Peter's forehead. Peter knocks the hand away and twists the carjacker's arm, causing the firearm to drop. The carjacker staggers back and trips. A law enforcement spotlight illuminates a second-floor window through which the carjacker has plummeted. It moves down to highlight where he has landed face down. Peter gazes down from the obscurity. The spotlight returns to the window, and his features lit up, Peter turns in horror. Law enforcement swarms all over the warehouse. They advance forward, firearms held in one hand and flashlights in the other. They arrive at the window to find no one there. Peter is sitting with his elbows resting on his knees out in the open air, a light breeze ruffling his short dark hair, his face despondent and his eyes moist. Around and beneath him, the lights of New York. He opens the front entrance of his home. Inside, sitting in the obscurity is Aunt May, wrapped in her padded housecoat."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Down below, a right is taken by the hijacked car, gliding behind him and water is sent into the air. Still, the stolen car was pursued by the police. Up above, Spider-Man gains on it. He lowers himself more and more until the roof of his uncle's car can be leaped out of by him. It is punched through by him. The carjacker is grabbed by Spider-Man, who pulls a gun. As the roof of the car is peppered with gunshots, a leap is made by Spider-Man to the roof of a passing truck. Balancing on both feet, his eyes are kept firmly on the stolen car, and a bridge is moved ahead by it. Spider-Man vaults into the air, across the bridge, and the truck roof is landed back on by him. He throws himself onto the car's bonnet and the windscreen is punched through by him. The car swerves, a bollard is hit, then a set of iron gates is crashed into by it. A smashed vehicle is built up behind by a posse of police cars. The vehicle is escaped from by the carjacker and he creeps to a darkened warehouse, his gun being held shakily in his left hand. As his piece is reloaded, a shadow looms above his head. He has surrounded them. The moving shadow is shot at by him. Attempting to run from it, Spider-Man lowering himself for a better look is failed to see by him. At a locked door, he is caught up with by Spider-Man. The car thief's head is smashed into the glass panels on the door by him, then he is sent flying across the room by him. The thief lunges with a knife, but it is kicked from his grasp by Spider-Man, and the balaclava is knocked off. Peter strides forward and the man is grabbed by the lapel by him. It's the thief from the arena. He remembers only too well letting the man pass and Uncle Ben lying on the ground is reflected on by him, then he backs away. The gun is raised by the thief and held to Peter's forehead. The hand is knocked away by Peter and the thief's arm is twisted by him, causing the gun to drop. The thief staggers back and a trip is made by him. A second-floor window is illuminated by a police spotlight through which he has fallen. It moves down to pick out where he has landed face down. The darkness is gazed down from by Peter. The spotlight returns to the window, and with his features lit up, a turn is made in horror by Peter. The warehouse is swarmed all over by police. They creep forward, guns are held in one hand and torchlights in the other. The window is reached by them to find no one there. Peter is sitting with his elbows resting on his knees out in the open air, a light breeze ruffling his short dark hair, his face sad and his eyes moist. New York's lights are around and beneath him. The front door of his home is opened by him. Inside, Aunt May is sitting in the darkness, wrapped in her padded housecoat."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Below, the hijacked car veers right, sending water into the air, pursued by police. Spider-Man gains on them from above, descending until he leaps from the roof of his uncle's car, punches through it, and grabs the carjacker, who fires a gun. Spider-Man jumps onto a passing truck's roof, keeping his eyes on the stolen car. He vaults across a bridge and lands back on the truck roof, then leaps onto the car's bonnet, punching through the windshield. The car hits a bollard and crashes into iron gates. Behind, police cars accumulate. The carjacker escapes to a dark warehouse, shakily holding his gun. As he reloads, a shadow looms; he shoots but fails to see Spider-Man approaching. At a locked door, Spider-Man catches him, smashing his head into glass, then sends him flying. The thief lunges with a knife, but Spider-Man disarms him and removes the balaclava, revealing him as the thief from the arena. Peter recalls Uncle Ben and steps back. The thief raises a gun to Peter's head; Peter disarms him, causing the thief to trip and fall out of a window. A police spotlight reveals his downed position. Peter, illuminated in the window, turns in horror as police swarm the warehouse. They find the space empty, while Peter sits in open air, sad, overlooking New York. He enters his home, where Aunt May sits quietly in the dark."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Below, the hijacked car takes a right, spraying water. The police chase it. Above, Spider-Man gains on them, then leaps from his uncle's car roof, punching through it. He grabs the carjacker, who draws a gun. Spider-Man jumps to a truck, eyes on the car, leaps over a bridge, and lands back on the truck. He jumps onto the car, breaks the windscreen, causing a crash. The carjacker flees to a dark warehouse, gun in hand. Surrounded, he fires at shadows. Spider-Man catches up, smashing his head into the door, disarming him. It's the thief from the arena. Remembering Uncle Ben, Peter hesitates. The thief raises his gun; Peter twists his arm, dropping the gun. The thief falls through a window, illuminated by a police spotlight. Peter watches from darkness. Police swarm in but find no one at the window. Peter sits outside, sad, New York lights around him. He enters his home, finding Aunt May in the dark."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Below, the hijacked vehicle swiftly takes a sharp right turn, gliding smoothly behind Spider-Man, sending a dramatic spray of water into the air. Yet, unwaveringly persistent, the police continued to pursue the stolen automobile. High above the unfolding chase, Spider-Man was rapidly closing the distance. He descended lower and lower from the towering heights until the moment was right for him to make a dramatic leap from the roof of his uncle's car. With a powerful punch, he broke through it. Spider-Man secured a firm grip on the carjacker, who, in response, drew a firearm. As the sound of gunshots reverberated and punctured the car's roof, Spider-Man leapt skillfully onto the top of a nearby passing truck. Steadily balancing on both feet, his unwavering gaze remained fixed on the stolen car while a bridge loomed in the distance. Spider-Man catapulted himself gracefully through the air, across the bridge, and then landed back on the truck's roof. He propelled himself onto the car's bonnet and shattered the windscreen with a forceful punch. The car veered uncontrollably, collided with a bollard, and eventually crashed into a set of sturdy iron gates. A fleet of police cars amassed behind the crashed vehicle. The carjacker managed to escape and crept stealthily toward a dimly lit warehouse, his gun trembling in his left hand. During a lull in his escape, as he attempted to reload his weapon, a menacing shadow loomed ominously over his head. He was surrounded. In desperation, he fired at the elusive moving shadow. In a panicked attempt to escape it, he failed to notice Spider-Man lowering himself for a better vantage point. At a locked door, Spider-Man swiftly caught up with him, smashing the thief's head forcefully against the door's glass panels, sending him sprawling across the room. The thief made a wild lunge with a knife, but Spider-Man swiftly kicked it away, dislodging the balaclava from his head. Peter stepped forward with purpose and seized the man by the lapel. Recognition dawned—it was the same thief from the arena. Memories of allowing the man to pass, and of Uncle Ben lying motionless on the ground, flooded back, prompting Peter to step back. The thief, however, raised his gun, pressing it against Peter’s forehead. With quick reflexes, Peter deflected the hand, twisting the thief’s arm and causing the gun to fall. The thief staggered backwards, tripping. A police spotlight illuminated a second-floor window from which the thief had fallen. It then swung downward to highlight where he had landed, facedown on the ground below. Peter gazed down from the shrouded darkness above. As the spotlight returned to the window, illuminating his features, Peter turned away in horror. Police swarmed through the warehouse, advancing with guns in one hand and torchlights in the other. Upon reaching the window, they found it empty. Outside, Peter sat silently with his elbows resting on his knees, exposed to the open night air. A gentle breeze ruffled his short dark hair, and his expression was one of profound sadness, with eyes glistening with unshed tears. Surrounding him were the vibrant lights of New York. He entered his home through the front door. Inside, in the enveloping darkness, sat Aunt May, wrapped warmly in her padded housecoat."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Below, the hijacked vehicle swiftly took a sharp right turn, expertly navigating along the road's curve as it glided smoothly right behind Spider-Man, sending a dramatic spray of water into the air like a fountain. However, the police, unwaveringly persistent in their pursuit, continued to chase the stolen automobile with determination. High above the unfolding chase, Spider-Man was rapidly closing the distance between himself and the fleeing car. He descended lower and lower from the towering heights of the city's skyline until he judged the moment right to make a dramatic leap from the roof of his uncle's speeding car. With a powerful punch, he broke through the car's exterior. Spider-Man then secured a firm grip on the carjacker, who, in response to the intrusion, drew a firearm. As the piercing sound of gunshots reverberated through the air and punctured the car's roof, Spider-Man skillfully leapt onto the top of a nearby passing truck, balancing steadily on both feet. His unwavering gaze remained fixed intently on the stolen car, while a bridge loomed ominously in the distance. Spider-Man catapulted himself with grace through the air, across the expanse of the bridge, and then landed back on the truck's roof with agility. He propelled himself forward, landing on the car's bonnet and shattered the windscreen with a forceful punch. The car veered uncontrollably before ultimately colliding with a bollard and then crashing into a formidable set of sturdy iron gates. A fleet of police cars amassed quickly behind the crashed vehicle, surrounding it. The carjacker managed to escape from the wreckage and crept stealthily toward a dimly lit warehouse, his gun trembling and unsteady in his left hand. During a brief lull in his frantic escape, as he fumbled to reload his weapon, a menacing shadow loomed ominously over his head. He found himself surrounded. In a moment of desperation, he fired at the elusive moving shadow. In a panicked attempt to flee from it, he completely failed to notice Spider-Man lowering himself down silently for a better vantage point. At a locked door, Spider-Man swiftly caught up with him, smashing the thief's head forcefully against the door's glass panels, sending him sprawling carelessly across the room inside. The thief made a wild and reckless lunge with a knife, but Spider-Man swiftly kicked it away, dislodging the balaclava from the thief's head. Peter stepped forward with determination and seized the man firmly by the lapel. Recognition dawned on him—it was the same thief he had encountered from the arena. Memories of allowing the man to pass, and of Uncle Ben lying motionless on the ground, flooded back overwhelmingly, prompting Peter to step back. The thief, however, raised his gun defiantly, pressing it against Peter’s forehead. With quick reflexes, Peter deflected the hand, twisting the thief’s arm and causing the gun to fall harmlessly. The thief staggered backward, tripping as he lost balance. A police spotlight then illuminated a second-floor window, revealing the spot from which the thief had fallen. The beam swung downward to highlight where he had landed, face down on the ground below. Peter gazed down from the shrouded darkness above as the scene unfolded. As the spotlight returned to the window, illuminating his features, Peter turned away in horror and disbelief. Police swarmed through the warehouse, advancing cautiously with guns in one hand and torchlights in the other, searching for any lingering danger. Upon reaching the window, they found it empty, devoid of any presence. Outside, Peter sat silently with his elbows resting heavily on his knees, exposed to the open night air. A gentle breeze ruffled his short dark hair, caressing his face softly, and his expression was one of profound sadness, with eyes glistening with unshed tears. Surrounding him were the vibrant, dazzling lights of New York City, flickering like stars. He entered his home through the front door. Inside, in the enveloping darkness of the room, sat Aunt May, wrapped warmly in her padded housecoat, offering the comfort of home."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Far below, the hijacked car maneuvers to the right, gracefully gliding behind him as its tires forcefully cut through the puddles, sending a spray of water cascading into the air. Despite this, the relentless police continue their pursuit of the stolen vehicle. High above the scene, Spider-Man gains ground on the chase, descending gradually until he reaches a point low enough to leap down onto the top of his uncle's car. With a forceful punch, he breaks through the roof, creating an entryway. As the carjacker inside the vehicle reacts by drawing a gun, Spider-Man swiftly reaches out and seizes the criminal. Amidst the chaos of gunshots that punctuate the air and pepper the car’s roof, Spider-Man performs an agile leap, landing securely on the roof of a nearby passing truck. While balancing expertly on both feet, his gaze remains locked onto the stolen car, and he notices a bridge looming ahead. Seizing the opportunity, Spider-Man propels himself into the air, his body arching gracefully over the bridge, before alighting back onto the truck's roof. He propels himself again, this time launching onto the bonnet of the fleeing car, and with a powerful punch, he shatters the windscreen. The car careens off course, striking a bollard before ultimately crashing into a set of imposing iron gates. Behind the now-smashed vehicle, a crowd of police cars converges. Meanwhile, the carjacker manages to escape the wreckage and stealthily makes his way toward a darkened warehouse, his gun trembling uncertainly in his left hand. As he fumbles to reload the weapon, a shadow ominously looms above him, signaling he is surrounded. In a panic, he fires at the shifting silhouette, but in his frantic attempt to flee, he overlooks Spider-Man, who is lowering himself for a clearer view of the situation. As the thief reaches a locked door, Spider-Man catches up to him, forcefully smashing the thief's head into the glass panels of the door before hurling him across the room. Desperate, the car thief lunges at Spider-Man with a knife, but Spider-Man adeptly kicks it from his hand, the impact causing the thief's balaclava to be knocked away. Peter approaches, firmly gripping the man by the lapel, and suddenly recognizes him as the thief from the arena. The memory of allowing the man to pass and the haunting image of Uncle Ben lying on the ground flood back to him, prompting Peter to back away. Seeing this as an opportunity, the thief raises his gun, aiming it at Peter's forehead, but Peter swiftly knocks the gunman’s hand aside and deftly twists the thief's arm, causing the weapon to clatter to the ground. The thief stumbles backward, tripping and falling through a second-floor window, momentarily highlighted by a police spotlight. The light then traces downward to reveal where the thief has landed, facedown on the ground. From the enveloping darkness, Peter gazes at the scene below. The spotlight swings back to illuminate the window, casting Peter's features in sharp relief. Overwhelmed by horror, Peter turns away just as police officers swarm throughout the warehouse. With guns in one hand and torchlights in the other, they cautiously advance to the window, only to discover no one there. Outside, sitting with his elbows resting on his knees, Peter finds solace in the open air. A light breeze gently ruffles his short dark hair, his expression somber, and his eyes glistening with moisture. All around him, the myriad lights of New York spread out like a sea of stars. Eventually, he arrives at his home, opening the front door. Inside, enveloped in darkness, sits Aunt May, wrapped in her padded housecoat, exuding an air of quiet solitude."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Below, the hijacked car turns a corner, sending water into the air as the police pursue it. Above, Spider-Man gains on it, descending until he leaps onto the roof of his uncle's car and punches through it. He seizes the carjacker, who draws a gun, prompting Spider-Man to leap to the roof of a passing truck. Balancing on the truck, he keeps his focus on the stolen car as it moves toward a bridge. Spider-Man vaults across the bridge and lands back on the truck before launching onto the car's bonnet and smashing through the windscreen. The car swerves, crashes into a bollard, and finally into a set of iron gates, with police cars accumulating behind the wreckage. The carjacker escapes to a darkened warehouse, reloading his gun as a shadow encloses him. He fires at the shadow but fails to notice Spider-Man lowering himself nearby. Catching up at a locked door, Spider-Man slams the thief's head into the glass, flinging him across the room. The thief attacks with a knife, but Spider-Man disarms him, revealing his face. Recognizing him as the thief from the arena, Peter recalls Uncle Ben and steps back, allowing the thief to raise his gun. Peter deflects, disarming him and causing him to fall through a second-floor window. A police spotlight reveals where he's landed. Peter watches from the shadows, his features lit by the spotlight before he turns away in horror as the police swarm the warehouse, only to find no trace of him. Later, Peter sits in the open air, sadness in his eyes as the lights of New York glow below. He returns home, opening the front door to find Aunt May sitting in the darkness, wrapped in her housecoat."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Down below, the hijacked car takes a right, gliding behind him and sending water into the air from a recent rainstorm that had left the streets of New York City wet and slick. Still, the police, part of the NYPD known for their tenacity and resourcefulness, pursued the stolen car. Up above, Spider-Man, the superhero alias of Peter Parker who gained his powers from a radioactive spider bite, is gaining on. He comes lower and lower until he can leap out of the roof of his uncle's old Chrysler, a car filled with cherished memories, now caught in the chaos. He punches through it. Spider-Man grabs hold of the carjacker, who pulls a gun, a standard issue for such criminals in the city. As gunshots pepper the roof of the car, Spider-Man leaps up to the roof of a passing delivery truck carrying supplies across Manhattan. Balancing on both feet, he keeps his eyes firmly on the stolen car, and a bridge, the iconic Brooklyn Bridge renowned for its Gothic architecture, moves ahead. Spider-Man vaults into the air, across the bridge, and lands back on the roof of the truck. Spider-Man throws himself onto the car's bonnet and punches through the windscreen. The car swerves, hits a bollard, an obstacle designed to control road traffic, then crashes into a set of iron gates leading to a private estate. A posse of police cars builds up behind a smashed vehicle. The carjacker has made his escape from the vehicle and is creeping to a darkened warehouse, once a bustling hub during New York's industrial peak, his gun held shakily in his left hand. As he reloads his piece, a shadow looms above his head. He's been surrounded by the shadows cast by towering buildings. He shoots at the moving shadow. Trying to run from it, he fails to see Spider-Man lowering himself for a better look. At a locked door, Spider-Man catches up with him. He smashes the car thief's head into the glass panels on the door, a decades-old fixture, then sends him flying across the room. The thief lunges with a knife, a weapon of desperation, but Spider-Man kicks it from his grasp, knocking the balaclava off. Peter strides forward and grabs the man by the lapel. It's the thief from the wrestling arena, where Peter first let him escape, a decision that cost him his uncle's life. He remembers only too well letting the man pass and reflects on Uncle Ben lying on the ground, then backs away. The thief raises his gun and holds it to Peter's forehead. Peter knocks the hand away and twists the thief's arm, causing the gun to drop. The thief staggers back and trips. A police spotlight illuminates a second-floor window through which the thief has fallen, highlighting the stark industrial design of the warehouse. It moves down to pick out where he has landed face down. Peter gazes down from the darkness. The spotlight returns to the window, and his features lit up, Peter turns in horror. Police swarm all over the warehouse. They creep forward, guns held in one hand and torchlights in the other, standard procedure for dangerous urban confrontations. They reach the window to find no one there. Peter is sitting with his elbows resting on his knees out in the open air, a light breeze unique to autumn in the city ruffling his short dark hair, his face sad and his eyes moist. Around and beneath him, the lights of New York, a city that never sleeps. He opens the front door of his home in Queens, a modest two-story house. Inside, sitting in the darkness is Aunt May, wrapped in her padded housecoat, her face etched with the worry of recent events."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Down below the hijacked car takes a right gliding behind him and sending water into the air. Still the police pursued the stolen car. Up above SpiderMan is gaining on. He comes lower and lower until he can leap out of the roof of his uncle's car. He punches through it. SpiderMan grabs hold of the carjacker who pulls a gun. As gunshots pepper the roof of the car. SpiderMan leaps up to the roof of a passing truck. Balancing on both feet he keeps his eyes firmly on the stolen car and a bridge moves ahead. SpiderMan vaults into the air across the bridge and lands back on the roof of the truck. SpiderMan throws himself onto the car's bonnet and punches through the windscreen. The car swerves hits a bollard then crashes into a set of iron gates. A posse of police cars builds up behind a smashed vehicle. The carjacker has made his escape from the vehicle and is creeping to a darkened warehouse his gun held shakily in his left hand. As he reloads his piece a shadow looms above his head. He is been surrounded. He shoots at the moving shadow. Trying to run from it. he fails to see SpiderMan lowering himself for a better look. At a locked door SpiderMan catches up with him. He smashes the car thief's head into the glass panels on the door then sends him flying across the room. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. The thief lunges with a knife but SpiderMan kicks it from his grasp knocking the balaclava off. Peter strides forward and grabs the man by the lapel. It is the thief from the arena. He remembers only too well letting the man pass and reflects on Uncle Ben lying on the ground then backs away. The thief raises his gun and holds it to Peter's forehead. Peter knocks the hand away and twists the thief's arm causing the gun to drop. The thief staggers back and trips. A police spotlight illuminates a secondfloor window through which the thief has fallen. It moves down to pick out where he has landed. face down. Peter gazes down from the darkness. The spotlight returns to the window and his features lit up. Peter turns in horror. Police swarm all over the warehouse. They creep forward guns held in one hand and torchlights in the other. They reach the window to find no one there. Peter is sitting with his elbows resting on his knees out in the open air. a light breeze ruffling his short dark hair his face sad and his eyes moist. Around and beneath him the lights of New York. He opens the front door of his home. Inside sitting in the darkness is Aunt May wrapped in her padded housecoat."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Down below the hijacked car takes a right gliding behind him and sending water into the air. Still the police pursued the stolen car. Up above SpiderMan is gaining on. He comes lower and lower until he can leap out of the roof of his uncle's car. He punches through it. SpiderMan grabs hold of the carjacker who pulls a gun. As gunshots pepper the roof of the car. SpiderMan leaps up to the roof of a passing truck. Balancing on both feet he keeps his eyes firmly on the stolen car and a bridge moves ahead. SpiderMan vaults into the air across the bridge and lands back on the roof of the truck. SpiderMan throws himself onto the car's bonnet and punches through the windscreen. The car swerves hits a bollard then crashes into a set of iron gates. A posse of police cars builds up behind a smashed vehicle. The carjacker has made his escape from the vehicle and is creeping to a darkened warehouse his gun held shakily in his left hand. As he reloads his piece a shadow looms above his head. He is been surrounded. He shoots at the moving shadow. Trying to run from it. he fails to see SpiderMan lowering himself for a better look. At a locked door SpiderMan catches up with him. He smashes the car thief's head into the glass panels on the door then sends him flying across the room. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. The thief lunges with a knife but SpiderMan kicks it from his grasp knocking the balaclava off. Peter strides forward and grabs the man by the lapel. It is the thief from the arena. He remembers only too well letting the man pass and reflects on Uncle Ben lying on the ground then backs away. The thief raises his gun and holds it to Peter's forehead. Peter knocks the hand away and twists the thief's arm causing the gun to drop. The thief staggers back and trips. A police spotlight illuminates a secondfloor window through which the thief has fallen. It moves down to pick out where he has landed. face down. Peter gazes down from the darkness. The spotlight returns to the window and his features lit up. Peter turns in horror. Police swarm all over the warehouse. They creep forward guns held in one hand and torchlights in the other. They reach the window to find no one there. Peter is sitting with his elbows resting on his knees out in the open air. a light breeze ruffling his short dark hair his face sad and his eyes moist. Around and beneath him the lights of New York. He opens the front door of his home. Inside sitting in the darkness is Aunt May wrapped in her padded housecoat."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Down below the hijacked car takes a right gliding behind him and sending water into the air. Still the police pursued the stolen car. Up above SpiderMan is gaining on. He comes lower and lower until he can leap out of the roof of his uncle's car. He punches through it. SpiderMan grabs hold of the carjacker who pulls a gun. As gunshots pepper the roof of the car. SpiderMan leaps up to the roof of a passing truck. Balancing on both feet he keeps his eyes firmly on the stolen car and a bridge moves ahead. SpiderMan vaults into the air across the bridge and lands back on the roof of the truck. SpiderMan throws himself onto the car's bonnet and punches through the windscreen. The spotlight returns to the window and his features lit up. Peter turns in horror. Police swarm all over the warehouse. They creep forward guns held in one hand and torchlights in the other. They reach the window to find no one there. Peter is sitting with his elbows resting on his knees out in the open air. a light breeze ruffling his short dark hair his face sad and his eyes moist. Around and beneath him the lights of New York. He opens the front door of his home. Inside sitting in the darkness is Aunt May wrapped in her padded housecoat."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Down below the hijacked car takes a right gliding behind him and sending water into the air. Still the police pursued the stolen car. Up above SpiderMan is gaining on. He comes lower and lower until he can leap out of the roof of his uncle's car. He punches through it. a light breeze ruffling his short dark hair his face sad and his eyes moist. Around and beneath him the lights of New York. He opens the front door of his home. Inside sitting in the darkness is Aunt May wrapped in her padded housecoat."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "In the meadow, the runaway hoverboard veers left, floating behind the owl and splashing petals into the breeze. However, the astronauts chased the purloined hoverboard. In the sky above, Batman is losing ground. He swoops higher and higher until he can tumble out of the chimney of his aunt's blimp. He kicks through it. Batman snatches hold of the magician, who wields a wand. As sparks sprinkle the chimney of the blimp, Batman soars up to the chimney of a passing zeppelin. Balancing on both hands, he keeps his gaze firmly on the purloined hoverboard, and a mountain looms nearby. Batman dives into the air, over the mountain, and lands back on the chimney of the zeppelin. Batman hurls himself onto the hoverboard's dashboard and kicks through the goggles. The hoverboard veers, clips a lamppost, then collides with a series of wooden fences. A convoy of astronaut hovercrafts accumulates behind a shattered hoverboard. The magician has made his getaway from the hoverboard and is sneaking to a dimly lit barn, his broomstick held unsteadily in his right foot. As he charges his wand, a silhouette hovers beneath his feet. He's been encircled. He waves at the swimming silhouette. Attempting to leap from it, he fails to notice Batman rising for a closer view. At a rusty gate, Batman catches up with him. He shatters the wizard's nose against the metal bars on the gate, then sends him tumbling across the barn. The wizard dashes with a potion, but Batman kicks it from his clutches, dislodging the top hat. Clark ambles forward and clasps the woman by the scarf. It's the wizard from the stadium. He recalls vividly allowing the woman entry and ponders on Aunt May kneeling in the shadows, then turns away. The wizard brandishes her broomstick and points it at Clark's chest. Clark slaps the foot aside and twists the wizard's ankle, causing the broomstick to fall. The wizard reels back and fumbles. A janitor's lantern brightens a wooden ladder through which the wizard has tumbled. It shifts up to mark where she has settled knee first. Clark observes from the shadow. The lantern focuses on the ladder, and his expression illuminated, Clark shudders in panic. Astronauts fill every inch of the barn. They tiptoe forward, broomsticks clenched in one foot and lanterns in the other. They arrive at the ladder to find not a soul about. Clark is lounging with his forehead cupped on his palms out in the starry sky, a gentle gust rustling his long golden mane, his expression somber and his eyes glistening. Around and below him, the nightlife of Paris. He shuts the sliding door of his cabin. Within, lounging in the twilight is Uncle Joe, wrapped in his woolen shawl."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Down below, the hijacked car takes a right, spraying water as the police pursue it. Spider-Man catches up, leaping onto the car's roof and confronting the armed carjacker. As gunshots hit the car, Spider-Man jumps to a truck, vaults over a bridge, and lands back on the truck. He then throws himself onto the car's bonnet, causing it to crash into iron gates. The carjacker escapes to a warehouse, but Spider-Man follows, catching up at a locked door. After a brief struggle, Spider-Man disarms him and realizes the thief is the same one from the arena, remembering Uncle Ben. The thief raises a gun, but Spider-Man disarms him again, causing the thief to fall through a window. As police swarm the warehouse, they find no one there. Peter, sitting outside with the city lights below, returns home to find Aunt May waiting in the darkness."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Inside sitting in the darkness is Aunt May wrapped in her padded housecoat He opens the front door of his home Around and beneath him the lights of New York a light breeze ruffling his short dark hair his face sad and his eyes moist Peter is sitting with his elbows resting on his knees out in the open air They reach the window to find no one there They creep forward guns held in one hand and torchlights in the other Police swarm all over the warehouse Peter turns in horror The spotlight returns to the window and his features lit up Peter gazes down from the darkness face down It moves down to pick out where he has landed A police spotlight illuminates a secondfloor window through which the thief has fallen The thief staggers back and trips Peter knocks the hand away and twists the thief's arm causing the gun to drop The thief raises his gun and holds it to Peter's forehead He remembers only too well letting the man pass and reflects on Uncle Ben lying on the ground then backs away It is the thief from the arena Peter strides forward and grabs the man by the lapel The thief lunges with a knife but SpiderMan kicks it from his grasp knocking the balaclava off He smashes the car thief's head into the glass panels on the door then sends him flying across the room At a locked door SpiderMan catches up with him he fails to see SpiderMan lowering himself for a better look Trying to run from it He shoots at the moving shadow He is been surrounded As he reloads his piece a shadow looms above his head The carjacker has made his escape from the vehicle and is creeping to a darkened warehouse his gun held shakily in his left hand A posse of police cars builds up behind a smashed vehicle The car swerves hits a bollard then crashes into a set of iron gates SpiderMan throws himself onto the car's bonnet and punches through the windscreen SpiderMan vaults into the air across the bridge and lands back on the roof of the truck Balancing on both feet he keeps his eyes firmly on the stolen car and a bridge moves ahead SpiderMan leaps up to the roof of a passing truck As gunshots pepper the roof of the car SpiderMan grabs hold of the carjacker who pulls a gun He punches through it He comes lower and lower until he can leap out of the roof of his uncle's car Up above SpiderMan is gaining on Still the police pursued the stolen car Down below the hijacked car takes a right gliding behind him and sending water into the air"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Still the police pursued the stolen car Down below the hijacked car takes a right gliding behind him and sending water into the air He comes lower and lower until he can leap out of the roof of his uncle's car Up above SpiderMan is gaining on SpiderMan grabs hold of the carjacker who pulls a gun He punches through it SpiderMan leaps up to the roof of a passing truck As gunshots pepper the roof of the car SpiderMan vaults into the air across the bridge and lands back on the roof of the truck Balancing on both feet he keeps his eyes firmly on the stolen car and a bridge moves ahead The car swerves hits a bollard then crashes into a set of iron gates SpiderMan throws himself onto the car's bonnet and punches through the windscreen The carjacker has made his escape from the vehicle and is creeping to a darkened warehouse his gun held shakily in his left hand A posse of police cars builds up behind a smashed vehicle He is been surrounded As he reloads his piece a shadow looms above his head Trying to run from it He shoots at the moving shadow At a locked door SpiderMan catches up with him he fails to see SpiderMan lowering himself for a better look The thief lunges with a knife but SpiderMan kicks it from his grasp knocking the balaclava off He smashes the car thief's head into the glass panels on the door then sends him flying across the room It is the thief from the arena Peter strides forward and grabs the man by the lapel The thief raises his gun and holds it to Peter's forehead He remembers only too well letting the man pass and reflects on Uncle Ben lying on the ground then backs away The thief staggers back and trips Peter knocks the hand away and twists the thief's arm causing the gun to drop It moves down to pick out where he has landed A police spotlight illuminates a secondfloor window through which the thief has fallen Peter gazes down from the darkness face down Peter turns in horror The spotlight returns to the window and his features lit up They creep forward guns held in one hand and torchlights in the other Police swarm all over the warehouse Peter is sitting with his elbows resting on his knees out in the open air They reach the window to find no one there Around and beneath him the lights of New York a light breeze ruffling his short dark hair his face sad and his eyes moist Inside sitting in the darkness is Aunt May wrapped in her padded housecoat He opens the front door of his home"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The thief lunges with a knife but SpiderMan kicks it from his grasp knocking the balaclava off Peter strides forward and grabs the man by the lapel It is the thief from the arena He remembers only too well letting the man pass and reflects on Uncle Ben lying on the ground then backs away The thief raises his gun and holds it to Peter's forehead Peter knocks the hand away and twists the thief's arm causing the gun to drop The thief staggers back and trips A police spotlight illuminates a secondfloor window through which the thief has fallen It moves down to pick out where he has landed face down Peter gazes down from the darkness The spotlight returns to the window and his features lit up Peter turns in horror Police swarm all over the warehouse They creep forward guns held in one hand and torchlights in the other They reach the window to find no one there Peter is sitting with his elbows resting on his knees out in the open air a light breeze ruffling his short dark hair his face sad and his eyes moist Around and beneath him the lights of New York He opens the front door of his home Inside sitting in the darkness is Aunt May wrapped in her padded housecoat Down below the hijacked car takes a right gliding behind him and sending water into the air Still the police pursued the stolen car Up above SpiderMan is gaining on He comes lower and lower until he can leap out of the roof of his uncle's car He punches through it SpiderMan grabs hold of the carjacker who pulls a gun As gunshots pepper the roof of the car SpiderMan leaps up to the roof of a passing truck Balancing on both feet he keeps his eyes firmly on the stolen car and a bridge moves ahead SpiderMan vaults into the air across the bridge and lands back on the roof of the truck SpiderMan throws himself onto the car's bonnet and punches through the windscreen The car swerves hits a bollard then crashes into a set of iron gates A posse of police cars builds up behind a smashed vehicle The carjacker has made his escape from the vehicle and is creeping to a darkened warehouse his gun held shakily in his left hand As he reloads his piece a shadow looms above his head He is been surrounded He shoots at the moving shadow Trying to run from it he fails to see SpiderMan lowering himself for a better look At a locked door SpiderMan catches up with him He smashes the car thief's head into the glass panels on the door then sends him flying across the room"
        }
      ]
    }
  ]
}