{
  "ground_truth": "As he enters, she rises, crosses over to him, and throws her arms around his neck. Standing by the front door, he hugs her tight. At Quest Proving Grounds, bunker six, a car draws up, and General Slocum emerges from it. The two men move into the bunker, and the exoskeleton is powered up. Captain Curtis stands upright inside the 10-foot-tall rocket as it lifts off. A green fireball flies towards the bunker, resulting in total destruction. At the graduation, Peter's classes photograph, and Harry turns to his father. Father and son shake hands, as Peter, in his mortarboard and gown, stands awkwardly. They spot MJ with Flash and part. Peter nods his head stiffly and manages a weak smile. Later, he and Aunt May arrive home, with Peter in a suit, shirt, and tie, and Aunt May in a floral suit, hat, and carrying her gloves. Peter turns and charges sturdily up the stairs to his room, while Aunt May takes a few paces forward, her head tilted to one side, and watches with a sad and witty face until he disappears. That night, he's sitting up in his bedroom, his tie loosened a little but still on, with tears rolling slowly down his cheeks as he gazes distantly ahead. Aunt May, in her dressing gown, comes to the doorway and softly comes in, sitting down next to her nephew on the bed with her hands on her lap. He acknowledges her presence with a hint of a smile as she leans close to him, placing her hands on his shoulders. He smiles, and Aunt May rises, puts her right hand on his left shoulder, gently squeezes it, and goes. Peter sits deep in thought, then a sparkle comes into his eyes. Inside a small case is a sweatshirt with a spider and web motif, and underneath it is a sketchpad with the original snug-fitting Spider-Man outfit: blue body stocking, a hooded mask, red and black checked shoulder pants, and the chest, with a large black spider in the center. The New York City streets host a delicatessen run by an Oriental couple who are being held up. As two robbers make their escape, Spider-Man swoops down on them, returns the stolen money, and thrusts the two robbers up on a giant spider's web. A girl is being robbed at gunpoint, and then the front page of the Daily Bugle is shown. MJ, in a waitress outfit, walks out of the Moon Dance Diner, putting on her coat, as Peter is on the sidewalk and senses her presence. He turns, chases after her, and they look awkwardly at each other as Enrique heads back to the diner. MJ opens her coat to let Peter see her uniform.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "As he enters, she rises, traverses over to him, and flings her arms around his neck. Standing by the front portal, he embraces her tight. At Quest Testing Grounds, bunker six, an automobile draws up, and General Slocum emerges from it. The two men move into the bunker, and the exoskeleton is energized. Captain Curtis stands erect inside the 10-foot-tall missile as it ascends. A green fireball hurtles towards the bunker, resulting in complete annihilation. At the graduation, Peter's classes photograph, and Harry turns to his father. Father and son shake hands, as Peter, in his mortarboard and gown, stands awkwardly. They spot MJ with Flash and part. Peter nods his head stiffly and manages a feeble grin. Later, he and Aunt May arrive home, with Peter in a suit, shirt, and tie, and Aunt May in a floral suit, hat, and carrying her gloves. Peter turns and charges sturdily up the stairs to his room, while Aunt May takes a few strides forward, her head tilted to one side, and watches with a melancholy and witty visage until he vanishes. That night, he's sitting up in his bedroom, his tie loosened a little but still on, with tears rolling slowly down his cheeks as he gazes distantly ahead. Aunt May, in her dressing gown, comes to the doorway and softly enters, sitting down next to her nephew on the bed with her hands on her lap. He acknowledges her presence with a hint of a grin as she leans close to him, placing her hands on his shoulders. He smiles, and Aunt May rises, puts her right hand on his left shoulder, gently squeezes it, and departs. Peter sits deep in thought, then a twinkle comes into his eyes. Inside a small case is a sweatshirt with a spider and web motif, and underneath it is a sketchpad with the original snug-fitting Spider-Man garment: blue body stocking, a hooded mask, red and black checked shoulder pants, and the chest, with a large black spider in the center. The New York City thoroughfares host a delicatessen run by an Oriental couple who are being held up. As two robbers make their escape, Spider-Man swoops down on them, returns the stolen funds, and thrusts the two robbers up on a giant spider's web. A girl is being robbed at gunpoint, and then the front page of the Daily Bugle is shown. MJ, in a waitress attire, walks out of the Moon Dance Diner, putting on her coat, as Peter is on the pavement and senses her presence. He turns, chases after her, and they look awkwardly at each other as Enrique heads back to the diner. MJ opens her coat to let Peter see her uniform."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "As he enters, she rises, crosses over to him, and throws her arms around his neck. Standing by the front door, he is hugged tightly by her. At Quest Proving Grounds, bunker six, a car draws up, and from it emerges General Slocum. The two men move into the bunker, and the exoskeleton powers up. Captain Curtis is stood upright inside the 10-foot-tall rocket as it lifts off. A green fireball flies towards the bunker, resulting in total destruction. At the graduation, Peter photographs the classes, and Harry turns to his father. Father and son shake hands, as Peter, in his mortarboard and gown, stands awkwardly. They spot MJ with Flash and part. Peter's head is nodded stiffly, and a weak smile is managed by him. Later, he and Aunt May arrive home, with Peter in a suit, shirt, and tie, and Aunt May in a floral suit, hat, and carrying her gloves. Peter turns and charges sturdily up the stairs to his room, while a few paces are taken forward by Aunt May, her head tilted to one side, and she watches with a sad and witty face until he disappears. That night, he's sitting up in his bedroom, his tie loosened a little but still on, with tears rolling slowly down his cheeks as he gazes distantly ahead. Aunt May, in her dressing gown, comes to the doorway and enters softly, sitting down next to her nephew on the bed with her hands on her lap. Her presence is acknowledged by him with a hint of a smile as she leans close to him, placing her hands on his shoulders. He smiles, and by Aunt May, his left shoulder is touched with her right hand, gently squeezed, and then she goes. Peter sits deep in thought, then a sparkle comes into his eyes. Inside a small case is placed a sweatshirt with a spider and web motif, and underneath it is a sketchpad containing the original snug-fitting Spider-Man outfit: blue body stocking, a hooded mask, red and black checked shoulder pants, and the chest, with a large black spider in the center. The New York City streets are hosting a delicatessen run by an Oriental couple who are being held up. As two robbers make their escape, Spider-Man swoops down on them, returns the stolen money, and the two robbers are thrust up on a giant spider's web. A girl is being robbed at gunpoint, and then the front page of the Daily Bugle is shown. MJ, in a waitress outfit, walks out of the Moon Dance Diner, putting on her coat, as Peter is on the sidewalk and senses her presence. He turns, chases after her, and awkward looks are exchanged between them as Enrique heads back to the diner. MJ opens her coat to let Peter see her uniform."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "As he enters, she rises, crosses to him, and embraces him. Standing by the door, he hugs her tightly. At Quest Proving Grounds, bunker six, a car arrives, and General Slocum steps out. The men enter the bunker, powering up the exoskeleton. Captain Curtis stands inside the 10-foot rocket as it launches. A green fireball hits the bunker, causing total destruction. At graduation, Peter's class is photographed, and Harry turns to his father. They shake hands as Peter, in his cap and gown, stands awkwardly. They see MJ with Flash and part ways. Peter nods stiffly, managing a weak smile. Later, he and Aunt May return home, Peter in a suit and tie, Aunt May in a floral suit and hat. Peter charges up the stairs to his room, while Aunt May watches with a sad, witty expression until he disappears. That night, he sits in his room, tie loosened, tears rolling down his cheeks. Aunt May, in her dressing gown, enters softly, sits beside him, and places her hands on his shoulders. He acknowledges her with a slight smile. She rises, gently squeezes his shoulder, and leaves. Peter sits in thought, then a sparkle appears in his eyes. Inside a small case is a sweatshirt with a spider motif and a sketchpad with the original Spider-Man outfit: blue body stocking, hooded mask, red and black checked shoulder pants, and a large black spider on the chest. In New York City, an Oriental couple's delicatessen is held up. As robbers escape, Spider-Man swoops down, returns the money, and traps them in a giant web. A girl is robbed at gunpoint, then the Daily Bugle's front page is shown. MJ, in a waitress outfit, exits the Moon Dance Diner, putting on her coat, as Peter senses her presence. He turns, chases her, and they look awkwardly at each other as Enrique returns to the diner. MJ opens her coat to show Peter her uniform."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "As she rises and hugs him at the door, General Slocum arrives at Quest Proving Grounds, bunker six. Inside, the exoskeleton powers up, and Captain Curtis stands in the 10-foot rocket as it lifts off. A green fireball destroys the bunker. At graduation, Peter's class is photographed, and Harry shakes hands with his father. Peter, in his gown, stands awkwardly, nods at MJ with Flash, and smiles weakly. Later, Peter and Aunt May arrive home; he in a suit, she in a floral outfit. Peter charges upstairs, while Aunt May watches with a sad smile. That night, Peter sits in his room, tie loosened, tears falling. Aunt May enters, sits beside him, and he smiles faintly. She squeezes his shoulder and leaves. Peter, deep in thought, finds a case with a Spider-Man outfit. In New York, Spider-Man stops a robbery, returning money and trapping robbers in a web. A girl is robbed at gunpoint, and the Daily Bugle's front page is shown. MJ, in a waitress outfit, leaves the Moon Dance Diner. Peter senses her, chases after her, and they exchange awkward glances as Enrique returns to the diner. MJ shows Peter her uniform."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As he makes his entrance, she immediately rises from her seat, crosses the room to reach him, and joyfully throws her arms around his neck in a warm embrace. Standing right by the front door, he reciprocates by hugging her tightly. Meanwhile, at the Quest Proving Grounds, specifically at bunker six, a car pulls up, and General Slocum steps out of it. The two men proceed to move into the bunker, where the exoskeleton is powered up with precision. Inside the towering 10-foot-tall rocket, Captain Curtis stands upright as it begins its ascent. Suddenly, a green fireball hurtles towards the bunker, leading to its complete and utter destruction. At the graduation ceremony, Peter's class is being photographed, and Harry turns to face his father. The father and son share a handshake, while Peter, dressed in his mortarboard and gown, stands somewhat awkwardly. They notice MJ with Flash and decide to part ways. Peter nods his head stiffly and manages to muster a weak smile. Later on, he and Aunt May arrive back home, with Peter dressed in a suit, shirt, and tie, and Aunt May wearing a floral suit, a hat, and carrying her gloves. Peter turns and charges sturdily up the stairs to his room, while Aunt May takes a few steps forward, her head tilted to one side, watching with a sad yet witty expression until he disappears from view. That night, he sits up in his bedroom, his tie slightly loosened but still on, with tears slowly rolling down his cheeks as he gazes distantly ahead. Aunt May, now in her dressing gown, comes to the doorway and softly enters, sitting down next to her nephew on the bed with her hands resting on her lap. He acknowledges her presence with a faint smile as she leans in close to him, placing her hands gently on his shoulders. He smiles, and Aunt May rises, placing her right hand on his left shoulder, giving it a gentle squeeze before leaving. Peter sits deep in thought, and then a sparkle appears in his eyes. Inside a small case lies a sweatshirt adorned with a spider and web motif, and underneath it is a sketchpad containing the original snug-fitting Spider-Man outfit: a blue body stocking, a hooded mask, red and black checked shoulder pants, and the chest, featuring a large black spider prominently in the center. The bustling streets of New York City are home to a delicatessen run by an Oriental couple who are being held up. As two robbers make their escape, Spider-Man swoops down on them, returns the stolen money, and hoists the two robbers up onto a giant spider's web. A girl is being robbed at gunpoint, and then the front page of the Daily Bugle is shown. MJ, dressed in a waitress outfit, exits the Moon Dance Diner, putting on her coat, as Peter stands on the sidewalk and senses her presence. He turns, chases after her, and they exchange awkward glances as Enrique heads back to the diner. MJ opens her coat to reveal her uniform to Peter."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As he gracefully makes his entrance, she immediately rises from her seat with excitement, enthusiastically crossing the room to reach him, and joyfully, with a burst of emotion, throws her arms around his neck in a warm and affectionate embrace. Standing right there by the front door, he reciprocates her gesture by hugging her tightly, showing equal affection. Meanwhile, at the Quest Proving Grounds, particularly at the location known as bunker six, a car pulls up seamlessly, and General Slocum steps out of it in a composed manner. The two men, with steady resolve, proceed to move into the bunker, where they carefully and precisely power up the exoskeleton. Inside the impressive towering 10-foot-tall rocket, Captain Curtis stands upright just as it begins its ascent. Suddenly and without warning, a green, fiery fireball hurtles towards the bunker, leading to its complete and utter destruction with devastating force. \n\nAt the graduation ceremony, Peter's class is in the process of being photographed, and during this moment, Harry turns to face his father. The father and son share a significant handshake, while Peter, dressed in his mortarboard and gown, stands somewhat awkwardly, feeling slightly out of place. They both notice MJ with Flash nearby and make the decision to part ways. Peter nods his head stiffly, summoning the courage to muster a weak smile. Later on, he and Aunt May arrive back home. Peter is dressed in a formal suit, with a shirt and tie, while Aunt May wears a floral-patterned suit, a stylish hat, and carries her gloves in her hand. Peter turns and charges sturdily up the stairs leading to his room, while Aunt May takes a few steps forward, her head tilted slightly to one side, watching him with a sad yet witty expression lingering on her face until he disappears from view. \n\nThat night, he sits up in his bedroom, with his tie slightly loosened but still draped around his neck, and tears slowly roll down his cheeks as he gazes distantly ahead, lost in his thoughts. Aunt May, now dressed in her comfortable dressing gown, comes quietly to the doorway and softly enters the room. She sits down next to her nephew on the bed, with her hands resting gently on her lap. He acknowledges her presence with a faint smile as she leans in close to him, placing her hands gently on his shoulders. He smiles, and then Aunt May rises, placing her right hand with affection on his left shoulder, giving it a gentle squeeze before she leaves the room. Peter sits deep in thought, and then a sparkle appears in his eyes. Inside a small case lies a sweatshirt adorned with a spider and web motif, and nestled underneath it is a sketchpad containing the original snug-fitting Spider-Man outfit: a blue body stocking, a hooded mask, red and black checked shoulder pants, and a chest featuring a large black spider prominently in the center.\n\nThe bustling streets of New York City are home to a well-known delicatessen, run by an Oriental couple who are being held up by robbers. As two robbers make their escape, Spider-Man swoops down on them with agility and speed, returns the stolen money to its rightful owners, and hoists the two robbers up onto a large, suspended spider's web. A girl is being robbed at gunpoint, and then the front page of the Daily Bugle is vividly shown. MJ, dressed in a waitress outfit, exits the Moon Dance Diner, putting on her coat as she does so, while Peter stands on the sidewalk and senses her presence nearby. He turns around, chases after her, and they exchange awkward glances as Enrique heads back to the diner. MJ then opens her coat to reveal her uniform to Peter, creating a moment between them."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As he steps into the room, she immediately rises from her seat, moves across the space towards him, and enthusiastically throws her arms around his neck, pulling him into a warm embrace. Standing together by the front door, he reciprocates by wrapping his arms around her, holding her tightly. Meanwhile, at Quest Proving Grounds, specifically at bunker six, a car approaches and comes to a halt, allowing General Slocum to step out. The two men proceed to enter the bunker, where they initiate the process of powering up the exoskeleton. Inside the 10-foot-tall rocket, Captain Curtis stands upright as the rocket begins its ascent. Suddenly, a green fireball hurtles towards the bunker, leading to its complete destruction. At the graduation ceremony, Peter's class gathers for a photograph, during which Harry turns to face his father. The father and son engage in a handshake, while Peter, donned in his mortarboard and gown, stands nearby, feeling somewhat awkward. They notice MJ with Flash and decide to part ways. Peter nods his head stiffly, managing to produce a weak smile. Later, Peter and Aunt May return home, with Peter dressed in a suit, shirt, and tie, and Aunt May wearing a floral suit, hat, and carrying her gloves. Peter turns and energetically charges up the stairs to his room, while Aunt May takes a few steps forward, her head tilted to one side, watching him with a sad yet witty expression until he disappears from view. That night, Peter sits up in his bedroom, his tie slightly loosened but still on, as tears slowly roll down his cheeks while he gazes distantly ahead. Aunt May, now in her dressing gown, approaches the doorway and gently enters the room, sitting down beside her nephew on the bed with her hands resting on her lap. He acknowledges her presence with a faint smile as she leans in closer, placing her hands on his shoulders. He smiles back, prompting Aunt May to rise, place her right hand on his left shoulder, give it a gentle squeeze, and then leave the room. Peter remains seated, lost in thought, until a sparkle appears in his eyes. He opens a small case to reveal a sweatshirt adorned with a spider and web motif, and beneath it lies a sketchpad containing the original design for the snug-fitting Spider-Man outfit: a blue body stocking, a hooded mask, red and black checked shoulder pants, and a chest emblazoned with a large black spider in the center. On the bustling streets of New York City, an Oriental couple runs a delicatessen that is being held up. As two robbers attempt to flee, Spider-Man swoops down upon them, retrieves the stolen money, and secures the two robbers onto a giant spider's web. A girl is being robbed at gunpoint, and then the front page of the Daily Bugle is displayed. MJ, dressed in a waitress outfit, exits the Moon Dance Diner while putting on her coat, as Peter stands on the sidewalk and senses her presence. He turns around, chases after her, and they exchange awkward glances as Enrique heads back into the diner. MJ opens her coat to reveal her uniform to Peter."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As he enters, she rises to embrace him warmly by the front door. At Quest Proving Grounds, General Slocum arrives and joins another man in the bunker, where they power up the exoskeleton. Captain Curtis stands inside the 10-foot-tall rocket as it launches, but a green fireball destroys the bunker. At the graduation, Peter's class is photographed, and Harry shakes hands with his father. Peter, in his graduation attire, stands awkwardly as they notice MJ with Flash and part ways. Peter nods stiffly and manages a weak smile. Later, he and Aunt May return home, dressed formally. Peter heads upstairs while Aunt May watches him with a sad, witty expression. That night, Peter sits in his room, tie loosened, tears rolling down his cheeks. Aunt May enters softly, sits beside him, and offers comfort with a gentle touch. Peter acknowledges her with a smile, and she leaves after a reassuring squeeze on his shoulder. Deep in thought, Peter's eyes sparkle as he examines a case containing a Spider-Man sweatshirt and a sketchpad with his original costume design. In New York City, Spider-Man thwarts a robbery at a delicatessen, returning the stolen money and capturing the robbers in a giant web. A girl is robbed at gunpoint, and the Daily Bugle's front page is shown. MJ exits the Moon Dance Diner in her waitress outfit, putting on her coat. Peter, sensing her presence, turns and chases after her. They exchange awkward glances as Enrique returns to the diner, and MJ reveals her uniform to Peter."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "As he enters, she rises, crosses over to him, and throws her arms around his neck. Standing by the front door, which is adorned with a wreath indicating the fall season, he hugs her tight. At Quest Proving Grounds, a top-secret military testing facility located on the outskirts of the city, bunker six, a car draws up, and General Slocum, a senior military official known for his strategic brilliance during international conflicts, emerges from it. The two men move into the bunker, and the exoskeleton, a cutting-edge piece of technology designed to enhance human capabilities for military purposes, is powered up. Captain Curtis stands upright inside the 10-foot-tall rocket as it lifts off, a marvel of aerospace engineering designed for rapid deployment. A green fireball, reminiscent of experimental energy weapons, flies towards the bunker, resulting in total destruction reminiscent of high-stakes military experiments. At the graduation, Peter's classes photograph captures the culmination of years of academic effort, and Harry turns to his father, a wealthy businessman with major investments in scientific research and development. Father and son shake hands, as Peter, in his mortarboard and gown, stands awkwardly, contemplating the future that awaits him. They spot MJ with Flash, a popular figure at school known for his athletic prowess, and part ways. Peter nods his head stiffly and manages a weak smile. Later, he and Aunt May arrive home, with Peter in a suit, shirt, and tie, evoking the formal event's atmosphere, and Aunt May in a floral suit, hat, and carrying her gloves, reflecting her timeless fashion sense. Peter turns and charges sturdily up the stairs to his room, an upper sanctuary filled with posters of scientific heroes, while Aunt May takes a few paces forward, her head tilted to one side, and watches with a sad and witty face until he disappears. That night, he's sitting up in his bedroom, his tie loosened a little but still on, with tears rolling slowly down his cheeks as he gazes distantly ahead, lost in a sea of bittersweet memories. Aunt May, in her dressing gown made of soft cotton, comes to the doorway and softly comes in, sitting down next to her nephew on the bed with her hands on her lap. He acknowledges her presence with a hint of a smile as she leans close to him, placing her hands on his shoulders in a comforting gesture. He smiles, and Aunt May rises, puts her right hand on his left shoulder, gently squeezes it, and goes, leaving behind an aura of warmth and understanding. Peter sits deep in thought, then a sparkle comes into his eyes as a realization dawns. Inside a small case is a sweatshirt with a spider and web motif, a symbol of his secret alter-ego, and underneath it is a sketchpad with the original snug-fitting Spider-Man outfit: blue body stocking, a hooded mask, red and black checked shoulder pants, and the chest, with a large black spider in the center, a design that would become iconic in superhero lore. The New York City streets, bustling with energy and diversity, host a delicatessen run by an Oriental couple who are being held up, a grim reminder of urban crime. As two robbers make their escape, Spider-Man swoops down on them, exhibiting his acrobatic skills, returns the stolen money, and thrusts the two robbers up on a giant spider's web, creating an impromptu spectacle for onlookers. A girl is being robbed at gunpoint, and then the front page of the Daily Bugle, a newspaper notorious for its sensational headlines, is shown. MJ, in a waitress outfit reminiscent of 1950s diner attire, walks out of the Moon Dance Diner, a retro themed eatery with a neon sign, putting on her coat, as Peter is on the sidewalk and senses her presence, a heightened perception honed by his abilities. He turns, chases after her, and they look awkwardly at each other as Enrique, a regular customer known for his quirky tips, heads back to the diner. MJ opens her coat to let Peter see her uniform, a gesture indicating both vulnerability and familiarity."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "As he enters she rises crosses over to him and throws her arms around his neck. Standing by the front door he hugs her tight. At Quest Proving Grounds bunker six a car draws up and General Slocum emerges from it. The two men move into the bunker and the exoskeleton is powered up. Captain Curtis stands upright inside the 10foottall rocket as it lifts off. A green fireball flies towards the bunker resulting in total destruction. At the graduation Peter's classes photograph and Harry turns to his father. Father and son shake hands as Peter in his mortarboard and gown stands awkwardly. They spot MJ with Flash and part. Peter nods his head stiffly and manages a weak smile. Later he and Aunt May arrive home with Peter in a suit shirt and tie and Aunt May in a floral suit hat and carrying her gloves. Peter turns and charges sturdily up the stairs to his room while Aunt May takes a few paces forward her head tilted to one side and watches with a sad and witty face until he disappears. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. That night he is sitting up in his bedroom his tie loosened a little but still on with tears rolling slowly down his cheeks as he gazes distantly ahead. Aunt May in her dressing gown comes to the doorway and softly comes in sitting down next to her nephew on the bed with her hands on her lap. He acknowledges her presence with a hint of a smile as she leans close to him placing her hands on his shoulders. He smiles and Aunt May rises puts her right hand on his left shoulder gently squeezes it and goes. Peter sits deep in thought then a sparkle comes into his eyes. Inside a small case is a sweatshirt with a spider and web motif and underneath it is a sketchpad with the original snugfitting SpiderMan outfit blue body stocking a hooded mask red and black checked shoulder pants and the chest with a large black spider in the center. The New York City streets host a delicatessen run by an Oriental couple who are being held up. As two robbers make their escape SpiderMan swoops down on them returns the stolen money and thrusts the two robbers up on a giant spider's web. A girl is being robbed at gunpoint and then the front page of the Daily Bugle is shown. MJ in a waitress outfit walks out of the Moon Dance Diner putting on her coat as Peter is on the sidewalk and senses her presence. He turns chases after her and they look awkwardly at each other as Enrique heads back to the diner. MJ opens her coat to let Peter see her uniform."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "As he enters she rises crosses over to him and throws her arms around his neck. Standing by the front door he hugs her tight. At Quest Proving Grounds bunker six a car draws up and General Slocum emerges from it. The two men move into the bunker and the exoskeleton is powered up. Captain Curtis stands upright inside the 10foottall rocket as it lifts off. A green fireball flies towards the bunker resulting in total destruction. At the graduation Peter's classes photograph and Harry turns to his father. Father and son shake hands as Peter in his mortarboard and gown stands awkwardly. They spot MJ with Flash and part. Peter nods his head stiffly and manages a weak smile. Later he and Aunt May arrive home with Peter in a suit shirt and tie and Aunt May in a floral suit hat and carrying her gloves. Peter turns and charges sturdily up the stairs to his room while Aunt May takes a few paces forward her head tilted to one side and watches with a sad and witty face until he disappears. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. That night he is sitting up in his bedroom his tie loosened a little but still on with tears rolling slowly down his cheeks as he gazes distantly ahead. Aunt May in her dressing gown comes to the doorway and softly comes in sitting down next to her nephew on the bed with her hands on her lap. He acknowledges her presence with a hint of a smile as she leans close to him placing her hands on his shoulders. He smiles and Aunt May rises puts her right hand on his left shoulder gently squeezes it and goes. Peter sits deep in thought then a sparkle comes into his eyes. Inside a small case is a sweatshirt with a spider and web motif and underneath it is a sketchpad with the original snugfitting SpiderMan outfit blue body stocking a hooded mask red and black checked shoulder pants and the chest with a large black spider in the center. The New York City streets host a delicatessen run by an Oriental couple who are being held up. As two robbers make their escape SpiderMan swoops down on them returns the stolen money and thrusts the two robbers up on a giant spider's web. A girl is being robbed at gunpoint and then the front page of the Daily Bugle is shown. MJ in a waitress outfit walks out of the Moon Dance Diner putting on her coat as Peter is on the sidewalk and senses her presence. He turns chases after her and they look awkwardly at each other as Enrique heads back to the diner. MJ opens her coat to let Peter see her uniform."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "As he enters she rises crosses over to him and throws her arms around his neck. Standing by the front door he hugs her tight. At Quest Proving Grounds bunker six a car draws up and General Slocum emerges from it. The two men move into the bunker and the exoskeleton is powered up. Captain Curtis stands upright inside the 10foottall rocket as it lifts off. A green fireball flies towards the bunker resulting in total destruction. The New York City streets host a delicatessen run by an Oriental couple who are being held up. As two robbers make their escape SpiderMan swoops down on them returns the stolen money and thrusts the two robbers up on a giant spider's web. A girl is being robbed at gunpoint and then the front page of the Daily Bugle is shown. MJ in a waitress outfit walks out of the Moon Dance Diner putting on her coat as Peter is on the sidewalk and senses her presence. He turns chases after her and they look awkwardly at each other as Enrique heads back to the diner. MJ opens her coat to let Peter see her uniform."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "As he enters she rises crosses over to him and throws her arms around his neck. Standing by the front door he hugs her tight. At Quest Proving Grounds bunker six a car draws up and General Slocum emerges from it. He turns chases after her and they look awkwardly at each other as Enrique heads back to the diner. MJ opens her coat to let Peter see her uniform."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "As the owl soars, the robot tumbles, hovers over to the owl, and tosses its gears around the owl's perch. Hovering near the back gate, the owl twirls the robot loosely. At Discovery Playground, tent two, a bicycle glides in, and Professor Nimbus hops from it. The pair of foxes dash into the tent, and the hoverboard is activated. Lieutenant Sparrow floats calmly inside the 30-foot-high kite as it takes off. A purple comet darts towards the tent, causing absolute chaos. At the ceremony, Alex's flowers illustrate, and Jamie rotates to their cousin. Cousin and aunt high-five, as Alex, in their top hat and blazer, stands confidently. They glimpse Lina with Storm and separate. Alex tilts their head quickly and musters a lively grin. Moments later, they and Uncle Joe reach the garden, with Alex in a tuxedo, vest, and scarf, and Uncle Joe in a paisley suit, beret, and holding his briefcase. Alex spins and strolls nimbly down the hill to his cabin, while Uncle Joe steps a few feet backward, his gaze lifted to the stars, and observes with a joyful and thoughtful demeanor until Alex vanishes. That afternoon, Alex is lying down in his cabin, his scarf tightened slightly but still on, with raindrops trickling smoothly along his nose as he stares thoughtfully above. Uncle Joe, in his lounge wear, approaches the entrance and gently waltzes in, reclining next to his niece on the floor with his paws on his lap. Alex greets his presence with a glimpse of a frown as Uncle Joe leans away from him, placing his paws on his knees. Alex frowns, and Uncle Joe tumbles, puts his left paw on Alex’s right knee, gently pats it, and sails. Alex stands high in reflection, then an echo emerges into his forehead. Inside a vast chest is a cloak with a beetle and vine pattern, and underneath it is a canvas with the initial loose-fitting Batgirl attire: red legwear, a pointed hood, green and orange speckled elbow boots, and the belly, with a large orange beetle at the edge. The Parisian avenues accommodate a bakery led by a European family who are being terrorized. As two vagabonds dash their flight, Batgirl glides over them, retrieves the borrowed jewels, and catapults the two vagabonds atop a minuscule beetle’s net. A boy is being assisted with samurai armor, and then the back section of the Daily Planet is revealed. Lina, in a dancer's outfit, skips out of the Starry Night Diner, placing on her backpack, as Alex is on the beach and senses her aura. He pivots, dances toward her, and they gaze happily at one another as Leonardo strides back to the diner. Lina closes her backpack to let Alex glimpse her disguise."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "As he enters, she embraces him. At Quest Proving Grounds, General Slocum arrives, and Captain Curtis powers up a rocket. A green fireball destroys the bunker. At graduation, Peter awkwardly stands in his gown beside Harry and his father. Later, Peter and Aunt May return home, and he retreats to his room, deeply emotional. Aunt May comforts him, and he eventually finds inspiration in a Spider-Man outfit sketch. In New York City, Spider-Man foils a robbery, capturing the thieves on a giant web. MJ, working at the Moon Dance Diner, encounters Peter as they awkwardly reunite."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "MJ opens her coat to let Peter see her uniform He turns chases after her and they look awkwardly at each other as Enrique heads back to the diner  MJ in a waitress outfit walks out of the Moon Dance Diner putting on her coat as Peter is on the sidewalk and senses her presence  A girl is being robbed at gunpoint and then the front page of the Daily Bugle is shown  As two robbers make their escape SpiderMan swoops down on them returns the stolen money and thrusts the two robbers up on a giant spider's web  The New York City streets host a delicatessen run by an Oriental couple who are being held up  Inside a small case is a sweatshirt with a spider and web motif and underneath it is a sketchpad with the original snugfitting SpiderMan outfit blue body stocking a hooded mask red and black checked shoulder pants and the chest with a large black spider in the center  Peter sits deep in thought then a sparkle comes into his eyes  He smiles and Aunt May rises puts her right hand on his left shoulder gently squeezes it and goes  He acknowledges her presence with a hint of a smile as she leans close to him placing her hands on his shoulders  Aunt May in her dressing gown comes to the doorway and softly comes in sitting down next to her nephew on the bed with her hands on her lap  That night he's sitting up in his bedroom his tie loosened a little but still on with tears rolling slowly down his cheeks as he gazes distantly ahead  Peter turns and charges sturdily up the stairs to his room while Aunt May takes a few paces forward her head tilted to one side and watches with a sad and witty face until he disappears  Later he and Aunt May arrive home with Peter in a suit shirt and tie and Aunt May in a floral suit hat and carrying her gloves  Peter nods his head stiffly and manages a weak smile  They spot MJ with Flash and part  Father and son shake hands as Peter in his mortarboard and gown stands awkwardly  At the graduation Peter's classes photograph and Harry turns to his father  A green fireball flies towards the bunker resulting in total destruction  Captain Curtis stands upright inside the 10foottall rocket as it lifts off  The two men move into the bunker and the exoskeleton is powered up  At Quest Proving Grounds bunker six a car draws up and General Slocum emerges from it  Standing by the front door he hugs her tight  As he enters she rises crosses over to him and throws her arms around his neck "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Standing by the front door he hugs her tight As he enters she rises crosses over to him and throws her arms around his neck The two men move into the bunker and the exoskeleton is powered up At Quest Proving Grounds bunker six a car draws up and General Slocum emerges from it A green fireball flies towards the bunker resulting in total destruction Captain Curtis stands upright inside the 10foottall rocket as it lifts off Father and son shake hands as Peter in his mortarboard and gown stands awkwardly At the graduation Peter's classes photograph and Harry turns to his father Peter nods his head stiffly and manages a weak smile They spot MJ with Flash and part Peter turns and charges sturdily up the stairs to his room while Aunt May takes a few paces forward her head tilted to one side and watches with a sad and witty face until he disappears Later he and Aunt May arrive home with Peter in a suit shirt and tie and Aunt May in a floral suit hat and carrying her gloves Aunt May in her dressing gown comes to the doorway and softly comes in sitting down next to her nephew on the bed with her hands on her lap That night he is sitting up in his bedroom his tie loosened a little but still on with tears rolling slowly down his cheeks as he gazes distantly ahead He smiles and Aunt May rises puts her right hand on his left shoulder gently squeezes it and goes He acknowledges her presence with a hint of a smile as she leans close to him placing her hands on his shoulders Inside a small case is a sweatshirt with a spider and web motif and underneath it is a sketchpad with the original snugfitting SpiderMan outfit blue body stocking a hooded mask red and black checked shoulder pants and the chest with a large black spider in the center Peter sits deep in thought then a sparkle comes into his eyes As two robbers make their escape SpiderMan swoops down on them returns the stolen money and thrusts the two robbers up on a giant spider's web The New York City streets host a delicatessen run by an Oriental couple who are being held up MJ in a waitress outfit walks out of the Moon Dance Diner putting on her coat as Peter is on the sidewalk and senses her presence A girl is being robbed at gunpoint and then the front page of the Daily Bugle is shown MJ opens her coat to let Peter see her uniform He turns chases after her and they look awkwardly at each other as Enrique heads back to the diner"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "That night he's sitting up in his bedroom his tie loosened a little but still on with tears rolling slowly down his cheeks as he gazes distantly ahead  Aunt May in her dressing gown comes to the doorway and softly comes in sitting down next to her nephew on the bed with her hands on her lap  He acknowledges her presence with a hint of a smile as she leans close to him placing her hands on his shoulders  He smiles and Aunt May rises puts her right hand on his left shoulder gently squeezes it and goes  Peter sits deep in thought then a sparkle comes into his eyes  Inside a small case is a sweatshirt with a spider and web motif and underneath it is a sketchpad with the original snugfitting SpiderMan outfit blue body stocking a hooded mask red and black checked shoulder pants and the chest with a large black spider in the center  The New York City streets host a delicatessen run by an Oriental couple who are being held up  As two robbers make their escape SpiderMan swoops down on them returns the stolen money and thrusts the two robbers up on a giant spider's web  A girl is being robbed at gunpoint and then the front page of the Daily Bugle is shown  MJ in a waitress outfit walks out of the Moon Dance Diner putting on her coat as Peter is on the sidewalk and senses her presence  He turns chases after her and they look awkwardly at each other as Enrique heads back to the diner  MJ opens her coat to let Peter see her uniform As he enters she rises crosses over to him and throws her arms around his neck  Standing by the front door he hugs her tight  At Quest Proving Grounds bunker six a car draws up and General Slocum emerges from it  The two men move into the bunker and the exoskeleton is powered up  Captain Curtis stands upright inside the 10foottall rocket as it lifts off  A green fireball flies towards the bunker resulting in total destruction  At the graduation Peter's classes photograph and Harry turns to his father  Father and son shake hands as Peter in his mortarboard and gown stands awkwardly  They spot MJ with Flash and part  Peter nods his head stiffly and manages a weak smile  Later he and Aunt May arrive home with Peter in a suit shirt and tie and Aunt May in a floral suit hat and carrying her gloves  Peter turns and charges sturdily up the stairs to his room while Aunt May takes a few paces forward her head tilted to one side and watches with a sad and witty face until he disappears "
        }
      ]
    }
  ]
}