{
  "ground_truth": "Underwater, the body of Octavius, the four limbs still attached to him, floats downwards, as does the sphere, and the entire lab sinks below the surface of the river. High on a crane, Spider-Man has woven a web over which he crawls to MJ, and he lies beside her way above the river, the lights of the city twinkling far below them. She looks earnestly at him, and he stares at her. She screws up her face and fights back tears. Down below, a convoy of squad cars speeds towards the waterside. Up on the web attached to the crane, MJ turns to face Spider-Man once more, and he half-smiles. Later, he eases her down towards the ground with an ever-lengthening string of web emanating from his wrist. As she glides elegantly down from on high, the convoy of cars draws closer to her, their lights flashing. The lead car slues to its left and stops, and the passenger door opens and out steps John, who looks up at the descending MJ. As she lands on the bridge of a boat, John races towards her, and she turns on hearing him approach. John leaps from the pier onto the boat, then clambers upstairs as MJ descends towards him. Meeting in the middle, they hug tightly. As John nuzzles her neck, MJ looks across and up to the crane, where a distant figure squats in true Spider-Man pose. Peter slips on the mask, looks at the city, then round to MJ, before leaping into the night sky carried by a web. Tears trickle down MJ's face as she rests her head on John's shoulder. Meanwhile, Harry sits alone in the apartment, fondling the blade of the dagger with which he'd intended to kill Spider-Man. Hearing a noise, Harry gets to his feet, the dagger in his right hand, and takes a few paces forward and listens. A door opposite him swings open, and Harry looks anxiously around and stares up at the balcony surrounding the room. He turns to the full-length mirror and stares at his late father, shakes his head, then flings the dagger at the mirror. It crashes through his father's reflection to reveal a room beyond. Stupefied, Harry moves to the mirror doorway, avoiding the jagged pieces of broken mirror, and slides through into a brick chamber. There are cobwebs, which he brushes aside as he strides through, then turns, catching sight of something out of the corner of his eye: the mask of the Green Goblin. Harry crashes into a set of shelves filled with spherical bombs, there are row upon row of the weapons his father once used, and Harry catches sight of a cylindrical vial containing a phosphorescent green liquid. He picks it up, examines it, then marches into another section of the secret chamber.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Certainly! Here is the transformed text:  \n\nBeneath the surface, the corpse of Octavius, the four appendages still affixed to him, drifts downward, as does the orb, and the entire laboratory descends below the facade of the brook. Elevated on a derrick, Spider-Man has spun a lattice over which he climbs to MJ, and he reclines beside her way above the brook, the illuminations of the metropolis shimmering far underneath them. She gazes sincerely at him, and he fixes his gaze on her. She contorts her visage and suppresses sobs. Down underneath, a caravan of patrol vehicles accelerates towards the shoreline. Up on the lattice affixed to the derrick, MJ turns to confront Spider-Man once more, and he partly-grins. Later, he lowers her down towards the earth with an ever-prolonging strand of lattice issuing from his wrist. As she glides gracefully down from on high, the caravan of vehicles approaches her, their illuminations flashing. The lead vehicle veers to its left and halts, and the passenger portal opens and out steps John, who glances up at the descending MJ. As she alights on the bridge of a vessel, John dashes towards her, and she rotates on perceiving him approach. John leaps from the quay onto the vessel, then scrambles upstairs as MJ descends towards him. Meeting in the center, they embrace firmly. As John nuzzles her neck, MJ glances across and up to the derrick, where a distant silhouette crouches in authentic Spider-Man stance. Peter slips on the disguise, looks at the metropolis, then round to MJ, before vaulting into the nocturnal heavens borne by a lattice. Sobs stream down MJ's visage as she rests her head on John's shoulder. Concurrently, Harry perches solitary in the condominium, caressing the blade of the dirk with which he'd meant to slay Spider-Man. Detecting a sound, Harry gets to his feet, the dirk in his right hand, and takes a few strides onward and hearkens. A portal opposite him swings ajar, and Harry glances apprehensively around and fixes his gaze up at the gallery encompassing the chamber. He turns to the full-length reflector and fixes his gaze at his late progenitor, shakes his head, then hurls the dirk at the reflector. It shatters through his progenitor's image to disclose a chamber beyond. Dumbfounded, Harry advances to the reflector entrance, avoiding the serrated fragments of shattered reflector, and slips through into a brick compartment. There are cobwebs, which he brushes aside as he strides through, then turns, catching sight of something out of the corner of his eye: the disguise of the Green Goblin. Harry crashes into a set of racks filled with spherical explosives, there are row upon row of the armaments his progenitor once employed, and Harry catches sight of a cylindrical vial containing a phosphorescent emerald fluid. He picks it up, scrutinizes it, then marches into another section of the clandestine compartment."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Underwater, the body of Octavius, with the four limbs still attached to him, is floated downwards by the river, as is the sphere, and the entire lab is sunk by the river beneath the surface. High on a crane, a web is woven by Spider-Man over which he crawls to MJ, and beside her, he is lain way above the river, the lights of the city twinkling far below them. He is looked at earnestly by her, and she is stared at by him. Her face is screwed up, and tears are fought back by her. Down below, a convoy of squad cars speeds towards the waterside. Up on the web attached to the crane, Spider-Man is turned to once more by MJ, and a half-smile is given by him. Later, she is eased down towards the ground by him with an ever-lengthening string of web emanating from his wrist. As she is glided elegantly down from on high, the convoy of cars is drawn closer to her by the drivers, their lights flashing. The lead car is slued to its left and stopped, and the passenger door is opened as John steps out and looks up at the descending MJ. As she is landed on the bridge of a boat, towards her John races, and on hearing him approach, she turns. From the pier onto the boat, John leaps, then upstairs he clambers as towards him MJ descends. Meeting in the middle, they hug tightly. As her neck is nuzzled by John, across and up to the crane MJ looks, where a distant figure is squatted in true Spider-Man pose. The mask is slipped on by Peter, and he looks at the city, then round to MJ, before into the night sky he is leapt, carried by a web. Down MJ's face tears trickle as her head is rested on John's shoulder. Meanwhile, alone in the apartment, Harry sits, fondling the blade of the dagger with which Spider-Man was intended to be killed. Hearing a noise, his feet are gotten to by Harry, the dagger in his right hand, and a few paces forward are taken, and he listens. A door opposite him is swung open, and around anxiously Harry looks and up at the balcony surrounding the room he stares. The full-length mirror is turned to by him, and his late father is stared at, his head is shaken, then the dagger is flung at the mirror. Through his father's reflection, it is crashed to reveal a room beyond. To the mirror doorway, stupefied, Harry moves, the jagged pieces of broken mirror are avoided by him, and into a brick chamber he slides through. There are cobwebs, and they are brushed aside by him as through he strides, then turns, a sight is caught by him out of the corner of his eye: the mask of the Green Goblin. Into a set of shelves filled with spherical bombs, Harry crashes, row upon row of the weapons once used by his father are there, and a cylindrical vial containing a phosphorescent green liquid is caught sight of by Harry. It is picked up and examined by him, then into another section of the secret chamber, he marches."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Underwater, Octavius's body, with limbs still attached, sinks along with the sphere and the lab beneath the river's surface. On a crane, Spider-Man crawls across a web to MJ, lying beside her above the river as city lights twinkle. She gazes at him, fighting tears, while a convoy of squad cars speeds to the river. On the crane's web, MJ faces Spider-Man, who half-smiles before lowering her to the ground with a web string. As she descends gracefully, the cars approach, lights flashing. The lead car stops, and John exits, looking up at MJ landing on a boat. John races to her, and they hug tightly. MJ looks up to see Spider-Man in the distance. Peter dons his mask, scans the city, and leaps into the night. Tears fall as MJ rests on John's shoulder. Meanwhile, in his apartment, Harry, holding a dagger intended for Spider-Man, hears a noise, stands, and moves towards it. A door opens, and Harry stares at his late father's reflection, throwing the dagger at the mirror, revealing a hidden room. He cautiously enters, brushing cobwebs aside, and notices the Green Goblin mask. Harry crashes into shelves of spherical bombs, spotting a vial of phosphorescent green liquid, which he examines before entering another chamber section."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Underwater, Octavius's body, limbs attached, sinks with the sphere as the lab descends into the river. On a crane, Spider-Man crawls on a web to MJ above the twinkling city. She fights tears as a squad car convoy approaches below. On the crane's web, MJ faces Spider-Man and he half-smiles. Later, he lowers her with a long web towards the flashing car convoy. John exits the lead car and looks up at MJ, who lands on a boat. John rushes to her, and they meet and hug tightly. As John nuzzles her, MJ sees a distant Spider-Man on the crane. Peter dons his mask, looks at the city, then leaps skyward with a web. MJ cries on John's shoulder. Meanwhile, Harry, alone in his apartment, handles a dagger meant for Spider-Man. Hearing a noise, Harry stands and listens. A door opens, and he anxiously faces a mirror showing his late father. Harry hurls the dagger, shattering the mirror to reveal a room. Shocked, Harry enters the chamber, brushing aside cobwebs, and notices the Green Goblin mask. He crashes into shelves of bombs and sees a vial of green liquid, examines it, and strides into another chamber section."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Beneath the surface of the river, the lifeless body of Octavius, with all four of his limbs still attached, drifts slowly downward amid the depths, accompanied by the sinking sphere and the entire laboratory, which descends below the water's surface. Perched high above on a towering crane, Spider-Man has skillfully woven an intricate web that spans the structure, providing a path for him as he crawls towards MJ. There, he lies beside her, suspended far above the river, with the city's lights sparkling like stars far below them in the distance. She gazes at him earnestly, and he returns her look with steady eyes. She screws up her face in an effort to suppress the rising tide of tears threatening to fall. Meanwhile, down below, a convoy of squad cars is racing towards the riverbank, their sirens blaring and lights flashing. Up on the web attached to the towering crane, MJ once again turns to face Spider-Man, and he offers her a faint, reassuring smile. \n\nLater, with great care and precision, he gently lowers her towards the ground using a web string that lengthens from his wrist like a tether. As she descends gracefully from the dizzying height, the convoy of cars draws ever closer, their flashing lights becoming brighter. The lead car veers sharply to the left and comes to a halt, the passenger door swinging open as John steps out, his eyes fixed upwards on the descending MJ. As she touches down gracefully on the bridge of a nearby boat, John frantically races towards her, and she turns at the sound of his approaching footsteps. With a determined leap, John jumps from the pier onto the boat, then scrambles up the stairs as MJ makes her way down towards him. Meeting halfway, they embrace each other tightly. As John tenderly nuzzles her neck, MJ's eyes wander across the distance to the crane, where she glimpses a distant figure perched in the iconic pose of Spider-Man. Peter slips the mask over his face, takes a moment to survey the sprawling cityscape, then glances back towards MJ before launching himself into the night, carried by the strength of his web. Tears begin to trickle down MJ's face as she rests her head against John's shoulder, feeling the weight of the moment.\n\nMeanwhile, in a different part of the city, Harry sits isolated in his apartment, toying with the blade of a dagger he had once intended to use against Spider-Man. A sudden noise disrupts his solitude, causing Harry to stand, the dagger clutched in his right hand. He takes a few cautious steps forward, straining to listen. A door across from him slowly swings open, prompting Harry to look around anxiously before his gaze settles on the balcony that encircles the room. Turning to face the full-length mirror, he stares at the reflection of his late father, shaking his head in dismay before violently hurling the dagger at the mirror. The glass shatters, crashing through the image to reveal a hidden room beyond. Stunned and bewildered, Harry navigates his way to the newly revealed doorway, carefully avoiding the jagged fragments of broken mirror, and slips through into a concealed brick chamber. Dust-laden cobwebs are brushed aside as he strides purposefully through the space, suddenly turning as he catches a glimpse of an object out of the corner of his eye: the menacing mask of the Green Goblin. Harry stumbles into a set of shelves laden with spherical bombs, row upon row of the weapons once wielded by his father. It's then that Harry notices a cylindrical vial containing a glowing phosphorescent green liquid. He picks it up, examining it closely, before resolutely marching deeper into another part of the hidden chamber, his mind awash with the implications of his discovery."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Beneath the undulating surface of the expansive river, the lifeless form of Octavius drifts slowly downward, with all four of his limbs still intact and attached. He is accompanied on his descent into the murky depths by the sinking sphere and the entire laboratory, both gradually disappearing below the water’s surface. Perched high above on a towering crane, Spider-Man, with remarkable skill and dexterity, has intricately woven an elaborate web spanning the structure, creating a viable path for him to crawl towards MJ. He lies there beside her, suspended precariously far above the river, with the city's myriad lights sparkling like distant stars in the vast expanse below them. MJ gazes at him with earnest eyes, and he meets her look, his gaze steady. Her face contorts slightly as she fights to suppress the rising flood of tears threatening to spill. Meanwhile, down below, a fleet of squad cars races toward the riverbank, their sirens blaring loudly and lights flashing vividly. Up on the web attached to the lofty crane, MJ turns once more to face Spider-Man, and he offers her a faint, reassuring smile that seeks to provide comfort.\n\nLater, with great care and precision, Spider-Man gently lowers her toward the solid ground below, using a lengthening web string that unfurls from his wrist like a gentle tether. As she descends gracefully from the dizzying height, the convoy of approaching cars draws ever nearer, their flashing lights growing ever brighter in the evening glow. The lead car suddenly veers sharply to the left and screeches to a halt, the passenger door flying open as John urgently steps out, his eyes fixed intently upwards on the descending MJ. As she touches down softly on the bridge of a nearby boat, John races frantically towards her, and she turns at the sound of his fast-approaching footsteps. With an athletic, determined leap, John jumps from the pier onto the boat and then scrambles quickly up the stairs as MJ makes her way down towards him. As they meet halfway, they embrace each other tightly in a profound hug. John tenderly nuzzles her neck, and MJ's eyes wander across the distance to the towering crane, where she catches a glimpse of a distant figure poised in the iconic stance of Spider-Man. Peter slips the mask over his face, and after taking a moment to survey the sprawling cityscape, he glances back toward MJ before launching himself into the enveloping night, carried by the strength and agility of his web. Tears begin to trickle slowly down MJ’s face as she rests her head gently against John's shoulder, feeling the full weight of the moment.\n\nMeanwhile, in another part of the bustling city, Harry sits alone in his apartment, isolated and contemplative, toying with the sharp blade of a dagger he had once planned to use against Spider-Man. A sudden, unexpected noise disrupts his solitude, causing Harry to stand abruptly, the dagger tightly clutched in his right hand. He takes a few cautious steps forward, straining his ears to listen intensely. A door across from him slowly swings open, prompting Harry to look around anxiously before his gaze finds the balcony that encircles the room. Turning to face the full-length mirror, he stares intently at the reflection of his late father, shaking his head in dismay before violently hurling the dagger at the glass surface. The mirror shatters, with crashing fragments breaking through the image to reveal a hidden room beyond. Stunned and bewildered, Harry navigates his way carefully to the newly revealed doorway, avoiding the jagged edges of the broken mirror, and slips through into a concealed, brick-walled chamber. Dust-laden cobwebs are brushed aside as he strides purposefully through the space, turning suddenly as he catches a glimpse of an object out of the corner of his eye: the menacing mask of the Green Goblin. Harry stumbles onto a set of shelves laden with spherical bombs, row upon row of the dangerous weapons once wielded by his father. It is then that Harry notices a cylindrical vial containing a glowing, phosphorescent green liquid. He picks it up, examining it closely before resolutely marching deeper into another part of the hidden chamber, his mind awash with the implications and consequences of his discovery."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Underwater, the lifeless body of Octavius, with its four limbs still firmly attached, floats gently downwards alongside the mysterious sphere as the entire laboratory structure continues to descend below the surface of the murky river. High above, perched on a crane, Spider-Man meticulously weaves a web, creating a stable surface which he uses to carefully crawl towards MJ. Once he reaches her, he lies down beside her on the web, suspended far above the twinkling city lights. She looks at him with earnest eyes, and he returns the gaze, both of them silent in the moment. MJ's face contorts slightly as she valiantly fights back tears. Meanwhile, down below, a convoy of squad cars rushes towards the waterfront with sirens blaring, their urgency mirrored in the flashing lights. High above, on the web attached to the crane, MJ turns back to face Spider-Man again, and he offers her a faint, reassuring half-smile. Later on, Spider-Man gently lowers her towards the ground, releasing a continuous, ever-lengthening string of web from his wrist. As she gracefully descends through the air, the convoy of cars approaches rapidly, their headlights piercing the dark as they close the distance. The lead car suddenly veers to the left and comes to a halt, its passenger door swinging open to reveal John stepping out. He looks up to spot MJ descending, and as she gracefully lands on a small bridge of a boat, John races eagerly towards her. She turns around, alerted by the sound of his approach, and he leaps confidently from the pier onto the boat, clambering up the steps as MJ descends to meet him. They meet halfway, embracing each other tightly, with John nuzzling affectionately into her neck as MJ’s gaze drifts upwards towards the crane, where she spots the small, distant figure of Spider-Man squatting in his iconic pose. Observing from afar, Peter slips on his mask, casting a final look over the cityscape before turning back to MJ, and then, with a powerful leap, he soars into the night sky, propelled by his webbing. As he disappears into the darkness, tears silently trickle down MJ's cheeks as she rests her head on John's shoulder, lost in thought. Meanwhile, in a different setting, Harry sits in solitude within his apartment, absently fondling the sharp blade of the dagger he once intended to use against Spider-Man. Suddenly, a noise catches his attention, prompting him to rise, clutching the dagger firmly in his right hand as he cautiously takes a few steps forward, straining to listen. A door across the room swings open unexpectedly, causing Harry to look around anxiously, his eyes scanning the surrounding balcony. As his gaze lands on a full-length mirror, he stares intently at the reflection of his late father. Overcome with emotion, Harry shakes his head in denial and, in a burst of anger, flings the dagger at the mirror. The impact shatters the glass, uncovering a hidden room beyond the fragmented reflection. Stunned, Harry approaches the broken mirror, carefully avoiding the jagged shards, and steps through into a concealed brick chamber. The room is draped in cobwebs, which he brushes aside as he strides purposefully forward, until something catches his eye: the infamous mask of the Green Goblin. In his hurried exploration, Harry inadvertently crashes into a set of shelves lined with the spherical bombs his father once wielded, and his eye falls upon a cylindrical vial containing a glowing, phosphorescent green liquid. Intrigued, he picks it up, scrutinizing it closely before marching resolutely into another section of the secret chamber, driven by a newfound determination."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Underwater, Octavius's body, with all limbs intact, descends alongside the sphere as the lab submerges in the river. High above, Spider-Man crawls over a web on a crane to MJ, lying beside her with the city's lights shimmering below. They share a poignant moment, her eyes welling up with tears as squad cars converge on the riverbank below. Spider-Man gently lowers MJ to the ground with a web string from his wrist, while the cars approach, lights flashing. As the lead car halts, John emerges, watching MJ glide onto a boat. He swiftly races to her, and they embrace as MJ notices Spider-Man perched distantly on the crane. Peter dons his mask, surveys the city, glances at MJ, and swings away into the night. Tears stream down her face as she rests on John's shoulder. Meanwhile, in his apartment, Harry contemplates the dagger intended for Spider-Man. Alerted by a noise, he cautiously advances, dagger in hand, and is startled by his father's reflection in the mirror. In a fit of frustration, he throws the dagger, shattering the mirror and unveiling a hidden room. Harry hesitantly enters, brushing aside cobwebs, and discovers the Green Goblin's mask along with shelves of his father's weapons, including bombs and a vial of phosphorescent green liquid. He inspects the vial and strides further into the secret chamber."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Underwater in the East River, the body of Octavius, a brilliant scientist once known for his mechanical tentacles, the four limbs still attached to him, floats downwards, as does the sphere containing his failed fusion experiment, and the entire lab sinks below the surface of the river. High on a crane near the Brooklyn Bridge, Spider-Man has woven a web over which he crawls to MJ, and he lies beside her way above the river, the lights of the city of New York twinkling far below them. She looks earnestly at him, and he stares at her, aware of the danger they had just narrowly escaped. She screws up her face and fights back tears. Down below, a convoy of NYPD squad cars speeds towards the waterside, responding to the chaos caused by Octavius. Up on the web attached to the crane, MJ turns to face Spider-Man once more, and he half-smiles, trying to reassure her. Later, he eases her down towards the ground with an ever-lengthening string of web emanating from his wrist, a skill he honed over years of protecting the city. As she glides elegantly down from on high, the convoy of cars draws closer to her, their lights flashing urgently. The lead car slues to its left and stops, and the passenger door opens and out steps John, her fiancé and an astronaut known for his heroics during a recent space mission, who looks up at the descending MJ. As she lands on the bridge of a boat, a ferry named after the city's founder, John races towards her, and she turns on hearing him approach. John leaps from the pier onto the boat, then clambers upstairs as MJ descends towards him. Meeting in the middle, they hug tightly. As John nuzzles her neck, MJ looks across and up to the crane, where a distant figure squats in true Spider-Man pose, silhouetted against the night sky. Peter, feeling the weight of his double life, slips on the mask, looks at the city with a sense of duty, then round to MJ, before leaping into the night sky carried by a web. Tears trickle down MJ's face as she rests her head on John's shoulder, realizing the complexity of her feelings. Meanwhile, Harry Osborn sits alone in the apartment once belonging to his late father, Norman Osborn, the original Green Goblin, fondling the blade of the dagger with which he'd intended to kill Spider-Man, driven by a desire for revenge. Hearing a noise, Harry gets to his feet, the dagger in his right hand, and takes a few paces forward and listens. A door opposite him swings open, and Harry looks anxiously around and stares up at the balcony surrounding the room where his father once conducted secretive experiments. He turns to the full-length mirror and stares at his late father, whose voice he sometimes hears in his mind, shakes his head, then flings the dagger at the mirror. It crashes through his father's reflection, revealing a hidden room beyond. Stupefied, Harry moves to the mirror doorway, avoiding the jagged pieces of broken mirror, and slides through into a brick chamber concealed within the mansion. There are cobwebs, which he brushes aside as he strides through, then turns, catching sight of something out of the corner of his eye: the mask of the Green Goblin, infamous for terrorizing the city. Harry crashes into a set of shelves filled with spherical bombs, there are row upon row of the weapons his father once used to wreak havoc, and Harry catches sight of a cylindrical vial containing a phosphorescent green liquid, the formula his father used to augment his power. He picks it up, examines it, then marches into another section of the secret chamber, determined to understand his father's legacy."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Underwater the body of Octavius the four limbs still attached to him floats downwards as does the sphere and the entire lab sinks below the surface of the river. High on a crane SpiderMan has woven a web over which he crawls to MJ and he lies beside her way above the river the lights of the city twinkling far below them. She looks earnestly at him and he stares at her. She screws up her face and fights back tears. Down below a convoy of squad cars speeds towards the waterside. Up on the web attached to the crane MJ turns to face SpiderMan once more and he halfsmiles. Later he eases her down towards the ground with an everlengthening string of web emanating from his wrist. As she glides elegantly down from on high the convoy of cars draws closer to her their lights flashing. The lead car slues to its left and stops and the passenger door opens and out steps John who looks up at the descending MJ. As she lands on the bridge of a boat John races towards her and she turns on hearing him approach. John leaps from the pier onto the boat then clambers upstairs as MJ descends towards him. Meeting in the middle they hug tightly. As John nuzzles her neck MJ looks across and up to the crane where a distant figure squats in true SpiderMan pose. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Peter slips on the mask looks at the city then round to MJ before leaping into the night sky carried by a web. Tears trickle down MJ's face as she rests her head on John's shoulder. Meanwhile Harry sits alone in the apartment fondling the blade of the dagger with which he would intended to kill SpiderMan. Hearing a noise Harry gets to his feet the dagger in his right hand and takes a few paces forward and listens. A door opposite him swings open and Harry looks anxiously around and stares up at the balcony surrounding the room. He turns to the fulllength mirror and stares at. his late father shakes his head then flings the dagger at the mirror. It crashes through his father's reflection to reveal a room beyond. Stupefied Harry moves to the mirror doorway avoiding the jagged pieces of broken mirror and slides through into a brick chamber. There are cobwebs which he brushes aside as he strides through then turns catching sight of something out of the corner of his eye the mask of the Green Goblin. Harry crashes into a set of shelves filled with spherical bombs. there are row upon row of the weapons his father once used and Harry catches sight of a cylindrical vial containing a phosphorescent green liquid. He picks it up examines it then marches into another section of the secret chamber."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Underwater the body of Octavius the four limbs still attached to him floats downwards as does the sphere and the entire lab sinks below the surface of the river. High on a crane SpiderMan has woven a web over which he crawls to MJ and he lies beside her way above the river the lights of the city twinkling far below them. She looks earnestly at him and he stares at her. She screws up her face and fights back tears. Down below a convoy of squad cars speeds towards the waterside. Up on the web attached to the crane MJ turns to face SpiderMan once more and he halfsmiles. Later he eases her down towards the ground with an everlengthening string of web emanating from his wrist. As she glides elegantly down from on high the convoy of cars draws closer to her their lights flashing. The lead car slues to its left and stops and the passenger door opens and out steps John who looks up at the descending MJ. As she lands on the bridge of a boat John races towards her and she turns on hearing him approach. John leaps from the pier onto the boat then clambers upstairs as MJ descends towards him. Meeting in the middle they hug tightly. As John nuzzles her neck MJ looks across and up to the crane where a distant figure squats in true SpiderMan pose. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Peter slips on the mask looks at the city then round to MJ before leaping into the night sky carried by a web. Tears trickle down MJ's face as she rests her head on John's shoulder. Meanwhile Harry sits alone in the apartment fondling the blade of the dagger with which he would intended to kill SpiderMan. Hearing a noise Harry gets to his feet the dagger in his right hand and takes a few paces forward and listens. A door opposite him swings open and Harry looks anxiously around and stares up at the balcony surrounding the room. He turns to the fulllength mirror and stares at. his late father shakes his head then flings the dagger at the mirror. It crashes through his father's reflection to reveal a room beyond. Stupefied Harry moves to the mirror doorway avoiding the jagged pieces of broken mirror and slides through into a brick chamber. There are cobwebs which he brushes aside as he strides through then turns catching sight of something out of the corner of his eye the mask of the Green Goblin. Harry crashes into a set of shelves filled with spherical bombs. there are row upon row of the weapons his father once used and Harry catches sight of a cylindrical vial containing a phosphorescent green liquid. He picks it up examines it then marches into another section of the secret chamber."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Underwater the body of Octavius the four limbs still attached to him floats downwards as does the sphere and the entire lab sinks below the surface of the river. High on a crane SpiderMan has woven a web over which he crawls to MJ and he lies beside her way above the river the lights of the city twinkling far below them. She looks earnestly at him and he stares at her. She screws up her face and fights back tears. Down below a convoy of squad cars speeds towards the waterside. Up on the web attached to the crane MJ turns to face SpiderMan once more and he halfsmiles. Later he eases her down towards the ground with an everlengthening string of web emanating from his wrist. It crashes through his father's reflection to reveal a room beyond. Stupefied Harry moves to the mirror doorway avoiding the jagged pieces of broken mirror and slides through into a brick chamber. There are cobwebs which he brushes aside as he strides through then turns catching sight of something out of the corner of his eye the mask of the Green Goblin. Harry crashes into a set of shelves filled with spherical bombs. there are row upon row of the weapons his father once used and Harry catches sight of a cylindrical vial containing a phosphorescent green liquid. He picks it up examines it then marches into another section of the secret chamber."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Underwater the body of Octavius the four limbs still attached to him floats downwards as does the sphere and the entire lab sinks below the surface of the river. High on a crane SpiderMan has woven a web over which he crawls to MJ and he lies beside her way above the river the lights of the city twinkling far below them. She looks earnestly at him and he stares at her. Harry crashes into a set of shelves filled with spherical bombs. there are row upon row of the weapons his father once used and Harry catches sight of a cylindrical vial containing a phosphorescent green liquid. He picks it up examines it then marches into another section of the secret chamber."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Deep in the ocean, the statue of Athena, the six horns still attached to her, drifts upwards, as does the cube, and the entire temple rises above the surface of the lake. Low on a submarine, Iron Man has spun a net over which he skips to SL, and he lies beneath him way under the lake, the shadows of the islands glistening high above them. He frowns happily at her, and she yawns around him. He smooths out his mouth and hides back laughter. Up above, a parade of fire engines crawls away from the hillside. Down in the net connected to the submarine, SL escapes to avoid Iron Man once less, and she full-frowns. Earlier, she lifts him up towards the sky with a never-shrinking chain of net flowing from her ankle. As he tumbles clumsily up from down low, the parade of bicycles skips farther from him, their horns blaring. The trailing bike drifts to its right and rolls, and the trunk lid locks and in leaps Tony, who sneaks down at the rising SL. As he floats under the arch of a helicopter, Tony jumps away from him, and he skips off noticing him depart. Tony tumbles from the balloon onto the helicopter, then slinks backward as SL rises away from him. Stopping at the edge, they smile loosely. As Tony scratches his elbow, SL sneaks away and down to the submarine, where a nearby object slides in false Iron Man style. Luke peeks under the glove, stares at the jungle, then over to SL, after falling into the morning sea pushed by a net. Chuckles beam up SL's arm as he taps his foot on Tony's leg. Meanwhile, Larry snoozes together in the cave, rubbing the edge of the coin with which he'd planned to hug Iron Man. Missing a whisper, Larry drops to his knees, the coin in his left foot, and takes several jumps backward and closes his eyes. A window adjoining him flings shut, and Larry grins calmly upward and squints down at the aquarium surrounding the basement. He spins to the half-width window and peers at his early mother, nods his chin, then picks up the coin at the window. It crashes through his mother's echo to conceal a cave beneath. Terrified, Larry stops away from the window corridor, pulling the smooth bits of whole window, and rolls against out of a stone closet. There are sprays, which he ignores away as he crawls back, then leans, hearing sound of nothing near the center of his mouth: the helmet of the Purple Dragon. Larry floats out of a stack of crates emptied with rectangular shields, there are pile beneath pile of the devices his uncle often held, and Larry losses view of a rectangular box containing a transparent blue vapor. He puts it down, rejects it, then skips out of another opening of the common closet."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Underwater, Octavius's body descends with the sinking lab. High on a crane, Spider-Man weaves a web to MJ, lying beside her above the city. She fights back tears, and a convoy of squad cars arrives below. Spider-Man lowers MJ with his web as John arrives, racing to her and they embrace. MJ spots Spider-Man in the distance, who then leaps into the night, leaving her in tears. Meanwhile, Harry, alone in his apartment, plays with a dagger meant for Spider-Man. Hearing a noise, he investigates, finds a hidden room behind a shattered mirror, and discovers his father's Green Goblin arsenal. Stunned, Harry examines a vial of green liquid and enters another chamber."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He picks it up examines it then marches into another section of the secret chamber there are row upon row of the weapons his father once used and Harry catches sight of a cylindrical vial containing a phosphorescent green liquid Harry crashes into a set of shelves filled with spherical bombs There are cobwebs which he brushes aside as he strides through then turns catching sight of something out of the corner of his eye the mask of the Green Goblin Stupefied Harry moves to the mirror doorway avoiding the jagged pieces of broken mirror and slides through into a brick chamber It crashes through his father's reflection to reveal a room beyond his late father shakes his head then flings the dagger at the mirror He turns to the fulllength mirror and stares at A door opposite him swings open and Harry looks anxiously around and stares up at the balcony surrounding the room Hearing a noise Harry gets to his feet the dagger in his right hand and takes a few paces forward and listens Meanwhile Harry sits alone in the apartment fondling the blade of the dagger with which he would intended to kill SpiderMan Tears trickle down MJ's face as she rests her head on John's shoulder Peter slips on the mask looks at the city then round to MJ before leaping into the night sky carried by a web As John nuzzles her neck MJ looks across and up to the crane where a distant figure squats in true SpiderMan pose Meeting in the middle they hug tightly John leaps from the pier onto the boat then clambers upstairs as MJ descends towards him As she lands on the bridge of a boat John races towards her and she turns on hearing him approach The lead car slues to its left and stops and the passenger door opens and out steps John who looks up at the descending MJ As she glides elegantly down from on high the convoy of cars draws closer to her their lights flashing Later he eases her down towards the ground with an everlengthening string of web emanating from his wrist Up on the web attached to the crane MJ turns to face SpiderMan once more and he halfsmiles Down below a convoy of squad cars speeds towards the waterside She screws up her face and fights back tears She looks earnestly at him and he stares at her High on a crane SpiderMan has woven a web over which he crawls to MJ and he lies beside her way above the river the lights of the city twinkling far below them Underwater the body of Octavius the four limbs still attached to him floats downwards as does the sphere and the entire lab sinks below the surface of the river"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "High on a crane SpiderMan has woven a web over which he crawls to MJ and he lies beside her way above the river the lights of the city twinkling far below them Underwater the body of Octavius the four limbs still attached to him floats downwards as does the sphere and the entire lab sinks below the surface of the river She screws up her face and fights back tears She looks earnestly at him and he stares at her Up on the web attached to the crane MJ turns to face SpiderMan once more and he halfsmiles Down below a convoy of squad cars speeds towards the waterside As she glides elegantly down from on high the convoy of cars draws closer to her their lights flashing Later he eases her down towards the ground with an everlengthening string of web emanating from his wrist As she lands on the bridge of a boat John races towards her and she turns on hearing him approach The lead car slues to its left and stops and the passenger door opens and out steps John who looks up at the descending MJ Meeting in the middle they hug tightly John leaps from the pier onto the boat then clambers upstairs as MJ descends towards him Peter slips on the mask looks at the city then round to MJ before leaping into the night sky carried by a web As John nuzzles her neck MJ looks across and up to the crane where a distant figure squats in true SpiderMan pose Meanwhile Harry sits alone in the apartment fondling the blade of the dagger with which he would intended to kill SpiderMan Tears trickle down MJ's face as she rests her head on John's shoulder A door opposite him swings open and Harry looks anxiously around and stares up at the balcony surrounding the room Hearing a noise Harry gets to his feet the dagger in his right hand and takes a few paces forward and listens his late father shakes his head then flings the dagger at the mirror He turns to the fulllength mirror and stares at Stupefied Harry moves to the mirror doorway avoiding the jagged pieces of broken mirror and slides through into a brick chamber It crashes through his father's reflection to reveal a room beyond Harry crashes into a set of shelves filled with spherical bombs There are cobwebs which he brushes aside as he strides through then turns catching sight of something out of the corner of his eye the mask of the Green Goblin He picks it up examines it then marches into another section of the secret chamber there are row upon row of the weapons his father once used and Harry catches sight of a cylindrical vial containing a phosphorescent green liquid"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Peter slips on the mask looks at the city then round to MJ before leaping into the night sky carried by a web Tears trickle down MJ's face as she rests her head on John's shoulder Meanwhile Harry sits alone in the apartment fondling the blade of the dagger with which he would intended to kill SpiderMan Hearing a noise Harry gets to his feet the dagger in his right hand and takes a few paces forward and listens A door opposite him swings open and Harry looks anxiously around and stares up at the balcony surrounding the room He turns to the fulllength mirror and stares at his late father shakes his head then flings the dagger at the mirror It crashes through his father's reflection to reveal a room beyond Stupefied Harry moves to the mirror doorway avoiding the jagged pieces of broken mirror and slides through into a brick chamber There are cobwebs which he brushes aside as he strides through then turns catching sight of something out of the corner of his eye the mask of the Green Goblin Harry crashes into a set of shelves filled with spherical bombs there are row upon row of the weapons his father once used and Harry catches sight of a cylindrical vial containing a phosphorescent green liquid He picks it up examines it then marches into another section of the secret chamber Underwater the body of Octavius the four limbs still attached to him floats downwards as does the sphere and the entire lab sinks below the surface of the river High on a crane SpiderMan has woven a web over which he crawls to MJ and he lies beside her way above the river the lights of the city twinkling far below them She looks earnestly at him and he stares at her She screws up her face and fights back tears Down below a convoy of squad cars speeds towards the waterside Up on the web attached to the crane MJ turns to face SpiderMan once more and he halfsmiles Later he eases her down towards the ground with an everlengthening string of web emanating from his wrist As she glides elegantly down from on high the convoy of cars draws closer to her their lights flashing The lead car slues to its left and stops and the passenger door opens and out steps John who looks up at the descending MJ As she lands on the bridge of a boat John races towards her and she turns on hearing him approach John leaps from the pier onto the boat then clambers upstairs as MJ descends towards him Meeting in the middle they hug tightly As John nuzzles her neck MJ looks across and up to the crane where a distant figure squats in true SpiderMan pose"
        }
      ]
    }
  ]
}