{
  "ground_truth": "In the movie, a black-suited Spider-Man looks on pitilessly as Flint crumbles to nothing and washes away. Later, Peter, no longer in the Spider-Man suit, walks through a dilapidated breeze block building and pauses to look at himself in a chipped mirror. He adjusts his floppy forelock and stares at his reflection with a frown and fierce eyes. Outside, his landlord is mopping the floor, and Peter glances at the landlord's daughter watching from a doorway. She joins her father, and inside his flat, Peter closes the French windows to the balcony and paces restlessly before examining his reflection again. He unbuttons his shirt to reveal the top of the black spider suit with its gray web and spider emblem and looks at it with uncertainty and fear before tossing it back into the trunk and backing away wearily. Later, he visits Aunt May, who looks into his eyes, making Peter blink uncertainly as his expression wavers, and he glances at her kindly face. Meanwhile, Mary Jane leaves a jazz restaurant with its blue and red neon sign still off, and with a glum expression, she wraps her coat collar around her neck and walks away down the street, looking wretched and alone in the crowded pavement before sitting on a bench and hesitating over calling Peter Parker or Harry Osborne on her mobile. Harry is seen painting a still life expertly as Peter picks up a payphone near his room, drops a coin, sighs, and hangs up. His landlord emerges peeling an orange, and when Peter looks at him searchingly, the landlord's eyes widen before he and his daughter retreat into their flat, with the daughter peeping out to wave. At the top of the Osborne luxury apartment building, Mary Jane exits the lift into the penthouse where Harry waits for her. She takes a deep unhappy breath, and as Harry busily cooks, he turns up the music and grins at Mary Jane, who grins back and starts dancing the twist. Harry smiles, and she encourages him to join in, pulling him from the stove. He joins her, crouching lower as the pan behind him starts to smoke.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "In the film, a black-clad Spider-Man observes mercilessly as Flint disintegrates to nothing and rinses away. Later, Peter, no longer in the Spider-Man costume, strolls through a decayed cinder block structure and halts to gaze at himself in a cracked mirror. He adjusts his floppy bangs and glowers at his image with a scowl and intense eyes. Outside, his landlord is swabbing the floor, and Peter glances at the landlord's daughter watching from a doorway. She joins her father, and inside his apartment, Peter closes the French doors to the balcony and paces restlessly before inspecting his reflection again. He unbuttons his shirt to uncover the top of the black spider costume with its gray web and spider symbol and gazes at it with doubt and fear before tossing it back into the chest and backing away wearily. Later, he visits Aunt May, who peers into his eyes, making Peter blink uncertainly as his expression falters, and he glances at her gentle face. Meanwhile, Mary Jane departs a jazz club with its blue and red neon sign still off, and with a dejected expression, she wraps her coat collar around her neck and walks away down the avenue, looking miserable and alone in the crowded sidewalk before sitting on a bench and hesitating over calling Peter Parker or Harry Osborne on her phone. Harry is seen sketching a still life adeptly as Peter picks up a payphone near his room, drops a coin, exhales, and hangs up. His landlord appears peeling an orange, and when Peter looks at him searchingly, the landlord's eyes widen before he and his daughter retreat into their apartment, with the daughter peeking out to wave. At the top of the Osborne luxury apartment building, Mary Jane exits the elevator into the penthouse where Harry waits for her. She takes a deep unhappy breath, and as Harry busily cooks, he increases the music and beams at Mary Jane, who beams back and starts dancing the twist. Harry grins, and she encourages him to join in, pulling him from the stove. He joins her, crouching lower as the pan behind him begins to smoke."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "In the movie, Flint is watched pitilessly as he crumbles to nothing and is washed away by a black-suited Spider-Man. Later, a dilapidated breeze block building is walked through by Peter, no longer in the Spider-Man suit, and he pauses to look at himself in a chipped mirror. His floppy forelock is adjusted by him, and his reflection is stared at with a frown and fierce eyes. The floor is mopped by his landlord outside, and Peter glances at the landlord's daughter watching from a doorway. She joins her father, and inside his flat, the French windows to the balcony are closed by Peter, who paces restlessly before his reflection is examined again. The top of the black spider suit with its gray web and spider emblem is revealed by unbuttoning his shirt, and it is looked at with uncertainty and fear before being tossed back into the trunk by him as he backs away wearily. Later, Aunt May is visited by him, and she looks into his eyes, making Peter blink uncertainly as his expression wavers, and her kindly face is glanced at by him. Meanwhile, a jazz restaurant with its blue and red neon sign still off is left by Mary Jane, and with a glum expression, her coat collar is wrapped around her neck by her before she walks away down the street, looking wretched and alone on the crowded pavement before a bench is sat on, and she hesitates over calling Peter Parker or Harry Osborne on her mobile. Harry expertly paints a still life, and he is seen as Peter picks up a payphone near his room, drops a coin, sighs, and hangs up. An orange is peeled by his landlord who emerges, and when Peter looks at him searchingly, the landlord's eyes widen before he and his daughter retreat into their flat, with the daughter peeping out to wave. Mary Jane exits the lift into the penthouse at the top of the Osborne luxury apartment building where Harry waits for her. A deep unhappy breath is taken by her, and as the music is turned up by Harry who busily cooks, a grin is given to Mary Jane, who grins back and starts dancing the twist. Harry smiles, and she encourages him to join in, pulling him from the stove. She is joined by him, crouching lower as the pan behind him starts to smoke."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In the movie, a black-suited Spider-Man watches as Flint crumbles and washes away. Later, Peter, now out of his suit, walks through a dilapidated building and pauses to study his reflection in a cracked mirror. Adjusting his hair, he stares fiercely. Outside, his landlord mops, and Peter glances at the landlord's daughter in a doorway. Inside his flat, he closes the balcony windows, paces restlessly, and examines his reflection again. He reveals the black spider suit under his shirt, with its gray web and emblem, looks at it fearfully, then tosses it back into the trunk. Visiting Aunt May, she looks into his eyes, making Peter blink uncertainly. Meanwhile, Mary Jane leaves a jazz restaurant, her coat collar up, looking lonely on the crowded street. She sits on a bench, hesitating to call Peter or Harry Osborne. Harry paints as Peter drops a coin in a payphone, sighs, and hangs up. His landlord peels an orange, and his daughter waves. At the top of the Osborne apartment, Mary Jane enters the penthouse where Harry awaits. Breathing deeply, she watches Harry cook, grins, and starts dancing. He joins her, lowering as the pan smokes."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "In the film, a black-suited Spider-Man pitilessly watches Flint crumble and wash away. Later, Peter, out of his Spider-Man suit, pauses in a rundown building to adjust his floppy forelock and frown at his reflection. Outside, his landlord mops, and Peter notices the landlord's daughter watching. She joins her father, and Peter closes his flat's balcony windows before examining his reflection again. He reveals the black spider suit with its gray web and emblem, looks uncertainly, and tosses it into a trunk. Visiting Aunt May, Peter blinks at her kindly face. Meanwhile, Mary Jane leaves a jazz restaurant, wrapping her coat collar while looking wretched and alone. She hesitates over calling Peter or Harry on her mobile. Harry paints as Peter tries a payphone, sighs, and hangs up. Peter's landlord emerges peeling an orange, surprised, then retreats with his daughter, who waves. Mary Jane enters Harry's penthouse, taking an unhappy breath. Harry cooks, turns up music, grins at Mary Jane, and they dance the twist as a pan starts to smoke."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the movie, Spider-Man, dressed in a sleek black suit, stands by, observing with cold indifference as Flint is reduced to nothingness and is swept away by the elements. After some time has passed, Peter, having shed the iconic Spider-Man costume, makes his way through a worn and run-down building constructed from breeze blocks, stopping momentarily to gaze at his own reflection in a chipped and weathered mirror. He adjusts his floppy forelock, staring back at himself with a frown on his face and eyes that burn fiercely. Just outside, his landlord is busy mopping the floor, and Peter's attention shifts briefly to the landlord's daughter, who is watching from a nearby doorway. She soon joins her father, and inside the confines of his modest flat, Peter methodically closes the French windows that lead to the balcony. He then paces back and forth with a sense of restlessness before once again scrutinizing his reflection. As he unbuttons his shirt, he reveals the top portion of the black spider suit, which is adorned with a gray web pattern and a prominently displayed spider emblem. He regards it with a mix of uncertainty and fear before deciding to toss it back into the trunk and backing away with an air of weary resignation. \n\nSubsequently, Peter pays a visit to Aunt May, who peers deeply into his eyes, causing Peter to blink with an uncertain expression as his emotions flicker, and he takes in her kind and gentle face. Meanwhile, Mary Jane exits a jazz restaurant, its blue and red neon sign still turned off. With a sullen and unhappy demeanor, she wraps her coat collar snugly around her neck and walks away, navigating the throngs of people on the crowded pavement, looking utterly wretched and alone. She eventually sits on a bench, caught in indecision over whether to call Peter Parker or Harry Osborne on her mobile phone. Concurrently, Harry is skillfully painting a still life as Peter, back near his room, picks up a payphone, inserts a coin, sighs deeply, and then hangs up without making the call. His landlord appears, casually peeling an orange, and when Peter looks at him with an expression of searching curiosity, the landlord's eyes widen in response before he and his daughter retreat into their apartment, with the daughter peeking out to give a small wave.\n\nAt the top of the luxurious Osborne apartment building, Mary Jane steps out of the elevator, entering the opulent penthouse where Harry is waiting for her arrival. She takes a deep, unhappy breath, readying herself for their interaction. As Harry busily cooks, he turns up the volume of the music, grinning at Mary Jane, who returns his grin and begins dancing the twist with enthusiasm. Harry, caught up in the moment, smiles in return, and she encourages him to join in the fun, playfully pulling him away from the stove. He willingly joins her dance, crouching down low just as the pan behind him begins to smoke faintly."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the movie, we see Spider-Man donning a sleek, form-fitting black suit, standing silently by as he watches Flint being reduced to nothingness, swept away by the indifferent forces of nature. After a significant amount of time has passed, we find Peter Parker having discarded his renowned Spider-Man costume. He navigates through a dilapidated and run-down building made from weathered breeze blocks, pausing momentarily to catch a glimpse of his own reflection in a chipped and time-worn mirror. With a frown etched across his face, he adjusts his floppy forelock, staring back at himself with eyes that burn like embers. Just outside, his landlord is meticulously mopping the floor, and Peter’s attention momentarily shifts to the landlord's daughter, who stands observing from a nearby doorway. She soon joins her father, and within the confines of his modest flat, Peter methodically closes the French windows that open to the balcony. He then paces back and forth with a palpable sense of restlessness before once more scrutinizing his reflection in the mirror. As he unbuttons his shirt, he reveals the upper portion of the black spider suit, which is intricately adorned with a gray web pattern and features a prominently displayed spider emblem. He regards it with an uncertain gaze, a mix of apprehension and fear in his eyes, before deciding to toss it back into the trunk, stepping away with an air of weary resignation.\n\nSubsequent to this, Peter makes his way to visit Aunt May, who gazes deeply into his eyes. Her deep gaze causes Peter to blink, his expression uncertain as his emotions flicker while he takes in her kind and gentle face. Meanwhile, Mary Jane emerges from a jazz restaurant, its blue and red neon sign remaining unlit. With a sullen and unhappy demeanor, she wraps her coat collar snugly around her neck to fend off the cold and walks away, navigating the throngs of people crowding the busy pavement, looking utterly wretched and alone. Eventually, she finds herself sitting on a bench, caught in a state of indecision about whether to call Peter Parker or Harry Osborne on her mobile phone. Simultaneously, Harry is skillfully painting a still life, while back near his room, Peter picks up a payphone, inserts a coin thoughtfully, sighs deeply, and then hangs up without ever making the call. His landlord appears, casually peeling an orange, and when Peter glances at him with an expression of searching curiosity, the landlord’s eyes widen in response. Then, both he and his daughter retreat into their apartment, with the daughter peeking out briefly to offer a small wave.\n\nAt the very top of the opulent Osborne apartment building, Mary Jane steps out of the elevator. She enters the luxurious penthouse where Harry is eagerly awaiting her arrival. Taking a deep, unhappy breath, she prepares herself for their interaction. As Harry busily cooks, he turns up the volume of the music, offering a playful grin at Mary Jane. In response, she returns his grin, and with enthusiasm, she starts dancing the twist. Harry, caught up in the whimsical moment, smiles back at her, and she encourages him to join in on the fun, playfully pulling him away from the task at the stove. He willingly joins her in dance, crouching low just as the pan behind him begins to emit a faint wisp of smoke."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the movie, a black-suited Spider-Man stands with an unforgiving gaze as he watches Flint gradually disintegrate until nothing remains, his particles eventually washing away. Later on, no longer clad in the Spider-Man suit, Peter strides through a rundown breeze block building, coming to a halt in front of a chipped mirror. There, he takes a moment to adjust his floppy forelock, scrutinizing his own reflection intently with a frown and eyes burning with intensity. Outside, his landlord is diligently mopping the floor, while Peter momentarily glances over at the landlord's daughter standing at a doorway. She soon makes her way over to join her father. Once inside his flat, Peter methodically closes the French windows leading to the balcony, creating a confined space for himself as he begins to pace around restlessly. This repetitive motion is broken when he halts to study his reflection in the mirror again. With a determined gesture, he unbuttons his shirt to expose the top of the black spider suit beneath, intricately detailed with its gray web and prominent spider emblem, regarding it with a mixture of uncertainty and fear. This moment of doubt culminates as he decisively tosses the suit back into the trunk and retreats from it wearily. The scene transitions to a later moment where he visits Aunt May, whose gaze pierces into his eyes, causing Peter to blink with uncertainty and a transient wavering in his expression as he looks at her gentle face. In the meantime, Mary Jane emerges from a jazz restaurant, passing beneath the still unlit blue and red neon sign. Her face is marred by a glum expression as she wraps her coat collar snugly around her neck and ventures away down the street. She navigates through the crowded pavement, her demeanor wretched and solitary, eventually finding herself on a bench where she hesitates over whether to call Peter Parker or Harry Osborne on her mobile. Elsewhere, Harry is engrossed in painting a still life with expert strokes. Concurrently, Peter stands by a payphone near his room, inserts a coin with a resigned sigh, then abruptly decides against the call, hanging up the receiver. His landlord appears nearby, peeling an orange, and when Peter casts a searching look in his direction, the landlord responds with widened eyes before retreating into his flat. His daughter lingers for a moment to peek out and wave at Peter. Meanwhile, at the top of the Osborne luxury apartment building, Mary Jane steps out of the elevator into the penthouse, where Harry awaits her arrival. She inhales deeply, her mood heavy with unhappiness, as Harry busily engages in cooking. He turns up the music volume, offering Mary Jane a broad grin, which she returns as she playfully begins to dance the twist. Smiling, Harry is encouraged by her enthusiastic invitation to join, and she pulls him away from the stove. He complies, joining in her dance, crouching lower even as the pan on the stove begins to emit smoke behind him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "In the movie, a black-suited Spider-Man watches emotionlessly as Flint disintegrates and is washed away. Later, Peter, now out of the Spider-Man suit, walks through a dilapidated building, pauses at a chipped mirror, adjusts his hair, and frowns at his fierce reflection. Outside, he notices his landlord mopping the floor while the landlord's daughter watches from a doorway. After she joins her father, Peter retreats to his flat, closes the French windows, paces restlessly, and examines his reflection again. He reveals the black spider suit beneath his shirt, contemplating it with uncertainty and fear before tossing it back into the trunk and backing away. Visiting Aunt May, Peter exchanges uncertain glances with her, his expression softening at her kind face. Meanwhile, Mary Jane leaves a jazz restaurant with a glum expression, wraps her coat collar tightly, and walks down the crowded street, feeling wretched and alone. She sits on a bench, hesitating over calling Peter or Harry Osborne. Harry is shown painting while Peter attempts a call from a payphone but ultimately hangs up. As Peter's landlord emerges with an orange, Peter's search for familiarity meets the landlord's surprised reaction, leading them to retreat into their flat as the daughter waves. In the Osborne penthouse, Mary Jane steps out of the lift into Harry's company. With a deep breath, she smiles at Harry, who is cooking and turns up the music, prompting her to dance. Harry joins in, crouching lower as the pan begins to smoke."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In the movie, a black-suited Spider-Man, wearing the infamous symbiote suit that amplifies aggression, looks on pitilessly as Flint Marko, known as the Sandman and a formidable adversary capable of transforming his body into sand, crumbles to nothing and washes away. Later, Peter Parker, no longer in the Spider-Man suit but still bearing the emotional weight of his alter ego, walks through a dilapidated breeze block building, remnants of the city's older, neglected architecture, and pauses to look at himself in a chipped mirror, a castoff from a bygone era. He adjusts his floppy forelock, a characteristic hairstyle that reflects his inner turmoil, and stares at his reflection with a frown and fierce eyes. Outside, his landlord, a hardworking immigrant trying to maintain a modest living space, is mopping the floor, and Peter glances at the landlord's daughter watching from a doorway, her curiosity reflecting the innocence of youth. She joins her father, eager to help, and inside his flat, Peter closes the French windows leading to the small urban balcony with a view of the bustling city below and paces restlessly before examining his reflection again. He unbuttons his shirt to reveal the top of the black spider suit, crafted with an alien material possessing a mind of its own, with its gray web and spider emblem and looks at it with uncertainty and fear before tossing it back into the old trunk, a relic of his early adventures, and backing away wearily. Later, he visits Aunt May, the matriarch and moral compass in his life, who looks into his eyes, making Peter blink uncertainly as his expression wavers, and he glances at her kindly face that has offered guidance and comfort throughout his life. Meanwhile, Mary Jane Watson, an aspiring actress tackling the harsh realities of the city, leaves a jazz restaurant that once showcased her singing talents with its blue and red neon sign still off, and with a glum expression, she wraps her coat collar around her neck, bracing against the chill of the evening air, and walks away down the street, looking wretched and alone in the crowded pavement before sitting on a bench, a solitary island amidst the human tide, and hesitating over calling Peter Parker or Harry Osborne on her mobile. Harry Osborne, son of the infamous industrial tycoon Norman Osborne, is seen painting a still life expertly, a hobby that distracts him from his family's dark legacy, as Peter picks up a payphone near his room, a relic in the age of mobile technology, drops a coin, sighs, and hangs up. His landlord emerges peeling an orange, a small indulgence, and when Peter looks at him searchingly, the landlord's eyes widen before he and his daughter retreat into their flat, with the daughter peeping out to wave, a small gesture of connection. At the top of the Osborne luxury apartment building, a symbol of the family's wealth and influence, Mary Jane exits the lift into the penthouse where Harry waits for her. She takes a deep unhappy breath, feeling the weight of their complicated relationship, and as Harry busily cooks, he turns up the music and grins at Mary Jane, who grins back and starts dancing the twist, a playful throwback to a dance from a more carefree era. Harry smiles, and she encourages him to join in, pulling him from the stove. He joins her, crouching lower as the pan behind him starts to smoke, an impending culinary disaster overshadowed by the momentary joy."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "In the movie a blacksuited SpiderMan looks on pitilessly as Flint crumbles to nothing and washes away. Later Peter no longer in the SpiderMan suit walks through a dilapidated breeze block building and pauses to look at himself in a chipped mirror. He adjusts his floppy forelock and stares at his reflection with a frown and fierce eyes. Outside his landlord is mopping the floor and Peter glances at the landlord's daughter watching from a doorway. She joins her father and inside his flat Peter closes the French windows to the balcony and paces restlessly before examining his reflection again. He unbuttons his shirt to reveal the top of the black spider suit with its gray web and spider emblem and looks at it with uncertainty and fear before tossing it back into the trunk and backing away wearily. Later he visits Aunt May who looks into his eyes making Peter blink uncertainly as his expression wavers and he glances at her kindly face. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Meanwhile Mary Jane leaves a jazz restaurant with its blue and red neon sign still off and with a glum expression she wraps her coat collar around her neck and walks away down the street looking wretched and alone in the crowded pavement before sitting on a bench and hesitating over calling Peter Parker or Harry Osborne on her mobile. Harry is seen painting a still life expertly as Peter picks up a payphone near his room drops a coin sighs and hangs up. His landlord emerges peeling an orange and when Peter looks at him searchingly the landlord's eyes widen before he and his daughter retreat into their flat with the daughter peeping out to wave. At the top of the Osborne luxury apartment building Mary Jane exits the lift into the penthouse where Harry waits for her. She takes a deep unhappy breath and as Harry busily cooks he turns up the music and grins at Mary Jane who grins back and starts dancing the twist. Harry smiles and she encourages him to join in pulling him from the stove. He joins her crouching lower as the pan behind him starts to smoke."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "In the movie a blacksuited SpiderMan looks on pitilessly as Flint crumbles to nothing and washes away. Later Peter no longer in the SpiderMan suit walks through a dilapidated breeze block building and pauses to look at himself in a chipped mirror. He adjusts his floppy forelock and stares at his reflection with a frown and fierce eyes. Outside his landlord is mopping the floor and Peter glances at the landlord's daughter watching from a doorway. She joins her father and inside his flat Peter closes the French windows to the balcony and paces restlessly before examining his reflection again. He unbuttons his shirt to reveal the top of the black spider suit with its gray web and spider emblem and looks at it with uncertainty and fear before tossing it back into the trunk and backing away wearily. Later he visits Aunt May who looks into his eyes making Peter blink uncertainly as his expression wavers and he glances at her kindly face. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Meanwhile Mary Jane leaves a jazz restaurant with its blue and red neon sign still off and with a glum expression she wraps her coat collar around her neck and walks away down the street looking wretched and alone in the crowded pavement before sitting on a bench and hesitating over calling Peter Parker or Harry Osborne on her mobile. Harry is seen painting a still life expertly as Peter picks up a payphone near his room drops a coin sighs and hangs up. His landlord emerges peeling an orange and when Peter looks at him searchingly the landlord's eyes widen before he and his daughter retreat into their flat with the daughter peeping out to wave. At the top of the Osborne luxury apartment building Mary Jane exits the lift into the penthouse where Harry waits for her. She takes a deep unhappy breath and as Harry busily cooks he turns up the music and grins at Mary Jane who grins back and starts dancing the twist. Harry smiles and she encourages him to join in pulling him from the stove. He joins her crouching lower as the pan behind him starts to smoke."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "In the movie a blacksuited SpiderMan looks on pitilessly as Flint crumbles to nothing and washes away. Later Peter no longer in the SpiderMan suit walks through a dilapidated breeze block building and pauses to look at himself in a chipped mirror. He adjusts his floppy forelock and stares at his reflection with a frown and fierce eyes. Outside his landlord is mopping the floor and Peter glances at the landlord's daughter watching from a doorway. She takes a deep unhappy breath and as Harry busily cooks he turns up the music and grins at Mary Jane who grins back and starts dancing the twist. Harry smiles and she encourages him to join in pulling him from the stove. He joins her crouching lower as the pan behind him starts to smoke."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "In the movie a blacksuited SpiderMan looks on pitilessly as Flint crumbles to nothing and washes away. Later Peter no longer in the SpiderMan suit walks through a dilapidated breeze block building and pauses to look at himself in a chipped mirror. He joins her crouching lower as the pan behind him starts to smoke."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "In the cartoon, a yellow-hatted astronaut observes serenely as Marvin dissolves into everything and blows away. Later, Alex, no longer in the astronaut uniform, skips through a decrepit brick house and stops to examine himself in a shattered window. He straightens his curly whiskers and glares at his phantom with a grin and sleepy eyes. Inside, his mailman is slicing the bread, and Alex nods at the mailman's cousin peeking from a curtain. She joins her uncle, and inside his cave, Alex closes the sliding doors to the patio and hops anxiously before inspecting his phantom again. He zips up his coat to reveal the edge of the yellow spacesuit with its pink stripes and star insignia and gawks at it with joy and pride before tossing it back into the crate and leaping away lazily. Later, he visits Aunt Lisa, who stares into his ears, making Alex sneeze noisily as his posture trembles, and he nods at her gentle hands. Meanwhile, Carla jumps from a tram station with its yellow and green neon lights still on, and with a lazy smile, she tucks her scarf hem around her wrist and hops away down the boulevard, feeling cheerful and joyous in the crowded meadow before lying on a blanket and mulling over calling Alex Clark or Benny Drake on her camera. Benny is seen sculpting a portrait clumsily as Alex grabs a notepad near his cabin, snaps a pencil, yawns, and puts it down. His mailman appears juggling a banana, and when Alex nods at him playfully, the mailman's grin widens before he and his cousin scuttle into their cave, with the cousin sneaking out to wink. At the bottom of the Drake rural cabin, Carla enters the tram into the cellar where Benny beckons for her. She takes a deep happy sip, and as Benny lazily cleans, he turns off the radio and frowns at Carla, who frowns back and begins spinning the boogie. Benny frowns, and she urges him to relax, pushing him from the counter. He relaxes, flipping sideways as the sink beside him starts to flood."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In the movie, Spider-Man, clad in a black suit, coldly watches Flint disintegrate. Later, Peter, out of his Spider-Man attire, introspectively observes his reflection in a dilapidated building, revealing and then discarding the black suit with apprehension. Peter visits Aunt May, who looks at him compassionately, causing his expression to waver. Meanwhile, Mary Jane leaves a jazz restaurant feeling lonely and debates calling Peter or Harry. Harry, painting expertly, is seen while Peter struggles with a phone call. Peter's landlord, with his daughter, is seen retreating into their flat. Mary Jane arrives at Harry's penthouse, and as he cooks, they share a moment, dancing together despite the pan starting to smoke."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He joins her crouching lower as the pan behind him starts to smoke Harry smiles and she encourages him to join in pulling him from the stove She takes a deep unhappy breath and as Harry busily cooks he turns up the music and grins at Mary Jane who grins back and starts dancing the twist At the top of the Osborne luxury apartment building Mary Jane exits the lift into the penthouse where Harry waits for her His landlord emerges peeling an orange and when Peter looks at him searchingly the landlord's eyes widen before he and his daughter retreat into their flat with the daughter peeping out to wave Harry is seen painting a still life expertly as Peter picks up a payphone near his room drops a coin sighs and hangs up Meanwhile Mary Jane leaves a jazz restaurant with its blue and red neon sign still off and with a glum expression she wraps her coat collar around her neck and walks away down the street looking wretched and alone in the crowded pavement before sitting on a bench and hesitating over calling Peter Parker or Harry Osborne on her mobile Later he visits Aunt May who looks into his eyes making Peter blink uncertainly as his expression wavers and he glances at her kindly face He unbuttons his shirt to reveal the top of the black spider suit with its gray web and spider emblem and looks at it with uncertainty and fear before tossing it back into the trunk and backing away wearily She joins her father and inside his flat Peter closes the French windows to the balcony and paces restlessly before examining his reflection again Outside his landlord is mopping the floor and Peter glances at the landlord's daughter watching from a doorway He adjusts his floppy forelock and stares at his reflection with a frown and fierce eyes Later Peter no longer in the SpiderMan suit walks through a dilapidated breeze block building and pauses to look at himself in a chipped mirror In the movie a blacksuited SpiderMan looks on pitilessly as Flint crumbles to nothing and washes away"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Later Peter no longer in the SpiderMan suit walks through a dilapidated breeze block building and pauses to look at himself in a chipped mirror In the movie a blacksuited SpiderMan looks on pitilessly as Flint crumbles to nothing and washes away Outside his landlord is mopping the floor and Peter glances at the landlord's daughter watching from a doorway He adjusts his floppy forelock and stares at his reflection with a frown and fierce eyes He unbuttons his shirt to reveal the top of the black spider suit with its gray web and spider emblem and looks at it with uncertainty and fear before tossing it back into the trunk and backing away wearily She joins her father and inside his flat Peter closes the French windows to the balcony and paces restlessly before examining his reflection again Meanwhile Mary Jane leaves a jazz restaurant with its blue and red neon sign still off and with a glum expression she wraps her coat collar around her neck and walks away down the street looking wretched and alone in the crowded pavement before sitting on a bench and hesitating over calling Peter Parker or Harry Osborne on her mobile Later he visits Aunt May who looks into his eyes making Peter blink uncertainly as his expression wavers and he glances at her kindly face His landlord emerges peeling an orange and when Peter looks at him searchingly the landlord's eyes widen before he and his daughter retreat into their flat with the daughter peeping out to wave Harry is seen painting a still life expertly as Peter picks up a payphone near his room drops a coin sighs and hangs up She takes a deep unhappy breath and as Harry busily cooks he turns up the music and grins at Mary Jane who grins back and starts dancing the twist At the top of the Osborne luxury apartment building Mary Jane exits the lift into the penthouse where Harry waits for her He joins her crouching lower as the pan behind him starts to smoke Harry smiles and she encourages him to join in pulling him from the stove"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Meanwhile Mary Jane leaves a jazz restaurant with its blue and red neon sign still off and with a glum expression she wraps her coat collar around her neck and walks away down the street looking wretched and alone in the crowded pavement before sitting on a bench and hesitating over calling Peter Parker or Harry Osborne on her mobile Harry is seen painting a still life expertly as Peter picks up a payphone near his room drops a coin sighs and hangs up His landlord emerges peeling an orange and when Peter looks at him searchingly the landlord's eyes widen before he and his daughter retreat into their flat with the daughter peeping out to wave At the top of the Osborne luxury apartment building Mary Jane exits the lift into the penthouse where Harry waits for her She takes a deep unhappy breath and as Harry busily cooks he turns up the music and grins at Mary Jane who grins back and starts dancing the twist Harry smiles and she encourages him to join in pulling him from the stove He joins her crouching lower as the pan behind him starts to smoke In the movie a blacksuited SpiderMan looks on pitilessly as Flint crumbles to nothing and washes away Later Peter no longer in the SpiderMan suit walks through a dilapidated breeze block building and pauses to look at himself in a chipped mirror He adjusts his floppy forelock and stares at his reflection with a frown and fierce eyes Outside his landlord is mopping the floor and Peter glances at the landlord's daughter watching from a doorway She joins her father and inside his flat Peter closes the French windows to the balcony and paces restlessly before examining his reflection again He unbuttons his shirt to reveal the top of the black spider suit with its gray web and spider emblem and looks at it with uncertainty and fear before tossing it back into the trunk and backing away wearily Later he visits Aunt May who looks into his eyes making Peter blink uncertainly as his expression wavers and he glances at her kindly face"
        }
      ]
    }
  ]
}