{
  "ground_truth": "Harry turns back to the stove and pours his egg, after which Mary Jane sprinkles on the cheese, and Harry adds some rocket. He flicks the omelette in half and tries to toss it in the pan, but half of it falls to the floor. Later, they read the script, and Mary Jane brushes Harry's dark hair back from his brow, meeting his adoring eyes. She pulls him towards her, and they kiss, but Mary Jane breaks off with a guilty look. Harry watches helplessly as she hurries down the black and white marble floored hallway into the lift. He storms into the study, grabs at the canter, and takes his wig, as his father's portrait glowers down at him. Harry gates, turns towards a tall mirror, and stares at his reflection, moving slowly towards it with an outstretched hand. As his fingers touch the glass, in a flashback, he sees Spider-Man standing over Norman's body and remembers pulling the Spider-Man mask off Peter's face. He remembers falling and waking up in the hospital, and his father looks back at him from the mirror. At night, Mary Jane comes home and hits the light switch, but the lights don't come on. Harry, in his Goblin suit, grabs Mary Jane by the throat, hovering on his sky stick as he holds her against the wall. Ursula, the landlord's daughter, smiles awkwardly as he hurries into the hallway. Peter nervously takes up the receiver. A couple strolls by the boating lake in Central Park as Peter, wearing a blue jumper over a blue shirt and jeans and clutching a small posy of flowers, stops in his tracks upon spotting Mary Jane standing alone in the middle of a graceful cast iron bridge. He hurries on to meet her and offers up the flowers, but she looks at them unhappily and turns aside, putting her hand over her eyes. Peter fumbles in his pocket for Aunt May's ring and, looking as if he's been hit in the stomach, watches in numb shock as she hurries away off the bridge. A little further along the lake, Harry leans against a tree observing the scene. He turns with a cruel smile as Mary Jane comes past, arms folded, glaring at him, and Mary Jane turns away angrily and carries on. Harry lets his head drop against the tree trunk with a smile of satisfaction. Later, he meets Peter in a coffee shop, draws breath, and Peter looks Harry in the eye before shaking his head and looking away in a daze. Blinking in shock and disbelief, Peter gets up and leaves as a waitress comes over to Harry with a coffee jar and Harry grins. Peter, crossing the road, turns and looks back.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here is the transformed text:\n\nHarry rotates back to the cooker and decants his egg, after which Mary Jane scatters on the cheese, and Harry includes some arugula. He flips the omelet in half and attempts to throw it in the skillet, but half of it drops to the ground. Later, they peruse the script, and Mary Jane brushes Harry's dark mane back from his forehead, meeting his adoring gaze. She draws him towards her, and they kiss, but Mary Jane breaks off with a guilty expression. Harry observes helplessly as she rushes down the black and white marble tiled corridor into the elevator. He storms into the study, snatches at the decanter, and takes his wig, as his father's likeness glowers down at him. Harry gates, rotates towards a tall mirror, and gazes at his image, moving slowly towards it with an outstretched hand. As his fingers touch the glass, in a recollection, he sees Spider-Man standing over Norman's body and recalls pulling the Spider-Man mask off Peter's visage. He remembers falling and awakening in the hospital, and his father looks back at him from the mirror. At night, Mary Jane arrives home and hits the light switch, but the lights don't come on. Harry, in his Goblin attire, seizes Mary Jane by the throat, hovering on his sky stick as he holds her against the wall. Ursula, the landlord's daughter, smiles awkwardly as he rushes into the corridor. Peter nervously picks up the receiver. A couple ambles by the boating lake in Central Park as Peter, wearing a blue sweater over a blue shirt and jeans and clutching a small bouquet of flowers, stops in his tracks upon spotting Mary Jane standing alone in the middle of a graceful cast iron bridge. He rushes on to meet her and offers up the flowers, but she looks at them unhappily and turns aside, placing her hand over her eyes. Peter fumbles in his pocket for Aunt May's ring and, looking as if he's been hit in the stomach, watches in numb shock as she hurries away off the bridge. A little further along the lake, Harry leans against a tree observing the scene. He turns with a cruel smile as Mary Jane comes past, arms folded, glaring at him, and Mary Jane turns away angrily and continues on. Harry lets his head drop against the tree trunk with a smile of gratification. Later, he meets Peter in a coffee shop, draws breath, and Peter looks Harry in the eye before shaking his head and looking away in a daze. Blinking in shock and disbelief, Peter gets up and departs as a waitress comes over to Harry with a coffee pot and Harry grins. Peter, crossing the road, rotates and looks back."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The stove was turned back to by Harry, and his egg was poured by him, after which the cheese is sprinkled on by Mary Jane, and some rocket is added by Harry. The omelette is flicked in half by him, and he tries to toss it in the pan, but the floor is where half of it falls. Later, the script is read by them, and Harry's dark hair is brushed back from his brow by Mary Jane, who meets his adoring eyes. He is pulled towards her by her, and they kiss, but a guilty look breaks them off with Mary Jane. She is watched helplessly by Harry as she hurries down the black and white marble floored hallway into the lift. The study is stormed into by him, the canter is grabbed at, and his wig is taken by him as his father's portrait glowers down at him. The mirror is turned towards by Harry, who stares at his reflection, moving slowly towards it with an outstretched hand. As the glass is touched by his fingers, in a flashback, Spider-Man is seen standing over Norman's body by him, and the Spider-Man mask is remembered being pulled off Peter's face by him. He remembers having fallen and waking up in the hospital, and his father looks back at him from the mirror. At night, home is come by Mary Jane, and the light switch is hit by her, but the lights don't come on. Mary Jane is grabbed by the throat by Harry, in his Goblin suit, while he hovers on his sky stick as she is held against the wall. Ursula, the landlord's daughter, smiles awkwardly and hurries into the hallway. The receiver is nervously taken up by Peter. The boating lake in Central Park is strolled by a couple as Mary Jane is spotted standing alone in the middle of a graceful cast iron bridge by Peter, wearing a blue jumper over a blue shirt and jeans, and clutching a small posy of flowers, who stops in his tracks. He hurries on to meet her, and the flowers are offered up by him, but at them, she looks unhappily and turns aside, putting her hand over her eyes. Aunt May's ring is fumbled for in his pocket by Peter, and looking as if he's been hit in the stomach, shock is watched in numbness by him as she hurries away off the bridge. A little further along the lake, Harry leans against a tree, observing the scene. A cruel smile is turned with by him as past comes Mary Jane, arms folded, glaring at him, and angrily, Mary Jane turns away and carries on. Harry lets his head drop against the tree trunk with a smile of satisfaction. Later, Peter is met by him in a coffee shop, breath is drawn, and Harry is looked in the eye by Peter before shaking his head and looking away in a daze. Shock and disbelief are blinked in by Peter, who gets up and leaves as a waitress comes over to Harry with a coffee jar and Harry grins. The road is crossed by Peter, who turns and looks back."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry turns back to the stove and pours his egg as Mary Jane sprinkles cheese, and he adds rocket. He folds the omelette, but half falls to the floor. Later, reading the script, Mary Jane brushes back Harry's hair, meeting his eyes. She pulls him in for a kiss but breaks away guiltily. Harry watches her hurry down the marble hallway into the elevator. He storms into the study, grabs the decanter, and his wig, while his father's portrait glowers. Harry turns to a mirror, reaching out to it. In a flashback, he sees Spider-Man over Norman's body and remembers unmasking Peter. He recalls falling, waking in the hospital, and seeing his father in the mirror. At night, Mary Jane enters her dark apartment, and Harry, in his Goblin suit, seizes her by the throat against the wall. Ursula, the landlord's daughter, smiles awkwardly as he hurries down the hallway. Peter nervously answers the phone. In Central Park, Peter, wearing a blue jumper and jeans, stops upon seeing Mary Jane on a bridge. He offers flowers, but she turns away, upset. Peter fumbles for Aunt May's ring and watches as she hurries off. Nearby, Harry leans against a tree, smiling as Mary Jane passes by angrily. Later, Harry meets Peter in a coffee shop. Peter, shocked, leaves as a waitress approaches Harry with coffee. Peter, crossing the road, turns to look back."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry pours his egg on the stove, and Mary Jane adds cheese and rocket. He folds the omelette but drops half on the floor. Later, as they read the script, Mary Jane brushes Harry's hair, meeting his eyes. They kiss, but Mary Jane pulls back with guilt and rushes to the lift. Harry storms to the study, grabs a decanter, and stares at his reflection. Touching the mirror, he recalls Spider-Man over Norman’s body and removing the mask to reveal Peter. He remembers his fall and awakening in the hospital, with his father in the reflection. At night, Mary Jane arrives home, but the lights stay off. Harry, in his Goblin suit, grabs her by the throat against the wall. Ursula smiles awkwardly in the hallway. Peter nervously answers a call. In Central Park, Peter, in a blue jumper and jeans, stops upon seeing Mary Jane on a bridge. He offers flowers, but she turns away, upset. Peter, shocked, watches her leave, fumbling for Aunt May's ring. Harry observes, smirking as Mary Jane glares and walks past. Satisfied, Harry meets Peter in a coffee shop. They exchange glances, and Peter leaves in disbelief as a waitress serves Harry. Peter crosses the street, looking back."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry turns back to face the stove with determined concentration and carefully pours his egg mixture into the pan. As soon as he is done, Mary Jane quickly steps in to sprinkle on the cheese generously, and Harry follows by adding a handful of fresh rocket. He then attempts to show off by flicking the omelette in half and trying to toss it in the pan, but his maneuver goes awry as half of the omelette disastrously falls to the floor. Later on, they find themselves engrossed in reading the script together, and Mary Jane gently brushes Harry's dark hair back from his brow, locking eyes with his adoring gaze. She pulls him towards her, and they share a tender kiss, but Mary Jane eventually breaks off the embrace with a look of guilt on her face. Harry watches with helpless longing as she hurries away, down the hallway with its striking black and white marble flooring, and disappears into the waiting lift. Frustrated, he storms into the study, seizes the decanter, and takes hold of his wig, while his father's portrait looms above him, glowering down with disapproval. Harry then turns and makes his way towards a tall, imposing mirror, staring intently at his own reflection as he moves slowly forward with an outstretched hand. Just as his fingers make contact with the cold glass, he is suddenly transported into a vivid flashback. In this memory, he sees Spider-Man standing over Norman's lifeless body and remembers the intense moment of pulling the Spider-Man mask off Peter's face, followed by recalling how he fell and eventually awoke in the hospital. As he looks into the mirror, it is as if his father's eyes are staring back at him. Later that night, Mary Jane arrives home and flips the light switch, but to her surprise, the lights remain off. In a dramatic turn of events, Harry, now clad in his Goblin suit, seizes Mary Jane by the throat, hovering menacingly on his sky stick as he presses her against the wall. Meanwhile, Ursula, the landlord's daughter, stands outside, smiling awkwardly while watching him hurry into the hallway. At that moment, Peter nervously answers the receiver. Meanwhile, at Central Park's picturesque boating lake, a couple leisurely strolls by as Peter, dressed in a blue jumper layered over a blue shirt and jeans and clutching a small posy of flowers, comes to a sudden halt upon spotting Mary Jane standing alone, pensive, in the middle of a gracefully arched, cast-iron bridge. With urgency, he hurries to meet her, offering the flowers with hope, but she looks at them with unhappiness and turns away, placing her hand over her eyes in despair. Peter, fumbling desperately in his pocket for Aunt May's cherished ring, appears as if he's been struck in the stomach. In a state of numb shock, he watches as Mary Jane hurries away from the bridge, leaving him behind. Not far away, leaning casually against a tree, Harry observes the scene unfold with interest. As Mary Jane walks past him, arms crossed and glaring, Harry turns with a cruel, triumphant smile. Mary Jane angrily averts her gaze and continues on her way. Harry, filled with satisfaction, lets his head rest against the tree trunk, still smiling. Later, in a bustling coffee shop, he meets Peter. Harry draws a deep breath, and Peter looks him in the eye, then shakes his head in a daze, looking away. Filled with shock and disbelief, Peter gets up abruptly and leaves, just as a waitress approaches Harry with a coffee jar, and Harry grins slyly. As Peter crosses the road, he turns and casts a final, lingering glance back."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry turns back to face the stove with a look of determined concentration etched across his face, and with utmost care, he proceeds to pour his egg mixture into the waiting pan. As soon as he completes this task, Mary Jane swiftly steps in to generously sprinkle cheese over the mixture, and Harry follows suit by adding a handful of fresh rocket leaves. Buoyed by a burst of confidence, he then attempts to show off a little by flicking the omelette in half and trying to skillfully toss it in the pan, but his maneuver goes awry when half of the omelette disastrously lands on the floor.\n\nLater in the day, they find themselves immersed in the script they are reading together, and Mary Jane gently brushes Harry's dark hair back from his brow, meeting his adoring gaze with her own. She pulls him towards her for a tender kiss, but after a moment, she eventually breaks off the embrace, her face now clouded with a look of guilt. Harry watches with helpless longing as she quickly hurries away, making her way down the hallway with its striking black and white marble flooring, before disappearing into the waiting lift.\n\nFeeling frustrated, Harry storms into the study, seizes the decanter, and takes hold of his wig, all while his father's portrait looms above him, glowering down with visible disapproval. Harry then turns and makes his way towards a tall, imposing mirror, staring intently at his own reflection as he moves slowly forward with an outstretched hand. Just as his fingers make contact with the cold, unforgiving glass, he is suddenly swept away into a vivid flashback. In this intense memory, he sees Spider-Man standing over Norman's lifeless body and recalls the pivotal moment of pulling the Spider-Man mask off Peter's face, followed by remembering how he fell and eventually found himself awakening in the hospital. As he looks into the mirror, it appears as if his father's eyes are staring back at him with judgment.\n\nLater that night, Mary Jane arrives home and flips the light switch, but to her surprise and alarm, the lights remain stubbornly off. In a dramatic turn of events, Harry, now clad ominously in his Goblin suit, seizes Mary Jane by the throat, hovering menacingly on his sky stick as he presses her forcefully against the wall. Meanwhile, Ursula, the landlord's daughter, stands just outside, smiling awkwardly as she observes him hurry into the hallway.\n\nAt that very moment, Peter nervously answers the receiver. Meanwhile, at Central Park's picturesque boating lake, a couple takes a leisurely stroll, while Peter, attired in a blue jumper layered over a blue shirt and jeans and clutching a small posy of flowers, comes to a sudden halt upon seeing Mary Jane standing alone, looking pensive in the middle of a gracefully arched, cast-iron bridge. Urgently, he hurries over to meet her, offering the flowers with a sense of hope, but she merely looks at them with unhappiness and turns away, placing her hand over her eyes in despair.\n\nPeter, now fumbling desperately in his pocket for Aunt May's cherished ring, appears as though he's been struck in the stomach by an emotional blow. In a state of numb shock, he watches silently as Mary Jane hurries away from the bridge, leaving him standing behind. Not far away, leaning casually against a tree, Harry observes the unfolding scene with keen interest. As Mary Jane walks past him, arms crossed and glaring, Harry turns towards her with a cruel, triumphant smile. Mary Jane, filled with anger, averts her gaze and continues on her way. Harry, filled with satisfaction at the turn of events, lets his head rest back against the trunk of the tree, still maintaining his smile.\n\nLater on, in a bustling coffee shop brimming with life, he meets with Peter. Harry draws in a deep breath as Peter looks him directly in the eye, then shakes his head in a daze, looking away in disbelief. Filled with shock and disbelief, Peter abruptly gets up and leaves, just as a waitress approaches Harry with a coffee jar, and Harry grins slyly. As Peter crosses the road outside, he turns back and casts a final, lingering glance back at Harry."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Harry pivots back to the stove, carefully lifting the pan to pour the egg mixture in a smooth motion, creating a sizzling sound as it meets the hot surface. Mary Jane stands beside him, watching intently, and with precise fingers, she sprinkles cheese over the cooking omelette while Harry deftly adds a handful of fresh rocket leaves on top. With a practiced flick of his wrist, Harry attempts to fold the omelette in half, preparing to toss it with a confident lift, but misjudges the arc, causing half of the omelette to plummet to the floor. Sometime later, they sit together, and as they delve into reading the script, Mary Jane reaches over tenderly, brushing back the dark strands of Harry's hair from his brow and locking eyes with him, brimming with adoration. She draws him closer, and they share a kiss, but Mary Jane abruptly pulls away, her expression shifting to one of guilt. Harry, feeling a pang of helplessness, watches as she rushes down the elegant hallway adorned with black and white marble flooring, making her way swiftly to the lift. In a surge of frustration, Harry storms into the study, his eyes catching the stern gaze of his father's portrait looking down at him. He grabs at the canter with urgency, securing his wig with one hand. Standing before a tall mirror, Harry gazes at his reflection, his expression one of contemplative introspection as he slowly extends his hand towards the glass. At the moment his fingers connect with the cool surface, a vivid flashback is triggered, and he vividly recalls Spider-Man standing over Norman's motionless body. The memory continues as he re-experiences the shock of removing the Spider-Man mask to reveal Peter's face, the sensation of falling, and the abrupt awakening in the hospital, with his father's image now peering back at him from the mirror. As night envelops the scene, Mary Jane returns home, her fingers flipping the light switch, only to be met with unrelenting darkness. Suddenly, Harry, donning his Goblin suit, seizes Mary Jane by the throat, lifting her with effortless strength as he hovers on his sky stick and pins her against the wall. In another part of the building, Ursula, the landlord's daughter, catches a glimpse and offers a nervous smile while retreating hastily into the hallway. Meanwhile, Peter, filled with anxiety, reaches for the receiver with trembling fingers. A couple saunters leisurely by the boating lake in Central Park, setting a serene backdrop, as Peter, clad in a matching blue jumper and shirt accompanied by jeans, clutches a small bouquet of flowers. Spotting Mary Jane standing alone on a graceful cast iron bridge, he halts abruptly. Gathering his resolve, he advances eagerly towards her, presenting the flowers with hope, but her face clouds with unhappiness as she turns away, shielding her eyes with her hand. Flustered, Peter searches his pocket for Aunt May's ring, but his heart sinks as he witnesses Mary Jane, looking distressed, rush away from him and off the bridge, leaving him standing in a state of numb shock. Not far away, Harry leans nonchalantly against a tree, his eyes fixed on the unfolding scene. He turns away with a cruel smile playing on his lips as Mary Jane storms past, her arms crossed defiantly and her glare fixed on him. In response, Harry's smile deepens with satisfaction as his head gently taps against the tree trunk. Later, meeting Peter in a coffee shop, Harry inhales deeply, prepared to speak, but Peter intercepts with a penetrating gaze into Harry's eyes before lowering his head and turning away, visibly dazed. Blinking rapidly with a mixture of shock and disbelief, Peter rises from his seat and departs, even as a waitress approaches Harry with a coffee jar, provoking a grin from him. As Peter navigates across the road, he pauses momentarily, glancing back with an expression of lingering emotion."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry prepares an omelette with Mary Jane, who sprinkles cheese while he adds rocket, but their attempt at flipping it results in half falling to the floor. Later, as they read a script, a tender moment is shared when Mary Jane brushes Harry's hair back and they kiss, though she quickly pulls away and leaves, looking guilty. Harry, feeling helpless, watches her rush away and then reacts by confronting his reflection in the study, haunted by a flashback of Spider-Man over Norman's body and the revelation of Peter's identity. That night, Mary Jane returns home to a dark apartment and finds herself confronted by Harry in his Goblin suit. He hovers menacingly on his sky stick, intimidating her. Elsewhere, Ursula, the landlord's daughter, gives a nervous smile, while Peter, dressed casually, heads to Central Park where he sees Mary Jane on a bridge. He approaches her with flowers, but she reacts coldly and leaves, leaving Peter stunned. Harry observes this exchange from a distance, relishing the situation before he and Mary Jane have a tense encounter where she storms past him. Harry, pleased, later meets Peter in a coffee shop. After exchanging tense glances, Peter leaves in shock, while Harry grins as a waitress serves him. As Peter crosses the street, he glances back, caught in the moment's disbelief."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry turns back to the stove, an old cast iron design that has been in the family for generations, and pours his egg, after which Mary Jane sprinkles on the cheese, a sharp cheddar from a local farm known for its artisanal products, and Harry adds some rocket, a leafy green also known as arugula popular in Mediterranean cuisine. He flicks the omelette in half, a technique he learned from watching his favorite cooking show, and tries to toss it in the pan, but half of it falls to the floor. Later, they read the script, a play they're performing in for a local theater group, and Mary Jane brushes Harry's dark hair back from his brow, meeting his adoring eyes. She pulls him towards her, and they kiss, but Mary Jane breaks off with a guilty look. Harry watches helplessly as she hurries down the black and white marble floored hallway, reminiscent of classic Victorian design, into the lift. He storms into the study, lined with shelves of dusty old books, grabs at the decanter filled with his father's favorite bourbon, and takes his wig, a reminder of his role as the Green Goblin, as his father's portrait, painted during his final year, glowers down at him. Harry gates, turns towards a tall mirror framed in ornate gold, and stares at his reflection, moving slowly towards it with an outstretched hand. As his fingers touch the glass, he is transported back to a memory, in a flashback, where he sees Spider-Man standing over Norman's body after the fatal confrontation and remembers pulling the Spider-Man mask off Peter's face. He remembers falling and waking up in the hospital, under the care of the city's best doctors, and his father looks back at him from the mirror. At night, Mary Jane comes home to her modest apartment and hits the light switch, but the lights don't come on due to a recent blackout in the area. Harry, in his Goblin suit inherited from his father, grabs Mary Jane by the throat, hovering on his sky stick, an advanced piece of technology developed by Oscorp, as he holds her against the wall. Ursula, the landlord's daughter known for her baking skills, smiles awkwardly as he hurries into the hallway. Peter nervously takes up the receiver, though the connection crackles due to the storm outside. A couple strolls by the boating lake in Central Park, a famous New York City landmark popular for romantic walks, as Peter, wearing a blue jumper over a blue shirt and jeans and clutching a small posy of flowers he picked up from the florist on 5th Avenue, stops in his tracks upon spotting Mary Jane standing alone in the middle of a graceful cast iron bridge, one known for its scenic views. He hurries on to meet her and offers up the flowers, but she looks at them unhappily and turns aside, putting her hand over her eyes. Peter fumbles in his pocket for Aunt May's ring, a family heirloom passed down through several generations, and, looking as if he's been hit in the stomach, watches in numb shock as she hurries away off the bridge. A little further along the lake, Harry leans against a tree, a towering oak that has been there for a century, observing the scene. He turns with a cruel smile as Mary Jane comes past, arms folded, glaring at him, and Mary Jane turns away angrily and carries on. Harry lets his head drop against the tree trunk with a smile of satisfaction, feeling victorious in his ongoing feud with Peter. Later, he meets Peter in a coffee shop, one frequented by college students due to its strong brews, draws breath, and Peter looks Harry in the eye before shaking his head and looking away in a daze. Blinking in shock and disbelief, Peter gets up and leaves as a waitress, familiar with their frequent visits, comes over to Harry with a coffee jar and Harry grins, feeling the tension in the air. Peter, crossing the road bustling with evening traffic, turns and looks back, his mind racing with thoughts."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Harry turns back to the stove and pours his egg after which Mary Jane sprinkles on the cheese and Harry adds some rocket. He flicks the omelette in half and tries to toss it in the pan but half of it falls to the floor. Later they read the script and Mary Jane brushes Harry's dark hair back from his brow meeting his adoring eyes. She pulls him towards her and they kiss but Mary Jane breaks off with a guilty look. Harry watches helplessly as she hurries down the black and white marble floored hallway into the lift. He storms into the study grabs at the canter and takes his wig as his father's portrait glowers down at him. Harry gates turns towards a tall mirror and stares at his reflection moving slowly towards it with an outstretched hand. As his fingers touch the glass in a flashback he sees SpiderMan standing over Norman's body and remembers pulling the SpiderMan mask off Peter's face. He remembers falling and waking up in the hospital and his father looks back at him from the mirror. At night Mary Jane comes home and hits the light switch but the lights do not come on. Harry in his Goblin suit grabs Mary Jane by the throat hovering on his sky stick as he holds her against the wall. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Ursula the landlord's daughter smiles awkwardly as he hurries into the hallway. Peter nervously takes up the receiver. A couple strolls by the boating lake in Central Park as Peter wearing a blue jumper over a blue shirt and jeans and clutching a small posy of flowers stops in his tracks upon spotting Mary Jane standing alone in the middle of a graceful cast iron bridge. He hurries on to meet her and offers up the flowers but she looks at them unhappily and turns aside putting her hand over her eyes. Peter fumbles in his pocket for Aunt May's ring and looking as if he is been hit in the stomach watches in numb shock as she hurries away off the bridge. A little further along the lake Harry leans against a tree observing the scene. He turns with a cruel smile as Mary Jane comes past arms folded glaring at him and Mary Jane turns away angrily and carries on. Harry let us his head drop against the tree trunk with a smile of satisfaction. Later he meets Peter in a coffee shop draws breath and Peter looks Harry in the eye before shaking his head and looking away in a daze. Blinking in shock and disbelief Peter gets up and leaves as a waitress comes over to Harry with a coffee jar and Harry grins. Peter crossing the road turns and looks back."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Harry turns back to the stove and pours his egg after which Mary Jane sprinkles on the cheese and Harry adds some rocket. He flicks the omelette in half and tries to toss it in the pan but half of it falls to the floor. Later they read the script and Mary Jane brushes Harry's dark hair back from his brow meeting his adoring eyes. She pulls him towards her and they kiss but Mary Jane breaks off with a guilty look. Harry watches helplessly as she hurries down the black and white marble floored hallway into the lift. He storms into the study grabs at the canter and takes his wig as his father's portrait glowers down at him. Harry gates turns towards a tall mirror and stares at his reflection moving slowly towards it with an outstretched hand. As his fingers touch the glass in a flashback he sees SpiderMan standing over Norman's body and remembers pulling the SpiderMan mask off Peter's face. He remembers falling and waking up in the hospital and his father looks back at him from the mirror. At night Mary Jane comes home and hits the light switch but the lights do not come on. Harry in his Goblin suit grabs Mary Jane by the throat hovering on his sky stick as he holds her against the wall. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Ursula the landlord's daughter smiles awkwardly as he hurries into the hallway. Peter nervously takes up the receiver. A couple strolls by the boating lake in Central Park as Peter wearing a blue jumper over a blue shirt and jeans and clutching a small posy of flowers stops in his tracks upon spotting Mary Jane standing alone in the middle of a graceful cast iron bridge. He hurries on to meet her and offers up the flowers but she looks at them unhappily and turns aside putting her hand over her eyes. Peter fumbles in his pocket for Aunt May's ring and looking as if he is been hit in the stomach watches in numb shock as she hurries away off the bridge. A little further along the lake Harry leans against a tree observing the scene. He turns with a cruel smile as Mary Jane comes past arms folded glaring at him and Mary Jane turns away angrily and carries on. Harry let us his head drop against the tree trunk with a smile of satisfaction. Later he meets Peter in a coffee shop draws breath and Peter looks Harry in the eye before shaking his head and looking away in a daze. Blinking in shock and disbelief Peter gets up and leaves as a waitress comes over to Harry with a coffee jar and Harry grins. Peter crossing the road turns and looks back."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Harry turns back to the stove and pours his egg after which Mary Jane sprinkles on the cheese and Harry adds some rocket. He flicks the omelette in half and tries to toss it in the pan but half of it falls to the floor. Later they read the script and Mary Jane brushes Harry's dark hair back from his brow meeting his adoring eyes. She pulls him towards her and they kiss but Mary Jane breaks off with a guilty look. Harry watches helplessly as she hurries down the black and white marble floored hallway into the lift. He storms into the study grabs at the canter and takes his wig as his father's portrait glowers down at him. He turns with a cruel smile as Mary Jane comes past arms folded glaring at him and Mary Jane turns away angrily and carries on. Harry let us his head drop against the tree trunk with a smile of satisfaction. Later he meets Peter in a coffee shop draws breath and Peter looks Harry in the eye before shaking his head and looking away in a daze. Blinking in shock and disbelief Peter gets up and leaves as a waitress comes over to Harry with a coffee jar and Harry grins. Peter crossing the road turns and looks back."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Harry turns back to the stove and pours his egg after which Mary Jane sprinkles on the cheese and Harry adds some rocket. He flicks the omelette in half and tries to toss it in the pan but half of it falls to the floor. Later they read the script and Mary Jane brushes Harry's dark hair back from his brow meeting his adoring eyes. Blinking in shock and disbelief Peter gets up and leaves as a waitress comes over to Harry with a coffee jar and Harry grins. Peter crossing the road turns and looks back."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Ron twists back to the fireplace and spills his pasta, after which Lucy sprinkles on the chocolate, and Ron adds some dandelions. He folds the pancake in quarters and tries to flip it in the skillet, but part of it lands on the carpet. Later, they sketch the painting, and Lucy ruffles Ron's curly beard away from his cheek, spotting his amused ears. She pulls him nearer, and they embrace, but Lucy breaks away with an embarrassed smirk. Ron gazes helplessly as she races through the red and green tiled corridor into the elevator. He stomps into the library, snatches at the umbrella, and takes his hat, as his uncle’s photograph frowns down at him. Ron exits, turns towards a round window, and examines his outline, gliding slowly towards it with an open hand. As his knuckles graze the screen, in a daydream, he sees Batman looming over Alfred’s statue and recalls tearing the Batman cape off Bruce’s head. He recalls tripping and waking up in the cabin, and his uncle gazes back at him from the window. At dawn, Lucy returns home and taps the wall switch, but the lamps remain off. Ron, in his Robot costume, seizes Lucy by the elbow, floating on his hoverboard as he pins her against the bookshelf. Wendy, the chef’s cousin, grins shyly as she scoots into the kitchen. Bruce anxiously lifts up the microphone. A duo wanders by the fishing pond in Prospect Park as Bruce, wearing a green jacket over a yellow vest and shorts and grasping a small basket of muffins, halts in his stride upon glimpsing Lucy resting alone in the center of a sturdy wooden pier. He dashes on to greet her and presents the muffins, but she stares at them sadly and turns away, placing her palm over her lips. Bruce digs in his satchel for Grandma’s bracelet and, looking as if he's been struck in the chest, observes in numb surprise as she rushes away off the pier. A little further by the pond, Ron leans against a bench watching the moment. He shifts with a wicked grin as Lucy strides past, arms crossed, frowning at him, and Lucy turns away furiously and continues on. Ron lets his head drop against the bench back with a grin of triumph. Later, he encounters Bruce in a tea house, inhales deeply, and Bruce meets Ron’s gaze before shaking his head and averting his eyes in confusion. Gaping in awe and denial, Bruce stands up and departs as a hostess approaches Ron with a sugar bowl and Ron beams. Bruce, crossing the avenue, spins and glances back."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry attempts to make an omelette with Mary Jane, but it falls apart. They share a kiss, but Mary Jane pulls away guiltily, leaving Harry to brood in front of his father's portrait. He recalls Spider-Man's involvement in his father's death and his own accident. Later, in his Goblin suit, Harry menaces Mary Jane at home, which leads to tension between her and Peter. Peter brings flowers to Mary Jane in Central Park, but she dismisses him and walks away. Harry watches the encounter, satisfied. At a coffee shop, Harry confronts Peter, who leaves in disbelief, as Harry revels in the situation."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Peter crossing the road turns and looks back Blinking in shock and disbelief Peter gets up and leaves as a waitress comes over to Harry with a coffee jar and Harry grins Later he meets Peter in a coffee shop draws breath and Peter looks Harry in the eye before shaking his head and looking away in a daze Harry let us his head drop against the tree trunk with a smile of satisfaction He turns with a cruel smile as Mary Jane comes past arms folded glaring at him and Mary Jane turns away angrily and carries on A little further along the lake Harry leans against a tree observing the scene Peter fumbles in his pocket for Aunt May's ring and looking as if he is been hit in the stomach watches in numb shock as she hurries away off the bridge He hurries on to meet her and offers up the flowers but she looks at them unhappily and turns aside putting her hand over her eyes A couple strolls by the boating lake in Central Park as Peter wearing a blue jumper over a blue shirt and jeans and clutching a small posy of flowers stops in his tracks upon spotting Mary Jane standing alone in the middle of a graceful cast iron bridge Peter nervously takes up the receiver Ursula the landlord's daughter smiles awkwardly as he hurries into the hallway Harry in his Goblin suit grabs Mary Jane by the throat hovering on his sky stick as he holds her against the wall At night Mary Jane comes home and hits the light switch but the lights do not come on He remembers falling and waking up in the hospital and his father looks back at him from the mirror As his fingers touch the glass in a flashback he sees SpiderMan standing over Norman's body and remembers pulling the SpiderMan mask off Peter's face Harry gates turns towards a tall mirror and stares at his reflection moving slowly towards it with an outstretched hand He storms into the study grabs at the canter and takes his wig as his father's portrait glowers down at him Harry watches helplessly as she hurries down the black and white marble floored hallway into the lift She pulls him towards her and they kiss but Mary Jane breaks off with a guilty look Later they read the script and Mary Jane brushes Harry's dark hair back from his brow meeting his adoring eyes He flicks the omelette in half and tries to toss it in the pan but half of it falls to the floor Harry turns back to the stove and pours his egg after which Mary Jane sprinkles on the cheese and Harry adds some rocket"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He flicks the omelette in half and tries to toss it in the pan but half of it falls to the floor Harry turns back to the stove and pours his egg after which Mary Jane sprinkles on the cheese and Harry adds some rocket She pulls him towards her and they kiss but Mary Jane breaks off with a guilty look Later they read the script and Mary Jane brushes Harry's dark hair back from his brow meeting his adoring eyes He storms into the study grabs at the canter and takes his wig as his father's portrait glowers down at him Harry watches helplessly as she hurries down the black and white marble floored hallway into the lift As his fingers touch the glass in a flashback he sees SpiderMan standing over Norman's body and remembers pulling the SpiderMan mask off Peter's face Harry gates turns towards a tall mirror and stares at his reflection moving slowly towards it with an outstretched hand At night Mary Jane comes home and hits the light switch but the lights do not come on He remembers falling and waking up in the hospital and his father looks back at him from the mirror Ursula the landlord's daughter smiles awkwardly as he hurries into the hallway Harry in his Goblin suit grabs Mary Jane by the throat hovering on his sky stick as he holds her against the wall A couple strolls by the boating lake in Central Park as Peter wearing a blue jumper over a blue shirt and jeans and clutching a small posy of flowers stops in his tracks upon spotting Mary Jane standing alone in the middle of a graceful cast iron bridge Peter nervously takes up the receiver Peter fumbles in his pocket for Aunt May's ring and looking as if he is been hit in the stomach watches in numb shock as she hurries away off the bridge He hurries on to meet her and offers up the flowers but she looks at them unhappily and turns aside putting her hand over her eyes He turns with a cruel smile as Mary Jane comes past arms folded glaring at him and Mary Jane turns away angrily and carries on A little further along the lake Harry leans against a tree observing the scene Later he meets Peter in a coffee shop draws breath and Peter looks Harry in the eye before shaking his head and looking away in a daze Harry let us his head drop against the tree trunk with a smile of satisfaction Peter crossing the road turns and looks back Blinking in shock and disbelief Peter gets up and leaves as a waitress comes over to Harry with a coffee jar and Harry grins"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ursula the landlord's daughter smiles awkwardly as he hurries into the hallway Peter nervously takes up the receiver A couple strolls by the boating lake in Central Park as Peter wearing a blue jumper over a blue shirt and jeans and clutching a small posy of flowers stops in his tracks upon spotting Mary Jane standing alone in the middle of a graceful cast iron bridge He hurries on to meet her and offers up the flowers but she looks at them unhappily and turns aside putting her hand over her eyes Peter fumbles in his pocket for Aunt May's ring and looking as if he is been hit in the stomach watches in numb shock as she hurries away off the bridge A little further along the lake Harry leans against a tree observing the scene He turns with a cruel smile as Mary Jane comes past arms folded glaring at him and Mary Jane turns away angrily and carries on Harry let us his head drop against the tree trunk with a smile of satisfaction Later he meets Peter in a coffee shop draws breath and Peter looks Harry in the eye before shaking his head and looking away in a daze Blinking in shock and disbelief Peter gets up and leaves as a waitress comes over to Harry with a coffee jar and Harry grins Peter crossing the road turns and looks back Harry turns back to the stove and pours his egg after which Mary Jane sprinkles on the cheese and Harry adds some rocket He flicks the omelette in half and tries to toss it in the pan but half of it falls to the floor Later they read the script and Mary Jane brushes Harry's dark hair back from his brow meeting his adoring eyes She pulls him towards her and they kiss but Mary Jane breaks off with a guilty look Harry watches helplessly as she hurries down the black and white marble floored hallway into the lift He storms into the study grabs at the canter and takes his wig as his father's portrait glowers down at him Harry gates turns towards a tall mirror and stares at his reflection moving slowly towards it with an outstretched hand As his fingers touch the glass in a flashback he sees SpiderMan standing over Norman's body and remembers pulling the SpiderMan mask off Peter's face He remembers falling and waking up in the hospital and his father looks back at him from the mirror At night Mary Jane comes home and hits the light switch but the lights do not come on Harry in his Goblin suit grabs Mary Jane by the throat hovering on his sky stick as he holds her against the wall"
        }
      ]
    }
  ]
}