{
  "ground_truth": "They start to dance slowly, their faces close together. Peter suddenly throws in a fancy move. Gwen throws her head back. Peter puts his hand on her thigh and raises her leg. As the number ends, he bends her over in his arms. Peter's cold black eyes settle on Mary Jane who looks devastated. Gwen follows his gaze and turns to him in shock. She gives Peter a reproving look and crosses to Mary Jane who's standing motionless behind the microphone. Gwen pushes her way past Peter. Mary Jane hurries from the stage. Peter, looking uncertain, puts his hand to his chest. He comes up behind Mary Jane with a hostile scowl. She turns to face him with scorn in her eyes. Peter pins a bouncer against the wall and starts beating off two more. He lashes out, sending Mary Jane careening to the floor. His vicious expression turns to wide-eyed shock as he realizes what he's done. His eyes well up, then he glances down at the Black Spider-Man suit under his dark open-neck shirt. Covering the suit with his hand, he turns away from Mary Jane and hurries out into the night. Mary Jane, still sitting on the floor, looks around helplessly. Out in the rain's wet street, Peter, keeping his hand clasped at his collar, steps into a doorway to think. Drawn by the sound of the bells, he looks up as the torrential rain pours down. A flash of lightning illuminates a Gothic church with a tall studded spire topped by a stone crucifix. The storm clouds slowly drift away, leaving a lowering gray sky. Perched high up on the studded side of the steeple, black-suited Spider-Man looks at his hand, flexes his fist, then drops from his perch like a bird shot from a tree. He plummets down to a square archway, leading to the bell tower of the imposing cathedral, decorated with an intricate network of Gothic arches and flying buttresses. Inside the cathedral, Eddie Brock dips his fingers in a font of holy water and crosses himself before the altar. Up in the bell tower, Spider-Man claws at his mask, desperately trying to tear it off. It tears and stretches like rubber then snaps back like a second skin. He falls against the bell in a struggle. For a second, the mask seems to disintegrate then snaps back into place. Brock looks up at the sound. Peter pulls up the mask, ripping it across his contorted features. The black threads of the Symbiote sticking to his face like bulging veins. As if in a trance, Brock is drawn to the screams of his nemesis, pushing open a door that leads to a staircase winding around the walls of the bell tower.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "They begin to dance slowly, their visages close together. Peter abruptly inserts in an ornate maneuver. Gwen tosses her head back. Peter places his hand on her thigh and elevates her leg. As the tune concludes, he bends her over in his embrace. Peter's icy ebony eyes settle on Mary Jane who appears devastated. Gwen traces his stare and turns to him in disbelief. She gives Peter a reproachful glance and crosses to Mary Jane who's standing immobile behind the microphone. Gwen pushes her way past Peter. Mary Jane rushes from the platform. Peter, appearing uncertain, places his hand to his torso. He comes up behind Mary Jane with a hostile frown. She turns to confront him with disdain in her gaze. Peter pins a bouncer against the partition and begins repelling two more. He lashes out, sending Mary Jane careening to the ground. His cruel expression shifts to wide-eyed shock as he realizes what he's done. His eyes well up, then he looks down at the Black Spider-Man suit under his dark open-neck shirt. Covering the suit with his hand, he turns away from Mary Jane and hurries out into the night. Mary Jane, still sitting on the ground, looks around helplessly. Out in the rain's wet avenue, Peter, keeping his hand clasped at his collar, steps into a doorway to ponder. Drawn by the sound of the bells, he looks up as the torrential rain pours down. A flash of lightning illuminates a Gothic church with a tall studded spire topped by a stone crucifix. The storm clouds slowly drift away, leaving a lowering gray sky. Perched high up on the studded side of the steeple, black-suited Spider-Man looks at his hand, flexes his fist, then descends from his perch like a bird shot from a tree. He plunges down to a square archway, leading to the bell tower of the imposing cathedral, adorned with an intricate network of Gothic arches and flying buttresses. Inside the cathedral, Eddie Brock dips his fingers in a font of holy water and crosses himself before the altar. Up in the bell tower, Spider-Man claws at his mask, desperately trying to tear it off. It tears and stretches like rubber then snaps back like a second skin. He falls against the bell in a struggle. For a second, the mask seems to disintegrate then snaps back into place. Brock looks up at the sound. Peter pulls up the mask, ripping it across his contorted features. The black threads of the Symbiote clinging to his face like bulging veins. As if in a trance, Brock is drawn to the cries of his nemesis, pushing open a door that leads to a staircase winding around the walls of the bell tower."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "They are started by a slow dance, their faces brought close together. A fancy move is suddenly thrown in by Peter. Gwen's head is thrown back by her. Her thigh is touched by Peter, and her leg is raised by him. As the number ends, she is bent over in his arms by him. Peter's cold black eyes settle on Mary Jane, who is looked upon devastatingly. His gaze is followed by Gwen, and shockingly, she turns to him. Peter is given a reproving look by her, and she crosses to Mary Jane, who stands motionless behind the microphone. Her way past Peter is pushed by Gwen. The stage is hurriedly left by Mary Jane. Looking uncertain, his hand is put to his chest by Peter. Behind Mary Jane, he comes up with a hostile scowl. With scornful eyes, she turns to face him. A bouncer is pinned against the wall by Peter, and two more are started to be beaten off by him. Mary Jane is sent careening to the floor by his lashing out. Wide-eyed shock replaces his vicious expression as he realizes the deed he has done. His eyes well up, then down at the Black Spider-Man suit under his dark open-neck shirt, his glance shifts. The suit is covered with his hand, turned away from Mary Jane, and hurried into the night. Still sitting on the floor, Mary Jane helplessly looks around. Out on the wet street in the rain, his hand is kept clasped at his collar by Peter while he steps into a doorway to think. The sound of the bells draws him up as the torrential rain pours down. A Gothic church with a tall studded spire topped by a stone crucifix is illuminated by a flash of lightning. The storm clouds slowly drift away, leaving a lowering gray sky. Perched high up on the studded side of the steeple, Spider-Man, in a black suit, flexes his fist after looking at his hand, then, like a bird shot from a tree, he drops from his perch. He plummets down to a square archway, which leads to the bell tower of the imposing cathedral decorated with an intricate network of Gothic arches and flying buttresses. Inside the cathedral, his fingers are dipped in a font of holy water by Eddie Brock, who crosses himself before the altar. Up in the bell tower, Spider-Man claws at his mask, desperately attempting to tear it off. It is torn and stretched like rubber, then snapped back like a second skin. He falls against the bell in a struggle. The mask, disintegrating for a second, then snaps back into place. At the sound, Brock looks up. The mask is pulled up by Peter, ripping it across his contorted features. The black threads of the Symbiote stick to his face like bulging veins. As if in a trance, the screams of his nemesis draw Brock to push open a door leading to a staircase winding around the walls of the bell tower."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Peter and Gwen start to dance slowly with their faces close. Peter adds a fancy move, and Gwen throws her head back. He places his hand on her thigh, lifting her leg. As the dance ends, Peter bends Gwen over in his arms and his cold black eyes meet Mary Jane's devastated look. Gwen notices this and gives Peter a reproachful look, moving towards a motionless Mary Jane at the microphone. Mary Jane rushes off stage as Peter, looking uncertain, touches his chest. Behind Mary Jane, his expression turns hostile. She faces him with scorn, and Peter pins a bouncer, fighting off two more, accidentally sending Mary Jane to the floor. Shocked by his actions, he glances at the Black Spider-Man suit under his shirt, covers it, and hurries away. Mary Jane remains on the floor, helpless. Outside in the rain, Peter steps into a doorway to think and hears bells. Looking up, he sees a Gothic church with a tall spire and crosses. As storm clouds clear to a gray sky, Spider-Man, in his black suit, flexes his fist and drops from the steeple to a square archway leading to the cathedral bell tower. Inside, Eddie Brock crosses himself with holy water before the altar. In the tower, Spider-Man struggles to tear off his mask, which stretches like rubber and snaps back. He falls against the bell, the mask snapping back into place. Brock hears the sound and looks up. Peter rips off the mask, revealing black Symbiote threads on his face. Brock, drawn by Peter's screams, opens a door leading to the staircase around the bell tower walls."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "They dance closely until Peter suddenly adds a fancy move. Gwen leans back, and he places his hand on her thigh, lifting her leg. As the dance ends, Peter bends Gwen over, his cold eyes settling on Mary Jane, who looks devastated. Shocked, Gwen follows his gaze and then approaches Mary Jane, who stands by the microphone. Gwen pushes past Peter, causing Mary Jane to leave the stage hurriedly. Peter, uncertain, touches his chest and follows her, scowling. Turning, Mary Jane's eyes show scorn. Peter pins a bouncer to the wall and fights off two more, inadvertently sending Mary Jane to the floor. Shocked at his actions, his eyes well up as he looks at the Black Spider-Man suit under his shirt. Covering it, he leaves, while Mary Jane remains helpless on the floor. In the rain, Peter clasps his collar and steps into a doorway. Hearing bells, he looks up at a Gothic church during a storm, revealing a spire and a crucifix. As the clouds clear to a gray sky, Spider-Man, in his black suit, flexes his fist and drops like a bird from a steeple to a cathedral bell tower, adorned with Gothic arches. Inside, Eddie Brock crosses himself with holy water. Meanwhile, in the bell tower, Spider-Man struggles to remove his mask, which snaps back like rubber. He pulls it up painfully, the Symbiote clinging to his face. Brock, entranced by Peter's screams, is drawn to the tower, pushing open a door leading up the staircase."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The slow, deliberate movements mark the beginning of their dance, with their faces intimately close, as they gently sway to the rhythm. Peter, with a sudden burst of energy, unexpectedly incorporates a flamboyant move. Gwen responds by throwing her head back dramatically. Peter then places his hand gently on her thigh, lifting her leg gracefully into the air. As the performance comes to a close, he dramatically dips her backward into his arms. Peter’s piercing, cold black eyes fixate on Mary Jane, who is visibly devastated by the scene. Gwen, noticing his gaze, turns toward him in shock and disapproval. She gives him a scolding look before walking over to where Mary Jane stands, nearly frozen, behind the microphone. Gwen pushes past Peter without hesitation. Mary Jane, overwhelmed, hastily departs from the stage area. Peter, visibly conflicted, places his hand over his heart. He moves toward Mary Jane with a menacing glare. Mary Jane turns to confront him, her eyes filled with disdain. In a sudden burst of aggression, Peter shoves a bouncer against the wall and starts fending off two more. In the chaos, he inadvertently lashes out, sending Mary Jane sprawling to the floor. Instantly, Peter’s vicious expression shifts to one of wide-eyed horror as he comprehends the enormity of his actions. Tears begin to well up in his eyes; he glances down at the Black Spider-Man suit that lies beneath his dark, open-necked shirt. He covers the suit with his hand, turns away from Mary Jane, and swiftly exits into the night. Left sitting on the floor, Mary Jane looks around, feeling helpless and abandoned. Outside, in the rain-drenched street, Peter keeps his hand clasped at his collar as he steps into a doorway, lost in thought. The sound of bells draws his attention upward, where the relentless rain pours down around him. A flash of lightning dramatically illuminates a towering Gothic church with its studded spire capped by a stone crucifix. As the storm clouds slowly begin to disperse, they reveal a brooding gray sky. High above, perched on the rugged side of the steeple, the black-clad Spider-Man scrutinizes his hand, flexes his fist, and suddenly drops from his high perch like a bird felled by a hunter’s shot. He plummets down toward an arched entrance leading to the bell tower of the majestic cathedral, adorned with an elaborate network of Gothic arches and flying buttresses. Inside the sacred space of the cathedral, Eddie Brock dips his fingers into a font of holy water and makes the sign of the cross before the altar. Meanwhile, up in the bell tower, Spider-Man struggles intensely with his mask, desperately clawing at it to tear it off. The material stretches like elastic and then snaps back to his face like a second skin. He collapses against the enormous bell in his struggle. For a brief moment, the mask seems to vanish, only to snap back into place almost immediately. Brock, hearing the resulting sound, looks upward. Peter forcibly pulls at the mask, ripping it across his distorted features as the black tendrils of the Symbiote cling to his skin like swollen veins. As if entranced, Brock is irresistibly drawn toward the anguished cries of his adversary, pushing through a door that leads to a spiraling staircase winding up the walls of the bell tower."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The dance begins with their slow and deliberate movements, marking the onset of an intricate performance. Their faces are intimately close, conveying an undeniable connection as they gently sway together in time with the rhythm of the music. Suddenly, Peter, with a surprising and energetic burst, introduces an unexpectedly flamboyant move into their routine. Gwen, quick to respond, dramatically throws her head back in an expressive gesture. Following this, Peter gently places his hand on her thigh, lifting her leg gracefully into the air with practiced ease. As the performance gradually draws to its conclusion, he executes a dramatic dip, lowering her backward into his arms with flair. This intense moment is overshadowed by Peter’s piercing, cold black eyes that fixate on Mary Jane, who is visibly devastated by the scene unfolding before her. Noticing Peter’s gaze, Gwen turns toward him, her expression one of shock and disapproval. She directs a scolding look in his direction before walking purposefully over to where Mary Jane stands, nearly frozen in place behind the microphone. Without hesitation, Gwen pushes past Peter. Overwhelmed by the unfolding drama, Mary Jane hastily departs from the stage area. Peter, now visibly conflicted, places his hand over his heart, a gesture of deep inner turmoil, as he moves menacingly toward Mary Jane. She turns to confront him, disdain clearly evident in her eyes. In a sudden, aggressive outburst, Peter shoves a bouncer against the wall and begins fending off two more. Amid the chaos, he inadvertently lashes out, causing Mary Jane to fall sprawling to the floor. Immediately, Peter’s once vicious expression shifts to one of wide-eyed horror as he realizes the enormity of his actions. Tears start to well up in his eyes; he glances down at the Black Spider-Man suit beneath his dark, open-necked shirt. Attempting to conceal it, he covers the suit with his hand, turns away from Mary Jane, and swiftly exits into the night. Left sitting on the floor, Mary Jane looks around, feeling utterly helpless and abandoned. Outside, Peter, hand still clasped at his collar, steps into a doorway on the rain-drenched street, lost deep in thought. The sound of bells draws his attention upward, where the relentless rain continues to pour around him. A flash of lightning dramatically illuminates a towering Gothic church, its studded spire capped majestically by a stone crucifix. As the storm clouds begin to disperse, they reveal a brooding gray sky. High above, perched on the rugged side of the steeple, the black-clad Spider-Man scrutinizes his hand, flexes his fist, and then suddenly drops from his high perch like a bird felled by a hunter’s arrow. He plummets downward toward an arched entrance that leads to the bell tower of the majestic cathedral, richly adorned with an elaborate network of Gothic arches and flying buttresses. Inside the sacred, hallowed space of the cathedral, Eddie Brock dips his fingers reverently into a font of holy water and makes the sign of the cross before the altar in silent prayer. Meanwhile, up in the bell tower, Spider-Man struggles with great intensity against his mask, desperately clawing at it in a frantic attempt to tear it off. The material stretches like elastic and then snaps back to his face like a stubborn second skin. He collapses against the enormous bell in his struggle. For a brief, hopeful moment, the mask seems to vanish, only to snap back into place almost immediately. Hearing the resulting sound, Brock looks upward with curiosity. With determination, Peter forcibly pulls at the mask, ripping it across his distorted features as the black tendrils of the Symbiote cling obstinately to his skin like swollen veins. As if entranced, Brock is drawn irresistibly toward the anguished cries of his adversary, pushing through a door that leads to a spiraling staircase winding up the walls of the bell tower."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "They begin to dance slowly, moving in a synchronized rhythm as their faces draw closer together, their eyes locked in an intimate connection. Peter unexpectedly introduces a fanciful maneuver into their dance, prompting Gwen to react by throwing her head back in surprise or delight. As the dance progresses, Peter gently places his hand on Gwen's thigh, showing confidence and control, and carefully lifts her leg, emphasizing the elegance and flair of their performance. As the music concludes, he seamlessly transitions by bending Gwen over in his arms, creating a dramatic and romantic finish. At this heightened moment, Peter's cold, black eyes fixate on Mary Jane, who stands in the distance with a devastated expression. Noticing Peter's gaze, Gwen turns to him, and her eyes reflect shock and disbelief at his actions. She gives Peter a disapproving look, silently conveying her disappointment, and then decisively moves towards Mary Jane, who stands motionless, gripped by her emotions behind the microphone. Gwen intentionally brushes past Peter, signaling her allegiance to Mary Jane, who abruptly leaves the stage in distress. Looking momentarily uncertain, Peter lifts his hand to his chest, reflecting on his decisions. He follows Mary Jane, his expression shifting to hostility, as he approaches with a scowl. Mary Jane turns to face him, her eyes filled with scorn and hurt, meeting his confrontational stance. Without warning, Peter forcibly pins a bouncer against the wall, demonstrating his aggression, and proceeds to fend off two more with a flurry of movements. In the chaos, he inadvertently strikes out, causing Mary Jane to stumble and fall to the floor. The viciousness in Peter's eyes gives way to shock as he fully comprehends the impact of his actions. Tears begin to form in his eyes, betraying his inner turmoil. Glancing downward, Peter notices the Black Spider-Man suit peeking out beneath his dark open-neck shirt, a reminder of his altered state. Hastily, he covers the suit with his hand, concealing it from view, and turns away from Mary Jane, who is still on the floor, looking around in helpless confusion, before he rushes out into the night. Outside, under the relentless rain, Peter steps into a nearby doorway, keeping his hand clenched at his collar in an effort to shield himself from the elements and collect his thoughts. The sound of distant bells catches his attention, drawing his gaze upward. In the flash of lightning, he sees a Gothic church, its tall studded spire crowned with a stone crucifix, standing against the backdrop of a tumultuous sky. As the storm clouds gradually drift away, leaving a persistently gloomy sky, Peter, donned in his black Spider-Man suit, perches high on the studded side of the church steeple. He studies his hand, flexes his fist contemplatively, and then drops from his perch with the suddenness of a bird felled from a tree. He descends rapidly to a square archway that leads to the cathedral's bell tower, a structure adorned with an elaborate array of Gothic arches and flying buttresses. Inside the cathedral, Eddie Brock, seeking solace, dips his fingers into a font of holy water and reverently crosses himself before the altar. Meanwhile, up in the bell tower, Spider-Man grapples with his mask, desperately clawing at it in an attempt to remove it. The mask stretches like rubber under his frantic efforts but snaps back into place, clinging to him like a second skin, even as he stumbles against the bell in his struggle. At one point, the mask appears to disintegrate but then reasserts itself, maintaining its grip. Brock, alerted by the sound, looks up curiously. Amid the chaos, Peter manages to pull the mask up, tearing it across his strained features. The black threads of the Symbiote cling to his face like bulging veins, a visible manifestation of the conflict within him. Almost as if hypnotized, Brock feels an inexplicable pull towards the source of the anguished cries of his adversary. Compelled by this urge, he pushes open a door leading to a staircase that spirals around the walls of the bell tower, drawn by the turmoil that echoes within."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "They begin dancing closely, with Peter introducing a fancy move and lifting Gwen's leg, ending by bending her over in his arms. As the dance concludes, Peter's gaze shifts to a devastated Mary Jane, prompting Gwen to follow his gaze in shock. Gwen, reproving him, crosses to Mary Jane, who is standing stunned near the microphone and then hurries from the stage. Peter appears uncertain, placing his hand on his chest, and approaches Mary Jane with hostility. She confronts him with scorn before Peter attacks a bouncer and others, inadvertently knocking Mary Jane to the floor. Realizing his actions with shock and tears welling up, Peter glances at the Black Spider-Man suit under his shirt, conceals it with his hand, and exits into the night. Mary Jane remains on the floor, helpless. Outside, in the rain, Peter stops in a doorway, contemplating while the rain pours. Noticing the sound of bells, he looks up at a Gothic church with a spire and crucifix. As the storm clears to a gray sky, Spider-Man, dressed in black, examines his hand, flexes, and drops from the steeple to the cathedral's bell tower, adorned with Gothic designs. Inside, Eddie Brock blesses himself at the altar. In the bell tower, Spider-Man struggles to remove his mask, which stretches and snaps back. Falling against a bell, he continues to fight the mask, which briefly disintegrates and reattaches. Brock, drawn by the sounds, ascends the staircase of the bell tower, driven by the cries of his nemesis."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "They start to dance slowly, their faces close together, in a dimly lit club known for its live jazz performances on weekends. Peter suddenly throws in a fancy move, reminiscent of a twist he learned from a renowned ballroom class in the city. Gwen throws her head back, her laughter echoing in the room. Peter puts his hand on her thigh and raises her leg, a daring move inspired by his studies of classic tango techniques. As the number ends, he bends her over in his arms with a flourish, surprising onlookers who have gathered for the evening's entertainment. Peter's cold black eyes settle on Mary Jane, who looks devastated after witnessing the display. Gwen follows his gaze and turns to him in shock, realizing the impact of their dance. She gives Peter a reproving look and crosses to Mary Jane, who's standing motionless behind the microphone, a symbol of her usual role as the club's standout singer. Gwen pushes her way past Peter, determined to comfort her friend. Mary Jane hurries from the stage, tears threatening to spill. Peter, looking uncertain, puts his hand to his chest, feeling the unfamiliar pull of the Symbiote that enhances his strength but clouds his judgment. He comes up behind Mary Jane with a hostile scowl, a stark contrast to his usual demeanor. She turns to face him with scorn in her eyes, hurt by his behavior. Peter pins a bouncer against the wall, his strength amplified by the Symbiote, and starts beating off two more who attempt to intervene. He lashes out, sending Mary Jane careening to the floor. His vicious expression turns to wide-eyed shock as he realizes what he's done. His eyes well up with regret, then he glances down at the Black Spider-Man suit, an alien Symbiote that has bonded with him, under his dark open-neck shirt. Covering the suit with his hand, he turns away from Mary Jane and hurries out into the night, troubled by his actions. Mary Jane, still sitting on the floor, looks around helplessly in the now silent club. Out in the rain's wet street, Peter, keeping his hand clasped at his collar, steps into a doorway to think, the sound of distant sirens merging with the storm. Drawn by the sound of the bells, he looks up as the torrential rain pours down. A flash of lightning illuminates a Gothic church, a historic landmark known for its towering architecture, with a tall studded spire topped by a stone crucifix. The storm clouds slowly drift away, leaving a lowering gray sky. Perched high up on the studded side of the steeple, black-suited Spider-Man looks at his hand, flexes his fist, then drops from his perch like a bird shot from a tree. He plummets down to a square archway, leading to the bell tower of the imposing cathedral, decorated with an intricate network of Gothic arches and flying buttresses, highlighting the artistry of medieval craftsmanship. Inside the cathedral, Eddie Brock dips his fingers in a font of holy water and crosses himself before the altar, seeking solace in the sacred space. Up in the bell tower, Spider-Man claws at his mask, desperately trying to tear it off. It tears and stretches like rubber then snaps back like a second skin. He falls against the bell in a struggle. For a second, the mask seems to disintegrate then snaps back into place. Brock looks up at the sound, his curiosity piqued. Peter pulls up the mask, ripping it across his contorted features. The black threads of the Symbiote, a sentient alien that amplifies aggression, stick to his face like bulging veins. As if in a trance, Brock is drawn to the screams of his nemesis, pushing open a door that leads to a staircase winding around the walls of the bell tower, determined to discover the source of the chaos."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Peter pins a bouncer against the wall and starts beating off two more They start to dance slowly their faces close together His vicious expression turns to wideeyed shock as he realizes what he is done Peter suddenly throws in a fancy move Gwen throws her head back Peter puts his hand on her thigh and raises her leg As the number ends he bends her over in his arms Peter's cold black eyes settle on Mary Jane who looks devastated Gwen follows his gaze and turns to him in shock She gives Peter a reproving look and crosses to Mary Jane who is standing motionless behind the microphone The storm clouds slowly drift away leaving a lowering gray sky Gwen pushes her way past Peter Mary Jane hurries from the stage Peter looking uncertain puts his hand to his chest As the number ends he bends her over in his arms He comes up behind Mary Jane with a hostile scowl It tears and stretches like rubber then snaps back like a second skin She turns to face him with scorn in her eyes Peter pins a bouncer against the wall and starts beating off two more Covering the suit with his hand he turns away from Mary Jane and hurries out into the night She gives Peter a reproving look and crosses to Mary Jane who is standing motionless behind the microphone He lashes out sending Mary Jane careening to the floor His vicious expression turns to wideeyed shock as he realizes what he is done His eyes well up then he glances down at the Black SpiderMan suit under his dark openneck shirt Covering the suit with his hand he turns away from Mary Jane and hurries out into the night Mary Jane still sitting on the floor looks around helplessly Out in the rain's wet street Peter keeping his hand clasped at his collar steps into a doorway to think Drawn by the sound of the bells he looks up as the torrential rain pours down Peter keeping his hand clasped at his collar steps into a doorway to think Peter pulls up the mask ripping it across his contorted features A flash of lightning illuminates a Gothic church with a tall studded spire topped by a stone crucifix The storm clouds slowly drift away leaving a lowering gray sky Perched high up on the studded side of the steeple blacksuited SpiderMan looks at his hand flexes his fist then drops from his perch like a bird shot from a tree He plummets down to a square archway leading to the bell tower of the imposing cathedral decorated with an intricate network of Gothic arches and flying buttresses Inside the cathedral Eddie Brock dips his fingers in a font of holy water and crosses himself before the altar Up in the bell tower SpiderMan claws at his mask desperately trying to tear it off It tears and stretches like rubber then snaps back like a second skin He falls against the bell in a struggle Gwen throws her head back Peter puts his hand on her thigh and raises her leg Peter suddenly throws in a fancy move For a second the mask seems to disintegrate then snaps back into place Gwen follows his gaze and turns to him in shock He lashes out sending Mary Jane careening to the floor Brock looks up at the sound Peter pulls up the mask ripping it across his contorted features The black threads of the Symbiote sticking to his face like bulging veins As if in a trance Brock is drawn to the screams of his nemesis pushing open a door that leads to a staircase winding around the walls of the bell tower The black threads of the Symbiote sticking to his face like bulging veins A flash of lightning illuminates a Gothic church with a tall studded spire topped by a stone crucifix then he glances down at the Black SpiderMan suit under his dark openneck shirt They start to dance slowly their faces close together"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "They start to dance slowly their faces close together. Peter suddenly throws in a fancy move. Gwen throws her head back. Peter puts his hand on her thigh and raises her leg. As the number ends he bends her over in his arms. Peter's cold black eyes settle on Mary Jane who looks devastated. Gwen follows his gaze and turns to him in shock. She gives Peter a reproving look and crosses to Mary Jane who is standing motionless behind the microphone. Gwen pushes her way past Peter. Mary Jane hurries from the stage. Peter looking uncertain puts his hand to his chest. He comes up behind Mary Jane with a hostile scowl. She turns to face him with scorn in her eyes. Peter pins a bouncer against the wall and starts beating off two more. He lashes out sending Mary Jane careening to the floor. His vicious expression turns to wideeyed shock as he realizes what he is done. His eyes well up. then he glances down at the Black SpiderMan suit under his dark openneck shirt. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Covering the suit with his hand he turns away from Mary Jane and hurries out into the night. Mary Jane still sitting on the floor looks around helplessly. Out in the rain's wet street. Peter keeping his hand clasped at his collar steps into a doorway to think. Drawn by the sound of the bells he looks up as the torrential rain pours down. A flash of lightning illuminates a Gothic church with a tall studded spire topped by a stone crucifix. The storm clouds slowly drift away leaving a lowering gray sky. Perched high up on the studded side of the steeple blacksuited SpiderMan looks at his hand flexes his fist then drops from his perch like a bird shot from a tree. He plummets down to a square archway leading to the bell tower of the imposing cathedral decorated with an intricate network of Gothic arches and flying buttresses. Inside the cathedral Eddie Brock dips his fingers in a font of holy water and crosses himself before the altar. Up in the bell tower SpiderMan claws at his mask desperately trying to tear it off. It tears and stretches like rubber then snaps back like a second skin. He falls against the bell in a struggle. For a second the mask seems to disintegrate then snaps back into place. Brock looks up at the sound. Peter pulls up the mask ripping it across his contorted features. The black threads of the Symbiote sticking to his face like bulging veins. As if in a trance Brock is drawn to the screams of his nemesis pushing open a door that leads to a staircase winding around the walls of the bell tower."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "They start to dance slowly their faces close together. Peter suddenly throws in a fancy move. Gwen throws her head back. Peter puts his hand on her thigh and raises her leg. As the number ends he bends her over in his arms. Peter's cold black eyes settle on Mary Jane who looks devastated. Gwen follows his gaze and turns to him in shock. She gives Peter a reproving look and crosses to Mary Jane who is standing motionless behind the microphone. Gwen pushes her way past Peter. Mary Jane hurries from the stage. Peter looking uncertain puts his hand to his chest. He comes up behind Mary Jane with a hostile scowl. She turns to face him with scorn in her eyes. Peter pins a bouncer against the wall and starts beating off two more. He lashes out sending Mary Jane careening to the floor. His vicious expression turns to wideeyed shock as he realizes what he is done. His eyes well up. then he glances down at the Black SpiderMan suit under his dark openneck shirt. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Covering the suit with his hand he turns away from Mary Jane and hurries out into the night. Mary Jane still sitting on the floor looks around helplessly. Out in the rain's wet street. Peter keeping his hand clasped at his collar steps into a doorway to think. Drawn by the sound of the bells he looks up as the torrential rain pours down. A flash of lightning illuminates a Gothic church with a tall studded spire topped by a stone crucifix. The storm clouds slowly drift away leaving a lowering gray sky. Perched high up on the studded side of the steeple blacksuited SpiderMan looks at his hand flexes his fist then drops from his perch like a bird shot from a tree. He plummets down to a square archway leading to the bell tower of the imposing cathedral decorated with an intricate network of Gothic arches and flying buttresses. Inside the cathedral Eddie Brock dips his fingers in a font of holy water and crosses himself before the altar. Up in the bell tower SpiderMan claws at his mask desperately trying to tear it off. It tears and stretches like rubber then snaps back like a second skin. He falls against the bell in a struggle. For a second the mask seems to disintegrate then snaps back into place. Brock looks up at the sound. Peter pulls up the mask ripping it across his contorted features. The black threads of the Symbiote sticking to his face like bulging veins. As if in a trance Brock is drawn to the screams of his nemesis pushing open a door that leads to a staircase winding around the walls of the bell tower."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "They start to dance slowly their faces close together. Peter suddenly throws in a fancy move. Gwen throws her head back. Peter puts his hand on her thigh and raises her leg. As the number ends he bends her over in his arms. Peter's cold black eyes settle on Mary Jane who looks devastated. Gwen follows his gaze and turns to him in shock. She gives Peter a reproving look and crosses to Mary Jane who is standing motionless behind the microphone. Gwen pushes her way past Peter. Inside the cathedral Eddie Brock dips his fingers in a font of holy water and crosses himself before the altar. Up in the bell tower SpiderMan claws at his mask desperately trying to tear it off. It tears and stretches like rubber then snaps back like a second skin. He falls against the bell in a struggle. For a second the mask seems to disintegrate then snaps back into place. Brock looks up at the sound. Peter pulls up the mask ripping it across his contorted features. The black threads of the Symbiote sticking to his face like bulging veins. As if in a trance Brock is drawn to the screams of his nemesis pushing open a door that leads to a staircase winding around the walls of the bell tower."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "They start to dance slowly their faces close together. Peter suddenly throws in a fancy move. Gwen throws her head back. Peter puts his hand on her thigh and raises her leg. Brock looks up at the sound. Peter pulls up the mask ripping it across his contorted features. The black threads of the Symbiote sticking to his face like bulging veins. As if in a trance Brock is drawn to the screams of his nemesis pushing open a door that leads to a staircase winding around the walls of the bell tower."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "They start to dance slowly, their faces close together. The cat suddenly throws in a fancy move. The dog throws her head back. The cat puts his hand on her thigh and raises her leg. As the number ends, he bends her over in his arms. The cat's cold black eyes settle on the fox who looks devastated. The dog follows his gaze and turns to him in shock. She gives the cat a reproving look and crosses to the fox who's standing motionless behind the microphone. The dog pushes her way past the cat. The fox hurries from the stage. The cat, looking uncertain, puts his hand to his chest. He comes up behind the fox with a hostile scowl. She turns to face him with scorn in her eyes. The cat pins a bouncer against the wall and starts beating off two more. He lashes out, sending the fox careening to the floor. His vicious expression turns to wide-eyed shock as he realizes what he's done. His eyes well up, then he glances down at the Black Spider-Man suit under his dark open-neck shirt. Covering the suit with his hand, he turns away from the fox and hurries out into the night. The fox, still sitting on the floor, looks around helplessly. Out in the rain's wet street, the cat, keeping his hand clasped at his collar, steps into a doorway to think. Drawn by the sound of the bells, he looks up as the torrential rain pours down. A flash of lightning illuminates a Gothic church with a tall studded spire topped by a stone crucifix. The storm clouds slowly drift away, leaving a lowering gray sky. Perched high up on the studded side of the steeple, black-suited Wolverine looks at his hand, flexes his fist, then drops from his perch like a bird shot from a tree. He plummets down to a square archway, leading to the bell tower of the imposing cathedral, decorated with an intricate network of Gothic arches and flying buttresses. Inside the cathedral, The rabbit dips his fingers in a font of holy water and crosses himself before the altar. Up in the bell tower, Wolverine claws at his mask, desperately trying to tear it off. It tears and stretches like rubber then snaps back like a second skin. He falls against the bell in a struggle. For a second, the mask seems to disintegrate then snaps back into place. The rabbit looks up at the sound. The cat pulls up the mask, ripping it across his contorted features. The black threads of the Symbiote sticking to his face like bulging veins. As if in a trance, the rabbit is drawn to the screams of his nemesis, pushing open a door that leads to a staircase winding around the walls of the bell tower."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "They start to dance slowly, their faces close together. Peter suddenly throws in a fancy move. Gwen throws her head back. Peter puts his hand on her elbow and raises her arm. As the number ends, he bends her over in his arms. Peter's cold black eyes settle on Mary Jane who looks devastated. Gwen follows his gaze and turns to him in shock. She gives Peter a reproving look and crosses to Mary Jane who's standing motionless behind the lectern. Gwen pushes her way past Peter. Mary Jane hurries from the podium. Peter, looking uncertain, puts his hand to his waist. He comes up behind Mary Jane with a hostile scowl. She turns to face him with scorn in her eyes. Peter pins a waiter against the wall and starts beating off two more. He lashes out, sending Mary Jane careening to the carpet. His vicious expression turns to wide-eyed shock as he realizes what he's done. His eyes well up, then he glances down at the Black Spider-Man sweater under his dark open-neck blazer. Covering the sweater with his hand, he turns away from Mary Jane and hurries out into the night. Mary Jane, still sitting on the carpet, looks around helplessly. Out in the rain's wet alley, Peter, keeping his hand clasped at his lapel, steps into a gateway to think. Drawn by the sound of the chimes, he looks up as the torrential rain pours down. A flash of lightning illuminates a Gothic library with a tall studded dome topped by a stone gargoyle. The storm clouds slowly drift away, leaving a lowering gray sky. Perched high up on the studded side of the dome, black-suited Spider-Man looks at his hand, flexes his fist, then drops from his perch like a bird shot from a tree. He plummets down to a round loggia, leading to the bell tower of the imposing citadel, decorated with an intricate network of Gothic arches and flying buttresses. Inside the citadel, Eddie Brock dips his fingers in a basin of holy water and crosses himself before the podium. Up in the bell tower, Spider-Man claws at his hood, desperately trying to tear it off. It tears and stretches like rubber then snaps back like a second skin. He falls against the chime in a struggle. For a second, the hood seems to disintegrate then snaps back into place. Brock looks up at the sound. Peter pulls up the hood, ripping it across his contorted features. The black threads of the Symbiote sticking to his face like bulging veins. As if in a trance, Brock is drawn to the cries of his nemesis, pushing open a door that leads to a staircase winding around the walls of the bell tower."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "They begin to glide smoothly, their faces close together. Peter suddenly slides in a fancy gesture. Gwen swings her head sideways. Peter places his hand on her thigh and lowers her leg. As the number finishes, he straightens her up in his arms. Peter's cold black eyes focus on Mary Jane who looks devastated. Gwen catches his gaze and turns to him in shock. She gives Peter a reproving look and moves to Mary Jane who's standing motionless behind the microphone. Gwen weaves her way past Peter. Mary Jane dashes from the stage. Peter, looking uncertain, places his hand on his chest. He approaches Mary Jane with a hostile scowl. She turns to face him with scorn in her eyes. Peter pushes a bouncer against the wall and starts fending off two more. He swings out, sending Mary Jane sprawling to the floor. His vicious expression turns to wide-eyed shock as he realizes what he's done. His eyes well up, then he glances down at the Black Spider-Man suit under his dark open-neck shirt. Concealing the suit with his hand, he turns away from Mary Jane and rushes out into the night. Mary Jane, still sitting on the floor, looks around helplessly. Out in the rain's wet street, Peter, keeping his hand fixed at his collar, leans into a doorway to ponder. Drawn by the sound of the bells, he glances up as the heavy rain falls down. A flash of lightning reveals a Gothic church with a tall studded spire topped by a stone crucifix. The storm clouds gradually part away, leaving a lowering gray sky. Perched majestically up on the studded side of the steeple, black-suited Spider-Man stares at his hand, clenches his fist, then leaps from his perch like a bird diving from a tree. He descends down to a square archway, leading to the bell tower of the imposing cathedral, adorned with an intricate network of Gothic arches and flying buttresses. Inside the cathedral, Eddie Brock touches his fingers in a font of holy water and taps himself before the altar. Up in the bell tower, Spider-Man grips at his mask, desperately trying to pull it off. It stretches and wobbles like rubber then snaps back like a second skin. He falls against the bell in a struggle. For a second, the mask seems to disintegrate then snaps back into place. Brock looks up at the noise. Peter tugs up the mask, ripping it across his contorted features. The black threads of the Symbiote clinging to his face like bulging veins. As if in a trance, Brock is drawn to the screams of his nemesis, sliding open a door that leads to a staircase spiraling around the walls of the bell tower."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The balloons start to sing slowly, their wings close together. Saturday suddenly throws in a fancy song. Midnight throws its head back. Saturday puts its hand on his tooth and raises his leg. As the number ends, it bends him over in its leaves. Saturday's cold black hands settle on Jellyfish who looks jubilant. Midnight follows its gaze and turns to it in joy. It gives Saturday a listening look and crosses to Jellyfish who's standing motionless behind the telescope. Midnight pushes its way past Saturday. Jellyfish hurries from the mountain. Saturday, looking uncertain, puts its hand to its window. It comes up behind Jellyfish with a friendly glance. He turns to face it with care in his apples. Saturday pins a hamburger against the river and starts beating off two more. It lashes out, sending Jellyfish careening to the clouds. Its joyous expression turns to wide-eyed pleasure as it realizes what it’s done. Its feet well up, then it glances down at the Yellow Lion suit under its bright closed-toe shoes. Covering the suit with its hand, it turns away from Jellyfish and hurries out into the morning. Jellyfish, still sitting on the clouds, looks around helplessly. Out in the sunshine's dry mountain, Saturday, keeping its hand clasped at its eyebrow, steps into a barn to run. Drawn by the sound of the drums, it looks up as the gentle rain sweeps in. A flash of lightning illuminates an ancient castle with a low rounded turret topped by a cloth umbrella. The cotton candy clouds slowly drift away, leaving a lowering purple sky. Perched high up on the rounded corner of the turret, yellow-suited Lion-Man looks at its foot, flexes its toe, then drops from its perch like a fish caught out of a brook. It plummets down to a wide hallway, leading to the bell room of the impressive museum, decorated with an intricate network of ancient doors and twisting vines. Inside the museum, Marcus Storm dips his elbows in a barrel of holy oil and spins himself before the piano. Up in the bell room, Lion-Man claws at its beanie, desperately trying to tear it off. It tears and stretches like rubber then snaps back like a second skin. It falls against the tree in a struggle. For a second, the beanie seems to dissolve then snaps back into place. Storm looks up at the sound. Saturday pulls up the beanie, ripping it across its peaceful features. The red wires of the Symbiote sticking to its knee like bulging strings. As if in a daze, Storm is drawn to the whispers of its buddy, pushing open a gate that leads to a ladder winding around the walls of the bell tower."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "They start to juggle slowly, their faces close together. David suddenly injects a fancy maneuver. Laura tosses her head back. David places his hand on her shoulder and lowers her leg. As the number concludes, he twirls her around in his arms. David's cold black eyes focus on Fiona who looks astonished. Laura follows his stare and turns to him in disbelief. She gives David a disapproving glance and marches to Fiona who's standing speechless behind the microphone. Laura shoves her way past David. Fiona rushes from the stage. David, looking hesitant, places his hand to his forehead. He approaches Fiona with a defiant grimace. She spins to face him with disdain in her eyes. David pins a waiter against the wall and begins wrestling off two more. He strikes out, sending Fiona sprawling to the floor. His cruel expression changes to wide-eyed disbelief as he comprehends what he's done. His eyes fill up, then he looks down at the Black Panther outfit under his dark open-neck shirt. Concealing the outfit with his hand, he turns away from Fiona and strides out into the night. Fiona, still sitting on the floor, glances around helplessly. Out in the rain's wet street, David, keeping his hand clasped at his collar, steps into a doorway to ponder. Drawn by the sound of the chimes, he looks up as the torrential rain descends. A flash of lightning reveals a Gothic mansion with a tall studded turret topped by a stone gargoyle. The storm clouds gradually drift away, leaving a lowering gray sky. Perched high up on the studded side of the turret, black-suited Panther looks at his palm, clenches his fist, then leaps from his perch like a leaf thrown from a tree. He dives down to a square entrance, leading to the clock tower of the imposing castle, embellished with an intricate network of Gothic arches and flying buttresses. Inside the castle, Mark Brock dips his fingers in a basin of holy oil and touches his forehead before the altar. Up in the clock tower, Panther claws at his mask, frantically attempting to pull it off. It stretches and elongates like elastic then snaps back like a second skin. He falls against the clock in a struggle. For a moment, the mask seems to dissolve then snaps back into place. Brock looks up at the noise. David pulls up the mask, ripping it across his distorted features. The black threads of the Suit adhering to his face like bulging veins. As if in a daze, Brock is drawn to the cries of his adversary, pushing open a door that leads to a staircase spiraling around the walls of the clock tower."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "They start to juggle clumsily, their hands hovering near each other. Peter suddenly tosses in a flamboyant gesture. Gwen throws her hands up. Peter puts his foot on her shoe and lifts her elbow. As the sequence concludes, he spins her around in his embrace. Peter's glacial blue eyes fixate on Mary Jane who appears bewildered. Gwen tracks his attention and reacts to him in surprise. She gives Peter a scolding glance and strides toward Mary Jane who's standing silently behind the guitar. Gwen shoves her way past Peter. Mary Jane dashes from the platform. Peter, looking indecisive, places his hand on his shoulder. He sneaks up behind Mary Jane with a menacing frown. She turns to face him with disdain in her eyes. Peter pins a waiter against the counter and starts fending off two more. He swipes out, sending Mary Jane spiraling to the ground. His fierce demeanor shifts to wide-eyed astonishment as he comprehends his actions. His eyes tear up, then he peeks down at the Black Spider-Man gloves under his dark open-neck jacket. Concealing the gloves with his hand, he turns away from Mary Jane and rushes out into the twilight. Mary Jane, still lying on the ground, glances around forlornly. Out in the misty street, Peter, keeping his hand hugged to his neck, steps into a corridor to ponder. Drawn by the sound of chimes, he looks up as the heavy rain pours down. A burst of lightning reveals a Gothic tower with a tall spired roof topped by a stone gargoyle. The storm clouds gradually disperse, leaving a lowering gray atmosphere. Perched high up on the studded side of the pinnacle, black-suited Spider-Man examines his hand, clenches his fingers, then descends from his ledge like a leaf knocked from a branch. He dives down to a circular doorway, leading to the bell tower of the massive cathedral, decorated with a detailed lattice of Gothic spires and flying balconies. Inside the cathedral, Eddie Brock dips his fingers in a vase of holy water and crosses himself before the pulpit. Up in the bell tower, Spider-Man scratches at his mask, frantically attempting to peel it off. It stretches and recoils like rubber then snaps back like a second layer. He leans against the bell in a struggle. For a second, the mask seems to vaporize then snaps back into place. Brock glances up at the noise. Peter lifts the mask, tearing it across his twisted features. The black filaments of the Symbiote sticking to his face like winding cords. As if in a daze, Brock is lured to the cries of his adversary, pushing open a door that leads to a stairway coiling around the walls of the bell tower."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "They begin to juggle quickly, their hands far apart. Alex suddenly tosses in an elaborate item. Lily tilts her hat forward. Alex places his elbow on her shoulder and lowers her arm. As the melody pauses, he flips her upward in his grasp. Alex's warm brown eyes focus on Vanessa who appears delighted. Lily follows his stare and rotates to him in surprise. She grants Alex a cheerful grin and strolls to Vanessa who's dancing energetically next to the speaker. Lily maneuvers her way around Alex. Vanessa dashes from the room. Alex, seeming confident, places his hand on his waist. He approaches Vanessa with a welcoming smile. She spins to greet him with joy in her expression. Alex hugs a waiter near the door and starts cheering for everyone. He shouts out, sending Vanessa leaping to the ceiling. His elated expression changes to wide-eyed delight as he realizes his actions. His lips smile, then he glances down at the Red Superman cape beneath his bright button-down jacket. Shielding the cape with his wrist, he spins away from Vanessa and strolls out into the evening. Vanessa, still bouncing on the ceiling, gazes around eagerly. Out in the sunlit avenue, Alex, keeping his wrist placed at his pocket, strolls into a garden to ponder. Attracted by the sound of a flute, he gazes up as the gentle breeze wafts through. A chorus of birds illuminates a modern skyscraper with a broad glass dome topped by a metal flagpole. The cotton candy clouds drift quickly, revealing a bright blue sky. Stationed low down by the metallic edge of the railing, red-caped Superman examines his wrist, uncurls his fingers, then dives from his station like a leaf blown off a branch. He sails down to a round doorway, leading to the light tower of the grand courthouse, adorned with a simple structure of metal beams and open spaces. Inside the courthouse, Sam Thompson dips his toe in a vat of ink and paints himself before the painting. Up in the light tower, Superman tugs at his cape, eagerly trying to unravel it. It unravels and contracts like silk then stretches back like a loose scarf. He leans against the light in a dance. For a moment, the cape seems to vanish then reappears instantly. Thompson peers up at the noise. Alex tugs up the cape, loosening it across his joyful appearance. The red fibers of the fabric clinging to his cheeks like favorite scarves. As if in a deep thought, Thompson is motivated by the laughter of his friend, unbolting a window that reveals a ladder spinning around the interior of the light tower."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Peter and Gwen dance closely, but Peter's sudden flashy move causes tension. As the dance ends, he notices Mary Jane's devastated expression. Gwen, realizing Peter's distraction, confronts him. Mary Jane, hurt, leaves the stage, prompting Peter to follow her with hostility. He accidentally knocks Mary Jane down during an altercation with bouncers, shocked by his own actions. Disturbed by the Black Spider-Man suit under his shirt, he retreats into the night. In the rain, Peter contemplates his actions near a Gothic church and climbs its spire as Spider-Man. Inside the cathedral, Eddie Brock performs a ritual. In the bell tower, Spider-Man struggles to remove his mask, revealing the Symbiote's hold. Hearing Peter's cries, Brock approaches the bell tower, drawn to his enemy's distress."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As if in a trance Brock is drawn to the screams of his nemesis pushing open a door that leads to a staircase winding around the walls of the bell tower The black threads of the Symbiote sticking to his face like bulging veins Peter pulls up the mask ripping it across his contorted features Brock looks up at the sound For a second the mask seems to disintegrate then snaps back into place He falls against the bell in a struggle It tears and stretches like rubber then snaps back like a second skin Up in the bell tower SpiderMan claws at his mask desperately trying to tear it off Inside the cathedral Eddie Brock dips his fingers in a font of holy water and crosses himself before the altar He plummets down to a square archway leading to the bell tower of the imposing cathedral decorated with an intricate network of Gothic arches and flying buttresses Perched high up on the studded side of the steeple blacksuited SpiderMan looks at his hand flexes his fist then drops from his perch like a bird shot from a tree The storm clouds slowly drift away leaving a lowering gray sky A flash of lightning illuminates a Gothic church with a tall studded spire topped by a stone crucifix Drawn by the sound of the bells he looks up as the torrential rain pours down Peter keeping his hand clasped at his collar steps into a doorway to think Out in the rain's wet street Mary Jane still sitting on the floor looks around helplessly Covering the suit with his hand he turns away from Mary Jane and hurries out into the night then he glances down at the Black SpiderMan suit under his dark openneck shirt His eyes well up His vicious expression turns to wideeyed shock as he realizes what he is done He lashes out sending Mary Jane careening to the floor Peter pins a bouncer against the wall and starts beating off two more She turns to face him with scorn in her eyes He comes up behind Mary Jane with a hostile scowl Peter looking uncertain puts his hand to his chest Mary Jane hurries from the stage Gwen pushes her way past Peter She gives Peter a reproving look and crosses to Mary Jane who is standing motionless behind the microphone Gwen follows his gaze and turns to him in shock Peter's cold black eyes settle on Mary Jane who looks devastated As the number ends he bends her over in his arms Peter puts his hand on her thigh and raises her leg Gwen throws her head back Peter suddenly throws in a fancy move They start to dance slowly their faces close together"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Mary Jane hurries from the stage She turns to face him with scorn in her eyes Peter's cold black eyes settle on Mary Jane who looks devastated Inside the cathedral Eddie Brock dips his fingers in a font of holy water and crosses himself before the altar Brock looks up at the sound Mary Jane still sitting on the floor looks around helplessly He falls against the bell in a struggle Perched high up on the studded side of the steeple blacksuited SpiderMan looks at his hand flexes his fist then drops from his perch like a bird shot from a tree Drawn by the sound of the bells he looks up as the torrential rain pours down He plummets down to a square archway leading to the bell tower of the imposing cathedral decorated with an intricate network of Gothic arches and flying buttresses For a second the mask seems to disintegrate then snaps back into place Peter looking uncertain puts his hand to his chest He comes up behind Mary Jane with a hostile scowl Up in the bell tower SpiderMan claws at his mask desperately trying to tear it off Gwen pushes her way past Peter Out in the rain's wet street His eyes well up As if in a trance Brock is drawn to the screams of his nemesis pushing open a door that leads to a staircase winding around the walls of the bell tower Gwen follows his gaze and turns to him in shock The storm clouds slowly drift away leaving a lowering gray sky They start to dance slowly their faces close together The black threads of the Symbiote sticking to his face like bulging veins Peter pins a bouncer against the wall and starts beating off two more Covering the suit with his hand he turns away from Mary Jane and hurries out into the night Gwen throws her head back Peter pulls up the mask ripping it across his contorted features It tears and stretches like rubber then snaps back like a second skin Peter keeping his hand clasped at his collar steps into a doorway to think Peter puts his hand on her thigh and raises her leg A flash of lightning illuminates a Gothic church with a tall studded spire topped by a stone crucifix As the number ends he bends her over in his arms He lashes out sending Mary Jane careening to the floor His vicious expression turns to wideeyed shock as he realizes what he is done then he glances down at the Black SpiderMan suit under his dark openneck shirt Peter suddenly throws in a fancy move She gives Peter a reproving look and crosses to Mary Jane who is standing motionless behind the microphone"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Covering the suit with his hand he turns away from Mary Jane and hurries out into the night Mary Jane still sitting on the floor looks around helplessly Out in the rain's wet street Peter keeping his hand clasped at his collar steps into a doorway to think Drawn by the sound of the bells he looks up as the torrential rain pours down A flash of lightning illuminates a Gothic church with a tall studded spire topped by a stone crucifix The storm clouds slowly drift away leaving a lowering gray sky Perched high up on the studded side of the steeple blacksuited SpiderMan looks at his hand flexes his fist then drops from his perch like a bird shot from a tree He plummets down to a square archway leading to the bell tower of the imposing cathedral decorated with an intricate network of Gothic arches and flying buttresses Inside the cathedral Eddie Brock dips his fingers in a font of holy water and crosses himself before the altar Up in the bell tower SpiderMan claws at his mask desperately trying to tear it off It tears and stretches like rubber then snaps back like a second skin He falls against the bell in a struggle For a second the mask seems to disintegrate then snaps back into place Brock looks up at the sound Peter pulls up the mask ripping it across his contorted features The black threads of the Symbiote sticking to his face like bulging veins As if in a trance Brock is drawn to the screams of his nemesis pushing open a door that leads to a staircase winding around the walls of the bell tower They start to dance slowly their faces close together Peter suddenly throws in a fancy move Gwen throws her head back Peter puts his hand on her thigh and raises her leg As the number ends he bends her over in his arms Peter's cold black eyes settle on Mary Jane who looks devastated Gwen follows his gaze and turns to him in shock She gives Peter a reproving look and crosses to Mary Jane who is standing motionless behind the microphone Gwen pushes her way past Peter Mary Jane hurries from the stage Peter looking uncertain puts his hand to his chest He comes up behind Mary Jane with a hostile scowl She turns to face him with scorn in her eyes Peter pins a bouncer against the wall and starts beating off two more He lashes out sending Mary Jane careening to the floor His vicious expression turns to wideeyed shock as he realizes what he is done His eyes well up then he glances down at the Black SpiderMan suit under his dark openneck shirt"
        }
      ]
    }
  ]
}