{
  "ground_truth": "A short time later, he takes a suitcase from under his bed and opens it to reveal his red and blue Spider-Man suit. He holds it up and gazes calmly at the spider emblazoned across the chest on its ribbed web, and his anxious eyes quieten. Up in his mansion, Harry turns off the TV and paces past a roaring fire with a hand clasped to his forehead. He stops in front of the portrait of his father and half turns his head to look at Peter, who is in his Spider-Man suit but without the mask. Lit by the glow from the fire, Harry turns around fully to face Peter, revealing ugly burns on his right cheek and a scar across his eye and throat. Harry looks impassively at Peter, then shakes his head. Peter turns away, rebuffed, and leaves by the balcony. In the goblin layer, Harry picks up the green goblin sword from among the debris on the floor. With the disfigured side of his face in shadow, a tear glistens in Harry's good eye, and he nods. Bernard softly withdraws. A huge searchlight picks up the yellow cab ensnared in a web high above the New York streets. Encaged in the cab, Mary Jane looks around nervously. The cab rocks and plummets down the web like a fish being tipped out of a net, then comes to rest on a lower web. A little girl in the vast crowd points up, and a wave of heads turn to face Spider-Man swinging down on a thread. Spider-Man leaps onto a building with the Stars and Stripes fluttering behind him, then launches himself towards the action. He swings up a lamppost, past the reporter, Jennifer Dugan. Spider-Man launches himself through the air, the night lights twinkling all around, and lands on the bonnet of the yellow cab. Venom swings into Spider-Man and knocks him through the windscreen, tearing off the roof. Spider-Man clambers onto the boot as Venom's mask slithers off his face like a tangle of snakes to reveal Brock, who grabs Mary Jane. Brock sends Spider-Man plummeting to a lower web. Spider-Man's wrists are lashed to the web with webbing fired by Brock, who lands on top of him and tears off the Spider-Man mask. Peter's eyes widen as a truck suspended above the yellow cab starts shedding its load of breeze blocks, which rain down like giant hailstones, ripping a door off the cab. Mary Jane tries to maneuver a breeze block lodged in the cab while Peter struggles to free himself. Mary Jane raises the breeze block above her head as the symbiote mask wraps itself around Brock's face. She drops the breeze block, hitting the snarling Venom on the head.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A brief period afterward, he retrieves a valise from beneath his cot and unfastens it to unveil his crimson and azure Spider-Man attire. He grasps it up and observes serenely at the arachnid emblazoned across the torso on its corded lattice, and his uneasy gaze soothes. Up in his manor, Harry switches off the television and strides past a blazing hearth with a palm clasped to his brow. He pauses in front of the portrait of his father and partially turns his head to glance at Peter, who is in his Spider-Man attire but without the mask. Illuminated by the glow from the hearth, Harry pivots fully to confront Peter, revealing unsightly scars on his right cheek and a gash across his eye and neck. Harry gazes indifferently at Peter, then shakes his head. Peter turns away, disheartened, and exits by the balcony. In the goblin chamber, Harry picks up the green goblin sword from among the wreckage on the floor. With the marred side of his countenance in shadow, a tear shimmers in Harry's good eye, and he nods. Bernard quietly retreats. A vast searchlight captures the yellow cab entangled in a lattice high above the New York avenues. Confined in the cab, Mary Jane looks around apprehensively. The cab sways and plummets down the lattice like a fish being tipped out of a net, then comes to rest on a lower lattice. A little girl in the immense throng points up, and a wave of heads turns to face Spider-Man swinging down on a filament. Spider-Man vaults onto a structure with the Stars and Stripes fluttering behind him, then propels himself towards the fray. He swings up a lamppost, past the journalist, Jennifer Dugan. Spider-Man launches himself through the atmosphere, the nocturnal lights sparkling all around, and lands on the hood of the yellow cab. Venom swings into Spider-Man and knocks him through the windshield, ripping off the roof. Spider-Man scrambles onto the trunk as Venom's mask slithers off his face like a snarl of serpents to reveal Brock, who seizes Mary Jane. Brock sends Spider-Man plunging to a lower lattice. Spider-Man's wrists are bound to the lattice with webbing discharged by Brock, who lands atop him and rips off the Spider-Man mask. Peter's eyes widen as a lorry suspended above the yellow cab starts shedding its load of cinder blocks, which rain down like giant hailstones, tearing a door off the cab. Mary Jane attempts to maneuver a cinder block lodged in the cab while Peter struggles to free himself. Mary Jane raises the cinder block above her head as the symbiote mask wraps itself around Brock's face. She drops the cinder block, striking the snarling Venom on the head."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A short time later, a suitcase is taken from under his bed and opened by him to reveal his red and blue Spider-Man suit. It is held up by him, and the spider emblazoned across the chest on its ribbed web is gazed at calmly, quietening his anxious eyes. Up in his mansion, the TV is turned off by Harry, who paces past a roaring fire with a hand clasped to his forehead. He stops in front of the portrait of his father, and half his head is turned to look at Peter, who is in his Spider-Man suit but without the mask. Lit by the glow from the fire, Peter is fully faced by Harry, revealing ugly burns on Harry's right cheek and a scar across his eye and throat. Peter is looked at impassively by Harry, then his head is shaken. Rebuffed, Peter turns away and leaves by the balcony. In the goblin layer, the green goblin sword is picked up by Harry from among the debris on the floor. With the disfigured side of his face in shadow, a tear glistens in Harry's good eye, and he nods. Bernard softly withdraws. The yellow cab is picked up by a huge searchlight, ensnared in a web high above the New York streets. Nervously, Mary Jane looks around, encaged in the cab. The cab is rocked and is made to plummet down the web like a fish being tipped out of a net, then it comes to rest on a lower web. Up, a little girl in the vast crowd points, and a wave of heads turn to face Spider-Man, who is swinging down on a thread. Onto a building, Spider-Man leaps with the Stars and Stripes fluttering behind him, then he launches himself towards the action. Up a lamppost, past the reporter, Jennifer Dugan, he swings. Through the air, Spider-Man launches himself, the night lights twinkling all around, and lands on the bonnet of the yellow cab. Spider-Man is swung into by Venom, and he is knocked through the windscreen, the roof being torn off. Onto the boot, Spider-Man clambers as Venom's mask slithers off his face like a tangle of snakes, revealing Brock, who grabs Mary Jane. Spider-Man is sent plummeting to a lower web by Brock. Spider-Man's wrists are lashed to the web with webbing, which is fired by Brock, who lands on top of him and tears off the Spider-Man mask. As a truck suspended above the yellow cab starts shedding its load of breeze blocks, which rip a door off the cab as they rain down like giant hailstones, Peter's eyes widen. A breeze block lodged in the cab is tried to be maneuvered by Mary Jane while Peter struggles to free himself. The breeze block is raised above her head by Mary Jane as the symbiote mask wraps itself around Brock's face. The breeze block is dropped by her, hitting the snarling Venom on the head."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Shortly after, he retrieves a suitcase from under his bed, revealing his red and blue Spider-Man suit. He holds it up, gazing calmly at the spider emblem, and his anxious eyes relax. In his mansion, Harry turns off the TV, paces past a roaring fire, and stops before his father's portrait, half-turning to Peter, who is in his Spider-Man suit without the mask. Lit by the fire's glow, Harry fully faces Peter, showing burns on his cheek and a scar across his eye and throat. Harry looks at Peter impassively, shakes his head, and Peter turns away, leaving by the balcony. In the goblin lair, Harry picks up the green goblin sword from the debris. With his disfigured face in shadow, a tear glistens in his good eye, and he nods. Bernard quietly withdraws. A searchlight spots a yellow cab ensnared in a web above New York streets. Inside, Mary Jane looks around nervously. The cab rocks and plummets down the web, then rests on a lower web. A girl in the crowd points up, and heads turn to see Spider-Man swinging down. He leaps onto a building with the Stars and Stripes behind him, then launches toward the action. Spider-Man swings up a lamppost, past reporter Jennifer Dugan, and lands on the yellow cab's bonnet. Venom swings into Spider-Man, knocking him through the windscreen and tearing off the roof. Spider-Man clambers onto the boot as Venom's mask slithers off, revealing Brock, who grabs Mary Jane. Brock sends Spider-Man to a lower web, lashing his wrists with webbing. Brock lands on him, tearing off the Spider-Man mask. Peter's eyes widen as a truck above the cab sheds breeze blocks, which rain down, ripping a door off. Mary Jane tries to maneuver a breeze block while Peter struggles to free himself. She raises the block above her head as the symbiote mask wraps around Brock's face, then drops it, hitting Venom on the head."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Shortly after, he retrieves a suitcase from under his bed, revealing his Spider-Man suit. He gazes at the spider emblem, calming his anxious eyes. In his mansion, Harry turns off the TV, paces by a fire, and stops at his father's portrait, looking at Peter in his Spider-Man suit without a mask. Firelight reveals burns and scars on Harry's face. He looks at Peter, shakes his head, and Peter leaves via the balcony. In the goblin lair, Harry picks up the goblin sword, a tear in his good eye, and nods as Bernard withdraws. A searchlight finds a yellow cab in a web above New York. Inside, Mary Jane looks around nervously as the cab rocks and settles on a lower web. A girl in the crowd points at Spider-Man swinging down. He leaps onto a building with the flag behind him, then towards the action, past reporter Jennifer Dugan. Spider-Man lands on the cab's bonnet. Venom knocks him through the windscreen, tearing off the roof. Spider-Man climbs onto the boot as Venom's mask reveals Brock, who grabs Mary Jane. Brock sends Spider-Man to a lower web, binding his wrists. Brock lands on him, removing his mask. Peter sees a truck above shedding breeze blocks, ripping the cab's door. Mary Jane maneuvers a breeze block while Peter struggles. She drops it on Venom's head as the symbiote mask covers Brock's face."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A short time later, he retrieves a suitcase from its hidden spot beneath his bed and carefully opens it to reveal the iconic red and blue Spider-Man suit. He holds the suit up, gazing calmly at the spider symbol emblazoned across the chest on its intricately ribbed webbing, and his previously anxious eyes begin to quieten. Meanwhile, up in his expansive mansion, Harry turns off the television and paces back and forth past a roaring fire, one hand clasped to his forehead in deep thought. He pauses in front of the large portrait of his father, half-turning his head to glance at Peter, who stands there in his Spider-Man suit, notably without the mask. Bathed in the warm glow from the fire, Harry fully turns around to face Peter, revealing the ugly burns on his right cheek and a prominent scar that stretches across his eye and throat. Harry looks at Peter with an impassive expression, then shakes his head in silent disapproval. Feeling rebuffed, Peter turns away and exits via the balcony. In the goblin lair, Harry picks up the green goblin sword from among the scattered debris on the floor. With the disfigured side of his face cast in shadow, a single tear glistens in Harry's good eye, and he nods solemnly. Bernard, the butler, softly withdraws from the scene. \n\nOutside, a huge searchlight illuminates a yellow cab ensnared in a web high above the bustling New York streets. Trapped inside the cab, Mary Jane looks around nervously, her eyes wide with fear. The cab rocks precariously and plummets down the web like a fish being tipped out of a net, only to come to rest on a lower web. In the vast crowd below, a little girl points upward, and a wave of heads turns to witness Spider-Man swinging down on a slender thread. Spider-Man leaps gracefully onto a nearby building, the Stars and Stripes fluttering proudly behind him, then launches himself towards the unfolding action. He swings up a lamppost, passing by the reporter, Jennifer Dugan. Spider-Man propels himself through the air, the night lights twinkling all around him, and lands deftly on the bonnet of the yellow cab. Suddenly, Venom swings into Spider-Man, knocking him through the windscreen and tearing off the roof in the process. Spider-Man clambers onto the boot as Venom's mask slithers off his face like a tangle of snakes, revealing Brock, who seizes Mary Jane. Brock sends Spider-Man plummeting to a lower web. Spider-Man's wrists are quickly lashed to the web with webbing fired by Brock, who lands on top of him and tears off the Spider-Man mask. Peter's eyes widen in alarm as a truck suspended above the yellow cab begins shedding its load of breeze blocks, which rain down like giant hailstones, ripping a door off the cab. Mary Jane desperately tries to maneuver a breeze block lodged in the cab while Peter struggles to free himself from his bindings. Mary Jane raises the heavy breeze block above her head just as the symbiote mask wraps itself around Brock's face once more. She drops the breeze block, striking the snarling Venom on the head."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A short time later, he carefully retrieves a suitcase from its well-concealed hiding spot beneath his bed. With deliberate precision, he opens it to reveal the iconic red and blue Spider-Man suit nestled within. He holds the suit aloft, gazing intently at the spider symbol that is emblazoned across the chest on its intricately ribbed webbing. As he observes it, his previously anxious eyes begin to grow calmer and more composed. Meanwhile, high above in his expansive and opulent mansion, Harry turns off the television and begins to pace back and forth, walking repeatedly past the roaring fire. He has one hand clasped to his forehead, lost in deep and contemplative thought. He pauses in front of a large portrait of his father, only half-turning his head to glance at Peter, who stands there clad in his Spider-Man suit, notably without the mask. Bathed in the warm, flickering glow from the fire, Harry fully turns around to face Peter, revealing the disfiguring burns on his right cheek and the prominent scar that stretches across his eye and throat. Harry regards Peter with an impassive expression before shaking his head in silent and unmistakable disapproval. Feeling rebuffed and rejected, Peter turns away and exits the room via the balcony. In the dim goblin lair, Harry slowly picks up the green goblin sword from among the scattered debris strewn across the floor. With the disfigured side of his face cast in shadow, a single tear glistens somberly in Harry's good eye, and he nods solemnly. Bernard, the ever-faithful butler, softly withdraws from the poignant scene.\n\nOutside, a huge searchlight dramatically illuminates a yellow cab that is ensnared high above the bustling New York streets in a sticky web. Trapped nervously inside the cab, Mary Jane looks around with wide eyes filled with fear. The cab rocks precariously and plummets down the web like a fish being tipped out of a net, only to come to an abrupt rest on a lower web. In the vast crowd that has gathered below, a little girl eagerly points upward, prompting a wave of heads to turn to witness Spider-Man swinging gracefully down on a slender, silken thread. Spider-Man leaps with agility onto a nearby building, the Stars and Stripes fluttering proudly behind him in the night breeze, before launching himself toward the unfolding action. He swings up a lamppost, passing by the reporter, Jennifer Dugan. Spider-Man propels himself through the night air, the city lights twinkling all around him, and lands deftly on the bonnet of the yellow cab. Suddenly, Venom swings into action, colliding with Spider-Man and knocking him forcefully through the windscreen, tearing off the roof in the ensuing chaos. Spider-Man clambers onto the boot as Venom's sinister mask slithers off his face like a writhing tangle of snakes, revealing Brock underneath, who seizes Mary Jane in his grasp. Brock sends Spider-Man plummeting to a lower web, where Spider-Man's wrists are quickly lashed to the web with webbing fired by Brock, who lands on top of him and tears off the Spider-Man mask. Peter's eyes widen in alarm as a truck suspended ominously above the yellow cab begins shedding its heavy load of breeze blocks, which rain down like giant hailstones, ripping a door off the cab in the process. Mary Jane desperately tries to maneuver a breeze block lodged in the cab while Peter struggles to free himself from his bindings. Just as Mary Jane raises the heavy breeze block above her head, the symbiote mask wraps itself around Brock's face once more. Acting swiftly, she drops the breeze block, striking the snarling Venom on the head."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A short time later, he carefully reaches under his bed, feeling around until his fingers grasp the handle of a suitcase. He pulls it out and places it on the floor, then slowly unzips it to reveal the vibrant red and blue Spider-Man suit neatly folded inside. He gently lifts the suit, holding it up to examine the intricate design, his eyes focusing on the spider emblem emblazoned across the chest, its ribbed web pattern catching the light. As he gazes at it, his previously anxious eyes gradually soften and quieten, finding a sense of calm. Meanwhile, up in his mansion, Harry methodically turns off the TV, the screen going dark, and begins to pace back and forth in front of a roaring fire, his hand clasped to his forehead in a gesture of deep contemplation. He halts his pacing in front of a large portrait of his father, his eyes lingering on the image before he half turns his head to glance at Peter, who stands nearby in his Spider-Man suit, notably without the mask. The flickering glow from the fire casts shadows across the room as Harry fully turns to face Peter, revealing the ugly burns marring his right cheek and the scar that runs across his eye and throat. Harry's expression remains impassive as he looks at Peter, then he slowly shakes his head in silent disapproval. Feeling rebuffed, Peter turns away from Harry, his movements deliberate as he heads towards the balcony, stepping out into the night. In the goblin layer, Harry bends down to pick up the green goblin sword from among the scattered debris on the floor. The disfigured side of his face is cast in shadow, but a single tear glistens in his good eye, betraying his inner turmoil as he nods to himself. Bernard, observing the moment, softly withdraws from the scene. Outside, a huge searchlight sweeps across the sky, eventually illuminating a yellow cab ensnared in a web high above the bustling New York streets. Inside the cab, Mary Jane looks around nervously, her eyes darting as the cab rocks precariously. Suddenly, the cab plummets down the web like a fish being tipped out of a net, only to come to a rest on a lower web. In the vast crowd below, a little girl points upwards, her finger guiding a wave of heads to turn and face Spider-Man as he swings down on a thread. Spider-Man gracefully leaps onto a nearby building, the Stars and Stripes fluttering majestically behind him, before launching himself towards the unfolding action. He swings up a lamppost, deftly maneuvering past the reporter, Jennifer Dugan, and propels himself through the air, the night lights twinkling all around him, until he lands with precision on the bonnet of the yellow cab. In a sudden clash, Venom swings into Spider-Man, the impact sending him crashing through the windscreen and tearing off the roof. Spider-Man quickly clambers onto the boot of the cab as Venom's mask slithers off his face like a tangle of snakes, revealing Brock underneath. Brock seizes Mary Jane, his grip firm, and with a swift motion, sends Spider-Man plummeting to a lower web. Spider-Man's wrists are quickly lashed to the web with webbing fired by Brock, who lands on top of him and viciously tears off the Spider-Man mask. Peter's eyes widen in alarm as he notices a truck suspended above the yellow cab beginning to shed its load of breeze blocks, which rain down like giant hailstones, one of them ripping a door off the cab. Inside, Mary Jane struggles to maneuver a breeze block lodged in the cab, her movements urgent as Peter fights to free himself from his restraints. With determination, Mary Jane raises the breeze block above her head just as the symbiote mask wraps itself around Brock's face. In a decisive moment, she drops the breeze block, striking the snarling Venom on the head."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A short time later, he retrieves a suitcase from under his bed, revealing his red and blue Spider-Man suit. As he holds it up, his anxious eyes calm at the sight of the spider emblem. Meanwhile, in his mansion, Harry turns off the TV and paces by a roaring fire, stopping to look at a portrait of his father before facing Peter, who stands in his Spider-Man suit without the mask. The firelight reveals Harry's burns and scars as he impassively regards Peter, then shakes his head. Feeling rebuffed, Peter turns away and exits via the balcony. In the goblin layer, Harry picks up the green goblin sword from the debris, a tear glistening in his good eye as Bernard quietly withdraws. A searchlight illuminates a yellow cab ensnared in a web high above New York, with Mary Jane nervously inside. The cab rocks and drops to a lower web. A little girl in the crowd points, drawing attention to Spider-Man swinging down. He leaps onto a building with the Stars and Stripes behind him, then launches toward the action, swinging past reporter Jennifer Dugan. Spider-Man lands on the cab's bonnet as Venom knocks him through the windscreen, tearing off the roof. Spider-Man climbs onto the boot as Venom's mask reveals Brock, who grabs Mary Jane and sends Spider-Man to a lower web. Brock webs Spider-Man's wrists and tears off his mask. Peter's eyes widen as a truck above sheds its load of breeze blocks, which rain down, ripping a door off the cab. Mary Jane maneuvers a breeze block while Peter struggles to free himself. She raises the block above her head and drops it on Venom, hitting him as the symbiote mask envelops Brock's face."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A short time later, he takes a suitcase from under his bed and opens it to reveal his red and blue Spider-Man suit, a symbol of his dual life as both Peter Parker and the masked hero. He holds it up and gazes calmly at the spider emblazoned across the chest on its ribbed web, a design inspired by the creature's ability to weave intricate traps, and his anxious eyes quieten. Up in his mansion, an opulent estate passed down through generations of the Osborn family known for their corporate empire, Harry turns off the TV and paces past a roaring fire with a hand clasped to his forehead. He stops in front of the portrait of his father, Norman Osborn, the original Green Goblin, and half turns his head to look at Peter, who is in his Spider-Man suit but without the mask. Lit by the glow from the fire, Harry turns around fully to face Peter, revealing ugly burns on his right cheek and a scar across his eye and throat, injuries from their previous encounter. Harry looks impassively at Peter, then shakes his head. Peter turns away, rebuffed, and leaves by the balcony, an exit that leads to a private garden below. In the goblin layer, a secret room filled with advanced gadgets and weapons developed by Norman, Harry picks up the green goblin sword from among the debris on the floor. With the disfigured side of his face in shadow, a tear glistens in Harry's good eye, and he nods, acknowledging his conflicted feelings. Bernard, the loyal family butler who has served the Osborns for many years, softly withdraws. A huge searchlight picks up the yellow cab ensnared in a web high above the New York streets, a testament to Spider-Man's web-slinging prowess. Encaged in the cab, Mary Jane, Peter's long-time love interest, looks around nervously. The cab rocks and plummets down the web like a fish being tipped out of a net, then comes to rest on a lower web. A little girl in the vast crowd points up, and a wave of heads turn to face Spider-Man swinging down on a thread. Spider-Man leaps onto a building with the Stars and Stripes fluttering behind him, symbolizing his role as a protector of the city, then launches himself towards the action. He swings up a lamppost, past the reporter Jennifer Dugan, who is covering the unfolding chaos for a major news network. Spider-Man launches himself through the air, the night lights twinkling all around, and lands on the bonnet of the yellow cab. Venom, an alien symbiote bonded with Eddie Brock, swings into Spider-Man and knocks him through the windscreen, tearing off the roof. Spider-Man clambers onto the boot as Venom's mask slithers off his face like a tangle of snakes to reveal Brock, who grabs Mary Jane. Brock sends Spider-Man plummeting to a lower web. Spider-Man's wrists are lashed to the web with webbing fired by Brock, who lands on top of him and tears off the Spider-Man mask, exposing Peter's identity. Peter's eyes widen as a truck suspended above the yellow cab starts shedding its load of breeze blocks, which rain down like giant hailstones, ripping a door off the cab. Mary Jane tries to maneuver a breeze block lodged in the cab while Peter struggles to free himself. Mary Jane raises the breeze block above her head as the symbiote mask wraps itself around Brock's face. She drops the breeze block, hitting the snarling Venom on the head, temporarily incapacitating him."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A short time later he takes a suitcase from under his bed and opens it to reveal his red and blue SpiderMan suit  He holds it up and gazes calmly at the spider emblazoned across the chest on its ribbed web and his anxious eyes quieten  Up in his mansion  Bernard softly withdraws  A huge searchlight picks up the yellow cab ensnared in a web high above the New York streets  Encaged in the cab Mary Jane looks around nervously  The cab rocks and plummets down the web like a fish being tipped out of a net then comes to rest on a lower web  A little girl in the vast crowd points up and a wave of heads turn to face SpiderMan swinging down on a thread  SpiderMan leaps onto a building with the Stars and Stripes fluttering behind him then launches himself towards the action  He swings up a lamppost past the reporter Jennifer Dugan  SpiderMan launches himself through the air  the night lights twinkling all around and lands on the bonnet of the yellow cab  Venom swings into SpiderMan and knocks him through the windscreen tearing off the roof  SpiderMan clambers onto the boot as Venom's mask slithers off his face like a tangle of snakes to reveal Brock who grabs Mary Jane  Brock sends SpiderMan plummeting to a lower web  SpiderMan's wrists are lashed to the web with webbing fired by Brock who lands on top of him and tears off the SpiderMan mask  Peter's eyes widen as a truck suspended above the yellow cab starts shedding its load of breeze blocks which rain down like giant hailstones ripping a door off the cab  Harry turns off the TV and paces past a roaring fire with a hand clasped to his forehead  He stops in front of the portrait of his father and half turns his head to look at Peter who is in his SpiderMan suit but without the mask  Lit by the glow from the fire Harry turns around fully to face Peter revealing ugly burns on his right cheek and a scar across his eye and throat  Harry looks impassively at Peter then shakes his head  Peter turns away rebuffed and leaves by the balcony  In the goblin layer Harry picks up the green goblin sword from among the debris on the floor  With the disfigured side of his face in shadow a tear glistens in Harry's good eye and he nods  Bernard softly withdraws  A huge searchlight picks up the yellow cab ensnared in a web high above the New York streets  Encaged in the cab Mary Jane looks around nervously  The cab rocks and plummets down the web like a fish being tipped out of a net then comes to rest on a lower web  A little girl in the vast crowd points up and a wave of heads turn to face SpiderMan swinging down on a thread  SpiderMan leaps onto a building with the Stars and Stripes fluttering behind him then launches himself towards the action  He swings up a lamppost past the reporter Jennifer Dugan  SpiderMan launches himself through the air  the night lights twinkling all around and lands on the bonnet of the yellow cab  Venom swings into SpiderMan and knocks him through the windscreen tearing off the roof  SpiderMan clambers onto the boot as Venom's mask slithers off his face like a tangle of snakes to reveal Brock who grabs Mary Jane  Brock sends SpiderMan plummeting to a lower web  SpiderMan's wrists are lashed to the web with webbing fired by Brock who lands on top of him and tears off the SpiderMan mask  Peter's eyes widen as a truck suspended above the yellow cab starts shedding its load of breeze blocks which rain down like giant hailstones ripping a door off the cab  Mary Jane tries to maneuver a breeze block lodged in the cab  while Peter struggles to free himself  Mary Jane raises the breeze block above her head as the symbiote mask wraps itself around Brock's face  She drops the breeze block hitting the snarling Venom on the head"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A short time later he takes a suitcase from under his bed and opens it to reveal his red and blue SpiderMan suit. He holds it up and gazes calmly at the spider emblazoned across the chest on its ribbed web and his anxious eyes quieten. Up in his mansion. Harry turns off the TV and paces past a roaring fire with a hand clasped to his forehead. He stops in front of the portrait of his father and half turns his head to look at Peter who is in his SpiderMan suit but without the mask. Lit by the glow from the fire Harry turns around fully to face Peter revealing ugly burns on his right cheek and a scar across his eye and throat. Harry looks impassively at Peter then shakes his head. Peter turns away rebuffed and leaves by the balcony. In the goblin layer Harry picks up the green goblin sword from among the debris on the floor. With the disfigured side of his face in shadow a tear glistens in Harry's good eye and he nods. Bernard softly withdraws. A huge searchlight picks up the yellow cab ensnared in a web high above the New York streets. Encaged in the cab Mary Jane looks around nervously. The cab rocks and plummets down the web like a fish being tipped out of a net then comes to rest on a lower web. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. A little girl in the vast crowd points up and a wave of heads turn to face SpiderMan swinging down on a thread. SpiderMan leaps onto a building with the Stars and Stripes fluttering behind him then launches himself towards the action. He swings up a lamppost past the reporter Jennifer Dugan. SpiderMan launches himself through the air. the night lights twinkling all around and lands on the bonnet of the yellow cab. Venom swings into SpiderMan and knocks him through the windscreen tearing off the roof. SpiderMan clambers onto the boot as Venom's mask slithers off his face like a tangle of snakes to reveal Brock who grabs Mary Jane. Brock sends SpiderMan plummeting to a lower web. SpiderMan's wrists are lashed to the web with webbing fired by Brock who lands on top of him and tears off the SpiderMan mask. Peter's eyes widen as a truck suspended above the yellow cab starts shedding its load of breeze blocks which rain down like giant hailstones ripping a door off the cab. Mary Jane tries to maneuver a breeze block lodged in the cab. while Peter struggles to free himself. Mary Jane raises the breeze block above her head as the symbiote mask wraps itself around Brock's face. She drops the breeze block hitting the snarling Venom on the head."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A short time later he takes a suitcase from under his bed and opens it to reveal his red and blue SpiderMan suit. He holds it up and gazes calmly at the spider emblazoned across the chest on its ribbed web and his anxious eyes quieten. Up in his mansion. Harry turns off the TV and paces past a roaring fire with a hand clasped to his forehead. He stops in front of the portrait of his father and half turns his head to look at Peter who is in his SpiderMan suit but without the mask. Lit by the glow from the fire Harry turns around fully to face Peter revealing ugly burns on his right cheek and a scar across his eye and throat. Harry looks impassively at Peter then shakes his head. Peter turns away rebuffed and leaves by the balcony. In the goblin layer Harry picks up the green goblin sword from among the debris on the floor. With the disfigured side of his face in shadow a tear glistens in Harry's good eye and he nods. Bernard softly withdraws. A huge searchlight picks up the yellow cab ensnared in a web high above the New York streets. Encaged in the cab Mary Jane looks around nervously. The cab rocks and plummets down the web like a fish being tipped out of a net then comes to rest on a lower web. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. A little girl in the vast crowd points up and a wave of heads turn to face SpiderMan swinging down on a thread. SpiderMan leaps onto a building with the Stars and Stripes fluttering behind him then launches himself towards the action. He swings up a lamppost past the reporter Jennifer Dugan. SpiderMan launches himself through the air. the night lights twinkling all around and lands on the bonnet of the yellow cab. Venom swings into SpiderMan and knocks him through the windscreen tearing off the roof. SpiderMan clambers onto the boot as Venom's mask slithers off his face like a tangle of snakes to reveal Brock who grabs Mary Jane. Brock sends SpiderMan plummeting to a lower web. SpiderMan's wrists are lashed to the web with webbing fired by Brock who lands on top of him and tears off the SpiderMan mask. Peter's eyes widen as a truck suspended above the yellow cab starts shedding its load of breeze blocks which rain down like giant hailstones ripping a door off the cab. Mary Jane tries to maneuver a breeze block lodged in the cab. while Peter struggles to free himself. Mary Jane raises the breeze block above her head as the symbiote mask wraps itself around Brock's face. She drops the breeze block hitting the snarling Venom on the head."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A short time later he takes a suitcase from under his bed and opens it to reveal his red and blue SpiderMan suit. He holds it up and gazes calmly at the spider emblazoned across the chest on its ribbed web and his anxious eyes quieten. Up in his mansion. Harry turns off the TV and paces past a roaring fire with a hand clasped to his forehead. He stops in front of the portrait of his father and half turns his head to look at Peter who is in his SpiderMan suit but without the mask. Lit by the glow from the fire Harry turns around fully to face Peter revealing ugly burns on his right cheek and a scar across his eye and throat. Harry looks impassively at Peter then shakes his head. Brock sends SpiderMan plummeting to a lower web. SpiderMan's wrists are lashed to the web with webbing fired by Brock who lands on top of him and tears off the SpiderMan mask. Peter's eyes widen as a truck suspended above the yellow cab starts shedding its load of breeze blocks which rain down like giant hailstones ripping a door off the cab. Mary Jane tries to maneuver a breeze block lodged in the cab. while Peter struggles to free himself. Mary Jane raises the breeze block above her head as the symbiote mask wraps itself around Brock's face. She drops the breeze block hitting the snarling Venom on the head."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A short time later he takes a suitcase from under his bed and opens it to reveal his red and blue SpiderMan suit. He holds it up and gazes calmly at the spider emblazoned across the chest on its ribbed web and his anxious eyes quieten. Up in his mansion. while Peter struggles to free himself. Mary Jane raises the breeze block above her head as the symbiote mask wraps itself around Brock's face. She drops the breeze block hitting the snarling Venom on the head."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A short time later, the elephant takes a suitcase from under his bed and opens it to reveal his red and blue Spider-Man suit. The elephant holds it up and gazes calmly at the spider emblazoned across the chest on its ribbed web, and the elephant's anxious eyes quieten. Up in her mansion, the giraffe turns off the TV and paces past a roaring fire with a hand clasped to her forehead. The giraffe stops in front of the portrait of her father and half turns her head to look at the penguin, who is in his Spider-Man suit but without the mask. Lit by the glow from the fire, the giraffe turns around fully to face the penguin, revealing ugly burns on her right cheek and a scar across her eye and throat. The giraffe looks impassively at the penguin, then shakes her head. The penguin turns away, rebuffed, and leaves by the balcony. In the goblin layer, the monkey picks up the green goblin sword from among the debris on the floor. With the disfigured side of her face in shadow, a tear glistens in the monkey's good eye, and the monkey nods. The owl softly withdraws. A huge searchlight picks up the yellow cab ensnared in a web high above the New York streets. Encaged in the cab, the dolphin looks around nervously. The cab rocks and plummets down the web like a fish being tipped out of a net, then comes to rest on a lower web. A little rabbit in the vast crowd points up, and a wave of heads turn to face Spider-Man swinging down on a thread. Spider-Man leaps onto a building with the Stars and Stripes fluttering behind him, then launches himself towards the action. He swings up a lamppost, past the reporter, Jennifer Dugan. Spider-Man launches himself through the air, the night lights twinkling all around, and lands on the bonnet of the yellow cab. The raccoon swings into Spider-Man and knocks him through the windscreen, tearing off the roof. Spider-Man clambers onto the boot as the raccoon's mask slithers off his face like a tangle of snakes to reveal the fox, who grabs the dolphin. The fox sends Spider-Man plummeting to a lower web. Spider-Man's wrists are lashed to the web with webbing fired by the fox, who lands on top of him and tears off the Spider-Man mask. The penguin's eyes widen as a truck suspended above the yellow cab starts shedding its load of breeze blocks, which rain down like giant hailstones, ripping a door off the cab. The dolphin tries to maneuver a breeze block lodged in the cab while the penguin struggles to free himself. The dolphin raises the breeze block above her head as the symbiote mask wraps itself around the fox's face. She drops the breeze block, hitting the snarling raccoon on the head."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A short time later, he takes a duffel bag from under his couch and opens it to reveal his red and blue Captain America outfit. He holds it up and gazes calmly at the star emblazoned across the chest on its textured stripes, and his anxious eyes quieten. Up in his penthouse, Harry turns off the radio and paces past a flickering lantern with a hand clasped to his forehead. He stops in front of the sculpture of his father and half turns his head to look at Peter, who is in his Captain America outfit but without the helmet. Lit by the glow from the lantern, Harry turns around fully to face Peter, revealing ugly burns on his right cheek and a scar across his nose and throat. Harry looks impassively at Peter, then shakes his head. Peter turns away, rebuffed, and leaves by the terrace. In the goblin chamber, Harry picks up the green goblin dagger from among the trash on the floor. With the disfigured side of his face in shadow, a tear glistens in Harry's good eye, and he nods. Bernard softly withdraws. A huge lighthouse picks up the yellow taxi ensnared in a net high above the Los Angeles streets. Encaged in the taxi, Mary Jane looks around nervously. The taxi rocks and plummets down the net like a bird being tipped out of a nest, then comes to rest on a lower net. A little girl in the vast crowd points up, and a wave of heads turn to face Captain America swinging down on a rope. Captain America leaps onto a bridge with the Union Jack fluttering behind him, then launches himself towards the action. He swings up a tree, past the anchor, Jennifer Dugan. Captain America launches himself through the air, the night lights twinkling all around, and lands on the hood of the yellow taxi. Venom swings into Captain America and knocks him through the windshield, tearing off the roof. Captain America clambers onto the trunk as Venom's mask slithers off his face like a tangle of vines to reveal Brock, who grabs Mary Jane. Brock sends Captain America plummeting to a lower net. Captain America's wrists are lashed to the net with twine fired by Brock, who lands on top of him and tears off the Captain America helmet. Peter's eyes widen as a crane suspended above the yellow taxi starts shedding its load of cinder blocks, which rain down like giant hailstones, ripping a door off the taxi. Mary Jane tries to maneuver a cinder block lodged in the taxi while Peter struggles to free himself. Mary Jane raises the cinder block above her head as the symbiote mask wraps itself around Brock's face. She drops the cinder block, hitting the snarling Venom on the head."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A short time later, he retrieves a suitcase from under his bed and closes it to conceal his red and blue Spider-Man suit. He lifts it up and stares intently at the spider emblazoned across the chest on its ribbed web, and his anxious eyes brighten. Up in his mansion, Harry switches on the TV and strolls past a roaring fire with a hand resting on his forehead. He pauses in front of the portrait of his father and slightly turns his head to glance at Peter, who is in his Spider-Man suit but without the mask. Lit by the glow from the fire, Harry fully turns away from Peter, revealing ugly burns on his right cheek and a scar across his eye and throat. Harry gazes blankly at Peter, then nods his head. Peter faces away, dismissed, and exits by the balcony. In the goblin layer, Harry drops the green goblin sword amid the debris on the floor. With the disfigured side of his face in shadow, a tear glistens in Harry's good eye, and he shakes his head. Bernard quietly advances. A huge searchlight illuminates the yellow cab perched on a web high above the New York streets. Encaged in the cab, Mary Jane looks around anxiously. The cab shudders and slides down the web like a fish being released from a net, then stops to rest on a lower web. A little girl in the vast crowd waves up, and a wave of heads turns to see Spider-Man gliding down on a thread. Spider-Man bounds onto a building with the Stars and Stripes rippling behind him, then propels himself towards the action. He ascends a lamppost, past the reporter, Jennifer Dugan. Spider-Man propels himself through the air, the night lights glittering all around, and perches on the bonnet of the yellow cab. Venom swings into Spider-Man and hurls him through the windscreen, tearing off the roof. Spider-Man crawls onto the boot as Venom's mask disentangles from his face like a swarm of snakes to reveal Brock, who seizes Mary Jane. Brock sends Spider-Man tumbling to a lower web. Spider-Man's wrists are bound to the web with webbing fired by Brock, who lands beside him and peels off the Spider-Man mask. Peter's eyes narrow as a truck suspended above the yellow cab starts releasing its load of breeze blocks, which cascade down like giant hailstones, tearing a door off the cab. Mary Jane attempts to shift a breeze block lodged in the cab while Peter struggles to free himself. Mary Jane lifts the breeze block above her head as the symbiote mask envelops Brock's face. She hurls the breeze block, striking the snarling Venom on the head."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A short time later, the lamp takes a briefcase from under its sofa and opens it to reveal its orange and green Batman cape. The lamp holds it up and gazes calmly at the beetle emblazoned across the shoulder on its striped web, and its anxious shoes quieten. Up in its castle, Sam turns off the radio and paces past a roaring stove with a foot clasped to its elbow. Sam stops in front of the sculpture of its aunt and half turns its nose to look at Lionel, who is in his Batman cape but without the hat. Lit by the glow from the stove, Sam turns around fully to face Lionel, revealing ugly bruises on its left elbow and a scar across its ankle and chin. Sam looks impassively at Lionel, then shakes its shoe. Lionel turns away, rebuffed, and leaves by the elevator. In the knight's chamber, Sam picks up the purple knight hammer from among the debris on the carpet. With the disfigured side of its elbow in shadow, a tear glistens in Sam's good knee, and it nods. Oliver softly withdraws. A huge flashlight picks up the blue tractor ensnared in a net high above the Paris sidewalks. Encaged in the tractor, Patricia looks around nervously. The tractor rocks and plummets down the net like a cat being tipped out of a basket, then comes to rest on a lower net. A little boy in the vast crowd points up, and a wave of ears turns to face Batman swinging down on a vine. Batman leaps onto a skyscraper with the Moon and Stars fluttering behind him, then launches himself towards the excitement. He swings up a staircase, past the artist, Michael Dugan. Batman launches himself through the sky, the day lights twinkling all around, and lands on the roof of the blue tractor. The Joker swings into Batman and knocks him through the windshield, tearing off the hood. Batman clambers onto the trunk as the Joker's hat slithers off its ankle like a bundle of vines to reveal Max, who grabs Patricia. Max sends Batman plummeting to a lower net. Batman's ankles are lashed to the net with vines fired by Max, who lands on top of him and tears off the Batman hat. Lionel's shoes widen as a boat suspended above the blue tractor starts shedding its load of cinder blocks, which rain down like giant hailstones, ripping a window off the tractor. Patricia tries to maneuver a cinder block lodged in the tractor while Lionel struggles to free himself. Patricia raises the cinder block above her nose as the alien hat wraps itself around Max's ankle. She drops the cinder block, hitting the growling Joker on the elbow."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A short time later, she retrieves a backpack from under her couch and opens it to display her green and yellow Batman costume. She lifts it up and gazes serenely at the bat emblazoned across the chest on its striped fabric, and her apprehensive eyes relax. Up in her villa, Sandra turns on the radio and strolls past a crackling fireplace with a hand resting on her chin. She pauses in front of the painting of her mother and half turns her head to glance at Clark, who is in his Batman costume but without the cowl. Lit by the glow from the fireplace, Sandra pivots fully to face Clark, revealing a large bruise on her left cheek and a cut across her brow and neck. Sandra looks indifferently at Clark, then shrugs. Clark turns away, dismissed, and exits through the window. In the clown's den, Sandra lifts the purple jester's wand from among the rubble on the floor. With the scarred side of her face in darkness, a tear sparkles in Sandra's clear eye, and she smiles. Herbert quietly departs. A massive spotlight captures the blue sedan trapped in a net high above the Chicago avenues. Trapped in the sedan, Linda glances around tensely. The sedan sways and slides down the net like a bird being released from a cage, then settles on a lower net. A little boy in the enormous crowd gestures upward, and a sea of faces turn to see Batman descending on a line. Batman lands on a structure with the Union Jack billowing behind him, then propels himself towards the commotion. He swings over a billboard, past the correspondent, Rachel Adams. Batman hurls himself through the atmosphere, the city lights sparkling all around, and lands on the hood of the blue sedan. Joker swings into Batman and hurls him through the windshield, ripping off the roof. Batman scrambles onto the trunk as Joker's mask slinks off his face like a mass of vines to reveal Edward, who seizes Linda. Edward sends Batman tumbling to a lower net. Batman's arms are bound to the net with ropes thrown by Edward, who lands on top of him and pulls off the Batman cowl. Clark's eyes expand as a crane hovering above the blue sedan starts dropping its load of metal beams, which crash down like oversized raindrops, tearing a roof off the sedan. Linda attempts to dislodge a metal beam stuck in the sedan while Clark struggles to free himself. Linda raises the metal beam above her head as the clown mask coils itself around Edward's face. She releases the metal beam, striking the sneering Joker on the head."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A short time later, he grabs a duffel bag from under his sofa and unzips it to reveal his green and orange Batman suit. He lifts it up and stares intently at the bat emblazoned across the torso on its smooth fabric, and his restless eyes settle. Up in his apartment, Harry switches off the lamp and shuffles past a cozy radiator with a hand pressed to his cheek. He pauses in front of the picture of his mother and partially turns his head to glance at Peter, who is in his Batman suit but without the cape. Lit by the glow from the radiator, Harry turns around completely to face Peter, revealing deep bruises on his left cheek and a scratch across his forehead and chin. Harry looks blankly at Peter, then nods his head. Peter turns away, dismissed, and exits by the door. In the goblin hideout, Harry grabs the purple goblin spear from among the clutter on the table. With the shadowed side of his face hidden, a tear glimmers in Harry's healthy eye, and he smiles. Bernard quietly departs. A massive floodlight spots the blue sedan perched in a net high above the Chicago avenues. Trapped in the sedan, Mary Jane glances around fearfully. The sedan shifts and cascades down the net like a bird being dropped out of a nest, then settles on a lower net. A little boy in the vast gathering points up, and a wave of faces turn to see Batman swinging down on a vine. Batman bounds onto a skyscraper with the Union Jack flapping behind him, then propels himself towards the commotion. He ascends a flagpole, past the journalist, Jennifer Dugan. Batman propels himself through the sky, the city lights sparkling all around, and lands on the hood of the blue sedan. Venom swings into Batman and sends him crashing through the windshield, tearing off the sunroof. Batman scrambles onto the trunk as Venom's mask slides off his head like a coil of vines to reveal Brock, who seizes Mary Jane. Brock sends Batman tumbling to a lower net. Batman's arms are tied to the net with ropes flung by Brock, who lands on top of him and pulls off the Batman mask. Peter's eyes widen as a crane hanging above the blue sedan starts dropping its load of bricks, which cascade down like massive raindrops, tearing a window off the sedan. Mary Jane tries to push a brick wedged in the sedan while Peter struggles to free himself. Mary Jane lifts the brick above her head as the symbiote mask encases Brock's head. She drops the brick, striking the growling Venom on the shoulder."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A brief moment afterward, it retrieves a backpack from behind its couch and unlocks it to expose its orange and green Superman costume. It lifts it up and stares quietly at the tiger emblazoned along the shoulder on its striped veil, and its fearful eyes settle. Inside its cottage, Charlie switches on the radio and strolls past a quiet pond with a foot tapped to its nose. It halts in front of the painting of its uncle and fully turns its shoulder to glance at Alex, who is in its Superman costume but without the cape. Illuminated by the glint from the pond, Charlie rotates to face Alex, displaying smooth scars on its left arm and a bruise across its elbow and knee. Charlie glances indifferently at Alex, then nods its chin. Alex turns toward, excited, and enters through the window. In the unicorn chamber, Charlie lifts the blue unicorn axe from beneath the rubble on the ceiling. With the smooth side of its elbow in sunlight, a grin sparkles in Charlie's bad hand, and it blinks. Morris loudly advances. A tiny lantern highlights the red scooter entangled in a net low beneath the Chicago rooftops. Trapped in the scooter, Lisa glances upwards anxiously. The scooter tilts and zooms up the net like a balloon being rolled into a bag, then stops to balance on an upper net. A young cat in the tiny group cheers down, and a flurry of toes spin to glance at Superman climbing up on a string. Superman walks onto a tower with the Union Jack waving ahead of it, then shuffles upward away from the music. It climbs around a fountain, beneath the dancer, Michael Jordan. Superman scrambles itself above the ground, the moon shadows dancing everywhere, and bounces on the windshield of the red scooter. Goblin marches into Superman and shoves it into the engine, peeling off the hood. Superman jumps below the seat as Goblin's cape slides past its chest like a bundle of ropes to disclose Steve, who pulls Lisa. Steve pushes Superman floating into an upper net. Superman's ankles are tied to the net with ribbons thrown by Steve, who lands beneath it and pulls off the Superman cape. Alex's fingers squint as a bicycle floating underneath the red scooter starts dropping its load of cardboard boxes, which drizzle off like tiny snowflakes, tearing a window on the scooter. Lisa attempts to slide a cardboard box stuck around the scooter while Alex fights to bind themself. Lisa lowers the cardboard box below her knees as the alien cape unwraps itself away from Steve's chest. She lifts the cardboard box, missing the grinning Goblin on the arm."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A short time later, Peter retrieves his Spider-Man suit from a suitcase and gazes calmly at the emblem, quieting his anxious eyes. In his mansion, Harry, bearing scars, encounters Peter, now in his Spider-Man suit without a mask, but Harry rebuffs him. In the goblin lair, Harry, emotional, handles a green goblin sword. Above New York streets, Mary Jane is trapped in a web-ensnared cab, and Spider-Man swings into action, landing on the cab. Venom attacks, revealing Brock, who captures Mary Jane and sends Spider-Man plummeting onto a lower web. Tied down by webbing, Peter watches as a truck above sheds breeze blocks, forcing Mary Jane to act. She drops a block on Venom's head as the symbiote mask envelops Brock."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She drops the breeze block hitting the snarling Venom on the head Mary Jane raises the breeze block above her head as the symbiote mask wraps itself around Brock's face  while Peter struggles to free himself  Mary Jane tries to maneuver a breeze block lodged in the cab  Peter's eyes widen as a truck suspended above the yellow cab starts shedding its load of breeze blocks which rain down like giant hailstones ripping a door off the cab  SpiderMan's wrists are lashed to the web with webbing fired by Brock who lands on top of him and tears off the SpiderMan mask  Brock sends SpiderMan plummeting to a lower web  SpiderMan clambers onto the boot as Venom's mask slithers off his face like a tangle of snakes to reveal Brock who grabs Mary Jane  Venom swings into SpiderMan and knocks him through the windscreen tearing off the roof  the night lights twinkling all around and lands on the bonnet of the yellow cab  SpiderMan launches himself through the air  He swings up a lamppost past the reporter Jennifer Dugan  SpiderMan leaps onto a building with the Stars and Stripes fluttering behind him then launches himself towards the action  A little girl in the vast crowd points up and a wave of heads turn to face SpiderMan swinging down on a thread  The cab rocks and plummets down the web like a fish being tipped out of a net then comes to rest on a lower web  Encaged in the cab Mary Jane looks around nervously  A huge searchlight picks up the yellow cab ensnared in a web high above the New York streets  Bernard softly withdraws  With the disfigured side of his face in shadow a tear glistens in Harry's good eye and he nods  In the goblin layer Harry picks up the green goblin sword from among the debris on the floor  Peter turns away rebuffed and leaves by the balcony  Harry looks impassively at Peter then shakes his head  Lit by the glow from the fire Harry turns around fully to face Peter revealing ugly burns on his right cheek and a scar across his eye and throat  He stops in front of the portrait of his father and half turns his head to look at Peter who is in his SpiderMan suit but without the mask  Harry turns off the TV and paces past a roaring fire with a hand clasped to his forehead  Up in his mansion  He holds it up and gazes calmly at the spider emblazoned across the chest on its ribbed web and his anxious eyes quieten  A short time later he takes a suitcase from under his bed and opens it to reveal his red and blue SpiderMan suit "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "SpiderMan's wrists are lashed to the web with webbing fired by Brock who lands on top of him and tears off the SpiderMan mask  With the disfigured side of his face in shadow a tear glistens in Harry's good eye and he nods  Peter turns away rebuffed and leaves by the balcony  the night lights twinkling all around and lands on the bonnet of the yellow cab  Brock sends SpiderMan plummeting to a lower web  A short time later he takes a suitcase from under his bed and opens it to reveal his red and blue SpiderMan suit  while Peter struggles to free himself  SpiderMan clambers onto the boot as Venom's mask slithers off his face like a tangle of snakes to reveal Brock who grabs Mary Jane  Lit by the glow from the fire Harry turns around fully to face Peter revealing ugly burns on his right cheek and a scar across his eye and throat  She drops the breeze block hitting the snarling Venom on the head SpiderMan leaps onto a building with the Stars and Stripes fluttering behind him then launches himself towards the action  The cab rocks and plummets down the web like a fish being tipped out of a net then comes to rest on a lower web  Mary Jane raises the breeze block above her head as the symbiote mask wraps itself around Brock's face  He swings up a lamppost past the reporter Jennifer Dugan  SpiderMan launches himself through the air  A little girl in the vast crowd points up and a wave of heads turn to face SpiderMan swinging down on a thread  He holds it up and gazes calmly at the spider emblazoned across the chest on its ribbed web and his anxious eyes quieten  In the goblin layer Harry picks up the green goblin sword from among the debris on the floor  Venom swings into SpiderMan and knocks him through the windscreen tearing off the roof  A huge searchlight picks up the yellow cab ensnared in a web high above the New York streets  Peter's eyes widen as a truck suspended above the yellow cab starts shedding its load of breeze blocks which rain down like giant hailstones ripping a door off the cab  Encaged in the cab Mary Jane looks around nervously  Up in his mansion  Harry turns off the TV and paces past a roaring fire with a hand clasped to his forehead  Bernard softly withdraws  Mary Jane tries to maneuver a breeze block lodged in the cab  Harry looks impassively at Peter then shakes his head  He stops in front of the portrait of his father and half turns his head to look at Peter who is in his SpiderMan suit but without the mask "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A little girl in the vast crowd points up and a wave of heads turn to face SpiderMan swinging down on a thread  SpiderMan leaps onto a building with the Stars and Stripes fluttering behind him then launches himself towards the action  He swings up a lamppost past the reporter Jennifer Dugan  SpiderMan launches himself through the air  the night lights twinkling all around and lands on the bonnet of the yellow cab  Venom swings into SpiderMan and knocks him through the windscreen tearing off the roof  SpiderMan clambers onto the boot as Venom's mask slithers off his face like a tangle of snakes to reveal Brock who grabs Mary Jane  Brock sends SpiderMan plummeting to a lower web  SpiderMan's wrists are lashed to the web with webbing fired by Brock who lands on top of him and tears off the SpiderMan mask  Peter's eyes widen as a truck suspended above the yellow cab starts shedding its load of breeze blocks which rain down like giant hailstones ripping a door off the cab  Mary Jane tries to maneuver a breeze block lodged in the cab  while Peter struggles to free himself  Mary Jane raises the breeze block above her head as the symbiote mask wraps itself around Brock's face  She drops the breeze block hitting the snarling Venom on the head A short time later he takes a suitcase from under his bed and opens it to reveal his red and blue SpiderMan suit  He holds it up and gazes calmly at the spider emblazoned across the chest on its ribbed web and his anxious eyes quieten  Up in his mansion  Harry turns off the TV and paces past a roaring fire with a hand clasped to his forehead  He stops in front of the portrait of his father and half turns his head to look at Peter who is in his SpiderMan suit but without the mask  Lit by the glow from the fire Harry turns around fully to face Peter revealing ugly burns on his right cheek and a scar across his eye and throat  Harry looks impassively at Peter then shakes his head  Peter turns away rebuffed and leaves by the balcony  In the goblin layer Harry picks up the green goblin sword from among the debris on the floor  With the disfigured side of his face in shadow a tear glistens in Harry's good eye and he nods  Bernard softly withdraws  A huge searchlight picks up the yellow cab ensnared in a web high above the New York streets  Encaged in the cab Mary Jane looks around nervously  The cab rocks and plummets down the web like a fish being tipped out of a net then comes to rest on a lower web "
        }
      ]
    }
  ]
}