{
  "ground_truth": "A screen shows a scan of a human body next to a high-tech hoverboard. The door of a glass chamber slides open, and green smoke pours out as Harry, wearing just a pair of shorts, steps out, takes a deep breath, and smirks. In a dark, peaceful forest, Peter and Mary Jane lie on a huge hammock-like web on their backs, watching for shooting stars. Mary Jane shuts her eyes tightly, smiles faintly, and then they kiss tenderly. A fiery meteor plummets from the sky and crashes into the forest, but Mary Jane and Peter remain oblivious while wrapped in each other's arms. The glowing orange meteor embedded in the ground cracks open, and black tendrils like living vines spring out and stretch across the ground. Peter, smiling happily, slides down a thread of webbing with Mary Jane, unaware of the tendrils crawling up a nearby ridge like a huge black spider. Peter wraps his moped, and with Mary Jane sitting on the pillion seat, it starts to move off. The strange black substance crawls speedily up behind and attaches itself to the rear number plate as the moped rides off down the woodland track. At night, a train rumbles across a bridge in the heart of Brooklyn, and close by, a burly fair-haired man in an orange jumpsuit runs down a dark street. A police car with a search lamp mounted by the passenger window turns onto the street behind him and drives down the road at a walking pace. The man, Flint Marko, hides in the shadows and watches nervously as the squad car cruises past. Flint grabs the bottom rungs of a metal ladder mounted on a wall, holds himself up, and climbs the ladder to a fire escape outside a bedroom window. He gently opens the window and climbs into the dark bedroom, where he looks down at a little girl of about 10 years old asleep in bed with a tube connected to her nose. Flint sits on the window sill, gazes at her intently, reaches into his jumpsuit, and takes out a handful of letters addressed to Penny Marko, which he gently slides underneath Penny's pillow. He pulls open a drawer, takes out a green-and-black-striped T-shirt, and in the dark kitchen, he breaks some bread in half. He turns sharply as the light comes on and looks at a blond woman in her 40s with her arms folded, wearing a disenchanted expression. They both turn to the door as Penny, who's overheard, comes in. Flint walks over to her, kneels down in front of her, and gently takes her arm.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A display exhibits a scan of a human form beside a high-tech levitating board. The portal of a transparent enclosure glides open, and green vapor spills out as Harry, clad in merely a pair of trunks, emerges, inhales deeply, and grins. In a dim, tranquil woodland, Peter and Mary Jane recline on a massive hammock-like web on their backs, observing for falling stars. Mary Jane closes her eyes firmly, grins slightly, and then they kiss softly. A blazing comet hurtles from the heavens and smashes into the forest, but Mary Jane and Peter remain unaware while embraced in each other's arms. The glowing orange comet embedded in the earth fractures open, and black filaments like lively vines leap out and extend across the terrain. Peter, smiling joyfully, descends a strand of webbing with Mary Jane, oblivious to the filaments creeping up a nearby slope like a gigantic black arachnid. Peter wraps his scooter, and with Mary Jane sitting on the rearward seat, it starts to move away. The peculiar black material crawls swiftly up behind and fastens itself to the back identification plate as the scooter travels down the forest path. At night, a locomotive rumbles across a viaduct in the core of Brooklyn, and nearby, a sturdy blond man in an orange coverall sprints down a dark avenue. A squad vehicle with a search beacon mounted by the passenger window turns onto the avenue behind him and proceeds down the road at a strolling pace. The man, Flint Marko, conceals himself in the shadows and observes anxiously as the patrol car rolls past. Flint seizes the bottom rungs of a metallic ladder mounted on a partition, hoists himself up, and ascends the ladder to a fire escape outside a bedroom casement. He carefully opens the casement and climbs into the dim sleeping area, where he looks down at a little girl of about 10 years dormant in bed with a tube linked to her nostrils. Flint sits on the window ledge, gazes at her fixedly, reaches into his coverall, and retrieves a handful of correspondence addressed to Penny Marko, which he gently slides beneath Penny's cushion. He pulls open a drawer, takes out a green-and-black-striped shirt, and in the dim cooking area, he breaks some bread in two. He turns abruptly as the light comes on and looks at a blond woman in her 40s with her arms crossed, wearing a disenchanted look. They both turn to the portal as Penny, who's overheard, enters. Flint walks over to her, kneels down in front of her, and gently takes her limb."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A scan of a human body is shown on a screen next to a high-tech hoverboard. The door of a glass chamber is slid open by someone, and green smoke is poured out as Harry, wearing just a pair of shorts, is stepping out, breathing deeply, and smirking. In a dark, peaceful forest, a huge hammock-like web is lied on by Peter and Mary Jane on their backs, who watch for shooting stars. Mary Jane's eyes are shut tightly by her, a faint smile appears, and then they kiss tenderly. A fiery meteor is plummeted from the sky and is crashed into the forest, but Mary Jane and Peter remain oblivious while they wrap themselves in each other's arms. The glowing orange meteor embedded in the ground is cracked open, and black tendrils like living vines spring out and stretch across the ground. Peter is smiling happily, sliding down a thread of webbing with Mary Jane, unaware of the tendrils crawling up a nearby ridge like a huge black spider. Peter's moped is wrapped by him, and with Mary Jane sitting on the pillion seat, they start to move off. The strange black substance is crawled speedily up behind and attached itself to the rear number plate as the moped is ridden off down the woodland track. At night, a train is rumbled across a bridge in the heart of Brooklyn, and close by, a burly fair-haired man in an orange jumpsuit is run down a dark street by him. A police car with a search lamp mounted by the passenger window is turned onto the street behind him and is driven down the road at a walking pace by it. The man, Flint Marko, hides in the shadows and watches nervously as the squad car is cruised past. Flint grabs the bottom rungs of a metal ladder mounted on a wall, holds himself up, and climbs the ladder to a fire escape outside a bedroom window. The window is gently opened by him and climbed into the dark bedroom, where he looks down at a little girl of about 10 years old asleep in bed with a tube connected to her nose. Flint sits on the window sill, gazes at her intently, reaches into his jumpsuit, and takes out a handful of letters addressed to Penny Marko, which are gently slid underneath Penny's pillow by him. A drawer is pulled open by him, a green-and-black-striped T-shirt is taken out, and in the dark kitchen, some bread is broken in half by him. He turns sharply as the light is turned on and looks at a blond woman in her 40s with her arms folded, wearing a disenchanted expression. The door is turned to by both of them as Penny, who's overheard, comes in. Flint walks over to her, kneels down in front of her, and gently takes her arm."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A screen displays a body scan beside a high-tech hoverboard. A glass chamber door opens, releasing green smoke as Harry steps out in shorts, breathes deeply, and smirks. In a dark, tranquil forest, Peter and Mary Jane lie on a large web, watching for shooting stars. Mary Jane closes her eyes, smiles, and they kiss. A fiery meteor crashes nearby, unnoticed by the couple. The meteor cracks, releasing black tendrils across the ground. Smiling, Peter slides down webbing with Mary Jane, unaware of tendrils creeping nearby. On his moped with Mary Jane, the black substance attaches to the rear plate as they ride down the track. At night, a train crosses a Brooklyn bridge; nearby, Flint Marko in an orange jumpsuit runs down a street. A police car follows slowly, and Flint hides, watching nervously. He climbs a ladder to a fire escape, enters a dark bedroom, and sees a sleeping girl with a nasal tube. Flint sits on the window sill, takes out letters addressed to Penny Marko, and slides them under her pillow. In a dark kitchen, he breaks bread but freezes when a light reveals a disenchanted woman. They turn to see Penny enter. Flint approaches her and gently takes her arm."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A screen displays a body scan beside a hoverboard. The glass chamber door slides open, releasing green smoke as Harry, in shorts, emerges, takes a deep breath, and smirks. In a dark forest, Peter and Mary Jane lie on a web watching for shooting stars. Mary Jane closes her eyes, smiles, and they kiss. A meteor crashes, but they remain unaware. As black tendrils emerge from the meteor, Peter and Mary Jane slide down the web, oblivious to the tendrils nearby. Peter starts his moped with Mary Jane seated behind. Black tendrils attach to the moped's number plate as they depart. At night, a train crosses a Brooklyn bridge, while a man in an orange jumpsuit runs down a street. A police car follows him. Flint Marko hides, climbs a fire escape, and enters a bedroom where a girl sleeps with a tube. He slides letters beneath her pillow, retrieves a T-shirt, and breaks bread in the dark kitchen. A woman turns on the light, looking disenchanted. They both turn as Penny enters. Flint approaches and gently takes her arm."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A screen prominently displays a detailed scan of a human body, positioned right next to an advanced, high-tech hoverboard. With a quiet hum, the door of a sleek glass chamber smoothly slides open, and an ominous green smoke billows out as Harry, clad only in a pair of shorts, steps forward. He takes in a deep, refreshing breath and flashes a knowing smirk. In the midst of a dark, serene forest, Peter and Mary Jane find themselves lying comfortably on a massive hammock-like web, staring up at the sky, eagerly watching for shooting stars. Mary Jane softly shuts her eyes, a faint smile playing on her lips, and the two share a tender, heartfelt kiss. Suddenly, a fiery meteor comes crashing down from the sky, colliding with the forest, yet Mary Jane and Peter remain blissfully unaware, wrapped tightly in each other's embrace. The glowing orange meteor, now embedded in the ground, begins to crack open, releasing black tendrils that resemble living vines, which swiftly extend and stretch across the forest floor. Unaware of the impending danger, Peter, still smiling with happiness, slides down a thread of webbing alongside Mary Jane. The two remain oblivious to the dark tendrils creeping up a nearby ridge, resembling a massive black spider. Peter affectionately secures his moped, and with Mary Jane comfortably perched on the pillion seat, the vehicle begins to move forward. The unusual black substance rapidly climbs up from behind and discreetly attaches itself to the moped's rear number plate as they ride off along the woodland track. Meanwhile, as night falls, a train rumbles and roars its way across a bridge nestled in the heart of Brooklyn. Nearby, a burly, fair-haired man clad in an orange jumpsuit dashes down a dimly lit street. A police car, equipped with a search lamp mounted by the passenger window, turns onto the street behind him, proceeding down the road at a deliberate, walking pace. The man, Flint Marko, takes cover in the shadows, watching nervously as the squad car steadily cruises past. With determination, Flint grabs the bottom rungs of a metal ladder affixed to a wall, hoisting himself up, and briskly climbs to a fire escape outside a dimly lit bedroom window. He gently eases the window open and climbs into the dark room, where he gazes tenderly at a little girl, around 10 years old, sleeping peacefully in bed with a tube connected to her nose. Flint settles on the window sill, eyes fixed intently on her face, and reaches into his jumpsuit, producing a handful of letters addressed to Penny Marko. He carefully slides them underneath Penny's pillow. He then opens a drawer, extracting a green-and-black-striped T-shirt, and in the dim light of the kitchen, tears a loaf of bread in half. He spins around abruptly as the light flicks on, revealing a blond woman in her 40s with arms folded, wearing an expression of discontent. Both turn their attention to the door as Penny, having overheard their exchange, enters the room. Flint walks over to her, kneels gently in front of her, and tenderly takes hold of her arm."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A large screen sits in a prominent position, vividly displaying a comprehensive and detailed scan of a human body. This intricate image is notably situated right next to an advanced and sophisticated high-tech hoverboard. With a gentle and quiet hum, the door of a sleek and elegantly designed glass chamber smoothly and effortlessly slides open. An ominous green smoke billows out, creating an eerie atmosphere, as Harry, clad in nothing but a simple pair of shorts, confidently steps forward. He inhales a deep, refreshing breath of air and flashes a knowing smirk that suggests his awareness and confidence. \n\nIn the heart of a dark, serene forest, Peter and Mary Jane find themselves lying comfortably nestled in a massive hammock-like web. They are gazing upward, staring at the vast expanse of sky, eagerly anticipating the sight of shooting stars. Mary Jane softly closes her eyes, with a faint and gentle smile playing on her lips, as the two share a tender and heartfelt kiss. Suddenly, a fiery meteor comes hurtling down from the sky, crashing into the forest with a powerful impact. Yet, wrapped tightly in each other’s embrace, Mary Jane and Peter remain blissfully unaware of the unfolding phenomenon. The glowing orange meteor, now embedded firmly in the ground, begins to crack open, releasing black tendrils that uncannily resemble living vines. These tendrils swiftly extend and stretch out across the forest floor, spreading with alarming speed. \n\nUnaware of the danger encroaching upon them, Peter, with a smile of happiness still on his face, slides down a thread of webbing, side by side with Mary Jane. The two are completely oblivious to the dark tendrils that creep up a nearby ridge, taking the form of a massive black spider. Peter affectionately secures his moped, and with Mary Jane comfortably perched on the pillion seat behind him, the vehicle starts to move forward. The unusual black substance, lurking in the background, rapidly climbs up from behind and discreetly attaches itself to the moped’s rear number plate just as they ride off along the woodland track.\n\nMeanwhile, as night descends, a train makes its way across a bridge nestled in the bustling heart of Brooklyn, rumbling and roaring as it goes. Nearby, a burly and fair-haired man, dressed in an orange jumpsuit, makes a dash down a dimly lit street. A police car, equipped with a search lamp mounted near the passenger window, turns onto the street behind him, proceeding down the road at a slow and deliberate walking pace. The man, Flint Marko, takes cover in the comforting shadows, watching nervously as the squad car steadily cruises past him. With determination fueling his actions, Flint grabs hold of the bottom rungs of a metal ladder securely affixed to a wall, hoisting himself up and briskly climbing to a fire escape located outside a dimly lit bedroom window. He gently and cautiously eases the window open, climbing into the dark room, where he gazes tenderly at a little girl, around 10 years old, sleeping peacefully in bed with a tube connected to her nose.\n\nFlint settles on the window sill, his eyes fixed intently and lovingly on her face, and reaches into his jumpsuit, producing a handful of letters addressed with care to Penny Marko. He carefully and thoughtfully slides them underneath Penny's pillow. Opening a drawer, he extracts a green-and-black-striped T-shirt, and in the dim light of the kitchen, tears a loaf of bread in half. Abruptly, he spins around as the light flicks on, revealing a blonde woman in her 40s, with arms folded and wearing an expression of discontent on her face. Both of their attentions are drawn to the door as Penny, having overheard their exchange, enters the room. Flint walks over to her, kneels gently in front of her, and tenderly takes hold of her arm in a gesture of affection and care."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "On the screen, a detailed scan of a human body appears side by side with a high-tech hoverboard, drawing attention to both intricate images. As the door of a sleek glass chamber starts to slide open with a smooth motion, a thick plume of green smoke billows out, creating a mystical atmosphere. Emerging from the chamber, Harry, clad in only a pair of shorts, steps forward into the open air, feeling the coolness on his skin. He pauses to take a long, deep breath, savoring the fresh air, and then allows a subtle, confident smirk to spread across his face. Meanwhile, in a dark but serene forest, Peter and Mary Jane are lying comfortably on their backs atop a gigantic hammock-like spider web. Their eyes are focused skyward as they patiently wait and watch for shooting stars to streak across the night sky. Mary Jane slowly shuts her eyes, a faint smile playing on her lips, as she basks in the peaceful moment. Gradually, she turns toward Peter, and they share a tender kiss, lost in each other’s presence. While they remain wrapped in each other’s arms, oblivious to the world around them, a fiery meteor arcs dramatically across the sky, hurtling down with increasing speed until it crashes into the forest with a resounding impact. The meteor, glowing a vibrant orange and embedded into the ground, splits open, releasing black tendrils that spring forth like animated vines, stretching and snaking across the forest floor. Peter, still smiling happily and unaware of the unfolding events, effortlessly slides down a thread of webbing with Mary Jane, both enjoying their playful descent. Completely unknowing, the dark tendrils creep up a nearby ridge, forming the silhouette of a massive black spider. Once at the bottom, Peter proceeds to wrap his moped, expertly preparing it for travel. Mary Jane sits comfortably on the pillion seat as the moped starts to move forward along the woodland track. As they ride off, the peculiar black substance slithers rapidly behind them, latching onto the rear number plate of the moped, binding itself unnoticed as they journey away. Later, as night falls, a train rumbles and clatters over a bridge situated in the heart of Brooklyn, creating a backdrop of urban sound. Nearby, a burly, fair-haired man clad in an orange jumpsuit sprints down a dimly lit street, his heavy footfalls echoing against the pavement. A police car, with its search lamp affixed beside the passenger window, turns onto the same street, its slow crawl at walking pace contrasting with the man's hurried escape. Sensing the impending threat, the man, identified as Flint Marko, ducks into the shadows and watches intently with growing anxiety as the squad car slowly cruises past him without noticing. Taking advantage of the moment, Flint makes a swift move towards a metal ladder mounted on a nearby wall. He grips the cool metal rungs firmly, hoisting himself up with determined effort, and ascends the ladder leading to a fire escape outside a bedroom window. Once at the top, he carefully opens the window, mindful of noise, and climbs into the darkened bedroom. There, his gaze falls upon a little girl, no older than ten, peacefully asleep in her bed, with a tube gently connected to her nose. Sitting quietly on the window sill, Flint regards her with deep emotion before reaching into his jumpsuit to retrieve a handful of letters. Each one is addressed to Penny Marko, and Flint tenderly slides them beneath her pillow, taking care not to disturb her slumber. Next, he moves to open a nearby drawer, retrieving a green-and-black-striped T-shirt, a cherished item. In the adjoining dark kitchen, he breaks a piece of bread in half, an act of necessity, when suddenly the room floods with light. He quickly turns, startled, to find himself facing a blond woman in her 40s, her arms crossed and expression filled with disenchantment. Their attention is then drawn toward the door as Penny, now awake and having overhead the commotion, enters the room. Flint approaches her slowly, kneeling down to her level in an effort to connect with her. With gentleness, he reaches out and takes her arm, hoping to convey comfort and acknowledgment through their shared touch."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A screen displays a scan of a human body beside a high-tech hoverboard. As the glass chamber's door slides open, green smoke spills out, and Harry, clad only in shorts, emerges, takes a deep breath, and smirks. In a tranquil forest, Peter and Mary Jane lie on a massive hammock-like web, gazing at the stars. Mary Jane briefly closes her eyes and smiles, leading to a tender kiss between them. Meanwhile, a fiery meteor crashes nearby, unnoticed by the couple. The meteor cracks open, releasing black tendrils that spread across the forest floor. Unaware, Peter slides down a web thread with Mary Jane, as tendrils creep up a ridge like a giant spider. They ride off on Peter's moped, with Mary Jane seated behind, as the tendrils attach to the moped's rear plate. Elsewhere, a train crosses a Brooklyn bridge, and nearby, Flint Marko, in an orange jumpsuit, runs down a dark street. A police car trails him at a slow pace, prompting Flint to hide until it passes. He climbs a metal ladder to a fire escape, enters through a bedroom window, and gazes at a sleeping girl, Penny Marko, before sliding letters under her pillow. He retrieves a striped T-shirt and breaks bread in the kitchen, turning abruptly as the light reveals a disenchanted woman. They both react as Penny enters, and Flint kneels to gently take her arm."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A screen displays a scan of a human body next to a high-tech hoverboard, a recent innovation in personal transportation that defies gravity using magnetic technology. The door of a glass chamber, reminiscent of futuristic cryogenic capsules, slides open, and green smoke, often used in sci-fi settings to signify sterilization or atmospheric purification, pours out as Harry, wearing just a pair of shorts, steps out, takes a deep breath, and smirks with satisfaction at the successful experiment. In a dark, peaceful forest in the heart of the Catskills, Peter and Mary Jane lie on a huge hammock-like web on their backs, watching for shooting stars, an activity often associated with making wishes. Mary Jane shuts her eyes tightly, smiles faintly with a sense of serenity, and then they kiss tenderly. A fiery meteor, traveling at speeds that create friction-induced heat, plummets from the sky and crashes into the forest, but Mary Jane and Peter remain oblivious while wrapped in each other's arms. The glowing orange meteor, likely a fragment from an asteroid belt, embedded in the ground cracks open, and black tendrils like alien living vines spring out and stretch across the ground. Peter, smiling happily in his moment of bliss, slides down a thread of webbing with Mary Jane, unaware of the tendrils crawling up a nearby ridge like a huge black spider. Peter wraps his moped, a vintage Vespa known for its distinctive design, and with Mary Jane sitting on the pillion seat, it starts to move off. The strange black substance, resembling symbiotic alien lifeforms, crawls speedily up behind and attaches itself to the rear number plate as the moped rides off down the woodland track. At night, a train rumbles across the historic Brooklyn Bridge, an iconic symbol of New York City, and close by, a burly fair-haired man in an orange jumpsuit runs down a dark street. A police car with a search lamp mounted by the passenger window, a feature often seen in pursuit scenarios, turns onto the street behind him and drives down the road at a walking pace. The man, Flint Marko, a known fugitive with a troubled past, hides in the shadows and watches nervously as the squad car cruises past. Flint grabs the bottom rungs of a metal ladder mounted on a wall, holds himself up, and climbs the ladder to a fire escape outside a bedroom window. This fire escape, a common architectural feature in New York City, provides him access to the room where he gently opens the window and climbs into the dark bedroom, where he looks down at a little girl of about 10 years old asleep in bed with a tube connected to her nose, an indication of her fragile health. Flint sits on the window sill, gazes at her intently, reaches into his jumpsuit, and takes out a handful of letters addressed to Penny Marko, which he gently slides underneath Penny's pillow. These letters, heartfelt messages often expressing love and regret, are a token of his unspoken affection. He pulls open a drawer, takes out a green-and-black-striped T-shirt, a pattern often associated with criminal attire in popular culture, and in the dark kitchen, he breaks some bread in half, a simple meal reflecting his precarious financial situation. He turns sharply as the light comes on and looks at a blond woman in her 40s with her arms folded, wearing a disenchanted expression, a reflection of their strained relationship. They both turn to the door as Penny, who's overheard, comes in. Flint walks over to her, kneels down in front of her, and gently takes her arm, a gesture filled with unspoken promises and enduring love."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He pulls open a drawer takes out a greenandblackstriped Tshirt and in the dark kitchen he breaks some bread in half A screen shows a scan of a human body next to a hightech hoverboard In a dark peaceful forest Peter and Mary Jane lie on a huge hammocklike web on their backs watching for shooting stars Peter wraps his moped and with Mary Jane sitting on the pillion seat it starts to move off The door of a glass chamber slides open and green smoke pours out as Harry wearing just a pair of shorts steps out takes a deep breath and smirks Mary Jane shuts her eyes tightly smiles faintly and then they kiss tenderly The man Flint Marko hides in the shadows and watches nervously as the squad car cruises past The door of a glass chamber slides open and green smoke pours out as Harry wearing just a pair of shorts steps out takes a deep breath and smirks In a dark peaceful forest Peter and Mary Jane lie on a huge hammocklike web on their backs watching for shooting stars Mary Jane shuts her eyes tightly smiles faintly and then they kiss tenderly A fiery meteor plummets from the sky and crashes into the forest but Mary Jane and Peter remain oblivious while wrapped in each other's arms The glowing orange meteor embedded in the ground cracks open and black tendrils like living vines spring out and stretch across the ground Peter smiling happily slides down a thread of webbing with Mary Jane unaware of the tendrils crawling up a nearby ridge like a huge black spider Peter wraps his moped and with Mary Jane sitting on the pillion seat it starts to move off The strange black substance crawls speedily up behind and attaches itself to the rear number plate as the moped rides off down the woodland track At night a train rumbles across a bridge in the heart of Brooklyn and close by a burly fairhaired man in an orange jumpsuit runs down a dark street A police car with a search lamp mounted by the passenger window turns onto the street behind him and drives down the road at a walking pace A police car with a search lamp mounted by the passenger window turns onto the street behind him and drives down the road at a walking pace The man Flint Marko hides in the shadows and watches nervously as the squad car cruises past He turns sharply as the light comes on and looks at a blond woman in her 40s with her arms folded wearing a disenchanted expression The strange black substance crawls speedily up behind and attaches itself to the rear number plate as the moped rides off down the woodland track Flint grabs the bottom rungs of a metal ladder mounted on a wall holds himself up and climbs the ladder to a fire escape outside a bedroom window He gently opens the window and climbs into the dark bedroom where he looks down at a little girl of about 10 years old asleep in bed with a tube connected to her nose Flint sits on the window sill gazes at her intently reaches into his jumpsuit and takes out a handful of letters addressed to Penny Marko which he gently slides underneath Penny's pillow He pulls open a drawer takes out a greenandblackstriped Tshirt and in the dark kitchen he breaks some bread in half A screen shows a scan of a human body next to a hightech hoverboard He turns sharply as the light comes on and looks at a blond woman in her 40s with her arms folded wearing a disenchanted expression They both turn to the door as Penny who is overheard comes in Flint walks over to her kneels down in front of her and gently takes her arm"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A screen shows a scan of a human body next to a hightech hoverboard. The door of a glass chamber slides open and green smoke pours out as Harry wearing just a pair of shorts steps out takes a deep breath and smirks. In a dark peaceful forest Peter and Mary Jane lie on a huge hammocklike web on their backs watching for shooting stars. Mary Jane shuts her eyes tightly smiles faintly and then they kiss tenderly. A fiery meteor plummets from the sky and crashes into the forest but Mary Jane and Peter remain oblivious while wrapped in each other's arms. The glowing orange meteor embedded in the ground cracks open and black tendrils like living vines spring out and stretch across the ground. Peter smiling happily slides down a thread of webbing with Mary Jane unaware of the tendrils crawling up a nearby ridge like a huge black spider. Peter wraps his moped and with Mary Jane sitting on the pillion seat it starts to move off. The strange black substance crawls speedily up behind and attaches itself to the rear number plate as the moped rides off down the woodland track. At night a train rumbles across a bridge in the heart of Brooklyn and close by a burly fairhaired man in an orange jumpsuit runs down a dark street. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. A police car with a search lamp mounted by the passenger window turns onto the street behind him and drives down the road at a walking pace. The man Flint Marko hides in the shadows and watches nervously as the squad car cruises past. Flint grabs the bottom rungs of a metal ladder mounted on a wall holds himself up and climbs the ladder to a fire escape outside a bedroom window. He gently opens the window and climbs into the dark bedroom where he looks down at a little girl of about 10 years old asleep in bed with a tube connected to her nose. Flint sits on the window. sill gazes at her intently reaches into his jumpsuit and takes out a handful of letters addressed to Penny Marko which he gently slides underneath Penny's pillow. He pulls open a drawer takes out a greenandblackstriped Tshirt and in the dark kitchen he breaks some bread in half. He turns sharply as the light comes on and looks at a blond woman in her 40s with her arms folded wearing a disenchanted expression. They both turn to the door as Penny who is overheard comes in. Flint walks over to her kneels down in front of her and gently takes her arm."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A screen shows a scan of a human body next to a hightech hoverboard. The door of a glass chamber slides open and green smoke pours out as Harry wearing just a pair of shorts steps out takes a deep breath and smirks. In a dark peaceful forest Peter and Mary Jane lie on a huge hammocklike web on their backs watching for shooting stars. Mary Jane shuts her eyes tightly smiles faintly and then they kiss tenderly. A fiery meteor plummets from the sky and crashes into the forest but Mary Jane and Peter remain oblivious while wrapped in each other's arms. The glowing orange meteor embedded in the ground cracks open and black tendrils like living vines spring out and stretch across the ground. Peter smiling happily slides down a thread of webbing with Mary Jane unaware of the tendrils crawling up a nearby ridge like a huge black spider. Peter wraps his moped and with Mary Jane sitting on the pillion seat it starts to move off. The strange black substance crawls speedily up behind and attaches itself to the rear number plate as the moped rides off down the woodland track. At night a train rumbles across a bridge in the heart of Brooklyn and close by a burly fairhaired man in an orange jumpsuit runs down a dark street. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. A police car with a search lamp mounted by the passenger window turns onto the street behind him and drives down the road at a walking pace. The man Flint Marko hides in the shadows and watches nervously as the squad car cruises past. Flint grabs the bottom rungs of a metal ladder mounted on a wall holds himself up and climbs the ladder to a fire escape outside a bedroom window. He gently opens the window and climbs into the dark bedroom where he looks down at a little girl of about 10 years old asleep in bed with a tube connected to her nose. Flint sits on the window. sill gazes at her intently reaches into his jumpsuit and takes out a handful of letters addressed to Penny Marko which he gently slides underneath Penny's pillow. He pulls open a drawer takes out a greenandblackstriped Tshirt and in the dark kitchen he breaks some bread in half. He turns sharply as the light comes on and looks at a blond woman in her 40s with her arms folded wearing a disenchanted expression. They both turn to the door as Penny who is overheard comes in. Flint walks over to her kneels down in front of her and gently takes her arm."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A screen shows a scan of a human body next to a hightech hoverboard. The door of a glass chamber slides open and green smoke pours out as Harry wearing just a pair of shorts steps out takes a deep breath and smirks. In a dark peaceful forest Peter and Mary Jane lie on a huge hammocklike web on their backs watching for shooting stars. Mary Jane shuts her eyes tightly smiles faintly and then they kiss tenderly. A fiery meteor plummets from the sky and crashes into the forest but Mary Jane and Peter remain oblivious while wrapped in each other's arms. sill gazes at her intently reaches into his jumpsuit and takes out a handful of letters addressed to Penny Marko which he gently slides underneath Penny's pillow. He pulls open a drawer takes out a greenandblackstriped Tshirt and in the dark kitchen he breaks some bread in half. He turns sharply as the light comes on and looks at a blond woman in her 40s with her arms folded wearing a disenchanted expression. They both turn to the door as Penny who is overheard comes in. Flint walks over to her kneels down in front of her and gently takes her arm."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A screen shows a scan of a human body next to a hightech hoverboard. The door of a glass chamber slides open and green smoke pours out as Harry wearing just a pair of shorts steps out takes a deep breath and smirks. They both turn to the door as Penny who is overheard comes in. Flint walks over to her kneels down in front of her and gently takes her arm."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A screen shows a scan of a human body next to a high-tech hoverboard. The door of a glass chamber slides open, and green smoke pours out as a dog, wearing just a pair of shorts, steps out, takes a deep breath, and smirks. In a dark, peaceful forest, a cat and a bird lie on a huge hammock-like web on their backs, watching for shooting stars. The bird shuts her eyes tightly, smiles faintly, and then they kiss tenderly. A fiery meteor plummets from the sky and crashes into the forest, but the bird and the cat remain oblivious while wrapped in each other's arms. The glowing orange meteor embedded in the ground cracks open, and black tendrils like living vines spring out and stretch across the ground. The cat, smiling happily, slides down a thread of webbing with the bird, unaware of the tendrils crawling up a nearby ridge like a huge black spider. The cat wraps his moped, and with the bird sitting on the pillion seat, it starts to move off. The strange black substance crawls speedily up behind and attaches itself to the rear number plate as the moped rides off down the woodland track. At night, a train rumbles across a bridge in the heart of Brooklyn, and close by, a turtle in an orange jumpsuit runs down a dark street. A police car with a search lamp mounted by the passenger window turns onto the street behind it and drives down the road at a walking pace. The turtle, Nervous Ned, hides in the shadows and watches nervously as the squad car cruises past. Nervous Ned grabs the bottom rungs of a metal ladder mounted on a wall, holds itself up, and climbs the ladder to a fire escape outside a bedroom window. It gently opens the window and climbs into the dark bedroom, where it looks down at a little girl of about 10 years old asleep in bed with a tube connected to her nose. Nervous Ned sits on the window sill, gazes at her intently, reaches into its jumpsuit, and takes out a handful of letters addressed to Penny Marko, which it gently slides underneath Penny's pillow. It pulls open a drawer, takes out a green-and-black-striped T-shirt, and in the dark kitchen, it breaks some bread in half. It turns sharply as the light comes on and looks at a raccoon in her 40s with her arms folded, wearing a disenchanted expression. They both turn to the door as Penny, who's overheard, comes in. Nervous Ned walks over to her, kneels down in front of her, and gently takes her arm."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A screen displays a scan of a human body next to a futuristic skateboard. The door of a steel vault slides open, and blue mist pours out as Harry, wearing just a pair of trousers, steps out, takes a deep breath, and smirks. In a dark, tranquil meadow, Peter and Mary Jane lie on a massive net-like blanket on their backs, watching for shooting stars. Mary Jane shuts her eyes tightly, smiles faintly, and then they kiss tenderly. A blazing satellite plummets from the sky and crashes into the meadow, but Mary Jane and Peter remain oblivious while wrapped in each other's arms. The glowing orange satellite embedded in the ground cracks open, and black tendrils like living ropes spring out and stretch across the ground. Peter, smiling happily, slides down a string of rope with Mary Jane, unaware of the tendrils crawling up a nearby hill like a huge black beetle. Peter wraps his bicycle, and with Mary Jane sitting on the rear rack, it starts to move off. The strange black substance crawls speedily up behind and attaches itself to the rear reflector as the bicycle rides off down the garden path. At night, a bus rumbles across a bridge in the heart of Brooklyn, and close by, a burly fair-haired man in an orange jumpsuit runs down a dim alley. A delivery van with a search lamp mounted by the passenger window turns onto the alley behind him and drives down the path at a walking pace. The man, Flint Marko, hides in the shadows and watches nervously as the delivery van rolls past. Flint grabs the bottom rungs of a wooden ladder mounted on a wall, holds himself up, and climbs the ladder to a balcony outside a living room window. He gently opens the window and climbs into the dark living room, where he looks down at a little girl of about 10 years old asleep on the couch with headphones connected to her ears. Flint sits on the window sill, gazes at her intently, reaches into his jumpsuit, and takes out a handful of photographs addressed to Penny Marko, which he gently slides underneath Penny's pillow. He pulls open a drawer, takes out a red-and-blue-striped scarf, and in the dark kitchen, he breaks some crackers in half. He turns sharply as the light comes on and looks at a blond woman in her 40s with her arms folded, wearing a disenchanted expression. They both turn to the door as Penny, who's overheard, comes in. Flint walks over to her, kneels down in front of her, and gently takes her arm."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A screen displays a hologram of a human body beside a high-tech hoverboard. The door of a glass chamber swings shut, and blue mist floats out as Harry, wearing just a pair of shorts, leaps out, lets out a sigh, and winks. In a lush, serene forest, Peter and Mary Jane sit on a large hammock-like web side by side, searching for fireflies. Mary Jane closes her eyes loosely, giggles softly, and then they hug tenderly. A luminous meteor drifts from the sky and settles into the forest, but Mary Jane and Peter remain indifferent while nestled in each other's arms. The glowing orange meteor buried in the ground shatters open, and black tendrils like creeping vines cascade out and crawl across the ground. Peter, laughing joyously, swings up a thread of webbing with Mary Jane, unaware of the tendrils slithering up a nearby ridge like a massive black serpent. Peter drapes his moped, and with Mary Jane perched on the pillion seat, it begins to glide off. The strange black substance races swiftly up behind and adheres to the rear number plate as the moped glides down the woodland path. At night, a train whistles across a bridge in the heart of Brooklyn, and nearby, a burly fair-haired man in an orange jumpsuit creeps down a dark alley. A police car with a search lamp mounted by the passenger window rolls onto the street behind him and glides down the road at a jogging pace. The man, Flint Marko, shelters in the shadows and listens intently as the squad car glides past. Flint grips the side rungs of a metal ladder mounted on a wall, lifts himself up, and descends the ladder to a fire escape outside a bedroom window. He quietly closes the window and steps into the dim bedroom, where he glances at a little girl of about 10 years old resting in bed with a tube connected to her nose. Flint stands by the window sill, stares at her thoughtfully, reaches into his jumpsuit, and pulls out a handful of letters addressed to Penny Marko, which he softly places beneath Penny's pillow. He pushes open a drawer, picks out a green-and-black-striped T-shirt, and in the dim kitchen, he slices some bread in half. He freezes suddenly as the light turns off and glances at a blond woman in her 40s with her arms crossed, wearing a bemused expression. They both face the door as Penny, who's overheard, enters. Flint strolls over to her, bends down in front of her, and gently holds her hand."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A mirror displays a diagram of a feline form beside a vintage scooter. The curtain of a wooden pod swings open, and red mist flows out as Gerald, clad in a single boot, steps out, inhales deeply, and grins. In a bright, bustling city, Lucy and John are reclined on a massive velvet cushion on their stomachs, searching for passing helicopters. John closes his eyes softly, grins subtly, and then they hug warmly. A blazing comet descends from the clouds and lands in the city, but John and Lucy remain unsuspecting while embraced in each other's arms. The shimmering blue comet lodged in the pavement splits apart, and white ribbons resembling animated ropes burst out and weave across the pavement. Lucy, grinning broadly, floats down a strand of silk with John, oblivious to the ribbons slithering up a distant embankment like a gigantic white octopus. Lucy wraps her skateboard, and with John perched on the front seat, it begins to roll away. The unusual white material slithers quickly behind and fuses itself to the front bumper as the skateboard cruises down the urban path. At sunset, a ferry glides under an overpass in the center of Manhattan, and nearby, a slender dark-haired woman in a purple raincoat dashes along a dim alley. A bicycle with a lantern affixed by the driver seat turns into the alley behind her and pedals down the lane at a jogging pace. The woman, Sarah Connors, crouches in the shadows and peers anxiously as the bike rolls by. Sarah seizes the top steps of a wooden staircase attached to a fence, holds herself up, and ascends the staircase to a terrace outside a living room window. She quietly unlatches the window and climbs into the dim living room, where she gazes down at a young boy of about 6 years old slumbering on the couch with a string tied to his finger. Sarah perches on the window ledge, stares at him keenly, retrieves a bundle of notes addressed to Timmy Connors from her raincoat, and subtly tucks them beneath Timmy's blanket. She pries open a cabinet, retrieves a red-and-white-checked apron, and in the bright hallway, she snaps a carrot in two. She spins abruptly as the fan switches on and sees a brunette man in his 30s with his legs crossed, bearing a perplexed demeanor. They both glance at the window as Timmy, who's been listening, steps in. Sarah walks over to him, crouches before him, and softly clasps his hand."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A hologram displays a blueprint of a robotic arm next to a vintage gramophone. The curtain of a wooden hut swings open, and blue mist wafts out as Roger, clad in just a pair of flip-flops, stumbles out, inhales deeply, and chuckles. In a bright, bustling meadow, Sarah and John recline on a massive trampoline on their stomachs, searching for distant galaxies. Sarah opens her eyes wide, giggles softly, and then they high-five cheerfully. A radiant comet descends from the heavens and lands in the meadow, but Sarah and John stay unaware while tangled in each other's laughter. The shining blue comet lodged in the earth splits apart, and white filaments like squirming ropes burst forth and spread across the meadow. John, grinning broadly, swings down a rope ladder with Sarah, oblivious to the filaments slithering up a nearby elm like an enormous white worm. John secures his skateboard, and with Sarah perched on the front handlebar, it begins to glide forward. The odd white material snakes swiftly up behind and clings to the front wheel as the skateboard rolls off along the garden path. At twilight, a ferry chugs along a canal in the heart of Queens, and nearby, a lanky dark-haired woman in a purple tracksuit strolls down a dim alley. A taxi with a spotlight mounted on the rooftop turns into the alley behind her and rolls down the passage at a gentle speed. The woman, Lucy West, crouches in the bushes and peers calmly as the taxi glides by. Lucy grips the top rungs of a wooden scaffold propped against a shed, hoists herself up, and ascends the scaffold to a terrace outside a library window. She forcefully unlatches the window and climbs into the dim library, where she glances at a young boy of about 12 years old dozing in a chair with a book resting on his lap. Lucy perches on the window ledge, observes him softly, reaches into her tracksuit, and retrieves a stack of postcards addressed to Sam West, which she stealthily tucks behind a pot of daisies. She pulls open a cupboard, extracts a blue-and-red-striped scarf, and in the dim dining room, she slices some cheese in bulk. She spins abruptly as the flashlight beams and looks at a brunette man in his 50s with his legs crossed, wearing a puzzled gaze. They both glance at the hallway as Sam, who's been eavesdropping, enters. Lucy walks over to him, crouches beside him, and tenderly holds his hand."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A screen displays an etching of a cat silhouette next to a futuristic skateboard. The entrance of a wooden igloo swings open, and blue mist floods out as Harry, sporting only a pair of flip-flops, hops out, inhales deeply, and grins. In a bright, bustling marketplace, Peter and Mary Jane sit on a giant pillow-like mat on their feet, listening for bird songs. Mary Jane opens her eyes widely, giggles softly, and then they bump elbows affectionately. A shimmering comet ascends from the horizon and lands in the marketplace, but Mary Jane and Peter remain unaware while tangled in each other's fingers. The luminous purple comet stuck in the pavement splinters open, and silver branches like metallic wires burst out and weave across the pavement. Peter, laughing joyfully, glides up a rope of vines with Mary Jane, oblivious to the branches coiling up a nearby slope like a colossal silver serpent. Peter wraps his bicycle, and with Mary Jane perched on the basket, it starts to glide away. The unusual silver stuff zooms swiftly up behind and latches onto the front bumper as the bicycle rolls off down the stone path. By day, a ship sails beneath an arch in the heart of Manhattan, and nearby, a tall dark-haired woman in a pink dress skips up a sunny lane. A delivery truck with a siren fixed above the driver's window turns into the lane behind her and trundles up the avenue at a jogging pace. The woman, Flint Marko, crouches in the bushes and peers anxiously as the carriage rolls past. Flint grips the top rungs of a plastic fence propped on the ground, lifts herself over, and swings from the fence to a porch outside a kitchen door. She softly slides the door open and steps into the bright kitchen, where she stares at a large dog of about 10 years old asleep on a rug with a blanket tossed over its belly. Flint leans against the doorframe, gazes at it thoughtfully, reaches into her dress, and retrieves a bundle of drawings addressed to Penny Marko, which she carefully tucks behind Penny's toy chest. She uncovers a cabinet, takes out a red-and-yellow plaid apron, and in the sunlit lounge, she splits some cheese in two. She spins quickly as the window slides open and sees a brunette man in his 50s with his arms at his sides, wearing a surprised look. They both glance toward the window as Penny, who's eavesdropped, peeks inside. Flint strolls over to her, kneels beside her, and gently clasps her shoulder."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A monitor displays a sketch of a feline form beside a vintage unicycle. The lid of a wooden crate creaks ajar, and purple mist swirls out as Arnold, clad in a single boot, emerges, inhales deeply, and winks. In a sunny, bustling marketplace, Alice and Robert rest on a colossal trampoline-like net on their sides, searching for circling eagles. Robert shuts his mouth briefly, grins broadly, and then they shake hands politely. A luminous comet ascends from the ocean and lands in the marketplace, but Robert and Alice stay unaware while swaddled in each other's shadows. The radiant blue comet lodged in the street splits apart, and white filaments like writhing roots leap out and weave across the pavement. Alice, laughing softly, swings from a line of strings with Robert, oblivious to the filaments climbing up a distant tower like a massive white serpent. Alice nudges her bicycle, and with Robert perched on the luggage rack, it begins to roll away. The peculiar white material slithers swiftly forward and latches onto the rear reflector as the bicycle glides off along the park path. At dawn, a ferry glides under an archway in the center of Boston, and nearby, a lanky red-haired woman in a blue apron marches up a lit alley. A delivery van with a flagpole mounted by the driver window turns into the alley behind her and trundles up the lane at a jogging pace. The woman, Linda Brown, crouches beside the bins and listens carefully as the mail truck cruises by. Linda grips the top rails of a wooden ladder propped against a fence, hoists herself up, and descends the ladder to a deck outside a dining room window. She cautiously slides open the pane and steps into the dim dining room, where she gazes at a young boy of around 12 years old resting in a chair with a hearing aid affixed to his ear. Linda leans against the bookshelf, studies him closely, rummages in her apron, and retrieves a stack of postcards addressed to Johnny Brown, which she discreetly tucks beneath Johnny's plate. She pulls open a cabinet, extracts a red-and-white-striped scarf, and in the shadowed pantry, she divides a carrot into quarters. She spins abruptly as the light flicks on and observes a dark-haired man in his 30s with his hat askew, wearing an amused smile. They both glance towards the hallway as Johnny, who's overheard, wanders in. Linda strides over to him, bends down beside him, and firmly grasps his shoe."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A scan of a human body appears next to a high-tech hoverboard. Harry exits a glass chamber, surrounded by green smoke, smirking. Meanwhile, in a tranquil forest, Peter and Mary Jane relax on a hammock-like web, sharing a tender kiss. Unaware, a meteor crashes nearby, releasing black tendrils that spread across the ground. Peter and Mary Jane slide down a web, oblivious as the tendrils attach to his moped's rear number plate. In Brooklyn, Flint Marko, in an orange jumpsuit, runs from police, hiding in shadows. He climbs to a fire escape, enters a dark bedroom, and watches over his sleeping daughter, Penny, who has a tube connected to her nose. Flint places letters for Penny under her pillow, retrieves a striped T-shirt, and breaks bread in the kitchen. A blond woman, looking disenchanted, confronts him, and as Penny enters, Flint kneels to gently take her arm."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Flint walks over to her kneels down in front of her and gently takes her arm They both turn to the door as Penny who is overheard comes in He turns sharply as the light comes on and looks at a blond woman in her 40s with her arms folded wearing a disenchanted expression He pulls open a drawer takes out a greenandblackstriped Tshirt and in the dark kitchen he breaks some bread in half sill gazes at her intently reaches into his jumpsuit and takes out a handful of letters addressed to Penny Marko which he gently slides underneath Penny's pillow Flint sits on the window He gently opens the window and climbs into the dark bedroom where he looks down at a little girl of about 10 years old asleep in bed with a tube connected to her nose Flint grabs the bottom rungs of a metal ladder mounted on a wall holds himself up and climbs the ladder to a fire escape outside a bedroom window The man Flint Marko hides in the shadows and watches nervously as the squad car cruises past A police car with a search lamp mounted by the passenger window turns onto the street behind him and drives down the road at a walking pace At night a train rumbles across a bridge in the heart of Brooklyn and close by a burly fairhaired man in an orange jumpsuit runs down a dark street The strange black substance crawls speedily up behind and attaches itself to the rear number plate as the moped rides off down the woodland track Peter wraps his moped and with Mary Jane sitting on the pillion seat it starts to move off Peter smiling happily slides down a thread of webbing with Mary Jane unaware of the tendrils crawling up a nearby ridge like a huge black spider The glowing orange meteor embedded in the ground cracks open and black tendrils like living vines spring out and stretch across the ground A fiery meteor plummets from the sky and crashes into the forest but Mary Jane and Peter remain oblivious while wrapped in each other's arms Mary Jane shuts her eyes tightly smiles faintly and then they kiss tenderly In a dark peaceful forest Peter and Mary Jane lie on a huge hammocklike web on their backs watching for shooting stars The door of a glass chamber slides open and green smoke pours out as Harry wearing just a pair of shorts steps out takes a deep breath and smirks A screen shows a scan of a human body next to a hightech hoverboard"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Flint walks over to her kneels down in front of her and gently takes her arm The glowing orange meteor embedded in the ground cracks open and black tendrils like living vines spring out and stretch across the ground Flint sits on the window A fiery meteor plummets from the sky and crashes into the forest but Mary Jane and Peter remain oblivious while wrapped in each other's arms At night a train rumbles across a bridge in the heart of Brooklyn and close by a burly fairhaired man in an orange jumpsuit runs down a dark street He gently opens the window and climbs into the dark bedroom where he looks down at a little girl of about 10 years old asleep in bed with a tube connected to her nose sill gazes at her intently reaches into his jumpsuit and takes out a handful of letters addressed to Penny Marko which he gently slides underneath Penny's pillow They both turn to the door as Penny who is overheard comes in Peter smiling happily slides down a thread of webbing with Mary Jane unaware of the tendrils crawling up a nearby ridge like a huge black spider Flint grabs the bottom rungs of a metal ladder mounted on a wall holds himself up and climbs the ladder to a fire escape outside a bedroom window He turns sharply as the light comes on and looks at a blond woman in her 40s with her arms folded wearing a disenchanted expression A police car with a search lamp mounted by the passenger window turns onto the street behind him and drives down the road at a walking pace The door of a glass chamber slides open and green smoke pours out as Harry wearing just a pair of shorts steps out takes a deep breath and smirks The man Flint Marko hides in the shadows and watches nervously as the squad car cruises past In a dark peaceful forest Peter and Mary Jane lie on a huge hammocklike web on their backs watching for shooting stars He pulls open a drawer takes out a greenandblackstriped Tshirt and in the dark kitchen he breaks some bread in half Peter wraps his moped and with Mary Jane sitting on the pillion seat it starts to move off The strange black substance crawls speedily up behind and attaches itself to the rear number plate as the moped rides off down the woodland track A screen shows a scan of a human body next to a hightech hoverboard Mary Jane shuts her eyes tightly smiles faintly and then they kiss tenderly"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A police car with a search lamp mounted by the passenger window turns onto the street behind him and drives down the road at a walking pace The man Flint Marko hides in the shadows and watches nervously as the squad car cruises past Flint grabs the bottom rungs of a metal ladder mounted on a wall holds himself up and climbs the ladder to a fire escape outside a bedroom window He gently opens the window and climbs into the dark bedroom where he looks down at a little girl of about 10 years old asleep in bed with a tube connected to her nose Flint sits on the window sill gazes at her intently reaches into his jumpsuit and takes out a handful of letters addressed to Penny Marko which he gently slides underneath Penny's pillow He pulls open a drawer takes out a greenandblackstriped Tshirt and in the dark kitchen he breaks some bread in half He turns sharply as the light comes on and looks at a blond woman in her 40s with her arms folded wearing a disenchanted expression They both turn to the door as Penny who is overheard comes in Flint walks over to her kneels down in front of her and gently takes her arm A screen shows a scan of a human body next to a hightech hoverboard The door of a glass chamber slides open and green smoke pours out as Harry wearing just a pair of shorts steps out takes a deep breath and smirks In a dark peaceful forest Peter and Mary Jane lie on a huge hammocklike web on their backs watching for shooting stars Mary Jane shuts her eyes tightly smiles faintly and then they kiss tenderly A fiery meteor plummets from the sky and crashes into the forest but Mary Jane and Peter remain oblivious while wrapped in each other's arms The glowing orange meteor embedded in the ground cracks open and black tendrils like living vines spring out and stretch across the ground Peter smiling happily slides down a thread of webbing with Mary Jane unaware of the tendrils crawling up a nearby ridge like a huge black spider Peter wraps his moped and with Mary Jane sitting on the pillion seat it starts to move off The strange black substance crawls speedily up behind and attaches itself to the rear number plate as the moped rides off down the woodland track At night a train rumbles across a bridge in the heart of Brooklyn and close by a burly fairhaired man in an orange jumpsuit runs down a dark street"
        }
      ]
    }
  ]
}