{
  "ground_truth": "The brownhead girl smiles, holds out her hand, and places a locket in Flint's huge palm. He clenches his fist around it. A red flashing light spills into the room, and Flint strides over to the window, climbing out onto the fire escape. Emma, Penny's mother, watches him go with a worn, cynical expression. Peter is riding along a quiet street in the dark. He parks outside Aunt May's apartment. Aunt May looks down, her eyes glistening with tears, and sweeps back a lock of her white hair. She takes off her ring. Peter takes the ring and gazes gratefully at his aunt, who smiles back at him warmly. He leans forward, and they hug, holding each other in a warm embrace. After dark, Peter, wearing a dopey smile, rides along a city street. A masked figure in dark green swoops down on a hoverboard and carries him up onto the rooftops. The masked attacker headbutts Peter and clamps a hand across his mouth. Jagged blades spring from his forearms, and he slashes at Peter's stomach. Peter jumps free of the hoverboard and shoots a web thread to the top of a skyscraper. Swinging from the thread, he shoots webbing balls. The attacker ducks to avoid them and slices through Peter's thread. Peter falls, and his dark green mystery attacker smashes him into a wall high above the ground. Stuck in the wall, Peter looks up in a daze as the figure in dark green hovers down towards him and slides his visor back. Peter dodges a huge punch. Harry prises out the section of the wall Peter is clinging to. Peter hangs on as it plummets towards the street below, but Harry swoops down after him, smashing the chunk of wall into fragments. Peter swings away on a thread, but Harry flies at him, thumping him into the air like a ball on elastic. Peter falls. Harry grabs him, dragging and thumping him against the high walls as he flies, then hurling him through a corner of a window. As Peter floats out of the other shattered window, he sees Aunt May's ring spinning through the air in front of him. He then tries to snatch at it. Harry grabs him from behind. Both men balance on the narrow, sweeping hoverboard, the Sky Stick, as they fight. Peter throws Harry off the Sky Stick and fires a couple of web threads, using them to catapult himself down after the falling ring. The Sky Stick automatically zooms down to collect the falling Harry. Peter swings down and is just grabbing the ring when Harry strikes him again, sending him sprawling onto a rooftop. Peter opens his fist and looks down at the ring nestled in his palm, then turns and runs as Harry swoops down.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The brunette lass grins, extends out her hand, and sets a pendant in Flint's enormous palm. He grips his fist around it. A crimson blinking light floods into the chamber, and Flint strides over to the window, scaling out onto the fire escape. Emma, Penny's mother, observes him depart with a worn, cynical expression. Peter is riding along a tranquil road in the dimness. He parks outside Aunt May's flat. Aunt May glances down, her eyes shimmering with tears, and sweeps back a strand of her white hair. She removes her ring. Peter takes the ring and gazes appreciatively at his aunt, who beams back at him warmly. He leans forward, and they hug, holding each other in a warm embrace. After dark, Peter, wearing a silly smile, rides along a metropolitan street. A masked character in dark green swoops down on a hoverboard and carries him up onto the rooftops. The masked assailant headbutts Peter and clamps a hand across his mouth. Jagged blades spring from his forearms, and he slashes at Peter's abdomen. Peter leaps free of the hoverboard and shoots a web strand to the top of a skyscraper. Swinging from the strand, he shoots webbing spheres. The assailant ducks to evade them and slices through Peter's strand. Peter falls, and his dark green mystery assailant smashes him into a wall high above the ground. Stuck in the wall, Peter looks up in a stupor as the character in dark green hovers down towards him and slides his visor back. Peter dodges a colossal punch. Harry prises out the section of the wall Peter is clinging to. Peter hangs on as it plummets towards the avenue below, but Harry swoops down after him, smashing the portion of wall into fragments. Peter swings away on a strand, but Harry flies at him, thumping him into the air like a ball on elastic. Peter falls. Harry grabs him, dragging and thumping him against the high walls as he flies, then hurling him through a corner of a window. As Peter floats out of the other shattered window, he sees Aunt May's ring spinning through the air in front of him. He then tries to snatch at it. Harry grabs him from behind. Both men balance on the narrow, sweeping hoverboard, the Sky Stick, as they fight. Peter throws Harry off the Sky Stick and fires a couple of web strands, using them to catapult himself down after the dropping ring. The Sky Stick automatically zooms down to collect the falling Harry. Peter swings down and is just seizing the ring when Harry strikes him again, sending him sprawling onto a rooftop. Peter opens his fist and looks down at the ring nestled in his palm, then turns and runs as Harry swoops down."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The brownhead girl smiles, her hand is held out, and a locket is placed in Flint's huge palm by her. The fist is clenched by him around it. A red flashing light spills into the room, and the window is approached by Flint, who climbs out onto the fire escape. Emma, Penny's mother, watches him go with a worn, cynical expression. A quiet street is ridden along by Peter in the dark. The car is parked by him outside Aunt May's apartment. Aunt May looks down, her eyes glistening with tears, and a lock of her white hair is swept back by her. Her ring is taken off by her. The ring is taken by Peter, who gazes gratefully at his aunt, who smiles back at him warmly. He leans forward, and each other is held in a warm embrace as they hug. After dark, Peter, wearing a dopey smile, is riding along a city street. A hoverboard is used by a masked figure in dark green to swoop down and carry him up onto the rooftops. Peter is headbutted by the masked attacker, and a hand is clamped across his mouth. Jagged blades spring from his forearms, and Peter's stomach is slashed at by him. The hoverboard is jumped free of by Peter, and a web thread is shot to the top of a skyscraper. The thread is swung from by Peter, and webbing balls are shot. The attacker ducks to avoid them and slices through Peter's thread. Peter falls, and he is smashed into a wall high above the ground by his dark green mystery attacker. In the wall, Peter looks up in a daze as the figure in dark green hovers down towards him and his visor is slid back. A huge punch is dodged by Peter. Harry prises out the section of the wall Peter clings to. As it plummets towards the street below, Peter hangs on, but Harry swoops down after him, and the chunk of wall is smashed into fragments by him. On a thread, Peter swings away, but at him, Harry flies, thumping him into the air like a ball on elastic. Peter falls. He is grabbed by Harry, who drags and thumps him against the high walls as he flies, then hurls him through a corner of a window. As the other shattered window is floated out of by Peter, Aunt May's ring is seen by him spinning through the air in front of him. He then tries to snatch at it. From behind, he is grabbed by Harry. On the narrow, sweeping hoverboard, the Sky Stick, the men balance as they fight. Harry is thrown off the Sky Stick by Peter, and a couple of web threads are fired by him, using them to catapult himself down after the falling ring. The Sky Stick automatically zooms down to collect the falling Harry. Peter swings down and is just grabbing the ring when he is struck again by Harry, sprawling him onto a rooftop. His fist is opened by Peter, who looks down at the ring nestled in his palm, then turns and runs as Harry swoops down."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The brown-haired girl smiles, extends her hand, and places a locket in Flint's large palm. He grips it tightly. A red light flashes, and Flint climbs out the window onto the fire escape. Emma, Penny's mother, watches him leave with a cynical look. Peter rides along a quiet street at night, parking outside Aunt May's apartment. Aunt May, eyes glistening with tears, removes her ring. Peter takes it, gazing gratefully at her, and they share a warm hug. Later, Peter, smiling, rides through the city. A masked figure in dark green swoops down on a hoverboard, carrying him to the rooftops. The attacker headbutts Peter, clamps his mouth, and slashes at him with forearm blades. Peter jumps free, shooting a web to a skyscraper and swinging while firing web balls. The attacker dodges and cuts Peter's thread, causing him to fall. The attacker smashes Peter into a wall, then hovers down, sliding his visor back. Peter dodges a punch as Harry pries out the wall section Peter clings to. Peter hangs on as it falls, but Harry smashes it into fragments. Peter swings away, but Harry thumps him into the air, dragging and hurling him through a window. As Peter floats out, he sees Aunt May's ring spinning and tries to grab it. Harry grabs him from behind. They balance on the hoverboard, the Sky Stick, fighting. Peter throws Harry off and uses web threads to catapult after the ring. The Sky Stick collects Harry. Peter grabs the ring, but Harry strikes him, sending him sprawling onto a rooftop. Peter opens his fist, sees the ring, and runs as Harry swoops down."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The brown-haired girl smiles, hands a locket to Flint, who clenches it. A red light fills the room as Flint exits onto the fire escape. Emma, Penny's mother, watches cynically. Peter rides a quiet street, parks at Aunt May's. She, teary-eyed, removes her ring. Peter gratefully takes it, and they hug warmly. Later, Peter rides with a dopey smile. A masked figure on a hoverboard grabs him, headbutts him, and slashes at his stomach. Peter escapes, swings from a skyscraper, and shoots web balls. The attacker dodges, cuts Peter's thread, and smashes him into a wall. Dazed, Peter dodges a punch as Harry pries him from the wall. Peter clings to the falling wall, but Harry shatters it. Peter swings away, but Harry attacks, hurling him through a window. As Peter floats out, he sees Aunt May's ring and tries to grab it. Harry grabs him, and they fight on the Sky Stick. Peter throws Harry off, catapults after the ring, and the Sky Stick retrieves Harry. Peter grabs the ring, but Harry strikes him onto a rooftop. Peter opens his fist, sees the ring, and runs as Harry swoops down."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The girl with brown hair beams a bright smile, extending her hand gracefully to place a delicate locket into Flint's large, open palm. Flint, with a determined expression, closes his fist tightly around the locket. Suddenly, a red flashing light floods the room with an urgent glow, prompting Flint to stride purposefully over to the window. He climbs out onto the fire escape with swift, practiced movements. Emma, who is Penny's mother, observes his departure with a weary, cynical look etched on her face. Meanwhile, Peter is riding his bike along a quiet, dimly lit street under the cover of darkness. He comes to a stop outside Aunt May's apartment building. Aunt May, with tears glistening in her eyes, looks down and gently sweeps back a stray lock of her white hair. She removes her ring with a sense of solemnity. Peter accepts the ring, gazing at his aunt with deep gratitude, and she returns his gaze with a warm, affectionate smile. Leaning forward, they share a heartfelt hug, holding each other in a comforting embrace. Later, after nightfall, Peter, wearing a somewhat goofy smile, rides along a bustling city street. Suddenly, a masked figure clad in dark green swoops down on a hoverboard, lifting him up onto the rooftops. The masked assailant headbutts Peter and clamps a firm hand over his mouth. Sharp, jagged blades extend from the attacker's forearms, and he slashes menacingly at Peter's stomach. Peter manages to leap free of the hoverboard, shooting a web thread to the top of a towering skyscraper. As he swings from the thread, he fires webbing balls at his attacker. The attacker skillfully ducks to avoid them and slices through Peter's thread with precision. Peter plummets, and his mysterious attacker in dark green smashes him into a wall high above the ground. Stuck in the wall, Peter looks up in a daze as the figure in dark green hovers down towards him, sliding his visor back. Peter narrowly dodges a massive punch. Harry, revealing himself, pries out the section of the wall to which Peter clings. Peter desperately hangs on as it plummets towards the street below, but Harry swoops down after him, shattering the chunk of wall into fragments. Peter swings away on a thread, but Harry relentlessly flies at him, thumping him into the air like a ball on elastic. Peter falls, and Harry seizes him, dragging and thumping him against the high walls as he flies, then hurling him through a corner of a window. As Peter floats out of the other shattered window, he catches sight of Aunt May's ring spinning through the air in front of him. He reaches out, trying to snatch it. Harry grabs him from behind. Both men balance precariously on the narrow, sweeping hoverboard, known as the Sky Stick, as they engage in a fierce battle. Peter manages to throw Harry off the Sky Stick and fires a couple of web threads, using them to catapult himself down after the falling ring. The Sky Stick automatically zooms down to collect the falling Harry. Peter swings down and is just about to grab the ring when Harry strikes him again, sending him sprawling onto a nearby rooftop. Peter opens his fist and looks down at the ring nestled securely in his palm, then turns and runs as Harry swoops down once more."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The young girl, her brown hair cascading down her shoulders, beams with a radiant and welcoming smile as she gracefully extends her delicate hand. Gently and carefully, she places a fragile locket into Flint's large, open palm, which eagerly awaits the precious object. Flint, harboring a determined and resolute expression on his face, closes his fist tightly around the locket, as though securing a treasure. Suddenly, the room is awash in an urgent and intense red flashing light, flooding the space with a sense of immediacy and alarm, prompting Flint to stride purposefully over to the nearby window. With rapid, swift, and well-practiced movements, he climbs out onto the fire escape. Observing his departure, Emma, who is Penny's mother, watches him with a weary and cynical expression etched deeply on her face. \n\nMeanwhile, Peter is riding his bike along a quiet and dimly lit street, shrouded under the cover of darkness. He eventually comes to a stop outside Aunt May's apartment building. Aunt May stands there, with tears glistening like tiny crystals in her eyes. She looks down, gently sweeping back a stray lock of her white hair with a delicate motion. Removing her ring with a solemn and grave sense of duty, she extends it to Peter. He accepts the ring, looking at his aunt with deep gratitude in his eyes, and she returns his gaze with a warm and affectionate smile. Leaning forward, they share a heartfelt and tender hug, holding each other in a comforting embrace that speaks volumes of their bond.\n\nLater, after nightfall has fully descended, Peter, wearing a somewhat goofy yet endearing smile, rides along a bustling and lively city street. Suddenly, a masked figure clad in dark green makes a swift descent on a hoverboard, lifting Peter up onto the rooftops. The masked assailant aggressively headbutts Peter and clamps a firm, unyielding hand over his mouth. Sharp and jagged blades emerge menacingly from the attacker's forearms, and he slashes threateningly at Peter's stomach. Peter manages to leap free of the hoverboard, expertly shooting a web thread to the top of a towering skyscraper. As he swings from the thread, he fires webbing balls at his attacker. Demonstrating agility, the attacker skillfully ducks to avoid them and slices through Peter's thread with precision. \n\nPeter plummets through the air, and his mysterious assailant dressed in dark green smashes him into a wall high above the ground. Stuck in the wall, Peter looks up in a daze as the figure in dark green hovers near him, sliding back his visor. Peter narrowly avoids a massive punch. Harry, revealing himself, pries out the section of the wall to which Peter clings, forcing Peter to desperately hold on as it plummets toward the street below. However, Harry swoops down after him, shattering the chunk of wall into fragments. Peter swings away on a thread, but Harry relentlessly pursues him, thumping him into the air like a ball on elastic. Peter falls, and Harry seizes him again, dragging and thumping him against the high walls as he flies, then hurling him violently through a corner of a window.\n\nAs Peter floats out of the other shattered window, he catches sight of Aunt May's cherished ring spinning gracefully through the air in front of him. He reaches out, stretching his hand to snatch it. Just then, Harry grabs him from behind. Both men balance precariously on the narrow and sweeping hoverboard, known as the Sky Stick, as they engage in a fierce and intense battle. Peter skillfully manages to throw Harry off the Sky Stick and fires a couple of web threads, using them to catapult himself downward after the falling ring. The Sky Stick automatically zooms down to collect the falling Harry. Peter swings down and is just about to grab the ring when Harry strikes him once more, sending him sprawling onto a nearby rooftop. Opening his fist, Peter looks down at the ring nestled securely in his palm, then turns and runs as Harry swoops down yet again."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The brown-haired girl, with a gentle smile on her face, extends her hand slowly and carefully places a delicate locket into Flint's large, open palm. Flint, feeling the weight of the locket, closes his fingers tightly around it, forming a fist. Suddenly, a red flashing light floods the room, casting an urgent glow on the surroundings. Reacting quickly, Flint strides purposefully towards the window, his movements confident and determined, before climbing out onto the fire escape with practiced ease. Inside, Emma, who is Penny's mother, stands watching him leave, her face etched with a worn, cynical expression that speaks volumes of her experiences. Meanwhile, Peter is riding his bike along a quiet street enveloped in darkness, the only sound being the gentle hum of his wheels on the pavement. He comes to a stop outside Aunt May's apartment, parking his bike with care. Inside, Aunt May looks down, her eyes shimmering with unshed tears, and gently sweeps back a stray lock of her white hair, a gesture filled with emotion. With a heavy heart, she removes her ring, handing it to Peter, who accepts it with a gaze full of gratitude directed at his aunt. She responds with a warm, reassuring smile. Peter leans forward, and they share a heartfelt hug, holding each other in a comforting embrace that speaks of their deep bond. Later, after night has fallen, Peter, now wearing a dopey smile, rides his bike along a city street, the lights casting a soft glow around him. Suddenly, a masked figure dressed in dark green swoops down from above on a hoverboard, lifting Peter up onto the rooftops with a swift, unexpected motion. The masked attacker, with a swift and brutal movement, headbutts Peter and clamps a hand firmly across his mouth. From the attacker's forearms, jagged blades spring forth, and he slashes at Peter's stomach with a vicious swipe. Reacting quickly, Peter jumps free of the hoverboard, shooting a web thread towards the top of a nearby skyscraper. As he swings from the thread, he rapidly shoots webbing balls at his attacker. The attacker, agile and quick, ducks to avoid them and slices through Peter's thread with precision. Peter plummets, and the dark green mystery attacker smashes him into a wall high above the ground. Stuck in the wall, Peter looks up, dazed and disoriented, as the figure in dark green hovers down towards him, sliding his visor back with a menacing intent. Peter, regaining his senses, dodges a massive punch aimed at him. Harry, now revealed, prises out the section of the wall Peter is clinging to, causing Peter to hang on desperately as it plummets towards the street below. Harry swoops down after him, smashing the chunk of wall into fragments with a powerful blow. Peter swings away on a thread, but Harry, relentless in his pursuit, flies at him, thumping him into the air like a ball on elastic. Peter falls, and Harry grabs him, dragging and thumping him against the high walls as he flies, then hurling him through a corner of a window with a forceful throw. As Peter floats out of the other shattered window, he catches sight of Aunt May's ring spinning through the air in front of him, a glinting reminder of his mission. He reaches out, trying to snatch it from the air. Harry, however, grabs him from behind, and both men find themselves balancing precariously on the narrow, sweeping hoverboard known as the Sky Stick as they continue their fierce fight. In a swift move, Peter throws Harry off the Sky Stick and fires a couple of web threads, using them to catapult himself down after the falling ring. The Sky Stick, programmed to respond, automatically zooms down to collect the falling Harry. Peter swings down, his focus solely on the ring, and just as he is about to grab it, Harry strikes him again, sending him sprawling onto a rooftop. Peter opens his fist, looking down at the ring nestled safely in his palm, a small victory amidst the chaos, then turns and runs as Harry swoops down once more, the chase continuing."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The brown-haired girl smiles and places a locket in Flint's palm, which he clenches tightly. As a red flashing light fills the room, Flint strides to the window and climbs onto the fire escape, leaving Emma, Penny's mother, watching with a cynical expression. Meanwhile, Peter rides quietly through the dark streets and parks outside Aunt May's apartment. With tears in her eyes, Aunt May removes her ring and hands it to Peter, who gazes at her gratefully before they share a warm embrace. Later, Peter, wearing a dopey smile, rides through the city when a masked figure on a hoverboard swoops down, carrying him to the rooftops. The attacker headbutts Peter, clamps a hand over his mouth, and slashes at him with forearm blades. Peter escapes the hoverboard, shoots a web to a skyscraper, and swings while firing web balls. The attacker dodges, slices Peter's thread, and smashes him into a wall. Dazed, Peter watches as the figure hovers closer and slides back his visor. Peter dodges a punch, but Harry pries the wall section loose, sending Peter plummeting. Harry smashes the wall into fragments, but Peter swings away, only to be thumped into the air by Harry. As Peter falls, Harry drags and hurls him through a window. Floating out the other side, Peter sees Aunt May's ring spinning and tries to grab it, but Harry grabs him from behind. They balance on the Sky Stick, fighting until Peter throws Harry off and uses web threads to catapult himself after the ring. The Sky Stick retrieves Harry as Peter grabs the ring, but Harry strikes again, sending Peter sprawling onto a rooftop. Peter opens his fist to see the ring nestled in his palm, then turns and runs as Harry swoops down."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The brownhead girl smiles, holds out her hand, and places a locket in Flint's huge palm. The locket, an heirloom from the 19th century known for its intricate engravings, holds sentimental value. He clenches his fist around it. A red flashing light, part of the emergency alarm system common in high-rise apartments, spills into the room, and Flint strides over to the window, climbing out onto the fire escape, a metal staircase attached to many city buildings for urgent evacuation. Emma, Penny's mother, watches him go with a worn, cynical expression that reflects years of personal hardships. Peter is riding along a quiet, suburban street in the dark. He parks outside Aunt May's apartment, a modest building known for its charming historical architecture. Aunt May looks down, her eyes glistening with tears, and sweeps back a lock of her white hair. She takes off her ring, a beloved keepsake from her late husband. Peter takes the ring and gazes gratefully at his aunt, who smiles back at him warmly with the love that has always been his guiding light. He leans forward, and they hug, holding each other in a warm embrace filled with unspoken understanding. After dark, Peter, wearing a dopey smile as if lost in happy memories, rides along a city street. A masked figure in dark green, whose identity is shrouded in mystery, swoops down on a hoverboard, a futuristic device called the Sky Stick, and carries him up onto the rooftops. The masked attacker, known for his ruthless tactics, headbutts Peter and clamps a hand across his mouth. Jagged blades, a deadly modification, spring from his forearms, and he slashes at Peter's stomach. Peter jumps free of the hoverboard and shoots a web thread to the top of a skyscraper. Swinging from the thread, he shoots webbing balls, a skill perfected through countless hours of practice. The attacker ducks to avoid them and slices through Peter's thread, severing his only support. Peter falls, and his dark green mystery attacker smashes him into a wall high above the ground. Stuck in the wall, Peter looks up in a daze as the figure in dark green hovers down towards him and slides his visor back, revealing a known adversary. Peter dodges a huge punch. Harry, a once-close friend turned foe, prises out the section of the wall Peter is clinging to. Peter hangs on as it plummets towards the street below, but Harry swoops down after him, smashing the chunk of wall into fragments, increasing the danger. Peter swings away on a thread, but Harry flies at him, thumping him into the air like a ball on elastic, a display of his superior physical prowess. Peter falls. Harry grabs him, dragging and thumping him against the high walls as he flies, then hurling him through a corner of a window, one of the few remaining intact. As Peter floats out of the other shattered window, he sees Aunt May's ring spinning through the air in front of him, a symbol of familial love and duty. He then tries to snatch at it. Harry grabs him from behind. Both men balance on the narrow, sweeping hoverboard, the Sky Stick, as they fight, their skilled maneuvers reflecting their long history of conflict and betrayal. Peter throws Harry off the Sky Stick and fires a couple of web threads, using them to catapult himself down after the falling ring, an act driven by deeper emotions than the fight itself. The Sky Stick automatically zooms down to collect the falling Harry, a failsafe he had installed for moments like these. Peter swings down and is just grabbing the ring when Harry strikes him again, sending him sprawling onto a rooftop, disoriented but determined. Peter opens his fist and looks down at the ring nestled in his palm, then turns and runs as Harry swoops down, their battle far from over."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The brownhead girl smiles holds out her hand and places a locket in Flint's huge palm. He clenches his fist around it. A red flashing light spills into the room and Flint strides over to the window climbing out onto the fire escape. Emma Penny's mother watches him go with a worn cynical expression. Peter is riding along a quiet street in the dark. He parks outside Aunt May's apartment. Aunt May looks down her eyes glistening with tears and sweeps back a lock of her white hair. She takes off her ring. Peter takes the ring and gazes gratefully at his aunt who smiles back at him warmly. He leans forward and they hug holding each other in a warm embrace. After dark Peter wearing a dopey smile rides along a city street. A masked figure in dark green swoops down on a hoverboard and carries him up onto the rooftops. The masked attacker headbutts Peter and clamps a hand across his mouth. Jagged blades spring from his forearms and he slashes at Peter's stomach. Peter jumps free of the hoverboard and shoots a web thread to the top of a skyscraper. Swinging from the thread he shoots webbing balls. The attacker ducks to avoid them and slices through Peter's thread. Peter falls and his dark green mystery attacker smashes him into a wall high above the ground. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Stuck in the wall. Peter looks up in a daze as the figure in dark green hovers down towards him and slides his visor back. Peter dodges a huge punch. Harry prises out the section of the wall. Peter is clinging to. Peter hangs on as it plummets towards the street below but Harry swoops down after him smashing the chunk of wall into fragments. Peter swings away on a thread but Harry flies at him thumping him into the air like a ball on elastic. Peter falls. Harry grabs him dragging and thumping him against the high walls as he flies then hurling him through a corner of a window. As Peter floats out of the other shattered window he sees Aunt May's ring spinning through the air in front of him. He then tries to snatch at it. Harry grabs him from behind. Both men balance on the narrow sweeping hoverboard. the Sky Stick as they fight. Peter throws Harry off the Sky Stick and fires a couple of web threads using them to catapult himself down after the falling ring. The Sky Stick automatically zooms down to collect the falling Harry. Peter swings down and is just grabbing the ring when Harry strikes him again sending him sprawling onto a rooftop. Peter opens his fist and looks down at the ring nestled in his palm then turns and runs as Harry swoops down."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The brownhead girl smiles holds out her hand and places a locket in Flint's huge palm. He clenches his fist around it. A red flashing light spills into the room and Flint strides over to the window climbing out onto the fire escape. Emma Penny's mother watches him go with a worn cynical expression. Peter is riding along a quiet street in the dark. He parks outside Aunt May's apartment. Aunt May looks down her eyes glistening with tears and sweeps back a lock of her white hair. She takes off her ring. Peter takes the ring and gazes gratefully at his aunt who smiles back at him warmly. He leans forward and they hug holding each other in a warm embrace. After dark Peter wearing a dopey smile rides along a city street. A masked figure in dark green swoops down on a hoverboard and carries him up onto the rooftops. The masked attacker headbutts Peter and clamps a hand across his mouth. Jagged blades spring from his forearms and he slashes at Peter's stomach. Peter jumps free of the hoverboard and shoots a web thread to the top of a skyscraper. Swinging from the thread he shoots webbing balls. The attacker ducks to avoid them and slices through Peter's thread. Peter falls and his dark green mystery attacker smashes him into a wall high above the ground. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Stuck in the wall. Peter looks up in a daze as the figure in dark green hovers down towards him and slides his visor back. Peter dodges a huge punch. Harry prises out the section of the wall. Peter is clinging to. Peter hangs on as it plummets towards the street below but Harry swoops down after him smashing the chunk of wall into fragments. Peter swings away on a thread but Harry flies at him thumping him into the air like a ball on elastic. Peter falls. Harry grabs him dragging and thumping him against the high walls as he flies then hurling him through a corner of a window. As Peter floats out of the other shattered window he sees Aunt May's ring spinning through the air in front of him. He then tries to snatch at it. Harry grabs him from behind. Both men balance on the narrow sweeping hoverboard. the Sky Stick as they fight. Peter throws Harry off the Sky Stick and fires a couple of web threads using them to catapult himself down after the falling ring. The Sky Stick automatically zooms down to collect the falling Harry. Peter swings down and is just grabbing the ring when Harry strikes him again sending him sprawling onto a rooftop. Peter opens his fist and looks down at the ring nestled in his palm then turns and runs as Harry swoops down."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The brownhead girl smiles holds out her hand and places a locket in Flint's huge palm. He clenches his fist around it. A red flashing light spills into the room and Flint strides over to the window climbing out onto the fire escape. Emma Penny's mother watches him go with a worn cynical expression. Peter is riding along a quiet street in the dark. He parks outside Aunt May's apartment. Aunt May looks down her eyes glistening with tears and sweeps back a lock of her white hair. She takes off her ring. Peter takes the ring and gazes gratefully at his aunt who smiles back at him warmly. As Peter floats out of the other shattered window he sees Aunt May's ring spinning through the air in front of him. He then tries to snatch at it. Harry grabs him from behind. Both men balance on the narrow sweeping hoverboard. the Sky Stick as they fight. Peter throws Harry off the Sky Stick and fires a couple of web threads using them to catapult himself down after the falling ring. The Sky Stick automatically zooms down to collect the falling Harry. Peter swings down and is just grabbing the ring when Harry strikes him again sending him sprawling onto a rooftop. Peter opens his fist and looks down at the ring nestled in his palm then turns and runs as Harry swoops down."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The brownhead girl smiles holds out her hand and places a locket in Flint's huge palm. He clenches his fist around it. A red flashing light spills into the room and Flint strides over to the window climbing out onto the fire escape. Emma Penny's mother watches him go with a worn cynical expression. Peter throws Harry off the Sky Stick and fires a couple of web threads using them to catapult himself down after the falling ring. The Sky Stick automatically zooms down to collect the falling Harry. Peter swings down and is just grabbing the ring when Harry strikes him again sending him sprawling onto a rooftop. Peter opens his fist and looks down at the ring nestled in his palm then turns and runs as Harry swoops down."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The green-eyed cat grins, extends its paw, and drops a pendant into Oak's tiny paw. He squeezes his fingers around it. A blue swirling mist pours into the cavern, and Oak trudges over to the door, slipping onto the ladder. Dina, Oliver's aunt, observes him leave with an amused, cheerful gaze. Lucas is gliding along a bustling highway in the rain. He halts outside Uncle Joe's shack. Uncle Joe peers upward, his glasses sparkling with raindrops, and adjusts a thread of his black scarf. He removes his bracelet. Lucas takes the bracelet and looks thankfully at his uncle, who nods back at him softly. He steps closer, and they cuddle, clutching each other in a gentle squeeze. After dawn, Lucas, wearing a puzzled grin, glides along a suburban boulevard. A hooded creature in bright yellow zooms up on a skateboard and whisks him up onto the terraces. The hooded nemesis kicks Lucas and straps a glove across his neck. Sharp feathers leap from his shoulders, and he jabs at Lucas's arm. Lucas leaps off the skateboard and launches a rope wire to the brim of a warehouse. Gliding from the wire, he launches rubber balls. The nemesis ducks to evade them and chops through Lucas's wire. Lucas tumbles, and his bright yellow hidden foe smashes him against a gate high above the boulevard. Embedded in the gate, Lucas glances downward in a fog as the creature in bright yellow hovers up towards him and flips its cape back. Lucas dodges a tiny slap. Simon wedges out the piece of the gate Lucas is holding onto. Lucas clings as it plunges towards the alley below, but Simon zooms up after him, scattering the piece of gate into dust. Lucas glides away on a wire, but Simon glides towards him, hurling him into the clouds like a kite on a string. Lucas tumbles. Simon snatches him, dragging and bashing him against the low trees as he glides, then flinging him through a corner of a balcony. As Lucas drifts out of the other shattered door, he spots Uncle Joe's bracelet whirling through the air beside him. He then attempts to reach for it. Simon clasps him from underneath. Both animals teeter on the broad, gliding skateboard, the Air Glide, as they scuffle. Lucas shoves Simon off the Air Glide and tosses a pair of wire cords, using them to sling himself down after the tumbling bracelet. The Air Glide automatically speeds down to scoop up the descending Simon. Lucas glides down and is just grabbing the bracelet when Simon shoves him again, sending him sprawling onto a terrace. Lucas opens his fingers and glances down at the bracelet nestled in his paw, then turns and dashes as Simon zooms up."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A brown-haired girl gives Flint a locket, which he takes as a red light fills the room. Flint exits through the window, watched by Emma with a cynical look. Meanwhile, Peter arrives at Aunt May's apartment, where she tearfully removes a ring and gives it to him. They share a warm hug before Peter leaves, smiling. Later, Peter is attacked by a masked figure on a hoverboard. The attacker, revealed as Harry, assaults Peter with blades and throws him against a wall. During their fight, the ring slips from Peter's grasp. Determined to retrieve it, Peter throws Harry from the hoverboard, using web threads to chase the ring, while Harry follows on the Sky Stick. Peter manages to catch the ring but is struck by Harry, who sends him crashing onto a rooftop. Clutching the ring in his hand, Peter gets up and runs as Harry closes in."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Peter opens his fist and looks down at the ring nestled in his palm then turns and runs as Harry swoops down Peter swings down and is just grabbing the ring when Harry strikes him again sending him sprawling onto a rooftop  The Sky Stick automatically zooms down to collect the falling Harry  Peter throws Harry off the Sky Stick and fires a couple of web threads using them to catapult himself down after the falling ring  the Sky Stick as they fight  Both men balance on the narrow sweeping hoverboard  Harry grabs him from behind  He then tries to snatch at it  As Peter floats out of the other shattered window he sees Aunt May's ring spinning through the air in front of him  Harry grabs him dragging and thumping him against the high walls as he flies then hurling him through a corner of a window  Peter falls  Peter swings away on a thread but Harry flies at him thumping him into the air like a ball on elastic  Peter hangs on as it plummets towards the street below but Harry swoops down after him smashing the chunk of wall into fragments  Peter is clinging to  Harry prises out the section of the wall  Peter dodges a huge punch  Peter looks up in a daze as the figure in dark green hovers down towards him and slides his visor back  Stuck in the wall  Peter falls and his dark green mystery attacker smashes him into a wall high above the ground  The attacker ducks to avoid them and slices through Peter's thread  Swinging from the thread he shoots webbing balls  Peter jumps free of the hoverboard and shoots a web thread to the top of a skyscraper  Jagged blades spring from his forearms and he slashes at Peter's stomach  The masked attacker headbutts Peter and clamps a hand across his mouth  A masked figure in dark green swoops down on a hoverboard and carries him up onto the rooftops  After dark Peter wearing a dopey smile rides along a city street  He leans forward and they hug holding each other in a warm embrace  Peter takes the ring and gazes gratefully at his aunt who smiles back at him warmly  She takes off her ring  Aunt May looks down her eyes glistening with tears and sweeps back a lock of her white hair  He parks outside Aunt May's apartment  Peter is riding along a quiet street in the dark  Emma Penny's mother watches him go with a worn cynical expression  A red flashing light spills into the room and Flint strides over to the window climbing out onto the fire escape  He clenches his fist around it  The brownhead girl smiles holds out her hand and places a locket in Flint's huge palm "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He clenches his fist around it The brownhead girl smiles holds out her hand and places a locket in Flint's huge palm Emma Penny's mother watches him go with a worn cynical expression A red flashing light spills into the room and Flint strides over to the window climbing out onto the fire escape He parks outside Aunt May's apartment Peter is riding along a quiet street in the dark She takes off her ring Aunt May looks down her eyes glistening with tears and sweeps back a lock of her white hair He leans forward and they hug holding each other in a warm embrace Peter takes the ring and gazes gratefully at his aunt who smiles back at him warmly A masked figure in dark green swoops down on a hoverboard and carries him up onto the rooftops After dark Peter wearing a dopey smile rides along a city street Jagged blades spring from his forearms and he slashes at Peter's stomach The masked attacker headbutts Peter and clamps a hand across his mouth Swinging from the thread he shoots webbing balls Peter jumps free of the hoverboard and shoots a web thread to the top of a skyscraper Peter falls and his dark green mystery attacker smashes him into a wall high above the ground The attacker ducks to avoid them and slices through Peter's thread Peter looks up in a daze as the figure in dark green hovers down towards him and slides his visor back Stuck in the wall Harry prises out the section of the wall Peter dodges a huge punch Peter hangs on as it plummets towards the street below but Harry swoops down after him smashing the chunk of wall into fragments Peter is clinging to Peter falls Peter swings away on a thread but Harry flies at him thumping him into the air like a ball on elastic As Peter floats out of the other shattered window he sees Aunt May's ring spinning through the air in front of him Harry grabs him dragging and thumping him against the high walls as he flies then hurling him through a corner of a window Harry grabs him from behind He then tries to snatch at it the Sky Stick as they fight Both men balance on the narrow sweeping hoverboard The Sky Stick automatically zooms down to collect the falling Harry Peter throws Harry off the Sky Stick and fires a couple of web threads using them to catapult himself down after the falling ring Peter opens his fist and looks down at the ring nestled in his palm then turns and runs as Harry swoops down Peter swings down and is just grabbing the ring when Harry strikes him again sending him sprawling onto a rooftop"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Stuck in the wall  Peter looks up in a daze as the figure in dark green hovers down towards him and slides his visor back  Peter dodges a huge punch  Harry prises out the section of the wall  Peter is clinging to  Peter hangs on as it plummets towards the street below but Harry swoops down after him smashing the chunk of wall into fragments  Peter swings away on a thread but Harry flies at him thumping him into the air like a ball on elastic  Peter falls  Harry grabs him dragging and thumping him against the high walls as he flies then hurling him through a corner of a window  As Peter floats out of the other shattered window he sees Aunt May's ring spinning through the air in front of him  He then tries to snatch at it  Harry grabs him from behind  Both men balance on the narrow sweeping hoverboard  the Sky Stick as they fight  Peter throws Harry off the Sky Stick and fires a couple of web threads using them to catapult himself down after the falling ring  The Sky Stick automatically zooms down to collect the falling Harry  Peter swings down and is just grabbing the ring when Harry strikes him again sending him sprawling onto a rooftop  Peter opens his fist and looks down at the ring nestled in his palm then turns and runs as Harry swoops down The brownhead girl smiles holds out her hand and places a locket in Flint's huge palm  He clenches his fist around it  A red flashing light spills into the room and Flint strides over to the window climbing out onto the fire escape  Emma Penny's mother watches him go with a worn cynical expression  Peter is riding along a quiet street in the dark  He parks outside Aunt May's apartment  Aunt May looks down her eyes glistening with tears and sweeps back a lock of her white hair  She takes off her ring  Peter takes the ring and gazes gratefully at his aunt who smiles back at him warmly  He leans forward and they hug holding each other in a warm embrace  After dark Peter wearing a dopey smile rides along a city street  A masked figure in dark green swoops down on a hoverboard and carries him up onto the rooftops  The masked attacker headbutts Peter and clamps a hand across his mouth  Jagged blades spring from his forearms and he slashes at Peter's stomach  Peter jumps free of the hoverboard and shoots a web thread to the top of a skyscraper  Swinging from the thread he shoots webbing balls  The attacker ducks to avoid them and slices through Peter's thread  Peter falls and his dark green mystery attacker smashes him into a wall high above the ground "
        }
      ]
    }
  ]
}