{
  "ground_truth": "He tries to run off but one of the capacitors hits him, throwing him back onto the sand. The air is thick with sand as he gets to his feet, trying to shield his face. Tiny granules of high velocity sand fly into his pores and shatter into fragments, fusing with his own molecules, giving his internal structure a sand-like appearance. Flint's hand becomes sand, and his fingers blow away in a fierce wind. His entire body turns to sand and is eaten away by the wind until he completely disintegrates. The cops arrive at the edge of the pit and look down to find the capacitors slowing down and Flint nowhere to be seen. Peter sits alone in a hospital corridor, staring blankly at the paper cup in his hand. He looks up and hurriedly stands as a doctor approaches. The dark haired, bearded doctor goes, leaving Peter looking pensive. With a tentative step, he passes the window of a private room and looks inside. Harry is lying in bed with a bandage wrapped around his head. He turns to face the doorway and smiles as Peter steps inside. Mary Jane comes in. Mary Jane and Peter step into the corridor. Peter looks relieved. In the room, the nurse smiles at Harry. Large rocks roll and clink against each other. Seen from further away, the rocks look more like gravel, and from even further away the gravel reveals itself as millions of grains of sand which sweep along the floor of the pit like waves on a beach. The sand forms a curving shape, almost like a human body. The undulating shape rises up as though to stand, then slumps down again. The shape reforms and slowly rises in the form of a human torso from the waist up. It's Flint, now transformed into Sandman. Sandman raises his arms and examines his bulky, paw-like hands. He looks down at his body of sand, then holds his hands to his large, round head. Sandman looks at the mound of sand next to him and spots the locket Penny gave him lying nearby. He reaches out to pick up the locket but the loose sand of his hand just crumbles around it. He reaches out again and his hand becomes more human, with slim, mobile fingers. He picks up the locket between his finger and thumb, then drops it into his palm. The locket falls open, revealing Penny's picture inside. Sandman's hollow eyes look melancholy as they gaze down at the picture. He clenches the locket in his fist and hauls himself up from the sand like a man climbing out of a swamp. He stumbles as he finds his footing, then slowly steps forward, gradually becoming more human until he looks exactly as he did before the change, right down to his brown hair, green and black striped t-shirt, and beige chinos.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He attempts to sprint away but one of the condensers strikes him, hurling him back onto the sand. The atmosphere is dense with sand as he rises to his feet, attempting to protect his visage. Minute particles of high-speed sand shoot into his pores and splinter into pieces, merging with his own molecules, imparting his inner composition a sand-like semblance. Flint's hand turns to sand, and his digits are carried off in a violent gust. His whole form shifts to sand and is devoured by the wind until he utterly dissolves. The officers arrive at the margin of the pit and gaze down to find the condensers decelerating and Flint nowhere to be seen. Peter sits solitary in a hospital passageway, gazing vacantly at the paper cup in his hand. He glances up and swiftly stands as a physician approaches. The dark-haired, bearded physician departs, leaving Peter appearing contemplative. With a hesitant step, he traverses the window of a private chamber and looks inside. Harry is lying in bed with a dressing wrapped around his cranium. He turns to face the entrance and beams as Peter steps inside. Mary Jane enters. Mary Jane and Peter step into the passageway. Peter appears relieved. In the chamber, the caregiver beams at Harry. Large stones roll and clatter against each other. Seen from farther away, the stones resemble pebbles, and from even farther away the pebbles reveal themselves as millions of grains of sand which sweep along the floor of the pit like waves on a shore. The sand forms a curving figure, almost like a human form. The sinuous figure rises up as though to stand, then slumps down again. The figure reshapes and gradually rises in the guise of a human trunk from the waist up. It's Flint, now changed into Sandman. Sandman elevates his limbs and inspects his hefty, paw-like hands. He glances down at his body of sand, then places his hands to his large, round head. Sandman gazes at the heap of sand beside him and notices the locket Penny gifted him lying nearby. He reaches out to grasp the locket but the loose sand of his hand just disintegrates around it. He reaches out once more and his hand becomes more human, with slender, agile fingers. He picks up the locket between his finger and thumb, then drops it into his palm. The locket falls open, unveiling Penny's likeness inside. Sandman's vacant eyes appear sorrowful as they gaze down at the likeness. He grips the locket in his fist and pulls himself up from the sand like a man climbing out of a marsh. He stumbles as he finds his footing, then slowly steps forward, gradually becoming more human until he appears exactly as he did before the transformation, right down to his brown hair, green and black striped t-shirt, and beige chinos."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He tries to run off, but he is hit by one of the capacitors, throwing him back onto the sand. Sand thickens the air as he gets to his feet, trying to shield his face. Tiny granules of high velocity sand fly into his pores and shatter into fragments, fusing with his own molecules and giving his internal structure a sand-like appearance. Sand becomes Flint's hand, and a fierce wind blows away his fingers. The wind eats away his entire body, turning it to sand until he completely disintegrates. The cops arrive at the edge of the pit and look down to find the capacitors slowing down and that Flint is nowhere to be seen. Alone in a hospital corridor, the paper cup in his hand is stared at blankly by Peter. As a doctor approaches, he is looked up at and hurriedly stood by. The dark-haired, bearded doctor leaves, leaving Peter looking pensive. He takes a tentative step, passing the window of a private room and looks inside. In bed, Harry lies with a bandage wrapped around his head. He turns to face the doorway and smiles as Peter steps inside. Mary Jane comes in. Into the corridor, Mary Jane and Peter step. Peter appears relieved. In the room, a smile is given to Harry by the nurse. Large rocks roll and clink against each other. Seen from further away, gravel is what the rocks look more like, and from even further away the gravel reveals itself as millions of grains of sand which are swept along the floor of the pit like waves on a beach. A curving shape is formed by the sand, almost like a human body. As though to stand, the undulating shape rises up, then slumps down again. The shape reforms and slowly rises in the form of a human torso from the waist up. Flint is what it is, now transformed into Sandman. Arms are raised by Sandman and his bulky, paw-like hands are examined. He looks down at his body of sand, then holds his hands to his large, round head. At the mound of sand next to him, Sandman looks and spots the locket Penny gave him lying nearby. The locket is reached for by him to pick up, but the loose sand of his hand just crumbles around it. Again he reaches out, and his hand becomes more human, with slim, mobile fingers. Between his finger and thumb, he picks up the locket, then drops it into his palm. The locket opens, revealing Penny's picture inside. His hollow eyes look melancholy as Sandman gazes down at the picture. He clenches the locket in his fist and climbs up from the sand like a man hauling himself out of a swamp. As he finds his footing, he stumbles, then slowly steps forward, gradually becoming more human until exactly as he did before the change is how he looks, right down to his brown hair, green and black striped t-shirt, and beige chinos."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He attempts to escape but is struck by a capacitor, throwing him back onto the sand. The air thick with sand, he rises, trying to shield his face. High velocity sand hits his pores, shattering and merging with his molecules, giving him a sand-like appearance. Flint's hand turns to sand, fingers blown away by a fierce wind. His body becomes sand and disintegrates. Cops reach the pit’s edge; capacitors slow down with Flint gone. Peter, in a hospital corridor, stares at a paper cup. He stands as a doctor approaches, who then departs, leaving Peter pensive. Peter steps past a private room window, seeing Harry in bed with a head bandage. Harry smiles at Peter in the doorway. Mary Jane enters, and she and Peter step into the corridor with Peter looking relieved. A nurse smiles at Harry. Large rocks roll and clink, resembling gravel and then millions of sand grains sweeping like beach waves. The sand forms a human-like shape, rises, slumps, then reforms into a torso. It's Flint, now Sandman. He examines his sand body and tries to pick up Penny's locket, but his hand crumbles. He reaches again, his hand more human, and picks up the locket, seeing Penny's picture inside. Sandman’s hollow eyes turn melancholy as he looks at it. Clenching the locket, he rises like a man from a swamp, stumbling but gradually regaining his human form, complete with his brown hair, striped t-shirt, and beige chinos."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "As he tries to escape, a capacitor hits him, throwing him onto the sand. Sand flies into his pores, merging with his molecules, giving him a sand-like structure. Flint's hand turns to sand, and his body disintegrates in the wind. Cops arrive but find only slowing capacitors and no Flint. Peter, in a hospital corridor, stands as a bearded doctor leaves him looking pensive. Passing a room, he sees bandaged Harry smile as Peter enters. Mary Jane joins Peter in the corridor; he looks relieved. Rocks clink, turning into sand waves. The sand shapes into a human form, transforming into Sandman. Examining his sandy body, Sandman spots a locket nearby. His hand changes to human form, allowing him to pick it up. Seeing Penny's picture inside, he looks melancholic. Sandman climbs out of the sand, slowly regaining human form, appearing as he did before with brown hair, striped t-shirt, and chinos."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He attempts to make a quick escape, but one of the capacitors suddenly strikes him with force, propelling him backward onto the sandy surface. The atmosphere around him is heavily laden with swirling sand as he struggles to his feet, desperately trying to shield his face from the onslaught. Minute granules of sand, moving with high velocity, penetrate his pores and disintegrate into tiny fragments, merging with his very molecules and giving his internal structure a distinctly sand-like appearance. As this transformation progresses, Flint's hand morphs into sand, and his fingers are swept away by a fierce, unrelenting wind. His entire form gradually turns to sand and is consumed by the wind until he is entirely disintegrated. The police officers arrive at the edge of the pit and peer down to observe the capacitors gradually losing momentum, with no sign of Flint to be found. Meanwhile, Peter is seated alone in a hospital corridor, staring blankly at the paper cup he holds in his hand. When he looks up and sees a doctor approaching, he quickly stands up. The doctor, who has dark hair and a beard, leaves, leaving Peter looking thoughtful and pensive. With caution, he takes a step towards the window of a private room and peers inside. Inside, Harry is lying in bed, his head wrapped in a bandage. He turns his head to face the doorway, smiling as Peter enters the room. Shortly after, Mary Jane enters as well. Peter and Mary Jane step back into the corridor, with Peter visibly relieved. Inside the room, a nurse sends a friendly smile in Harry's direction. \n\nOut in the pit, large rocks roll and clink against one another with a resounding noise. Viewed from a greater distance, these rocks appear more like gravel, and from an even more distant perspective, the gravel reveals itself to consist of millions upon millions of grains of sand that sweep along the floor of the pit like waves gently lapping on a beach. The sand begins to form a curving shape, almost resembling a human body. This undulating shape rises as if attempting to stand, only to slump back down again. Gradually, the shape reforms and slowly ascends into the form of a human torso from the waist up. It is Flint, now transformed into the Sandman. Sandman raises his arms and examines his hands, which are now bulky and resemble paws. He looks down at his body made entirely of sand, then touches his large, round head with his hands. Sandman notices the mound of sand beside him and spots the locket that Penny once gave him lying in close proximity. He reaches out to pick up the locket, but the loose sand of his hand simply crumbles and falls around it. He tries once more, and this time his hand becomes more human-like, with slim, mobile fingers. Gently, he picks up the locket between his finger and thumb, then lets it fall into his open palm. As the locket falls open, it reveals a picture of Penny inside. Sandman's empty, hollow eyes appear melancholic as they gaze down at the picture. With determination, he clenches the locket tightly in his fist and begins to haul himself up from the sand like a man struggling to climb out of a deep swamp. He stumbles as he gains his balance, then gradually steps forward, slowly becoming more human until he looks exactly as he did before the transformation, right down to the brown hair, green and black striped t-shirt, and beige chinos that he was wearing before."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He tries to make a hasty escape, but without warning, one of the capacitors violently strikes him with such force that it propels him backward, sending him crashing onto the sandy terrain. The air surrounding him is thick and heavily laden with swirling sand, creating a turbulent atmosphere as he struggles to regain his footing, desperately attempting to shield his face from the relentless sandstorm. Tiny granules of sand, moving at a high velocity, penetrate his pores and break down into minuscule fragments, merging with his very molecules and giving his internal structure a distinctly sand-like appearance. As this unusual transformation progresses, Flint's hand morphs into sand, and his fingers are swept away by a fierce and unrelenting wind. His entire physical form gradually transforms into sand and is consumed by the swirling wind until he is completely disintegrated. At this moment, police officers arrive at the edge of the pit and peer down to observe the capacitors gradually losing momentum, with no sign of Flint to be seen. Meanwhile, Peter is seated all alone in a hospital corridor, gazing intently and blankly at the paper cup he holds in his hand. When he lifts his eyes and sees a doctor approaching, he quickly rises to his feet. The doctor, who has dark hair and a neatly trimmed beard, leaves, leaving Peter looking thoughtful and pensive. With caution and curiosity, he takes a step towards the window of a private room and peers inside. Inside, Harry lies in bed, his head wrapped in a bandage, turning his head to face the doorway and smiling warmly as Peter enters the room. Shortly afterward, Mary Jane makes her entrance as well. Peter and Mary Jane then step back into the hospital corridor, with Peter visibly showing signs of relief. Inside the room, a nurse offers a friendly and reassuring smile in Harry's direction. \n\nOut in the pit, large rocks roll and clink against one another with a resounding noise. Viewed from a greater distance, these rocks appear more like gravel, and from an even more distant perspective, the gravel reveals itself to consist of millions upon millions of grains of sand that sweep along the floor of the pit like waves gently lapping on a serene beach. The sand begins to form a curving shape, almost resembling a human body. This undulating shape rises as if attempting to stand, only to slump back down again. Gradually, the shape reforms and slowly ascends into the form of a human torso from the waist up. It is Flint, now transformed entirely into the Sandman. Sandman raises his arms and carefully examines his hands, which are now bulky and resemble large paws. He looks down at his body made entirely of sand, then touches his large, round head with his hands. Sandman notices the mound of sand beside him and catches sight of the locket that Penny once gave him lying in close proximity. He reaches out to pick up the locket, but the loose sand composing his hand simply crumbles and falls away around it. He tries once more, and this time his hand becomes more human-like, with slim, mobile fingers. With great care and gentleness, he picks up the locket between his finger and thumb, allowing it to fall into his open palm. As the locket falls open, it reveals a cherished picture of Penny inside. Sandman's empty, hollow eyes appear melancholic as they gaze down at the picture. With determination and resolve, he clenches the locket tightly in his fist and begins to haul himself up from the sand like a man struggling to climb out of a deep, treacherous swamp. He stumbles as he gains his balance, then gradually steps forward, slowly becoming more and more human until he looks exactly as he did before the transformation, right down to the brown hair, the green and black striped t-shirt, and the beige chinos he was wearing before."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As he attempts to run off, desperation in his stride, a capacitor careens through the air and strikes him with a formidable force, hurling him backward onto the gritty surface of the sand. As he impacts the ground, the air swirls with thick clouds of sand enveloping him in a dense, swirling mist. He painstakingly pushes himself up into a standing position, instinctively raising his hands to shield his face from the onslaught. In this chaotic moment, tiny grains of high-speed sand cascade onto his skin, embedding themselves into his pores with such intensity that they splinter into minuscule fragments. These particles fuse seamlessly with his very molecules, altering his internal structure, endowing it with a sand-like appearance. The transformation begins, and Flint's hand morphs into sand, his fingers disintegrating into the fierce gusts that whisk them away. His entire being succumbs to this metamorphosis as his body becomes a cascade of sand, which the unrelenting wind devours until he completely vanishes, dissolving into the air. Concurrently, police officers arrive at the pit's edge, peering down into the scene to find the capacitors gradually decelerating, yet Flint is nowhere in sight, rendering him a phantom in the swirling dust. Meanwhile, Peter occupies a solitary seat in a hospital corridor, his gaze fixated on the disposable paper cup cradled in his hands. As his mind races, he lifts his head, alerted by the approach of a doctor whose dark hair and beard suggest a man of authority and compassion. The doctor continues on his way, leaving Peter alone, steeped in contemplation. With a cautious step, Peter edges past a private room window and glances inside to find Harry lying serenely in a bed, his head swathed in a white bandage. As Peter steps inside, Harry turns his head, spotting Peter at the doorway, and offers a smile of recognition and friendship. Moments later, Mary Jane joins them, and together with Peter, they step back into the corridor. A sense of relief washes over Peter, his worries momentarily alleviated. Inside Harry's room, a nurse beams warmly at him, a silent testament to hope and healing. Meanwhile, in a distant location, large rocks begin to shift, rolling gently against one another, their movements producing a rhythmic clinking sound. Viewed from a greater distance, the rocks resemble gravel, and from an even further vantage point, this gravel reveals itself to be countless grains of sand. These grains sweep across the floor of the pit in a mesmerizing dance, akin to waves lapping at the shore. The sand gathers and begins to coalesce, forming a curving shape—an outline reminiscent of a human body. This undulating shape struggles, rising as though it seeks to stand before slumping back once more, only to reform again. Gradually, it rises, taking on the form of a human torso, emerging from the waist up. It is Flint, reborn as Sandman, asserting himself in this new guise. Sandman lifts his newly formed arms, inspecting his bulky, paw-like hands with a mixture of wonder and trepidation. As he surveys his body composed entirely of sand, he places his hands upon his large, rounded head, trying to process this extraordinary transformation. His gaze shifts to the mound of sand at his side, where he spots the locket that Penny once gave him. Determined, he extends his hand toward it, but the loose sand of his fingers fails him, crumbling away around the locket. Resolute, he reaches out once more, focusing his intent until his hand takes on a more human form, with slender, agile fingers capable of delicate movement. He captures the locket between his thumb and index finger, gently closing his grasp to drop it into his palm. The locket opens as it falls, and Penny's picture is revealed inside. Sandman's hollow eyes reflect a profound melancholy, fixated on the image of Penny, embodying all his lost hopes and dreams. He clenches the locket tightly within his fist, using it as an anchor to haul himself from the encircling sand, akin to a man extracting himself from the depths of a swamp. Upon finding his balance, he stumbles momentarily, gradually regaining his footing and stepping forward with increasing confidence. With each step, his form becomes more human, reverting to his original appearance—complete with his brown hair, familiar green and black striped t-shirt, and the beige chinos he once wore."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He attempts to flee, but a capacitor strikes him, hurling him back onto the sand. As he rises, sand fuses with his molecules, transforming his internal structure to resemble sand. Flint disintegrates entirely as his body turns into sand and is swept away by the wind. The police arrive at the pit's edge, observing the slowing capacitors and finding no trace of Flint. Meanwhile, Peter, sitting in a hospital corridor, stands as a doctor passes by. After a brief exchange, he peers into a private room, seeing Harry, who smiles at Peter's entrance. Mary Jane joins Peter, and they leave, with Peter appearing relieved. Inside, a nurse smiles at Harry. Elsewhere, gravel transitions into grains of sand, sweeping across the pit like waves, forming and reshaping into Flint, now Sandman. As Sandman, he inspects his new form, noticing the locket Penny gave him nearby. Attempting to pick it up, his hand initially crumbles but eventually reforms into a human-like appendage, allowing him to grasp the locket and see Penny's picture inside. His eyes reflect melancholy as he clutches the locket, then rises from the sand, gradually reverting to his original human form with his familiar appearance and clothing."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He tries to run off but one of the capacitors, which are devices used to store and release electrical energy, hits him, throwing him back onto the sand. The air is thick with sand as he gets to his feet, trying to shield his face. Tiny granules of high velocity sand fly into his pores and shatter into fragments, fusing with his own molecules, which eerily reminds one of the process by which silicosis, a lung disease caused by inhaling fine silica particles, occurs, giving his internal structure a sand-like appearance. Flint's hand becomes sand, and his fingers blow away in a fierce wind that sweeps through the arid landscape. His entire body turns to sand and is eaten away by the wind until he completely disintegrates, much like tales of ancient myths where characters dissolve into the elements. The cops arrive at the edge of the pit, an excavation site that was once bustling with machinery, and look down to find the capacitors slowing down and Flint nowhere to be seen. Peter sits alone in a hospital corridor, staring blankly at the paper cup in his hand, which is embossed with the logo of a well-known local coffee shop. He looks up and hurriedly stands as a doctor approaches, wearing a white coat adorned with the hospital's insignia. The dark-haired, bearded doctor goes, leaving Peter looking pensive, reflecting the weight of the situation. With a tentative step, he passes the window of a private room reserved for serious cases and looks inside. Harry is lying in bed with a bandage wrapped around his head, evidence of a recent accident or surgery. He turns to face the doorway and smiles as Peter steps inside, relieved to see a familiar face. Mary Jane comes in, her presence bringing a sense of comfort. Mary Jane and Peter step into the corridor, their footsteps echoing in the quiet hallway. Peter looks relieved, his body visibly relaxing. In the room, the nurse smiles at Harry, the kind smile one offers to patients as a part of their recovery process. Large rocks roll and clink against each other, reminiscent of geological shifts in a desert landscape. Seen from further away, the rocks look more like gravel, and from even further away the gravel reveals itself as millions of grains of sand which sweep along the floor of the pit like waves on a beach, a striking natural phenomenon. The sand forms a curving shape, almost like a human body. The undulating shape rises up as though to stand, then slumps down again, as if grappling with the struggle of reformation. The shape reforms and slowly rises in the form of a human torso from the waist up. It's Flint, now transformed into Sandman, a character from classic comics known for his ability to assume a sandy form. Sandman raises his arms and examines his bulky, paw-like hands with curiosity and a hint of nostalgia. He looks down at his body of sand, then holds his hands to his large, round head, feeling the gritty texture. Sandman looks at the mound of sand next to him and spots the locket Penny, his beloved daughter, gave him lying nearby. He reaches out to pick up the locket but the loose sand of his hand just crumbles around it, reflecting his struggle for control. He reaches out again and his hand becomes more human, with slim, mobile fingers. He picks up the locket between his finger and thumb, then drops it into his palm. The locket falls open, revealing Penny's picture inside, a poignant reminder of his past life. Sandman's hollow eyes look melancholy as they gaze down at the picture, filled with longing and regret. He clenches the locket in his fist and hauls himself up from the sand like a man climbing out of a swamp, determined and resolute. He stumbles as he finds his footing, then slowly steps forward, gradually becoming more human until he looks exactly as he did before the change, right down to his brown hair, green and black striped t-shirt, trademarked for its distinctive pattern, and beige chinos."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He tries to run off but one of the capacitors hits him throwing him back onto the sand. The air is thick with sand as he gets to his feet trying to shield his face. Tiny granules of high velocity sand fly into his pores and shatter into fragments fusing with his own molecules giving his internal structure a sandlike appearance. Flint's hand becomes sand and his fingers blow away in a fierce wind. His entire body turns to sand and is eaten away by the wind until he completely disintegrates. The cops arrive at the edge of the pit and look down to find the capacitors slowing down and Flint nowhere to be seen. Peter sits alone in a hospital corridor staring blankly at the paper cup in his hand. He looks up and hurriedly stands as a doctor approaches. The dark haired bearded doctor goes leaving Peter looking pensive. With a tentative step he passes the window of a private room and looks inside. Harry is lying in bed with a bandage wrapped around his head. He turns to face the doorway and smiles as Peter steps inside. Mary Jane comes in. Mary Jane and Peter step into the corridor. Peter looks relieved. In the room the nurse smiles at Harry. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Large rocks roll and clink against each other. Seen from further away the rocks look more like gravel and from even further away the gravel reveals itself as millions of grains of sand which sweep along the floor of the pit like waves on a beach. The sand forms a curving shape almost like a human body. The undulating shape rises up as though to stand then slumps down again. The shape reforms and slowly rises in the form of a human torso from the waist up. It is Flint now transformed into Sandman. Sandman raises his arms and examines his bulky pawlike hands. He looks down at his body of sand then holds his hands to his large round head. Sandman looks at the mound of sand next to him and spots the locket Penny gave him lying nearby. He reaches out to pick up the locket but the loose sand of his hand just crumbles around it. He reaches out again and his hand becomes more human with slim mobile fingers. He picks up the locket between his finger and thumb then drops it into his palm. The locket falls open revealing Penny's picture inside. Sandman's hollow eyes look melancholy as they gaze down at the picture. He clenches the locket in his fist and hauls himself up from the sand like a man climbing out of a swamp. He stumbles as he finds his footing then slowly steps forward gradually becoming more human until he looks exactly as he did before the change right down to his brown hair green and black striped tshirt and beige chinos."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He tries to run off but one of the capacitors hits him throwing him back onto the sand. The air is thick with sand as he gets to his feet trying to shield his face. Tiny granules of high velocity sand fly into his pores and shatter into fragments fusing with his own molecules giving his internal structure a sandlike appearance. Flint's hand becomes sand and his fingers blow away in a fierce wind. His entire body turns to sand and is eaten away by the wind until he completely disintegrates. The cops arrive at the edge of the pit and look down to find the capacitors slowing down and Flint nowhere to be seen. Peter sits alone in a hospital corridor staring blankly at the paper cup in his hand. He looks up and hurriedly stands as a doctor approaches. The dark haired bearded doctor goes leaving Peter looking pensive. With a tentative step he passes the window of a private room and looks inside. Harry is lying in bed with a bandage wrapped around his head. He turns to face the doorway and smiles as Peter steps inside. Mary Jane comes in. Mary Jane and Peter step into the corridor. Peter looks relieved. In the room the nurse smiles at Harry. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Large rocks roll and clink against each other. Seen from further away the rocks look more like gravel and from even further away the gravel reveals itself as millions of grains of sand which sweep along the floor of the pit like waves on a beach. The sand forms a curving shape almost like a human body. The undulating shape rises up as though to stand then slumps down again. The shape reforms and slowly rises in the form of a human torso from the waist up. It is Flint now transformed into Sandman. Sandman raises his arms and examines his bulky pawlike hands. He looks down at his body of sand then holds his hands to his large round head. Sandman looks at the mound of sand next to him and spots the locket Penny gave him lying nearby. He reaches out to pick up the locket but the loose sand of his hand just crumbles around it. He reaches out again and his hand becomes more human with slim mobile fingers. He picks up the locket between his finger and thumb then drops it into his palm. The locket falls open revealing Penny's picture inside. Sandman's hollow eyes look melancholy as they gaze down at the picture. He clenches the locket in his fist and hauls himself up from the sand like a man climbing out of a swamp. He stumbles as he finds his footing then slowly steps forward gradually becoming more human until he looks exactly as he did before the change right down to his brown hair green and black striped tshirt and beige chinos."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He tries to run off but one of the capacitors hits him throwing him back onto the sand. The air is thick with sand as he gets to his feet trying to shield his face. Tiny granules of high velocity sand fly into his pores and shatter into fragments fusing with his own molecules giving his internal structure a sandlike appearance. Flint's hand becomes sand and his fingers blow away in a fierce wind. His entire body turns to sand and is eaten away by the wind until he completely disintegrates. The cops arrive at the edge of the pit and look down to find the capacitors slowing down and Flint nowhere to be seen. Peter sits alone in a hospital corridor staring blankly at the paper cup in his hand. He looks up and hurriedly stands as a doctor approaches. Sandman looks at the mound of sand next to him and spots the locket Penny gave him lying nearby. He reaches out to pick up the locket but the loose sand of his hand just crumbles around it. He reaches out again and his hand becomes more human with slim mobile fingers. He picks up the locket between his finger and thumb then drops it into his palm. The locket falls open revealing Penny's picture inside. Sandman's hollow eyes look melancholy as they gaze down at the picture. He clenches the locket in his fist and hauls himself up from the sand like a man climbing out of a swamp. He stumbles as he finds his footing then slowly steps forward gradually becoming more human until he looks exactly as he did before the change right down to his brown hair green and black striped tshirt and beige chinos."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He tries to run off but one of the capacitors hits him throwing him back onto the sand. The air is thick with sand as he gets to his feet trying to shield his face. Tiny granules of high velocity sand fly into his pores and shatter into fragments fusing with his own molecules giving his internal structure a sandlike appearance. Flint's hand becomes sand and his fingers blow away in a fierce wind. Sandman's hollow eyes look melancholy as they gaze down at the picture. He clenches the locket in his fist and hauls himself up from the sand like a man climbing out of a swamp. He stumbles as he finds his footing then slowly steps forward gradually becoming more human until he looks exactly as he did before the change right down to his brown hair green and black striped tshirt and beige chinos."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The rabbit attempts to hop away but one of the transformers tosses it, flipping it back onto the leaves. The sky is dense with mist as it leaps to its hooves, endeavoring to shield its fur. Tiny droplets of high-speed mist dive into its feathers and explode into shards, merging with its own atoms, giving its external composition a mist-like texture. Blaze's paw becomes mist, and its claws drift away in a wild gust. Its whole frame turns to mist and is gnawed away by the breeze until it fully evaporates. The elephants arrive at the brink of the crater and peer down to find the transformers slowing down and Blaze nowhere to be discovered. Alex perches alone in a library aisle, fixing a dazed look at the plastic mug in its grasp. It glances up and quickly jumps as a teacher approaches. The blonde, clean-shaven teacher leaves, leaving Alex appearing contemplative. With a hesitant leap, it glides past the door of an exclusive suite and peers inside. Sam is resting in a hammock with a helmet encircling its ears. It rotates to face the entrance and grins as Alex strides inside. Chloe enters. Chloe and Alex glide into the aisle. Alex appears comforted. In the suite, the chef grins at Sam. Large pebbles tumble and clatter against each other. Seen from farther out, the pebbles resemble more like marbles, and from even farther out, the marbles reveal themselves as trillions of droplets of mist which swirl across the bottom of the crater like tides on a lake. The mist forms a looping shape, almost like an animal body. The rippling silhouette ascends as if to stand, then collapses down again. The outline reforms and gradually elevates in the guise of an animal torso from the waist up. It's Blaze, now transformed into Mistcat. Mistcat lifts its paws and inspects its heavy, paddle-like claws. It gazes down at its body of mist, then presses its claws to its enormous, oval ears. Mistcat examines the pile of mist beside it and detects the pendant Ruby offered it resting nearby. It extends to retrieve the pendant but the scattered mist of its claw merely disintegrates around it. It extends once more and its claw becomes more animal-like, with slender, flexible digits. It retrieves the pendant between its digit and pad, then lets it fall into its paw. The pendant pops open, displaying Ruby's portrait within. Mistcat's vacant gaze looks wistful as they contemplate the portrait. It clasps the pendant in its claw and drags itself up from the mist like an animal climbing out of a bog. It wobbles as it discovers its balance, then cautiously strides onward, progressively becoming more animal-like until it appears exactly as it did before the transformation, right down to its auburn mane, orange and white striped fur, and russet trousers."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "He tries to escape but is struck by a capacitor, causing him to fall onto the sand. Sand granules fuse with his body, transforming his structure to sand-like. Flint disintegrates in the wind until he vanishes. The police arrive to find the capacitors slowing and Flint gone. In a hospital, Peter waits anxiously and enters Harry's room, where Harry, bandaged, smiles at him. Mary Jane joins Peter, and he appears relieved. Meanwhile, sand grains in the pit merge into a human shape as Flint becomes Sandman, examining his sand-formed body. Spotting a locket from Penny, he struggles to pick it up until his hand becomes human-like. Sandman gazes at Penny's picture, appearing melancholic, before regaining human form and emerging from the sand."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He stumbles as he finds his footing then slowly steps forward gradually becoming more human until he looks exactly as he did before the change right down to his brown hair green and black striped tshirt and beige chinos He clenches the locket in his fist and hauls himself up from the sand like a man climbing out of a swamp Sandman's hollow eyes look melancholy as they gaze down at the picture The locket falls open revealing Penny's picture inside He picks up the locket between his finger and thumb then drops it into his palm He reaches out again and his hand becomes more human with slim mobile fingers He reaches out to pick up the locket but the loose sand of his hand just crumbles around it Sandman looks at the mound of sand next to him and spots the locket Penny gave him lying nearby He looks down at his body of sand then holds his hands to his large round head Sandman raises his arms and examines his bulky pawlike hands It is Flint now transformed into Sandman The shape reforms and slowly rises in the form of a human torso from the waist up The undulating shape rises up as though to stand then slumps down again The sand forms a curving shape almost like a human body Seen from further away the rocks look more like gravel and from even further away the gravel reveals itself as millions of grains of sand which sweep along the floor of the pit like waves on a beach Large rocks roll and clink against each other In the room the nurse smiles at Harry Peter looks relieved Mary Jane and Peter step into the corridor Mary Jane comes in He turns to face the doorway and smiles as Peter steps inside Harry is lying in bed with a bandage wrapped around his head With a tentative step he passes the window of a private room and looks inside The dark haired bearded doctor goes leaving Peter looking pensive He looks up and hurriedly stands as a doctor approaches Peter sits alone in a hospital corridor staring blankly at the paper cup in his hand The cops arrive at the edge of the pit and look down to find the capacitors slowing down and Flint nowhere to be seen His entire body turns to sand and is eaten away by the wind until he completely disintegrates Flint's hand becomes sand and his fingers blow away in a fierce wind Tiny granules of high velocity sand fly into his pores and shatter into fragments fusing with his own molecules giving his internal structure a sandlike appearance The air is thick with sand as he gets to his feet trying to shield his face He tries to run off but one of the capacitors hits him throwing him back onto the sand"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The air is thick with sand as he gets to his feet trying to shield his face He tries to run off but one of the capacitors hits him throwing him back onto the sand Flint's hand becomes sand and his fingers blow away in a fierce wind Tiny granules of high velocity sand fly into his pores and shatter into fragments fusing with his own molecules giving his internal structure a sandlike appearance The cops arrive at the edge of the pit and look down to find the capacitors slowing down and Flint nowhere to be seen His entire body turns to sand and is eaten away by the wind until he completely disintegrates He looks up and hurriedly stands as a doctor approaches Peter sits alone in a hospital corridor staring blankly at the paper cup in his hand With a tentative step he passes the window of a private room and looks inside The dark haired bearded doctor goes leaving Peter looking pensive He turns to face the doorway and smiles as Peter steps inside Harry is lying in bed with a bandage wrapped around his head Mary Jane and Peter step into the corridor Mary Jane comes in In the room the nurse smiles at Harry Peter looks relieved Seen from further away the rocks look more like gravel and from even further away the gravel reveals itself as millions of grains of sand which sweep along the floor of the pit like waves on a beach Large rocks roll and clink against each other The undulating shape rises up as though to stand then slumps down again The sand forms a curving shape almost like a human body It is Flint now transformed into Sandman The shape reforms and slowly rises in the form of a human torso from the waist up He looks down at his body of sand then holds his hands to his large round head Sandman raises his arms and examines his bulky pawlike hands He reaches out to pick up the locket but the loose sand of his hand just crumbles around it Sandman looks at the mound of sand next to him and spots the locket Penny gave him lying nearby He picks up the locket between his finger and thumb then drops it into his palm He reaches out again and his hand becomes more human with slim mobile fingers Sandman's hollow eyes look melancholy as they gaze down at the picture The locket falls open revealing Penny's picture inside He stumbles as he finds his footing then slowly steps forward gradually becoming more human until he looks exactly as he did before the change right down to his brown hair green and black striped tshirt and beige chinos He clenches the locket in his fist and hauls himself up from the sand like a man climbing out of a swamp"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Large rocks roll and clink against each other Seen from further away the rocks look more like gravel and from even further away the gravel reveals itself as millions of grains of sand which sweep along the floor of the pit like waves on a beach The sand forms a curving shape almost like a human body The undulating shape rises up as though to stand then slumps down again The shape reforms and slowly rises in the form of a human torso from the waist up It is Flint now transformed into Sandman Sandman raises his arms and examines his bulky pawlike hands He looks down at his body of sand then holds his hands to his large round head Sandman looks at the mound of sand next to him and spots the locket Penny gave him lying nearby He reaches out to pick up the locket but the loose sand of his hand just crumbles around it He reaches out again and his hand becomes more human with slim mobile fingers He picks up the locket between his finger and thumb then drops it into his palm The locket falls open revealing Penny's picture inside Sandman's hollow eyes look melancholy as they gaze down at the picture He clenches the locket in his fist and hauls himself up from the sand like a man climbing out of a swamp He stumbles as he finds his footing then slowly steps forward gradually becoming more human until he looks exactly as he did before the change right down to his brown hair green and black striped tshirt and beige chinos He tries to run off but one of the capacitors hits him throwing him back onto the sand The air is thick with sand as he gets to his feet trying to shield his face Tiny granules of high velocity sand fly into his pores and shatter into fragments fusing with his own molecules giving his internal structure a sandlike appearance Flint's hand becomes sand and his fingers blow away in a fierce wind His entire body turns to sand and is eaten away by the wind until he completely disintegrates The cops arrive at the edge of the pit and look down to find the capacitors slowing down and Flint nowhere to be seen Peter sits alone in a hospital corridor staring blankly at the paper cup in his hand He looks up and hurriedly stands as a doctor approaches The dark haired bearded doctor goes leaving Peter looking pensive With a tentative step he passes the window of a private room and looks inside Harry is lying in bed with a bandage wrapped around his head He turns to face the doorway and smiles as Peter steps inside Mary Jane comes in Mary Jane and Peter step into the corridor Peter looks relieved In the room the nurse smiles at Harry"
        }
      ]
    }
  ]
}