{
  "ground_truth": "Peter smiles and looks at the ring, then slips it into the pocket of his jeans before opening the door to Mary Jane, who holds up a newspaper. He gives her a warm, guarded smile as she sits down. Peter smiles feebly, and Mary Jane nods sadly, then looks down dejectedly. Peter, in his Spider-Man suit, gives her a little smile before putting on his head mask and leaping out of the window. Mary Jane stands up, gathers her bag, scarf, and newspaper, and goes for the door. Across the room, the black spider-like tendril crawls across a cabinet behind her but freezes when she looks around. She leaves the apartment, and the slimy, black mass drops to the floor. On a city street, two cops look up to the sky as a huge, towering jib crane swings around, its driver struggling with the controls. Meanwhile, Gwen is part of a photo shoot in an office, and the photographer checks his shot. Gwen and the other two models turn to the window as an enormous steel girder hanging from a chain swings towards them; they throw themselves to the floor as the girder smashes through the window, ripping out the supports along one corner of the building. A desk and other debris plummet to the ground. Captain Stacy arrives on the scene as, in the devastated office, Gwen helps another model up. The huge yellow jeep of the crane swings back towards the office, smashing out the supports beneath it. The office floor gives way, and desks and furniture tip out through the smashed windows. Gwen slides down the tilting floor and just manages to hang onto a telephone cable, but the cable snaps, and she clings onto the very edge of the floor. A blonde-haired young guy runs up behind Captain Stacy and starts taking photos, but Stacy grabs the guy's camera and looks up at his daughter through the telephoto lens. Gwen's eyes widen in horror as a desk slides towards her; she releases her grip on the floor but manages to grab onto a long metal rail just below. As Spider-Man approaches, swinging from building to building, the metal rail falls loose from the wall and buckles, swinging Gwen out above the streets hundreds of feet below. As Spider-Man swings and leaps towards the skyscraper, the crane's jib rips out through the building, sending huge chunks of metal toward him. Dodging the debris, Spider-Man just manages to catch Gwen, saving her from being crushed by two clashing slabs of concrete. Spider-Man swings down to the pavement with Gwen in his arms, and Gwen hugs her dad. As Spider-Man swings away, Gwen gazes after him. In his office at the Daily Bugle, J. Jonah Jameson is in a meeting with a marketing guy.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Peter grins and gazes at the band, then slides it into the pocket of his denim before opening the portal to Mary Jane, who raises a periodical. He grants her a cordial, cautious grin as she perches down. Peter grins weakly, and Mary Jane acknowledges sadly, then gazes down dejectedly. Peter, in his Spider-Man attire, grants her a slight grin before donning his head covering and vaulting out of the aperture. Mary Jane rises, gathers her sack, scarf, and periodical, and goes for the portal. Across the chamber, the ebony arachnid-like tendril creeps across a cupboard behind her but halts when she glances around. She departs the dwelling, and the viscous, ebony mass plummets to the ground. On a municipality avenue, two constables gaze up to the sky as a gigantic, towering jib derrick swings around, its operator grappling with the controls. Meanwhile, Gwen is part of a photo session in a bureau, and the cameraman verifies his shot. Gwen and the other two mannequins turn to the aperture as an immense steel beam hanging from a chain swings towards them; they cast themselves to the ground as the beam shatters through the aperture, tearing out the supports along one corner of the structure. A desk and other rubble plunge to the ground. Captain Stacy arrives on the site as, in the ravaged bureau, Gwen assists another mannequin up. The massive yellow jeep of the derrick swings back towards the bureau, shattering out the supports beneath it. The bureau floor yields, and desks and furnishings tip out through the shattered apertures. Gwen slides down the slanting floor and just manages to cling onto a telephone wire, but the wire snaps, and she clutches onto the very brink of the floor. A blonde-haired youthful guy sprints up behind Captain Stacy and starts taking pictures, but Stacy seizes the guy's camera and gazes up at his daughter through the telephoto lens. Gwen's eyes widen in terror as a desk slides towards her; she releases her grip on the floor but manages to grab onto a long metal rod just below. As Spider-Man approaches, swinging from edifice to edifice, the metal rod falls loose from the barrier and buckles, swinging Gwen out above the avenues hundreds of feet below. As Spider-Man swings and leaps towards the skyscraper, the derrick's jib rips out through the structure, sending gigantic chunks of metal toward him. Evading the rubble, Spider-Man just manages to capture Gwen, saving her from being crushed by two clashing slabs of stone. Spider-Man swings down to the sidewalk with Gwen in his arms, and Gwen embraces her father. As Spider-Man swings away, Gwen gazes after him. In his bureau at the Daily Bugle, J. Jonah Jameson is in a conference with a marketing guy."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The ring is smiled at and looked at by Peter, then it is slipped into the pocket of his jeans before the door to Mary Jane is opened by him, and a newspaper is held up by her. A warm, guarded smile is given by him as she sits down. A feeble smile is smiled by Peter, and Mary Jane sadly nods, then her gaze is lowered dejectedly. While in his Spider-Man suit, a little smile is given by Peter before his head mask is put on and he leaps out of the window. Mary Jane stands up, gathers her bag, scarf, and newspaper, and goes for the door. A black spider-like tendril is crawled across a cabinet behind her by it but it freezes when she looks around. The apartment is left by her, and the slimy, black mass drops to the floor. On a city street, the sky is looked up to by two cops as a huge, towering jib crane is swung around, with its controls being struggled with by the driver. Meanwhile, a photo shoot in an office involves Gwen, and the shot is checked by the photographer. Gwen and the other two models turn to the window as an enormous steel girder hanging from a chain swings towards them; the floor is thrown at by them as the girder smashes through the window, ripping out the supports along one corner of the building. A desk and other debris plummet to the ground. Captain Stacy arrives on the scene as Gwen helps another model up in the devastated office. The huge yellow jeep of the crane swings back towards the office, smashing out the supports beneath it. The office floor gives way, desks and furniture being tipped out through the smashed windows. The tilting floor is slid down by Gwen, who just manages to hang onto a telephone cable, but when the cable snaps, the very edge of the floor is clung onto by her. A blonde-haired young guy runs up behind Captain Stacy and takes photos, but the guy's camera is grabbed by Stacy, who looks up at his daughter through the telephoto lens. Gwen's eyes widen in horror as a desk slides towards her; her grip on the floor is released by her but she manages to grab onto a long metal rail just below. As Spider-Man approaches, swinging from building to building, the metal rail falls loose from the wall and buckles, swinging Gwen out above the streets hundreds of feet below. While Spider-Man swings and leaps towards the skyscraper, the crane's jib is ripped out through the building, sending huge chunks of metal toward him. Dodging the debris, Gwen is just managed to be caught by Spider-Man, saving her from being crushed by two clashing slabs of concrete. Gwen is swung down to the pavement by Spider-Man with her in his arms, and her dad is hugged by Gwen. As Spider-Man swings away, he is gazed after by Gwen. In his office at the Daily Bugle, a meeting with a marketing guy is attended by J. Jonah Jameson."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Peter smiles at the ring and slips it into his jeans pocket before opening the door for Mary Jane, who holds a newspaper. He gives her a warm, cautious smile as she sits. Peter smiles weakly, and Mary Jane nods sadly, looking down. In his Spider-Man suit, Peter smiles at her before donning his mask and leaping out the window. Mary Jane stands, gathers her things, and heads for the door; a black tendril freezes when she looks around. She leaves, and the black mass drops to the floor. On a street, two cops watch a crane as its driver struggles with the controls. Gwen is in a photo shoot when a steel girder swings through the window, tearing out the building's corner supports. Debris plummets, and Captain Stacy arrives as Gwen helps another model. The crane swings back, smashing the supports, and desks tumble out. Gwen slides down the tilting floor, hanging onto a telephone cable that snaps; she clings to the edge. A blonde guy takes photos, but Stacy grabs his camera and looks at his daughter through the lens. Gwen's eyes widen as a desk slides toward her; she lets go but grabs a metal rail. As Spider-Man swings close, the rail buckles, and Gwen swings out over the street. Spider-Man dodges debris and catches Gwen, saving her from clashing concrete. He lands with Gwen, who hugs her dad, and she watches Spider-Man swing away. In his office, J. Jonah Jameson meets with a marketing guy."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Peter smiles at the ring, pockets it, and opens the door for Mary Jane, who holds a newspaper. He smiles warmly but guardedly as she sits, and they exchange sad looks. Peter, dressed as Spider-Man, smiles briefly before leaping out the window. Mary Jane collects her items and leaves the apartment, unaware of a black tendril on a cabinet. Outside, two cops observe a crane's driver struggling with controls. In an office, Gwen poses for a photo shoot when a swinging steel girder smashes through the window, causing debris to fall. Captain Stacy arrives as Gwen helps another model, and the crane strikes again. Gwen slides down the floor, clings to a cable, which snaps, and grabs a metal rail as Spider-Man arrives. The rail falls, swinging Gwen above the street. Spider-Man dodges falling debris to catch Gwen, saving her from being crushed. He swings her to safety, and she hugs her dad while watching Spider-Man leave. At the Daily Bugle, J. Jonah Jameson meets with a marketing guy."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Peter’s face lights up with a smile as he gazes at the ring in his hand. After admiring it for a moment, he carefully slips it into the pocket of his jeans with a sense of purpose. He then turns his attention to the door where Mary Jane stands, holding a newspaper. Offering her a warm yet cautious smile, he watches as she enters the room and takes a seat. Peter's expression falters into a feeble smile, while Mary Jane nods with an air of sadness, casting her eyes downward in a display of dejection.\n\nDressed in his distinctive Spider-Man suit, Peter manages to give her a small smile, a gesture of reassurance, before putting on his head mask and launching himself dramatically out of the window. Meanwhile, Mary Jane rises from her seat, gathering her belongings—her bag, scarf, and the newspaper—before making her way towards the door. In the distance, a black spider-like tendril creeps stealthily across a cabinet behind her. It freezes abruptly when she turns her head to glance around the room. After she exits the apartment, the slick, black mass slithers down and falls to the floor.\n\nOutside, on a bustling city street, two police officers gaze upwards, taken by surprise as a massive, towering jib crane swings widely. Its operator is visibly struggling with the controls, trying to regain command of the situation. At the same time, inside an office, Gwen is involved in a vibrant photo shoot, with a photographer meticulously reviewing his latest shot. Suddenly, Gwen and the two other models are drawn to the alarming scene at the window, where an enormous steel girder, suspended by a chain, is hurtling towards them. Quick to react, they throw themselves to the floor just as the girder crashes through the window, forcefully ripping out the building's supports from one of its corners, sending a desk and assorted debris tumbling violently to the street below.\n\nCaptain Stacy quickly arrives at the chaotic scene as Gwen, amid the wreckage of the office, assists another model in standing. The towering yellow jeep of the crane swings back with frightening momentum towards the office, further undermining the building's structural supports. With a creak, the office floor begins to give way, causing desks and furniture to tumble out through the smashed windows. Gwen slides rapidly down the inclining floor, clinging desperately to a telephone cable. But the cable gives way, snapping, leaving her hanging perilously from the very edge of the damaged floor. \n\nA young man with blonde hair runs up behind Captain Stacy, eagerly snapping photographs of the unfolding disaster. Stacy, spotting the danger his daughter is in, snatches the camera to look through the telephoto lens. Gwen, panic-stricken, widens her eyes in horror as a desk skids towards her precarious position. She releases her hold on the floor, but, in a moment of quick thinking, she manages to grab onto a sturdy metal rail just below. Spider-Man, swinging through the skyline from building to building, approaches swiftly. But just as he nears, the metal rail detaches, leaving Gwen dangling hundreds of feet above the streets below. \n\nAs Spider-Man closes in, the crane's jib tears through the building once more, sending an avalanche of massive metal pieces hurtling towards him. With agility and precision, Spider-Man dodges the debris, reaching Gwen just in time to catch her in mid-air, saving her from the deadly collision of two massive slabs of concrete. Swinging down to safety, he brings Gwen gently to the pavement below, where she is reunited with her father, embracing him with relief. As Spider-Man swings away into the distance, Gwen watches him with gratitude and admiration. Meanwhile, in the busy office at the Daily Bugle, J. Jonah Jameson is engrossed in a tense meeting with a marketing professional, seemingly unaware of the heroics taking place outside."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Peter's face lights up with a radiant smile as he gazes intently at the beautiful ring he holds delicately in his hand. After taking a moment to admire its sparkling beauty, he carefully slips it into the pocket of his jeans with a clear sense of purpose. He then turns his attention toward the door where Mary Jane stands, holding a newspaper in her hands. Offering her a warm yet cautious smile, he watches with a mix of anticipation and apprehension as she enters the room and takes a seat. Peter's expression shifts, his smile fading into a feeble attempt at reassurance, while Mary Jane nods with an air of sadness, casting her eyes downward in a poignant display of dejection.\n\nClad in his distinctive Spider-Man suit, Peter manages to muster a small smile, a gesture meant to reassure her, before putting on his head mask and launching himself dramatically out of the window. Meanwhile, Mary Jane rises from her seat, slowly gathering her belongings—her bag, scarf, and the newspaper—before making her way toward the door. In the background, a black, spider-like tendril creeps stealthily across a cabinet behind her. It freezes abruptly when she turns her head to glance around the room, as if sensing her presence. After she exits the apartment, the slick, black mass slithers down the cabinet and falls soundlessly to the floor.\n\nOut on the bustling city street below, two police officers gaze upwards, taken by surprise as a massive, towering jib crane swings widely above them. Its operator is visibly struggling with the controls, desperately trying to regain command of the unwieldy machinery. At the same time, inside a busy office, Gwen is involved in a vibrant photo shoot, with a photographer meticulously reviewing his latest shot on the camera. Suddenly, Gwen and the two other models are drawn to the alarming scene at the window, where an enormous steel girder, suspended precariously by a chain, is hurtling toward them. Quick to react, they throw themselves to the floor just as the girder crashes through the window, forcefully ripping out the building's supports from one of its corners, and sending a desk along with assorted debris tumbling violently to the street below.\n\nCaptain Stacy quickly arrives at the scene of chaos as Gwen, amid the wreckage of the office, aids another model in getting back on her feet. The towering yellow jib of the crane swings back with frightening momentum toward the office space, further undermining the building's precarious structural supports. With a creak, the office floor begins to give way, causing desks and furniture to tumble out through the smashed windows. Gwen slides rapidly down the inclining floor, clinging desperately to a telephone cable. But the cable suddenly gives way, snapping abruptly, leaving her hanging perilously from the very edge of the damaged floor.\n\nA young man with blonde hair runs up behind Captain Stacy, eagerly snapping photographs of the unfolding disaster with his camera. Stacy, spotting the danger his daughter finds herself in, snatches the camera from the young man to look through the telephoto lens, his heart pounding. Gwen, panic-stricken, widens her eyes in sheer horror as a heavy desk skids threateningly toward her precarious position. She releases her hold on the collapsing floor, but in a moment of quick thinking and bravery, she manages to grab onto a sturdy metal rail positioned just below her. Spider-Man, swinging energetically through the skyline from building to building, approaches with great speed. But just as he nears Gwen, the metal rail detaches unexpectedly, leaving her dangling helplessly hundreds of feet above the bustling streets below.\n\nAs Spider-Man draws closer, the crane's jib tears through the building once more, sending an avalanche of massive metal pieces hurtling dangerously toward him. With agility and precision honed through countless battles, Spider-Man expertly dodges the debris, reaching Gwen just in time to catch her in mid-air, saving her from the deadly collision of two massive slabs of concrete. Swinging down to safety, he brings Gwen gently to the pavement below, where she is immediately reunited with her father, embracing him with evident relief. As Spider-Man swings away into the distance, Gwen watches him with a deep sense of gratitude and admiration. Meanwhile, in the busy office at the Daily Bugle, J. Jonah Jameson remains engrossed in a tense meeting with a marketing professional, seemingly unaware of the remarkable heroics taking place outside."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Peter's face lights up with a smile as he gazes fondly at the ring, taking a moment to admire its significance before carefully slipping it into the secure confines of his jeans pocket. With a composed demeanor, he turns his attention to the door, which he opens to reveal Mary Jane standing there, holding up a newspaper. As she enters, he greets her with a warm yet cautious smile that hints at underlying concerns. Mary Jane finds a seat, and Peter's smile fades into a feeble one, prompting her to nod in acknowledgment with a sad expression before casting her eyes downward, overcome with dejection. Meanwhile, Peter, clad in his Spider-Man suit, offers her a small but reassuring smile, then proceeds to pull the head mask over his face with practiced ease and fluidly leaps out of the window, disappearing from view. Mary Jane rises from her seat, gathering her essential items—the bag, scarf, and newspaper—before making her way to the door. As she moves across the room, a black spider-like tendril creeps silently across a cabinet behind her, halting abruptly as she glances around the room. After confirming she is alone, she exits the apartment, leaving the tendril behind, which promptly drops to the floor in a slimy, black mass. On the bustling city street below, two police officers stand with their eyes fixed skyward, observing in alarm as a hulking jib crane swings erratically, its driver visibly struggling to gain control. Meanwhile, in a nearby office, Gwen is engaged in a vibrant photo shoot. As the photographer meticulously reviews his shot, Gwen, along with two other models, abruptly turns her attention to the window as an enormous steel girder suspended from a chain suddenly approaches them at a threatening angle. The models instinctively throw themselves to the floor, narrowly avoiding disaster as the girder crashes through the window with a deafening impact, mercilessly tearing through the structural supports of the building's corner. In the aftermath, a desk and various debris are sent hurtling groundward. Captain Stacy quickly arrives at the chaotic scene while, in the now-devastated office, Gwen, displaying resilience and composure, assists another model to her feet. Yet, danger persists as the yellow jeep of the crane swings menacingly back towards the office, obliterating the supports beneath it. The compromised office floor succumbs, tipping dangerously and spilling desks and furniture through the shattered windows. Gwen, caught in the perilous descent, slides down the tilted floor but manages to seize a hold of a telephone cable. However, it snaps with a sickening crack, leaving her desperately clinging to the very edge of the fragmented floor. At that moment, a young blonde-haired photographer rushes up behind Captain Stacy, snapping photos with fervor, until Stacy intervenes, grabbing the camera and directing the telephoto lens upward towards his daughter. Gwen's eyes widen with terror as a desk careens in her direction; acting on instinct, she lets go of her precarious grip on the floor and deftly latches onto a long metal rail just below. Meanwhile, Spider-Man, swinging with agility from one building to the next, rapidly approaches the scene. The metal rail, however, wrenches free from the wall, sending Gwen swinging perilously out above the bustling streets below. As Spider-Man propels himself through the air towards the skyscraper, the crane's jib violently erupts from the building, showering him with massive shards of metal. Exhibiting remarkable reflexes, Spider-Man maneuvers through the airborne debris, managing at the last possible moment to catch Gwen, rescuing her from the imminent danger of two enormous concrete slabs colliding. With Gwen securely in his grasp, Spider-Man elegantly descends to the safety of the pavement, where Gwen immediately embraces her father's comforting presence. As Spider-Man swings away into the cityscape, Gwen's gaze lingers on him, filled with gratitude and admiration. Meanwhile, in the bustling environment of his office at the Daily Bugle, J. Jonah Jameson engages in an intense meeting with a marketing executive, undeterred by the chaos unfolding outside."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Peter smiles at the ring, tucks it into his jeans pocket, and opens the door for Mary Jane, who holds a newspaper. They share a warm but guarded exchange as Mary Jane takes a seat and nods sadly, looking downcast. In his Spider-Man suit, Peter smiles slightly at her, dons his mask, and leaps out of the window. Mary Jane stands, gathers her things, and heads for the door. As she exits, a black spider-like tendril freezes behind her before dropping to the floor when she leaves. Meanwhile, on a city street, two cops watch a large jib crane whose driver struggles with the controls. In an office, Gwen is at a photo shoot when a steel girder swings toward them, crashing through the window and causing chaos. Gwen helps another model up as Captain Stacy arrives. The crane swings again, causing the floor to tilt and debris to fall. Gwen clings to a telephone cable, which snaps, leaving her on the edge of the floor. A young photographer runs up to Captain Stacy, who grabs the camera to locate Gwen through the lens. As Spider-Man approaches, the damaged crane sends debris toward him, but he dodges it, catching Gwen just in time to save her from falling and being crushed. Spider-Man safely brings Gwen to the pavement, where she hugs her father before Spider-Man swings away, leaving Gwen gazing after him. Elsewhere, J. Jonah Jameson is in a meeting with a marketing guy at the Daily Bugle."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Peter, standing in his small, cluttered apartment in Queens, smiles and looks at the ring, a family heirloom passed down through generations, then slips it into the pocket of his jeans before opening the door to Mary Jane, who holds up a newspaper emblazoned with headlines about Spider-Man. He gives her a warm, guarded smile as she sits down. Peter smiles feebly, aware of the burden of his double life, and Mary Jane nods sadly, then looks down dejectedly. Peter, in his Spider-Man suit, a symbol of New York City’s protector against countless threats, gives her a little smile before putting on his head mask and leaping out of the window. Mary Jane stands up, gathers her bag, scarf, and newspaper, and goes for the door. Across the room, the black spider-like tendril, a remnant of an alien symbiote discovered at an Oscorp lab, crawls across a cabinet behind her but freezes when she looks around. She leaves the apartment, and the slimy, black mass drops to the floor. On a bustling Manhattan street, two cops look up to the sky as a huge, towering jib crane, part of a nearby construction project on a new skyscraper, swings around, its driver struggling with the controls due to a sudden malfunction. Meanwhile, Gwen, an aspiring model, is part of a photo shoot in an office, and the photographer, known for his work with celebrity portraits, checks his shot. Gwen and the other two models turn to the window as an enormous steel girder, used in the building's framework, hanging from a chain, swings towards them; they throw themselves to the floor as the girder smashes through the window, ripping out the supports along one corner of the building. A desk and other debris plummet to the ground. Captain Stacy, a well-respected NYPD officer, arrives on the scene as, in the devastated office, Gwen helps another model up. The huge yellow jeep of the crane swings back towards the office, smashing out the supports beneath it, and the office floor gives way, tipping desks and furniture out through the smashed windows. Gwen slides down the tilting floor, desperately clutching onto a telephone cable, but the cable snaps, and she clings onto the very edge of the floor. A blonde-haired young guy, an aspiring freelance photographer hoping for a breakthrough, runs up behind Captain Stacy and starts taking photos, but Stacy grabs the guy's camera and, with a sense of urgency, looks up at his daughter through the telephoto lens. Gwen's eyes widen in horror as a desk slides towards her; she releases her grip on the floor but manages to grab onto a long metal rail just below. As Spider-Man approaches, swinging from building to building with agile precision, the metal rail falls loose from the wall and buckles, swinging Gwen out above the streets hundreds of feet below. As Spider-Man swings and leaps towards the skyscraper, the crane's jib rips out through the building, sending huge chunks of metal toward him. Dodging the debris with practiced skill, Spider-Man just manages to catch Gwen, saving her from being crushed by two clashing slabs of concrete. Spider-Man swings down to the pavement with Gwen in his arms, and Gwen hugs her dad, grateful for her miraculous rescue. As Spider-Man swings away, Gwen gazes after him, filled with admiration for her savior. In his office at the Daily Bugle, J. Jonah Jameson, the notoriously cantankerous editor-in-chief, is in a meeting with a marketing guy, strategizing about the paper's declining circulation in the digital age."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Peter smiles and looks at the ring then slips it into the pocket of his jeans before opening the door to Mary Jane who holds up a newspaper. He gives her a warm guarded smile as she sits down. Peter smiles feebly and Mary Jane nods sadly then looks down dejectedly. Peter in his SpiderMan suit gives her a little smile before putting on his head mask and leaping out of the window. Mary Jane stands up gathers her bag scarf and newspaper and goes for the door. Across the room the black spiderlike tendril crawls across a cabinet behind her but freezes when she looks around. She leaves the apartment and the slimy black mass drops to the floor. On a city street two cops look up to the sky as a huge towering jib crane swings around its driver struggling with the controls. Meanwhile Gwen is part of a photo shoot in an office and the photographer checks his shot. Gwen and the other two models turn to the window as an enormous steel girder hanging from a chain swings towards them. they throw themselves to the floor as the girder smashes through the window ripping out the supports along one corner of the building. A desk and other debris plummet to the ground. Captain Stacy arrives on the scene as in the devastated office. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Gwen helps another model up. The huge yellow jeep of the crane swings back towards the office smashing out the supports beneath it. The office floor gives way and desks and furniture tip out through the smashed windows. Gwen slides down the tilting floor and just manages to hang onto a telephone cable but the cable snaps and she clings onto the very edge of the floor. A blondehaired young guy runs up behind Captain Stacy and starts taking photos but Stacy grabs the guy's camera and looks up at his daughter through the telephoto lens. Gwen's eyes widen in horror as a desk slides towards her. she releases her grip on the floor but manages to grab onto a long metal rail just below. As SpiderMan approaches swinging from building to building the metal rail falls loose from the wall and buckles swinging Gwen out above the streets hundreds of feet below. As SpiderMan swings and leaps towards the skyscraper the crane's jib rips out through the building sending huge chunks of metal toward him. Dodging the debris SpiderMan just manages to catch Gwen saving her from being crushed by two clashing slabs of concrete. SpiderMan swings down to the pavement with Gwen in his arms and Gwen hugs her dad. As SpiderMan swings away Gwen gazes after him. In his office at the Daily Bugle J Jonah Jameson is in a meeting with a marketing guy."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Peter smiles and looks at the ring then slips it into the pocket of his jeans before opening the door to Mary Jane who holds up a newspaper. He gives her a warm guarded smile as she sits down. Peter smiles feebly and Mary Jane nods sadly then looks down dejectedly. Peter in his SpiderMan suit gives her a little smile before putting on his head mask and leaping out of the window. Mary Jane stands up gathers her bag scarf and newspaper and goes for the door. Across the room the black spiderlike tendril crawls across a cabinet behind her but freezes when she looks around. She leaves the apartment and the slimy black mass drops to the floor. On a city street two cops look up to the sky as a huge towering jib crane swings around its driver struggling with the controls. Meanwhile Gwen is part of a photo shoot in an office and the photographer checks his shot. Gwen and the other two models turn to the window as an enormous steel girder hanging from a chain swings towards them. they throw themselves to the floor as the girder smashes through the window ripping out the supports along one corner of the building. A desk and other debris plummet to the ground. Captain Stacy arrives on the scene as in the devastated office. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Gwen helps another model up. The huge yellow jeep of the crane swings back towards the office smashing out the supports beneath it. The office floor gives way and desks and furniture tip out through the smashed windows. Gwen slides down the tilting floor and just manages to hang onto a telephone cable but the cable snaps and she clings onto the very edge of the floor. A blondehaired young guy runs up behind Captain Stacy and starts taking photos but Stacy grabs the guy's camera and looks up at his daughter through the telephoto lens. Gwen's eyes widen in horror as a desk slides towards her. she releases her grip on the floor but manages to grab onto a long metal rail just below. As SpiderMan approaches swinging from building to building the metal rail falls loose from the wall and buckles swinging Gwen out above the streets hundreds of feet below. As SpiderMan swings and leaps towards the skyscraper the crane's jib rips out through the building sending huge chunks of metal toward him. Dodging the debris SpiderMan just manages to catch Gwen saving her from being crushed by two clashing slabs of concrete. SpiderMan swings down to the pavement with Gwen in his arms and Gwen hugs her dad. As SpiderMan swings away Gwen gazes after him. In his office at the Daily Bugle J Jonah Jameson is in a meeting with a marketing guy."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Peter smiles and looks at the ring then slips it into the pocket of his jeans before opening the door to Mary Jane who holds up a newspaper. He gives her a warm guarded smile as she sits down. Peter smiles feebly and Mary Jane nods sadly then looks down dejectedly. Peter in his SpiderMan suit gives her a little smile before putting on his head mask and leaping out of the window. Mary Jane stands up gathers her bag scarf and newspaper and goes for the door. Across the room the black spiderlike tendril crawls across a cabinet behind her but freezes when she looks around. She leaves the apartment and the slimy black mass drops to the floor. As SpiderMan approaches swinging from building to building the metal rail falls loose from the wall and buckles swinging Gwen out above the streets hundreds of feet below. As SpiderMan swings and leaps towards the skyscraper the crane's jib rips out through the building sending huge chunks of metal toward him. Dodging the debris SpiderMan just manages to catch Gwen saving her from being crushed by two clashing slabs of concrete. SpiderMan swings down to the pavement with Gwen in his arms and Gwen hugs her dad. As SpiderMan swings away Gwen gazes after him. In his office at the Daily Bugle J Jonah Jameson is in a meeting with a marketing guy."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Peter smiles and looks at the ring then slips it into the pocket of his jeans before opening the door to Mary Jane who holds up a newspaper. He gives her a warm guarded smile as she sits down. Peter smiles feebly and Mary Jane nods sadly then looks down dejectedly. SpiderMan swings down to the pavement with Gwen in his arms and Gwen hugs her dad. As SpiderMan swings away Gwen gazes after him. In his office at the Daily Bugle J Jonah Jameson is in a meeting with a marketing guy."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Oliver chuckles and glances at the necklace, then tucks it into the pouch of his hoodie before unlocking the gate to Felicity, who waves a magazine. He offers her a cheerful, cautious grin as she sinks into a chair. Oliver chuckles weakly, and Felicity agrees somberly, then gazes downward gloomily. Oliver, in his Cat-Man costume, gives her a tiny grin before securing his helmet and springing off the balcony. Felicity rises, collects her purse, hat, and magazine, and heads for the gate. Across the chamber, the gray snake-like vine slithers across a bookshelf behind her but halts when she peers around. She exits the flat, and the gooey, gray blob dribbles onto the carpet. On a suburban road, a pair of firefighters glance up to the clouds as a massive, swinging wrecking ball pivots around, its operator wrestling with the levers. Meanwhile, Zoe is engaged in an art project in a studio, and the sculptor reviews his work. Zoe and the other pair of artists turn to the skylight as an immense wooden beam tethered to a rope swings towards them; they dive to the floor as the beam crashes through the skylight, tearing away the brackets along one edge of the room. A shelf and other fragments tumble to the earth. Chief Roberts arrives at the location as, in the wrecked studio, Zoe assists another artist to her feet. The gigantic red truck of the wrecking ball swings back towards the studio, demolishing the beams beneath it. The studio surface crumbles, and shelves and decor tumble out through the shattered skylight. Zoe slides down the sloped surface and just manages to grasp a power cord, but the cord snaps, and she clutches onto the very brink of the surface. A brown-haired young fellow rushes up beside Chief Roberts and begins snapping pictures, but Roberts snatches the fellow's camera and peers up at his relative through the zoom lens. Zoe's eyes widen in terror as a shelf scrapes towards her; she lets go of the surface but succeeds in seizing a lengthy bar just beneath. As Cat-Man nears, swinging from tower to tower, the bar disengages from the frame and bends, swinging Zoe out above the avenues hundreds of feet below. As Cat-Man swings and jumps towards the high-rise, the wrecking ball's arm tears through the structure, hurling enormous masses of steel toward him. Evading the wreckage, Cat-Man barely manages to grab Zoe, saving her from being crushed by two colliding blocks of stone. Cat-Man descends to the ground with Zoe in his grasp, and Zoe embraces her father. As Cat-Man swings away, Zoe watches him depart. In his cubicle at the Local Gazette, Kenneth J. Jameson is in a conference with a branding consultant."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Peter, after admiring a ring, hides it in his jeans before greeting Mary Jane, who holds a newspaper. They share a somber moment before Peter, in his Spider-Man suit, leaps out the window. Mary Jane leaves, unaware of a black tendril that drops to the floor. On a city street, a crane malfunctions, endangering a photo shoot involving Gwen. A steel girder crashes through the office, causing chaos. Gwen, hanging onto a telephone cable, is in peril as it snaps. Captain Stacy arrives as Spider-Man navigates debris to save Gwen from falling. He swings her safely to the ground, where she embraces her dad and watches Spider-Man leave. Meanwhile, J. Jonah Jameson is in a meeting at the Daily Bugle."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "In his office at the Daily Bugle J Jonah Jameson is in a meeting with a marketing guy As SpiderMan swings away Gwen gazes after him SpiderMan swings down to the pavement with Gwen in his arms and Gwen hugs her dad Dodging the debris SpiderMan just manages to catch Gwen saving her from being crushed by two clashing slabs of concrete As SpiderMan swings and leaps towards the skyscraper the crane's jib rips out through the building sending huge chunks of metal toward him As SpiderMan approaches swinging from building to building the metal rail falls loose from the wall and buckles swinging Gwen out above the streets hundreds of feet below she releases her grip on the floor but manages to grab onto a long metal rail just below Gwen's eyes widen in horror as a desk slides towards her A blondehaired young guy runs up behind Captain Stacy and starts taking photos but Stacy grabs the guy's camera and looks up at his daughter through the telephoto lens Gwen slides down the tilting floor and just manages to hang onto a telephone cable but the cable snaps and she clings onto the very edge of the floor The office floor gives way and desks and furniture tip out through the smashed windows The huge yellow jeep of the crane swings back towards the office smashing out the supports beneath it Gwen helps another model up Captain Stacy arrives on the scene as in the devastated office A desk and other debris plummet to the ground they throw themselves to the floor as the girder smashes through the window ripping out the supports along one corner of the building Gwen and the other two models turn to the window as an enormous steel girder hanging from a chain swings towards them Meanwhile Gwen is part of a photo shoot in an office and the photographer checks his shot On a city street two cops look up to the sky as a huge towering jib crane swings around its driver struggling with the controls She leaves the apartment and the slimy black mass drops to the floor Across the room the black spiderlike tendril crawls across a cabinet behind her but freezes when she looks around Mary Jane stands up gathers her bag scarf and newspaper and goes for the door Peter in his SpiderMan suit gives her a little smile before putting on his head mask and leaping out of the window Peter smiles feebly and Mary Jane nods sadly then looks down dejectedly He gives her a warm guarded smile as she sits down Peter smiles and looks at the ring then slips it into the pocket of his jeans before opening the door to Mary Jane who holds up a newspaper"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He gives her a warm guarded smile as she sits down Peter smiles and looks at the ring then slips it into the pocket of his jeans before opening the door to Mary Jane who holds up a newspaper Peter in his SpiderMan suit gives her a little smile before putting on his head mask and leaping out of the window Peter smiles feebly and Mary Jane nods sadly then looks down dejectedly Across the room the black spiderlike tendril crawls across a cabinet behind her but freezes when she looks around Mary Jane stands up gathers her bag scarf and newspaper and goes for the door On a city street two cops look up to the sky as a huge towering jib crane swings around its driver struggling with the controls She leaves the apartment and the slimy black mass drops to the floor Gwen and the other two models turn to the window as an enormous steel girder hanging from a chain swings towards them Meanwhile Gwen is part of a photo shoot in an office and the photographer checks his shot A desk and other debris plummet to the ground they throw themselves to the floor as the girder smashes through the window ripping out the supports along one corner of the building Gwen helps another model up Captain Stacy arrives on the scene as in the devastated office The office floor gives way and desks and furniture tip out through the smashed windows The huge yellow jeep of the crane swings back towards the office smashing out the supports beneath it A blondehaired young guy runs up behind Captain Stacy and starts taking photos but Stacy grabs the guy's camera and looks up at his daughter through the telephoto lens Gwen slides down the tilting floor and just manages to hang onto a telephone cable but the cable snaps and she clings onto the very edge of the floor she releases her grip on the floor but manages to grab onto a long metal rail just below Gwen's eyes widen in horror as a desk slides towards her As SpiderMan swings and leaps towards the skyscraper the crane's jib rips out through the building sending huge chunks of metal toward him As SpiderMan approaches swinging from building to building the metal rail falls loose from the wall and buckles swinging Gwen out above the streets hundreds of feet below SpiderMan swings down to the pavement with Gwen in his arms and Gwen hugs her dad Dodging the debris SpiderMan just manages to catch Gwen saving her from being crushed by two clashing slabs of concrete In his office at the Daily Bugle J Jonah Jameson is in a meeting with a marketing guy As SpiderMan swings away Gwen gazes after him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Gwen helps another model up The huge yellow jeep of the crane swings back towards the office smashing out the supports beneath it The office floor gives way and desks and furniture tip out through the smashed windows Gwen slides down the tilting floor and just manages to hang onto a telephone cable but the cable snaps and she clings onto the very edge of the floor A blondehaired young guy runs up behind Captain Stacy and starts taking photos but Stacy grabs the guy's camera and looks up at his daughter through the telephoto lens Gwen's eyes widen in horror as a desk slides towards her she releases her grip on the floor but manages to grab onto a long metal rail just below As SpiderMan approaches swinging from building to building the metal rail falls loose from the wall and buckles swinging Gwen out above the streets hundreds of feet below As SpiderMan swings and leaps towards the skyscraper the crane's jib rips out through the building sending huge chunks of metal toward him Dodging the debris SpiderMan just manages to catch Gwen saving her from being crushed by two clashing slabs of concrete SpiderMan swings down to the pavement with Gwen in his arms and Gwen hugs her dad As SpiderMan swings away Gwen gazes after him In his office at the Daily Bugle J Jonah Jameson is in a meeting with a marketing guy Peter smiles and looks at the ring then slips it into the pocket of his jeans before opening the door to Mary Jane who holds up a newspaper He gives her a warm guarded smile as she sits down Peter smiles feebly and Mary Jane nods sadly then looks down dejectedly Peter in his SpiderMan suit gives her a little smile before putting on his head mask and leaping out of the window Mary Jane stands up gathers her bag scarf and newspaper and goes for the door Across the room the black spiderlike tendril crawls across a cabinet behind her but freezes when she looks around She leaves the apartment and the slimy black mass drops to the floor On a city street two cops look up to the sky as a huge towering jib crane swings around its driver struggling with the controls Meanwhile Gwen is part of a photo shoot in an office and the photographer checks his shot Gwen and the other two models turn to the window as an enormous steel girder hanging from a chain swings towards them they throw themselves to the floor as the girder smashes through the window ripping out the supports along one corner of the building A desk and other debris plummet to the ground Captain Stacy arrives on the scene as in the devastated office"
        }
      ]
    }
  ]
}