{
  "ground_truth": "The marketing guy slaps various slogans onto a whiteboard then smiles cockily at the grouchy newspaper editor. Jameson calms down and speaks into an intercom. Jameson looks through the window at his assistant and points to one of a dozen pill bottles. She nods. He opens it. He forces a calm face and presses the intercom. He smiles graciously at the marketing guy. Brock slips into Jameson's office. Puffing on a cigar, Jameson waves Betty away dismissively. In Times Square, a billboard displays the letters NY followed by a heart and a picture of Spider-Man. A silver-headed man comes up alongside him. Peter ponders. With a friendly smile, the man goes. Later, Harry's doddery old manservant, Bernard, embraces his young master. Peter hands Harry an old basketball. Peter steals the ball off Harry and bounces it back to him in the lavishly-furnished hallway. Grabbing the ball from Harry, Peter turns into Norman's study and stares at the chaise longue and remembers laying Norman's dead body on it. Harry looks at his father's portrait. Peter tosses the ball to Harry and knocks a vase over. Harry nimbly catches the vase in one hand and the ball in the other. Peter looks concerned. Mary Jane strides into the theater where she's working. She comes through to the auditorium and her step falters. Another actress is going through her moves on stage. The actress spots Mary Jane at the back of the auditorium. Sitting in a sea of empty seats, the producer and director follow the actress's awkward gaze. The director puts on a fake smile. The producer looks unconvinced by his own suggestion. Mary Jane's blue eyes well up and she turns and walks away. The artistic duo return to their seats. Outside the theater, a crowd has gathered. Mary Jane's glum expression melts away. She smiles as they applaud. Her smile quickly fades as she realizes the crowd is not for her. She looks up at Spider-Man swinging by with barely-failed resentment. She hurries through the crowd as her name is covered up on the theater front with the name of Andrea Rubin. Peter is standing amidst the delirious crowd, smiling to himself, drinking in the adulation. A marching band cuts through, with workers waving placards and balloons. Brock approaches Gwen in the throng. Peter snaps Mary Jane. She forces a cheery smile as he walks off. The smile drops as she watches him disappear into the crowd. Elsewhere, stoney-faced Flint is lumbering along the street. He tilts his head. Some grains of sand seep out of his ear. He brushes them off his shoulder as he passes through cops. The cops race to the front and back of a large tarpaulin-covered lorry.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The advertising fellow slaps assorted catchphrases onto a whiteboard then grins smugly at the surly newspaper editor. Jameson calms down and speaks into an intercom. Jameson peers through the window at his assistant and indicates to one of a dozen tablet bottles. She nods. He opens it. He forces a composed face and presses the intercom. He grins courteously at the advertising fellow. Brock slips into Jameson's office. Puffing on a cigar, Jameson waves Betty away dismissively. In Times Square, a billboard exhibits the letters NY followed by a heart and a picture of Spider-Man. A silver-headed gentleman comes up alongside him. Peter contemplates. With a genial smile, the gentleman departs. Later, Harry's doddery old servant, Bernard, embraces his young master. Peter hands Harry an old basketball. Peter pilfers the ball off Harry and bounces it back to him in the lavishly-furnished corridor. Snatching the ball from Harry, Peter turns into Norman's study and gazes at the chaise longue and recalls laying Norman's dead body on it. Harry regards his father's portrait. Peter tosses the ball to Harry and knocks a vase over. Harry skillfully catches the vase in one hand and the ball in the other. Peter looks worried. Mary Jane strides into the theater where she's working. She enters through to the auditorium and her step falters. Another actress is going through her moves on stage. The actress spots Mary Jane at the rear of the auditorium. Sitting in a sea of empty seats, the producer and director follow the actress's uneasy gaze. The director puts on a fake smile. The producer looks unconvinced by his own suggestion. Mary Jane's blue eyes well up and she turns and walks away. The artistic duo return to their seats. Outside the theater, a crowd has gathered. Mary Jane's glum expression melts away. She grins as they applaud. Her grin quickly fades as she realizes the crowd is not for her. She looks up at Spider-Man swinging by with barely-suppressed resentment. She hurries through the crowd as her name is covered up on the theater front with the name of Andrea Rubin. Peter is standing amidst the ecstatic crowd, smiling to himself, drinking in the adulation. A marching band cuts through, with workers waving placards and balloons. Brock approaches Gwen in the throng. Peter snaps Mary Jane. She forces a sunny smile as he walks off. The smile drops as she watches him vanish into the crowd. Elsewhere, stoney-faced Flint is lumbering along the street. He tilts his head. Some grains of sand seep out of his ear. He brushes them off his shoulder as he passes through officers. The officers race to the front and back of a large tarpaulin-covered truck."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The marketing guy slaps various slogans onto a whiteboard and then a cocky smile is given to the grouchy newspaper editor by him. Jameson is calmed down and an intercom is spoken into by him. Jameson looks through the window at his assistant and the pointing is done by him to one of a dozen pill bottles. She nods. It is opened by him. A calm face is forced by him and the intercom is pressed. A gracious smile is given to the marketing guy by him. Brock slips into Jameson's office. Puffing on a cigar, Betty is waved away dismissively by Jameson. In Times Square, the letters NY followed by a heart and a picture of Spider-Man are displayed on a billboard. A silver-headed man comes up alongside him. Peter ponders. With a friendly smile, the man departs. Later, Harry is embraced by his doddery old manservant, Bernard. An old basketball is handed to Harry by Peter. Harry has the ball stolen off him by Peter, who bounces it back to him in the lavishly-furnished hallway. The ball is grabbed from Harry by Peter, who turns into Norman's study and stares at the chaise longue, remembering laying Norman's dead body on it. A look is given to his father's portrait by Harry. The ball is tossed to Harry by Peter, and a vase is knocked over. The vase is nimbly caught in one hand and the ball in the other by Harry. A concerned look is given by Peter. Mary Jane strides into the theater where her work is being done. She comes through to the auditorium and a falter in her step is shown. Another actress is going through her moves on stage. Mary Jane is spotted at the back of the auditorium by the actress. Sitting in a sea of empty seats, the awkward gaze of the actress is followed by the producer and director. A fake smile is put on by the director. The producer doesn't believe his own suggestion. Mary Jane turns and walks away, her blue eyes welling up. The artistic duo return to their seats. Outside the theater, a crowd has gathered. Mary Jane's glum expression melts away. Applause is given to her and she smiles. Her smile quickly fades as the realization hits her that the crowd is not for her. A look up is given to Spider-Man swinging by with barely-failed resentment by her. Through the crowd, she hurries as her name is covered up on the theater front with the name of Andrea Rubin. Peter stands amidst the delirious crowd, smiling to himself, and drinking in the adulation. A marching band cuts through, with placards and balloons being waved by workers. Gwen is approached by Brock in the throng. Mary Jane is snapped by Peter. A cheery smile is forced by her as he walks off. The smile drops as she watches him disappear into the crowd. Elsewhere, Flint lumbers along the street with a stoney face. He tilts his head. Some grains of sand seep out of his ear and he brushes them off his shoulder as passage through cops is made by him. The cops race to the front and back of a lorry covered with a large tarpaulin."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The marketing guy writes slogans on a whiteboard, smiling smugly at a grouchy newspaper editor. Jameson calms and speaks into an intercom, points to one of many pill bottles through a window, and opens it. He composes himself, interacts with the intercom, and smiles at the marketing guy. Brock enters Jameson's office; Jameson waves Betty away, puffing on a cigar. In Times Square, a billboard shows \"NY,\" a heart, and Spider-Man's picture. A silver-haired man joins Peter, who ponders. The man smiles and leaves. Later, Bernard, Harry's old manservant, embraces Harry. Peter hands Harry a basketball, steals it, and bounces it back in a lavish hallway. Holding the ball, Peter enters Norman's study, recalling laying Norman's body on the chaise longue. Harry observes his father's portrait. Peter tosses the ball, knocking over a vase, but Harry catches both. Mary Jane enters the theater, faltering as another actress rehearses on stage. The actress notices Mary Jane, and the director smiles fakely. The producer looks unsure. Mary Jane's eyes well up, and she leaves. Outside, a crowd gathers, but she realizes the applause isn't for her as Spider-Man swings by. Hurrying, her name is replaced by Andrea Rubin's on the theater. Peter enjoys the adulation of the crowd. A marching band and workers with placards pass through. Brock approaches Gwen. Peter snaps Mary Jane, forcing a smile as he leaves. Her smile fades as he disappears. Elsewhere, Flint walks down the street, sand trickling from his ear, brushing it off as he passes cops rushing to a tarpaulin-covered lorry."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The marketing guy confidently writes slogans on a whiteboard and smiles at the grouchy editor, Jameson. Jameson indicates a pill bottle to his assistant and opens it. He smiles at the marketing guy as Brock enters. Smoking a cigar, Jameson dismisses Betty. In Times Square, a Spider-Man billboard is shown. A silver-haired man joins Peter, then leaves with a smile. Bernard embraces Harry, and Peter gives him a basketball. Peter takes the ball, reflects on Norman's death in the study, and accidentally knocks over a vase, which Harry catches. Mary Jane enters a theater as another actress performs. The director smiles falsely, and Mary Jane's eyes well with tears as she leaves, realizing the crowd outside isn't for her. Spider-Man swings by, and Peter enjoys the crowd's cheers. Brock approaches Gwen, and Peter photographs Mary Jane, who forces a smile. Elsewhere, Flint walks, brushes sand off, and passes police near a truck."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The marketing guy eagerly slaps a variety of eye-catching slogans onto the large, inviting surface of a whiteboard, then smiles cockily at the grouchy, unenthusiastic newspaper editor. Jameson takes a deep breath to calm himself down before he speaks directly into an intercom. Through the window, Jameson glances at his assistant and points decisively to one of the dozen pill bottles lined up. She nods in understanding. He opens the selected bottle. Maintaining a composed demeanor, he once again presses the intercom. Turning his attention back, he smiles graciously at the marketing guy. Brock quietly slips into Jameson's office. With a cigar puffed staunchly between his fingers, Jameson dismissively waves Betty away. In the bustling heart of Times Square, a massive billboard prominently displays the letters NY, followed by a symbolic heart and the iconic image of Spider-Man. A man with striking silver hair comes up alongside Peter. Peter stands there, deep in thought. With a friendly and inviting smile, the man moves on. Later, Harry's doddery old manservant, Bernard, lovingly embraces his young master. Peter hands over an aged basketball to Harry. With a playful move, Peter steals the ball from Harry and bounces it back to him along the lavishly-furnished hallway. Peter, grabbing the ball from Harry once more, turns into Norman's study, where he stares pensively at the chaise longue, remembering the somber moment of laying Norman's dead body on it. Harry glances up at his father's portrait. Peter tosses the ball to Harry, accidentally knocking a vase, but Harry nimbly catches both the delicate vase in one hand and the ball in the other. Peter looks on, concerned. Mary Jane strides confidently into the theater where she's working. As she enters the vast auditorium, her step briefly falters. On stage, another actress is rehearsing her moves. This actress notices Mary Jane lingering at the back of the empty auditorium. Seated among the sea of empty seats, the producer and director catch the actress's awkward gaze. The director forces a fake smile onto his face. The producer wears a look that suggests he is unconvinced by his own suggestions. Mary Jane, with her striking blue eyes welling up with emotion, turns and walks away. The artistic duo return their attention to the stage, resuming their seats. Outside the theater, a large crowd has gathered. Mary Jane's initially glum expression melts away, transforming into a smile as they begin to applaud. However, her smile quickly fades when she realizes the crowd's applause is not for her. She looks up, barely masking her resentment, at Spider-Man swinging by above. She hurries, weaving through the crowd as her name is covered up on the theater's frontage with the name of Andrea Rubin. Meanwhile, Peter stands amidst the delirious crowd, smiling to himself and basking in the adulation. A vivacious marching band cuts through the scene, accompanied by workers enthusiastically waving placards and balloons. Brock approaches Gwen amidst the thronging mass of people. As Peter captures a snapshot of Mary Jane, she forces a cheery smile for him, but it drops as soon as he walks off. She watches as he disappears into the bustling crowd. Elsewhere, stoney-faced and determined Flint is lumbering along the street. With a slight tilt of his head, some grains of sand seep out of his ear. He nonchalantly brushes them off his shoulder as he passes through the group of cops. The cops, acting quickly, race to cover the front and back of a large, tarpaulin-covered lorry."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The enthusiastic marketing guy eagerly begins his task, slapping a wide variety of eye-catching slogans onto the expansive, inviting surface of a large whiteboard. With a cocky smile plastered across his face, he boldly directs this gesture at the grouchy, decidedly unenthusiastic newspaper editor. Jameson, feeling the need for calm, takes a deep, grounding breath to settle himself before he articulates his thoughts directly into the intercom. Through the window, he casts a glance at his diligent assistant, pointing decisively to one particular pill bottle among a dozen neatly lined up. She nods in complete understanding of his choice. With a composed demeanor, he proceeds to open the bottle he has selected. Once more, maintaining his calm and collected persona, he presses the intercom button again, continuing his task. Turning his attention back to the room, he offers a gracious smile towards the marketing guy. Meanwhile, Brock quietly slips into Jameson's office. Holding a cigar firmly between his fingers, Jameson waves Betty away with a dismissive air. Within the bustling heart of Times Square, a massive and impressive billboard is prominently displaying the letters NY, followed by a symbolic heart and the iconic image of Spider-Man. A man with striking, eye-catching silver hair comes alongside Peter, who is standing there, lost in thought. With a friendly, inviting smile, the man moves on. Later, Harry's doddery old manservant, Bernard, lovingly embraces his young master with genuine affection. Peter hands over a somewhat aged basketball to Harry. With a playful maneuver, Peter manages to steal the ball right from Harry and playfully bounces it back to him along the lavishly-furnished hallway. Peter skillfully grabs the ball from Harry once more and turns into Norman's study, where he pauses to stare pensively at the chaise longue, remembering the somber, significant moment of laying Norman's lifeless body on it. Harry then glances up at his father's portrait above. Peter tosses the ball back to Harry, but in the process, he accidentally knocks a vase. However, Harry deftly catches both the delicate vase in one hand and the ball in the other. Peter watches on, visibly concerned. Mary Jane strides confidently into the theater where she is working. As she enters the vast, echoing auditorium, her step briefly falters. On stage, another actress is deeply engaged in rehearsing her moves. This actress notices Mary Jane lingering at the back of the otherwise empty auditorium. Seated amidst a sea of empty seats, the producer and director catch onto the actress's awkward gaze. The director forces a rather fake smile onto his face, while the producer wears an expression that suggests he remains unconvinced by his own suggestions. Mary Jane, with her striking, intense blue eyes welling up with emotion, turns away and walks off. The artistic duo return their focus to the stage, resuming their seats. Outside the theater, a large and animated crowd has gathered. Mary Jane's initially glum expression melts away, transforming into a smile as the assembled crowd begins to applaud. However, her smile swiftly fades when she realizes the applause is not meant for her. She looks up, barely managing to mask her resentment, as Spider-Man swings by overhead. She hurries away, weaving through the gathered crowd as her name is covered up on the theater's frontage with the name 'Andrea Rubin.' Meanwhile, Peter stands amidst the exuberant crowd, smiling to himself and basking in the waves of adulation. A vivacious marching band energetically cuts through the scene, accompanied by workers enthusiastically waving placards and balloons. Brock approaches Gwen amidst the mass of thronging people. As Peter captures a snapshot of Mary Jane, she forces a cheery smile just for him, but it drops away as soon as he walks off. She watches with a lingering look as he disappears into the ever-bustling crowd. Elsewhere, the stony-faced and determined Flint is steadily lumbering along the street. With a slight tilt of his head, some loose grains of sand casually seep out of his ear. As he passes through the group of alert cops, he nonchalantly brushes the sand off his shoulder. The cops, acting with quick precision, race to cover both the front and back of a large, tarpaulin-covered lorry."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The marketing guy confidently reaches for a stack of slogan cards, carefully selecting a few before energetically slapping each one onto the whiteboard, creating a makeshift collage of catchy phrases. He then turns to face the grouchy newspaper editor, allowing a smug smile to stretch across his face, reveling in his presentation's perceived brilliance. Jameson, the editor, takes a deep breath, attempting to suppress his frustration, and moves towards the intercom with a composed demeanor. He presses the button, speaks into the intercom, and then shifts his gaze through the window where his assistant is visible. He extends his arm and deliberately points towards one out of a dozen pill bottles lined up in perfect order. Catching his gesture, she acknowledges with a nod, prompting him to reach for the particular bottle, unscrew the cap, and pour a pill into his palm. Masking his inner turmoil, he puts on a serene expression again and reaches for the intercom once more, transmitting a message through it. He glances back at the marketing guy with an expression of gracious acknowledgment. Meanwhile, Brock enters Jameson's office discreetly. Jameson, with a cigar dangling from his mouth, waves his hand in a dismissive manner to signal Betty away. In the bustling heart of Times Square, an enormous billboard captures attention with bold letters spelling out \"NY\" followed by a heart and an image of Spider-Man. A silver-headed man approaches Peter, who stands in contemplation, lost in thought about the display. The man offers Peter a warm, genuine smile before taking his leave. Following this, Bernard, the elderly and slightly shaky manservant, warmly embraces his young master, Harry, expressing fondness and loyalty. Peter hands an old, slightly worn basketball to Harry, who accepts it with a hint of nostalgia. Peter swiftly intercepts the ball, dribbling it with practiced ease in the spacious, opulently-decorated hallway. He seizes the ball once more from Harry, veers into the study once belonging to Norman, and pauses with a deep gaze at the chaise longue, vividly recalling the grim memory of laying Norman's lifeless form upon it. Harry's eyes drift to the portrait of his father, filled with a mixture of emotions. Peter redirects his attention, tossing the basketball back to Harry, inadvertently causing a nearby vase to topple. Quick as a flash, Harry catches the vase with one hand while adeptly securing the ball with the other. Observing this, Peter's face becomes etched with concern. Elsewhere, Mary Jane strides purposefully into the theater where she is employed. Her determined pace falters as she enters the auditorium, catching sight of another actress rehearsing intently on stage. The actress, detecting Mary Jane's presence at the rear of the auditorium, pauses momentarily. Positioned among the empty rows of seats, the producer and director, seated together, follow the actress's line of sight, aware of Mary Jane's arrival. The director dons a hollow, performative smile, while the producer appears doubtful, his skepticism evident even to him. Overwhelmed by emotion, tears begin to form in Mary Jane's striking blue eyes, prompting her to turn away and exit the scene. As she departs, the artistic pair resume their positions, returning their focus to the stage. Outside the theater, a crowd has congregated, their lively chatter filling the air. Mary Jane's initial disappointment dissipates momentarily as she catches the crowd's applause, generating a brief smile. However, the smile quickly fades into a look of dejection as she realizes the applause is not meant for her. Her gaze follows upwards to where Spider-Man is dynamically swinging past, leaving her with a lingering sense of unfulfilled admiration. She pushes her way through the throng of people, her momentum driven by a mix of determination and discontent, as her name is gradually concealed on the theater marquee by that of Andrea Rubin. Amidst the jubilant crowd, Peter stands, blending in seamlessly, absorbing the enthusiastic atmosphere and quietly savoring the admiration directed towards Spider-Man. As a vibrant marching band parades through, workers enthusiastically wave placards and release colorful balloons into the sky. In the midst of this, Brock maneuvers through the gathering to connect with Gwen. Simultaneously, Peter captures an image of Mary Jane, who responds with a forced cheerful smile, maintaining the façade as he casually walks away. Her smile vanishes as she watches his retreating figure melt into the mass of people. Meanwhile, somewhere else in the city, Flint trudges along the pavement, his expression impassive. As he moves, he tilts his head slightly, allowing a few grains of sand to trickle out of his ear. With a nonchalant gesture, he brushes the sand from his shoulder, undeterred, as he seamlessly passes through a group of police officers. The officers, with resolute urgency, rush towards the front and rear of an imposing tarpaulin-covered truck, preparing to take action."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The marketing guy confidently presents various slogans on a whiteboard to the grouchy newspaper editor, prompting Jameson to calm down and interact with his assistant through the intercom. He discreetly gestures to a pill bottle, receives her affirmation, and maintains a composed demeanor before dismissing her as Brock enters. Puffing on a cigar, Jameson waves her away, while in Times Square, a billboard featuring NY, a heart, and Spider-Man illuminates the scene. A silver-headed man approaches Peter, who ponders briefly before the man departs with a smile. Later, Bernard warmly embraces Harry. In the lavishly-furnished hallway, Peter engages in a playful exchange, passing an old basketball to Harry and reminiscing in Norman's study. A vase nearly falls, but Harry deftly catches it and the ball, much to Peter's concern. Meanwhile, Mary Jane enters the theater studio, faltering as she spots another actress rehearsing. The director and producer, seated among empty seats, feign enthusiasm, sparking Mary Jane's tears as she exits, leaving them to resume their discussion. Outside, she momentarily brightens at the crowd's applause, but her smile fades upon realizing Spider-Man is the focus. Hurrying through the crowd, her name is being replaced on the theater marquee. Peter, amid the bustling crowd, basks in the celebration, unnoticed by the unhappy Mary Jane. A marching band parades, while Brock approaches Gwen. Peter captures Mary Jane's fleeting smile, which vanishes as he departs. Elsewhere, Flint stolidly walks down the street, brushing off grains of sand that escape from his ear while passing through a group of police officers who maneuver around a tarpaulin-covered lorry."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The marketing guy, known in the industry for his bold and often risky campaign strategies, slaps various slogans onto a whiteboard then smiles cockily at the grouchy newspaper editor, who is notorious for his short temper and critical reviews. Jameson, the editor-in-chief of a major New York City newspaper, calms down and speaks into an intercom used to communicate with his staff spread across the bustling office. Jameson looks through the window at his assistant and points to one of a dozen pill bottles, part of his prescribed regimen for managing stress-related hypertension. She nods knowingly, aware of his routine. He opens it with a practiced ease. He forces a calm face and presses the intercom to issue further instructions. He smiles graciously at the marketing guy, concealing his irritation. Brock, a rival journalist known for his ambitious nature, slips into Jameson's office. Puffing on a cigar, a habit originating from his early days in journalism when smoking was seen as a sign of authority, Jameson waves Betty, his loyal secretary, away dismissively. In Times Square, a world-famous commercial and entertainment hub in New York City, a billboard displays the letters NY followed by a heart and a picture of Spider-Man, a beloved local hero and symbol of hope. A silver-headed man, known for his insightful observations, comes up alongside him. Peter, Spider-Man's alter ego, ponders the implications of his public image. With a friendly smile, the man offers silent encouragement before going about his day. Later, Harry's doddery old manservant, Bernard, who has served the Osborn family for decades, embraces his young master with a grandfatherly warmth. Peter hands Harry an old basketball, a nostalgic relic from their high school days. Peter steals the ball off Harry and bounces it back to him in the lavishly-furnished hallway adorned with expensive artworks and antique furniture. Grabbing the ball from Harry, Peter turns into Norman's study and stares at the chaise longue, a luxurious piece of furniture, and remembers laying Norman's dead body on it during a tragic event. Harry looks at his father's portrait, a stern image that looms over the room. Peter tosses the ball to Harry and accidentally knocks a vase over, a delicate and costly item. Harry nimbly catches the vase in one hand and the ball in the other with practiced ease, preventing damage. Peter looks concerned, aware of the significance of the vase. Mary Jane strides into the theater where she's working as an actress, hoping to secure a lead role. She comes through to the auditorium and her step falters upon seeing another actress, her rival, going through her moves on stage. The actress spots Mary Jane at the back of the auditorium, acknowledging her presence with faint tension. Sitting in a sea of empty seats, the producer and director, key decision-makers in the production, follow the actress's awkward gaze. The director puts on a fake smile, masking underlying doubts. The producer, whose financial investment is at stake, looks unconvinced by his own suggestion that this casting choice is the right one. Mary Jane's blue eyes well up with disappointment, and she turns and walks away. The artistic duo, relieved by her departure, return to their seats to focus on the ongoing rehearsal. Outside the theater, a crowd has gathered for a promotional event. Mary Jane's glum expression melts away for a moment. She smiles as they applaud, mistaking the cheers as being for her. Her smile quickly fades as she realizes the crowd is not for her but for a special appearance by Spider-Man. She looks up at Spider-Man, revered across the city for his heroic deeds, swinging by with barely-failed resentment. She hurries through the crowd as her name is covered up on the theater front with the name of Andrea Rubin, an up-and-coming actress. Peter, standing amidst the delirious crowd that idolizes Spider-Man, smiles to himself, drinking in the adulation that comes with being a superhero. A marching band cuts through, providing lively entertainment, with workers waving placards and balloons to celebrate the day. Brock, eager for a story, approaches Gwen in the throng, sensing an opportunity. Peter snaps a picture of Mary Jane, capturing her forced cheery smile as he walks off to hide his own conflicting emotions. The smile drops as she watches him disappear into the crowd, aware of the widening gap between them. Elsewhere, stoney-faced Flint, a once small-time crook who gained the ability to transform into sand, is lumbering along the street. He tilts his head, aware of the grains shifting within him. Some grains of sand, his unsettling new form, seep out of his ear. He brushes them off his shoulder nonchalantly as he passes through cops, who are unaware of his formidable abilities. The cops race to the front and back of a large tarpaulin-covered lorry, part of a police operation possibly related to Flint's recent activities."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He smiles graciously at the marketing guy The marketing guy slaps various slogans onto a whiteboard then smiles cockily at the grouchy newspaper editor Jameson calms down and speaks into an intercom Jameson looks through the window at his assistant and points to one of a dozen pill bottles She nods He opens it He forces a calm face and presses the intercom He smiles graciously at the marketing guy Brock slips into Jameson's office Puffing on a cigar She looks up at SpiderMan swinging by with barelyfailed resentment He tilts his head Peter looks concerned Jameson waves Betty away dismissively In Times Square a billboard displays the letters NY followed by a heart and a picture of SpiderMan Her smile quickly fades as she realizes the crowd is not for her A silverheaded man comes up alongside him Peter ponders With a friendly smile the man goes Later Brock slips into Jameson's office Harry's doddery old manservant Bernard embraces his young master Peter hands Harry an old basketball With a friendly smile the man goes Later Peter hands Harry an old basketball Peter steals the ball off Harry and bounces it back to him in the lavishlyfurnished hallway Grabbing the ball from Harry Peter turns into Norman's study and stares at the chaise longue and remembers laying Norman's dead body on it Harry looks at his father's portrait Peter tosses the ball to Harry and knocks a vase over Harry nimbly catches the vase in one hand and the ball in the other The smile drops as she watches him disappear into the crowd Peter looks concerned Jameson looks through the window at his assistant and points to one of a dozen pill bottles The producer looks unconvinced by his own suggestion Mary Jane strides into the theater where she is working She comes through to the auditorium and her step falters Another actress is going through her moves on stage A marching band cuts through with workers waving placards and balloons Jameson calms down and speaks into an intercom The actress spots Mary Jane at the back of the auditorium Sitting in a sea of empty seats The cops race to the front and back of a large tarpaulincovered lorry the producer and director follow the actress's awkward gaze The director puts on a fake smile The producer looks unconvinced by his own suggestion the producer and director follow the actress's awkward gaze Mary Jane's blue eyes well up and she turns and walks away Peter tosses the ball to Harry and knocks a vase over The artistic duo return to their seats The artistic duo return to their seats Outside the theater a crowd has gathered Grabbing the ball from Harry Peter snaps Mary Jane Mary Jane's glum expression melts away Some grains of sand seep out of his ear She smiles as they applaud Her smile quickly fades as she realizes the crowd is not for her Sitting in a sea of empty seats She looks up at SpiderMan swinging by with barelyfailed resentment She hurries through the crowd as her name is covered up on the theater front with the name of Andrea Rubin Peter is standing amidst the delirious crowd smiling to himself drinking in the adulation A marching band cuts through with workers waving placards and balloons Brock approaches Gwen in the throng Mary Jane's glum expression melts away Peter snaps Mary Jane She forces a cheery smile as he walks off He forces a calm face and presses the intercom The smile drops as she watches him disappear into the crowd Elsewhere stoneyfaced Flint is lumbering along the street Harry's doddery old manservant Bernard embraces his young master He tilts his head Some grains of sand seep out of his ear He brushes them off his shoulder as he passes through cops Puffing on a cigar The cops race to the front and back of a large tarpaulincovered lorry"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The marketing guy slaps various slogans onto a whiteboard then smiles cockily at the grouchy newspaper editor. Jameson calms down and speaks into an intercom. Jameson looks through the window at his assistant and points to one of a dozen pill bottles. She nods. He opens it. He forces a calm face and presses the intercom. He smiles graciously at the marketing guy. Brock slips into Jameson's office. Puffing on a cigar. Jameson waves Betty away dismissively. In Times Square a billboard displays the letters NY followed by a heart and a picture of SpiderMan. A silverheaded man comes up alongside him. Peter ponders. With a friendly smile the man goes Later. Harry's doddery old manservant Bernard embraces his young master. Peter hands Harry an old basketball. Peter steals the ball off Harry and bounces it back to him in the lavishlyfurnished hallway. Grabbing the ball from Harry. Peter turns into Norman's study and stares at the chaise longue and remembers laying Norman's dead body on it. Harry looks at his father's portrait. Peter tosses the ball to Harry and knocks a vase over. Harry nimbly catches the vase in one hand and the ball in the other. Peter looks concerned. Mary Jane strides into the theater where she is working. She comes through to the auditorium and her step falters. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Another actress is going through her moves on stage. The actress spots Mary Jane at the back of the auditorium. Sitting in a sea of empty seats. the producer and director follow the actress's awkward gaze. The director puts on a fake smile. The producer looks unconvinced by his own suggestion. Mary Jane's blue eyes well up and she turns and walks away. The artistic duo return to their seats. Outside the theater a crowd has gathered. Mary Jane's glum expression melts away. She smiles as they applaud. Her smile quickly fades as she realizes the crowd is not for her. She looks up at SpiderMan swinging by with barelyfailed resentment. She hurries through the crowd as her name is covered up on the theater front with the name of Andrea Rubin. Peter is standing amidst the delirious crowd smiling to himself drinking in the adulation. A marching band cuts through with workers waving placards and balloons. Brock approaches Gwen in the throng. Peter snaps Mary Jane. She forces a cheery smile as he walks off. The smile drops as she watches him disappear into the crowd. Elsewhere stoneyfaced Flint is lumbering along the street. He tilts his head. Some grains of sand seep out of his ear. He brushes them off his shoulder as he passes through cops. The cops race to the front and back of a large tarpaulincovered lorry."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The marketing guy slaps various slogans onto a whiteboard then smiles cockily at the grouchy newspaper editor. Jameson calms down and speaks into an intercom. Jameson looks through the window at his assistant and points to one of a dozen pill bottles. She nods. He opens it. He forces a calm face and presses the intercom. He smiles graciously at the marketing guy. Brock slips into Jameson's office. Puffing on a cigar. Jameson waves Betty away dismissively. In Times Square a billboard displays the letters NY followed by a heart and a picture of SpiderMan. A silverheaded man comes up alongside him. Peter ponders. With a friendly smile the man goes Later. Harry's doddery old manservant Bernard embraces his young master. Peter hands Harry an old basketball. Peter steals the ball off Harry and bounces it back to him in the lavishlyfurnished hallway. Grabbing the ball from Harry. Peter turns into Norman's study and stares at the chaise longue and remembers laying Norman's dead body on it. Harry looks at his father's portrait. Peter tosses the ball to Harry and knocks a vase over. Harry nimbly catches the vase in one hand and the ball in the other. Peter looks concerned. Mary Jane strides into the theater where she is working. She comes through to the auditorium and her step falters. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Another actress is going through her moves on stage. The actress spots Mary Jane at the back of the auditorium. Sitting in a sea of empty seats. the producer and director follow the actress's awkward gaze. The director puts on a fake smile. The producer looks unconvinced by his own suggestion. Mary Jane's blue eyes well up and she turns and walks away. The artistic duo return to their seats. Outside the theater a crowd has gathered. Mary Jane's glum expression melts away. She smiles as they applaud. Her smile quickly fades as she realizes the crowd is not for her. She looks up at SpiderMan swinging by with barelyfailed resentment. She hurries through the crowd as her name is covered up on the theater front with the name of Andrea Rubin. Peter is standing amidst the delirious crowd smiling to himself drinking in the adulation. A marching band cuts through with workers waving placards and balloons. Brock approaches Gwen in the throng. Peter snaps Mary Jane. She forces a cheery smile as he walks off. The smile drops as she watches him disappear into the crowd. Elsewhere stoneyfaced Flint is lumbering along the street. He tilts his head. Some grains of sand seep out of his ear. He brushes them off his shoulder as he passes through cops. The cops race to the front and back of a large tarpaulincovered lorry."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The marketing guy slaps various slogans onto a whiteboard then smiles cockily at the grouchy newspaper editor. Jameson calms down and speaks into an intercom. Jameson looks through the window at his assistant and points to one of a dozen pill bottles. She nods. He opens it. He forces a calm face and presses the intercom. He smiles graciously at the marketing guy. Brock slips into Jameson's office. Puffing on a cigar. Jameson waves Betty away dismissively. In Times Square a billboard displays the letters NY followed by a heart and a picture of SpiderMan. A silverheaded man comes up alongside him. Peter ponders. She hurries through the crowd as her name is covered up on the theater front with the name of Andrea Rubin. Peter is standing amidst the delirious crowd smiling to himself drinking in the adulation. A marching band cuts through with workers waving placards and balloons. Brock approaches Gwen in the throng. Peter snaps Mary Jane. She forces a cheery smile as he walks off. The smile drops as she watches him disappear into the crowd. Elsewhere stoneyfaced Flint is lumbering along the street. He tilts his head. Some grains of sand seep out of his ear. He brushes them off his shoulder as he passes through cops. The cops race to the front and back of a large tarpaulincovered lorry."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The marketing guy slaps various slogans onto a whiteboard then smiles cockily at the grouchy newspaper editor. Jameson calms down and speaks into an intercom. Jameson looks through the window at his assistant and points to one of a dozen pill bottles. She nods. He opens it. Elsewhere stoneyfaced Flint is lumbering along the street. He tilts his head. Some grains of sand seep out of his ear. He brushes them off his shoulder as he passes through cops. The cops race to the front and back of a large tarpaulincovered lorry."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The chef slaps various slogans onto a whiteboard then smiles cockily at the grouchy painter. The octopus calms down and speaks into an intercom. The octopus looks through the window at its assistant and points to one of a dozen pill bottles. A giraffe nods. The kangaroo opens it. The kangaroo forces a calm face and presses the intercom. The kangaroo smiles graciously at the chef. The dog slips into the octopus's office. Puffing on a cigar, the octopus waves a rabbit away dismissively. In Times Square, a billboard displays the letters NY followed by a heart and a picture of Spider-Man. A silver-headed monkey comes up alongside a bear. A fox ponders. With a friendly smile, the monkey goes. Later, Harry's doddery old gardener, Bernard, embraces his young master. A zebra hands Harry an old basketball. A zebra steals the ball off Harry and bounces it back to him in the lavishly-furnished hallway. Grabbing the ball from Harry, a zebra turns into Walter's study and stares at the chaise longue and remembers laying Walter's dead body on it. A rabbit looks at his father's portrait. A zebra tosses the ball to Harry and knocks a vase over. A rabbit nimbly catches the vase in one hand and the ball in the other. A zebra looks concerned. A lion strides into the theater where they're working. A lion comes through to the auditorium and their step falters. Another penguin is going through their moves on stage. The penguin spots a lion at the back of the auditorium. Sitting in a sea of empty seats, the conductor and artist follow the penguin's awkward gaze. The artist puts on a fake smile. The conductor looks unconvinced by his own suggestion. A lion's blue eyes well up and a lion turns and walks away. The artistic duo return to their seats. Outside the theater, a crowd has gathered. A lion's glum expression melts away. A lion smiles as they applaud. A lion's smile quickly fades as a lion realizes the crowd is not for them. A lion looks up at Spider-Man swinging by with barely-failed resentment. A lion hurries through the crowd as their name is covered up on the theater front with the name of Andrea Rubin. A zebra is standing amidst the delirious crowd, smiling to itself, drinking in the adulation. A marching squirrel cuts through, with elephants waving placards and balloons. The dog approaches a dolphin in the throng. A zebra snaps a lion. A lion forces a cheery smile as the zebra walks off. The smile drops as a lion watches the zebra disappear into the crowd. Elsewhere, stoney-faced rhino is lumbering along the street. The rhino tilts its head. Some grains of sand seep out of its ear. The rhino brushes them off its shoulder as it passes through kangaroos. The kangaroos race to the front and back of a large tarpaulin-covered lorry."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The marketing guy slaps various slogans onto a chalkboard then smiles cockily at the grouchy magazine editor. Jameson calms down and speaks into a megaphone. Jameson looks through the skylight at his assistant and points to one of a dozen perfume bottles. She nods. He opens it. He forces a calm face and presses the megaphone. He smiles graciously at the marketing guy. Brock slips into Jameson's office. Puffing on a pipe, Jameson waves Betty away dismissively. In Central Park, a mural displays the letters NY followed by a leaf and a picture of Spider-Man. A bald-headed man comes up alongside him. Peter ponders. With a friendly smile, the man goes. Later, Harry's doddery old gardener, Bernard, embraces his young master. Peter hands Harry an old football. Peter steals the ball off Harry and bounces it back to him in the extravagantly-decorated hallway. Grabbing the ball from Harry, Peter turns into Norman's library and stares at the armchair and remembers laying Norman's dead body on it. Harry looks at his father's trophy. Peter tosses the ball to Harry and knocks a lamp over. Harry nimbly catches the lamp in one hand and the ball in the other. Peter looks concerned. Mary Jane strides into the gallery where she's working. She comes through to the exhibition space and her step falters. Another artist is going through her moves on the platform. The artist spots Mary Jane at the back of the exhibition space. Sitting in a sea of empty seats, the curator and organizer follow the artist's awkward gaze. The organizer puts on a fake smile. The curator looks unconvinced by his own suggestion. Mary Jane's blue eyes well up and she turns and walks away. The artistic duo return to their seats. Outside the gallery, a crowd has gathered. Mary Jane's glum expression melts away. She smiles as they applaud. Her smile quickly fades as she realizes the crowd is not for her. She looks up at Spider-Man swinging by with barely-failed resentment. She hurries through the crowd as her name is covered up on the gallery front with the name of Andrea Rubin. Peter is standing amidst the animated crowd, smiling to himself, drinking in the adulation. A parade cuts through, with workers waving banners and kites. Brock approaches Gwen in the throng. Peter snaps Mary Jane. She forces a cheery smile as he walks off. The smile drops as she watches him disappear into the crowd. Elsewhere, stoney-faced Flint is lumbering along the avenue. He tilts his head. Some grains of gravel seep out of his ear. He brushes them off his shoulder as he passes through firefighters. The firefighters race to the front and back of a large tarp-covered wagon."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The marketing guy scribbles various slogans onto a whiteboard then winks cheekily at the grouchy newspaper editor. Jameson lights up and mutters into an intercom. Jameson glances through the window at his assistant and gestures to one of a dozen pill bottles. She shrugs. He shakes it. He puts on a brave face and taps the intercom. He winks playfully at the marketing guy. Brock strolls into Jameson's office. Chewing on a toothpick, Jameson shoos Betty away dismissively. In Times Square, a billboard illuminates the letters NY followed by a diamond and a picture of Spider-Man. A silver-headed man sidles up alongside him. Peter daydreams. With a friendly nod, the man departs. Later, Harry's doddery old manservant, Bernard, pats his young master on the back. Peter tosses Harry an old basketball. Peter swipes the ball off Harry and flips it back to him in the lavishly-furnished hallway. Hugging the ball from Harry, Peter walks into Norman's study and surveys the chaise longue and remembers finding Norman's dead body on it. Harry studies his father's portrait. Peter lobs the ball to Harry and taps a vase over. Harry deftly snatches the vase in one hand and the ball in the other. Peter appears puzzled. Mary Jane strides into the theater where she's working. She arrives in the auditorium and her step falters. Another actress is practicing her moves on stage. The actress spots Mary Jane at the back of the auditorium. Sitting in a sea of empty seats, the producer and director track the actress's uneasy gaze. The director forces a bright smile. The producer frowns at his own suggestion. Mary Jane's blue eyes brim and she twists and moves away. The artistic duo turn to their seats. Outside the theater, a crowd has gathered. Mary Jane's glum expression dissolves. She beams as they cheer. Her smile quickly vanishes as she realizes the crowd is not for her. She glances up at Spider-Man gliding by with barely-concealed resentment. She rushes through the crowd as her name is replaced on the theater front with the name of Andrea Rubin. Peter is standing amidst the animated crowd, grinning to himself, relishing the adulation. A marching band weaves through, with workers waving placards and balloons. Brock sidles up to Gwen in the throng. Peter snaps Mary Jane. She feigns a bright smile as he wanders off. The smile drops as she watches him vanish into the crowd. Elsewhere, stoney-faced Flint is plodding along the street. He tilts his head. Some grains of sand trickle out of his ear. He flicks them off his shoulder as he glides through cops. The cops hustle to the front and back of a large tarpaulin-covered lorry."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The gorilla artist slaps various riddles onto a chalkboard then smiles cockily at the grumpy typewriter mechanic. Jackson calms down and speaks into a telephone. Jackson looks through the window at his gardener and points to one of a dozen perfume bottles. She nods. He opens it. He forces a calm face and presses the telephone. He smiles graciously at the gorilla artist. Brick slips into Jackson's garage. Puffing on a cigarette, Jackson waves Brenda away dismissively. In Piccadilly Circus, a poster displays the letters LA followed by a star and a picture of Batgirl. A bronze-haired woman comes up alongside him. Patrick ponders. With a friendly smile, the woman goes. Later, Harold's doddery young butler, Bernardine, embraces her old master. Patrick hands Harold an antique football. Patrick steals the ball off Harold and bounces it back to him in the sparsely-furnished kitchen. Grabbing the ball from Harold, Patrick turns into Nancy's attic and stares at the armchair and remembers laying Nancy's old book on it. Harold looks at his mother's photograph. Patrick tosses the ball to Harold and knocks a lamp over. Harold nimbly catches the lamp in one hand and the ball in the other. Patrick looks concerned. Martha strides into the gallery where she's writing. She comes through to the terrace and her step falters. Another poet is going through her verses on stage. The poet spots Martha at the back of the terrace. Sitting in a sea of empty tables, the publisher and critic follow the poet's awkward gaze. The critic puts on a fake smile. The publisher looks unconvinced by his own suggestion. Martha's green eyes well up and she turns and walks away. The literary duo return to their tables. Outside the gallery, a line has gathered. Martha's glum expression melts away. She smiles as they cheer. Her smile quickly fades as she realizes the line is not for her. She looks up at Batgirl flying by with barely-failed resentment. She hurries through the line as her name is covered up on the gallery front with the name of Andrew Roman. Patrick is standing amidst the ecstatic line, smiling to himself, drinking in the celebration. A brass band cuts through, with bakers waving menus and kites. Brick approaches Abby in the throng. Patrick snaps Martha. She forces a cheery smile as he walks off. The smile drops as she watches him disappear into the line. Elsewhere, stoney-faced Fred is lumbering along the alley. He tilts his head. Some drops of water seep out of his nose. He brushes them off his elbow as he passes through doctors. The doctors race to the front and back of a large fabric-covered van."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The accountant sketches various doodles onto a blackboard then smirks confidently at the cheerful electrician. Carlson tenses up and whispers into a walkie-talkie. Carlson glances through the door at his colleague and gestures to one of a dozen notebooks. She winks. He closes it. He adopts a stern face and taps the walkie-talkie. He grins sheepishly at the accountant. Trevor slides into Carlson's office. Chewing on a pen, Carlson gestures Nancy over invitingly. In Central Park, a banner displays the letters LA followed by a star and a picture of Batman. A red-haired woman strolls up next to him. Patrick deliberates. With an amiable grin, the woman leaves. Later, Harold’s lively young chauffeur, Oliver, salutes his elderly charge. Patrick passes Harold an old soccer ball. Patrick snatches the ball from Harold and tosses it back to him in the sparsely-decorated kitchen. Snatching the ball from Harold, Patrick wanders into Oliver’s garage and glares at the ottoman and recalls putting Oliver’s large suitcase on it. Harold gazes at his brother’s sculpture. Patrick lobs the ball to Harold and bumps a lamp over. Harold deftly grabs the lamp in one hand and the ball in the other. Patrick appears startled. Emily waltzes into the gallery where she’s exhibiting. She crosses over to the lobby and her smile falters. Another painter is setting up her canvases on display. The painter notices Emily at the edge of the lobby. Sitting in a row of occupied seats, the manager and assistant react to the painter’s sudden shift. The assistant wears a puzzled expression. The manager looks doubtful about his own decision. Emily’s hazel eyes tear up and she spins and steps back. The creative team return to their meeting. Outside the gallery, an audience has assembled. Emily’s somber demeanor brightens. She grins as they cheer. Her grin swiftly fades as she notices the audience is not for her. She glances up at Batman soaring past with barely-concealed disbelief. She pushes through the audience as her name is replaced on the gallery front with the name of Andrea Rubin. Patrick is standing among the ecstatic spectators, grinning to himself, savoring the excitement. A parade moves through, with performers waving banners and streamers. Trevor sidles up to Grace in the crowd. Patrick captures Emily. She forces a bright grin as he strides away. The grin vanishes as she watches him melt into the crowd. Elsewhere, merry-faced Felix is ambling down the street. He nods his head. Some bits of glitter come out of his pocket. He flicks them off his jacket as he strolls past vendors. The vendors rush to the sides and top of a large tarp-covered cart."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The marketing guy tosses various hats onto a chalkboard then winks slyly at the irritable pastry chef. Jameson unwinds and shouts into an intercom. Jameson glances through the ceiling at his assistant and waves to one of a dozen coffee mugs. She shrugs. He spills it. He forces a cheerful face and knocks the intercom. He gestures warmly at the marketing guy. Brock sneaks into Jameson's studio. Chewing on a pencil, Jameson flaps Betty away carelessly. In Times Square, a mural exhibits the letters NY followed by a smiley face and a sketch of a dinosaur. A gold-haired woman comes up alongside him. Peter contemplates. With a warm handshake, the woman departs. Later, Harry's bumbling old coach, Bernard, pats his young apprentice. Peter hands Harry an ancient globe. Peter snatches the globe off Harry and spins it back to him in the extravagantly-carpeted stairway. Snatching the globe from Harry, Peter swivels into Norman's library and gazes at the bookshelf and recalls storing Norman's favorite book on it. Harry glances at his mother's portrait. Peter hurls the globe to Harry and topples a statue over. Harry deftly catches the statue in one hand and the globe in the other. Peter looks uneasy. Mary Jane strides into the gallery where she's pondering. She steps into the foyer and her pace hesitates. Another artist is presenting her work on display. The artist notes Mary Jane at the back of the foyer. Sitting in a sea of vacant tables, the curator and critic mirror the artist's uneasy glance. The critic adopts a forced chuckle. The curator feels doubtful about his own recommendation. Mary Jane's blue eyes fill up and she spins and strolls away. The artistic duo return to their sketches. Outside the gallery, a group is chatting. Mary Jane's sad expression dissolves. She beams as they cheer. Her joy promptly vanishes as she grasps the group is not for her. She gazes up at Spider-Man swinging by with barely-concealed envy. She rushes through the group as her name is shaded over on the gallery front with the name of Andrea Rubin. Peter is standing amidst the ecstatic group, grinning to himself, absorbing the accolades. A parade cuts through, with performers juggling torches and kites. Brock approaches Gwen in the swarm. Peter photographs Mary Jane. She musters a bright grin as he strides away. The grin fades as she observes him vanish into the group. Elsewhere, stone-faced Flint is dragging along the boardwalk. He twists his arm. Some petals of roses drift out of his collar. He flicks them off his cap as he ambles through firemen. The firemen rush to the front and back of a massive canvas-wrapped chariot."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The tailor pats numerous aphorisms onto a chalkboard then grins smugly at the cranky magazine proofreader. Lawson tenses up and whispers into a megaphone. Lawson peers through the mirror at his intern and gestures to one of a dozen candle jars. She shrugs. He shuts it. He conjures a relaxed expression and taps the megaphone. He grins politely at the tailor. Clark sneaks into Lawson's chamber. Chewing on a pencil, Lawson dismisses Nancy indifferently. In Piccadilly Circus, a mural exhibits the letters LA followed by a star and a sketch of a Dolphin. A copper-haired youth strolls up beside him. George deliberates. With a kind grin, the youth departs. Later, Leroy's shaky old butler, Jeffrey, hugs his juvenile employer. George gives Leroy an aged volleyball. George nabs the ball from Leroy and rolls it back to him in the extravagantly-decorated corridor. Snatching the ball from Leroy, George veers into Victor's den and gazes at the recliner and recalls placing Victor's lifeless form on it. Leroy eyes his ancestor's depiction. George flings the ball to Leroy and nudges a lamp over. Leroy deftly snatches the lamp in one hand and the ball in the other. George appears troubled. Peggy marches into the cinema where she's assisting. She strides through to the screening room and her pace hesitates. Another performer is rehearsing her routine on stage. The performer notices Peggy at the rear of the screening room. Occupying a cluster of vacant seats, the financier and filmmaker track the performer's uneasy glance. The filmmaker dons an insincere grin. The financier seems doubtful of his own proposal. Peggy's green eyes fill up and she turns and strides away. The creative pair return to their chairs. Outside the cinema, a mob has assembled. Peggy's sullen demeanor evaporates. She grins as they cheer. Her grin swiftly diminishes as she realizes the crowd is not for her. She glances up at a Skylark gliding by with barely-hidden irritation. She rushes through the mob as her name is covered on the cinema marquee with the name of Emily Turner. George is standing amidst the ecstatic mob, grinning to himself, soaking in the acclaim. A dance troupe cuts through, with stragglers waving banners and streamers. Clark approaches Alice in the huddle. George snaps Peggy. She forces a bright grin as he strolls away. The grin vanishes as she watches him fade into the mob. Elsewhere, stone-faced Vincent is trudging along the avenue. He tips his head. Some granules of dust drift out of his nostril. He flicks them off his elbow as he strolls through detectives. The detectives sprint to the front and back of a vast tarpaulin-covered truck."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The marketing guy confidently slaps slogans on a whiteboard as Jameson, a grouchy newspaper editor, remains calm, interacting with his assistant and a dozen pill bottles. Puffing on a cigar, Jameson dismisses Betty. In Times Square, a billboard displays a Spider-Man-related image. Peter and a silver-headed man exchange pleasantries before Peter, reminiscing about Norman, plays basketball with Harry inside a lavish hallway. Harry adeptly catches a vase and ball, while Peter looks worried. Mary Jane enters a theater where she finds another actress rehearsing, causing her eyes to well up. Her disappointment deepens when the audience outside applauds not for her, but for Spider-Man, as her name is replaced on the theater front. Peter enjoys the crowd's admiration, while Brock approaches Gwen. Flint, looking solemn, walks through the street, shedding sand from his ear as cops surround a large tarpaulin-covered lorry."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The cops race to the front and back of a large tarpaulincovered lorry He brushes them off his shoulder as he passes through cops Some grains of sand seep out of his ear He tilts his head Elsewhere stoneyfaced Flint is lumbering along the street The smile drops as she watches him disappear into the crowd She forces a cheery smile as he walks off Peter snaps Mary Jane Brock approaches Gwen in the throng A marching band cuts through with workers waving placards and balloons Peter is standing amidst the delirious crowd smiling to himself drinking in the adulation She hurries through the crowd as her name is covered up on the theater front with the name of Andrea Rubin She looks up at SpiderMan swinging by with barelyfailed resentment Her smile quickly fades as she realizes the crowd is not for her She smiles as they applaud Mary Jane's glum expression melts away Outside the theater a crowd has gathered The artistic duo return to their seats Mary Jane's blue eyes well up and she turns and walks away The producer looks unconvinced by his own suggestion The director puts on a fake smile the producer and director follow the actress's awkward gaze Sitting in a sea of empty seats The actress spots Mary Jane at the back of the auditorium Another actress is going through her moves on stage She comes through to the auditorium and her step falters Mary Jane strides into the theater where she is working Peter looks concerned Harry nimbly catches the vase in one hand and the ball in the other Peter tosses the ball to Harry and knocks a vase over Harry looks at his father's portrait Peter turns into Norman's study and stares at the chaise longue and remembers laying Norman's dead body on it Grabbing the ball from Harry Peter steals the ball off Harry and bounces it back to him in the lavishlyfurnished hallway Peter hands Harry an old basketball Harry's doddery old manservant Bernard embraces his young master With a friendly smile the man goes Later Peter ponders A silverheaded man comes up alongside him In Times Square a billboard displays the letters NY followed by a heart and a picture of SpiderMan Jameson waves Betty away dismissively Puffing on a cigar Brock slips into Jameson's office He smiles graciously at the marketing guy He forces a calm face and presses the intercom He opens it She nods Jameson looks through the window at his assistant and points to one of a dozen pill bottles Jameson calms down and speaks into an intercom The marketing guy slaps various slogans onto a whiteboard then smiles cockily at the grouchy newspaper editor"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Another actress is going through her moves on stage Mary Jane strides into the theater where she is working Harry looks at his father's portrait A silverheaded man comes up alongside him He opens it Elsewhere stoneyfaced Flint is lumbering along the street The actress spots Mary Jane at the back of the auditorium Jameson waves Betty away dismissively The director puts on a fake smile Peter steals the ball off Harry and bounces it back to him in the lavishlyfurnished hallway Mary Jane's blue eyes well up and she turns and walks away Harry nimbly catches the vase in one hand and the ball in the other Peter ponders She nods Peter is standing amidst the delirious crowd smiling to himself drinking in the adulation She hurries through the crowd as her name is covered up on the theater front with the name of Andrea Rubin In Times Square a billboard displays the letters NY followed by a heart and a picture of SpiderMan She comes through to the auditorium and her step falters She smiles as they applaud The marketing guy slaps various slogans onto a whiteboard then smiles cockily at the grouchy newspaper editor She forces a cheery smile as he walks off Peter turns into Norman's study and stares at the chaise longue and remembers laying Norman's dead body on it Outside the theater a crowd has gathered He brushes them off his shoulder as he passes through cops Brock approaches Gwen in the throng The producer looks unconvinced by his own suggestion the producer and director follow the actress's awkward gaze Peter tosses the ball to Harry and knocks a vase over Peter looks concerned Peter snaps Mary Jane He tilts his head Her smile quickly fades as she realizes the crowd is not for her The artistic duo return to their seats The smile drops as she watches him disappear into the crowd With a friendly smile the man goes Later The cops race to the front and back of a large tarpaulincovered lorry Some grains of sand seep out of his ear Jameson looks through the window at his assistant and points to one of a dozen pill bottles Sitting in a sea of empty seats She looks up at SpiderMan swinging by with barelyfailed resentment He forces a calm face and presses the intercom Mary Jane's glum expression melts away He smiles graciously at the marketing guy Puffing on a cigar Harry's doddery old manservant Bernard embraces his young master Peter hands Harry an old basketball Grabbing the ball from Harry Jameson calms down and speaks into an intercom Brock slips into Jameson's office A marching band cuts through with workers waving placards and balloons"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Another actress is going through her moves on stage The actress spots Mary Jane at the back of the auditorium Sitting in a sea of empty seats the producer and director follow the actress's awkward gaze The director puts on a fake smile The producer looks unconvinced by his own suggestion Mary Jane's blue eyes well up and she turns and walks away The artistic duo return to their seats Outside the theater a crowd has gathered Mary Jane's glum expression melts away She smiles as they applaud Her smile quickly fades as she realizes the crowd is not for her She looks up at SpiderMan swinging by with barelyfailed resentment She hurries through the crowd as her name is covered up on the theater front with the name of Andrea Rubin Peter is standing amidst the delirious crowd smiling to himself drinking in the adulation A marching band cuts through with workers waving placards and balloons Brock approaches Gwen in the throng Peter snaps Mary Jane She forces a cheery smile as he walks off The smile drops as she watches him disappear into the crowd Elsewhere stoneyfaced Flint is lumbering along the street He tilts his head Some grains of sand seep out of his ear He brushes them off his shoulder as he passes through cops The cops race to the front and back of a large tarpaulincovered lorry The marketing guy slaps various slogans onto a whiteboard then smiles cockily at the grouchy newspaper editor Jameson calms down and speaks into an intercom Jameson looks through the window at his assistant and points to one of a dozen pill bottles She nods He opens it He forces a calm face and presses the intercom He smiles graciously at the marketing guy Brock slips into Jameson's office Puffing on a cigar Jameson waves Betty away dismissively In Times Square a billboard displays the letters NY followed by a heart and a picture of SpiderMan A silverheaded man comes up alongside him Peter ponders With a friendly smile the man goes Later Harry's doddery old manservant Bernard embraces his young master Peter hands Harry an old basketball Peter steals the ball off Harry and bounces it back to him in the lavishlyfurnished hallway Grabbing the ball from Harry Peter turns into Norman's study and stares at the chaise longue and remembers laying Norman's dead body on it Harry looks at his father's portrait Peter tosses the ball to Harry and knocks a vase over Harry nimbly catches the vase in one hand and the ball in the other Peter looks concerned Mary Jane strides into the theater where she is working She comes through to the auditorium and her step falters"
        }
      ]
    }
  ]
}