{
  "ground_truth": "Spider-Man hits wreckage and glides off it as if it were a ramp, landing on top of the van and hitting Flint with a volley of wet balls. Flint punches Spider-Man off the roof, and although Spider-Man clings on, Flint punches him into the truck. As the van heads for a collision, Spider-Man pulls the guards out, firing a thread out of the back of the van, which flints and crashes into a parked truck. Flint watches from the edge of a building above as Spider-Man staggers out of the red van, looking around frantically. As Flint moves off, the rescued guards drop from a web spun across the street. Spider-Man wheezes up to the ledge of a building, pulls off his mask, and shakes sand from his hair, then pulls off his left boot and shakes out some more sand. Later in the evening, Peter, dressed smartly in a sober suit with his dark hair swept across in a neat side parting, stops a few feet away from the entrance of the restaurant constellation and pulls Aunt May's ring out of his breast pocket. Looking agitated, Mary Jane strides up alongside a newsstand and storms off with a face like thunder. Inside the restaurant, Peter takes in the opulent splendor as diners and waiters flip past him, walking across the reception area where he's summoned by a maitre d' behind a small counter. The maitre d' has brought a pen on a silver platter, examining it with dark, beady eyes as Peter hands him a note. Clenching his fist, the maitre d' then leads Peter to a table before scurrying away. Peter snaps out of his role play as he sees Mary Jane coming towards him in a little black dress. He shows her to her seat and chivalrously pulls out her chair for her, then spots simpering blonde Gwen waving at him and waves back. The maitre d' summons the champagne, but Peter hurriedly shakes his head, leading the maitre d' to wave the waiters away. Gwen waves at Peter as she walks away, and he waves back again. The maitre d' takes this as the signal, and helpless waiters are called off again as Peter shakes his head. The maitre d' bringing the champagne glasses passes Mary Jane as she storms out. Peter stares after Mary Jane in shock as the maitre d' sets the glasses down on the table and the waiter brings a champagne bucket. As a violinist serenades him, Peter picks up Mary Jane's glass and fishes the ring out of it with a fork, then dries the ring with a napkin.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Spider-Man strikes debris and glides off it as if it were a ramp, alighting on top of the van and striking Flint with a barrage of damp spheres. Flint punches Spider-Man off the roof, and although Spider-Man clings on, Flint punches him into the truck. As the van heads for a collision, Spider-Man pulls the guards out, firing a filament out of the back of the van, which veers and crashes into a parked truck. Flint observes from the brink of a structure above as Spider-Man staggers out of the red van, looking around frantically. As Flint moves off, the rescued guards drop from a web spun across the avenue. Spider-Man wheezes up to the ledge of a building, pulls off his mask, and shakes grit from his hair, then pulls off his left boot and shakes out some more grit. Later in the evening, Peter, dressed smartly in a sober suit with his dark hair swept across in a neat side parting, stops a few feet away from the entrance of the restaurant constellation and pulls Aunt May's ring out of his breast pocket. Looking agitated, Mary Jane strides up alongside a newsstand and storms off with a face like thunder. Inside the restaurant, Peter takes in the opulent splendor as diners and waiters flip past him, walking across the reception area where he's summoned by a maitre d' behind a small counter. The maitre d' has brought a pen on a silver platter, examining it with dark, beady eyes as Peter hands him a note. Clenching his fist, the maitre d' then leads Peter to a table before scurrying away. Peter snaps out of his role play as he sees Mary Jane coming towards him in a little black dress. He shows her to her seat and chivalrously pulls out her chair for her, then spots simpering blonde Gwen waving at him and waves back. The maitre d' summons the champagne, but Peter hurriedly shakes his head, leading the maitre d' to wave the waiters away. Gwen waves at Peter as she walks away, and he waves back again. The maitre d' takes this as the signal, and helpless waiters are called off again as Peter shakes his head. The maitre d' bringing the champagne glasses passes Mary Jane as she storms out. Peter stares after Mary Jane in shock as the maitre d' sets the glasses down on the table and the waiter brings a champagne bucket. As a violinist serenades him, Peter picks up Mary Jane's glass and fishes the ring out of it with a fork, then dries the ring with a serviette."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Wreckage is hit by Spider-Man, and it is glided off by him as if it were a ramp, with a landing made on top of the van and Flint hit with a volley of wet balls by him. Spider-Man is punched off the roof by Flint, and although he clings on, Flint punches him into the truck. As the guards are pulled out by Spider-Man while the van heads for a collision, a thread is fired out of the back of the van by him, causing it to flint and crash into a parked truck. From the edge of a building above, Flint watches as the red van is staggered out of by Spider-Man, who looks around frantically. As Flint moves off, a web spun across the street drops the rescued guards. Up to the ledge of a building, Spider-Man wheezes, and his mask is pulled off by him. Sand is shaken from his hair, and then his left boot is pulled off, with more sand shaken out by him. Later in the evening, Peter, dressed smartly in a sober suit with his dark hair swept across in a neat side parting, stops a few feet away from the entrance of the restaurant constellation and a pull is made by him of Aunt May's ring out of his breast pocket. Looking agitated, Mary Jane strides up alongside a newsstand and makes a storming off with a face like thunder. Inside the restaurant, the opulent splendor is taken in by Peter as diners and waiters flip past him, crossing the reception area where he summons a maitre d' behind a small counter. A pen is brought by the maitre d' on a silver platter, with an examination made with dark, beady eyes as a note is handed to him by Peter. Clenching his fist, the maitre d' then leads Peter to a table before a scurrying away is made by him. As Mary Jane is seen coming towards him in a little black dress, Peter snaps out of his role play. She is shown to her seat by him, and her chair is chivalrously pulled out for her by him, then Gwen is spotted by him, simpering and waving at him, and he waves back. The champagne is summoned by the maitre d', but his head is hurriedly shaken by Peter, leading the maitre d' to wave the waiters away. As Gwen walks away, she waves at Peter, and he waves back again. The maitre d' takes this as the signal, and waiters, helpless, are called off again as his head is shaken by Peter. The champagne glasses are brought by the maitre d', passing Mary Jane as she storms out. Mary Jane is stared after by Peter in shock as the glasses are set down on the table by the maitre d', and a champagne bucket is brought by the waiter. The ring is picked up out of Mary Jane's glass by Peter with a fork as a violinist serenades him, then it is dried with a napkin by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Spider-Man hits wreckage, gliding off like a ramp to land on the van and attack Flint with wet balls. Flint punches Spider-Man off the roof; he clings on but is punched into the truck. As the van nears collision, Spider-Man rescues the guards, firing a thread from the van, which crashes. Flint watches from a building as Spider-Man exits the van, dazed. Flint departs, and the rescued guards drop from a web. Spider-Man climbs a building ledge, removes his mask and boots, shaking out sand. Later, Peter, smartly dressed, nears the restaurant, pulling Aunt May's ring from his pocket. Mary Jane appears upset and storms past. Inside, Peter admires the restaurant as the maitre d' brings a pen on a silver platter, receiving Peter's note. Leading Peter to a table, the maitre d' leaves as Mary Jane arrives in a black dress. Peter pulls out her chair, sees Gwen waving, and waves back. The maitre d' signals the champagne, but Peter shakes his head to decline, sending waiters away. Mary Jane storms off, and Peter watches in shock while the maitre d' sets down glasses. Serenaded by a violinist, Peter retrieves the ring from Mary Jane's glass, drying it with a napkin."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Spider-Man uses the wreckage as a ramp, lands on a van, and attacks Flint with wet balls. Flint punches Spider-Man into the truck. As the van nears a crash, Spider-Man saves the guards and the van hits a parked truck. Flint observes from above as Spider-Man exits the red van, looking around. Rescued guards drop from a web. Spider-Man, on a building ledge, removes his mask and shakes sand from his hair and boot. Later, Peter, in a neat suit, stands near the restaurant constellation, holding Aunt May's ring. Agitated Mary Jane walks by a newsstand. Inside, Peter admires the restaurant's ambiance and the maitre d' leads him to a table. Peter sees Mary Jane in a black dress, seats her, and waves at Gwen. The maitre d' offers champagne, but Peter declines. Mary Jane leaves; Peter watches in shock as the maitre d' sets down the champagne. A violinist plays as Peter retrieves the ring from Mary Jane's glass using a fork."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Spider-Man forcefully makes contact with the wreckage, using it ingeniously, as if it were a meticulously crafted ramp, allowing him to glide smoothly off the surface. He lands precisely on top of the speeding van, launching a volley of wet spheres at Flint with deft accuracy. Flint, with a powerful punch, sends Spider-Man flying off the roof, yet Spider-Man manages to cling on tenaciously. However, Flint delivers another punch, this time sending Spider-Man crashing into the truck. As the van careens towards an imminent collision, Spider-Man heroically pulls the guards to safety, skillfully firing a web thread from the back of the van, causing it to ricochet and crash into a stationary truck. From a commanding vantage point on the edge of a building high above, Flint observes as Spider-Man emerges, staggering from the red van, his eyes scanning the surroundings frantically. As Flint departs, the guards he’s saved descend safely from a web Spider-Man spun across the street below. Exhausted, Spider-Man wheezes his way up to the ledge of a building, removing his mask to reveal his identity, shaking sand from his hair vigorously, then proceeds to pull off his left boot to shake out even more sand. \n\nAs evening envelops the city, Peter, looking particularly smart in a sober, well-fitted suit with his dark hair neatly swept across in a precise side parting, pauses just a few feet from the restaurant entrance named Constellation. He gently pulls Aunt May's cherished ring from his breast pocket, contemplating its significance. Meanwhile, Mary Jane, filled with agitation, strides purposefully alongside a newsstand, her expression resembling a storm about to unleash its fury as she marches off. Inside the restaurant, Peter momentarily stands in awe of the opulent splendor surrounding him, as diners and waiters move gracefully past. As he crosses the bustling reception area, he's summoned by a maitre d' stationed behind a small counter. The maitre d', with dark, beady eyes, presents a pen on a silver platter, examining it carefully as Peter hands him a note. Clenching his fist with determination, the maitre d' then leads Peter to a table, hastily scurrying away afterward. Peter, breaking from his role play, snaps back to reality upon noticing Mary Jane approaching in an elegant little black dress. With chivalry, he shows her to her seat, thoughtfully pulling out her chair for her. Suddenly, he spots a blonde named Gwen, who is simpering and waving at him, prompting him to wave back politely. The attentive maitre d' signals for champagne, but Peter shakes his head urgently, leading to the maitre d' signaling waiters to retreat. Once again, Gwen waves at Peter while walking away, prompting another wave in return. Misinterpreting this as a signal, the maitre d' once again instructs the waiters, only to have them retreat when Peter shakes his head once more. As the maitre d' passes by with champagne glasses, Mary Jane storms out, filled with fury. Peter finds himself staring after her in utter shock as the maitre d' sets the glasses down on the table, and a waiter delivers a bucket of champagne. With a violinist serenading him, Peter solemnly picks up Mary Jane's glass, carefully extracting the ring using a fork, then dries it with a napkin, pondering his next move."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Spider-Man, with a dynamic forcefulness, makes contact with the scattered wreckage, utilizing it with remarkable ingenuity, as though it were a meticulously crafted ramp designed for his use, allowing him to glide smoothly and effortlessly off the uneven surface. He executes a perfect landing precisely on top of the swiftly moving van, skillfully launching a volley of wet, sticky spheres at Flint, targeting him with deft accuracy. In response, Flint delivers a powerful, forceful punch that sends Spider-Man flying off the van's roof, yet Spider-Man manages to grab hold tenaciously, clinging on with unwavering determination. However, Flint strikes yet again with another punch, this time propelling Spider-Man into the side of the truck with a crash. As the van recklessly careens towards an inevitable collision, Spider-Man heroically pulls the guards away to safety, skillfully firing a web thread from the rear of the van, causing it to ricochet and ultimately crash into a stationary truck. From a commanding vantage point high above on the edge of a tall building, Flint observes with keen interest as Spider-Man emerges, staggering unsteadily from the damaged red van, his eyes frantically scanning the chaotic surroundings. As Flint departs, the guards that Spider-Man heroically saved descend to safety from a web spun expertly across the street below. Exhausted, Spider-Man wearily ascends to the building's ledge, removing his mask to reveal his true identity, vigorously shaking sand from his hair, then proceeds to pull off his left boot to shake out even more sand.\n\nAs the tranquil evening slowly envelops the bustling city, Peter, looking particularly smart in a sober, well-fitted suit with his dark hair neatly swept across in a precise side parting, pauses thoughtfully just a few feet from the entrance of the elegant restaurant named Constellation. He gingerly pulls Aunt May's cherished ring from his breast pocket, contemplating its deep significance. Meanwhile, Mary Jane, filled with mounting agitation, strides purposefully alongside a bustling newsstand, her expression as stormy as a tempest about to unleash its full fury as she marches off with purpose. Inside the lavish restaurant, Peter momentarily stands in awe, taking in the opulent splendor surrounding him as elegantly dressed diners and waiters move gracefully past. As he makes his way across the bustling reception area, he is summoned by a maitre d' stationed behind a small, polished counter. The maitre d', possessing dark, beady eyes, presents a sleek pen on a silver platter, examining it carefully as Peter hands him a note. Clenching his fist with determination, the maitre d' then leads Peter to a table, hastily scurrying away afterward. Peter, breaking from his role play as he returns to reality, notices Mary Jane approaching in a sophisticated little black dress. With chivalry, he escorts her to her seat, thoughtfully pulling out her chair for her. Suddenly, he spots a blonde named Gwen, who is simpering and waving at him, prompting him to wave back politely. The attentive maitre d' signals waiters to bring champagne, but Peter urgently shakes his head, leading to the maitre d' instructing the waiters to retreat. Once more, Gwen waves at Peter while walking away, prompting another courteous wave in return. Misinterpreting this as a signal for service, the maitre d' once again instructs the waiters to approach, only to have them retreat when Peter shakes his head once more. As the maitre d' passes by with champagne glasses, Mary Jane storms out, consumed with fury. Peter finds himself staring after her in utter shock and disbelief as the maitre d' sets the glasses down on the table, and a waiter places a bucket of champagne. With a violinist serenading him, Peter solemnly picks up Mary Jane's glass, carefully extracting the ring using a fork, then gently dries it with a napkin, pondering deeply about his next move."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Spider-Man collides with the wreckage, using the momentum to glide smoothly off it as though it were a makeshift ramp, allowing him to gracefully land on top of the van. Once atop the vehicle, he quickly launches a rapid series of wet projectiles at Flint. In response, Flint delivers a powerful punch, dislodging Spider-Man from the roof. Spider-Man manages to cling on momentarily, but Flint strikes again, sending him hurtling into the truck. Amidst the chaos, as the van speeds toward an impending collision, Spider-Man swiftly acts, pulling the guards to safety by firing a thread out from the back, ensuring the van flips and crashes into a parked truck. Above, Flint observes with keen interest from the edge of a nearby building as Spider-Man emerges from the wreck of the red van, glancing around with urgency. Meanwhile, as Flint departs, the rescued guards find themselves gently descending from a web spanning across the street. With a heavy breath, Spider-Man makes his way to the edge of a building, removes his mask with a sigh of relief, and vigorously shakes his head to dislodge the sand entangled in his hair. He then sits down, removes his left boot, and shakes out yet more sand, ensuring he is free from the gritty residue. Transitioning to later in the evening, Peter, now smartly attired in a solemn suit with his dark hair perfectly arranged in a neat side parting, pauses just a few feet from the entrance of the upscale restaurant 'Constellation.' With a sense of anticipation, he carefully retrieves Aunt May's ring from his breast pocket. Nearby, Mary Jane approaches a newsstand in a state of agitation, her expression dark and stormy, before striding off in a huff. Once inside the restaurant, Peter is momentarily captivated by the lavish décor as diners and waiters bustle past him. Moving through the reception area, he is beckoned by a maitre d' standing behind a small counter. The maitre d', holding a pen on a silver platter and scrutinizing it with sharp, penetrating eyes, accepts the note Peter hands him. With a firm action, the maitre d' then guides Peter to a designated table before hastily retreating. As Peter snaps out of his contemplative state, he notices Mary Jane approaching in an elegant little black dress. Demonstrating his chivalrous side, he guides her to her seat, courteously pulling out the chair for her. Suddenly, his attention is caught by Gwen, a blonde woman smiling at him from afar. He acknowledges her with a wave, reciprocated by another wave from Gwen as she walks away. Misunderstanding the situation, the maitre d' signals for champagne service, but Peter quickly indicates his disapproval, shaking his head to dismiss the waiters. Despite Peter's gestures, Gwen's continued waves are perceived once more as an invitation, prompting the waiters to return, only to be waved off again by Peter's firm refusal. As Mary Jane makes her exit in frustration, the maitre d', undeterred, sets the champagne glasses on the table as a waiter brings over a champagne bucket. While a violinist begins to play a serenade, Peter, in quiet reflection, picks up Mary Jane's abandoned glass and carefully retrieves the ring from within using a fork. He then methodically dries the ring with a napkin, contemplating the events that have unfolded."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Spider-Man propels himself off wreckage and lands on top of the van, attacking Flint with wet balls. Flint punches Spider-Man off and into the truck. As a collision looms, Spider-Man rescues the guards by pulling them out and using his web, causing the van to crash into a parked truck. Flint observes Spider-Man emerging from the red van, and as Flint leaves, the guards drop from a web spun across the street. Spider-Man ascends to a building ledge, removes his mask and left boot, shaking sand from both his hair and boot.\n\nLater, Peter, dressed in a smart suit, approaches the restaurant entrance and retrieves Aunt May's ring from his pocket. Meanwhile, Mary Jane, looking upset, storms past a newsstand. Inside the restaurant, Peter surveys the luxurious setting while a maitre d' summons him, presenting a pen on a silver platter as Peter hands over a note. The maitre d' clenches the pen and escorts Peter to a table. Peter is momentarily distracted by Mary Jane's arrival in a black dress and helps her to her seat. As Gwen waves at Peter, he acknowledges her, prompting the maitre d' to mistakenly summon champagne, which Peter declines. Mary Jane exits in anger, and Peter watches in shock as the maitre d' sets the glasses down. A violinist plays while Peter retrieves the ring from Mary Jane's glass with a fork and dries it using a napkin."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Spider-Man, known for his acrobatic agility and web-slinging skills, hits wreckage and glides off it as if it were a ramp, performing a move often seen in urban freerunning, landing on top of the van and hitting Flint with a volley of wet balls, hardened web projectiles. Flint, or Flint Marko, who is the Sandman and possesses the ability to transform his body into sand-like material, punches Spider-Man off the roof, and although Spider-Man clings on, Flint punches him into the truck. As the van, speeding through the bustling city streets, heads for a collision, Spider-Man pulls the guards out, firing a thread, a strong web line, out of the back of the van, which flints or swerves violently and crashes into a parked truck. Flint watches from the edge of a building above, his usual vantage point that gives him a strategic advantage, as Spider-Man staggers out of the red van, looking around frantically for any remaining threats. As Flint moves off, the rescued guards drop from a web, a soft but strong emergency landing support, spun across the street. Spider-Man wheezes up to the ledge of a building, pulls off his mask, revealing his identity as Peter Parker, and shakes sand, a remnant of his fight with Sandman, from his hair, then pulls off his left boot and shakes out some more sand. Later in the evening, Peter, dressed smartly in a sober suit with his dark hair swept across in a neat side parting, a style reminiscent of classic Hollywood leading men, stops a few feet away from the entrance of the renowned restaurant Constellation, famous for its celestial-themed décor, and pulls Aunt May's ring, a cherished family heirloom, out of his breast pocket. Looking agitated, Mary Jane, Peter's long-time love interest, strides up alongside a newsstand, the kind often seen on busy city streets offering an array of magazines and newspapers, and storms off with a face like thunder, indicating deep upset. Inside the restaurant, Peter takes in the opulent splendor, characterized by luxurious furnishings and ambient lighting, as diners and waiters, representing the bustling service of high-end dining, flip past him, walking across the reception area where he's summoned by a maitre d', a traditionally formal head waiter, behind a small counter. The maitre d' has brought a pen, an elegant fountain pen, on a silver platter, examining it with dark, beady eyes as Peter hands him a note, perhaps containing a special request or reservation confirmation. Clenching his fist, the maitre d' then leads Peter to a table before scurrying away with the efficiency expected in fine dining. Peter snaps out of his role play as he sees Mary Jane coming towards him in a little black dress, a classic choice symbolizing elegance. He shows her to her seat and chivalrously pulls out her chair for her, then spots simpering blonde Gwen, his lab partner and friend, waving at him and waves back. The maitre d' summons the champagne, adhering to the tradition of celebratory dining, but Peter hurriedly shakes his head, leading the maitre d' to wave the waiters away. Gwen waves at Peter as she walks away, and he waves back again. The maitre d' takes this as the signal, and helpless waiters are called off again as Peter shakes his head, signaling not to bring the champagne. The maitre d' bringing the champagne glasses passes Mary Jane as she storms out, upset perhaps by a misunderstanding. Peter stares after Mary Jane in shock as the maitre d' sets the glasses down on the table and the waiter brings a champagne bucket, a sign of the romantic atmosphere Peter intended. As a violinist serenades him, adding a touch of romance through live music, Peter picks up Mary Jane's glass and fishes the ring out of it with a fork, then dries the ring with a napkin, showing his intent for a proposal gone awry."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "SpiderMan hits wreckage and glides off it as if it were a ramp landing on top of the van and hitting Flint with a volley of wet balls. Flint punches SpiderMan off the roof and although SpiderMan clings on Flint punches him into the truck. As the van heads for a collision SpiderMan pulls the guards out firing a thread out of the back of the van which flints and crashes into a parked truck. Flint watches from the edge of a building above as SpiderMan staggers out of the red van looking around frantically. As Flint moves off the rescued guards drop from a web spun across the street. SpiderMan wheezes up to the ledge of a building pulls off his mask and shakes sand from his hair. then pulls off his left boot and shakes out some more sand. Later in the evening Peter dressed smartly in a sober suit with his dark hair swept across in a neat side. parting stops a few feet away from the entrance of the restaurant constellation and pulls Aunt May's ring out of his breast pocket. Looking agitated Mary Jane strides up alongside a newsstand and storms off with a face like thunder. Inside the restaurant Peter takes in the opulent splendor as diners and waiters flip past him walking across the reception area where he is summoned by a maitre d' behind a small counter. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. The maitre d' has brought a pen on a silver platter examining it with dark beady eyes as Peter hands him a note. Clenching his fist. the maitre d' then leads Peter to a table before scurrying away. Peter snaps out of his role play as he sees Mary Jane coming towards him in a little black dress. He shows her to her seat and chivalrously pulls out her chair for her then spots simpering blonde Gwen waving at him and waves back. The maitre d' summons the champagne but Peter hurriedly shakes his head leading the maitre d' to wave the waiters away. Gwen waves at Peter as she walks away and he waves back again. The maitre d' takes this as the signal and helpless waiters are called off again as Peter shakes his head. The maitre d' bringing the champagne glasses passes Mary Jane as she storms out. Peter stares after Mary Jane in shock as the maitre d' sets the glasses down on the table and the waiter brings a champagne bucket. As a violinist serenades him Peter picks up Mary Jane's glass and fishes the ring out of it with a fork. then dries the ring with a napkin."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "SpiderMan hits wreckage and glides off it as if it were a ramp landing on top of the van and hitting Flint with a volley of wet balls. Flint punches SpiderMan off the roof and although SpiderMan clings on Flint punches him into the truck. As the van heads for a collision SpiderMan pulls the guards out firing a thread out of the back of the van which flints and crashes into a parked truck. Flint watches from the edge of a building above as SpiderMan staggers out of the red van looking around frantically. As Flint moves off the rescued guards drop from a web spun across the street. SpiderMan wheezes up to the ledge of a building pulls off his mask and shakes sand from his hair. then pulls off his left boot and shakes out some more sand. Later in the evening Peter dressed smartly in a sober suit with his dark hair swept across in a neat side. parting stops a few feet away from the entrance of the restaurant constellation and pulls Aunt May's ring out of his breast pocket. Looking agitated Mary Jane strides up alongside a newsstand and storms off with a face like thunder. Inside the restaurant Peter takes in the opulent splendor as diners and waiters flip past him walking across the reception area where he is summoned by a maitre d' behind a small counter. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. The maitre d' has brought a pen on a silver platter examining it with dark beady eyes as Peter hands him a note. Clenching his fist. the maitre d' then leads Peter to a table before scurrying away. Peter snaps out of his role play as he sees Mary Jane coming towards him in a little black dress. He shows her to her seat and chivalrously pulls out her chair for her then spots simpering blonde Gwen waving at him and waves back. The maitre d' summons the champagne but Peter hurriedly shakes his head leading the maitre d' to wave the waiters away. Gwen waves at Peter as she walks away and he waves back again. The maitre d' takes this as the signal and helpless waiters are called off again as Peter shakes his head. The maitre d' bringing the champagne glasses passes Mary Jane as she storms out. Peter stares after Mary Jane in shock as the maitre d' sets the glasses down on the table and the waiter brings a champagne bucket. As a violinist serenades him Peter picks up Mary Jane's glass and fishes the ring out of it with a fork. then dries the ring with a napkin."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "SpiderMan hits wreckage and glides off it as if it were a ramp landing on top of the van and hitting Flint with a volley of wet balls. Flint punches SpiderMan off the roof and although SpiderMan clings on Flint punches him into the truck. As the van heads for a collision SpiderMan pulls the guards out firing a thread out of the back of the van which flints and crashes into a parked truck. Flint watches from the edge of a building above as SpiderMan staggers out of the red van looking around frantically. As Flint moves off the rescued guards drop from a web spun across the street. SpiderMan wheezes up to the ledge of a building pulls off his mask and shakes sand from his hair. Gwen waves at Peter as she walks away and he waves back again. The maitre d' takes this as the signal and helpless waiters are called off again as Peter shakes his head. The maitre d' bringing the champagne glasses passes Mary Jane as she storms out. Peter stares after Mary Jane in shock as the maitre d' sets the glasses down on the table and the waiter brings a champagne bucket. As a violinist serenades him Peter picks up Mary Jane's glass and fishes the ring out of it with a fork. then dries the ring with a napkin."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "SpiderMan hits wreckage and glides off it as if it were a ramp landing on top of the van and hitting Flint with a volley of wet balls. Flint punches SpiderMan off the roof and although SpiderMan clings on Flint punches him into the truck. Peter stares after Mary Jane in shock as the maitre d' sets the glasses down on the table and the waiter brings a champagne bucket. As a violinist serenades him Peter picks up Mary Jane's glass and fishes the ring out of it with a fork. then dries the ring with a napkin."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The astronaut bounces off rubble and glides off it as if it were a slide, landing on top of the submarine and spraying Steve with a volley of fruit peels. Steve elbows the astronaut off the deck, and although the astronaut grips on, Steve elbows him into the ship. As the submarine floats towards a bridge, the astronaut pulls the explorers out, lobbing a rope out of the back of the submarine, which unravels and crashes into a moored yacht. Steve observes from the perch of a lighthouse above as the astronaut stumbles out of the blue submarine, glancing around wildly. As Steve drifts away, the saved explorers drop from a net strung across the alley. The astronaut huffs up to the edge of a lighthouse, pulls off his helmet, and shakes confetti from his collar, then pulls off his right glove and shakes out some more confetti. Later in the afternoon, Alex, dressed casually in a vibrant jumpsuit with his curly hair arranged in a carefree side sweep, pauses a few meters away from the entrance of the garage nebula and pulls Grandmother Rose's necklace out of his backpack. Looking flustered, Lisa paces up alongside a kiosk and paces off with a glare like lightning. Inside the garage, Alex takes in the rustic clutter as mechanics and clerks dash past him, walking across the check-in zone where he's summoned by a supervisor behind a tiny stand. The supervisor has brought a feather on a golden tray, inspecting it with bright, keen eyes as Alex hands him a list. Clenching his jaw, the supervisor then leads Alex to a station before shuffling away. Alex snaps out of his daydream as he sees Lisa approaching him in a vibrant red blazer. He shows her to her stool and graciously lifts her napkin for her, then notices grinning brunette Gina nodding at him and nods back. The supervisor calls for the cider, but Alex quickly shakes his hand, prompting the supervisor to shoo the clerks away. Gina nods at Alex as she steps away, and he nods back again. The supervisor takes this as the cue, and bewildered clerks are waved off again as Alex shakes his hand. The supervisor carrying the cider mugs passes Lisa as she storms off. Alex gazes after Lisa in amazement as the supervisor places the mugs down on the counter and the clerk brings a cider jug. As a guitarist strums for him, Alex lifts Lisa's mug and scoops the necklace out of it with a spoon, then wipes the necklace with a towel."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Spider-Man uses wreckage as a ramp to land on a van and attacks Flint with wet balls, but Flint knocks him into a truck. As the van nears a crash, Spider-Man saves the guards and Flint watches as Spider-Man exits the van. Later, Peter, looking sharp in a suit, retrieves Aunt May's ring outside a restaurant. Agitated, Mary Jane walks by angrily. Inside, Peter admires the restaurant's elegance and follows the maitre d' to a table. When Mary Jane arrives, Peter seats her and waves at Gwen, causing confusion with the maitre d'. As Mary Jane leaves upset, Peter retrieves the ring from her champagne glass, using a fork and napkin to dry it."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "then dries the ring with a napkin As a violinist serenades him Peter picks up Mary Jane's glass and fishes the ring out of it with a fork Peter stares after Mary Jane in shock as the maitre d' sets the glasses down on the table and the waiter brings a champagne bucket The maitre d' bringing the champagne glasses passes Mary Jane as she storms out The maitre d' takes this as the signal and helpless waiters are called off again as Peter shakes his head Gwen waves at Peter as she walks away and he waves back again The maitre d' summons the champagne but Peter hurriedly shakes his head leading the maitre d' to wave the waiters away He shows her to her seat and chivalrously pulls out her chair for her then spots simpering blonde Gwen waving at him and waves back Peter snaps out of his role play as he sees Mary Jane coming towards him in a little black dress the maitre d' then leads Peter to a table before scurrying away Clenching his fist The maitre d' has brought a pen on a silver platter examining it with dark beady eyes as Peter hands him a note Inside the restaurant Peter takes in the opulent splendor as diners and waiters flip past him walking across the reception area where he is summoned by a maitre d' behind a small counter Looking agitated Mary Jane strides up alongside a newsstand and storms off with a face like thunder parting stops a few feet away from the entrance of the restaurant constellation and pulls Aunt May's ring out of his breast pocket Later in the evening Peter dressed smartly in a sober suit with his dark hair swept across in a neat side then pulls off his left boot and shakes out some more sand SpiderMan wheezes up to the ledge of a building pulls off his mask and shakes sand from his hair As Flint moves off the rescued guards drop from a web spun across the street Flint watches from the edge of a building above as SpiderMan staggers out of the red van looking around frantically As the van heads for a collision SpiderMan pulls the guards out firing a thread out of the back of the van which flints and crashes into a parked truck Flint punches SpiderMan off the roof and although SpiderMan clings on Flint punches him into the truck SpiderMan hits wreckage and glides off it as if it were a ramp landing on top of the van and hitting Flint with a volley of wet balls"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Flint punches SpiderMan off the roof and although SpiderMan clings on Flint punches him into the truck SpiderMan hits wreckage and glides off it as if it were a ramp landing on top of the van and hitting Flint with a volley of wet balls Flint watches from the edge of a building above as SpiderMan staggers out of the red van looking around frantically As the van heads for a collision SpiderMan pulls the guards out firing a thread out of the back of the van which flints and crashes into a parked truck SpiderMan wheezes up to the ledge of a building pulls off his mask and shakes sand from his hair As Flint moves off the rescued guards drop from a web spun across the street Later in the evening Peter dressed smartly in a sober suit with his dark hair swept across in a neat side then pulls off his left boot and shakes out some more sand Looking agitated Mary Jane strides up alongside a newsstand and storms off with a face like thunder parting stops a few feet away from the entrance of the restaurant constellation and pulls Aunt May's ring out of his breast pocket The maitre d' has brought a pen on a silver platter examining it with dark beady eyes as Peter hands him a note Inside the restaurant Peter takes in the opulent splendor as diners and waiters flip past him walking across the reception area where he is summoned by a maitre d' behind a small counter the maitre d' then leads Peter to a table before scurrying away Clenching his fist He shows her to her seat and chivalrously pulls out her chair for her then spots simpering blonde Gwen waving at him and waves back Peter snaps out of his role play as he sees Mary Jane coming towards him in a little black dress Gwen waves at Peter as she walks away and he waves back again The maitre d' summons the champagne but Peter hurriedly shakes his head leading the maitre d' to wave the waiters away The maitre d' bringing the champagne glasses passes Mary Jane as she storms out The maitre d' takes this as the signal and helpless waiters are called off again as Peter shakes his head As a violinist serenades him Peter picks up Mary Jane's glass and fishes the ring out of it with a fork Peter stares after Mary Jane in shock as the maitre d' sets the glasses down on the table and the waiter brings a champagne bucket then dries the ring with a napkin"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Clenching his fist the maitre d' then leads Peter to a table before scurrying away Peter snaps out of his role play as he sees Mary Jane coming towards him in a little black dress He shows her to her seat and chivalrously pulls out her chair for her then spots simpering blonde Gwen waving at him and waves back The maitre d' summons the champagne but Peter hurriedly shakes his head leading the maitre d' to wave the waiters away Gwen waves at Peter as she walks away and he waves back again The maitre d' takes this as the signal and helpless waiters are called off again as Peter shakes his head The maitre d' bringing the champagne glasses passes Mary Jane as she storms out Peter stares after Mary Jane in shock as the maitre d' sets the glasses down on the table and the waiter brings a champagne bucket As a violinist serenades him Peter picks up Mary Jane's glass and fishes the ring out of it with a fork then dries the ring with a napkin SpiderMan hits wreckage and glides off it as if it were a ramp landing on top of the van and hitting Flint with a volley of wet balls Flint punches SpiderMan off the roof and although SpiderMan clings on Flint punches him into the truck As the van heads for a collision SpiderMan pulls the guards out firing a thread out of the back of the van which flints and crashes into a parked truck Flint watches from the edge of a building above as SpiderMan staggers out of the red van looking around frantically As Flint moves off the rescued guards drop from a web spun across the street SpiderMan wheezes up to the ledge of a building pulls off his mask and shakes sand from his hair then pulls off his left boot and shakes out some more sand Later in the evening Peter dressed smartly in a sober suit with his dark hair swept across in a neat side parting stops a few feet away from the entrance of the restaurant constellation and pulls Aunt May's ring out of his breast pocket Looking agitated Mary Jane strides up alongside a newsstand and storms off with a face like thunder Inside the restaurant Peter takes in the opulent splendor as diners and waiters flip past him walking across the reception area where he is summoned by a maitre d' behind a small counter The maitre d' has brought a pen on a silver platter examining it with dark beady eyes as Peter hands him a note"
        }
      ]
    }
  ]
}