{
  "ground_truth": "They hurry through a door to a gymnasium. Jack places his hand on Rose's cheek, and Rose places her gloved hand over his. She steps outside, and Jack watches her leave through a wavy window glass, then gazes downward. Later, in the first-class lounge, Ruth, Rose, the Countess, and another woman drink tea. Rose gazes toward another table where a woman pulls a slouching young girl upright, and Rose watches the girl place a napkin on her lap with her small gloved hands. Jack leans on a railing for balance and stares into the sea as wind ruffles his hair. Rose steps across the deck toward him, and he turns and faces her; Jack smiles, and Rose walks toward him and reaches out. They hold hands, and Jack gently pulls her toward himself. Rose closes her eyes, and grasping her hand, Jack helps Rose onto the bow, rail platform. They both step onto the lowest rung of the railing, and then she holds her arms out like wings as the wind blows her shawl back on her outstretched arms. He places his hands around her waist as she opens her eyes. Black smoke trails from the ship's funnels as Jack and Rose stand at the rail high above the water. Jack reaches out and grasps Rose's hands and leans his face close to hers. Jack folds Rose's arms around her waist, and she turns his face to him, and they kiss. Rose places her hand on the back of Jack's neck. The sunken Titanic sits on the bottom of the ocean as the elderly Rose turns from a monitor and addresses the crew of the salvage vessel. Rose gazes back at the monitor, which shows the underwater image of the fireplace in her former suite. The room transforms into its former state as young Rose and Jack step inside. Jack rushes toward a painting, and Rose opens the safe. Rose hands the Heart of the Ocean necklace to Jack, who shakes his head as he examines the faceted blue diamond, and then Jack turns to Rose. Later, Rose removes the butterfly comb from her hair and shakes out her hair, which falls to her shoulders. Jack drags a settee to the center of the room and places one pillow atop another. Sitting in a chair near the settee, Jack opens a canvas bag, removes a knife and a thin stick of charcoal which he sharpens, and looks up as Rose steps into the room. Holding a kimono close with one hand, Rose lifts a sash and twirls it. Jack smiles as Rose steps toward him, and he sits back as she tosses a dime to him. Rose steps backward, then slips the kimono from her shoulders, and the kimono slides to the floor. Naked, Rose runs her fingertips over her own thigh.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "They hasten through a portal to a gymnasium. Jack places his palm on Rose's cheek, and Rose places her gloved palm over his. She strides outside, and Jack observes her depart through a wavy windowpane, then looks downward. Later, in the first-class lounge, Ruth, Rose, the Countess, and another woman sip tea. Rose looks toward another table where a woman pulls a slouching young girl upright, and Rose observes the girl place a napkin on her lap with her small gloved palms. Jack leans on a banister for balance and gazes into the ocean as breeze ruffles his hair. Rose steps across the deck toward him, and he turns and faces her; Jack grins, and Rose walks toward him and extends out. They grasp hands, and Jack gently draws her toward himself. Rose closes her eyes, and holding her palm, Jack assists Rose onto the bow, rail platform. They both step onto the lowest rung of the banister, and then she holds her arms out like wings as the breeze blows her shawl back on her outstretched arms. He places his palms around her waist as she opens her eyes. Black smoke trails from the ship's funnels as Jack and Rose stand at the banister high above the water. Jack extends out and clasps Rose's palms and leans his visage close to hers. Jack folds Rose's arms around her waist, and she turns his visage to him, and they kiss. Rose places her palm on the back of Jack's neck. The sunken Titanic rests on the bottom of the ocean as the elderly Rose turns from a monitor and addresses the crew of the salvage vessel. Rose gazes back at the monitor, which shows the underwater image of the fireplace in her former suite. The chamber transforms into its former condition as young Rose and Jack step inside. Jack rushes toward a painting, and Rose opens the safe. Rose hands the Heart of the Ocean necklace to Jack, who shakes his head as he examines the faceted blue gem, and then Jack turns to Rose. Later, Rose removes the butterfly pin from her hair and shakes out her hair, which falls to her shoulders. Jack drags a settee to the middle of the chamber and places one cushion atop another. Sitting in a seat near the settee, Jack opens a canvas bag, removes a knife and a thin stick of charcoal which he sharpens, and looks up as Rose steps into the chamber. Holding a kimono close with one palm, Rose lifts a sash and twirls it. Jack grins as Rose steps toward him, and he sits back as she tosses a coin to him. Rose steps backward, then slips the kimono from her shoulders, and the kimono slides to the floor. Naked, Rose runs her fingertips over her own thigh."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Through a door to a gymnasium, they are hurried. A hand is placed by Jack on Rose's cheek, and his is covered by Rose's gloved hand. She is watched by Jack as she steps outside and leaves through a wavy window glass, then downward his gaze is directed. Later, in the first-class lounge, tea is drunk by Ruth, Rose, the Countess, and another woman. Toward another table, Rose gazes, where a slouching young girl is pulled upright by a woman, and the girl is watched by Rose as a napkin is placed on her lap with her small gloved hands. For balance, a railing is leaned on by Jack as the sea is stared into by him and wind ruffles his hair. Toward him, Rose steps across the deck, and he turns and faces her; a smile is given by Jack, and Rose walks toward him and reaches out. Their hands are held, and she is gently pulled toward himself by Jack. Her eyes are closed by Rose, and onto the bow rail platform, Rose is helped by Jack while grasping her hand. Onto the lowest rung of the railing, both step, and then her arms are held out like wings by her as the wind blows her shawl back on her outstretched arms. Around her waist, his hands are placed by him as her eyes are opened. From the ship's funnels, black smoke is trailed as Jack and Rose stand at the rail high above the water. Outward, Jack reaches and grasps Rose's hands and his face is leaned close to hers. Around her waist, Rose's arms are folded by Jack, and his face is turned to him by her, and a kiss is shared by them. On the back of Jack's neck, her hand is placed by Rose. On the bottom of the ocean, the sunken Titanic sits as the elderly Rose turns from a monitor and addresses the crew of the salvage vessel. Back at the monitor, Rose gazes, which shows the underwater image of the fireplace in her former suite. Into its former state, the room is transformed as young Rose and Jack step inside. Toward a painting, Jack rushes, and the safe is opened by Rose. To Jack, the Heart of the Ocean necklace is handed by Rose, who shakes his head as the faceted blue diamond is examined by him, and then to Rose, Jack turns. Later, from her hair, the butterfly comb is removed by Rose and her hair is shaken out, which falls to her shoulders. To the center of the room, a settee is dragged by Jack and one pillow is placed atop another. In a chair near the settee, Jack sits and a canvas bag is opened by him, a knife and a thin stick of charcoal are removed and sharpened, and he looks up as Rose steps into the room. A kimono is held close with one hand by her, a sash is lifted and twirled. Toward him, Rose steps as a smile is given by Jack, and back he sits as a dime is tossed to him by her. Rose steps backward, then from her shoulders, the kimono is slipped, and to the floor, the kimono slides. Over her own thigh, her fingertips are run by naked Rose."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "They hurry into a gymnasium. Jack touches Rose's cheek, and she places her gloved hand over his. She exits, and Jack watches through wavy glass, then looks down. Later, in the first-class lounge, Ruth, Rose, the Countess, and another woman drink tea. Rose observes a woman pulling a slouching girl upright, who then places a napkin on her lap with small gloved hands. Jack leans on a railing, gazing at the sea as the wind tousles his hair. Rose approaches him on the deck; Jack smiles, and they hold hands as he gently pulls her close. Rose closes her eyes, and Jack helps her onto the bow rail platform. They step onto the lowest rung, and she extends her arms like wings as the wind blows her shawl back. He holds her waist as she opens her eyes. Black smoke trails from the ship's funnels as they stand high above the water. Jack grasps Rose's hands, leans close, folds her arms around her waist, and they kiss. Rose touches the back of Jack's neck. The sunken Titanic rests on the ocean floor as elderly Rose turns from a monitor to address the salvage vessel crew. She looks back at the monitor showing the underwater image of her suite's fireplace. The room transforms as young Rose and Jack enter. Jack rushes to a painting, and Rose opens the safe, handing the Heart of the Ocean necklace to Jack, who examines the blue diamond and turns to Rose. Later, Rose removes a butterfly comb, letting her hair fall. Jack drags a settee to the room's center, places pillows, and opens a canvas bag, removing a knife and charcoal stick. He looks up as Rose enters, holding a kimono and twirling a sash. Jack smiles as she approaches, and he sits back as she tosses a dime to him. Rose steps back, slips off the kimono, and it falls to the floor. Naked, she runs her fingertips over her thigh."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "They rush into a gymnasium. Jack touches Rose's cheek, and she places her gloved hand over his. She leaves, and Jack watches through wavy glass, then looks down. In the first-class lounge, Ruth, Rose, the Countess, and another woman drink tea. Rose observes a woman correcting a slouching girl, who places a napkin on her lap with gloved hands. Jack leans on a railing, staring at the sea as the wind ruffles his hair. Rose approaches him on the deck; Jack smiles, and they hold hands. Jack pulls her close, and Rose closes her eyes. Jack helps her onto the bow rail platform. They step onto the railing, and she spreads her arms like wings as the wind blows her shawl. He holds her waist as she opens her eyes. Black smoke trails from the ship's funnels as they stand at the rail. Jack grasps Rose's hands, leans close, and they kiss. Rose touches Jack's neck. The sunken Titanic rests on the ocean floor as elderly Rose addresses the salvage crew. She looks at a monitor showing her suite's fireplace, which transforms as young Rose and Jack enter. Jack examines a painting, and Rose opens the safe, handing him the Heart of the Ocean necklace. Jack shakes his head, examining the blue diamond, then turns to Rose. Later, Rose removes a butterfly comb, letting her hair fall. Jack moves a settee, places pillows, and sharpens charcoal. Rose enters, holding a kimono, twirls a sash, and tosses a dime to Jack. She slips off the kimono, and naked, runs her fingertips over her thigh."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "They quickly hurry through a door that leads them into a spacious gymnasium. Jack gently places his hand on Rose's cheek, and in response, Rose places her gloved hand over his, creating a tender moment between them. She then steps outside, and Jack watches her leave through the wavy glass of the window, then lowers his gaze thoughtfully. Later, in the elegant first-class lounge, Ruth, Rose, the Countess, and another woman are seated, enjoying their tea. Rose's attention is drawn toward another table where a woman is seen pulling a slouching young girl upright, and Rose observes as the girl carefully places a napkin on her lap with her small, gloved hands. Meanwhile, Jack leans on a railing for support and stares contemplatively into the vast sea as the wind playfully ruffles his hair. Rose steps across the deck toward him, and as he turns to face her, Jack smiles warmly. Rose walks toward him and reaches out her hand. They hold hands, and Jack gently pulls her closer to himself. Rose closes her eyes, and with Jack grasping her hand, he assists Rose onto the bow, rail platform. Together, they both step onto the lowest rung of the railing, and then she extends her arms out like wings as the wind blows her shawl back on her outstretched arms. He places his hands securely around her waist as she opens her eyes to the view. Black smoke trails from the ship's funnels as Jack and Rose stand at the rail high above the water. Jack reaches out and grasps Rose's hands, leaning his face close to hers. Jack folds Rose's arms around her waist, and she turns his face to him, and they share a tender kiss. Rose places her hand gently on the back of Jack's neck. The sunken Titanic rests on the ocean floor as the elderly Rose turns away from a monitor and addresses the crew of the salvage vessel. Rose gazes back at the monitor, which displays the underwater image of the fireplace in her former suite. The room magically transforms into its former state as young Rose and Jack step inside. Jack rushes eagerly toward a painting, and Rose opens the safe. Rose hands the Heart of the Ocean necklace to Jack, who shakes his head in awe as he examines the faceted blue diamond, and then Jack turns to look at Rose. Later, Rose removes the butterfly comb from her hair and shakes out her hair, which cascades down to her shoulders. Jack drags a settee to the center of the room and carefully places one pillow atop another. Sitting in a chair near the settee, Jack opens a canvas bag, removes a knife and a thin stick of charcoal which he sharpens with precision, and looks up as Rose steps into the room. Holding a kimono close with one hand, Rose lifts a sash and twirls it playfully. Jack smiles as Rose steps toward him, and he sits back as she tosses a dime to him. Rose steps backward, then gracefully slips the kimono from her shoulders, allowing it to slide to the floor. Naked, Rose runs her fingertips gently over her own thigh."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "They move with haste as they quickly hurry through a door, which leads them into a spacious and open gymnasium. In a gentle and affectionate gesture, Jack places his hand softly on Rose's cheek, and in response to this tender act, Rose places her gloved hand over his, creating a beautiful and intimate moment between them. After sharing this moment, she steps outside, and Jack watches as she leaves through the wavy glass of the window, then lowers his gaze thoughtfully, lost in his own reflections. \n\nIn a later scene, within the elegant and refined first-class lounge, Ruth, Rose, the Countess, and another woman are comfortably seated, enjoying their tea in an atmosphere of sophistication. Rose's attention is soon captured by another table where a woman is seen pulling a slouching young girl into an upright posture. Rose observes with interest as the girl meticulously places a napkin on her lap with her small, gloved hands, exhibiting careful etiquette. Meanwhile, Jack leans on a railing for support and gazes contemplatively into the vast, endless sea as the wind playfully ruffles his hair, adding to his pensive expression.\n\nRose steps gracefully across the deck toward him, and as he turns to face her, Jack greets her with a warm and inviting smile. Rose walks toward him purposefully and reaches out her hand to him. They gently hold hands, and Jack carefully pulls her closer to him. Rose closes her eyes, allowing herself to feel the moment, and with Jack firmly grasping her hand, he assists Rose onto the bow, rail platform. Together, they both step onto the lowest rung of the railing, and then she extends her arms out like wings, embracing the moment as the wind blows her shawl back over her outstretched arms. With his hands placed securely around her waist, she opens her eyes to the breathtaking view. Black smoke trails slowly from the ship's funnels as Jack and Rose stand together at the rail high above the water. Jack reaches out and tenderly grasps Rose's hands, leaning his face close to hers. In a loving gesture, Jack folds Rose's arms around her waist, and she turns his face toward her, leading to a tender and heartfelt kiss. Rose gently places her hand on the back of Jack's neck, deepening their connection.\n\nThe scene transitions to the sunken Titanic, resting solemnly on the ocean floor as the elderly Rose turns away from a monitor and addresses the crew of the salvage vessel with her story. Rose then gazes back at the monitor, which displays the underwater image of the fireplace in her former suite. In a magical transformation, the room returns to its former state as a past memory, with young Rose and Jack stepping inside. Jack rushes with eagerness toward a painting, filled with admiration, while Rose opens the safe. She hands the glittering Heart of the Ocean necklace to Jack, who shakes his head in awe as he examines the stunning faceted blue diamond, and then Jack turns to look at Rose with admiration.\n\nLater, Rose slowly removes the butterfly comb from her hair and lets her hair fall naturally, cascading down to her shoulders. Jack drags a settee to the center of the room with care and thoughtfully places one pillow atop another, creating a comfortable setting. Sitting thoughtfully in a chair near the settee, Jack opens a canvas bag and meticulously removes a knife along with a thin stick of charcoal. Sharpening the charcoal with precision, he looks up just as Rose steps into the room, holding a kimono close with one hand. She lifts a sash and twirls it playfully, drawing Jack's attention. He smiles warmly as Rose steps toward him, and he sits back as she tosses a dime to him playfully. With elegance, Rose steps backward and then gracefully allows the kimono to slip from her shoulders, watching it slide gently to the floor. Naked, she delicately runs her fingertips over her own thigh, embodying a sense of freedom and confidence."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "They move quickly through a door leading into a gymnasium, their pace brisk and purposeful. Jack gently places his hand on Rose's cheek, feeling the warmth of her skin beneath his touch, while Rose, in response, places her gloved hand over his, creating a moment of tender connection. She then turns and steps outside, leaving Jack behind as he watches her departure through the distorted view of a wavy window glass, his gaze eventually dropping downward in contemplation. Later, in the refined setting of the first-class lounge, Ruth, Rose, the Countess, and another woman sit together, sipping tea from delicate cups. Rose's attention drifts toward another table where she observes a woman gently pulling a slouching young girl upright, prompting Rose to watch as the girl carefully places a napkin on her lap with her small, gloved hands. Meanwhile, Jack leans against a railing for support, his eyes fixed on the vast expanse of the sea, while the wind playfully ruffles his hair. Rose makes her way across the deck toward him, her steps deliberate and steady. As she approaches, Jack turns to face her, a smile spreading across his face. Rose continues to walk toward him, reaching out with her hand, and they clasp hands, feeling the warmth and connection between them. Jack gently draws her closer to himself, and Rose closes her eyes, trusting him completely. With a firm yet gentle grip on her hand, Jack assists Rose onto the bow's rail platform. Together, they step onto the lowest rung of the railing, and Rose extends her arms outward like wings, embracing the sensation of the wind blowing her shawl back along her outstretched arms. Jack places his hands around her waist, providing support as she opens her eyes to take in the breathtaking view. Black smoke trails from the ship's funnels, creating a stark contrast against the sky as Jack and Rose stand at the rail, high above the water. Jack reaches out, grasping Rose's hands, and leans his face close to hers, their proximity creating an intimate moment. He then folds Rose's arms around her waist, and she turns her face to him, their eyes meeting before they share a tender kiss. Rose places her hand on the back of Jack's neck, deepening their connection. The scene shifts to the sunken Titanic resting on the ocean floor, as the elderly Rose turns away from a monitor and addresses the crew of the salvage vessel. Her gaze returns to the monitor, which displays the underwater image of the fireplace in her former suite. The room magically transforms into its former grandeur as young Rose and Jack step inside. Jack eagerly rushes toward a painting, while Rose opens the safe with anticipation. She hands the Heart of the Ocean necklace to Jack, who shakes his head in awe as he examines the faceted blue diamond, before turning his attention back to Rose. Later, Rose removes the butterfly comb from her hair, allowing her hair to cascade down to her shoulders. Jack drags a settee to the center of the room, carefully arranging one pillow atop another. Seated in a chair near the settee, Jack opens a canvas bag, methodically removing a knife and a thin stick of charcoal, which he sharpens with precision. He looks up as Rose steps into the room, holding a kimono close with one hand while lifting a sash and twirling it playfully. Jack smiles at her approach, sitting back as she tosses a dime to him with a playful gesture. Rose steps backward, then lets the kimono slip from her shoulders, allowing it to slide gracefully to the floor. Now naked, Rose runs her fingertips over her own thigh, embracing her vulnerability and the moment's intimacy."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "They hurry through a door to a gymnasium, where Jack tenderly touches Rose's cheek, and she reciprocates with her gloved hand. As Rose steps outside, Jack watches her leave through the wavy window glass before looking down. Later, in the first-class lounge, Rose, Ruth, the Countess, and another woman enjoy tea. Rose observes a nearby table where a woman corrects a young girl's posture, and the girl places a napkin on her lap with her small gloved hands. Meanwhile, Jack leans on a railing, gazing into the sea as the wind tousles his hair. Rose approaches him on the deck, and they exchange smiles before holding hands. Jack gently pulls her close, and with her eyes closed, Rose steps onto the bow rail platform with his help. Together, they stand on the lowest rung of the railing, and Rose extends her arms like wings as the wind catches her shawl. Jack places his hands around her waist, and as she opens her eyes, they stand at the rail high above the water. Jack leans in, grasping Rose's hands, and they share a kiss as she places her hand on the back of his neck. The scene shifts to the sunken Titanic on the ocean floor, where the elderly Rose turns from a monitor to address the salvage vessel crew. She looks back at the monitor displaying the underwater image of her former suite's fireplace, which transforms into its original state as young Rose and Jack enter. Jack rushes to a painting while Rose opens the safe, handing the Heart of the Ocean necklace to Jack, who examines it before turning to her. Later, Rose removes a butterfly comb, letting her hair fall to her shoulders. Jack prepares a settee with pillows and sharpens a charcoal stick, looking up as Rose enters. Holding a kimono, she twirls a sash, and Jack smiles as she approaches, tossing him a dime. Rose then slips the kimono from her shoulders, letting it fall to the floor, and runs her fingertips over her thigh."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "They hurry through a door to a gymnasium, which echoes with the sounds of previous athletic endeavors. Jack places his hand on Rose's cheek, and Rose places her gloved hand over his, the soft leather a testament to the elegant fashion of their era. She steps outside, and Jack watches her leave through a wavy window glass, reminiscent of the old shipbuilding techniques of the early 1900s, then gazes downward. Later, in the first-class lounge, lavishly adorned with plush furnishings typical of luxury ocean liners of the time, Ruth, Rose, the Countess of Rothes, a well-known socialite from the Titanic's passenger list, and another woman drink tea. Rose gazes toward another table where a woman pulls a slouching young girl upright, a reminder of the strict etiquette lessons of the day, and Rose watches the girl place a napkin on her lap with her small gloved hands. Jack leans on a railing for balance and stares into the sea, a vast expanse that stretches for miles, as wind ruffles his hair. Rose steps across the deck toward him, and he turns and faces her; Jack smiles, a smile reminiscent of youthful optimism, and Rose walks toward him and reaches out. They hold hands, and Jack gently pulls her toward himself, feeling the chill of the ocean air. Rose closes her eyes, and grasping her hand, Jack helps Rose onto the bow, rail platform, known as the 'prow' by sailors. They both step onto the lowest rung of the railing, and then she holds her arms out like wings as the wind blows her shawl back on her outstretched arms, capturing the exhilarating sense of freedom. He places his hands around her waist as she opens her eyes. Black smoke trails from the ship's funnels, evidence of the coal-powered engines, as Jack and Rose stand at the rail high above the water. Jack reaches out and grasps Rose's hands and leans his face close to hers. Jack folds Rose's arms around her waist, and she turns his face to him, and they kiss. Rose places her hand on the back of Jack's neck. The sunken Titanic, resting in the icy depths of the North Atlantic since its tragic journey in 1912, sits on the bottom of the ocean as the elderly Rose turns from a monitor and addresses the crew of the salvage vessel. Rose gazes back at the monitor, which shows the underwater image of the fireplace in her former suite, rich with the opulence of that era. The room transforms into its former state as young Rose and Jack step inside. Jack rushes toward a painting, perhaps by one of the masters like Monet or Degas, and Rose opens the safe. Rose hands the Heart of the Ocean, a necklace rumored to be inspired by the Hope Diamond, to Jack, who shakes his head as he examines the faceted blue diamond, and then Jack turns to Rose. Later, Rose removes the butterfly comb from her hair and shakes out her hair, which falls to her shoulders in a cascade, reminiscent of the carefree styles of the time. Jack drags a settee, an elegant piece of furniture, to the center of the room and places one pillow atop another. Sitting in a chair near the settee, Jack opens a canvas bag, removes a knife and a thin stick of charcoal which he sharpens with precision, and looks up as Rose steps into the room. Holding a kimono close with one hand, a nod to the exotic influences in Western fashion, Rose lifts a sash and twirls it. Jack smiles as Rose steps toward him, and he sits back as she tosses a dime to him, a coin that was part of their playful exchanges. Rose steps backward, then slips the kimono from her shoulders, and the kimono slides to the floor. Naked, Rose runs her fingertips over her own thigh, a gesture that captures both vulnerability and confidence."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Later in the firstclass lounge Ruth Rose the Countess and another woman drink tea  Rose gazes toward another table where a woman pulls a slouching young girl upright and Rose watches the girl place a napkin on her lap with her small gloved hands  Jack leans on a railing for balance and stares into the sea as wind ruffles his hair  Rose steps across the deck toward him and he turns and faces her  Jack smiles and Rose walks toward him and reaches out  They hold hands and Jack gently pulls her toward himself  Rose closes her eyes and grasping her hand  Jack helps Rose onto the bow rail platform  They both step onto the lowest rung of the railing and then she holds her arms out like wings as the wind blows her shawl back on her outstretched arms  He places his hands around her waist as she opens her eyes  Black smoke trails from the ship's funnels as Jack and Rose stand at the rail high above the water  Jack reaches out and grasps Rose's hands and leans his face close to hers  Jack folds Rose's arms around her waist and she turns his face to him and they kiss  Rose places her hand on the back of Jack's neck  The sunken Titanic sits on the bottom of the ocean as the elderly Rose turns from a monitor and addresses the crew of the salvage vessel  They hurry through a door to a gymnasium  Jack places his hand on Rose's cheek and Rose places her gloved hand over his  She steps outside and Jack watches her leave through a wavy window glass then gazes downward  Later in the firstclass lounge Ruth Rose the Countess and another woman drink tea  Rose gazes toward another table where a woman pulls a slouching young girl upright and Rose watches the girl place a napkin on her lap with her small gloved hands  Jack leans on a railing for balance and stares into the sea as wind ruffles his hair  Rose steps across the deck toward him and he turns and faces her  Jack smiles and Rose walks toward him and reaches out  They hold hands and Jack gently pulls her toward himself  Rose closes her eyes and grasping her hand  Jack helps Rose onto the bow rail platform  They both step onto the lowest rung of the railing and then she holds her arms out like wings as the wind blows her shawl back on her outstretched arms  He places his hands around her waist as she opens her eyes  Black smoke trails from the ship's funnels as Jack and Rose stand at the rail high above the water  Jack reaches out and grasps Rose's hands and leans his face close to hers  Jack folds Rose's arms around her waist and she turns his face to him and they kiss  Rose places her hand on the back of Jack's neck  The sunken Titanic sits on the bottom of the ocean as the elderly Rose turns from a monitor and addresses the crew of the salvage vessel  Rose gazes back at the monitor which shows the underwater image of the fireplace in her former suite  The room transforms into its former state as young Rose and Jack step inside  Jack rushes toward a painting and Rose opens the safe  Rose hands the Heart of the Ocean necklace to Jack who shakes his head as he examines the faceted blue diamond and then Jack turns to Rose  Later Rose removes the butterfly comb from her hair and shakes out her hair which falls to her shoulders  Jack drags a settee to the center of the room and places one pillow atop another  Sitting in a chair near the settee Jack opens a canvas bag removes a knife and a thin stick of charcoal which he sharpens and looks up as Rose steps into the room  Holding a kimono close with one hand Rose lifts a sash and twirls it  Jack smiles as Rose steps toward him and he sits back as she tosses a dime to him  Rose steps backward  then slips the kimono from her shoulders and the kimono slides to the floor  Naked Rose runs her fingertips over her own thigh"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "They hurry through a door to a gymnasium. Jack places his hand on Rose's cheek and Rose places her gloved hand over his. She steps outside and Jack watches her leave through a wavy window glass then gazes downward. Later in the firstclass lounge Ruth Rose the Countess and another woman drink tea. Rose gazes toward another table where a woman pulls a slouching young girl upright and Rose watches the girl place a napkin on her lap with her small gloved hands. Jack leans on a railing for balance and stares into the sea as wind ruffles his hair. Rose steps across the deck toward him and he turns and faces her. Jack smiles and Rose walks toward him and reaches out. They hold hands and Jack gently pulls her toward himself. Rose closes her eyes and grasping her hand. Jack helps Rose onto the bow rail platform. They both step onto the lowest rung of the railing and then she holds her arms out like wings as the wind blows her shawl back on her outstretched arms. He places his hands around her waist as she opens her eyes. Black smoke trails from the ship's funnels as Jack and Rose stand at the rail high above the water. Jack reaches out and grasps Rose's hands and leans his face close to hers. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Jack folds Rose's arms around her waist and she turns his face to him and they kiss. Rose places her hand on the back of Jack's neck. The sunken Titanic sits on the bottom of the ocean as the elderly Rose turns from a monitor and addresses the crew of the salvage vessel. Rose gazes back at the monitor which shows the underwater image of the fireplace in her former suite. The room transforms into its former state as young Rose and Jack step inside. Jack rushes toward a painting and Rose opens the safe. Rose hands the Heart of the Ocean necklace to Jack who shakes his head as he examines the faceted blue diamond and then Jack turns to Rose. Later Rose removes the butterfly comb from her hair and shakes out her hair which falls to her shoulders. Jack drags a settee to the center of the room and places one pillow atop another. Sitting in a chair near the settee Jack opens a canvas bag removes a knife and a thin stick of charcoal which he sharpens and looks up as Rose steps into the room. Holding a kimono close with one hand Rose lifts a sash and twirls it. Jack smiles as Rose steps toward him and he sits back as she tosses a dime to him. Rose steps backward. then slips the kimono from her shoulders and the kimono slides to the floor. Naked Rose runs her fingertips over her own thigh."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "They hurry through a door to a gymnasium. Jack places his hand on Rose's cheek and Rose places her gloved hand over his. She steps outside and Jack watches her leave through a wavy window glass then gazes downward. Later in the firstclass lounge Ruth Rose the Countess and another woman drink tea. Rose gazes toward another table where a woman pulls a slouching young girl upright and Rose watches the girl place a napkin on her lap with her small gloved hands. Jack leans on a railing for balance and stares into the sea as wind ruffles his hair. Rose steps across the deck toward him and he turns and faces her. Jack smiles and Rose walks toward him and reaches out. They hold hands and Jack gently pulls her toward himself. Rose closes her eyes and grasping her hand. Jack helps Rose onto the bow rail platform. They both step onto the lowest rung of the railing and then she holds her arms out like wings as the wind blows her shawl back on her outstretched arms. He places his hands around her waist as she opens her eyes. Black smoke trails from the ship's funnels as Jack and Rose stand at the rail high above the water. Jack reaches out and grasps Rose's hands and leans his face close to hers. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Jack folds Rose's arms around her waist and she turns his face to him and they kiss. Rose places her hand on the back of Jack's neck. The sunken Titanic sits on the bottom of the ocean as the elderly Rose turns from a monitor and addresses the crew of the salvage vessel. Rose gazes back at the monitor which shows the underwater image of the fireplace in her former suite. The room transforms into its former state as young Rose and Jack step inside. Jack rushes toward a painting and Rose opens the safe. Rose hands the Heart of the Ocean necklace to Jack who shakes his head as he examines the faceted blue diamond and then Jack turns to Rose. Later Rose removes the butterfly comb from her hair and shakes out her hair which falls to her shoulders. Jack drags a settee to the center of the room and places one pillow atop another. Sitting in a chair near the settee Jack opens a canvas bag removes a knife and a thin stick of charcoal which he sharpens and looks up as Rose steps into the room. Holding a kimono close with one hand Rose lifts a sash and twirls it. Jack smiles as Rose steps toward him and he sits back as she tosses a dime to him. Rose steps backward. then slips the kimono from her shoulders and the kimono slides to the floor. Naked Rose runs her fingertips over her own thigh."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "They hurry through a door to a gymnasium. Jack places his hand on Rose's cheek and Rose places her gloved hand over his. She steps outside and Jack watches her leave through a wavy window glass then gazes downward. Later in the firstclass lounge Ruth Rose the Countess and another woman drink tea. Rose gazes toward another table where a woman pulls a slouching young girl upright and Rose watches the girl place a napkin on her lap with her small gloved hands. Jack leans on a railing for balance and stares into the sea as wind ruffles his hair. Rose steps across the deck toward him and he turns and faces her. Jack smiles and Rose walks toward him and reaches out. Jack drags a settee to the center of the room and places one pillow atop another. Sitting in a chair near the settee Jack opens a canvas bag removes a knife and a thin stick of charcoal which he sharpens and looks up as Rose steps into the room. Holding a kimono close with one hand Rose lifts a sash and twirls it. Jack smiles as Rose steps toward him and he sits back as she tosses a dime to him. Rose steps backward. then slips the kimono from her shoulders and the kimono slides to the floor. Naked Rose runs her fingertips over her own thigh."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "They hurry through a door to a gymnasium. Jack places his hand on Rose's cheek and Rose places her gloved hand over his. She steps outside and Jack watches her leave through a wavy window glass then gazes downward. Rose steps backward. then slips the kimono from her shoulders and the kimono slides to the floor. Naked Rose runs her fingertips over her own thigh."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "They hurry through a door to a gymnasium. A dog places its paw on a bird's cheek, and the bird places its gloved wing over the paw. It steps outside, and the dog watches it leave through a wavy window glass, then gazes downward. Later, in the first-class lounge, a rabbit, the bird, the Countess, and another animal drink tea. The bird gazes toward another table where an elephant pulls a slouching young goat upright, and the bird watches the goat place a napkin on its lap with its small gloved hooves. The cat leans on a railing for balance and stares into the sea as wind ruffles its fur. The bird steps across the deck toward it, and it turns and faces the bird; the cat smiles, and the bird walks toward it and reaches out. They hold hands, and the cat gently pulls the bird toward itself. The bird closes its eyes, and grasping its hand, the cat helps the bird onto the bow, rail platform. They both step onto the lowest rung of the railing, and then it holds its arms out like wings as the wind blows its shawl back on its outstretched arms. It places its paws around its waist as it opens its eyes. Black smoke trails from the ship's funnels as the cat and bird stand at the rail high above the water. The cat reaches out and grasps the bird's hands and leans its face close to its. The cat folds the bird's arms around its waist, and it turns its face to it, and they kiss. The bird places its hand on the back of the cat's neck. The sunken Titanic sits on the bottom of the ocean as the elderly bird turns from a monitor and addresses the herd of the salvage vessel. The bird gazes back at the monitor, which shows the underwater image of the fireplace in its former suite. The room transforms into its former state as young bird and cat step inside. The cat rushes toward a painting, and the bird opens the safe. The bird hands the Heart of the Ocean necklace to the cat, who shakes its head as it examines the faceted blue diamond, and then the cat turns to the bird. Later, the bird removes the butterfly comb from its feathers and shakes out its feathers, which fall to its shoulders. The cat drags a settee to the center of the room and places one pillow atop another. Sitting in a chair near the settee, the cat opens a canvas bag, removes a knife and a thin stick of charcoal which it sharpens, and looks up as the bird steps into the room. Holding a kimono close with one wing, the bird lifts a sash and twirls it. The cat smiles as the bird steps toward it, and it sits back as the bird tosses a dime to it. The bird steps backward, then slips the kimono from its shoulders, and the kimono slides to the floor. Naked, the bird runs its wingtips over its own thigh."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "They hurry through a door to a library. Jack places his hand on Rose's shoulder, and Rose places her gloved hand over his. She steps outside, and Jack watches her leave through a frosted window pane, then gazes downward. Later, in the first-class atrium, Ruth, Rose, the Countess, and another woman drink coffee. Rose gazes toward another table where a woman pulls a slouching young boy upright, and Rose watches the boy place a scarf on his lap with his small gloved hands. Jack leans on a pillar for balance and stares into the garden as wind ruffles his hair. Rose steps across the courtyard toward him, and he turns and faces her; Jack smiles, and Rose walks toward him and reaches out. They hold hands, and Jack gently pulls her toward himself. Rose closes her eyes, and grasping her hand, Jack helps Rose onto the veranda, step platform. They both step onto the lowest rung of the railing, and then she holds her arms out like wings as the wind blows her shawl back on her outstretched arms. He places his hands around her waist as she opens her eyes. White smoke trails from the building's chimneys as Jack and Rose stand at the rail high above the garden. Jack reaches out and grasps Rose's hands and leans his face close to hers. Jack folds Rose's arms around her waist, and she turns his face to him, and they kiss. Rose places her hand on the back of Jack's head. The abandoned mansion sits on the edge of a forest as the elderly Rose turns from a projector and addresses the crew of the research team. Rose gazes back at the projector, which shows the illuminated image of the mirror in her former suite. The room transforms into its former state as young Rose and Jack step inside. Jack rushes toward a sculpture, and Rose opens the cabinet. Rose hands the Jewel of Atlantis ring to Jack, who shakes his head as he examines the gleaming red gem, and then Jack turns to Rose. Later, Rose removes the flower pin from her hair and shakes out her hair, which falls to her shoulders. Jack drags a chaise lounge to the center of the room and places one cushion atop another. Sitting in a chair near the lounge, Jack opens a satchel, removes a brush and a thin sheet of parchment which he readies, and looks up as Rose steps into the room. Holding a shawl close with one hand, Rose lifts a ribbon and twirls it. Jack smiles as Rose steps toward him, and he sits back as she tosses a token to him. Rose steps backward, then slips the shawl from her shoulders, and the shawl slides to the floor. Naked, Rose runs her fingertips over her own thigh."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "They stroll through a door to a gymnasium. Jack taps his hand on Rose's cheek, and Rose rests her gloved hand over his. She jumps outside, and Jack waves as she leaves through a wavy window glass, then glances downward. Later, in the first-class lounge, Ruth, Rose, the Countess, and another woman sip tea. Rose squints toward another table where a woman nudges a slouching young girl upright, and Rose observes the girl drop a napkin on her lap with her small gloved hands. Jack crouches on a railing for balance and gazes into the sea as wind musses his hair. Rose skips across the deck toward him, and he turns and faces her; Jack chuckles, and Rose strolls toward him and pats out. They touch hands, and Jack gently twirls her toward himself. Rose opens her eyes, and holding her hand, Jack guides Rose onto the bow, rail platform. They both hop onto the lowest rung of the railing, and then she clasps her arms out like wings as the wind blows her shawl back on her flung arms. He places his hands around her waist as she shuts her eyes. Black smoke curls from the ship's funnels as Jack and Rose lean at the rail high above the water. Jack reaches out and grips Rose's hands and leans his face close to hers. Jack wraps Rose's arms around her waist, and she spins his face to him, and they hug. Rose taps her hand on the back of Jack's neck. The sunken Titanic rests on the bottom of the ocean as the elderly Rose turns from a monitor and addresses the crew of the salvage vessel. Rose peers back at the monitor, which shows the underwater image of the fireplace in her former suite. The room changes into its former state as young Rose and Jack rush inside. Jack skims toward a painting, and Rose shuts the safe. Rose hands the Heart of the Ocean necklace to Jack, who nods as he surveys the faceted blue diamond, and then Jack spins to Rose. Later, Rose pinches the butterfly comb from her hair and musses out her hair, which curls to her shoulders. Jack pushes a settee to the side of the room and stacks one pillow atop another. Sitting in a chair near the settee, Jack fiddles with a canvas bag, pulls out a knife and a thin stick of charcoal which he peels, and looks down as Rose skips into the room. Holding a kimono close with one hand, Rose ties a sash and waves it. Jack grins as Rose dances toward him, and he reclines back as she flips a dime to him. Rose spins backward, then flings the kimono from her shoulders, and the kimono slides to the floor. Naked, Rose runs her fingertips over her own thigh."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "They hurry through a portal to a cafeteria. A lantern places its wing on a cloud's surface, and the cloud places its feathered wing over the lantern's. The cloud drifts outside, and the lantern watches it depart through a warped mirror pane, then peers downward. Later, in the cargo hold, the broomstick, the cloud, the violin, and another umbrella sip lemonade. The cloud stares toward another counter where a book hauls a drooping candle upright, and the cloud observes the candle place a brochure on its knee with its tiny feathered appendages. A lantern rests on a bookshelf for stability and peers into the canyon as a breeze tousles its brim. The cloud drifts across the patio toward it, and it turns and faces the cloud; the lantern grins, and the cloud floats toward it and extends a branch. They clasp branches, and the lantern gently draws the cloud toward itself. The cloud shuts its eyes, and clutching its branch, the lantern assists the cloud onto the stern, parapet platform. They both step onto the lowest rung of the parapet, and then the cloud stretches its appendages like sails as the breeze flutters its scarf back on its unfurled limbs. It positions its twigs around the cloud's middle as it unveils its eyes. White mist trails from the blimp's funnels as the lantern and the cloud perch at the parapet high above the canyon. The lantern reaches out and grips the cloud's branches and angles its gaze near to the cloud's. The lantern folds the cloud's sails around its middle, and it pivots the cloud's face to it, and they merge. The cloud places its appendage on the back of the lantern's stem. The submerged Zeppelin rests on the floor of the abyss as the ancient cloud turns from a projector and addresses the band of the expedition vessel. The cloud peers back at the projector, which displays the submerged depiction of the mantle in its bygone cabin. The chamber morphs into its bygone condition as the youthful cloud and the lantern glide inside. The lantern bolts toward a sculpture, and the cloud unlocks the vault. The cloud hands the Star of the Abyss amulet to the lantern, who shakes its shade as it scrutinizes the faceted azure stone, and then the lantern pivots to the cloud. Later, the cloud detaches the dragonfly clasp from its stem and sways out its fibers, which cascade to its branches. The lantern heaves a chandelier to the core of the chamber and arranges one cushion atop another. Resting in a stool near the chandelier, the lantern opens a leather pouch, extracts a dagger and a slender rod of graphite which it hones, and glances up as the cloud floats into the chamber. Holding a sash close with one branch, the cloud lifts a strap and twirls it. The lantern grins as the cloud drifts toward it, and it reclines as the cloud flings a pebble to it. The cloud drifts backward, then slips the sash from its appendages, and the sash glides to the ground. Bare, the cloud trails its filaments over its own surface."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "They dart through a curtain to a theater. Bruce taps his finger on Lisa's nose, and Lisa places her bare foot over his. She glides outside, and Bruce notices her disappear through a misty window glass, then gazes sideways. Later, in the third-class cabin, Linda, Lisa, the Duchess, and another gentleman sip coffee. Lisa peers toward another booth where a boy pushes a sitting young boy sideways, and Lisa observes the boy unfold a napkin on his lap with his large bare feet. Bruce reclines on a bench for support and glances into the sky as rain dampens his jacket. Lisa skips across the lawn toward him, and he pivots and eyes her; Bruce grins, and Lisa skips toward him and gestures forward. They embrace, and Bruce carefully pushes her away from himself. Lisa shuts her eyes, and clutching her shoulder, Bruce escorts Lisa onto the helm, rail ladder. They both climb onto the highest rung of the railing, and then she waves her arms out like sails as the breeze tugs her hat forward on her dangling arms. He rests his head on her shoulder as she opens her eyes. White mist rises from the ship's chimneys as Bruce and Lisa stand at the helm far beneath the clouds. Bruce reaches down and caresses Lisa's shoulders and leans his ear close to hers. Bruce places Lisa's hands over her chest, and she turns his gaze to him, and they embrace. Lisa places her arm on the back of Bruce's hand. The sunlit Titanic floats on the surface of the ocean as the youthful Lisa turns from a screen and commands the crew of the cargo plane. Lisa looks forward at the screen, which shows the aerial image of the garden in her former mansion. The garden transforms into its future state as elderly Lisa and Bruce skip outside. Bruce hurries toward a statue, and Lisa locks the door. Lisa hands the Star of the Sea bracelet to Bruce, who nods as he swings the polished red gemstone, and then Bruce turns from Lisa. Later, Lisa secures the butterfly clip in her hair and twirls it, which curls to her neck. Bruce drops a mattress to the edge of the room and stacks one blanket beneath another. Standing on a table near the mattress, Bruce shuts a leather pouch, drops a pen, and a thick roll of paper which he unfolds, and looks down as Lisa hops onto the balcony. Holding a shawl loose with one foot, Lisa drops a belt and loops it. Bruce frowns as Lisa skips toward him, and he stands up as she flips a penny from him. Lisa jumps forward, then swings the shawl over her head, and the shawl flutters to the earth. Clothed, Lisa runs her fingernails over her own shoulder."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "They dash through a curtain to a library. Jack places his hand on Rose's hat, and Rose taps her covered hand over his. She strides outside, and Jack observes her depart through a misty mirror, then glances upward. Later, in the upper-class garden, Ruth, Rose, the Countess, and another woman sip lemonade. Rose scans toward another bench where a woman nudges a reclining young girl upright, and Rose observes the girl unfold a napkin on her lap with her tiny covered hands. Jack leans on a lamp post for support and peers into the field as breeze tousles his hair. Rose glides across the pathway toward him, and he pivots and faces her; Jack grins, and Rose approaches him and extends her hand. They embrace, and Jack gently draws her toward his side. Rose shuts her eyes, and holding her hand, Jack lifts Rose onto the ship's front, seating area. They both step onto the bottom step of the stairway, and then she stretches her arms out like sails as the breeze drapes her scarf back on her extended arms. He places his hands around her shoulders as she opens her eyes. White mist trails from the ship's chimneys as Jack and Rose stand at the edge high above the field. Jack stretches out and clasps Rose's hands and rests his face close to hers. Jack wraps Rose's arms around her shoulders, and she turns his gaze to him, and they kiss. Rose places her hand on the back of Jack's collar. The sunken Titanic rests on the bed of the canyon as the elderly Rose turns from a screen and speaks to the crew of the research boat. Rose looks back at the screen, which displays the submerged image of the chandelier in her former cabin. The chamber alters into its former design as young Rose and Jack step inside. Jack hurries toward a sculpture, and Rose opens the drawer. Rose hands the Heart of the Ocean necklace to Jack, who nods as he examines the faceted red gemstone, and then Jack turns to Rose. Later, Rose removes the feather clip from her hair and shakes out her hair, which falls to her back. Jack pushes a chaise lounge to the corner of the room and stacks one cushion atop another. Sitting on a stool near the lounge, Jack opens a leather pouch, takes out a spoon and a thin twig of pastels which he sharpens, and looks up as Rose enters the room. Holding a robe close with one hand, Rose lifts a ribbon and spins it. Jack beams as Rose moves toward him, and he leans back as she flips a nickel to him. Rose steps backward, then drapes the robe from her arms, and the robe glides to the ground. Unclothed, Rose traces her fingertips over her own arm."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "They drift through a curtain to a greenhouse. The monkey places its paw on Lily's elbow, and Lily places her scarfed paw over its. She floats inside, and the monkey watches her depart through a twisted mirror frame, then peers upward. Later, in the second-class pantry, Edith, Lily, the Duchess, and another lady sip coffee. Lily peers toward another chair where a boy pushes a lounging old man upright, and Lily watches the man place a book on his seat with his large scarfed paws. The monkey leans on a bookshelf for support and stares into the forest as rain tousles its fur. Lily skips across the lawn toward it, and it turns and regards her; the monkey grins, and Lily strolls toward it and holds out her paw. They link arms, and the monkey softly tugs her toward itself. Lily opens her eyes, and gripping her arm, the monkey lifts Lily onto the stern, handrail stage. They both leap onto the highest step of the bookshelf, and then she swings her arms up like sails as the breeze pulls her hat forward on her retracted arms. It places its paws around her neck as she closes her eyes. White steam puffs from the house's chimneys as the monkey and Lily sit on the handrail deep below the ground. The monkey reaches out and clasps Lily's arm and leans its face away from hers. The monkey wraps Lily's elbows around her stomach, and she turns its ear to her, and they hug. Lily places her paw on the side of the monkey's head. The floating Zephyr hovers on the top of the mountain as the ancient Lily turns from a telescope and addresses the crew of the research plane. Lily peeks back at the telescope, which displays the underground vision of the table in her previous attic. The attic shifts into its original form as young Lily and the monkey sprint outside. The monkey speeds toward a statue, and Lily locks the cabinet. Lily hands the Jewel of the Desert bracelet to the monkey, who chuckles as it inspects the glowing red ruby, and then the monkey nods to Lily. Later, Lily pulls the dragonfly pin from her hat and shakes out her scarf, which falls to her elbows. The monkey pushes a sofa to the edge of the attic and stacks one blanket beside another. Reclining on a blanket near the sofa, the monkey closes a wooden box, extracts a spoon and a thick chunk of chalk which it slices, and looks down as Lily glides into the attic. Holding a robe wide with one arm, Lily grabs a ribbon and swings it. The monkey grins as Lily approaches it, and it lies back as she flips a penny to it. Lily steps forward, then drops the robe from her elbows, and the robe tumbles to the ground. Draped, Lily runs her palms over her own shoulder."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jack and Rose hurry into a gymnasium and share a tender moment as she leaves. In the first-class lounge, Rose is distracted by a young girl being corrected by her mother. Meanwhile, Jack gazes into the sea until Rose approaches him on the deck. They hold hands and she steps onto the bow, feeling the wind with outstretched arms. As the ship's black smoke trails above them, Jack and Rose share a kiss. The scene shifts to an elderly Rose on a salvage vessel, recalling her memories of the Titanic. In a flashback, young Rose and Jack enter her former suite, where she gives him the Heart of the Ocean necklace. Later, Rose lets her hair down, and Jack prepares to draw her, sharpening charcoal as she approaches wearing a kimono. Rose tosses him a dime and lets the kimono fall, feeling free as Jack admires her."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Naked Rose runs her fingertips over her own thigh then slips the kimono from her shoulders and the kimono slides to the floor  Rose steps backward  Jack smiles as Rose steps toward him and he sits back as she tosses a dime to him  Holding a kimono close with one hand Rose lifts a sash and twirls it  Sitting in a chair near the settee Jack opens a canvas bag removes a knife and a thin stick of charcoal which he sharpens and looks up as Rose steps into the room  Jack drags a settee to the center of the room and places one pillow atop another  Later Rose removes the butterfly comb from her hair and shakes out her hair which falls to her shoulders  Rose hands the Heart of the Ocean necklace to Jack who shakes his head as he examines the faceted blue diamond and then Jack turns to Rose  Jack rushes toward a painting and Rose opens the safe  The room transforms into its former state as young Rose and Jack step inside  Rose gazes back at the monitor which shows the underwater image of the fireplace in her former suite  The sunken Titanic sits on the bottom of the ocean as the elderly Rose turns from a monitor and addresses the crew of the salvage vessel  Rose places her hand on the back of Jack's neck  Jack folds Rose's arms around her waist and she turns his face to him and they kiss  Jack reaches out and grasps Rose's hands and leans his face close to hers  Black smoke trails from the ship's funnels as Jack and Rose stand at the rail high above the water  He places his hands around her waist as she opens her eyes  They both step onto the lowest rung of the railing and then she holds her arms out like wings as the wind blows her shawl back on her outstretched arms  Jack helps Rose onto the bow rail platform  Rose closes her eyes and grasping her hand  They hold hands and Jack gently pulls her toward himself  Jack smiles and Rose walks toward him and reaches out  Rose steps across the deck toward him and he turns and faces her  Jack leans on a railing for balance and stares into the sea as wind ruffles his hair  Rose gazes toward another table where a woman pulls a slouching young girl upright and Rose watches the girl place a napkin on her lap with her small gloved hands  Later in the firstclass lounge Ruth Rose the Countess and another woman drink tea  She steps outside and Jack watches her leave through a wavy window glass then gazes downward  Jack places his hand on Rose's cheek and Rose places her gloved hand over his  They hurry through a door to a gymnasium "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Rose closes her eyes and grasping her hand  They hurry through a door to a gymnasium  The room transforms into its former state as young Rose and Jack step inside  Rose hands the Heart of the Ocean necklace to Jack who shakes his head as he examines the faceted blue diamond and then Jack turns to Rose  then slips the kimono from her shoulders and the kimono slides to the floor  Jack leans on a railing for balance and stares into the sea as wind ruffles his hair  Jack drags a settee to the center of the room and places one pillow atop another  Holding a kimono close with one hand Rose lifts a sash and twirls it  Jack rushes toward a painting and Rose opens the safe  Jack reaches out and grasps Rose's hands and leans his face close to hers  Sitting in a chair near the settee Jack opens a canvas bag removes a knife and a thin stick of charcoal which he sharpens and looks up as Rose steps into the room  Jack folds Rose's arms around her waist and she turns his face to him and they kiss  Rose places her hand on the back of Jack's neck  Jack smiles and Rose walks toward him and reaches out  The sunken Titanic sits on the bottom of the ocean as the elderly Rose turns from a monitor and addresses the crew of the salvage vessel  Jack places his hand on Rose's cheek and Rose places her gloved hand over his  Jack smiles as Rose steps toward him and he sits back as she tosses a dime to him  Rose gazes back at the monitor which shows the underwater image of the fireplace in her former suite  They both step onto the lowest rung of the railing and then she holds her arms out like wings as the wind blows her shawl back on her outstretched arms  Naked Rose runs her fingertips over her own thigh He places his hands around her waist as she opens her eyes  She steps outside and Jack watches her leave through a wavy window glass then gazes downward  Later in the firstclass lounge Ruth Rose the Countess and another woman drink tea  Rose steps backward  Rose steps across the deck toward him and he turns and faces her  Rose gazes toward another table where a woman pulls a slouching young girl upright and Rose watches the girl place a napkin on her lap with her small gloved hands  They hold hands and Jack gently pulls her toward himself  Jack helps Rose onto the bow rail platform  Black smoke trails from the ship's funnels as Jack and Rose stand at the rail high above the water  Later Rose removes the butterfly comb from her hair and shakes out her hair which falls to her shoulders "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Jack folds Rose's arms around her waist and she turns his face to him and they kiss  Rose places her hand on the back of Jack's neck  The sunken Titanic sits on the bottom of the ocean as the elderly Rose turns from a monitor and addresses the crew of the salvage vessel  Rose gazes back at the monitor which shows the underwater image of the fireplace in her former suite  The room transforms into its former state as young Rose and Jack step inside  Jack rushes toward a painting and Rose opens the safe  Rose hands the Heart of the Ocean necklace to Jack who shakes his head as he examines the faceted blue diamond and then Jack turns to Rose  Later Rose removes the butterfly comb from her hair and shakes out her hair which falls to her shoulders  Jack drags a settee to the center of the room and places one pillow atop another  Sitting in a chair near the settee Jack opens a canvas bag removes a knife and a thin stick of charcoal which he sharpens and looks up as Rose steps into the room  Holding a kimono close with one hand Rose lifts a sash and twirls it  Jack smiles as Rose steps toward him and he sits back as she tosses a dime to him  Rose steps backward  then slips the kimono from her shoulders and the kimono slides to the floor  Naked Rose runs her fingertips over her own thigh They hurry through a door to a gymnasium  Jack places his hand on Rose's cheek and Rose places her gloved hand over his  She steps outside and Jack watches her leave through a wavy window glass then gazes downward  Later in the firstclass lounge Ruth Rose the Countess and another woman drink tea  Rose gazes toward another table where a woman pulls a slouching young girl upright and Rose watches the girl place a napkin on her lap with her small gloved hands  Jack leans on a railing for balance and stares into the sea as wind ruffles his hair  Rose steps across the deck toward him and he turns and faces her  Jack smiles and Rose walks toward him and reaches out  They hold hands and Jack gently pulls her toward himself  Rose closes her eyes and grasping her hand  Jack helps Rose onto the bow rail platform  They both step onto the lowest rung of the railing and then she holds her arms out like wings as the wind blows her shawl back on her outstretched arms  He places his hands around her waist as she opens her eyes  Black smoke trails from the ship's funnels as Jack and Rose stand at the rail high above the water  Jack reaches out and grasps Rose's hands and leans his face close to hers "
        }
      ]
    }
  ]
}