{
  "ground_truth": "He snaps his fingers and points to the car, then yanks open the car door, revealing empty seats. Smiling, Rose and Jack run onto the forward well deck. Rose places her hand on Jack's lips and gazes at him. They kiss. Standing at the bridge rail, Murdoch glances down at them, smiles, and walks off. Watching from the crow's nest, another man, Fleet, looks down and taps his comrade, Lee, on the arm. They stare down at Jack and Rose. The men turn and gaze past the ship. Their eyes widen as a large iceberg looms, straight ahead. Fleet rings the lookout bell three times and grabs a telephone, which rings on the bridge. The quartermaster at the wheel glances back at the phone. Officer Moody steps onto the bridge and answers the phone. Moody hangs up and turns to Murdoch as he runs to the bridge door. Quartermaster Hichens turns the wheel to the left. Murdoch rushes over to the engine room telegraph and shifts the handle to full speed astern. Hichens turns the wheel quickly. In the engine room, the chief engineer spots the telegraph shift and drops a pot of steaming soup. He turns the wheel until it stops. Murdoch hurries to the bridge rail and peers at the iceberg. In the engine room, an engineer yells. Other engineers scurry around. A red warning light flashes. Engineers slam the furnace dampers shut. Underwater, the ship's main propeller slows. An engineer pulls down a thick lever. All the propellers stop. An officer pushes an engineer out of the way and turns a wheel quickly to the right. The propellers spin in the opposite direction. In the crow's nest, the men stare at the iceberg as the ship heads straight toward it. Murdoch stares at the iceberg. Nearing the iceberg, the ship veers slowly to the left. The ship's propellers turn and reverse. Sweat trickles down Murdoch's temples. The ship's bow shifts to the left of the iceberg. At the bow railing, a man runs toward it. The ship scrapes along the side of the ice. Jack and Rose stop kissing as the ship trembles. On the bridge deck, Murdoch glances down at his hands, resting on the shaking rail. Above, Fleet holds onto the rim of the crow's nest, while Lee sits on the floor. In the bridge, Hichens keeps the wheel turned hard left. Below deck, Fabrizio sits up in his bunk. In the cargo hold, water shoots through a long tear in the hull. In the cabin, Andrews sits at his desk. He glances up at the trembling crystal chandelier above. In the crow's nest, Fleet and Lee gaze at the iceberg. On the bridge, Hichens turns the wheel to the right.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He clicks his digits and points to the vehicle, then jerks open the car portal, revealing vacant seats. Grinning, Rose and Jack sprint onto the forward well platform. Rose places her hand on Jack's lips and gazes at him. They smooch. Standing at the bridge rail, Murdoch peeks down at them, grins, and strides off. Observing from the crow's nest, another man, Fleet, peers down and taps his comrade, Lee, on the limb. They stare down at Jack and Rose. The men pivot and gaze past the vessel. Their eyes enlarge as a large iceberg appears, straight ahead. Fleet rings the lookout chime thrice and clutches a telephone, which rings on the bridge. The quartermaster at the wheel glances back at the phone. Officer Moody steps onto the bridge and answers the phone. Moody hangs up and turns to Murdoch as he dashes to the bridge portal. Quartermaster Hichens turns the wheel to the left. Murdoch rushes over to the engine room telegraph and shifts the handle to full velocity astern. Hichens turns the wheel rapidly. In the engine room, the chief engineer notices the telegraph shift and drops a pot of steaming broth. He turns the wheel until it halts. Murdoch hurries to the bridge rail and peers at the iceberg. In the engine room, an engineer shouts. Other engineers scurry around. A red warning light blinks. Engineers slam the furnace dampers shut. Underwater, the ship's main propeller decelerates. An engineer pulls down a thick lever. All the propellers stop. An officer pushes an engineer out of the way and turns a wheel rapidly to the right. The propellers spin in the opposite direction. In the crow's nest, the men stare at the iceberg as the ship heads straight toward it. Murdoch stares at the iceberg. Nearing the iceberg, the ship veers slowly to the left. The ship's propellers turn and reverse. Sweat trickles down Murdoch's temples. The ship's bow shifts to the left of the iceberg. At the bow railing, a man sprints toward it. The ship grazes along the side of the ice. Jack and Rose stop smooching as the ship quivers. On the bridge deck, Murdoch glances down at his hands, resting on the shaking rail. Above, Fleet clutches onto the rim of the crow's nest, while Lee sits on the surface. In the bridge, Hichens keeps the wheel turned hard left. Below deck, Fabrizio sits up in his berth. In the cargo hold, water sprays through a long rip in the hull. In the cabin, Andrews sits at his desk. He glances up at the shivering crystal chandelier above. In the crow's nest, Fleet and Lee gaze at the iceberg. On the bridge, Hichens turns the wheel to the right."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "His fingers are snapped, and the car is pointed to by him, then the car door is yanked open by him, revealing empty seats. Smiling, Rose and Jack run onto the forward well deck. Jack's lips are touched by Rose's hand, and he is gazed at by her. They kiss. Standing at the bridge rail, Murdoch glances down at them, smiles, and walks off. From the crow's nest, Fleet watches them and taps his comrade, Lee, on the arm. Jack and Rose are stared at by them. The ship is gazed past by the men. Their eyes widen as a large iceberg looms, straight ahead. Fleet rings the lookout bell three times and grabs a telephone, which rings on the bridge. The phone is glanced back at by the quartermaster at the wheel. Officer Moody steps onto the bridge and answers the phone. The phone is hung up by Moody, and Murdoch is turned to by him as the bridge door is run to by him. Quartermaster Hichens turns the wheel to the left. The engine room telegraph is rushed over to by Murdoch, and the handle is shifted to full speed astern by him. The wheel is turned quickly by Hichens. In the engine room, the chief engineer spots the telegraph shift and drops a pot of steaming soup. The wheel is turned by him until it stops. Murdoch hurries to the bridge rail and peers at the iceberg. In the engine room, an engineer yells. Other engineers scurry around. A red warning light flashes. The furnace dampers are slammed shut by engineers. Underwater, the ship's main propeller slows. A thick lever is pulled down by an engineer. All the propellers stop. An engineer is pushed out of the way by an officer, and a wheel is turned quickly to the right by him. The propellers spin in the opposite direction. In the crow's nest, the iceberg is stared at by the men as the ship heads straight toward it. Murdoch stares at the iceberg. Nearing the iceberg, the ship veers slowly to the left. The ship's propellers turn and reverse. Sweat trickles down Murdoch's temples. The bow of the ship is shifted to the left of the iceberg. At the bow railing, a man runs toward it. The side of the ice is scraped along by the ship. Jack and Rose stop kissing as the ship trembles. On the bridge deck, the shaking rail is glanced down at by Murdoch, where his hands rest. Above, the rim of the crow's nest is held onto by Fleet, while Lee sits on the floor. In the bridge, the wheel is kept turned hard left by Hichens. Below deck, Fabrizio sits up in his bunk. In the cargo hold, a long tear in the hull shoots water through it. In the cabin, Andrews sits at his desk. The trembling crystal chandelier above is glanced up at by him. In the crow's nest, Fleet and Lee gaze at the iceberg. On the bridge, the wheel is turned to the right by Hichens."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He snaps his fingers and points to the car, then yanks open the door, revealing empty seats. Rose and Jack run onto the forward well deck and kiss as Murdoch watches from the bridge rail, smiles, and leaves. From the crow's nest, Fleet taps Lee, and they spot a large iceberg ahead. Fleet rings the lookout bell thrice and calls the bridge. Officer Moody answers, and Murdoch dashes to the engine room telegraph, switching it to full speed astern. Hichens turns the wheel. In the engine room, engineers react quickly; the main propeller slows and stops, then reverses direction. As the ship nears the iceberg, it veers left; Murdoch sweats as the bow shifts away. The ship scrapes the iceberg, and Jack and Rose stop kissing. Murdoch grips the shaking rail as Fleet and Lee hold on. Hichens keeps the wheel turned left. Below, Fabrizio sits up in his bunk as water enters the hull. Andrews notices the chandelier trembling. Fleet and Lee gaze at the iceberg; Hichens adjusts the wheel on the bridge."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He snaps his fingers, points to the car, and opens the door to empty seats. Rose and Jack run onto the deck, kiss, and are seen by Murdoch, who smiles and leaves. From the crow's nest, Fleet taps Lee to look at them, then at a looming iceberg. Fleet rings the bell and calls the bridge. Moody answers and tells Murdoch, who adjusts the engine telegraph. Hichens turns the wheel left. The chief engineer notices the change, drops his soup, and stops the wheel. Murdoch watches the iceberg. Engineers work frantically as propellers stop, reverse, and the ship veers left, scraping the iceberg. Jack and Rose stop kissing, feeling the tremor. Murdoch, sweating, grips the bridge rail. Fleet and Lee hold on as the ship veers. Hichens maintains a hard left turn. Below deck, Fabrizio wakes, water breaches the hull, and Andrews notices the shaking chandelier."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "With a quick snap of his fingers and a decisive point towards the car, he promptly yanks the door open, revealing the stark emptiness of the seats within. Smiling brightly, Rose and Jack joyfully run onto the forward well deck of the ship. Rose gently places her hand on Jack's lips, her eyes locked intently on his. They share a tender kiss. Meanwhile, standing at the bridge rail, Murdoch glances down at the affectionate scene below, allowing himself a small smile before walking off. From the height of the crow's nest, Fleet, another watchful man, observes them, then lightly taps his comrade, Lee, on the arm to draw his attention. Both men direct their gaze downward at Jack and Rose's display of affection. Their focus then shifts past the ship as their eyes widen in alarm—a massive iceberg looms ominously straight ahead. Fleet urgently rings the lookout bell three times, grabbing the telephone, which begins to ring insistently on the bridge. The quartermaster at the wheel casts a quick glance back at the ringing phone. Officer Moody steps briskly onto the bridge and moves to answer the phone. After receiving the news, Moody promptly hangs up and turns to Murdoch, who dashes quickly to the bridge door. Quartermaster Hichens swiftly turns the ship's wheel to the left. Murdoch rushes over to the engine room telegraph, adjusting the handle urgently to signal full speed astern. Hichens maneuvers the wheel with rapid precision. In the bustling engine room, the chief engineer notices the telegraph's shift and, startled, drops a pot full of steaming soup. He turns the wheel decisively until it can move no further. Murdoch hurries over to the bridge rail, peering anxiously at the approaching iceberg. In the engine room, one of the engineers yells, alerting others who scurry around in response. A glaring red warning light begins flashing. Engineers hurriedly slam the furnace dampers shut, trying to control the situation. Beneath the water, the ship's main propeller begins to slow. With urgency, an engineer pulls down a thick, sturdy lever. All the propellers come to a halt. A determined officer pushes an engineer aside to quickly turn a wheel to the right. The ship's propellers now spin in the opposite direction, trying to avert disaster. In the crow's nest, Fleet and Lee continue to stare at the towering iceberg, as the ship heads directly toward it. Murdoch remains fixated on the looming iceberg. As the iceberg nears, the ship manages to veer slowly to the left. The ship's powerful propellers turn and reverse direction. Sweat trickles down the sides of Murdoch's temples, tracing lines on his skin. The ship's bow shifts cautiously to the left of the iceberg. Running swiftly toward the bow railing, a man makes his way there frantically. The ship scrapes along the iceberg, creating a harsh, grating noise. Jack and Rose halt their kiss abruptly as the ship trembles beneath them. On the bridge deck, Murdoch looks down at his own hands, resting tensely on the vibrating rail. Above, Fleet clutches tightly onto the rim of the crow's nest, trying to maintain his balance, while Lee sits watchfully on the floor. In the bridge, Hichens keeps the wheel turned hard to the left, maintaining the course. Below deck, Fabrizio sits up abruptly in his bunk, disturbed by the ship's movement. In the cargo hold, a powerful stream of water bursts through a long tear in the hull's structure. In his private cabin, Andrews sits at his desk, looking up with concern at the quivering crystal chandelier overhead. Back in the crow's nest, Fleet and Lee continue to gaze at the terrifying iceberg. On the bridge, Hichens carefully turns the wheel back to the right, adjusting the ship's path."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a swift snap of his fingers accompanied by a decisive point directed towards the nearby car, he promptly yanks the door open, revealing the stark emptiness of the seats within, completely devoid of any occupants or belongings. Smiling brightly with joy and excitement, Rose and Jack happily make their way onto the forward well deck of the grand ship. Rose gently and tenderly places her hand on Jack's lips, her eyes locked intently and deeply on his, conveying a silent connection. They share a tender and heartfelt kiss. Meanwhile, standing at the bridge rail above them, Murdoch takes a brief glance down at the affectionate scene unfolding below, allowing himself a small, contented smile before walking off with a sense of quiet satisfaction. From their elevated position in the crow's nest, Fleet, another watchful member of the crew, observes the couple, then lightly taps his comrade, Lee, on the arm to draw his attention to the scene. Both men direct their gaze downward at Jack and Rose's public display of affection. Their focus then shifts dramatically past the ship as their eyes widen in shock and alarm—a massive, threatening iceberg looms ominously straight ahead in their path. Reacting urgently, Fleet rings the lookout bell three times with haste, then grabs the telephone, which begins to ring insistently on the bridge. The quartermaster stationed at the wheel casts a quick, concerned glance back at the ringing phone. Officer Moody steps briskly onto the bridge, moving with purpose to answer the phone. After receiving the dire news, Moody promptly hangs up and turns to Murdoch, who dashes quickly to the bridge door in response. Quartermaster Hichens swiftly turns the ship's wheel to the left with practiced precision. Murdoch rushes over to the engine room telegraph, adjusting the handle urgently to signal full speed astern, attempting to avert the looming disaster. Hichens maneuvers the wheel with rapid precision as he executes the command. In the bustling engine room, the chief engineer notices the telegraph's shift and, startled, drops a pot full of steaming soup, clattering to the floor. He turns the wheel decisively until it can move no further. Murdoch hurries over to the bridge rail, peering anxiously and intently at the fast-approaching iceberg. In the engine room, one of the engineers yells urgently, alerting others who scurry around in frantic response. A glaring red warning light begins flashing ominously. Engineers hurriedly slam the furnace dampers shut, trying to gain control of the escalating situation. Beneath the water, the ship's main propeller begins to slow noticeably. With urgency, an engineer pulls down a thick, sturdy lever with determination. All the propellers come to a complete halt. A determined officer pushes an engineer aside to quickly turn a wheel to the right. The ship's propellers now spin vigorously in the opposite direction, trying desperately to avert the impending disaster. In the crow's nest, Fleet and Lee continue to stare in disbelief at the towering iceberg, as the ship heads directly toward it despite all efforts. Murdoch remains fixated on the looming iceberg, watching every moment intently. As the iceberg nears, the ship manages to veer slowly to the left, reacting to the efforts. The ship's powerful propellers turn and reverse direction with great effort. Sweat trickles down the sides of Murdoch's temples, tracing lines down his skin. The ship's bow shifts cautiously and slowly to the left of the looming iceberg. Running swiftly toward the bow railing, a man makes his way there frantically with urgency. The ship scrapes along the side of the iceberg, creating a harsh, grating noise that echoes through the night. Jack and Rose halt their kiss abruptly as the ship trembles and shakes beneath their feet. On the bridge deck, Murdoch looks down at his own hands, resting tensely on the vibrating rail, feeling the ominous rumble. Above, Fleet clutches tightly onto the rim of the crow's nest, trying to maintain his balance, while Lee sits watchfully on the floor, bracing himself. In the bridge, Hichens keeps the wheel turned hard to the left, maintaining the critical course. Below deck, Fabrizio sits up abruptly in his bunk, disturbed and bewildered by the ship's unexpected movement. In the cargo hold, a powerful stream of water bursts through a long, jagged tear in the hull's structure with alarming force. In his private cabin, Andrews sits at his desk, looking up with growing concern at the quivering crystal chandelier overhead, sensing the gravity of the situation. Back in the crow's nest, Fleet and Lee continue to gaze intently at the terrifying iceberg. On the bridge, Hichens carefully turns the wheel back to the right, adjusting the ship's path with caution and precision."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He snaps his fingers and confidently points toward the car, directing his intention before swiftly moving forward to yank the car door open, revealing the surprisingly empty seats inside. Meanwhile, with joyous expressions, Rose and Jack burst into a run, making their way onto the forward well deck. Upon reaching their destination, Rose tenderly places her hand on Jack's lips, locking her gaze onto him with deep affection, which naturally leads them into a heartfelt kiss. Standing at the bridge rail, Murdoch casts his eyes downward, catching sight of the tender moment shared between Rose and Jack; he smiles softly to himself and then turns, leisurely walking away. Up above, situated in the crow's nest, Fleet peers down to witness the same scene and, feeling the need to share this with his comrade, gently taps Lee on the arm. Both men set their focus downwards onto Jack and Rose before directing their gaze beyond the ship, their eyes widening in shock as a massive iceberg emerges ominously ahead of the vessel. Reacting urgently, Fleet rings the lookout bell three times, a signal of impending danger, before reaching swiftly for the telephone and causing it to ring loudly on the bridge. The quartermaster stationed at the wheel responds instinctively, glancing over his shoulder towards the insistent ringing of the phone. Officer Moody, moving with purpose, steps onto the bridge, picks up the phone, listens briefly, and hangs up with determination before turning towards Murdoch, then dashing urgently towards the bridge door. Simultaneously, Quartermaster Hichens takes action by forcefully turning the wheel to the left, while Murdoch makes a dash for the engine room telegraph, grasping the handle firmly and shifting it to full speed astern. Hichens quickly continues to maneuver the wheel. In the engine room below, the chief engineer notices the telegraph shift, and in his surprise, lets a pot of steaming soup fall to the ground. Without hesitation, he turns the wheel until it reaches its stopping point. Murdoch rushes back to the bridge rail, squinting intently at the approaching iceberg. In the engine room, an engineer cries out amidst the chaos while other engineers scatter in response, a red warning light catching their attention as it starts to flash. Quickly, engineers work to slam the furnace dampers shut, all while underwater, the ship's main propeller gradually slows its momentum. Within the chaos, an engineer pulls down on a thick lever with force, causing all the propellers to cease their movement. An officer, driven by urgency, pushes an engineer aside and turns a wheel rapidly to the right, facilitating the propellers to begin spinning in the opposite direction. Back in the crow's nest, the men fixate on the iceberg, their attention locked as the ship seemingly heads straight towards it, with Murdoch down below sharing the same watchful stare. As the ship draws perilously close to the iceberg, it begins to veer slowly to the left, the propellers whirring in reverse. Sweat forms and trickles down Murdoch's temples, marking the tense situation. Through coordinated effort, the ship's bow shifts to the left of the iceberg's edge. At the bow railing, a man is seen dashing hurriedly towards it. However, the ship's side brushes against the ice, resulting in a shudder that disrupts Jack and Rose's kiss as they pause, feeling the tremor. On the bridge deck, Murdoch looks down at his hands resting on the shaking rail, internalizing the gravity of the moment. Above, Fleet clings to the rim of the crow's nest for stability, while Lee sits grounded on the floor, absorbing the aftershock. Within the bridge, Hichens maintains his grip on the wheel, keeping it turned hard left. Below deck, Fabrizio awakens from his bunk, sensing the disturbance. In the cargo hold, water surges violently through a long tear in the hull, betraying the ship's structural compromise. In a cabin, Andrews remains seated at his desk, his attention drawn upward to the quivering crystal chandelier. Back in the crow's nest, Fleet and Lee's eyes remain on the iceberg. Meanwhile, on the bridge, Hichens adjusts the wheel, turning it to the right in a continued effort to navigate away from further peril."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He gestures toward the car before opening the door to reveal empty seats. Smiling, Rose and Jack dash onto the forward well deck, share a tender kiss, and bask in their moment. Observing from the bridge rail, Murdoch smiles at them before walking away, while Fleet and Lee, from the crow's nest, notice them and then spot an approaching iceberg. Fleet urgently rings the lookout bell and alerts the bridge via telephone. Officer Moody answers, informs Murdoch, and Hichens turns the wheel left as Murdoch adjusts the engine room telegraph to full speed astern. In response, the chief engineer in the engine room drops his soup, spins the wheel to a stop, and engineers scramble as a red warning light flashes. The main propeller slows, stops, and reverses direction. The ship veers slowly left, nearing the iceberg. Murdoch anxiously watches, sweat on his temples, as the bow shifts left, narrowly avoiding the iceberg. Jack and Rose pause their kiss as the ship quakes. On the bridge, Murdoch grips the shaking rail, while above in the crow's nest, Fleet and Lee hold on amidst the tremors. Below, Fabrizio stirs in his bunk, and water floods through a hull breach in the cargo hold. Andrews, in his cabin, notices the quivering chandelier. Hichens adjusts the wheel back to the right as the situation stabilizes."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He snaps his fingers and points to the car, a vintage Model T known for its revolutionary impact on personal transportation, then yanks open the car door, revealing empty seats. Smiling, Rose and Jack run onto the forward well deck of the Titanic, the largest and most luxurious ship of its time, on her maiden voyage. Rose places her hand on Jack's lips and gazes at him. They kiss. Standing at the bridge rail, Officer Murdoch, responsible for navigation and safety, glances down at them, smiles, and walks off. Watching from the crow's nest, an elevated lookout point, another man, Fleet, looks down and taps his comrade, Lee, on the arm. They stare down at Jack and Rose. The men turn and gaze past the ship. Their eyes widen as a large iceberg, part of the treacherous North Atlantic waters where icebergs are common, looms straight ahead. Fleet rings the lookout bell three times, a signal for immediate danger, and grabs a telephone, which rings on the bridge. The quartermaster at the wheel, responsible for steering the ship, glances back at the phone. Officer Moody steps onto the bridge and answers the phone. Moody hangs up and turns to Murdoch as he runs to the bridge door. Quartermaster Hichens turns the wheel to the left, attempting to avoid the iceberg. Murdoch rushes over to the engine room telegraph and shifts the handle to full speed astern, signaling the engines to reverse. Hichens turns the wheel quickly. In the engine room, the chief engineer spots the telegraph shift and drops a pot of steaming soup in surprise. He turns the wheel until it stops. Murdoch hurries to the bridge rail and peers at the iceberg. In the engine room, an engineer yells as the warning intensifies. Other engineers scurry around. A red warning light flashes, indicating urgent danger. Engineers slam the furnace dampers shut to reduce the steam pressure. Underwater, the ship's main propeller slows. An engineer pulls down a thick lever to halt the engines. All the propellers stop. An officer pushes an engineer out of the way and turns a wheel quickly to the right. The propellers spin in the opposite direction, an emergency maneuver. In the crow's nest, the men stare at the iceberg as the ship heads straight toward it. Murdoch stares at the iceberg, knowing the fate of the Titanic rests on these moments. Nearing the iceberg, the ship veers slowly to the left. The ship's propellers turn and reverse. Sweat trickles down Murdoch's temples under the pressure of averting disaster. The ship's bow shifts to the left of the iceberg, seemingly a narrow escape. At the bow railing, a man runs toward it. The ship scrapes along the side of the ice with a grating sound. Jack and Rose stop kissing as the ship trembles, realizing the gravity of the situation. On the bridge deck, Murdoch glances down at his hands, resting on the shaking rail, feeling the weight of the consequence. Above, Fleet holds onto the rim of the crow's nest for balance, while Lee sits on the floor, bracing himself. In the bridge, Hichens keeps the wheel turned hard left, still trying to steer clear. Below deck, Fabrizio sits up in his bunk, startled by the sudden disturbance. In the cargo hold, water shoots through a long tear in the hull, a critical breach. In the cabin, ship designer Andrews sits at his desk. He glances up at the trembling crystal chandelier above, a symbol of the ship's opulence and now its peril. In the crow's nest, Fleet and Lee gaze at the iceberg, the cause of the catastrophe. On the bridge, Hichens turns the wheel to the right, attempting further evasive action."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He snaps his fingers and points to the car then yanks open the car door revealing empty seats. Smiling Rose and Jack run onto the forward well deck. Rose places her hand on Jack's lips and gazes at him. They kiss. Standing at the bridge rail Murdoch glances down at them smiles and walks off. Watching from the crow's nest another man. Fleet looks down and taps his comrade Lee on the arm. They stare down at Jack and Rose. The men turn and gaze past the ship. Their eyes widen as a large iceberg looms straight ahead. Fleet rings the lookout bell three times and grabs a telephone which rings on the bridge. The quartermaster at the wheel glances back at the phone. Officer Moody steps onto the bridge and answers the phone. Moody hangs up and turns to Murdoch as he runs to the bridge door. Quartermaster Hichens turns the wheel to the left. Murdoch rushes over to the engine room telegraph and shifts the handle to full speed astern. Hichens turns the wheel quickly. In the engine room the chief engineer spots the telegraph shift and drops a pot of steaming soup. He turns the wheel until it stops. Murdoch hurries to the bridge rail and peers at the iceberg. In the engine room an engineer yells. Other engineers scurry around. A red warning light flashes. Engineers slam the furnace dampers shut. Underwater the ship's main propeller slows. An engineer pulls down a thick lever. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. All the propellers stop. An officer pushes an engineer out of the way and turns a wheel quickly to the right. The propellers spin in the opposite direction. In the crow's nest the men stare at the iceberg as the ship heads straight toward it. Murdoch stares at the iceberg. Nearing the iceberg the ship veers slowly to the left. The ship's propellers turn and reverse. Sweat trickles down Murdoch's temples. The ship's bow shifts to the left of the iceberg. At the bow railing a man runs toward it. The ship scrapes along the side of the ice. Jack and Rose stop kissing as the ship trembles. On the bridge deck Murdoch glances down at his hands resting on the shaking rail. Above. Fleet holds onto the rim of the crow's nest while Lee sits on the floor. In the bridge Hichens keeps the wheel turned hard. left. Below deck. Fabrizio sits up in his bunk. In the cargo hold water shoots through a long tear in the hull. In the cabin Andrews sits at his desk. He glances up at the trembling crystal chandelier above. In the crow's nest. Fleet and Lee gaze at the iceberg. On the bridge. Hichens turns the wheel to the right."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He snaps his fingers and points to the car then yanks open the car door revealing empty seats. Smiling Rose and Jack run onto the forward well deck. Rose places her hand on Jack's lips and gazes at him. They kiss. Standing at the bridge rail Murdoch glances down at them smiles and walks off. Watching from the crow's nest another man. Fleet looks down and taps his comrade Lee on the arm. They stare down at Jack and Rose. The men turn and gaze past the ship. Their eyes widen as a large iceberg looms straight ahead. Fleet rings the lookout bell three times and grabs a telephone which rings on the bridge. The quartermaster at the wheel glances back at the phone. Officer Moody steps onto the bridge and answers the phone. Moody hangs up and turns to Murdoch as he runs to the bridge door. Quartermaster Hichens turns the wheel to the left. Murdoch rushes over to the engine room telegraph and shifts the handle to full speed astern. Hichens turns the wheel quickly. In the engine room the chief engineer spots the telegraph shift and drops a pot of steaming soup. He turns the wheel until it stops. Murdoch hurries to the bridge rail and peers at the iceberg. In the engine room an engineer yells. Other engineers scurry around. A red warning light flashes. Engineers slam the furnace dampers shut. Underwater the ship's main propeller slows. An engineer pulls down a thick lever. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. All the propellers stop. An officer pushes an engineer out of the way and turns a wheel quickly to the right. The propellers spin in the opposite direction. In the crow's nest the men stare at the iceberg as the ship heads straight toward it. Murdoch stares at the iceberg. Nearing the iceberg the ship veers slowly to the left. The ship's propellers turn and reverse. Sweat trickles down Murdoch's temples. The ship's bow shifts to the left of the iceberg. At the bow railing a man runs toward it. The ship scrapes along the side of the ice. Jack and Rose stop kissing as the ship trembles. On the bridge deck Murdoch glances down at his hands resting on the shaking rail. Above. Fleet holds onto the rim of the crow's nest while Lee sits on the floor. In the bridge Hichens keeps the wheel turned hard. left. Below deck. Fabrizio sits up in his bunk. In the cargo hold water shoots through a long tear in the hull. In the cabin Andrews sits at his desk. He glances up at the trembling crystal chandelier above. In the crow's nest. Fleet and Lee gaze at the iceberg. On the bridge. Hichens turns the wheel to the right."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He snaps his fingers and points to the car then yanks open the car door revealing empty seats. Smiling Rose and Jack run onto the forward well deck. Rose places her hand on Jack's lips and gazes at him. They kiss. Standing at the bridge rail Murdoch glances down at them smiles and walks off. Watching from the crow's nest another man. Fleet looks down and taps his comrade Lee on the arm. They stare down at Jack and Rose. The men turn and gaze past the ship. Their eyes widen as a large iceberg looms straight ahead. Fleet rings the lookout bell three times and grabs a telephone which rings on the bridge. The quartermaster at the wheel glances back at the phone. Officer Moody steps onto the bridge and answers the phone. Above. Fleet holds onto the rim of the crow's nest while Lee sits on the floor. In the bridge Hichens keeps the wheel turned hard. left. Below deck. Fabrizio sits up in his bunk. In the cargo hold water shoots through a long tear in the hull. In the cabin Andrews sits at his desk. He glances up at the trembling crystal chandelier above. In the crow's nest. Fleet and Lee gaze at the iceberg. On the bridge. Hichens turns the wheel to the right."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He snaps his fingers and points to the car then yanks open the car door revealing empty seats. Smiling Rose and Jack run onto the forward well deck. Rose places her hand on Jack's lips and gazes at him. They kiss. Standing at the bridge rail Murdoch glances down at them smiles and walks off. Watching from the crow's nest another man. He glances up at the trembling crystal chandelier above. In the crow's nest. Fleet and Lee gaze at the iceberg. On the bridge. Hichens turns the wheel to the right."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "He pivots his ankles and gestures to the tractor, then slams open the barn gate, revealing vacant stalls. Grinning, Daisy and Sam sprint onto the aft orchard path. Daisy brushes her palm against Sam's ears and stares at him. They hug. Perched at the tree branch, Johnson glances across at them, grins, and strolls away. Observing from the windmill, another woman, Jane, peers across and nudges her companion, Sally, on the shoulder. They gawk down at Sam and Daisy. The women pivot and glance beyond the meadow. Their mouths open as a massive mountain rises, directly ahead. Jane clangs the cowbell thrice and seizes a lantern, which buzzes in the cabin. The gardener at the plow glances forward at the lantern. Farmer Riley steps onto the porch and grabs the lantern. Riley sets it down and turns to Johnson as he jogs to the cabin entrance. Gardener Thomas spins the plow to the right. Johnson bolts over to the kitchen clock and pushes the lever to fast cook. Thomas pulls the plow swiftly. In the kitchen, the head chef notices the clock move and drops a tray of fresh bread. He spins the plow until it halts. Johnson dashes to the tree branch and peeks at the mountain. In the kitchen, a cook shouts. Other cooks hustle around. A blue signal flashes. Cooks slam the oven doors shut. Underground, the mill’s main wheel slows. A cook pushes down a wooden chute. All the wheels stop. A farmer shoves a cook aside and spins a plow swiftly to the left. The wheels rotate in the opposite direction. In the windmill, the women gaze at the mountain as the mill heads directly toward it. Johnson gapes at the mountain. Approaching the mountain, the mill sways slowly to the right. The mill’s wheels rotate and reverse. Sweat drips down Johnson's cheeks. The mill’s nose shifts to the side of the mountain. At the porch railing, a woman sprints toward it. The mill scrapes along the side of the rock. Sam and Daisy stop hugging as the mill rumbles. On the cabin porch, Johnson peeks at his wrists, resting on the vibrating branch. Above, Jane clings to the edge of the windmill, while Sally perches on the ground. In the cabin, Thomas keeps the plow spun hard right. Below deck, Antonio rises from his hammock. In the stable, hay scatters through a narrow crack in the wall. In the library, Mitchell sits at his table. He glances above at the shivering glass lamp overhead. In the windmill, Jane and Sally look at the mountain. On the cabin porch, Thomas spins the plow to the left."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "He snaps his fingers and points to the car, opening the door to reveal empty seats. Smiling, Rose and Jack run onto the deck, share a kiss, and are observed by Murdoch and Fleet. Suddenly, Fleet notices a looming iceberg, rings the lookout bell, and alerts the bridge. Officer Moody answers the call as Quartermaster Hichens turns the wheel left. Murdoch shifts the engine room telegraph to full speed astern. In the engine room, chaos ensues as engineers react. The ship's main propeller slows, then reverses. Despite efforts to veer left, the ship scrapes the iceberg. Jack and Rose stop kissing, feeling the tremble. On deck, Murdoch holds the shaking rail, while Fleet and Lee watch from the crow's nest. Below deck, water pours through the hull, alarming passengers and crew."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Hichens turns the wheel to the right On the bridge Fleet and Lee gaze at the iceberg In the crow's nest He glances up at the trembling crystal chandelier above In the cabin Andrews sits at his desk In the cargo hold water shoots through a long tear in the hull Fabrizio sits up in his bunk Below deck left In the bridge Hichens keeps the wheel turned hard Fleet holds onto the rim of the crow's nest while Lee sits on the floor Above On the bridge deck Murdoch glances down at his hands resting on the shaking rail Jack and Rose stop kissing as the ship trembles The ship scrapes along the side of the ice At the bow railing a man runs toward it The ship's bow shifts to the left of the iceberg Sweat trickles down Murdoch's temples The ship's propellers turn and reverse Nearing the iceberg the ship veers slowly to the left Murdoch stares at the iceberg In the crow's nest the men stare at the iceberg as the ship heads straight toward it The propellers spin in the opposite direction An officer pushes an engineer out of the way and turns a wheel quickly to the right All the propellers stop An engineer pulls down a thick lever Underwater the ship's main propeller slows Engineers slam the furnace dampers shut A red warning light flashes Other engineers scurry around In the engine room an engineer yells Murdoch hurries to the bridge rail and peers at the iceberg He turns the wheel until it stops In the engine room the chief engineer spots the telegraph shift and drops a pot of steaming soup Hichens turns the wheel quickly Murdoch rushes over to the engine room telegraph and shifts the handle to full speed astern Quartermaster Hichens turns the wheel to the left Moody hangs up and turns to Murdoch as he runs to the bridge door Officer Moody steps onto the bridge and answers the phone The quartermaster at the wheel glances back at the phone Fleet rings the lookout bell three times and grabs a telephone which rings on the bridge Their eyes widen as a large iceberg looms straight ahead The men turn and gaze past the ship They stare down at Jack and Rose Fleet looks down and taps his comrade Lee on the arm Watching from the crow's nest another man Standing at the bridge rail Murdoch glances down at them smiles and walks off They kiss Rose places her hand on Jack's lips and gazes at him Smiling Rose and Jack run onto the forward well deck He snaps his fingers and points to the car then yanks open the car door revealing empty seats"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Smiling Rose and Jack run onto the forward well deck He snaps his fingers and points to the car then yanks open the car door revealing empty seats They kiss Rose places her hand on Jack's lips and gazes at him Watching from the crow's nest another man Standing at the bridge rail Murdoch glances down at them smiles and walks off They stare down at Jack and Rose Fleet looks down and taps his comrade Lee on the arm Their eyes widen as a large iceberg looms straight ahead The men turn and gaze past the ship The quartermaster at the wheel glances back at the phone Fleet rings the lookout bell three times and grabs a telephone which rings on the bridge Moody hangs up and turns to Murdoch as he runs to the bridge door Officer Moody steps onto the bridge and answers the phone Murdoch rushes over to the engine room telegraph and shifts the handle to full speed astern Quartermaster Hichens turns the wheel to the left In the engine room the chief engineer spots the telegraph shift and drops a pot of steaming soup Hichens turns the wheel quickly Murdoch hurries to the bridge rail and peers at the iceberg He turns the wheel until it stops Other engineers scurry around In the engine room an engineer yells Engineers slam the furnace dampers shut A red warning light flashes An engineer pulls down a thick lever Underwater the ship's main propeller slows An officer pushes an engineer out of the way and turns a wheel quickly to the right All the propellers stop In the crow's nest the men stare at the iceberg as the ship heads straight toward it The propellers spin in the opposite direction Nearing the iceberg the ship veers slowly to the left Murdoch stares at the iceberg Sweat trickles down Murdoch's temples The ship's propellers turn and reverse At the bow railing a man runs toward it The ship's bow shifts to the left of the iceberg Jack and Rose stop kissing as the ship trembles The ship scrapes along the side of the ice Above On the bridge deck Murdoch glances down at his hands resting on the shaking rail In the bridge Hichens keeps the wheel turned hard Fleet holds onto the rim of the crow's nest while Lee sits on the floor Below deck left In the cargo hold water shoots through a long tear in the hull Fabrizio sits up in his bunk He glances up at the trembling crystal chandelier above In the cabin Andrews sits at his desk Fleet and Lee gaze at the iceberg In the crow's nest Hichens turns the wheel to the right On the bridge"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "All the propellers stop An officer pushes an engineer out of the way and turns a wheel quickly to the right The propellers spin in the opposite direction In the crow's nest the men stare at the iceberg as the ship heads straight toward it Murdoch stares at the iceberg Nearing the iceberg the ship veers slowly to the left The ship's propellers turn and reverse Sweat trickles down Murdoch's temples The ship's bow shifts to the left of the iceberg At the bow railing a man runs toward it The ship scrapes along the side of the ice Jack and Rose stop kissing as the ship trembles On the bridge deck Murdoch glances down at his hands resting on the shaking rail Above Fleet holds onto the rim of the crow's nest while Lee sits on the floor In the bridge Hichens keeps the wheel turned hard left Below deck Fabrizio sits up in his bunk In the cargo hold water shoots through a long tear in the hull In the cabin Andrews sits at his desk He glances up at the trembling crystal chandelier above In the crow's nest Fleet and Lee gaze at the iceberg On the bridge Hichens turns the wheel to the right He snaps his fingers and points to the car then yanks open the car door revealing empty seats Smiling Rose and Jack run onto the forward well deck Rose places her hand on Jack's lips and gazes at him They kiss Standing at the bridge rail Murdoch glances down at them smiles and walks off Watching from the crow's nest another man Fleet looks down and taps his comrade Lee on the arm They stare down at Jack and Rose The men turn and gaze past the ship Their eyes widen as a large iceberg looms straight ahead Fleet rings the lookout bell three times and grabs a telephone which rings on the bridge The quartermaster at the wheel glances back at the phone Officer Moody steps onto the bridge and answers the phone Moody hangs up and turns to Murdoch as he runs to the bridge door Quartermaster Hichens turns the wheel to the left Murdoch rushes over to the engine room telegraph and shifts the handle to full speed astern Hichens turns the wheel quickly In the engine room the chief engineer spots the telegraph shift and drops a pot of steaming soup He turns the wheel until it stops Murdoch hurries to the bridge rail and peers at the iceberg In the engine room an engineer yells Other engineers scurry around A red warning light flashes Engineers slam the furnace dampers shut Underwater the ship's main propeller slows An engineer pulls down a thick lever"
        }
      ]
    }
  ]
}