{
  "ground_truth": "The mother glances at her young daughter, who nods. The two stewards exchange glances. Murdoch directs sailors lowering lifeboats filled with women and children. As one of the lifeboats tilts to one side, the passengers on board grimace. The sailors level the boat and lower it toward the water. A crewman fires a flare into the night sky. The passengers on deck, including Rose and Cal, gaze up. A young blond girl watches the flares and smiles. The flare explodes into separate fiery streams that fall. In the master-at-arms' office, Jack looks out through a porthole at the water, which almost reaches the middle of the glass. Sitting near Jack, Lovejoy places a bullet on a table and shoves the clip into the handgun. Lovejoy stands. He punches Jack in the stomach. Jack winces. Lovejoy picks up the handcuff key from the table, places it in his breast pocket, and leaves. Molly Brown helps a brunette woman. Cal smiles at Lightoller. Rose watches a tearful woman hug her husband. Ruth scans the passengers on the lifeboat. Ruth turns to Rose and smiles. Rose glares at Cal. Molly stands in the lifeboat. Molly helps Ruth into the boat. Rose's jaw slackens as she stares at Cal. Cal places Rose's life belt in the boat. Ruth and Molly reach toward Rose. Cal gestures. Rose walks away. Cal follows and grabs her. As she steps away, Cal grabs Rose and spins her toward him. Rose spits in Cal's face and runs off. The crewmen lower the lifeboat. In the master-at-arms' office, Jack peers at the water covering the porthole window. He bangs his handcuffs against the water pipe. Water floods a staircase and streams down a long corridor leading to the office. In the first-class corridor, Rose searches for Andrews. In another corridor, Andrews stops a steward and turns to a brunette woman, a blond maid. Andrews checks a passenger cabin. Rose runs to him. Andrews shakes his head. In the master-at-arms' office, Jack drops his head. Water streams in under the door. Jack climbs up the water pipe near the ceiling and bangs the handcuffs against the pipe. Elsewhere, Rose bumps into a steward as she runs to an elevator. As she reaches the elevator, an elevator operator with dark blond hair stops her. Rose shoves the operator into the elevator. The operator pushes a lever down as Rose closes the door. In the office, Jack tries to pull off the handcuffs. In the elevator, Rose's chest heaves. The elevator descends into rising water, which pours into the elevator. Rose opens the elevator doors and steps into a flood corridor. The operator pulls the lever up. Water empties out of the elevator as it rises.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The parent glances at her young daughter, who nods. The two attendants exchange glances. Murdoch instructs mariners lowering lifeboats filled with women and children. As one of the lifeboats tilts to one side, the travelers on board grimace. The mariners level the vessel and lower it toward the water. A crewman fires a flare into the evening sky. The travelers on deck, including Rose and Cal, gaze up. A young blond girl observes the flares and smiles. The flare detonates into distinct fiery streams that descend. In the master-at-arms' office, Jack gazes out through a porthole at the water, which nearly reaches the middle of the glass. Sitting near Jack, Lovejoy places a bullet on a tabletop and inserts the clip into the handgun. Lovejoy rises. He punches Jack in the stomach. Jack winces. Lovejoy retrieves the handcuff key from the table, places it in his breast pocket, and departs. Molly Brown assists a brunette woman. Cal smiles at Lightoller. Rose observes a tearful woman embrace her spouse. Ruth scans the travelers on the lifeboat. Ruth turns to Rose and smiles. Rose glares at Cal. Molly stands in the lifeboat. Molly assists Ruth into the vessel. Rose's jaw slackens as she stares at Cal. Cal places Rose's life belt in the boat. Ruth and Molly extend toward Rose. Cal gestures. Rose walks away. Cal follows and grabs her. As she steps away, Cal seizes Rose and spins her toward him. Rose spits in Cal's face and runs off. The crewmen lower the lifeboat. In the master-at-arms' office, Jack peers at the water covering the porthole window. He bangs his manacles against the water pipe. Water inundates a staircase and streams down a long passage leading to the office. In the first-class passage, Rose searches for Andrews. In another passage, Andrews stops an attendant and turns to a brunette woman, a blond maid. Andrews checks a traveler cabin. Rose runs to him. Andrews shakes his head. In the master-at-arms' office, Jack drops his head. Water streams in under the door. Jack climbs the water pipe near the ceiling and bangs the manacles against the pipe. Elsewhere, Rose collides with an attendant as she runs to an elevator. As she reaches the elevator, an elevator operator with dark blond hair stops her. Rose shoves the operator into the elevator. The operator pushes a lever down as Rose closes the door. In the office, Jack attempts to pull off the manacles. In the elevator, Rose's chest heaves. The elevator descends into rising water, which pours into the elevator. Rose opens the elevator doors and steps into a flooded passage. The operator pulls the lever up. Water empties out of the elevator as it ascends."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The young daughter is glanced at by the mother, who receives a nod. Glances are exchanged by the two stewards. Sailors lowering lifeboats filled with women and children are directed by Murdoch. As one of the lifeboats is tilted to one side, grimaces are made by the passengers on board. The sailors level the boat and it is lowered toward the water. A flare is fired into the night sky by a crewman. The flares are gazed up at by the passengers on deck, including Rose and Cal. The flares are watched by a young blond girl who smiles. The flare explodes into separate fiery streams, which fall. Through a porthole in the master-at-arms' office, Jack looks at the water, which almost reaches the middle of the glass. Sitting near Jack, a bullet is placed on a table by Lovejoy, who shoves the clip into the handgun. Lovejoy stands. Jack is punched in the stomach by Lovejoy. A wince is given by Jack. The handcuff key is picked up by Lovejoy from the table, placed in his breast pocket, and he leaves. A brunette woman is helped by Molly Brown. Lightoller is smiled at by Cal. A tearful woman is watched by Rose as she hugs her husband. The passengers on the lifeboat are scanned by Ruth. Ruth turns to Rose and offers a smile. Cal is glared at by Rose. In the lifeboat, Molly stands. Ruth is helped into the boat by Molly. Rose's jaw slackens as Cal is stared at by her. Rose's life belt is placed in the boat by Cal. Ruth and Molly reach toward Rose. A gesture is made by Cal. Rose walks away. Cal follows and grabs her. As she steps away, Rose is grabbed and spun toward him by Cal. Cal's face is spit on by Rose, and she runs off. The lifeboat is lowered by crewmen. In the master-at-arms' office, the water covering the porthole window is peered at by Jack. He bangs his handcuffs against the water pipe. A staircase is flooded with water as it streams down a long corridor leading to the office. In the first-class corridor, Andrews is searched for by Rose. In another corridor, a steward is stopped by Andrews, who turns to a brunette woman, a blond maid. A passenger cabin is checked by Andrews. To him Rose runs. Andrews shakes his head. In the master-at-arms' office, Jack drops his head. Water streams in under the door. The water pipe near the ceiling is climbed up by Jack, who bangs the handcuffs against it. Elsewhere, a steward is bumped into by Rose as she runs to an elevator. As the elevator is reached by her, she is stopped by a dark blond-haired elevator operator. The operator is shoved into the elevator by Rose. A lever is pushed down by the operator as Rose closes the door. In the office, the handcuffs are tried to be pulled off by Jack. In the elevator, Rose's chest heaves. The elevator descends into rising water, which pours into it. The elevator doors are opened by Rose who steps into a flooded corridor. The lever is pulled up by the operator. Water empties out of the elevator as it rises."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The mother glances at her young daughter, who nods. Two stewards exchange looks. Murdoch directs sailors lowering lifeboats filled with women and children. As one lifeboat tilts, passengers grimace, but sailors level and lower it. A crewman fires a flare into the night sky, observed by onlookers, including Rose and Cal. A young girl smiles as the flare bursts into fiery streams. In the master-at-arms' office, Jack watches water nearly reaching the porthole's middle. Nearby, Lovejoy places a bullet on a table, inserts a clip into his handgun, stands, punches Jack, and pockets the handcuff key before leaving. Molly Brown assists a brunette, and Cal smiles at Lightoller. Rose sees a tearful woman hug her husband. Ruth scans the lifeboat, then turns to smile at Rose, who glares at Cal. Molly and Ruth reach for Rose as Cal places Rose's life belt in the lifeboat, but Cal grabs her. Rose spits in Cal's face and runs off. Crewmen lower the lifeboat. In the office, Jack bangs handcuffs on a water pipe as water floods in. In the first-class corridor, Rose searches for Andrews. Elsewhere, Andrews checks cabins, nodding at a brunette woman and blond maid. Rose finds him, and he shakes his head. Jack climbs a water pipe and bangs the handcuffs against it. Rose bumps into a steward and reaches an elevator. The operator, with dark blond hair, stops her, but she shoves him in. The operator lowers the elevator as Rose closes the door. Jack struggles with handcuffs. The elevator descends into water, and Rose opens the doors to step into a flooded corridor. The operator pulls the lever to raise the elevator, emptying water."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The mother glances at her daughter, who nods. Two stewards exchange glances. Murdoch instructs sailors lowering lifeboats with women and children. A lifeboat tilts, passengers grimace, sailors level it, and lower it. A crewman fires a flare. Passengers, including Rose and Cal, watch. A blond girl smiles as the flare explodes. In the master-at-arms' office, Jack looks out at rising water. Nearby, Lovejoy places a bullet on a table, loads his gun, stands, punches Jack, picks up the handcuff key, and leaves. Molly Brown helps a woman. Cal smiles at Lightoller. Rose watches a woman hug her husband. Ruth scans lifeboat passengers, smiles at Rose, who glares at Cal. Molly helps Ruth into the lifeboat. Rose's jaw drops at Cal. Cal places her life belt in the boat. Ruth and Molly reach for Rose. Cal gestures. Rose walks away. Cal grabs her. She spits in his face and runs. Crewmen lower the lifeboat. In the office, Jack bangs his handcuffs on the water pipe as water floods the corridor. In another corridor, Rose searches for Andrews. Andrews stops a steward, checks cabins, and shakes his head. Jack drops his head as water streams in. He climbs a pipe, banging his handcuffs. Rose bumps into a steward and reaches an elevator, pushing the operator inside. The elevator descends, water rises, and Rose opens the door into a flood. The operator raises the elevator, emptying water."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The mother casts a glance at her young daughter, who, in response, gives a nod of understanding. Meanwhile, the two stewards nearby exchange knowing glances. Murdoch, focused and authoritative, directs the sailors who are diligently lowering the lifeboats, which are filled to capacity with women and children. As one of these lifeboats begins to tilt precariously to one side, the passengers seated on board grimace with anxiety. The sailors work swiftly to level the boat, carefully lowering it toward the dark, churning water below. Simultaneously, a crewman shoots a flare into the vast expanse of the night sky. All the passengers standing on the deck, including Rose and Cal, look upward. A young girl with blond hair watches the flares and smiles with innocent wonder. The flare bursts into fiery streams that cascade down. In the master-at-arms' office, Jack peers out through a small porthole at the water outside, which has now risen to nearly the middle of the glass. Nearby, Lovejoy, sitting close to Jack, places a single bullet on a table before loading a clip into the handgun. Rising to his feet, Lovejoy punches Jack hard in the stomach. Jack winces in pain. Lovejoy then picks up the handcuff key from the table, carefully tucks it into his breast pocket, and leaves the room. Meanwhile, Molly Brown offers assistance to a woman with brunette hair. Cal smiles at Lightoller, while Rose observes a tearful woman embracing her husband for perhaps the last time. Ruth, standing nearby, scans the passengers already seated in the lifeboat. She turns to Rose and offers a smile. Rose, however, glares at Cal with visible disdain. Molly stands in the lifeboat, assisting Ruth into her seat. As Rose's jaw slackens, she stares intently at Cal. Cal, maintaining a facade of politeness, places Rose's life belt into the boat. Ruth and Molly extend their hands toward Rose in a beckoning gesture. However, Cal gestures toward Rose, prompting her to walk away. Cal follows suit and physically grabs her. As she attempts to pull away, Cal seizes Rose once more, spinning her toward him. In an act of defiance, Rose spits in Cal's face and runs off. The crewmen continue to lower the lifeboat. Back in the master-at-arms' office, Jack watches as water covers the porthole window. He begins to bang his handcuffs against a nearby water pipe in frustration. Meanwhile, water urgently floods a staircase and streams down a long corridor leading directly to the office. In the first-class corridor, Rose is searching frantically for Andrews. Elsewhere, in another corridor, Andrews stops a steward and turns his attention to a brunette woman and a blond maid. Andrews checks a passenger cabin with urgency. Rose approaches him at a run. Andrews merely shakes his head. In the master-at-arms' office, Jack drops his head in a moment of despair as water streams relentlessly in under the door. Desperate, Jack climbs up the water pipe near the ceiling, fiercely banging the handcuffs against it. Elsewhere, Rose, in her haste, bumps into a steward as she makes her way to an elevator. As she reaches it, an elevator operator with dark blond hair tries to stop her. Rose shoves the operator into the elevator. With determination, the operator pushes a lever down as Rose closes the door. In the office, Jack struggles to pull off the handcuffs. In the elevator, Rose's chest heaves with fear and exertion. The elevator descends into the rising water, which begins to pour into it. As water fills the elevator, Rose manages to open the doors and step out into a flooded corridor. The operator then pulls the lever up. Water empties out of the elevator as it begins to rise."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The attentive mother casts a thoughtful glance at her young daughter, who, in a display of mutual understanding, gives a reassuring nod. At the same time, the pair of stewards standing nearby exchange glances filled with a shared understanding of the gravity of the situation. Murdoch, exhibiting a focused and authoritative demeanor, supervises the sailors who are diligently engaged in the task of lowering the lifeboats. These lifeboats are filled to their maximum capacity with women and children, prioritizing their safety. As one of these lifeboats begins to tilt precariously to one side, the passengers seated on it grimace anxiously, their faces etched with worry. The sailors work swiftly and efficiently to level the boat, carefully and methodically lowering it toward the dark, churning waters below. At the same moment, a crewman launches a flare into the vast, dark expanse of the night sky. All passengers standing on the deck, among them Rose and Cal, instinctively look upward at the spectacle. A young girl with blond hair watches the flares, her face lighting up with innocent wonder at the bright display. The flare bursts into fiery streams, cascading down like a luminous waterfall. Within the master-at-arms' office, Jack peers out through a small porthole, observing the water outside, which has ominously risen to nearly the midpoint of the glass. Nearby, Lovejoy, sitting close to Jack, places a single, ominous bullet on a table before methodically loading a clip into the handgun. Rising to his feet with a sense of purpose, Lovejoy punches Jack hard in the stomach, causing Jack to wince in palpable pain. Lovejoy then picks up the handcuff key from the table, carefully tucks it into his breast pocket for safekeeping, and leaves the room without another word. Meanwhile, Molly Brown reaches out to offer assistance to a woman with brunette hair. Cal smiles superficially at Lightoller, while Rose looks on, observing a tearful woman embracing her husband perhaps for the last time. Ruth, standing nearby, scans the passengers already seated in the lifeboat with a cautious eye. She turns to Rose and offers a reassuring smile. Rose, however, glares at Cal with visible disdain in her eyes. Molly stands poised within the lifeboat, assisting Ruth into her seat with care. As Rose's jaw slackens with emotion, she stares intently at Cal. Cal, maintaining a facade of politeness, places Rose’s life belt into the boat with practiced ease. Ruth and Molly extend their hands toward Rose in a beckoning gesture filled with urgency. However, Cal gestures insistently toward Rose, prompting her to walk away as he follows suit, physically grabbing her in the process. As she attempts to pull away from him, Cal seizes Rose once more, swiftly spinning her toward him. In an act of defiance, Rose spits in Cal's face, then turns and runs off. The crewmen, steadfast in their duties, continue to lower the lifeboat. Back in the master-at-arms’ office, Jack watches helplessly as water covers the porthole window. Frustrated, he begins to bang his handcuffs against a nearby water pipe in a futile attempt. Meanwhile, water urgently floods a staircase and streams down a long corridor leading directly to the office. In the first-class corridor, Rose searches frantically for Andrews. Elsewhere, in another corridor, Andrews stops a steward to direct his attention to a brunette woman and a blond maid. Andrews checks a passenger cabin with a sense of urgency. Rose, seeing him, approaches at a run. Andrews merely shakes his head, offering no solace. Back in the master-at-arms’ office, Jack drops his head in a moment of despair as water streams relentlessly in under the door. Desperate, he climbs up the water pipe near the ceiling, fiercely banging the handcuffs against it. Meanwhile, Rose, in her haste, bumps into a steward on her way to an elevator. As she reaches it, the elevator operator with dark blond hair tries to stop her, but Rose shoves the operator into the elevator. With determination and resolve, the operator pushes a lever down as Rose closes the door. In the office, Jack struggles persistently to pull off the handcuffs. In the elevator, Rose's chest heaves with mingled fear and exertion. The elevator descends into the rising water, which begins to pour into it through every crevice. As water fills the elevator, Rose manages to open the doors and step out into a flooded corridor. The operator then pulls the lever up, and water empties out of the elevator as it begins its ascent."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The mother quickly glances at her young daughter, who gives a reassuring nod in response, acknowledging the silent understanding between them. Meanwhile, the two stewards catch each other's eyes, silently communicating shared concern as the situation unfolds around them. Murdoch, standing with authoritative presence, directs sailors with precise gestures to lower lifeboats filled with women and children, ensuring the safety of the passengers. As the ropes strain against the weight, one lifeboat suddenly tilts to one side, causing the passengers on board to grimace with apprehension, their hands gripping the sides for stability. The sailors, with practiced skill, level the boat, their muscles taut as they work, and carefully lower it toward the dark, cold water below. A crewman, positioned strategically on the deck, lifts a flare gun to the sky and pulls the trigger, sending a flare shooting into the night sky with a streak of light. The passengers on deck, including Rose and Cal, pause their movements to gaze upward, their expressions a mix of awe and dread. Among them, a young blond girl, her face illuminated by the fiery glow, watches the flares with an innocent smile as they explode into separate fiery streams that cascade downward, illuminating the surrounding chaos. In the confining space of the master-at-arms' office, Jack peers out through a porthole at the rising water, which now almost reaches the middle of the glass, a clear indication of the dire situation. Sitting nearby, Lovejoy calmly places a bullet on a table, the metallic clink echoing in the small room, and methodically shoves the clip into his handgun with a soft click. Rising from his seat, Lovejoy stands with an air of menace, approaches Jack, and without warning, delivers a sharp punch to Jack's stomach. Jack doubles over, wincing in pain as he gasps for air. Deftly, Lovejoy picks up the handcuff key from the table, slips it into his breast pocket with a knowing smirk, and strides out of the office, leaving Jack in his predicament. Outside, Molly Brown, with a steady demeanor, lends a helping hand to a brunette woman, guiding her with care. Nearby, Cal's lips curl into a smile as he exchanges a look with Lightoller, sharing a moment of silent camaraderie amidst the unfolding drama. Rose, standing by, observes a tearful woman embrace her husband tightly, capturing a moment of raw emotion. Ruth scans the passengers loaded in the lifeboat, her eyes searching with maternal instinct, and then turns to Rose with a reassuring smile, offering silent encouragement. Rose, however, casts a glare in Cal's direction, her eyes filled with defiance. Molly stands with confidence in the lifeboat, extending her hand to help Ruth climb in, guiding her to safety. As Rose's jaw drops slightly in disbelief at the unfolding events, she continues to stare at Cal with a mixture of emotions. Cal, with a calculated move, places Rose's life belt in the lifeboat, gesturing towards the safety it represents. Meanwhile, Ruth and Molly reach out toward Rose, their hands extended in support. Cal makes a gesture intended to direct her, but Rose decisively turns on her heel and walks away with determination. Undeterred, Cal quickly follows and reaches out to grab her shoulder, spinning her around to face him. Undaunted, Rose musters her courage and spits directly in Cal's face, a bold act of defiance, before turning to run off. As the lifeboat is carefully lowered by the crewmen, Jack, back in the master-at-arms' office, peers intently at the water that now covers the porthole window, realizing the urgency of his situation. Desperately, he bangs his handcuffs against the water pipe, the metallic sound resounding with his struggle. Water floods a nearby staircase, cascading down a long corridor leading directly to the office, bringing with it a sense of impending doom. In the first-class corridor, Rose urgently searches for Andrews, her eyes scanning for any sign of him. Meanwhile, Andrews, in another corridor, stops a steward in his tracks, turning to address a brunette woman and a blond maid with calm determination, before moving to inspect a passenger cabin. Rose, driven by desperation, runs to him with a sense of urgency, but Andrews merely shakes his head, his expression somber. Resigned, Jack drops his head in the office as water streams in under the door, signaling the room's slow inundation. Clinging to hope, Jack climbs up the water pipe near the ceiling, his determination unwavering, and recommences banging the handcuffs against the pipe with renewed vigor. Elsewhere, Rose, in her urgent search, bumps into a steward, her momentum barely faltering as she races to reach an elevator. As she approaches the elevator, she encounters an operator with dark blond hair, who instinctively stops her with a questioning glance. Undeterred by protocol, Rose forcefully shoves the operator into the elevator with her, urgency marking her actions. The operator, understanding the gravity of the situation, pushes the lever down just as Rose hurriedly closes the door behind them. In the master-at-arms' office, Jack strains against his handcuffs, desperately trying to pull them off with every ounce of strength. In the descending elevator, Rose's chest rises and falls rapidly, her breath quick with anxiety as the elevator descends into the rising water, which begins to pour into the confined space, threatening her escape. With determination, Rose opens the elevator doors and steps into the flood corridor, the cold water swirling around her feet as she moves. The operator, reacting quickly, pulls the lever up to send the elevator back up, allowing water to empty out as it ascends, the danger momentarily averted."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The mother exchanges a nod with her young daughter before two stewards share looks. Murdoch directs sailors managing lifeboats filled with women and children. As a lifeboat tilts, passengers grimace, but sailors stabilize it and lower it into the water. A crewman fires a flare, capturing the attention of passengers, including Rose and Cal, while a young girl smiles as the flare bursts into fiery streams. In the master-at-arms' office, Jack observes water nearly covering a porthole. Lovejoy, sitting nearby, loads a handgun, punches Jack, retrieves the handcuff key, and leaves. Molly Brown assists a woman, and Cal exchanges smiles with Lightoller. Rose watches a tearful couple embrace before Ruth smiles at her. Rose reacts to Cal with disdain. Molly and Ruth board the lifeboat and reach out for Rose, but after Cal places Rose's life belt in the boat, she walks away. Cal follows, grabs her, and she retaliates by spitting in his face before running off. As the lifeboat lowers, Jack struggles with his handcuffs in the rising water, trying to break free by banging them against a water pipe. Water floods corridors leading to the office. Rose searches for Andrews, who checks a passenger cabin and shakes his head at her. Jack begins climbing the water pipe to escape as water streams in. Rose rushes to an elevator, forces the operator inside, and descends into rising water. The operator raises the elevator as Rose steps into a flooded corridor, leaving the elevator to drain as it ascends."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The mother glances at her young daughter, who nods in understanding of their dire circumstances aboard the Titanic, the ship famously dubbed \"unsinkable.\" The two stewards exchange glances, aware of the limited lifeboats available on this fateful night. First Officer Murdoch, well-known for his calm demeanor and leadership, directs sailors lowering lifeboats filled with women and children, following the maritime tradition of \"women and children first.\" As one of the lifeboats tilts to one side, a common fear among passengers given the recent chaotic evacuation, the passengers on board grimace. The sailors, trained for such emergencies, level the boat and lower it toward the freezing Atlantic water. A crewman, trying to signal for help from any nearby ships, fires a flare into the night sky. The passengers on deck, including Rose and Cal experiencing the chaos firsthand, gaze up. A young blond girl, unaware of the unfolding tragedy, watches the flares and smiles. The flare, designed to illuminate the sky and grab attention, explodes into separate fiery streams that fall. In the master-at-arms' office, Jack looks out through a porthole at the water, which almost reaches the middle of the glass, indicating the ship's rapidly sinking state. Sitting near Jack, Lovejoy, known as Cal's loyal and unscrupulous valet, places a bullet on a table and shoves the clip into the handgun, preparing for any confrontation. Lovejoy stands menacingly. He punches Jack in the stomach with calculated force. Jack winces, feeling the betrayal of those who should protect him. Lovejoy, not done with his intimidation, picks up the handcuff key from the table, places it in his breast pocket, and leaves, abandoning Jack to his fate. Molly Brown, the \"Unsinkable Molly Brown\" famed for her courage and philanthropy, helps a brunette woman find a lifeboat. Cal, putting on a facade of concern, smiles at Lightoller, the Titanic's second officer known for his strict adherence to protocol. Rose watches a tearful woman hug her husband, reminded of the personal tragedies surrounding her. Ruth, Rose's mother who is desperate to maintain their social status, scans the passengers on the lifeboat. Ruth turns to Rose and smiles, trying to mask her fear. Rose glares at Cal, seeing through his deceit. Molly stands in the lifeboat, taking charge as if commanding a lifeboat drill rather than a perilous escape. Molly helps Ruth into the boat, ensuring her safety. Rose's jaw slackens as she stares at Cal, aware of his manipulative nature. Cal places Rose's life belt in the boat with a gesture meant to feign care. Ruth and Molly reach toward Rose, urging her to join them. Cal gestures with impatience. Rose walks away, determined to make her own choice. Cal follows and grabs her, showing his controlling nature. As she steps away, Cal grabs Rose and spins her toward him, his desperation evident. Rose spits in Cal's face, a defiant act reflecting her rejection of his authority, and runs off. The crewmen lower the lifeboat, their actions now routine amidst chaos. In the master-at-arms' office, Jack peers at the water covering the porthole window, realizing time is running out. He bangs his handcuffs against the water pipe, hoping for a miracle. Water floods a staircase and streams down a long corridor leading to the office, a chilling reminder of the ship's inevitable fate. In the first-class corridor, Rose searches for Andrews, the ship's architect carrying the weight of his creation's failure. In another corridor, Andrews stops a steward and turns to a brunette woman, a blond maid accompanying the wealthier passengers. Andrews checks a passenger cabin, his heart heavy with responsibility. Rose runs to him, desperate for guidance. Andrews shakes his head, acknowledging the helplessness of their situation. In the master-at-arms' office, Jack drops his head, feeling the despair set in. Water streams in under the door, a relentless force. Jack climbs up the water pipe near the ceiling and bangs the handcuffs against the pipe, his determination still flickering. Elsewhere, Rose bumps into a steward as she runs to an elevator, her urgency heightened. As she reaches the elevator, an elevator operator with dark blond hair stops her, questioning her decision amidst the chaos. Rose shoves the operator into the elevator, urgency overriding manners. The operator, sensing the gravity of the situation, pushes a lever down as Rose closes the door. In the office, Jack tries to pull off the handcuffs, his hope dwindling. In the elevator, Rose's chest heaves, her courage battling her fear. The elevator descends into rising water, a terrifying plunge. Water pours into the elevator, a stark reminder of the Titanic's final moments. Rose opens the elevator doors and steps into a flood corridor, facing the peril head-on. The operator pulls the lever up, knowing the ascent could be their last chance. Water empties out of the elevator as it rises, temporarily granting them relief."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The mother glances at her young daughter who nods. The two stewards exchange glances. Murdoch directs sailors lowering lifeboats filled with women and children. As one of the lifeboats tilts to one side the passengers on board grimace. The sailors level the boat and lower it toward the water. A crewman fires a flare into the night sky. The passengers on deck including Rose and Cal gaze up. A young blond girl watches the flares and smiles. The flare explodes into separate fiery streams that fall. In the masteratarms' office Jack looks out through a porthole at the water which almost reaches the middle of the glass. Sitting near Jack Lovejoy places a bullet on a table and shoves the clip into the handgun. Lovejoy stands. He punches Jack in the stomach. Jack winces. Lovejoy picks up the handcuff key from the table places it in his breast pocket and leaves Molly. Brown helps a brunette woman. Cal smiles at Lightoller. Rose watches a tearful woman hug her husband. Ruth scans the passengers on the lifeboat. Ruth turns to Rose and smiles. Rose glares at Cal. Molly stands in the lifeboat. Molly helps Ruth into the boat. Rose's jaw slackens as she stares at Cal. Cal places Rose's life belt in the boat. Ruth and Molly reach toward Rose. Cal gestures. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Rose walks away. Cal follows and grabs her. As she steps away Cal grabs Rose and spins her toward him. Rose spits in Cal's face and runs off. The crewmen lower the lifeboat. In the masteratarms' office Jack peers at the water covering the porthole window. He bangs his handcuffs against the water pipe. Water floods a staircase and streams down a long corridor leading to the office. In the firstclass corridor Rose searches for Andrews. In another corridor Andrews stops a steward and turns to a brunette woman. a blond maid. Andrews checks a passenger cabin. Rose runs to him. Andrews shakes his head. In the masteratarms' office Jack drops his head. Water streams in under the door. Jack climbs up the water pipe near the ceiling and bangs the handcuffs against the pipe. Elsewhere Rose bumps into a steward as she runs to an elevator. As she reaches the elevator an elevator operator with dark blond hair stops her. Rose shoves the operator into the elevator. The operator pushes a lever down as Rose closes the door. In the office Jack tries to pull off the handcuffs. In the elevator Rose's chest heaves. The elevator descends into rising water which pours into the elevator. Rose opens the elevator doors and steps into a flood corridor. The operator pulls the lever up. Water empties out of the elevator as it rises."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The mother glances at her young daughter who nods. The two stewards exchange glances. Murdoch directs sailors lowering lifeboats filled with women and children. As one of the lifeboats tilts to one side the passengers on board grimace. The sailors level the boat and lower it toward the water. A crewman fires a flare into the night sky. The passengers on deck including Rose and Cal gaze up. A young blond girl watches the flares and smiles. The flare explodes into separate fiery streams that fall. In the masteratarms' office Jack looks out through a porthole at the water which almost reaches the middle of the glass. Sitting near Jack Lovejoy places a bullet on a table and shoves the clip into the handgun. Lovejoy stands. He punches Jack in the stomach. Jack winces. Lovejoy picks up the handcuff key from the table places it in his breast pocket and leaves Molly. Brown helps a brunette woman. Cal smiles at Lightoller. Rose watches a tearful woman hug her husband. Ruth scans the passengers on the lifeboat. Ruth turns to Rose and smiles. Rose glares at Cal. Molly stands in the lifeboat. Molly helps Ruth into the boat. Rose's jaw slackens as she stares at Cal. Cal places Rose's life belt in the boat. Ruth and Molly reach toward Rose. Cal gestures. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Rose walks away. Cal follows and grabs her. As she steps away Cal grabs Rose and spins her toward him. Rose spits in Cal's face and runs off. The crewmen lower the lifeboat. In the masteratarms' office Jack peers at the water covering the porthole window. He bangs his handcuffs against the water pipe. Water floods a staircase and streams down a long corridor leading to the office. In the firstclass corridor Rose searches for Andrews. In another corridor Andrews stops a steward and turns to a brunette woman. a blond maid. Andrews checks a passenger cabin. Rose runs to him. Andrews shakes his head. In the masteratarms' office Jack drops his head. Water streams in under the door. Jack climbs up the water pipe near the ceiling and bangs the handcuffs against the pipe. Elsewhere Rose bumps into a steward as she runs to an elevator. As she reaches the elevator an elevator operator with dark blond hair stops her. Rose shoves the operator into the elevator. The operator pushes a lever down as Rose closes the door. In the office Jack tries to pull off the handcuffs. In the elevator Rose's chest heaves. The elevator descends into rising water which pours into the elevator. Rose opens the elevator doors and steps into a flood corridor. The operator pulls the lever up. Water empties out of the elevator as it rises."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The mother glances at her young daughter who nods. The two stewards exchange glances. Murdoch directs sailors lowering lifeboats filled with women and children. As one of the lifeboats tilts to one side the passengers on board grimace. The sailors level the boat and lower it toward the water. A crewman fires a flare into the night sky. The passengers on deck including Rose and Cal gaze up. A young blond girl watches the flares and smiles. The flare explodes into separate fiery streams that fall. In the masteratarms' office Jack looks out through a porthole at the water which almost reaches the middle of the glass. Sitting near Jack Lovejoy places a bullet on a table and shoves the clip into the handgun. Lovejoy stands. He punches Jack in the stomach. Jack winces. In the masteratarms' office Jack drops his head. Water streams in under the door. Jack climbs up the water pipe near the ceiling and bangs the handcuffs against the pipe. Elsewhere Rose bumps into a steward as she runs to an elevator. As she reaches the elevator an elevator operator with dark blond hair stops her. Rose shoves the operator into the elevator. The operator pushes a lever down as Rose closes the door. In the office Jack tries to pull off the handcuffs. In the elevator Rose's chest heaves. The elevator descends into rising water which pours into the elevator. Rose opens the elevator doors and steps into a flood corridor. The operator pulls the lever up. Water empties out of the elevator as it rises."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The mother glances at her young daughter who nods. The two stewards exchange glances. Murdoch directs sailors lowering lifeboats filled with women and children. As one of the lifeboats tilts to one side the passengers on board grimace. The sailors level the boat and lower it toward the water. A crewman fires a flare into the night sky. In the elevator Rose's chest heaves. The elevator descends into rising water which pours into the elevator. Rose opens the elevator doors and steps into a flood corridor. The operator pulls the lever up. Water empties out of the elevator as it rises."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The teacher glances at her small duck, who winks. The two architects swap smiles. Brighton commands knights lifting wagons filled with paintings and toys. As one of the wagons sways to one edge, the travelers inside groan. The knights stabilize the carriage and hover it toward the meadow. A gardener launches a balloon into the evening fog. The travelers on the ridge, including Daisy and Ray, stare up. A young red-haired rabbit observes the balloons and chuckles. The balloon bursts into distinct glowing sparks that drift. In the captain-at-arms' chamber, Leo peers out through a window at the river, which nearly touches the center of the lens. Resting beside Leo, Valor places a marble on a shelf and slides the magazine into the slingshot. Valor rises. He taps Leo in the shoulder. Leo grimaces. Valor picks up the padlock key from the shelf, tucks it in his waistcoat, and exits. Carrie Steele assists a blond otter. Ray grins at Kent. Daisy witnesses a joyous duck embrace her friend. Mia scans the travelers in the wagon. Mia turns to Daisy and grins. Daisy frowns at Ray. Carrie stands in the wagon. Carrie aids Mia into the carriage. Daisy's brow furrows as she gazes at Ray. Ray places Daisy's travel bag in the carriage. Mia and Carrie reach toward Daisy. Ray signals. Daisy wanders off. Ray trails her and nudges her. As she strides away, Ray snatches Daisy and twirls her toward him. Daisy whispers in Ray's ear and rushes off. The gardeners lower the wagon. In the captain-at-arms' chamber, Leo squints at the river covering the windowpane. He taps his shackles against the metal ladder. River water gushes down a bridge and cascades along a narrow lane leading to the chamber. In the premium passageway, Daisy searches for Bennett. In another lane, Bennett halts a guard and turns to a greyhound, a curly-haired cat. Bennett inspects a guest room. Daisy sprints to him. Bennett nods sorrowfully. In the captain-at-arms' chamber, Leo bows his head. River water streams in under the archway. Leo climbs up the metal ladder near the roof and taps the shackles against the ladder. Meanwhile, Daisy collides with a guard as she rushes to an escalator. As she approaches the escalator, an escalator manager with curly dark hair halts her. Daisy nudges the manager into the escalator. The manager pulls a lever downward as Daisy shuts the gate. In the chamber, Leo attempts to tug off the shackles. In the escalator, Daisy’s heart pounds. The escalator descends into swelling river water, which floods into the escalator. Daisy opens the escalator gates and steps into a deluge lane. The manager pushes the lever upward. River water drains from the escalator as it rises."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The mother exchanges nods with her daughter, while stewards glance at each other. Murdoch directs sailors to lower lifeboats filled with women and children, correcting a tilting boat. A crewman fires a flare, capturing the attention of passengers like Rose and Cal. Jack peers out of the master-at-arms' office window, where rising water is visible. Lovejoy menaces Jack with a gun before leaving. Molly Brown helps women into the lifeboat, while Cal forces Rose to board. Rose defies Cal, spitting in his face and running off. Jack, trapped in the office, struggles with his handcuffs as water floods in. Meanwhile, Rose searches for Andrews, who is preoccupied with aiding passengers. She finally finds him, but he cannot help Jack. Determined, Rose heads to an elevator, pushing the operator inside. They descend into water, and as Rose exits into a flooded corridor, the operator raises the elevator, draining the water."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Water empties out of the elevator as it rises The operator pulls the lever up Rose opens the elevator doors and steps into a flood corridor The elevator descends into rising water which pours into the elevator In the elevator Rose's chest heaves In the office Jack tries to pull off the handcuffs The operator pushes a lever down as Rose closes the door Rose shoves the operator into the elevator As she reaches the elevator an elevator operator with dark blond hair stops her Elsewhere Rose bumps into a steward as she runs to an elevator Jack climbs up the water pipe near the ceiling and bangs the handcuffs against the pipe Water streams in under the door In the masteratarms' office Jack drops his head Andrews shakes his head Rose runs to him Andrews checks a passenger cabin a blond maid In another corridor Andrews stops a steward and turns to a brunette woman In the firstclass corridor Rose searches for Andrews Water floods a staircase and streams down a long corridor leading to the office He bangs his handcuffs against the water pipe In the masteratarms' office Jack peers at the water covering the porthole window The crewmen lower the lifeboat Rose spits in Cal's face and runs off As she steps away Cal grabs Rose and spins her toward him Cal follows and grabs her Rose walks away Cal gestures Ruth and Molly reach toward Rose Cal places Rose's life belt in the boat Rose's jaw slackens as she stares at Cal Molly helps Ruth into the boat Molly stands in the lifeboat Rose glares at Cal Ruth turns to Rose and smiles Ruth scans the passengers on the lifeboat Rose watches a tearful woman hug her husband Cal smiles at Lightoller Brown helps a brunette woman Lovejoy picks up the handcuff key from the table places it in his breast pocket and leaves Molly Jack winces He punches Jack in the stomach Lovejoy stands Sitting near Jack Lovejoy places a bullet on a table and shoves the clip into the handgun In the masteratarms' office Jack looks out through a porthole at the water which almost reaches the middle of the glass The flare explodes into separate fiery streams that fall A young blond girl watches the flares and smiles The passengers on deck including Rose and Cal gaze up A crewman fires a flare into the night sky The sailors level the boat and lower it toward the water As one of the lifeboats tilts to one side the passengers on board grimace Murdoch directs sailors lowering lifeboats filled with women and children The two stewards exchange glances The mother glances at her young daughter who nods"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The two stewards exchange glances The mother glances at her young daughter who nods As one of the lifeboats tilts to one side the passengers on board grimace Murdoch directs sailors lowering lifeboats filled with women and children A crewman fires a flare into the night sky The sailors level the boat and lower it toward the water A young blond girl watches the flares and smiles The passengers on deck including Rose and Cal gaze up In the masteratarms' office Jack looks out through a porthole at the water which almost reaches the middle of the glass The flare explodes into separate fiery streams that fall Lovejoy stands Sitting near Jack Lovejoy places a bullet on a table and shoves the clip into the handgun Jack winces He punches Jack in the stomach Brown helps a brunette woman Lovejoy picks up the handcuff key from the table places it in his breast pocket and leaves Molly Rose watches a tearful woman hug her husband Cal smiles at Lightoller Ruth turns to Rose and smiles Ruth scans the passengers on the lifeboat Molly stands in the lifeboat Rose glares at Cal Rose's jaw slackens as she stares at Cal Molly helps Ruth into the boat Ruth and Molly reach toward Rose Cal places Rose's life belt in the boat Rose walks away Cal gestures As she steps away Cal grabs Rose and spins her toward him Cal follows and grabs her The crewmen lower the lifeboat Rose spits in Cal's face and runs off He bangs his handcuffs against the water pipe In the masteratarms' office Jack peers at the water covering the porthole window In the firstclass corridor Rose searches for Andrews Water floods a staircase and streams down a long corridor leading to the office a blond maid In another corridor Andrews stops a steward and turns to a brunette woman Rose runs to him Andrews checks a passenger cabin In the masteratarms' office Jack drops his head Andrews shakes his head Jack climbs up the water pipe near the ceiling and bangs the handcuffs against the pipe Water streams in under the door As she reaches the elevator an elevator operator with dark blond hair stops her Elsewhere Rose bumps into a steward as she runs to an elevator The operator pushes a lever down as Rose closes the door Rose shoves the operator into the elevator In the elevator Rose's chest heaves In the office Jack tries to pull off the handcuffs Rose opens the elevator doors and steps into a flood corridor The elevator descends into rising water which pours into the elevator Water empties out of the elevator as it rises The operator pulls the lever up"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Rose walks away Cal follows and grabs her As she steps away Cal grabs Rose and spins her toward him Rose spits in Cal's face and runs off The crewmen lower the lifeboat In the masteratarms' office Jack peers at the water covering the porthole window He bangs his handcuffs against the water pipe Water floods a staircase and streams down a long corridor leading to the office In the firstclass corridor Rose searches for Andrews In another corridor Andrews stops a steward and turns to a brunette woman a blond maid Andrews checks a passenger cabin Rose runs to him Andrews shakes his head In the masteratarms' office Jack drops his head Water streams in under the door Jack climbs up the water pipe near the ceiling and bangs the handcuffs against the pipe Elsewhere Rose bumps into a steward as she runs to an elevator As she reaches the elevator an elevator operator with dark blond hair stops her Rose shoves the operator into the elevator The operator pushes a lever down as Rose closes the door In the office Jack tries to pull off the handcuffs In the elevator Rose's chest heaves The elevator descends into rising water which pours into the elevator Rose opens the elevator doors and steps into a flood corridor The operator pulls the lever up Water empties out of the elevator as it rises The mother glances at her young daughter who nods The two stewards exchange glances Murdoch directs sailors lowering lifeboats filled with women and children As one of the lifeboats tilts to one side the passengers on board grimace The sailors level the boat and lower it toward the water A crewman fires a flare into the night sky The passengers on deck including Rose and Cal gaze up A young blond girl watches the flares and smiles The flare explodes into separate fiery streams that fall In the masteratarms' office Jack looks out through a porthole at the water which almost reaches the middle of the glass Sitting near Jack Lovejoy places a bullet on a table and shoves the clip into the handgun Lovejoy stands He punches Jack in the stomach Jack winces Lovejoy picks up the handcuff key from the table places it in his breast pocket and leaves Molly Brown helps a brunette woman Cal smiles at Lightoller Rose watches a tearful woman hug her husband Ruth scans the passengers on the lifeboat Ruth turns to Rose and smiles Rose glares at Cal Molly stands in the lifeboat Molly helps Ruth into the boat Rose's jaw slackens as she stares at Cal Cal places Rose's life belt in the boat Ruth and Molly reach toward Rose Cal gestures"
        }
      ]
    }
  ]
}