{
  "ground_truth": "DANTE holds a ball in the center of the court while REDDING stretches, leaning against the sign. DANTE skids to the sidelines and then skates to his side before skidding back to the sidelines to address the CUSTOMER. Below, a WOMAN pulls at the door, peers into the store with her face against the glass, backs up, and shields her eyes while looking toward the roof. A new face-off pits DANTE against the CUSTOMER, who winds up and takes a hard shot. The ball sails off the court, through the air, and into a faraway yard, dropping between the two as DANTE gets flattened. DANTE scrambles to the edge and calls over, looks around hyperventilating, and calls to the sidelines as SANFORD skates up to him. DANTE skates off and is later seen standing on a ladder, replacing a fluorescent light while an OLD MAN joins him at the foot of the ladder. With the light in place, DANTE descends the ladder and closes it, glances over and reacts as the OLD MAN walks off, and he heads back to the counter. The OLD MAN returns, visibly taking DANTE aback. DANTE is then seen driving with passenger RANDAL, their backs to the camera, in absolute silence, before DANTE glares at RANDAL. A MASSIVE CROWD is outside the store as DANTE and RANDAL walk up the path to the funeral parlor. Car locks are slammed down as DANTE and RANDAL run from the front door, chased by a small crowd of angry mourners, and the car screams away. The pursuing crowd stands in the middle of the street, shaking their fists and throwing things as the car pulls up, and RANDAL and DANTE get out where absolutely nobody is outside. JAY enters the frame next to RANDAL, aims his butt at him, and farts, prompting DANTE to grab RANDAL, and RANDAL to lunge for him. A KID tugs at JAY'S shirt before they head back to the counter, and DANTE walks away, shaking his head. DANTE puts up cigarettes as the CUSTOMER lets it sink in and leaves in a huff, while another CUSTOMER leans in, and RANDAL spits a mist of water at him, drenching him. The man reacts violently, attempting to grab RANDAL from over the counter as DANTE plays block, but RANDAL makes no move and remains untouched, saluting the CUSTOMER as he leaves, wiping water from his face. RANDAL exits as DANTE waits on a customer (TRAINER), lifting a gallon of milk into a paper bag with a slight grunt, and a female customer (HEATHER) leans in the doorway. A SUITED MAN carrying a notebook comes to the counter, scribbles in his notebook, rips out a piece of paper, and hands it to DANTE before exiting with DANTE trying to follow.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "DANTE grips a sphere in the middle of the field while REDDING extends, leaning against the notice. DANTE slides to the boundaries and then glides to his area before slipping back to the borders to speak to the CUSTOMER. Beneath, a LADY tugs at the entrance, gazes into the shop with her visage against the pane, retreats, and covers her eyes while glancing toward the rooftop. A fresh showdown matches DANTE against the PATRON, who coils up and takes a firm strike. The sphere flies off the field, through the atmosphere, and into a distant garden, descending between the pair as DANTE gets squashed. DANTE scrambles to the periphery and calls over, scans around panting, and calls to the margins as SANFORD glides up to him. DANTE skates off and is later observed standing on a ladder, replacing a fluorescent bulb while an OLD MAN joins him at the base of the ladder. With the bulb in position, DANTE descends the ladder and folds it, glances over and reacts as the ELDERLY GENTLEMAN strolls off, and he heads back to the counter. The ELDERLY GENTLEMAN returns, visibly surprising DANTE. DANTE is then seen driving with passenger RANDAL, their backs to the lens, in complete quiet, before DANTE scowls at RANDAL. A MASSIVE CROWD is outside the shop as DANTE and RANDAL stroll up the trail to the funeral home. Auto locks are slammed down as DANTE and RANDAL sprint from the entrance, pursued by a tiny group of irate mourners, and the vehicle screeches away. The pursuing group stands in the center of the roadway, shaking their fists and hurling objects as the vehicle pulls up, and RANDAL and DANTE disembark where absolutely no one is outside. JAY enters the scene next to RANDAL, aims his rear at him, and passes gas, prompting DANTE to seize RANDAL, and RANDAL to lunge for him. A CHILD pulls at JAY'S garment before they head back to the counter, and DANTE walks away, shaking his head. DANTE puts up cigarettes as the PATRON lets it sink in and departs in a huff, while another PATRON leans in, and RANDAL spits a mist of liquid at him, soaking him. The man reacts forcefully, trying to seize RANDAL from over the counter as DANTE acts as a barrier, but RANDAL makes no move and remains untouched, saluting the PATRON as he departs, wiping liquid from his visage. RANDAL exits as DANTE serves a patron (TRAINER), lifting a gallon of milk into a paper sack with a slight groan, and a female patron (HEATHER) leans in the entrance. A SUITED MAN carrying a notebook comes to the counter, scribbles in his notebook, rips out a piece of paper, and hands it to DANTE before exiting with DANTE trying to follow."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A ball is held by DANTE in the center of the court while the sign is leaned against by REDDING, stretching. The sidelines are skidded to by DANTE and then he skates to his side before the CUSTOMER is addressed by him after skidding back to the sidelines. Below, the door is pulled at by a WOMAN, her face is pressed against the glass as she peers into the store, she backs up, and her eyes are shielded by her while she looks toward the roof. A new face-off pits the CUSTOMER against DANTE, who winds up and takes a hard shot. The court is sailed off by the ball, through the air, and it drops between the two in a faraway yard as DANTE gets flattened. The edge is scrambled to by DANTE and he calls over, looks around hyperventilating, and calls to the sidelines as he is skated up to by SANFORD. DANTE skates off and is later standing on a ladder seen by others, replacing a fluorescent light while the foot of the ladder is joined by an OLD MAN. With the light in place, the ladder is descended by DANTE and closed, glancing over and reacting as the OLD MAN walks off, and back to the counter he heads. Visibly taking DANTE aback, the OLD MAN returns. DANTE is then driving seen with passenger RANDAL, their backs to the camera, in absolute silence, before RANDAL is glared at by DANTE. The store is outside of a MASSIVE CROWD as the path to the funeral parlor is walked up by DANTE and RANDAL. Car locks are slammed down by them as the front door is run from by DANTE and RANDAL, chased by a small crowd of angry mourners, and the car is screamed away. The middle of the street is stood in by the pursuing crowd, shaking their fists and throwing things as up to the car it pulls, and where absolutely nobody is outside, RANDAL and DANTE get out. The frame is entered by JAY next to RANDAL, his butt is aimed at him, and he farts, prompting RANDAL to be grabbed by DANTE, and RANDAL lunges for him. JAY'S shirt is tugged at by a KID before the counter is headed back to by them, and his head is shaken by DANTE as he walks away. Cigarettes are put up by DANTE as it is let sink in by the CUSTOMER and he leaves in a huff, while another CUSTOMER leans in, and a mist of water is spat by RANDAL at him, drenching him. The man reacts violently, attempting to grab RANDAL from over the counter as block is played by DANTE, but RANDAL makes no move and remains untouched, the CUSTOMER is saluted by him as water is wiped from his face. DANTE waits on a customer (TRAINER), lifting a gallon of milk into a paper bag with a slight grunt, as RANDAL exits, and a female customer (HEATHER) leans in the doorway. The counter is approached by a SUITED MAN carrying a notebook, who scribbles in his notebook, and a piece of paper is ripped out and handed to DANTE before exiting with DANTE trying to follow."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "DANTE holds a ball at the court's center while REDDING stretches against a sign. DANTE skids to the sidelines, skates to his side, then returns to address the CUSTOMER. Below, a WOMAN peers into the store, backs up, and shields her eyes toward the roof. DANTE faces off against the CUSTOMER, who takes a hard shot, sending the ball into a distant yard, flattening DANTE. He scrambles to the edge, calls over, and SANFORD skates up. Later, DANTE stands on a ladder, replacing a fluorescent light as an OLD MAN joins him. With the light fixed, DANTE descends, closes the ladder, and reacts as the OLD MAN departs, then returns, surprising DANTE. DANTE drives silently with RANDAL, glaring at him. A MASSIVE CROWD is outside as they approach the funeral parlor. Car locks slam as they flee from angry mourners, who shake fists and throw things as the car pulls up, and RANDAL and DANTE exit to an empty area. JAY enters, farts at RANDAL, prompting DANTE to grab him. A KID tugs JAY'S shirt before they return to the counter, and DANTE walks away, shaking his head. DANTE puts up cigarettes as a CUSTOMER leaves in a huff, while another CUSTOMER leans in, and RANDAL spits water at him. The man reacts violently, but RANDAL remains untouched, saluting the CUSTOMER as he leaves. RANDAL exits as DANTE serves a customer (TRAINER), lifting milk into a bag, and a female customer (HEATHER) leans in the doorway. A SUITED MAN writes in a notebook, hands a paper to DANTE, and exits with DANTE trying to follow."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "DANTE holds a ball at the court's center while REDDING stretches against a sign. DANTE skids to the sidelines, skates to his side, then returns to address the CUSTOMER. A WOMAN peers into the store, backs up, and shields her eyes toward the roof. DANTE faces the CUSTOMER, who takes a hard shot, sending the ball into a distant yard, flattening DANTE. He scrambles to the edge, calls over, and SANFORD skates up. DANTE later stands on a ladder, replacing a light as an OLD MAN joins him. With the light fixed, DANTE descends, reacts as the OLD MAN leaves, and returns to the counter. The OLD MAN returns, surprising DANTE. DANTE drives with RANDAL in silence, then glares at him. A MASSIVE CROWD is outside as they approach the funeral parlor. They run from angry mourners, and the car speeds away. The crowd shakes fists and throws things as the car stops, and RANDAL and DANTE exit to an empty area. JAY enters, farts at RANDAL, prompting DANTE to grab him. A KID tugs JAY'S shirt, and they return to the counter. DANTE puts up cigarettes as a CUSTOMER leaves angrily, another CUSTOMER leans in, and RANDAL spits water at him. The man reacts violently, but RANDAL remains untouched, saluting as the CUSTOMER leaves. RANDAL exits as DANTE serves a customer (TRAINER), lifting milk into a bag, while HEATHER leans in the doorway. A SUITED MAN writes in a notebook, hands a paper to DANTE, and exits with DANTE trying to follow."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "DANTE stands firmly in the center of the court, holding a ball with a focused expression, while REDDING stretches leisurely, leaning casually against the sign. DANTE then makes a swift move, skidding to the sidelines, before skating back to his side with agility, only to skid once more to the sidelines to address the waiting CUSTOMER. Meanwhile, below, a WOMAN tugs at the door, pressing her face against the glass to peer inside the store. She then steps back, shielding her eyes with her hand as she gazes up toward the roof. A new face-off ensues, pitting DANTE against the determined CUSTOMER, who winds up and takes a powerful shot. The ball soars off the court, flying through the air, and lands in a distant yard, dropping between the two as DANTE is knocked flat. DANTE quickly scrambles to the edge, calling over and looking around in a state of hyperventilation, before calling out to the sidelines as SANFORD skates up to him. DANTE skates away and is later seen standing atop a ladder, diligently replacing a fluorescent light, while an OLD MAN joins him at the base of the ladder. With the light securely in place, DANTE descends the ladder, closes it with a glance over his shoulder, and reacts as the OLD MAN walks away, prompting him to head back to the counter. The OLD MAN returns unexpectedly, visibly startling DANTE. Subsequently, DANTE is seen driving in silence with passenger RANDAL, their backs turned to the camera, until DANTE shoots a glare at RANDAL. Outside the store, a MASSIVE CROWD gathers as DANTE and RANDAL make their way up the path to the funeral parlor. Car locks are slammed down in a hurry as DANTE and RANDAL dash from the front door, pursued by a small crowd of angry mourners, and the car speeds away with urgency. The pursuing crowd stands defiantly in the middle of the street, shaking their fists and hurling objects as the car pulls up, and RANDAL and DANTE step out where absolutely no one is present. JAY enters the frame beside RANDAL, aiming his butt at him and letting out a fart, prompting DANTE to grab RANDAL, and RANDAL to lunge at him. A KID tugs at JAY'S shirt before they all head back to the counter, with DANTE walking away, shaking his head in disbelief. DANTE busies himself putting up cigarettes as the CUSTOMER lets the situation sink in and leaves in a huff, while another CUSTOMER leans in, only for RANDAL to spit a mist of water at him, drenching him completely. The man reacts violently, attempting to grab RANDAL from over the counter, but DANTE steps in to block, while RANDAL remains unmoved and untouched, saluting the CUSTOMER as he departs, wiping water from his face. RANDAL exits as DANTE attends to a customer (TRAINER), lifting a gallon of milk into a paper bag with a slight grunt, while a female customer (HEATHER) leans in the doorway. A SUITED MAN, carrying a notebook, approaches the counter, scribbles something in his notebook, tears out a piece of paper, and hands it to DANTE before exiting, with DANTE trying to follow him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "DANTE stands resolutely and firmly planted in the very center of the court, holding a ball in his hands with a focused and determined expression etched on his face. Meanwhile, REDDING stretches leisurely, leaning casually against the sign, exuding an air of nonchalance. DANTE then makes a swift and precise move, skidding energetically to the sidelines, before skillfully skating back to his side with impressive agility, only to skid once more to the sidelines to address the waiting CUSTOMER. Meanwhile, below in the scene, a WOMAN tugs persistently at the door, pressing her face eagerly against the glass to peer inside the store. She then steps back thoughtfully, shielding her eyes with her hand as she gazes up toward the roof, perhaps in search of something. A new face-off unfolds, pitting DANTE against the determined CUSTOMER, who winds up and takes a powerful shot. The ball soars off the court, flying high through the air, and lands in a distant yard, dropping between the two individuals as DANTE is knocked flat on the ground. DANTE quickly scrambles to the edge in a hurry, looking around in a state of hyperventilation before calling out to the sidelines as SANFORD skates up to him. DANTE skates away with purpose and is later observed standing atop a ladder, diligently replacing a fluorescent light. An OLD MAN joins him at the base of the ladder, providing silent company. With the light securely in place, DANTE descends the ladder, carefully closing it with a glance over his shoulder, and reacts as the OLD MAN walks away, prompting him to head back to the counter. The OLD MAN returns unexpectedly and visibly startles DANTE. Subsequently, DANTE is seen driving in silence with passenger RANDAL, their backs turned to the camera, creating an air of mystery, until DANTE shoots a glare at RANDAL. Outside the store, a MASSIVE CROWD gathers as DANTE and RANDAL make their cautious way up the path to the funeral parlor. Car locks are slammed down in a hurry as DANTE and RANDAL dash from the front door, pursued urgently by a small crowd of angry and disgruntled mourners, and the car speeds away with noticeable urgency. The pursuing crowd stands defiantly in the middle of the street, shaking their fists and hurling objects as the car pulls up quickly, and RANDAL and DANTE step out where absolutely no one is present. JAY enters the frame beside RANDAL without warning, aiming his butt at him and letting out a loud, obnoxious fart, prompting DANTE to grab RANDAL and RANDAL to lunge at him. A KID tugs at JAY'S shirt before they all head back toward the counter, with DANTE walking away, shaking his head in disbelief at the situation. DANTE busies himself methodically putting up cigarettes as the CUSTOMER lets the situation sink in and leaves in a huff, while another CUSTOMER leans in, only for RANDAL to spit a mist of water at him, drenching him completely. The man reacts violently, attempting to grab RANDAL from over the counter, but DANTE steps in to block any escalation, while RANDAL remains unmoved and untouched, saluting the CUSTOMER as he departs, wiping water from his face. RANDAL exits as DANTE attends to a customer (TRAINER), lifting a gallon of milk into a paper bag with a slight grunt, while a female customer (HEATHER) leans casually in the doorway. A SUITED MAN, carrying a notebook, approaches the counter with intent, scribbles something quickly in his notebook, tears out a piece of paper, and hands it to DANTE before making his exit, with DANTE trying, albeit unsuccessfully, to follow him."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "DANTE stands in the center of the court, firmly holding a ball, while REDDING stretches his muscles, leaning casually against a nearby sign. DANTE then makes a quick, controlled skid to the sidelines, pauses momentarily, and skates back to his original position before skidding once more to the sidelines to address the CUSTOMER. Meanwhile, below, a WOMAN approaches the store door, pulls at it with determination, and presses her face against the glass to peer inside. She then steps back, shielding her eyes with her hand as she looks up toward the roof. A new face-off begins, pitting DANTE against the CUSTOMER, who winds up with energy and takes a hard, forceful shot. The ball soars off the court, cutting through the air, and lands in a distant yard, dropping between the two as DANTE is knocked flat. Quickly recovering, DANTE scrambles to the edge of the court, calls out, and looks around, breathing heavily, before calling to the sidelines as SANFORD skates up to him. DANTE then skates away and is later seen standing on a ladder, carefully replacing a fluorescent light. An OLD MAN joins him at the foot of the ladder, observing. With the light securely in place, DANTE descends the ladder, closes it with a swift motion, and glances over, reacting as the OLD MAN walks away. DANTE then heads back to the counter. The OLD MAN returns unexpectedly, visibly surprising DANTE. Later, DANTE is seen driving in silence with passenger RANDAL, their backs to the camera, until DANTE turns to glare at RANDAL. Outside the store, a MASSIVE CROWD gathers as DANTE and RANDAL walk up the path to the funeral parlor. Suddenly, car locks are slammed down as DANTE and RANDAL sprint from the front door, pursued by a small crowd of angry mourners, and the car speeds away. The pursuing crowd stands in the street, shaking their fists and throwing objects as the car pulls up, and RANDAL and DANTE exit to find the area deserted. JAY enters the frame next to RANDAL, mischievously aims his butt at him, and farts, prompting DANTE to grab RANDAL, who lunges at him in response. A KID tugs at JAY'S shirt, and they head back to the counter, with DANTE walking away, shaking his head in disbelief. DANTE then puts up cigarettes as the CUSTOMER processes the situation and leaves in a huff. Another CUSTOMER leans in, and RANDAL spits a mist of water at him, drenching him. The man reacts violently, attempting to grab RANDAL over the counter, but DANTE intervenes, blocking him, while RANDAL remains untouched, saluting the CUSTOMER as he leaves, wiping water from his face. RANDAL exits as DANTE attends to a customer, TRAINER, lifting a gallon of milk into a paper bag with a slight grunt. A female customer, HEATHER, leans in the doorway. A SUITED MAN approaches the counter, scribbles in his notebook, tears out a piece of paper, and hands it to DANTE before exiting, with DANTE attempting to follow."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "DANTE holds a ball at the court's center while REDDING stretches nearby. DANTE skates to the sidelines, addresses a CUSTOMER, and then returns to the court. Below, a WOMAN peers into a store, backs up, and shields her eyes to look at the roof. A face-off between DANTE and the CUSTOMER results in the ball flying off the court and DANTE getting flattened. He scrambles to the edge, calls out, and SANFORD skates up to him. Later, DANTE is on a ladder replacing a fluorescent light, joined by an OLD MAN at the base. After finishing, DANTE descends, closes the ladder, and reacts as the OLD MAN walks off, then returns to the counter. The OLD MAN's return surprises DANTE. DANTE and passenger RANDAL drive in silence until DANTE glares at RANDAL. A MASSIVE CROWD gathers outside a store as DANTE and RANDAL approach a funeral parlor. They run from angry mourners, slam car locks, and drive away as the crowd shakes fists and throws things. The car stops where no one is outside, and JAY enters, farts at RANDAL, prompting DANTE to grab RANDAL. A KID tugs JAY's shirt, and they return to the counter as DANTE shakes his head. DANTE puts up cigarettes, and a CUSTOMER leaves angrily. Another CUSTOMER leans in, and RANDAL spits water at him, leading to a violent reaction. DANTE blocks the CUSTOMER, who leaves wiping his face, while RANDAL remains untouched and salutes. RANDAL exits as DANTE assists a customer (TRAINER) with a gallon of milk, and HEATHER leans in the doorway. A SUITED MAN approaches, scribbles in a notebook, hands a paper to DANTE, and exits with DANTE trying to follow."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "DANTE, a regular at the local roller hockey rink known for its competitive neighborhood matches, holds a ball in the center of the court while REDDING stretches, leaning against the sign that details court rules and upcoming events. DANTE skids to the sidelines, a common move to evade opponents, and then skates to his side before skidding back to the sidelines to address the CUSTOMER, a frequent visitor to the rink known for his skillful play. Below, a WOMAN, perhaps a curious first-time patron, pulls at the door of the small, family-owned sporting goods store, peers into the store with her face against the glass, backs up, and shields her eyes while looking toward the roof, hoping to catch a glimpse of a newly installed security camera. A new face-off pits DANTE against the CUSTOMER, who winds up and takes a hard shot, reminiscent of a professional league player's precision. The ball sails off the court, through the air, and into a faraway yard belonging to the local community center, dropping between the two as DANTE gets flattened by an unexpected push. DANTE scrambles to the edge known for its notoriously slippery surface and calls over, looks around hyperventilating, and calls to the sidelines as SANFORD, a seasoned skater with a reputation for speed, skates up to him. DANTE skates off and is later seen standing on a ladder, replacing a fluorescent light, part of his job duties at the recreation center, while an OLD MAN, a retired electrician who volunteers at the center, joins him at the foot of the ladder. With the light in place, DANTE descends the ladder and closes it, glances over, and reacts as the OLD MAN, known for his quirky advice, walks off, and he heads back to the counter. The OLD MAN returns, holding a new tool that visibly takes DANTE aback with its unusual design. DANTE is then seen driving with passenger RANDAL, their backs to the camera, in absolute silence, before DANTE glares at RANDAL, a friend notorious for his mischievous antics. A MASSIVE CROWD is outside the store as DANTE and RANDAL walk up the path to the funeral parlor, a local landmark with a grand, historic façade. Car locks are slammed down as DANTE and RANDAL run from the front door, chased by a small crowd of angry mourners, and the car screams away, leaving a trail of dust in its wake. The pursuing crowd stands in the middle of the street, shaking their fists and throwing things as the car pulls up, and RANDAL and DANTE get out at a desolate parking lot where absolutely nobody is outside. JAY, a prankster known for his inappropriate humor, enters the frame next to RANDAL, aims his butt at him, and farts, prompting DANTE to grab RANDAL, and RANDAL to lunge for him, creating a comical scene. A KID, perhaps JAY's younger brother, tugs at JAY'S shirt before they head back to the counter, and DANTE walks away, shaking his head at the antics. DANTE puts up cigarettes as the CUSTOMER, whose temper is as infamous as his skill, lets it sink in and leaves in a huff, while another CUSTOMER leans in, and RANDAL spits a mist of water at him, drenching him in a signature prank. The man reacts violently, attempting to grab RANDAL from over the counter as DANTE plays block, a defensive move learned from his time on the rink, but RANDAL makes no move and remains untouched, saluting the CUSTOMER as he leaves, wiping water from his face. RANDAL exits as DANTE waits on a customer (TRAINER), a regular known for his perennial bulk purchases, lifting a gallon of milk into a paper bag with a slight grunt, and a female customer (HEATHER), a newcomer curious about the unfolding drama, leans in the doorway. A SUITED MAN, an inspector sent to review the facility's operations, carrying a notebook comes to the counter, scribbles in his notebook, rips out a piece of paper, and hands it to DANTE, a notice that causes concern, before exiting with DANTE trying to follow to address the unexpected review."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "DANTE holds a ball in the center of the court while REDDING stretches leaning against the sign  DANTE skids to the sidelines and then skates to his side before skidding back to the sidelines to address the CUSTOMER  Below a WOMAN pulls at the door peers into the store with her face against the glass backs up and shields her eyes while looking toward the roof  A MASSIVE CROWD is outside the store as DANTE and RANDAL walk up the path to the funeral parlor  Car locks are slammed down as DANTE and RANDAL run from the front door chased by a small crowd of angry mourners and the car screams away  The pursuing crowd stands in the middle of the street shaking their fists and throwing things as the car pulls up and RANDAL and DANTE get out where absolutely nobody is outside  JAY enters the frame next to RANDAL aims his butt at him and farts prompting DANTE to grab RANDAL and RANDAL to lunge for him  A KID tugs at JAY'S shirt before they head back to the counter and DANTE walks away shaking his head  DANTE puts up cigarettes as the CUSTOMER lets it sink in and leaves in a huff while another CUSTOMER leans in and RANDAL spits a mist of water at him drenching him  The man reacts violently attempting to grab RANDAL from over the counter as DANTE plays block but RANDAL makes no move and remains untouched saluting the CUSTOMER as he leaves wiping water from his face  RANDAL exits as DANTE waits on a customer  TRAINER lifting a gallon of milk into a paper bag with a slight grunt and a female customer HEATHER leans in the doorway  A SUITED MAN carrying a notebook comes to the counter  scribbles in his notebook rips out a piece of paper and hands it to DANTE before exiting with DANTE trying to follow A new faceoff pits DANTE against the CUSTOMER who winds up and takes a hard shot  The ball sails off the court through the air and into a faraway yard dropping between the two as DANTE gets flattened  DANTE scrambles to the edge and calls over looks around hyperventilating and calls to the sidelines as SANFORD skates up to him  DANTE skates off and is later seen standing on a ladder replacing a fluorescent light while an OLD MAN joins him at the foot of the ladder  With the light in place DANTE descends the ladder and closes it glances over and reacts as the OLD MAN walks off and he heads back to the counter  The OLD MAN returns visibly taking DANTE aback  DANTE is then seen driving with passenger RANDAL their backs to the camera in absolute silence before DANTE glares at RANDAL  A MASSIVE CROWD is outside the store as DANTE and RANDAL walk up the path to the funeral parlor  Car locks are slammed down as DANTE and RANDAL run from the front door chased by a small crowd of angry mourners and the car screams away  The pursuing crowd stands in the middle of the street shaking their fists and throwing things as the car pulls up and RANDAL and DANTE get out where absolutely nobody is outside  JAY enters the frame next to RANDAL aims his butt at him and farts prompting DANTE to grab RANDAL and RANDAL to lunge for him  A KID tugs at JAY'S shirt before they head back to the counter and DANTE walks away shaking his head  DANTE puts up cigarettes as the CUSTOMER lets it sink in and leaves in a huff while another CUSTOMER leans in and RANDAL spits a mist of water at him drenching him  The man reacts violently attempting to grab RANDAL from over the counter as DANTE plays block but RANDAL makes no move and remains untouched saluting the CUSTOMER as he leaves wiping water from his face  RANDAL exits as DANTE waits on a customer  TRAINER lifting a gallon of milk into a paper bag with a slight grunt and a female customer HEATHER leans in the doorway  A SUITED MAN carrying a notebook comes to the counter  scribbles in his notebook rips out a piece of paper and hands it to DANTE before exiting with DANTE trying to follow"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "DANTE holds a ball in the center of the court while REDDING stretches leaning against the sign. DANTE skids to the sidelines and then skates to his side before skidding back to the sidelines to address the CUSTOMER. Below a WOMAN pulls at the door peers into the store with her face against the glass backs up and shields her eyes while looking toward the roof. A new faceoff pits DANTE against the CUSTOMER who winds up and takes a hard shot. The ball sails off the court through the air and into a faraway yard dropping between the two as DANTE gets flattened. DANTE scrambles to the edge and calls over looks around hyperventilating and calls to the sidelines as SANFORD skates up to him. DANTE skates off and is later seen standing on a ladder replacing a fluorescent light while an OLD MAN joins him at the foot of the ladder. With the light in place DANTE descends the ladder and closes it glances over and reacts as the OLD MAN walks off and he heads back to the counter. The OLD MAN returns visibly taking DANTE aback. DANTE is then seen driving with passenger RANDAL their backs to the camera in absolute silence before DANTE glares at RANDAL. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. A MASSIVE CROWD is outside the store as DANTE and RANDAL walk up the path to the funeral parlor. Car locks are slammed down as DANTE and RANDAL run from the front door chased by a small crowd of angry mourners and the car screams away. The pursuing crowd stands in the middle of the street shaking their fists and throwing things as the car pulls up and RANDAL and DANTE get out where absolutely nobody is outside. JAY enters the frame next to RANDAL aims his butt at him and farts prompting DANTE to grab RANDAL and RANDAL to lunge for him. A KID tugs at JAY'S shirt before they head back to the counter and DANTE walks away shaking his head. DANTE puts up cigarettes as the CUSTOMER let us it sink in and leaves in a huff while another CUSTOMER leans in and RANDAL spits a mist of water at him drenching him. The man reacts violently attempting to grab RANDAL from over the counter as DANTE plays block but RANDAL makes no move and remains untouched saluting the CUSTOMER as he leaves wiping water from his face. RANDAL exits as DANTE waits on a customer. TRAINER lifting a gallon of milk into a paper bag with a slight grunt and a female customer HEATHER leans in the doorway. A SUITED MAN carrying a notebook comes to the counter. scribbles in his notebook rips out a piece of paper and hands it to DANTE before exiting with DANTE trying to follow."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "DANTE holds a ball in the center of the court while REDDING stretches leaning against the sign. DANTE skids to the sidelines and then skates to his side before skidding back to the sidelines to address the CUSTOMER. Below a WOMAN pulls at the door peers into the store with her face against the glass backs up and shields her eyes while looking toward the roof. A new faceoff pits DANTE against the CUSTOMER who winds up and takes a hard shot. The ball sails off the court through the air and into a faraway yard dropping between the two as DANTE gets flattened. DANTE scrambles to the edge and calls over looks around hyperventilating and calls to the sidelines as SANFORD skates up to him. DANTE skates off and is later seen standing on a ladder replacing a fluorescent light while an OLD MAN joins him at the foot of the ladder. With the light in place DANTE descends the ladder and closes it glances over and reacts as the OLD MAN walks off and he heads back to the counter. The OLD MAN returns visibly taking DANTE aback. DANTE is then seen driving with passenger RANDAL their backs to the camera in absolute silence before DANTE glares at RANDAL. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. A MASSIVE CROWD is outside the store as DANTE and RANDAL walk up the path to the funeral parlor. Car locks are slammed down as DANTE and RANDAL run from the front door chased by a small crowd of angry mourners and the car screams away. The pursuing crowd stands in the middle of the street shaking their fists and throwing things as the car pulls up and RANDAL and DANTE get out where absolutely nobody is outside. JAY enters the frame next to RANDAL aims his butt at him and farts prompting DANTE to grab RANDAL and RANDAL to lunge for him. A KID tugs at JAY'S shirt before they head back to the counter and DANTE walks away shaking his head. DANTE puts up cigarettes as the CUSTOMER let us it sink in and leaves in a huff while another CUSTOMER leans in and RANDAL spits a mist of water at him drenching him. The man reacts violently attempting to grab RANDAL from over the counter as DANTE plays block but RANDAL makes no move and remains untouched saluting the CUSTOMER as he leaves wiping water from his face. RANDAL exits as DANTE waits on a customer. TRAINER lifting a gallon of milk into a paper bag with a slight grunt and a female customer HEATHER leans in the doorway. A SUITED MAN carrying a notebook comes to the counter. scribbles in his notebook rips out a piece of paper and hands it to DANTE before exiting with DANTE trying to follow."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "DANTE holds a ball in the center of the court while REDDING stretches leaning against the sign. DANTE skids to the sidelines and then skates to his side before skidding back to the sidelines to address the CUSTOMER. Below a WOMAN pulls at the door peers into the store with her face against the glass backs up and shields her eyes while looking toward the roof. A new faceoff pits DANTE against the CUSTOMER who winds up and takes a hard shot. The ball sails off the court through the air and into a faraway yard dropping between the two as DANTE gets flattened. DANTE puts up cigarettes as the CUSTOMER let us it sink in and leaves in a huff while another CUSTOMER leans in and RANDAL spits a mist of water at him drenching him. The man reacts violently attempting to grab RANDAL from over the counter as DANTE plays block but RANDAL makes no move and remains untouched saluting the CUSTOMER as he leaves wiping water from his face. RANDAL exits as DANTE waits on a customer. TRAINER lifting a gallon of milk into a paper bag with a slight grunt and a female customer HEATHER leans in the doorway. A SUITED MAN carrying a notebook comes to the counter. scribbles in his notebook rips out a piece of paper and hands it to DANTE before exiting with DANTE trying to follow."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "DANTE holds a ball in the center of the court while REDDING stretches leaning against the sign. DANTE skids to the sidelines and then skates to his side before skidding back to the sidelines to address the CUSTOMER. TRAINER lifting a gallon of milk into a paper bag with a slight grunt and a female customer HEATHER leans in the doorway. A SUITED MAN carrying a notebook comes to the counter. scribbles in his notebook rips out a piece of paper and hands it to DANTE before exiting with DANTE trying to follow."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "JASPER holds a ball in the center of the court while ALEX stretches, leaning against the sign. JASPER skids to the sidelines and then skates to his side before skidding back to the sidelines to address the PATRON. Below, a CHILD pulls at the door, peers into the store with her face against the glass, backs up, and shields her eyes while looking toward the roof. A new face-off pits JASPER against the PATRON, who winds up and takes a hard shot. The ball sails off the court, through the air, and into a faraway yard, dropping between the two as JASPER gets flattened. JASPER scrambles to the edge and calls over, looks around hyperventilating, and calls to the sidelines as MORGAN skates up to him. JASPER skates off and is later seen standing on a ladder, replacing a fluorescent light while an ELDERLY WOMAN joins him at the foot of the ladder. With the light in place, JASPER descends the ladder and closes it, glances over and reacts as the ELDERLY WOMAN walks off, and he heads back to the counter. The ELDERLY WOMAN returns, visibly taking JASPER aback. JASPER is then seen driving with passenger ELLIOT, their backs to the camera, in absolute silence, before JASPER glares at ELLIOT. A BIG CROWD is outside the store as JASPER and ELLIOT walk up the path to the funeral parlor. Car locks are slammed down as JASPER and ELLIOT run from the front door, chased by a small crowd of angry mourners, and the car screams away. The pursuing crowd stands in the middle of the street, shaking their fists and throwing things as the car pulls up, and ELLIOT and JASPER get out where absolutely nobody is outside. TOM enters the frame next to ELLIOT, aims his butt at him, and farts, prompting JASPER to grab ELLIOT, and ELLIOT to lunge for him. A TEENAGER tugs at TOM'S shirt before they head back to the counter, and JASPER walks away, shaking his head. JASPER puts up cigarettes as the PATRON lets it sink in and leaves in a huff, while another PATRON leans in, and ELLIOT spits a mist of water at him, drenching him. The man reacts violently, attempting to grab ELLIOT from over the counter as JASPER plays block, but ELLIOT makes no move and remains untouched, saluting the PATRON as he leaves, wiping water from his face. ELLIOT exits as JASPER waits on a customer (COACH), lifting a gallon of milk into a paper bag with a slight grunt, and a female customer (SOPHIE) leans in the doorway. A BUSINESSWOMAN carrying a notebook comes to the counter, scribbles in her notebook, rips out a piece of paper, and hands it to JASPER before exiting with JASPER trying to follow."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "DANTE holds a frisbee in the center of the field while REDDING stretches, leaning against the lamppost. DANTE skids to the bleachers and then skates to his side before skidding back to the bleachers to address the VISITOR. Below, a WOMAN pulls at the gate, peers into the garage with her face against the metal, backs up, and shields her eyes while looking toward the tower. A new challenge pits DANTE against the VISITOR, who winds up and takes a hard kick. The frisbee sails off the field, through the sky, and into a distant garden, dropping between the two as DANTE gets toppled. DANTE scrambles to the border and calls over, looks around hyperventilating, and calls to the bleachers as SANFORD skates up to him. DANTE skates off and is later seen standing on a crate, replacing a decorative bulb while an OLD MAN joins him at the base of the crate. With the bulb in place, DANTE descends the crate and folds it, glances over and reacts as the OLD MAN walks off, and he heads back to the display. The OLD MAN returns, visibly taking DANTE aback. DANTE is then seen driving with passenger RANDAL, their backs to the camera, in complete silence, before DANTE glares at RANDAL. A GIANT CROWD is outside the garage as DANTE and RANDAL walk up the path to the library. Cabinet locks are slammed down as DANTE and RANDAL run from the main entrance, chased by a small crowd of angry librarians, and the car screams away. The pursuing crowd stands in the middle of the avenue, shaking their bags and throwing things as the car pulls up, and RANDAL and DANTE get out where absolutely nobody is outside. JAY enters the frame next to RANDAL, aims his elbow at him, and laughs, prompting DANTE to grab RANDAL, and RANDAL to lunge for him. A CHILD tugs at JAY'S sleeve before they head back to the display, and DANTE walks away, shaking his head. DANTE puts up magazines as the VISITOR lets it sink in and leaves in a huff, while another VISITOR leans in, and RANDAL spits a mist of juice at him, drenching him. The man reacts violently, attempting to grab RANDAL from over the display as DANTE plays block, but RANDAL makes no move and remains untouched, saluting the VISITOR as he leaves, wiping juice from his face. RANDAL exits as DANTE waits on a customer (COACH), lifting a sack of rice into a plastic bag with a slight grunt, and a female customer (HEATHER) leans in the archway. A FORMAL MAN carrying a clipboard comes to the display, scribbles in his clipboard, rips out a piece of paper, and hands it to DANTE before exiting with DANTE trying to follow."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "DANTE juggles a ball in the center of the court while REDDING yawns, balancing against the sign. DANTE slides to the sidelines and then rolls to his side before tumbling back to the sidelines to wave at the CUSTOMER. Below, a WOMAN taps at the door, glances into the store with her face near the glass, steps forward, and shades her eyes while gazing toward the roof. A new contest pairs DANTE with the CUSTOMER, who winds up and skips a hard shot. The ball floats off the court, through the air, and into a distant yard, dropping between the two as DANTE gets startled. DANTE crawls to the edge and calls over, looks around whistling, and signals to the sidelines as SANFORD glides up to him. DANTE drifts off and is later seen standing on a ladder, painting a fluorescent light while an OLD MAN watches him at the foot of the ladder. With the light in place, DANTE climbs down the ladder and dismantles it, glances over and jumps as the OLD MAN wanders off, and he strolls back to the counter. The OLD MAN returns, visibly surprising DANTE. DANTE is then seen steering with passenger RANDAL, their backs to the camera, in absolute silence, before DANTE stares at RANDAL. A MASSIVE CROWD is outside the store as DANTE and RANDAL stroll up the path to the funeral parlor. Car doors are slammed shut as DANTE and RANDAL dash from the front door, pursued by a small crowd of angry mourners, and the car speeds away. The pursuing crowd stands in the middle of the street, waving their fists and tossing things as the car pulls up, and RANDAL and DANTE get out where absolutely nobody is outside. JAY enters the frame next to RANDAL, points his fingers at him, and laughs, prompting DANTE to nudge RANDAL, and RANDAL to pivot toward him. A KID tugs at JAY'S shirt before they skip back to the counter, and DANTE wanders away, shaking his head. DANTE stacks up cigarettes as the CUSTOMER lets it sink in and stomps away, while another CUSTOMER leans in, and RANDAL spits a mist of water at him, soaking him. The man reacts violently, reaching to grab RANDAL from over the counter as DANTE steps aside, but RANDAL makes no move and remains untouched, saluting the CUSTOMER as he leaves, wiping water from his face. RANDAL exits as DANTE chats with a customer (TRAINER), sliding a gallon of milk into a paper bag with a slight sigh, and a female customer (HEATHER) leans in the doorway. A SUITED MAN clutching a notebook approaches the counter, doodles in his notebook, tears out a piece of paper, and hands it to DANTE before slipping away with DANTE trying to follow."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "JASPER holds an apple in the center of the fountain while LUCAS stretches, leaning against the billboard. JASPER skids to the lakeside and then skates to his tree before skidding back to the lakeside to address the PHOTOGRAPHER. Below, a TIGER pulls at the gate, peers into the aquarium with her paws against the glass, backs up, and shields her eyes while looking toward the sky. A new face-off pits JASPER against the PHOTOGRAPHER, who winds up and takes a hard shot. The apple sails off the fountain, through the air, and into a faraway jungle, dropping between the two as JASPER gets flattened. JASPER scrambles to the cliff and calls over, looks around hyperventilating, and calls to the lakeside as HAROLD skates up to him. JASPER skates off and is later seen standing on a chair, replacing a chandelier while a YOUNG WOMAN joins him at the foot of the chair. With the chandelier in place, JASPER descends the chair and closes it, glances over and reacts as the YOUNG WOMAN walks off, and he heads back to the cradle. The YOUNG WOMAN returns, visibly taking JASPER aback. JASPER is then seen driving with passenger WILBUR, their backs to the camera, in absolute silence, before JASPER glares at WILBUR. A MASSIVE HERD is outside the aquarium as JASPER and WILBUR walk up the alley to the theater. Bridge gates are slammed down as JASPER and WILBUR run from the first window, chased by a small herd of angry tourists, and the taxi screams away. The pursuing herd stands in the middle of the garden, shaking their umbrellas and throwing items as the taxi pulls up, and WILBUR and JASPER get out where absolutely nobody is outside. SAM enters the frame next to WILBUR, aims his elbow at him, and sneezes, prompting JASPER to grab WILBUR, and WILBUR to lunge for him. A DOLPHIN tugs at SAM'S scarf before they head back to the cradle, and JASPER walks away, shaking his head. JASPER puts up postcards as the PHOTOGRAPHER lets it sink in and leaves in a huff, while another PHOTOGRAPHER leans in, and WILBUR spits a mist of paint at him, drenching him. The bear reacts violently, attempting to grab WILBUR from over the cradle as JASPER plays block, but WILBUR makes no move and remains untouched, saluting the PHOTOGRAPHER as he leaves, wiping paint from his face. WILBUR exits as JASPER waits on a customer (SHEPHERD), lifting a gallon of honey into a velvet sack with a slight grunt, and a female customer (IVY) leans in the archway. A HIKER carrying a sketchpad comes to the cradle, scribbles in his sketchpad, rips out a piece of parchment, and hands it to JASPER before exiting with JASPER trying to follow."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "FINN juggles a frisbee in the center of the rink while TAYLOR yawns, resting against the display. FINN trots to the perimeter and then cycles to his corner before trotting back to the perimeter to consult the VISITOR. Below, a DOG scratches at the gate, glances into the shop with its nose against the pane, trots back, and covers its nose while looking toward the chimney. A new showdown pits FINN against the VISITOR, who jumps up and makes a soft lob. The frisbee glides off the rink, through the breeze, and into a distant garden, landing between the two as FINN gets toppled. FINN darts to the boundary and waves over, scans the area panting, and calls to the perimeter as MORGAN cycles up to him. FINN cycles off and is later spotted standing on a crate, installing a poster while a YOUNG GIRL joins him at the base of the crate. With the poster secure, FINN descends the crate and folds it, glances over and reacts as the YOUNG GIRL ambles off, and he heads back to the register. The YOUNG GIRL returns, visibly startling FINN. FINN is then seen cycling with rider JORDAN, their backs to the camera, in complete silence, before FINN glances at JORDAN. A HUGE GATHERING is outside the shop as FINN and JORDAN stroll up the path to the art gallery. Car doors are slammed down as FINN and JORDAN dash from the entrance, pursued by a small group of irate artists, and the bicycle bolts away. The pursuing group stands in the middle of the road, waving their arms and tossing items as the bicycle pulls up, and JORDAN and FINN dismount where absolutely nobody is around. BEN enters the shot next to JORDAN, points his elbow at him, and sneezes, prompting FINN to nudge JORDAN, and JORDAN to hop toward him. A CHILD nudges BEN'S jacket before they head back to the register, and FINN strolls away, shaking his head. FINN sets up snacks as the VISITOR lets it sink in and departs in exasperation, while another VISITOR leans in, and JORDAN sprays a mist of juice at him, soaking him. The man responds aggressively, attempting to seize JORDAN from over the register as FINN plays guardian, but JORDAN stays put and remains unharmed, waving off the VISITOR as he departs, wiping juice from his face. JORDAN exits as FINN assists on a guest (COACH), raising a bottle of soda into a plastic bag with a slight heave, and a female guest (SOPHIE) leans in the entrance. A BUSINESSWOMAN clutching a clipboard approaches the register, doodles in her clipboard, tears out a sheet of paper, and hands it to FINN before departing with FINN trying to trail."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "DANTE cradles a frisbee in the center of the park while REDDING hops, leaning against the tree. DANTE slides to the pavement and then glides to his corner before sliding back to the pavement to wave at the CUSTOMER. Below, a WOMAN taps on the window, squints into the shop with her nose against the pane, steps back, and holds her ear while gazing toward the chimney. A fresh challenge pits DANTE against the CUSTOMER, who winds up and takes a fast throw. The frisbee spirals off the park, through the sky, and into a distant garden, landing between the two as DANTE gets sprawled. DANTE crawls to the boundary and shouts over, scans the horizon breathing heavily, and beckons to the pavement as SANFORD glides up to him. DANTE glides away and is later seen standing on a stool, adjusting a ceiling fan while an OLD MAN joins him at the base of the stool. With the fan adjusted, DANTE descends the stool and folds it, glances over and winces as the OLD MAN shuffles off, and he heads back to the shelf. The OLD MAN reappears, visibly startling DANTE. DANTE is then seen strolling with passenger RANDAL, their backs to the camera, in absolute calm, before DANTE scowls at RANDAL. A MASSIVE GROUP is outside the shop as DANTE and RANDAL wander up the lane to the museum. Window blinds are pulled down as DANTE and RANDAL dash from the back door, pursued by a small group of irate visitors, and the van roars away. The pursuing group stands in the middle of the road, waving their arms and tossing things as the van pulls up, and RANDAL and DANTE disembark where absolutely nobody is present. JAY enters the scene next to RANDAL, shakes his foot at him, and groans, prompting DANTE to nudge RANDAL, and RANDAL to stumble for him. A KID yanks at JAY'S backpack before they head back to the shelf, and DANTE strides away, chuckling. DANTE arranges candy as the CUSTOMER lets it roll in and storms off, while another CUSTOMER leans in, and RANDAL sprays a mist of juice at him, soaking him. The man reacts furiously, attempting to reach for RANDAL from over the shelf as DANTE acts as a shield, but RANDAL stays put and remains untouched, waving at the CUSTOMER as he departs, wiping juice from his face. RANDAL exits as DANTE waits on a customer (TRAINER), placing a loaf of bread into a plastic bag with a slight chuckle, and a female customer (HEATHER) leans in the doorway. A SUITED MAN carrying a briefcase comes to the shelf, scribbles in his briefcase, tears out a piece of paper, and hands it to DANTE before leaving with DANTE trying to catch up."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "BRUNO juggles a shoe in the middle of the meadow while MERRICK naps, leaning against the monument. BRUNO crawls to the hedges and then jumps to his van before crawling back to the hedges to confront the PERFORMER. Nearby, a CAT pushes at the curtain, peers into the theater with its paw against the railing, steps back, and covers its ears while glancing toward the tower. A new showdown pits BRUNO against the PERFORMER, who lines up and throws a fierce pitch. The shoe glides off the meadow, through the trees, and into a distant garage, landing between the two as BRUNO gets trampled. BRUNO rushes to the corner and shouts over, scans the area while gasping, and yells to the hedges as DAWSON jumps up to him. BRUNO jumps off and is later seen hanging on a pole, painting a mural while a YOUNG GIRL joins him at the base of the pole. With the mural finished, BRUNO climbs down the pole and folds it, glances over and reacts as the YOUNG GIRL skips off, and he heads back to the fireplace. The YOUNG GIRL returns, visibly surprising BRUNO. BRUNO is then seen sailing with sailor VINCE, their backs to the lens, in complete quiet, before BRUNO glowers at VINCE. A GIANT HERD is outside the theater as BRUNO and VINCE stroll along the trail to the bakery. Window shades are yanked up as BRUNO and VINCE flee from the gate, chased by a tiny herd of furious bakers, and the ship roars away. The chasing herd gathers in the center of the town, waving their hats and tossing items as the ship docks, and VINCE and BRUNO disembark where absolutely nobody loiters offshore. BEN moves into the scene beside VINCE, aims his elbow at him, and sneezes, prompting BRUNO to grab VINCE, and VINCE to tackle him. A CHILD yanks at BEN'S coat before they move back to the fireplace, and BRUNO strolls away, shaking his hand. BRUNO sets down books as the PERFORMER lets it gel and exits in a rage, while another PERFORMER leans forward, and VINCE sprays a burst of air at him, soaking him. The person responds aggressively, attempting to seize VINCE from over the fireplace as BRUNO plays guard, but VINCE remains still and unscathed, waving at the PERFORMER as he exits, dabbing moisture off his cheek. VINCE departs as BRUNO assists a visitor (COACH), hoisting a crate of apples into a woven basket with a slight sigh, and a female visitor (CASSANDRA) peeks in the archway. A BUSINESSWOMAN holding a clipboard approaches the fireplace, doodles in her clipboard, tears out a sheet of paper, and hands it to BRUNO before leaving with BRUNO trying to trail behind."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "DANTE holds a ball at the court's center while REDDING stretches nearby. DANTE skates around before confronting a CUSTOMER, who takes a shot that sends the ball flying into a distant yard. DANTE scrambles to retrieve it, aided by SANFORD. Later, DANTE replaces a light with an OLD MAN's help. He reacts when the OLD MAN leaves and then unexpectedly returns. DANTE drives with RANDAL, sharing a tense silence. They face an angry crowd after a mishap at a funeral parlor, escaping in their car as mourners chase them. Back at the store, JAY pranks RANDAL, prompting a scuffle. DANTE resumes work, dealing with frustrated CUSTOMERS. RANDAL spits water at one, provoking a reaction, but avoids conflict as the customer leaves. Meanwhile, DANTE assists another customer, TRAINER, and a suited man hands him a note, leaving DANTE to follow."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "scribbles in his notebook rips out a piece of paper and hands it to DANTE before exiting with DANTE trying to follow A SUITED MAN carrying a notebook comes to the counter  TRAINER lifting a gallon of milk into a paper bag with a slight grunt and a female customer HEATHER leans in the doorway  RANDAL exits as DANTE waits on a customer  The man reacts violently attempting to grab RANDAL from over the counter as DANTE plays block but RANDAL makes no move and remains untouched saluting the CUSTOMER as he leaves wiping water from his face  DANTE puts up cigarettes as the CUSTOMER lets it sink in and leaves in a huff while another CUSTOMER leans in and RANDAL spits a mist of water at him drenching him  A KID tugs at JAY'S shirt before they head back to the counter and DANTE walks away shaking his head  JAY enters the frame next to RANDAL aims his butt at him and farts prompting DANTE to grab RANDAL and RANDAL to lunge for him  The pursuing crowd stands in the middle of the street shaking their fists and throwing things as the car pulls up and RANDAL and DANTE get out where absolutely nobody is outside  Car locks are slammed down as DANTE and RANDAL run from the front door chased by a small crowd of angry mourners and the car screams away  A MASSIVE CROWD is outside the store as DANTE and RANDAL walk up the path to the funeral parlor  DANTE is then seen driving with passenger RANDAL their backs to the camera in absolute silence before DANTE glares at RANDAL  The OLD MAN returns visibly taking DANTE aback  With the light in place DANTE descends the ladder and closes it glances over and reacts as the OLD MAN walks off and he heads back to the counter  DANTE skates off and is later seen standing on a ladder replacing a fluorescent light while an OLD MAN joins him at the foot of the ladder  DANTE scrambles to the edge and calls over looks around hyperventilating and calls to the sidelines as SANFORD skates up to him  The ball sails off the court through the air and into a faraway yard dropping between the two as DANTE gets flattened  A new faceoff pits DANTE against the CUSTOMER who winds up and takes a hard shot  Below a WOMAN pulls at the door peers into the store with her face against the glass backs up and shields her eyes while looking toward the roof  DANTE skids to the sidelines and then skates to his side before skidding back to the sidelines to address the CUSTOMER  DANTE holds a ball in the center of the court while REDDING stretches leaning against the sign "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The man reacts violently attempting to grab RANDAL from over the counter as DANTE plays block but RANDAL makes no move and remains untouched saluting the CUSTOMER as he leaves wiping water from his face  The OLD MAN returns visibly taking DANTE aback  A new faceoff pits DANTE against the CUSTOMER who winds up and takes a hard shot  Car locks are slammed down as DANTE and RANDAL run from the front door chased by a small crowd of angry mourners and the car screams away  A MASSIVE CROWD is outside the store as DANTE and RANDAL walk up the path to the funeral parlor  DANTE puts up cigarettes as the CUSTOMER lets it sink in and leaves in a huff while another CUSTOMER leans in and RANDAL spits a mist of water at him drenching him  DANTE skids to the sidelines and then skates to his side before skidding back to the sidelines to address the CUSTOMER  TRAINER lifting a gallon of milk into a paper bag with a slight grunt and a female customer HEATHER leans in the doorway  DANTE scrambles to the edge and calls over looks around hyperventilating and calls to the sidelines as SANFORD skates up to him  A SUITED MAN carrying a notebook comes to the counter  Below a WOMAN pulls at the door peers into the store with her face against the glass backs up and shields her eyes while looking toward the roof  DANTE holds a ball in the center of the court while REDDING stretches leaning against the sign  The pursuing crowd stands in the middle of the street shaking their fists and throwing things as the car pulls up and RANDAL and DANTE get out where absolutely nobody is outside  The ball sails off the court through the air and into a faraway yard dropping between the two as DANTE gets flattened  DANTE is then seen driving with passenger RANDAL their backs to the camera in absolute silence before DANTE glares at RANDAL  A KID tugs at JAY'S shirt before they head back to the counter and DANTE walks away shaking his head  With the light in place DANTE descends the ladder and closes it glances over and reacts as the OLD MAN walks off and he heads back to the counter  JAY enters the frame next to RANDAL aims his butt at him and farts prompting DANTE to grab RANDAL and RANDAL to lunge for him  scribbles in his notebook rips out a piece of paper and hands it to DANTE before exiting with DANTE trying to follow DANTE skates off and is later seen standing on a ladder replacing a fluorescent light while an OLD MAN joins him at the foot of the ladder  RANDAL exits as DANTE waits on a customer "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Car locks are slammed down as DANTE and RANDAL run from the front door chased by a small crowd of angry mourners and the car screams away  The pursuing crowd stands in the middle of the street shaking their fists and throwing things as the car pulls up and RANDAL and DANTE get out where absolutely nobody is outside  JAY enters the frame next to RANDAL aims his butt at him and farts prompting DANTE to grab RANDAL and RANDAL to lunge for him  A KID tugs at JAY'S shirt before they head back to the counter and DANTE walks away shaking his head  DANTE puts up cigarettes as the CUSTOMER lets it sink in and leaves in a huff while another CUSTOMER leans in and RANDAL spits a mist of water at him drenching him  The man reacts violently attempting to grab RANDAL from over the counter as DANTE plays block but RANDAL makes no move and remains untouched saluting the CUSTOMER as he leaves wiping water from his face  RANDAL exits as DANTE waits on a customer  TRAINER lifting a gallon of milk into a paper bag with a slight grunt and a female customer HEATHER leans in the doorway  A SUITED MAN carrying a notebook comes to the counter  scribbles in his notebook rips out a piece of paper and hands it to DANTE before exiting with DANTE trying to follow DANTE holds a ball in the center of the court while REDDING stretches leaning against the sign  DANTE skids to the sidelines and then skates to his side before skidding back to the sidelines to address the CUSTOMER  Below a WOMAN pulls at the door peers into the store with her face against the glass backs up and shields her eyes while looking toward the roof  A new faceoff pits DANTE against the CUSTOMER who winds up and takes a hard shot  The ball sails off the court through the air and into a faraway yard dropping between the two as DANTE gets flattened  DANTE scrambles to the edge and calls over looks around hyperventilating and calls to the sidelines as SANFORD skates up to him  DANTE skates off and is later seen standing on a ladder replacing a fluorescent light while an OLD MAN joins him at the foot of the ladder  With the light in place DANTE descends the ladder and closes it glances over and reacts as the OLD MAN walks off and he heads back to the counter  The OLD MAN returns visibly taking DANTE aback  DANTE is then seen driving with passenger RANDAL their backs to the camera in absolute silence before DANTE glares at RANDAL  A MASSIVE CROWD is outside the store as DANTE and RANDAL walk up the path to the funeral parlor "
        }
      ]
    }
  ]
}