{
  "ground_truth": "Snoop Dog glides into a room where the remains of a wooden bed lie collapsed on the floor. Another eel swims past a porcelain bathtub as Snoop Dog pivots toward a broken door lying in the silt. The bearded man grasps the two joysticks as Snoop Dog extends a pair of mechanical claws to move the door aside, uncovering a square object. The brown-haired man squints as he studies a video monitor, and the silt settles to reveal an unopened safe. On the ocean surface, a research vessel outfitted with cranes plucks the submersibles out of the water, and men cheer as a winch raises a net holding the safe to the surface. Lewis uncorks a bottle of champagne and sprays everyone while a crewman opens the safe with a cutting wheel. A man pulls off the door, unleashing a flood of muddy water. As a cameraman films him, Brock kneels and pulls out wads of sodden papers, removes a muddy ledger, and tosses it aside before emptying the safe, scowling as he stands. Later, Brock takes a phone call while nearby lab techs clean the muddy papers, revealing a sketch of a woman reclining on a settee, wearing a large pendant around her neck. Brock studies a photograph of a pendant necklace with a heart-shaped gem, the same necklace the woman in the drawing is wearing. Elsewhere, in a home, a young, long-haired woman walks past a small dog as she carries teacups to a table, and in an adjoining sunroom, a white-haired woman uses a pottery wheel. Leaning on a cane, the older woman steps toward a small television set in a nearby kitchen. Brock stands on the research area using a satellite phone. Holding the small white dog on her lap, Rose and the young woman ride inside a helicopter as it flies out to the research ship, where Brock and Lewis move to a railing as the helicopter approaches. They move towards the landing pad as the helicopter touches down, and a crewman unloads several suitcases and a large trunk. Rose shakes Brock's hand, and the long-haired woman smiles and pushes Rose away in a wheelchair. A man aboard the helicopter hands a fishbowl to Brock. Later, Rose sets framed photographs beside the fishbowl. In the lab, Rose peers down at the clean sketch resting in a container of clear liquid, then closes her eyes. A blonde man with a few stray locks over his eyes sketches the drawing. Rose smiles as she picks up the silver hand mirror, turns the mirror in her hands, catching her own reflection in the cracked glass, sets down the mirror, and examines other objects. She picks up a silver and glass hair comb adorned with an ornamental insect with outstretched wings.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Snoop Dog drifts into a chamber where the remnants of a timber bed rest collapsed on the ground. Another eel swims by a ceramic bathtub as Snoop Dog rotates toward a shattered entrance lying in the silt. The bearded gentleman grips the two joysticks as Snoop Dog extends a pair of mechanical pincers to shift the entrance aside, revealing a cubic item. The brunette man narrows his eyes as he examines a video display, and the silt settles to disclose an unopened vault. On the ocean surface, a research ship equipped with cranes lifts the submersibles out of the water, and men cheer as a hoist raises a mesh holding the vault to the surface. Lewis uncorks a bottle of champagne and sprays everyone while a crewman opens the vault with a cutting wheel. A man removes the entrance, releasing a deluge of murky water. As a cameraman records him, Brock crouches and pulls out bundles of soaked documents, removes a muddy register, and tosses it aside before emptying the vault, frowning as he stands. Later, Brock takes a phone call while nearby lab technicians clean the muddy documents, revealing a sketch of a woman reclining on a settee, wearing a large pendant around her neck. Brock examines a photograph of a pendant necklace with a heart-shaped gem, the same necklace the woman in the drawing is wearing. Elsewhere, in a home, a young, long-haired woman walks by a small dog as she carries teacups to a table, and in an adjacent sunroom, a white-haired woman uses a pottery wheel. Leaning on a cane, the older woman steps toward a small television set in a nearby kitchen. Brock stands on the research area using a satellite phone. Holding the small white dog on her lap, Rose and the young woman ride inside a helicopter as it flies out to the research vessel, where Brock and Lewis move to a railing as the helicopter approaches. They move towards the landing platform as the helicopter touches down, and a crewman unloads several suitcases and a large trunk. Rose shakes Brock's hand, and the long-haired woman smiles and pushes Rose away in a wheelchair. A man aboard the helicopter hands a fishbowl to Brock. Later, Rose places framed pictures beside the fishbowl. In the lab, Rose peers down at the clean sketch resting in a container of clear liquid, then closes her eyes. A fair-haired man with a few stray locks over his eyes sketches the drawing. Rose smiles as she picks up the silver hand mirror, turns the mirror in her hands, catching her own reflection in the cracked glass, sets down the mirror, and examines other items. She picks up a silver and glass hair comb adorned with an ornamental insect with outstretched wings."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Snoop Dog glides into a room where a wooden bed's remains are collapsed on the floor. A porcelain bathtub is swum past by another eel as a broken door is pivoted toward by Snoop Dog lying in the silt. The two joysticks are grasped by the bearded man as a pair of mechanical claws are extended by Snoop Dog to move the door aside, a square object being uncovered. The brown-haired man squints as a video monitor is studied by him, and an unopened safe is revealed by the settling silt. On the ocean surface, cranes outfitted on a research vessel pluck the submersibles out of the water, and men cheer as a net holding the safe is raised to the surface by a winch. A bottle of champagne is uncorked by Lewis, and everyone is sprayed while a crewman uses a cutting wheel to open the safe. The door is pulled off by a man, unleashing a flood of muddy water. As a cameraman films, Brock kneels and pulls out wads of sodden papers, removes a muddy ledger, and tosses it aside before the safe is emptied by him, scowling as he stands. Later, Brock takes a phone call while nearby lab techs clean the muddy papers, revealing a sketch of a woman reclining on a settee, wearing a large pendant around her neck. A photograph of a pendant necklace with a heart-shaped gem is studied by Brock, the same necklace the woman in the drawing is wearing. Elsewhere, in a home, a small dog is walked past by a young, long-haired woman as teacups are carried to a table by her, and in an adjoining sunroom, a pottery wheel is used by a white-haired woman. Leaning on a cane, the older woman steps toward a small television set in a nearby kitchen. The research area is stood on by Brock using a satellite phone. Holding the small white dog on her lap, Rose and the young woman ride inside a helicopter as it flies out to the research ship, where Brock and Lewis move to a railing as the helicopter approaches. They move towards the landing pad as the helicopter touches down, and several suitcases and a large trunk are unloaded by a crewman. Brock's hand is shaken by Rose, and the long-haired woman smiles and pushes Rose away in a wheelchair. A fishbowl is handed to Brock by a man aboard the helicopter. Later, framed photographs are set beside the fishbowl by Rose. In the lab, down is peered by Rose at the clean sketch resting in a container of clear liquid, then she closes her eyes. The drawing is sketched by a blonde man with a few stray locks over his eyes. Rose smiles as she picks up the silver hand mirror, turns the mirror in her hands, catching her own reflection in the cracked glass, sets down the mirror, and examines other objects. A silver and glass hair comb is picked up by her, adorned with an ornamental insect with outstretched wings."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Snoop Dog enters a room with a collapsed wooden bed on the floor. An eel swims by a porcelain bathtub as Snoop Dog turns to a broken door in the silt. The bearded man controls joysticks while Snoop Dog uses mechanical claws to move the door, revealing a square object. The brown-haired man squints at a video monitor, revealing an unopened safe. On the ocean, a research vessel uses cranes to lift submersibles, and men cheer as a net raises the safe. Lewis sprays champagne while a crewman opens the safe with a cutting wheel. A man removes the door, unleashing muddy water. Filmed by a cameraman, Brock kneels, retrieves sodden papers, discards a muddy ledger, and empties the safe, scowling. Later, Brock takes a call as lab techs clean papers, revealing a sketch of a woman with a large pendant. Brock studies a photo of a necklace matching the sketch. Elsewhere, at home, a young woman carries teacups past a small dog; a white-haired woman works a pottery wheel. Leaning on a cane, the older woman approaches a TV in the kitchen. Brock uses a satellite phone at the research area. Rose, with a young woman and a small dog, rides a helicopter to the ship. Brock and Lewis approach as it lands, unloading luggage. Rose shakes Brock's hand; the young woman wheels her away. A man from the helicopter hands Brock a fishbowl. Later, Rose sets photos near the fishbowl. In the lab, Rose looks at the cleaned sketch in liquid, then shuts her eyes. A blonde man sketches the drawing. Rose smiles, picks up a silver hand mirror, sees her reflection in cracked glass, examines other items, and picks up a hair comb with an ornamental insect."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Snoop Dog enters a room with a collapsed wooden bed. An eel swims by as Snoop pivots to a broken door in the silt. A bearded man uses joysticks as Snoop moves the door, revealing a square object. A brown-haired man squints at a monitor, revealing an unopened safe. On the ocean surface, a vessel lifts the submersibles, and a winch raises the safe. Lewis sprays champagne as a crewman opens the safe with a cutting wheel, unleashing muddy water. Cameraman films Brock, who removes sodden papers and a muddy ledger. Brock takes a call while lab techs reveal a sketch of a woman with a pendant. Brock sees a photo of a matching pendant. A young woman with a dog walks with teacups; a white-haired woman uses a pottery wheel. The older woman moves toward a kitchen TV. Brock uses a satellite phone, while Rose and the young woman fly to the ship. The helicopter lands, and Rose greets Brock, then leaves in a wheelchair. Rose sets photos by a fishbowl. In the lab, she examines a sketch. She smiles, picks up a hand mirror, and examines a hair comb with an insect design."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Snoop Dog smoothly glides into a room where the remains of a wooden bed, now collapsed, lie scattered across the floor. Meanwhile, another eel swims gracefully past a porcelain bathtub as Snoop Dog pivots gracefully toward a broken door resting in the silt. The bearded man firmly grasps the two joysticks, controlling the machine, as Snoop Dog extends a pair of mechanical claws to carefully move the door aside, revealing a square object hidden beneath it. Nearby, the brown-haired man squints intently as he studies a video monitor, and soon the silt settles, uncovering an unopened safe beneath the water. Above, on the ocean's surface, a research vessel equipped with cranes and other equipment hoists the submersibles out of the water. Cheers erupt from the men as a winch raises a net holding the safe to the surface. Lewis joyfully uncorks a bottle of champagne, spraying it around in celebration, while a crewman diligently opens the safe using a cutting wheel. A man pulls off the door, releasing a rush of muddy water. As this unfolds, a cameraman films him, capturing the moment as Brock kneels and pulls out wads of sodden, waterlogged papers, then removes a muddy ledger, tossing it aside before emptying the safe, scowling with frustration as he stands. Later, Brock is seen taking a phone call while nearby, lab techs meticulously clean the muddy papers, revealing a sketch of a woman reclining elegantly on a settee, wearing a large pendant around her neck. Brock intently studies a photograph of a pendant necklace adorned with a heart-shaped gem, the very same necklace that the woman in the drawing is wearing. Elsewhere, in a cozy home, a young, long-haired woman walks casually past a small dog as she carries teacups to a table. In an adjoining sunroom, a white-haired woman is seen using a pottery wheel, skillfully crafting. Leaning on a cane, the older woman steps toward a small television set in a nearby kitchen. Meanwhile, Brock stands in the research area, using a satellite phone to stay connected. Holding the small white dog on her lap, Rose and the young woman ride inside a helicopter as it flies purposefully out to the research ship, where Brock and Lewis move to a railing, anticipating the helicopter's approach. They move quickly towards the landing pad as the helicopter touches down, and a crewman diligently unloads several suitcases and a large trunk. Rose warmly shakes Brock's hand, and the long-haired woman smiles, gently pushing Rose away in a wheelchair. A man aboard the helicopter thoughtfully hands a fishbowl to Brock. Later, Rose places framed photographs carefully beside the fishbowl. In the lab, Rose peers down at the now-clean sketch resting in a container of clear liquid, then closes her eyes in contemplation. A blonde man with a few stray locks falling over his eyes skillfully sketches the drawing. Rose smiles softly as she picks up the silver hand mirror, turning the mirror in her hands, catching her own reflection in the cracked glass, then sets down the mirror to examine other objects. She picks up a silver and glass hair comb, beautifully adorned with an ornamental insect with outstretched wings, marveling at its intricate design."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Snoop Dog enters the expansive room with a smooth and effortless glide, where the splintered remnants of what was once a wooden bed now lie haphazardly scattered across the floor. Concurrently, in a corner of the room, another eel is observed swimming past with an unwavering grace, making its way by a pristine porcelain bathtub. As Snoop Dog makes a gentle yet purposeful pivot toward a door, which now rests broken within the layer of silt on the floor, the bearded man operates the machine with precision. He firmly grips the twin joysticks to control its movements. Snoop Dog, equipped with a pair of intricate mechanical claws, extends them with care to deftly move the obstructing door aside. This action reveals a square object that had been hidden beneath the door’s weight. Nearby, a brown-haired man, with an intense focus etched on his face, squints as he carefully studies the images appearing on a video monitor. Soon after, the silt begins to settle, unveiling an unopened safe lying beneath the water’s expanse. Above, on the ocean's vast surface, a well-equipped research vessel, complete with cranes and an array of specialized equipment, diligently hoists the submersibles from the water. Cheers of jubilation erupt from the men aboard as a winch methodically raises a net containing the safe up to the surface. In a moment of celebration, Lewis joyously uncorks a bottle of champagne, exuberantly spraying it around, while a crewman directs his attention to opening the safe, skillfully wielding a cutting wheel. A man then pulls the door off, allowing a rush of muddy water to escape. During this unfolding scene, a cameraman diligently captures the entire moment, as Brock kneels to extract wads of sodden, waterlogged papers. He then retrieves a muddy ledger, tosses it aside dismissively, and empties the contents of the safe, scowling with a mix of frustration and disappointment as he rises. In a later scene, Brock is depicted taking a phone call while, nearby, lab technicians work meticulously, cleaning the muddy papers to reveal a sketch of a woman elegantly reclining on a settee, adorned with a large pendant around her neck. Brock directs his attention to a photograph of a necklace featuring a heart-shaped gem, identical to the one worn by the woman in the sketch. In a different setting, within the cozy confines of a home, a young woman with long flowing hair casually walks past a small dog, carefully carrying teacups to a table. In an adjoining sunroom, an elderly woman with white hair is skillfully engaged at a pottery wheel, crafting with a practiced hand. With the aid of a cane, the older woman makes her way toward a small television set situated in a nearby kitchen area. Meanwhile, Brock remains at the research site, utilizing a satellite phone to maintain constant communication. Rose, along with the young woman, cradles the small white dog on her lap as they ride in a helicopter, which flies with determination toward the research ship. On the ship, Brock and Lewis make their way to the railing, eagerly anticipating the helicopter's arrival. They quickly move toward the landing pad as the helicopter makes its descent, and a crewman efficiently unloads several suitcases along with a large trunk. Rose extends a warm handshake to Brock, and the long-haired woman smiles kindly, guiding Rose away in a wheelchair. A man aboard the helicopter thoughtfully hands a fishbowl to Brock. Later, Rose tenderly arranges framed photographs beside the fishbowl. In the lab, Rose gazes down at the now-pristine sketch, resting in a container filled with clear liquid, and then closes her eyes in a moment of contemplation. A blonde man, with a few stray locks cascading over his eyes, skillfully sketches the drawing. With a soft smile, Rose picks up the silver hand mirror, regarding her reflection in the cracked glass, then sets it aside to examine other items. She gently lifts a silver and glass hair comb, beautifully adorned with an ornamental insect with outstretched wings, marveling at its intricate and exquisite design."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Snoop Dog glides smoothly into a dimly lit room where the fragmented remains of a wooden bed are strewn across the floor in a collapsed heap. As he navigates the space, an eel gracefully swims past a porcelain bathtub, creating a surreal underwater dance. Snoop Dog then pivots with precision towards a broken door that lies partially buried in the silt, contemplating his next move. The bearded man, seated nearby, firmly grasps the two joysticks of the control panel, attentively guiding Snoop Dog’s movements. Snoop Dog extends a pair of mechanical claws with agile precision, carefully maneuvering the claws to grasp the broken door and move it aside, which reveals a square object hidden beneath. At the same time, the brown-haired man leans closer to a video monitor, squinting intently as he scrutinizes the unfolding scene. As the silt gently settles, an unopened safe comes into view, emerging from its murky concealment. Meanwhile, on the ocean surface, a sturdy research vessel, equipped with heavy cranes, efficiently plucks the submersibles out of the water with mechanical grace. A celebratory cheer erupts from the men on deck as a winch slowly raises a net, triumphantly hauling the safe to the surface. In a moment of gleeful celebration, Lewis uncorks a bottle of champagne, eagerly spraying it over everyone around him. Simultaneously, a crewman begins the meticulous process of opening the safe with a precision cutting wheel, working to slice through the impenetrable metal. As the safe's door is pried off, a torrent of muddy water gushes out, releasing its murky contents. With a cameraman capturing every detail, Brock kneels down, his fingers delving into the safe's interior as he pulls out wads of sodden papers. He removes a muddy ledger, barely glances at it, then tosses it aside with disdain before he fully empties the safe. A scowl mars his face as he rises to his feet, reflecting his disappointment. Later, while Brock answers a phone call, lab techs diligently work nearby, meticulously cleaning the muddy papers. Their efforts reveal a delicate sketch depicting a woman reclining elegantly on a settee, adorned with a large pendant around her neck. Brock's eyes carefully examine a photograph of a pendant necklace showcasing a heart-shaped gem, identical to the one the woman in the drawing wears. Meanwhile, in a homely setting, a young, long-haired woman smoothly walks past a small dog, balancing teacups with steady hands as she carries them to a table. In an adjoining sunroom filled with warm light, a white-haired woman skillfully uses a pottery wheel, her hands shaping clay with practiced ease. Leaning on a cane for support, the older woman takes cautious steps toward a small television set in a nearby kitchen, her movements deliberate yet purposeful. Amidst the hustle of the research area, Brock stands resolute, speaking into a satellite phone, his stance firm against the surrounding activity. Inside a helicopter, Rose, with the small white dog perched comfortably on her lap, sits alongside the young woman as they fly out to the research ship. As the helicopter approaches, Brock and Lewis make their way to the railing, tracking its descent. They step forward, moving toward the landing pad as the helicopter touches down softly on the deck. A crewman swiftly unloads several suitcases and a large trunk, executing the task with practiced efficiency. Rose extends her hand, shaking Brock's in a gesture of acknowledgment, while the long-haired woman smiles brightly and gently pushes Rose’s wheelchair forward. A man aboard the helicopter extends his arm, handing a carefully balanced fishbowl to Brock, who accepts it with a nod. Later, Rose tenderly sets framed photographs beside the fishbowl, each picture telling a story of its own. In the lab, she peers down thoughtfully at the clean, preserved sketch resting in a container of clear liquid, her gaze softening as she takes in the details, then closes her eyes, immersing herself in her memories. In her mind's eye, a blonde man with a few stray locks over his eyes sketches the drawing with artistic grace. A smile plays on Rose's lips as she picks up a silver hand mirror, her fingers tracing its cool surface. She turns the mirror in her hands, catching a glimpse of her reflection in the cracked glass. Satisfied, she sets the mirror down gently and moves on to examine other objects of interest. Her fingers delicately pick up a silver and glass hair comb, admiring the ornamental insect with outstretched wings that adorns it, appreciating the craftsmanship and beauty of the piece."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Snoop Dog enters a room with a collapsed wooden bed and a porcelain bathtub, maneuvering past debris toward a broken door. Guided by a bearded operator, Snoop Dog uses mechanical claws to shift the door, revealing an unopened safe. On the ocean surface, a research vessel retrieves the submersibles, and the crew celebrates as a winch hoists the safe. Lewis sprays champagne as a crewman opens the safe with a cutting wheel, unleashing muddy water. Brock, filmed by a cameraman, empties the safe, tossing aside a muddy ledger and inspecting wet papers. Later, as lab techs clean the papers, they uncover a sketch of a woman wearing a pendant. Brock studies a photograph of the same pendant. Meanwhile, in a home, a young woman serves tea, passing a small dog, while an older woman works at a pottery wheel before moving to a TV. On the research ship, Brock uses a satellite phone as Rose and the young woman arrive by helicopter. After the helicopter lands and a crewman unloads luggage, Rose shakes Brock's hand and the young woman wheels her away. Aboard the helicopter, a man hands Brock a fishbowl. Rose later arranges framed photographs beside the fishbowl and inspects the clean sketch in the lab. Reflecting on her past, she examines a silver hand mirror, then picks up a decorative silver and glass hair comb."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Snoop Dog, a submersible vehicle named after the famous rapper known for his distinctive laid-back music style, glides into a room where the remains of a wooden bed, once part of luxury accommodations, lie collapsed on the floor. Another eel, indicative of the rich marine life that often inhabits underwater wrecks, swims past a porcelain bathtub, likely an artifact from a grand shipwreck, as Snoop Dog pivots toward a broken door lying in the silt. The bearded man, an experienced submersible operator skilled in navigating underwater environments, grasps the two joysticks as Snoop Dog extends a pair of mechanical claws to move the door aside, uncovering a square object. The brown-haired man, a researcher specializing in maritime archaeology, squints as he studies a video monitor, and the silt settles to reveal an unopened safe, possibly filled with historical artifacts. On the ocean surface, a research vessel outfitted with cranes, a crucial component for handling heavy underwater equipment, plucks the submersibles out of the water, and men cheer as a winch raises a net holding the safe to the surface. Lewis, an exuberant crew member celebrating the discovery, uncorks a bottle of champagne and sprays everyone while a crewman opens the safe with a cutting wheel, a tool often used in metal cutting operations. A man pulls off the door, unleashing a flood of muddy water. As a cameraman films him, Brock kneels and pulls out wads of sodden papers, removes a muddy ledger, a record book likely from a long-lost voyage, and tosses it aside before emptying the safe, scowling as he stands. Later, Brock takes a phone call from an interested party in the historical value of the artifacts while nearby lab techs clean the muddy papers, revealing a sketch of a woman reclining on a settee, wearing a large pendant around her neck. Brock studies a photograph of a pendant necklace with a heart-shaped gem, the same necklace the woman in the drawing is wearing, possibly hinting at a storied romance from the past. Elsewhere, in a home that exudes a cozy, lived-in charm, a young, long-haired woman walks past a small dog as she carries teacups to a table, and in an adjoining sunroom, a white-haired woman, demonstrating her artistic flair, uses a pottery wheel. Leaning on a cane, the older woman steps toward a small television set in a nearby kitchen, a relic from an earlier technological era. Brock stands on the research area using a satellite phone, essential for communication in remote areas. Holding the small white dog on her lap, Rose and the young woman ride inside a helicopter as it flies out to the research ship, where Brock and Lewis move to a railing as the helicopter approaches. They move towards the landing pad as the helicopter touches down, and a crewman unloads several suitcases and a large trunk, possibly containing personal effects and documents. Rose shakes Brock's hand, and the long-haired woman smiles and pushes Rose away in a wheelchair, a gesture of care and companionship. A man aboard the helicopter hands a fishbowl to Brock, an unlikely gift symbolizing a shared adventure. Later, Rose sets framed photographs, capturing moments from her past, beside the fishbowl. In the lab, Rose peers down at the clean sketch resting in a container of clear liquid, a preservation technique for fragile documents, then closes her eyes. A blonde man with a few stray locks over his eyes sketches the drawing, possibly an artist tasked with reproducing the find. Rose smiles as she picks up the silver hand mirror, an heirloom from another era, turns the mirror in her hands, catching her own reflection in the cracked glass, sets down the mirror, and examines other objects. She picks up a silver and glass hair comb adorned with an ornamental insect with outstretched wings, a piece of intricate craftsmanship highlighting the artistry of bygone times."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Snoop Dog glides into a room where the remains of a wooden bed lie collapsed on the floor. Another eel swims past a porcelain bathtub as Snoop Dog pivots toward a broken door lying in the silt. The bearded man grasps the two joysticks as Snoop Dog extends a pair of mechanical claws to move the door aside uncovering a square object. The brownhaired man squints as he studies a video monitor and the silt settles to reveal an unopened safe. On the ocean surface a research vessel outfitted with cranes plucks the submersibles out of the water and men cheer as a winch raises a net holding the safe to the surface. Lewis uncorks a bottle of champagne and sprays everyone while a crewman opens the safe with a cutting wheel. A man pulls off the door unleashing a flood of muddy water. As a cameraman films him Brock kneels and pulls out wads of sodden papers removes a muddy ledger and tosses it aside before emptying the safe scowling as he stands. Later Brock takes a phone call while nearby lab techs clean the muddy papers revealing a sketch of a woman reclining on a settee wearing a large pendant around her neck. Brock studies a photograph of a pendant necklace with a heartshaped gem. the same necklace the woman in the drawing is wearing. Elsewhere in a home a young longhaired woman walks past a small dog as she carries teacups to a table and in an adjoining sunroom a whitehaired woman uses a pottery wheel. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Leaning on a cane the older woman steps toward a small television set in a nearby kitchen. Brock stands on the research area using a satellite phone. Holding the small white dog on her lap. Rose and the young woman ride inside a helicopter as it flies out to the research ship where Brock and Lewis move to a railing as the helicopter approaches. They move towards the landing pad as the helicopter touches down and a crewman unloads several suitcases and a large trunk. Rose shakes Brock's hand and the longhaired woman smiles and pushes Rose away in a wheelchair. A man aboard the helicopter hands a fishbowl to Brock. Later Rose sets framed photographs beside the fishbowl. In the lab Rose peers down at the clean sketch resting in a container of clear liquid then closes her eyes. A blonde man with a few stray locks over his eyes sketches the drawing. Rose smiles as she picks up the silver hand mirror turns the mirror in her hands catching her own reflection in the cracked glass sets down the mirror and examines other objects. She picks up a silver and glass hair comb adorned with an ornamental insect with outstretched wings."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Snoop Dog glides into a room where the remains of a wooden bed lie collapsed on the floor. Another eel swims past a porcelain bathtub as Snoop Dog pivots toward a broken door lying in the silt. The bearded man grasps the two joysticks as Snoop Dog extends a pair of mechanical claws to move the door aside uncovering a square object. The brownhaired man squints as he studies a video monitor and the silt settles to reveal an unopened safe. On the ocean surface a research vessel outfitted with cranes plucks the submersibles out of the water and men cheer as a winch raises a net holding the safe to the surface. Lewis uncorks a bottle of champagne and sprays everyone while a crewman opens the safe with a cutting wheel. A man pulls off the door unleashing a flood of muddy water. As a cameraman films him Brock kneels and pulls out wads of sodden papers removes a muddy ledger and tosses it aside before emptying the safe scowling as he stands. Later Brock takes a phone call while nearby lab techs clean the muddy papers revealing a sketch of a woman reclining on a settee wearing a large pendant around her neck. Brock studies a photograph of a pendant necklace with a heartshaped gem. the same necklace the woman in the drawing is wearing. Elsewhere in a home a young longhaired woman walks past a small dog as she carries teacups to a table and in an adjoining sunroom a whitehaired woman uses a pottery wheel. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Leaning on a cane the older woman steps toward a small television set in a nearby kitchen. Brock stands on the research area using a satellite phone. Holding the small white dog on her lap. Rose and the young woman ride inside a helicopter as it flies out to the research ship where Brock and Lewis move to a railing as the helicopter approaches. They move towards the landing pad as the helicopter touches down and a crewman unloads several suitcases and a large trunk. Rose shakes Brock's hand and the longhaired woman smiles and pushes Rose away in a wheelchair. A man aboard the helicopter hands a fishbowl to Brock. Later Rose sets framed photographs beside the fishbowl. In the lab Rose peers down at the clean sketch resting in a container of clear liquid then closes her eyes. A blonde man with a few stray locks over his eyes sketches the drawing. Rose smiles as she picks up the silver hand mirror turns the mirror in her hands catching her own reflection in the cracked glass sets down the mirror and examines other objects. She picks up a silver and glass hair comb adorned with an ornamental insect with outstretched wings."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Snoop Dog glides into a room where the remains of a wooden bed lie collapsed on the floor. Another eel swims past a porcelain bathtub as Snoop Dog pivots toward a broken door lying in the silt. The bearded man grasps the two joysticks as Snoop Dog extends a pair of mechanical claws to move the door aside uncovering a square object. The brownhaired man squints as he studies a video monitor and the silt settles to reveal an unopened safe. On the ocean surface a research vessel outfitted with cranes plucks the submersibles out of the water and men cheer as a winch raises a net holding the safe to the surface. Lewis uncorks a bottle of champagne and sprays everyone while a crewman opens the safe with a cutting wheel. A man aboard the helicopter hands a fishbowl to Brock. Later Rose sets framed photographs beside the fishbowl. In the lab Rose peers down at the clean sketch resting in a container of clear liquid then closes her eyes. A blonde man with a few stray locks over his eyes sketches the drawing. Rose smiles as she picks up the silver hand mirror turns the mirror in her hands catching her own reflection in the cracked glass sets down the mirror and examines other objects. She picks up a silver and glass hair comb adorned with an ornamental insect with outstretched wings."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Snoop Dog glides into a room where the remains of a wooden bed lie collapsed on the floor. Another eel swims past a porcelain bathtub as Snoop Dog pivots toward a broken door lying in the silt. The bearded man grasps the two joysticks as Snoop Dog extends a pair of mechanical claws to move the door aside uncovering a square object. Rose smiles as she picks up the silver hand mirror turns the mirror in her hands catching her own reflection in the cracked glass sets down the mirror and examines other objects. She picks up a silver and glass hair comb adorned with an ornamental insect with outstretched wings."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Bingo Cat dances into a cave where the fragments of a stone couch rest shattered on the ceiling. A parrot flies past a golden fountain as Bingo Cat spins toward a sealed window resting in the sand. The masked pirate fumbles the three marbles as Bingo Cat deploys a pair of rubber paddles to slide the window aside, revealing a round gizmo. The orange-haired wizard blinks as he examines a crystal screen, and the sand lifts to unveil a closed basket. On the jungle canopy, an exploration balloon equipped with nets scoops the drones out of the air, and birds sing as a rope lowers a cage holding the basket to the ground. Abigail pops a bottle of soda and drenches everyone while a sailor cracks the basket with a hammer. A wizard yanks off the lid, releasing a stream of clear juice. As a painter sketches him, Charlie squats and extracts piles of wet feathers, extracts a soaked diary, and tosses it aside before emptying the basket, frowning as he rises. Later, Charlie makes a video call while nearby nurses dry the damp feathers, revealing an etching of a wizard lounging on a hammock, wearing a massive crown atop her head. Charlie examines an image of a crown tiara with a square stone, the exact tiara the wizard in the picture is wearing. Somewhere else, in a mansion, an elderly, curly-haired wizard hovers past a giant cat as she delivers goblets to a shelf, and in an adjoining greenhouse, a bald gardener works a candy machine. Leaning on a broom, the elder wizard glides toward a vast theater marquee in a nearby pantry. Charlie sits in the library using a Morse code machine. Cradling the giant brown cat on her shoulder, Bella and the elderly wizard soar inside a zeppelin as it floats towards the exploration balloon, where Charlie and Abigail stroll to a window as the zeppelin approaches. They drift towards the observation deck as the zeppelin touches down, and a sailor unloads numerous baskets and a bulky chest. Bella shakes Charlie's elbow, and the curly-haired wizard chuckles and carries Bella away on a skateboard. A scientist aboard the zeppelin hands a box to Charlie. Later, Bella places sculpted statues beside the box. In the greenhouse, Bella gazes down at the dry etching resting in a bowl of sparkling syrup, then closes her eyes. A brunette nun with a few loose threads over her eyes paints the picture. Bella laughs as she lifts the golden pocket watch, turns the watch in her hands, glimpsing her own image in the broken lens, sets down the watch, and admires other artifacts. She lifts a golden and stone hair brush embellished with a mythical creature with spread fins."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Snoop Dog navigates through a submerged room where he uses mechanical claws to uncover an unopened safe. On the ocean surface, a research vessel retrieves the safe, and crew members cheer as it's opened to reveal sodden papers and a ledger. Brock, dissatisfied with the find, takes a phone call while lab techs clean the papers, revealing a sketch of a woman wearing a distinctive pendant. The sketch matches a photograph of a pendant with a heart-shaped gem. Elsewhere, an older woman named Rose, assisted by a younger woman, sees a news report about the find. Rose and her companion board a helicopter to the research ship. Upon arrival, Rose greets Brock and examines recovered objects, including a drawing. She nostalgically reflects on her past while reviewing items like a hand mirror and a hair comb."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She picks up a silver and glass hair comb adorned with an ornamental insect with outstretched wings Rose smiles as she picks up the silver hand mirror turns the mirror in her hands catching her own reflection in the cracked glass sets down the mirror and examines other objects A blonde man with a few stray locks over his eyes sketches the drawing In the lab Rose peers down at the clean sketch resting in a container of clear liquid then closes her eyes Later Rose sets framed photographs beside the fishbowl A man aboard the helicopter hands a fishbowl to Brock Rose shakes Brock's hand and the longhaired woman smiles and pushes Rose away in a wheelchair They move towards the landing pad as the helicopter touches down and a crewman unloads several suitcases and a large trunk Rose and the young woman ride inside a helicopter as it flies out to the research ship where Brock and Lewis move to a railing as the helicopter approaches Holding the small white dog on her lap Brock stands on the research area using a satellite phone Leaning on a cane the older woman steps toward a small television set in a nearby kitchen Elsewhere in a home a young longhaired woman walks past a small dog as she carries teacups to a table and in an adjoining sunroom a whitehaired woman uses a pottery wheel the same necklace the woman in the drawing is wearing Brock studies a photograph of a pendant necklace with a heartshaped gem Later Brock takes a phone call while nearby lab techs clean the muddy papers revealing a sketch of a woman reclining on a settee wearing a large pendant around her neck As a cameraman films him Brock kneels and pulls out wads of sodden papers removes a muddy ledger and tosses it aside before emptying the safe scowling as he stands A man pulls off the door unleashing a flood of muddy water Lewis uncorks a bottle of champagne and sprays everyone while a crewman opens the safe with a cutting wheel On the ocean surface a research vessel outfitted with cranes plucks the submersibles out of the water and men cheer as a winch raises a net holding the safe to the surface The brownhaired man squints as he studies a video monitor and the silt settles to reveal an unopened safe The bearded man grasps the two joysticks as Snoop Dog extends a pair of mechanical claws to move the door aside uncovering a square object Another eel swims past a porcelain bathtub as Snoop Dog pivots toward a broken door lying in the silt Snoop Dog glides into a room where the remains of a wooden bed lie collapsed on the floor"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Another eel swims past a porcelain bathtub as Snoop Dog pivots toward a broken door lying in the silt Snoop Dog glides into a room where the remains of a wooden bed lie collapsed on the floor The brownhaired man squints as he studies a video monitor and the silt settles to reveal an unopened safe The bearded man grasps the two joysticks as Snoop Dog extends a pair of mechanical claws to move the door aside uncovering a square object Lewis uncorks a bottle of champagne and sprays everyone while a crewman opens the safe with a cutting wheel On the ocean surface a research vessel outfitted with cranes plucks the submersibles out of the water and men cheer as a winch raises a net holding the safe to the surface As a cameraman films him Brock kneels and pulls out wads of sodden papers removes a muddy ledger and tosses it aside before emptying the safe scowling as he stands A man pulls off the door unleashing a flood of muddy water Brock studies a photograph of a pendant necklace with a heartshaped gem Later Brock takes a phone call while nearby lab techs clean the muddy papers revealing a sketch of a woman reclining on a settee wearing a large pendant around her neck Elsewhere in a home a young longhaired woman walks past a small dog as she carries teacups to a table and in an adjoining sunroom a whitehaired woman uses a pottery wheel the same necklace the woman in the drawing is wearing Brock stands on the research area using a satellite phone Leaning on a cane the older woman steps toward a small television set in a nearby kitchen Rose and the young woman ride inside a helicopter as it flies out to the research ship where Brock and Lewis move to a railing as the helicopter approaches Holding the small white dog on her lap Rose shakes Brock's hand and the longhaired woman smiles and pushes Rose away in a wheelchair They move towards the landing pad as the helicopter touches down and a crewman unloads several suitcases and a large trunk Later Rose sets framed photographs beside the fishbowl A man aboard the helicopter hands a fishbowl to Brock A blonde man with a few stray locks over his eyes sketches the drawing In the lab Rose peers down at the clean sketch resting in a container of clear liquid then closes her eyes She picks up a silver and glass hair comb adorned with an ornamental insect with outstretched wings Rose smiles as she picks up the silver hand mirror turns the mirror in her hands catching her own reflection in the cracked glass sets down the mirror and examines other objects"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Leaning on a cane the older woman steps toward a small television set in a nearby kitchen Brock stands on the research area using a satellite phone Holding the small white dog on her lap Rose and the young woman ride inside a helicopter as it flies out to the research ship where Brock and Lewis move to a railing as the helicopter approaches They move towards the landing pad as the helicopter touches down and a crewman unloads several suitcases and a large trunk Rose shakes Brock's hand and the longhaired woman smiles and pushes Rose away in a wheelchair A man aboard the helicopter hands a fishbowl to Brock Later Rose sets framed photographs beside the fishbowl In the lab Rose peers down at the clean sketch resting in a container of clear liquid then closes her eyes A blonde man with a few stray locks over his eyes sketches the drawing Rose smiles as she picks up the silver hand mirror turns the mirror in her hands catching her own reflection in the cracked glass sets down the mirror and examines other objects She picks up a silver and glass hair comb adorned with an ornamental insect with outstretched wings Snoop Dog glides into a room where the remains of a wooden bed lie collapsed on the floor Another eel swims past a porcelain bathtub as Snoop Dog pivots toward a broken door lying in the silt The bearded man grasps the two joysticks as Snoop Dog extends a pair of mechanical claws to move the door aside uncovering a square object The brownhaired man squints as he studies a video monitor and the silt settles to reveal an unopened safe On the ocean surface a research vessel outfitted with cranes plucks the submersibles out of the water and men cheer as a winch raises a net holding the safe to the surface Lewis uncorks a bottle of champagne and sprays everyone while a crewman opens the safe with a cutting wheel A man pulls off the door unleashing a flood of muddy water As a cameraman films him Brock kneels and pulls out wads of sodden papers removes a muddy ledger and tosses it aside before emptying the safe scowling as he stands Later Brock takes a phone call while nearby lab techs clean the muddy papers revealing a sketch of a woman reclining on a settee wearing a large pendant around her neck Brock studies a photograph of a pendant necklace with a heartshaped gem the same necklace the woman in the drawing is wearing Elsewhere in a home a young longhaired woman walks past a small dog as she carries teacups to a table and in an adjoining sunroom a whitehaired woman uses a pottery wheel"
        }
      ]
    }
  ]
}