{
  "ground_truth": "Lovejoy scowls as he follows Cal, who walks through the bridge, and they brush past an officer. Meanwhile, Ismay stands by the collapsible and glances at a crowd of passengers on the lower side of the bridge before turning back to the collapsible. While Murdoch turns away, Ismay slips into a seat on the collapsible, and Murdoch finds himself staring at his mate who gazes ahead. Murdoch glowers at his mate while motioning downward with both arms. The seamen lower the collapsible, and as it drops below the deck, Ismay glances up. Lightoller grabs a young girl and places her in a lifeboat. Rose turns to Jack, while Cal glances from Jack to Rose. Cal pulls off the blanket wrapped around Rose and shoves it at Jack before removing his own coat and placing it around Rose's shoulders. He starts to caress Rose's hair, but she backs away from him, and Jack steps up to her. A crewman grabs Rose and guides her toward the lifeboat, and Jack, along with another crew member, helps Rose climb into the boat. Rose turns and grasps Jack's outstretched hand as the crewman pushes Jack back and the lifeboat jerks. Standing at the rail, Cal and Jack gaze at Rose as the lifeboat lowers toward the water, and Rose stares back at Jack. Jack looks from Cal to the descending boat, while Rose looks around, up at the ropes running through the pulleys, and back at Jack. Rose sees a young girl next to her waving to her father while her sister cries, as a crew member on deck yells orders with arms raised out at his sides. Rose gazes back up at Jack, who stands beside Cal, as another flare shoots into the dark sky above them and briefly illuminates Rose's face. More streaking flares cascade in the sky above Jack, and suddenly Rose steps to the edge of the lifeboat, leaps from it, and hangs from the ship's rail several decks below Jack. Two crew members pull her on board, and she runs along the deck while Jack turns and runs along the main deck, past passengers and crew members. Rose runs along the lower deck, as Jack rushes inside and runs down the grand staircase. At the bottom of the stairs, Rose runs into his arms, and they embrace, kiss, and then hug. Cal gazes down at them from an upper landing. Stepping up to him, Lovejoy glances down, grabs Cal's shoulder, and pulls him away. As they step away from the railing, Cal grabs Lovejoy's gun from its holster and runs toward the stairs, pulling Rose away as Rose and Jack flee and Cal tears down the stairs after them.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Lovejoy frowns as he trails Cal, who strides through the span, and they brush past an officer. Meanwhile, Ismay stands by the collapsible and peers at a throng of travelers on the lower side of the span before turning back to the collapsible. While Murdoch pivots away, Ismay sneaks into a seat on the collapsible, and Murdoch finds himself staring at his companion who gazes ahead. Murdoch glares at his companion while motioning downward with both arms. The mariners lower the collapsible, and as it descends below the deck, Ismay glances up. Lightoller grabs a young girl and places her in a lifeboat. Rose turns to Jack, while Cal looks from Jack to Rose. Cal pulls off the blanket wrapped around Rose and thrusts it at Jack before removing his own coat and placing it around Rose's shoulders. He starts to stroke Rose's hair, but she backs away from him, and Jack steps up to her. A crewman grabs Rose and guides her toward the lifeboat, and Jack, along with another crew member, helps Rose climb into the boat. Rose turns and holds Jack's extended hand as the crewman pushes Jack back and the lifeboat jolts. Standing at the rail, Cal and Jack gaze at Rose as the lifeboat lowers toward the water, and Rose stares back at Jack. Jack looks from Cal to the descending boat, while Rose looks around, up at the ropes running through the pulleys, and back at Jack. Rose sees a young girl next to her waving to her father while her sister weeps, as a crew member on deck shouts orders with arms lifted out at his sides. Rose gazes back up at Jack, who stands beside Cal, as another flare shoots into the dark sky above them and briefly lights up Rose's face. More streaking flares cascade in the sky above Jack, and suddenly Rose steps to the edge of the lifeboat, jumps from it, and hangs from the ship's rail several decks below Jack. Two crew members pull her on board, and she runs along the deck while Jack turns and runs along the main deck, past travelers and crew members. Rose runs along the lower deck, as Jack rushes inside and runs down the grand stairway. At the bottom of the stairs, Rose runs into his arms, and they embrace, kiss, and then hug. Cal gazes down at them from an upper landing. Stepping up to him, Lovejoy glances down, grabs Cal's shoulder, and pulls him away. As they step away from the railing, Cal grabs Lovejoy's gun from its holster and runs toward the stairs, pulling Rose away as Rose and Jack escape and Cal races down the stairs after them."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Lovejoy's scowl is evident as Cal is followed by him, who walks through the bridge, and an officer is brushed past by them. Meanwhile, the collapsible is stood by Ismay, who glances at a crowd of passengers on the lower side of the bridge before the collapsible is turned back to. As a seat on the collapsible is slipped into by Ismay, Murdoch finds himself staring at his mate who is gazed at by him while his mate gazes ahead. Murdoch's mate is glowered at by him while a downward motion is made with both arms. The collapsible is lowered by the seamen, and as it drops below the deck, Ismay looks up. A young girl is grabbed by Lightoller and she is placed in a lifeboat. Jack is turned to by Rose, while Jack is glanced at by Cal from Rose. The blanket wrapped around Rose is pulled off by Cal and it is shoved at Jack before Cal strips his own coat and it is placed around Rose's shoulders. Rose's hair is started to be caressed by him, but she backs away from him, and she is stepped up to by Jack. Rose is grabbed by a crewman and she is guided toward the lifeboat, and Rose is helped by Jack, along with another crew member, to climb into the boat. Jack's outstretched hand is grasped by Rose as Jack is pushed back by the crewman and the lifeboat jerks. At the rail, Rose is gazed at by Cal and Jack as the lifeboat lowers toward the water, and Jack is stared back at by Rose. Cal and the descending boat are looked at by Jack, while Jack is looked around at by Rose, up at the ropes running through the pulleys, and back at him. A young girl next to Rose is seen by her waving to her father while her sister cries, as orders are yelled by a crew member on deck with arms raised out at his sides. Jack is gazed back up at by Rose, who stands beside Cal, as another flare is shot into the dark sky above them and Rose's face is briefly illuminated. Above Jack, more streaking flares cascade in the sky, and suddenly the edge of the lifeboat is stepped to by Rose, the lifeboat is leaped from, and the ship's rail several decks below Jack is hung from by her. She is pulled on board by two crew members, and she runs along the deck while Jack turns and runs along the main deck, past passengers and crew members. The lower deck is run along by Rose, as the grand staircase is rushed inside and run down by Jack. At the bottom of the stairs, Jack's arms are run into by Rose, and an embrace, a kiss, and then a hug occur. They are gazed down at by Cal from an upper landing. Lovejoy steps up to him, Lovejoy glances down, Cal's shoulder is grabbed, and he is pulled away. As the railing is stepped away from by them, Lovejoy's gun is grabbed by Cal from its holster and the stairs are run toward by him, Rose is pulled away as Rose and Jack flee and the stairs are torn down after them by Cal."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Lovejoy scowls as he follows Cal across the bridge, brushing past an officer. Ismay stands by the collapsible, glancing at passengers below before slipping into a seat as Murdoch turns away. Murdoch glares at his mate, motioning downward, and seamen lower the collapsible. Ismay looks up as it drops. Lightoller places a young girl in a lifeboat. Cal removes Rose's blanket, gives it to Jack, then wraps his coat around Rose. He caresses her hair, but she backs away, and Jack steps up. A crewman guides Rose to the lifeboat, and Jack helps her in. Rose grasps Jack's hand as the lifeboat lowers, and she stares back at him. Jack looks from Cal to the boat, while Rose observes the ropes and Jack. She sees a young girl waving to her father as a crew member yells orders. Rose gazes at Jack as a flare illuminates her face. More flares light the sky, and Rose leaps from the lifeboat, hanging from the ship's rail. Crew members pull her aboard, and she runs along the deck. Jack runs inside, down the grand staircase, and they embrace at the bottom. Cal watches from above, then grabs Lovejoy's gun and chases them as they flee."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Lovejoy scowls following Cal through the bridge, brushing past an officer. Ismay stands by the collapsible, glances at passengers, then slips into a seat as Murdoch turns away. Murdoch signals, and seamen lower the collapsible. Lightoller places a girl in a lifeboat. Cal removes Rose's blanket, gives it to Jack, then wraps his coat around Rose. He caresses her hair, but she backs away, and Jack steps up. A crewman guides Rose to the lifeboat, and Jack helps her in. Rose grasps Jack's hand as the lifeboat lowers. Cal and Jack watch Rose, who looks back at Jack. Rose sees a girl waving to her father, hears a crew member yelling orders, and gazes at Jack as flares illuminate her face. Suddenly, Rose leaps from the lifeboat, hangs from the ship's rail, and is pulled on board. She runs along the deck, while Jack runs inside and down the grand staircase. At the bottom, they embrace and kiss. Cal watches from above, then grabs Lovejoy's gun and chases after Rose and Jack as they flee."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Lovejoy, with a deep scowl etched across his face, follows closely behind Cal, who strides purposefully through the bridge. As they move forward, they brush past an officer, barely acknowledging his presence. Meanwhile, Ismay stands by the collapsible lifeboat, casting a glance at the crowd of anxious passengers gathered on the lower side of the bridge. After a moment, he turns his attention back to the collapsible. As Murdoch turns away, Ismay seizes the opportunity to slip quietly into a seat on the collapsible. Murdoch, upon noticing this, finds himself staring at his mate, who is gazing intently ahead. With a stern expression, Murdoch glowers at his mate while motioning downward with both arms, signaling the seamen to lower the collapsible. As it begins to descend below the deck, Ismay glances upward. Nearby, Lightoller swiftly grabs a young girl and places her securely in a lifeboat. Rose turns her attention to Jack, while Cal shifts his gaze from Jack to Rose. In a sudden motion, Cal removes the blanket wrapped around Rose and thrusts it at Jack. He then takes off his own coat and gently places it around Rose's shoulders. He starts to tenderly caress Rose's hair, but she instinctively backs away from him, prompting Jack to step up to her side. A crewman then grabs Rose and guides her toward the lifeboat, with Jack and another crew member assisting her as she climbs into the boat. As the lifeboat begins to lower, Rose turns and grasps Jack's outstretched hand, but the crewman pushes Jack back, causing the lifeboat to jerk. Standing at the rail, both Cal and Jack gaze intently at Rose as the lifeboat descends toward the water, and Rose stares back at Jack. Jack shifts his gaze from Cal to the descending boat, while Rose looks around, up at the ropes running through the pulleys, and then back at Jack. She notices a young girl next to her waving to her father, while her sister cries, as a crew member on deck yells orders with his arms raised out at his sides. Rose gazes back up at Jack, who stands beside Cal, as another flare shoots into the dark sky above them, briefly illuminating Rose's face. More streaking flares cascade across the sky above Jack, and suddenly, with a determined leap, Rose steps to the edge of the lifeboat, jumps from it, and hangs from the ship's rail several decks below Jack. Two crew members quickly pull her on board, and she runs along the deck, while Jack turns and runs along the main deck, weaving past passengers and crew members. Rose continues to run along the lower deck, as Jack rushes inside and dashes down the grand staircase. At the bottom of the stairs, Rose runs into his arms, and they embrace passionately, kissing and then hugging tightly. Cal, standing on an upper landing, gazes down at them. Lovejoy steps up to him, glances down, and then grabs Cal's shoulder, pulling him away. As they step away from the railing, Cal suddenly grabs Lovejoy's gun from its holster and charges toward the stairs, pulling Rose away as she and Jack flee, with Cal tearing down the stairs in hot pursuit."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Lovejoy, a deep scowl etched sternly across his face, follows closely behind Cal with a determined gait, as Cal strides purposefully and confidently through the expansive bridge. As they continue their brisk movement forward, they brush past an officer, barely sparing even a moment to acknowledge his presence. Meanwhile, Ismay stands near the collapsible lifeboat, casting a quick but discerning glance at the crowd of anxious passengers who have gathered on the lower side of the bridge. After a brief moment of consideration, he turns his attention back to the collapsible. As Murdoch turns his attention away, Ismay seizes this opportunity to slip quietly and discreetly into a seat on the collapsible. Murdoch, upon noticing this move, finds himself staring intently at his mate, who is gazing purposefully ahead. With a stern, unwavering expression, Murdoch glowers at his mate while motioning downward with both arms, signaling the seamen to lower the collapsible. As it begins its descent below the deck, Ismay glances upward apprehensively. Nearby, Lightoller swiftly acts, grabbing a young girl and placing her securely in a lifeboat with care. Rose turns her attention fully to Jack, while Cal shifts his gaze, moving it from Jack to Rose with focus. In a sudden, decisive motion, Cal removes the blanket that had been wrapped snugly around Rose and thrusts it at Jack. He then takes off his own coat and gently places it around Rose's shoulders with tenderness. He starts to tenderly caress Rose's hair, but her instinctive reaction is to back away from him, prompting Jack to step up protectively to her side. A crewman then firmly grabs Rose and begins to guide her toward the lifeboat, with Jack and another crew member assisting her as she climbs carefully into the boat. As the lifeboat starts to lower gradually, Rose turns and reaches out, grasping Jack's outstretched hand, but the crewman pushes Jack back, causing the lifeboat to jerk slightly. Standing at the rail, both Cal and Jack gaze intently and with deep focus at Rose as the lifeboat descends steadily toward the water, and Rose stares back with a mix of emotions at Jack. Jack shifts his gaze from Cal to the descending boat below, while Rose looks around, her eyes glancing up at the ropes running carefully through the pulleys, and then back again at Jack. She notices a young girl next to her, waving energetically to her father, while her sister cries, as a crew member on deck loudly yells orders with his arms raised out widely at his sides. Rose gazes back up at Jack, who stands firmly beside Cal, as another bright flare shoots into the dark sky above them, briefly illuminating Rose's face in stark light. More streaking flares cascade in brilliant arcs across the sky above Jack, and suddenly, with a determined, daring leap, Rose steps confidently to the edge of the lifeboat, jumps decisively from it, and hangs precariously from the ship's rail several decks below Jack. Two crew members quickly act, pulling her on board without delay, and she runs with urgency along the deck, while Jack turns and runs rapidly along the main deck, weaving quickly past passengers and crew members. Rose continues to run along the lower deck, with Jack rushing inside and dashing swiftly down the grand staircase. At the bottom of the stairs, Rose runs eagerly into his welcoming arms, and they embrace passionately, sharing a fervent kiss and then hugging tightly. Cal, standing on an upper landing, gazes down at them intently. Lovejoy steps promptly up to Cal, glances swiftly down, and then grabs Cal's shoulder firmly, pulling him away with urgency. As they step away from the railing, Cal suddenly makes a quick decision and grabs Lovejoy's gun from its holster, charging aggressively toward the stairs, pulling Rose away as she and Jack make their escape, with Cal tearing down the stairs in hot pursuit."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Lovejoy's face contorts into a scowl as he trails behind Cal, who strides purposefully through the bridge, their movements synchronized as they brush past an officer without breaking stride. Meanwhile, Ismay stands by the collapsible lifeboat, his eyes darting to a crowd of passengers gathered on the lower side of the bridge, before he shifts his focus back to the collapsible. As Murdoch turns his attention elsewhere, Ismay seizes the opportunity to discreetly slip into a seat on the collapsible, while Murdoch's gaze inadvertently lands on his mate, who is staring intently ahead. Murdoch's expression hardens into a glower directed at his mate, as he gestures downward with both arms, signaling the seamen to lower the collapsible. As the lifeboat begins its descent below the deck, Ismay's eyes flicker upward, catching a glimpse of the scene above. In a swift motion, Lightoller reaches out, gently grabbing a young girl and carefully placing her into a lifeboat. Nearby, Rose turns her attention to Jack, while Cal's eyes shift between Jack and Rose, assessing the situation. With a decisive motion, Cal removes the blanket wrapped around Rose and thrusts it toward Jack, before shrugging off his own coat and draping it over Rose's shoulders. He reaches out to caress Rose's hair, but she instinctively recoils from his touch, prompting Jack to step forward protectively. A crewman intervenes, taking hold of Rose and guiding her toward the lifeboat, while Jack, along with another crew member, assists her in climbing into the boat. As Rose settles into the lifeboat, she turns back, her hand reaching out to grasp Jack's outstretched hand, but a crewman pushes Jack back, and the lifeboat jerks as it begins to lower. Standing at the rail, Cal and Jack watch intently as Rose descends toward the water, her eyes locked on Jack's. Jack's gaze shifts from Cal to the descending lifeboat, while Rose's eyes scan her surroundings, taking in the ropes running through the pulleys, before returning her focus to Jack. In the lifeboat, Rose notices a young girl beside her waving to her father, while her sister cries, and a crew member on deck shouts orders, his arms raised in command. Rose's gaze returns to Jack, who stands beside Cal, as a flare suddenly shoots into the dark sky, momentarily illuminating Rose's face. More flares streak across the sky above Jack, casting brief flashes of light, and in a sudden, impulsive decision, Rose steps to the edge of the lifeboat, leaps from it, and clings to the ship's rail several decks below Jack. Two crew members quickly pull her back on board, and she takes off running along the deck, while Jack turns and races along the main deck, weaving past passengers and crew members. Rose continues her sprint along the lower deck, as Jack rushes inside, descending the grand staircase with urgency. At the bottom of the stairs, Rose collides into his arms, and they embrace tightly, sharing a passionate kiss before hugging each other closely. Overhead, Cal watches them from an upper landing, his expression unreadable. Lovejoy steps up to him, casting a glance downward, before grabbing Cal's shoulder and pulling him away from the scene. As they move away from the railing, Cal's hand darts to Lovejoy's holster, retrieving the gun, and he charges toward the stairs, intent on pursuing Rose and Jack, who are fleeing in haste, with Cal tearing down the stairs in hot pursuit."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Lovejoy scowls as he follows Cal through the bridge, brushing past an officer. Ismay stands by the collapsible, glancing at passengers below before slipping into a seat as Murdoch turns away. Murdoch glowers at his mate and signals the seamen to lower the collapsible. Meanwhile, Lightoller places a young girl in a lifeboat. Cal removes a blanket from Rose, hands it to Jack, and wraps his coat around Rose's shoulders, attempting to caress her hair, but she backs away. Jack steps up to Rose as a crewman guides her to the lifeboat, and Jack helps her climb in. As the lifeboat lowers, Rose and Jack exchange glances, with Rose looking around at the ropes and a young girl waving to her father. A crew member yells orders, and flares illuminate the sky. Suddenly, Rose leaps from the lifeboat, hangs from the ship's rail, and is pulled back on board. She runs along the deck while Jack rushes inside and down the grand staircase. At the bottom, they embrace and kiss. Cal watches from above, and Lovejoy pulls him away. Cal grabs Lovejoy's gun and chases after Rose and Jack as they flee down the stairs."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Lovejoy scowls as he follows Cal, who walks through the bridge on the Titanic, and they brush past an officer dressed in the White Star Line's distinctive navy blue uniform. Meanwhile, Ismay, the managing director of the White Star Line, stands by the collapsible lifeboat, glancing at a crowd of passengers on the lower side of the bridge before turning back to the emergency vessel. While Murdoch, the ship's First Officer tasked with loading lifeboats, turns away, Ismay slips into a seat on the collapsible, and Murdoch finds himself staring at his mate, a fellow officer, who gazes ahead. Murdoch glowers at his mate while motioning downward with both arms, signaling the seamen to lower the collapsible, and as it drops below the deck, Ismay glances up, perhaps second-guessing his decision. Lightoller, the ship's Second Officer known for his strict adherence to protocol, grabs a young girl and places her in a lifeboat. Rose turns to Jack, her fellow passenger and confidant during the voyage, while Cal, Rose's affluent and controlling fiancé, glances from Jack to Rose. Cal pulls off the blanket wrapped around Rose and shoves it at Jack before removing his own coat, a symbol of his wealth, and placing it around Rose's shoulders. He starts to caress Rose's hair, but she backs away from him, and Jack steps up to her, ready to defend her. A crewman, tasked with ensuring safety aboard the lifeboat, grabs Rose and guides her toward the lifeboat, and Jack, along with another crew member, helps Rose climb into the boat. Rose turns and grasps Jack's outstretched hand as the crewman pushes Jack back and the lifeboat jerks, signifying its descent. Standing at the rail, Cal and Jack gaze at Rose as the lifeboat lowers toward the frigid Atlantic waters, and Rose stares back at Jack, torn between two worlds. Jack looks from Cal, his rival for Rose's affection, to the descending boat, while Rose looks around, up at the ropes running through the pulleys, a critical part of the lifeboat's lowering mechanism, and back at Jack. Rose sees a young girl next to her waving to her father while her sister cries, as a crew member on deck yells orders with arms raised out at his sides, trying to maintain order amidst the chaos. Rose gazes back up at Jack, who stands beside Cal, as another flare, a distress signal for nearby ships, shoots into the dark sky above them and briefly illuminates Rose's face. More streaking flares cascade in the sky above Jack as the Titanic sends out SOS signals, and suddenly Rose, driven by her determination, steps to the edge of the lifeboat, leaps from it, and hangs from the ship's rail several decks below Jack. Two crew members pull her on board, ensuring her safety, and she runs along the deck, searching for Jack, while Jack turns and runs along the main deck, past passengers intent on survival and crew members scrambling to maintain order. Rose runs along the lower deck, as Jack rushes inside and runs down the grand staircase, the opulent centerpiece of the ship. At the bottom of the stairs, Rose runs into his arms, and they embrace, kiss, and then hug, a reunion in the face of disaster. Cal gazes down at them from an upper landing, angered and frustrated. Stepping up to him, Lovejoy, Cal's valet and confidant, glances down, grabs Cal's shoulder, and pulls him away, knowing the severity of their situation. As they step away from the railing, Cal grabs Lovejoy's gun from its holster, an act of desperation, and runs toward the stairs, pulling Rose away as Rose and Jack flee, determined to escape the sinking ship, and Cal tears down the stairs after them, a man driven by jealousy and fear."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Lovejoy scowls as he follows Cal who walks through the bridge and they brush past an officer. Meanwhile Ismay stands by the collapsible and glances at a crowd of passengers on the lower side of the bridge before turning back to the collapsible. While Murdoch turns away Ismay slips into a seat on the collapsible and Murdoch finds himself staring at his mate who gazes ahead. Murdoch glowers at his mate while motioning downward with both arms. The seamen lower the collapsible and as it drops below the deck Ismay glances up. Lightoller grabs a young girl and places her in a lifeboat. Rose turns to Jack while Cal glances from Jack to Rose. Cal pulls off the blanket wrapped around Rose and shoves it at Jack before removing his own coat and placing it around Rose's shoulders. He starts to caress Rose's hair but she backs away from him and Jack steps up to her. A crewman grabs Rose and guides her toward the lifeboat and Jack along with another crew member helps Rose climb into the boat. Rose turns and grasps Jack's outstretched hand as the crewman pushes Jack back and the lifeboat jerks. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Standing at the rail Cal and Jack gaze at Rose as the lifeboat lowers toward the water and Rose stares back at Jack. Jack looks from Cal to the descending boat while Rose looks around up at the ropes running through the pulleys and back at Jack. Rose sees a young girl next to her waving to her father while her sister cries as a crew member on deck yells orders with arms raised out at his sides. Rose gazes back up at Jack who stands beside Cal as another flare shoots into the dark sky above them and briefly illuminates Rose's face. More streaking flares cascade in the sky above Jack and suddenly Rose steps to the edge of the lifeboat leaps from it and hangs from the ship's rail several decks below Jack. Two crew members pull her on board and she runs along the deck while Jack turns and runs along the main deck past passengers and crew members. Rose runs along the lower deck as Jack rushes inside and runs down the grand staircase. At the bottom of the stairs Rose runs into his arms and they embrace kiss and then hug. Cal gazes down at them from an upper landing. Stepping up to him. Lovejoy glances down grabs Cal's shoulder and pulls him away. As they step away from the railing Cal grabs Lovejoy's gun from its holster and runs toward the stairs pulling Rose away as Rose and Jack flee and Cal tears down the stairs after them."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Lovejoy scowls as he follows Cal who walks through the bridge and they brush past an officer. Meanwhile Ismay stands by the collapsible and glances at a crowd of passengers on the lower side of the bridge before turning back to the collapsible. While Murdoch turns away Ismay slips into a seat on the collapsible and Murdoch finds himself staring at his mate who gazes ahead. Murdoch glowers at his mate while motioning downward with both arms. The seamen lower the collapsible and as it drops below the deck Ismay glances up. Lightoller grabs a young girl and places her in a lifeboat. Rose turns to Jack while Cal glances from Jack to Rose. Cal pulls off the blanket wrapped around Rose and shoves it at Jack before removing his own coat and placing it around Rose's shoulders. He starts to caress Rose's hair but she backs away from him and Jack steps up to her. A crewman grabs Rose and guides her toward the lifeboat and Jack along with another crew member helps Rose climb into the boat. Rose turns and grasps Jack's outstretched hand as the crewman pushes Jack back and the lifeboat jerks. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Standing at the rail Cal and Jack gaze at Rose as the lifeboat lowers toward the water and Rose stares back at Jack. Jack looks from Cal to the descending boat while Rose looks around up at the ropes running through the pulleys and back at Jack. Rose sees a young girl next to her waving to her father while her sister cries as a crew member on deck yells orders with arms raised out at his sides. Rose gazes back up at Jack who stands beside Cal as another flare shoots into the dark sky above them and briefly illuminates Rose's face. More streaking flares cascade in the sky above Jack and suddenly Rose steps to the edge of the lifeboat leaps from it and hangs from the ship's rail several decks below Jack. Two crew members pull her on board and she runs along the deck while Jack turns and runs along the main deck past passengers and crew members. Rose runs along the lower deck as Jack rushes inside and runs down the grand staircase. At the bottom of the stairs Rose runs into his arms and they embrace kiss and then hug. Cal gazes down at them from an upper landing. Stepping up to him. Lovejoy glances down grabs Cal's shoulder and pulls him away. As they step away from the railing Cal grabs Lovejoy's gun from its holster and runs toward the stairs pulling Rose away as Rose and Jack flee and Cal tears down the stairs after them."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Lovejoy scowls as he follows Cal who walks through the bridge and they brush past an officer. Meanwhile Ismay stands by the collapsible and glances at a crowd of passengers on the lower side of the bridge before turning back to the collapsible. While Murdoch turns away Ismay slips into a seat on the collapsible and Murdoch finds himself staring at his mate who gazes ahead. Murdoch glowers at his mate while motioning downward with both arms. The seamen lower the collapsible and as it drops below the deck Ismay glances up. Lightoller grabs a young girl and places her in a lifeboat. Rose runs along the lower deck as Jack rushes inside and runs down the grand staircase. At the bottom of the stairs Rose runs into his arms and they embrace kiss and then hug. Cal gazes down at them from an upper landing. Stepping up to him. Lovejoy glances down grabs Cal's shoulder and pulls him away. As they step away from the railing Cal grabs Lovejoy's gun from its holster and runs toward the stairs pulling Rose away as Rose and Jack flee and Cal tears down the stairs after them."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Lovejoy scowls as he follows Cal who walks through the bridge and they brush past an officer. Meanwhile Ismay stands by the collapsible and glances at a crowd of passengers on the lower side of the bridge before turning back to the collapsible. Stepping up to him. Lovejoy glances down grabs Cal's shoulder and pulls him away. As they step away from the railing Cal grabs Lovejoy's gun from its holster and runs toward the stairs pulling Rose away as Rose and Jack flee and Cal tears down the stairs after them."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Archibald chuckles as he trails behind Maxine, who dances through the jungle, and they stumble past a fisherman. Meanwhile, Victor lounges by the hammock and squints at a gathering of tourists on the upper side of the jungle before turning back to the hammock. While Thompson spins around, Victor sinks into a bench on the hammock, and Thompson finds himself glaring at his neighbor who peeks forward. Thompson smirks at his neighbor while gesturing upward with both legs. The hikers hoist up the hammock, and as it rises above the platform, Victor peers down. Hathaway snatches a tiny puppy and places it in a basket. Lily spins to Fred, while Maxine peers from Fred to Lily. Maxine tugs off the scarf draped around Lily and flings it at Fred before slipping out of her own hat and balancing it on Lily's head. He starts to pat Lily's shoulder, but she steps away from him, and Fred strides over to her. A farmer snatches Lily and guides her toward the basket, and Fred, along with another farmer, assists Lily in climbing into the basket. Lily turns and clutches Fred's extended shoulder as the farmer swats Fred away and the basket swings. Squatting at the fence, Maxine and Fred gaze at Lily as the basket rises toward the sky, and Lily gawks back at Fred. Fred peers from Maxine to the ascending basket, while Lily looks around, down at the vines hanging from the treetops, and back at Fred. Lily spots a tiny puppy beside her barking at her father while her brother laughs, as a farmer in the jungle shouts instructions with legs extended upward. Lily peeks back down at Fred, who crouches beside Maxine, as another sparkler shoots into the bright ocean above them and briefly brightens Lily's chin. More glittering sparklers streak in the ocean above Fred, and abruptly Lily steps to the side of the basket, vaults from it, and dangles from the jungle's vine several treetops above Fred. Two farmers tug her aboard, and she hurries along the treetops while Fred spins and hurries along the main treetops, past tourists and farmers. Lily speeds along the upper treetop, as Fred dashes outside and sprints up the narrow pathway. At the top of the path, Lily crashes into his embrace, and they chuckle, greet, and then shake hands. Maxine stares up at them from a lower pathway. Stepping down to her, Archibald squints up, grabs Maxine's backpack, and nudges her aside. As they jog away from the fence, Maxine snatches Archibald's umbrella from its sleeve and races toward the path, pulling Lily aside as Lily and Fred escape and Maxine sprints up the path after them."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Lovejoy follows Cal across the bridge, passing an officer. Ismay, standing by a collapsible, sits in it as seamen lower the boat. Meanwhile, Lightoller places a young girl in a lifeboat. Cal removes a blanket from Rose and gives it to Jack, then puts his coat around Rose. Cal tries to caress Rose's hair, but she backs away to Jack. A crewman guides Rose to a lifeboat, assisted by Jack and another crew member. As the lifeboat lowers, Rose grasps Jack's hand before being pulled away. On the deck, flares illuminate the scene as Rose sees a young girl nearby. Suddenly, Rose leaps from the lifeboat and climbs back aboard, running along the deck. Jack rushes inside and down the staircase, meeting Rose in a tight embrace at the bottom. They kiss while Cal watches from above. Lovejoy pulls Cal away, but Cal grabs Lovejoy's gun and pursues Jack and Rose as they flee."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As they step away from the railing Cal grabs Lovejoy's gun from its holster and runs toward the stairs pulling Rose away as Rose and Jack flee and Cal tears down the stairs after them Lovejoy glances down grabs Cal's shoulder and pulls him away  Stepping up to him  Cal gazes down at them from an upper landing  At the bottom of the stairs Rose runs into his arms and they embrace kiss and then hug  Rose runs along the lower deck as Jack rushes inside and runs down the grand staircase  Two crew members pull her on board and she runs along the deck while Jack turns and runs along the main deck past passengers and crew members  More streaking flares cascade in the sky above Jack and suddenly Rose steps to the edge of the lifeboat leaps from it and hangs from the ship's rail several decks below Jack  Rose gazes back up at Jack who stands beside Cal as another flare shoots into the dark sky above them and briefly illuminates Rose's face  Rose sees a young girl next to her waving to her father while her sister cries as a crew member on deck yells orders with arms raised out at his sides  Jack looks from Cal to the descending boat while Rose looks around up at the ropes running through the pulleys and back at Jack  Standing at the rail Cal and Jack gaze at Rose as the lifeboat lowers toward the water and Rose stares back at Jack  Rose turns and grasps Jack's outstretched hand as the crewman pushes Jack back and the lifeboat jerks  A crewman grabs Rose and guides her toward the lifeboat and Jack along with another crew member helps Rose climb into the boat  He starts to caress Rose's hair but she backs away from him and Jack steps up to her  Cal pulls off the blanket wrapped around Rose and shoves it at Jack before removing his own coat and placing it around Rose's shoulders  Rose turns to Jack while Cal glances from Jack to Rose  Lightoller grabs a young girl and places her in a lifeboat  The seamen lower the collapsible and as it drops below the deck Ismay glances up  Murdoch glowers at his mate while motioning downward with both arms  While Murdoch turns away Ismay slips into a seat on the collapsible and Murdoch finds himself staring at his mate who gazes ahead  Meanwhile Ismay stands by the collapsible and glances at a crowd of passengers on the lower side of the bridge before turning back to the collapsible  Lovejoy scowls as he follows Cal who walks through the bridge and they brush past an officer "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Meanwhile Ismay stands by the collapsible and glances at a crowd of passengers on the lower side of the bridge before turning back to the collapsible Lovejoy scowls as he follows Cal who walks through the bridge and they brush past an officer Murdoch glowers at his mate while motioning downward with both arms While Murdoch turns away Ismay slips into a seat on the collapsible and Murdoch finds himself staring at his mate who gazes ahead Lightoller grabs a young girl and places her in a lifeboat The seamen lower the collapsible and as it drops below the deck Ismay glances up Cal pulls off the blanket wrapped around Rose and shoves it at Jack before removing his own coat and placing it around Rose's shoulders Rose turns to Jack while Cal glances from Jack to Rose A crewman grabs Rose and guides her toward the lifeboat and Jack along with another crew member helps Rose climb into the boat He starts to caress Rose's hair but she backs away from him and Jack steps up to her Standing at the rail Cal and Jack gaze at Rose as the lifeboat lowers toward the water and Rose stares back at Jack Rose turns and grasps Jack's outstretched hand as the crewman pushes Jack back and the lifeboat jerks Rose sees a young girl next to her waving to her father while her sister cries as a crew member on deck yells orders with arms raised out at his sides Jack looks from Cal to the descending boat while Rose looks around up at the ropes running through the pulleys and back at Jack More streaking flares cascade in the sky above Jack and suddenly Rose steps to the edge of the lifeboat leaps from it and hangs from the ship's rail several decks below Jack Rose gazes back up at Jack who stands beside Cal as another flare shoots into the dark sky above them and briefly illuminates Rose's face Rose runs along the lower deck as Jack rushes inside and runs down the grand staircase Two crew members pull her on board and she runs along the deck while Jack turns and runs along the main deck past passengers and crew members Cal gazes down at them from an upper landing At the bottom of the stairs Rose runs into his arms and they embrace kiss and then hug Lovejoy glances down grabs Cal's shoulder and pulls him away Stepping up to him As they step away from the railing Cal grabs Lovejoy's gun from its holster and runs toward the stairs pulling Rose away as Rose and Jack flee and Cal tears down the stairs after them"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Jack looks from Cal to the descending boat while Rose looks around up at the ropes running through the pulleys and back at Jack  Rose sees a young girl next to her waving to her father while her sister cries as a crew member on deck yells orders with arms raised out at his sides  Rose gazes back up at Jack who stands beside Cal as another flare shoots into the dark sky above them and briefly illuminates Rose's face  More streaking flares cascade in the sky above Jack and suddenly Rose steps to the edge of the lifeboat leaps from it and hangs from the ship's rail several decks below Jack  Two crew members pull her on board and she runs along the deck while Jack turns and runs along the main deck past passengers and crew members  Rose runs along the lower deck as Jack rushes inside and runs down the grand staircase  At the bottom of the stairs Rose runs into his arms and they embrace kiss and then hug  Cal gazes down at them from an upper landing  Stepping up to him  Lovejoy glances down grabs Cal's shoulder and pulls him away  As they step away from the railing Cal grabs Lovejoy's gun from its holster and runs toward the stairs pulling Rose away as Rose and Jack flee and Cal tears down the stairs after them Lovejoy scowls as he follows Cal who walks through the bridge and they brush past an officer  Meanwhile Ismay stands by the collapsible and glances at a crowd of passengers on the lower side of the bridge before turning back to the collapsible  While Murdoch turns away Ismay slips into a seat on the collapsible and Murdoch finds himself staring at his mate who gazes ahead  Murdoch glowers at his mate while motioning downward with both arms  The seamen lower the collapsible and as it drops below the deck Ismay glances up  Lightoller grabs a young girl and places her in a lifeboat  Rose turns to Jack while Cal glances from Jack to Rose  Cal pulls off the blanket wrapped around Rose and shoves it at Jack before removing his own coat and placing it around Rose's shoulders  He starts to caress Rose's hair but she backs away from him and Jack steps up to her  A crewman grabs Rose and guides her toward the lifeboat and Jack along with another crew member helps Rose climb into the boat  Rose turns and grasps Jack's outstretched hand as the crewman pushes Jack back and the lifeboat jerks  Standing at the rail Cal and Jack gaze at Rose as the lifeboat lowers toward the water and Rose stares back at Jack "
        }
      ]
    }
  ]
}