{
  "ground_truth": "A viola player glances back, then returns and joins him. The bass player carries his bass back, then stands on the other side of Hartley. The cello player also returns. Captain Smith stares across the wheelhouse. He gazes through a window at the rising water, then places one hand on the helm. Water pours in beneath the door. In the smoking room, Andrews checks his pocket watch as the glass slides off the mantel. He opens the clock on the mantel and adjusts the time. He shuts the clock, then leans against the mantel, gazing downward. An elderly couple lies in bed as water streams beneath them. The man kisses the woman. A red-haired woman leans over two young children lying in a bed. The children sleep. Elsewhere, a Degas painting of a woman wearing a long tutu floats beneath water. On deck, people run past the band. People scramble about. Fabrizio unties the lifebelt on Tommy's body. People rush away from the rising water. The girl in Cal's arms looks around herself, wide-eyed. People work to right the overturned lifeboat. One sailor slides down a rope. Fabrizio puts on the lifebelt as water surges around him. Water rushes over the listing ship, causing some people to fall into the water. Fabrizio opens the knife and Cal backs away from the rushing water. Fabrizio and others try to cut the ropes. Inside, people slip and fall near the Grand Staircase. Guggenheim, wearing a top hat and formal wear, sits in a chair, watching with wide eyes. Outside, people fall into the water as others run up the deck from the approaching water. In the wheelhouse, Smith stares wide-eyed as water covers the glass windows. Outside, on one of the decks, passengers wade through waist-deep water toward the lifeboat in the middle of the ship. Fabrizio slices through the rope with his pocket knife, partially freeing the boat but causing it to tip onto its side. Cal climbs onto the high side of the capsizing lifeboat. Railings pull themselves onto pieces of floating debris. Several people run toward the back end of the Titanic, which is now tilted up at a slight angle. Some passengers hang from ropes or leap into the icy sea. Jack and Rose make their way to a railing near the rear of the ship and turn back. Jack grabs Rose's hand and runs through the crowd. They make their way to the crowd. Water swamps the base of the first funnel as it sinks below the ocean's surface. Inside the ship, seawater floods the grand staircase. Passengers and crew grab onto anything they can as the water rises. Jack climbs over a railing and helps Rose climb over.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A violist glances back, then returns and joins him. The bassist carries his contrabass back, then stands on the other side of Hartley. The cellist also returns. Captain Smith stares across the wheelhouse. He gazes through a window at the rising water, then places one hand on the helm. Water pours in beneath the door. In the smoking room, Andrews checks his pocket chronometer as the glass slides off the mantelpiece. He opens the clock on the mantelpiece and adjusts the time. He shuts the clock, then leans against the mantelpiece, gazing downward. An elderly couple lies in bed as water streams beneath them. The man kisses the woman. A red-haired lady leans over two young children lying in a bed. The children slumber. Elsewhere, a Degas painting of a lady wearing a long tutu floats beneath water. On deck, people run past the ensemble. People scramble about. Fabrizio unties the lifebelt on Tommy's body. People rush away from the rising water. The girl in Cal's arms looks around herself, wide-eyed. People work to right the overturned lifeboat. One sailor slides down a rope. Fabrizio dons the lifebelt as water surges around him. Water rushes over the listing vessel, causing some people to fall into the water. Fabrizio opens the dagger and Cal backs away from the rushing water. Fabrizio and others try to cut the cords. Inside, people slip and fall near the Grand Staircase. Guggenheim, wearing a top hat and formal attire, sits in a chair, watching with wide eyes. Outside, people fall into the water as others run up the deck from the approaching water. In the wheelhouse, Smith stares wide-eyed as water covers the glass windows. Outside, on one of the decks, passengers wade through waist-deep water toward the lifeboat in the middle of the vessel. Fabrizio slices through the cord with his pocket dagger, partially freeing the boat but causing it to tip onto its side. Cal climbs onto the high side of the capsizing lifeboat. Railings pull themselves onto pieces of floating debris. Several people run toward the back end of the Titanic, which is now tilted up at a slight angle. Some passengers hang from cords or leap into the icy sea. Jack and Rose make their way to a railing near the rear of the vessel and turn back. Jack grabs Rose's hand and runs through the crowd. They make their way to the crowd. Water swamps the base of the first funnel as it sinks below the ocean's surface. Inside the vessel, seawater floods the grand staircase. Passengers and crew grab onto anything they can as the water rises. Jack climbs over a railing and helps Rose climb over."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A viola player is glanced back at, then he is joined by her. His bass is carried back by the bass player, then the bass player stands on the other side of Hartley. The cello player is also returned by someone. The wheelhouse is stared across by Captain Smith. A window is gazed through by him at the rising water, then one hand is placed on the helm by him. Beneath the door, water is poured in. In the smoking room, his pocket watch is checked by Andrews as the glass is slid off the mantel. The clock on the mantel is opened by him, and the time is adjusted by him. The clock is shut by him, then the mantel is leaned against as he gazes downward. An elderly couple are lied in bed by themselves as water is streamed beneath them. The woman is kissed by the man. Two young children lying in a bed are leaned over by a red-haired woman. They are slept by the children. Elsewhere, beneath water, a woman wearing a long tutu by Degas is floated as a painting. On deck, the band is run past by people. About, people scramble. The lifebelt on Tommy's body is untied by Fabrizio. From the rising water, people rush away. Around herself, the girl in Cal's arms is looked by her, wide-eyed. To right the overturned lifeboat, people work. Down a rope, one sailor slides. The lifebelt is put on by Fabrizio as water is surged around him. Over the listing ship, water is rushed by, causing some people to fall into the water. The knife is opened by Fabrizio and the rushing water is backed away from by Cal. By Fabrizio and others, the ropes are tried to be cut. Inside, near the Grand Staircase, slipping and falling people occur. A top hat and formal wear are worn by Guggenheim, as he sits in a chair, watching with wide eyes. Outside, into the water, people fall as the deck is run up by others from the approaching water. In the wheelhouse, the glass windows are covered with water as Smith stares wide-eyed. Outside, on one of the decks, waist-deep water is waded through by passengers toward the lifeboat in the middle of the ship. Through the rope, Fabrizio slices with his pocket knife, causing the boat to be partially freed but tipped onto its side. Onto the high side of the capsizing lifeboat, Cal climbs. Pieces of floating debris are pulled onto by railings. Toward the back end of the Titanic, which is now tilted up at a slight angle, several people run. From ropes or into the icy sea, passengers hang or leap. To a railing near the rear of the ship, Jack and Rose make their way and are turned back by them. Rose's hand is grabbed by Jack and the crowd is run through by them. Their way is made by them to the crowd. The base of the first funnel is swamped by water as it is sunk below the ocean's surface. Inside the ship, the grand staircase is flooded by seawater. Onto anything they can, passengers and crew grab as the water rises. Over a railing, Jack climbs and Rose is helped to climb over by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A viola player glances back and joins him. The bass player returns with his bass and stands by Hartley. The cello player also comes back. Captain Smith stares through the wheelhouse window at rising water and places a hand on the helm as water pours beneath the door. In the smoking room, Andrews checks his pocket watch, adjusts the mantel clock, and leans against it, gazing down. An elderly couple lies in bed, kissed as water streams beneath them. A red-haired woman leans over two sleeping children. A Degas painting of a woman in a tutu floats in the water. On deck, people rush past the band, scrambling away from rising water. Fabrizio unties a lifebelt on Tommy's body. A girl in Cal's arms looks around wide-eyed. People try to right an overturned lifeboat; a sailor slides down a rope. Fabrizio dons the lifebelt as water surges. Water rushes over the listing ship, causing people to fall. Fabrizio cuts ropes with a knife as Cal backs away. People slip near the Grand Staircase. Guggenheim, in a top hat and formal wear, watches wide-eyed. Outside, people fall into water while others run up the deck from rising water. In the wheelhouse, Smith stares as water covers the windows. On one deck, passengers wade through waist-deep water toward a lifeboat. Fabrizio slices through rope, tipping the boat. Cal climbs onto the high side of the lifeboat. Railings pull onto debris. People run toward the back of the tilted Titanic, some hanging or leaping into the sea. Jack and Rose find a railing near the rear, turning back. Jack grabs Rose's hand, running through the crowd. Water swamps the base of the first funnel, sinking below the ocean. Inside, seawater floods the grand staircase as passengers and crew cling to anything. Jack climbs a railing, helping Rose over."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A viola player returns and joins him. The bass player stands beside Hartley. The cello player also returns. Captain Smith gazes at the rising water, placing a hand on the helm as water pours beneath the door. In the smoking room, Andrews adjusts the clock after checking his watch. An elderly couple lies in bed, water streaming beneath, and the man kisses the woman. A red-haired woman leans over two sleeping children. A Degas painting floats underwater. On deck, chaos ensues: people run past the band, Fabrizio unties a lifebelt on Tommy's body, and people rush from rising water. A girl in Cal's arms looks around. People work to right an overturned lifeboat; a sailor slides down a rope. Fabrizio dons a lifebelt as water surges. Water rushes over the ship, causing falls. Fabrizio opens a knife, and Cal retreats from the water. Fabrizio and others cut ropes. Inside, people slip near the Grand Staircase. Guggenheim, in formal wear, watches wide-eyed. Outside, people fall into the water and run from rising water. Smith stares as water covers wheelhouse windows. Passengers wade through waist-deep water to a lifeboat. Fabrizio cuts a rope, causing the lifeboat to tip. Cal climbs the high side. Jack and Rose reach a railing near the ship's rear, grabbing hands and running through the crowd. Water swamps the first funnel, sinking it. Inside, seawater floods; passengers and crew cling to anything as water rises. Jack climbs a railing, helping Rose over."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A dedicated viola player, with a brief glance backward, soon turns around and rejoins him. Meanwhile, the bass player, carrying his instrument back with a purposeful stride, stands resolutely on the opposite side of Hartley. Not long after, the cello player makes his way back as well. In the wheelhouse, Captain Smith fixes his gaze across the room, looking intently through a window at the ominously rising water before him. He then firmly places one hand on the helm. Water begins to pour in forcefully underneath the door. In the nearby smoking room, Andrews, with a calm demeanor, checks his pocket watch just as a glass slides precariously off the mantel. He takes a moment to open the clock on the mantelpiece, adjusting the time with a careful, meticulous touch. After shutting the clock, he leans thoughtfully against the mantel, his eyes gazing downward in contemplation. Elsewhere, an elderly couple lies serenely in bed as water quietly streams beneath them. The man tenderly kisses the woman beside him. A red-haired woman bends protectively over two young children peacefully sleeping in a bed. Meanwhile, a Degas painting, depicting a woman elegantly dressed in a long tutu, floats gently beneath the water. On the deck, urgency fills the air as people sprint past the band, scrambling in all directions. Fabrizio, determined and focused, unties the lifebelt secured on Tommy's still form. Chaos ensues as people rush frantically away from the increasingly rising water. The young girl in Cal's arms looks around with wide, frightened eyes. Onlookers work tirelessly to right the overturned lifeboat, while a sailor daringly slides down a rope. Fabrizio quickly puts on the lifebelt as water surges menacingly around him. A torrent of water rushes over the listing ship, causing numerous individuals to fall helplessly into the icy water. Fabrizio, with urgency, opens the knife in his hand, prompting Cal to back away from the rushing water. Fabrizio and others desperately try to cut the ropes tethering the lifeboat. Inside, chaos reigns as people slip and fall near the majestic Grand Staircase. Guggenheim, adorned in a top hat and formal attire, sits in a chair, watching with wide-eyed disbelief. Outside, amidst the panic, people plunge into the water while others sprint up the deck, escaping the advancing water. In the wheelhouse, Smith stands frozen, his eyes wide with alarm as water envelops the glass windows. Outside, on one of the ship's decks, passengers wade through waist-deep water, making their way determinedly toward the central lifeboat. Fabrizio swiftly slices through the rope with his pocket knife, partially freeing the boat but causing it to tilt precariously onto its side. Cal climbs onto the high side of the capsizing lifeboat. Railings pull themselves onto nearby pieces of floating debris. Several people sprint energetically toward the back end of the Titanic, which is now ominously tilted upward at a slight angle. Some passengers cling desperately to ropes or bravely leap into the frigid sea below. Jack and Rose navigate their way to a railing near the rear of the ship, then turn back together. Jack firmly grabs Rose's hand, and they run together through the bustling crowd. They maneuver skillfully through the throng. Water engulfs the base of the first funnel as it inexorably sinks below the ocean's chilling surface. Inside the ship, seawater floods the grand staircase with unrelenting force. Passengers and crew members cling desperately to anything they can grasp as the water level rises unstoppably. Jack climbs determinedly over a railing, assisting Rose to follow as a sense of urgency envelops them."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A committed and dedicated viola player, after casting a brief, momentary glance backward to where he had been, promptly turns around and rejoins him, returning to his place beside his fellow musicians. Meanwhile, the bass player, with his instrument in tow and carrying it back with a measured, purposeful stride, stands resolutely on the opposite side of Hartley, maintaining his position with determination. Not long after this, the cello player also makes his way back, joining the others once more. In the wheelhouse, Captain Smith fixes his gaze steadily across the room, looking intently through a window at the ominous sight of the rising water before him. He then firmly places one hand on the smooth surface of the helm. Water begins to pour in forcefully underneath the door, signaling the impending disaster. In the nearby smoking room, Andrews, maintaining a calm and composed demeanor, checks his pocket watch just as a glass slides precariously off the mantel. He takes a moment to methodically open the clock on the mantelpiece, adjusting the time with a careful and meticulous touch. After shutting the clock with precision, he leans thoughtfully against the mantel, his eyes gazing downward in contemplation and introspection. Elsewhere, an elderly couple lies serenely in bed, undisturbed as water quietly streams beneath them. The man tenderly kisses the woman beside him, a gesture of comfort. Meanwhile, a red-haired woman bends protectively over two young children, peacefully sleeping in a bed. In a different part of the ship, a Degas painting, depicting a woman elegantly dressed in a long, flowing tutu, floats gently beneath the water as the ship continues to sink. On the deck, urgency fills the air as people sprint past the band, scrambling in all directions in a desperate attempt to find safety. Fabrizio, determined and focused, unties the lifebelt securely fastened around Tommy's still form. Chaos ensues as people rush frantically away from the increasingly rising water, each one seeking refuge. The young girl in Cal's arms looks around with wide, frightened eyes, witnessing the unfolding chaos. Onlookers work tirelessly to right the overturned lifeboat, while a sailor daringly slides down a rope. Fabrizio quickly puts on the lifebelt as water surges menacingly around him, threatening to engulf everyone nearby. A torrent of water rushes over the listing ship, causing numerous individuals to fall helplessly into the icy water below. Fabrizio, acting with urgency, opens the knife in his hand, prompting Cal to back away from the rushing water with caution. Fabrizio and others desperately try to cut the ropes tethering the lifeboat, their efforts frantic and filled with hope. Inside, chaos reigns as people slip and fall near the majestic, ornate Grand Staircase. Guggenheim, adorned in a top hat and formal attire, sits in a chair, watching with wide-eyed disbelief, unable to comprehend the magnitude of what is happening. Outside, amidst the panic, people plunge into the water while others sprint up the deck, escaping the advancing water's relentless pursuit. In the wheelhouse, Smith stands frozen in place, his eyes wide with alarm as water envelops the glass windows, signaling impending doom. Outside, on one of the ship's decks, passengers wade through waist-deep water, making their way determinedly toward the central lifeboat, their resolve unwavering. Fabrizio swiftly slices through the rope with his pocket knife, partially freeing the boat but causing it to tilt precariously onto its side. Cal climbs onto the high side of the capsizing lifeboat, fighting for balance. Railings pull themselves onto nearby pieces of floating debris, adding to the surreal scene. Several people sprint energetically toward the back end of the Titanic, which is now ominously tilted upward at a slight angle. Some passengers cling desperately to ropes or bravely leap into the frigid sea below, hoping for survival. Jack and Rose navigate their way skillfully to a railing near the rear of the ship, then turn back together, united in their resolve. Jack firmly grabs Rose's hand, and they run together through the bustling crowd, their determination unyielding. They maneuver skillfully through the throng, avoiding obstacles in their path. Water engulfs the base of the first funnel as it inexorably sinks below the ocean's chilling surface, a sobering reminder of the ship's fate. Inside the ship, seawater floods the grand staircase with unrelenting force, creating an unstoppable flow. Passengers and crew members cling desperately to anything they can grasp as the water level rises unstoppably, threatening all in its path. Jack climbs determinedly over a railing, assisting Rose to follow, as a sense of urgency envelops them, driving their every action."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The viola player, after taking a brief glance backward, decides to return and join him with decisive steps, positioning herself beside him. Simultaneously, the bass player carefully carries his substantial instrument back to the group, then finds his place standing on the opposite side of Hartley, creating a balanced arrangement. The cello player makes a return as well, reinforcing the ensemble. At the same time, Captain Smith stands still, peering intensely across the wheelhouse. His gaze locks through a nearby window, absorbing the sight of the relentless rising water outside. With a decisive gesture, he places one hand firmly on the helm, an action punctuated by the alarming sight of water beginning to pour in beneath the door, encroaching into the space. Within the confines of the smoking room, Andrews methodically checks his pocket watch, noting the passing time, just as a glass precariously slides off the mantel, suggesting a sense of imminent chaos. He then opens the clock carefully mounted on the mantel and makes a precise adjustment to the time displayed, ensuring accuracy in the gripping moment. After this, he closes the clock with a finality, leaning against the mantel and directing his gaze downward with a somber concentration. Meanwhile, elsewhere, an elderly couple lies peacefully in bed as water flows beneath them; the man tenderly kisses the woman, a poignant moment amidst the chaos. A red-haired woman bends protectively over two young sleeping children nestled in a bed, ensuring their safety and comfort. In another part of the ship, a Degas painting, depicting a woman in a long tutu, drifts beneath the water, a silent testament to the cultural treasures affected by the disaster. On deck, urgency heightens as people sprint past the band, a scene of frantic haste as they scramble about. Fabrizio, responding to the crisis, busily unties the lifebelt strapped to Tommy’s body, acknowledging the rising threat. The girl in Cal’s arms, with curiosity and fear, scans her surroundings, her wide eyes reflecting the turmoil. People feverishly work to right an overturned lifeboat, a struggle against the tilting odds, while one sailor skillfully slides down a rope to aid in the effort. Fabrizio quickly dons the lifebelt, a crucial act performed as water surges threateningly around him. Water cascades over the ship, causing people to lose their footing and tumble into the ocean. Fabrizio opens a knife, its blade glinting in the tension-filled air, while Cal instinctively retreats from the advancing water, aware of the danger. Fabrizio, along with others, makes a concerted effort to cut through the ropes, their survival hinging on this desperate task. Inside, chaos ensues as people struggle to maintain their balance on the slippery floor near the Grand Staircase, the scene one of panic and fear. Guggenheim, distinguished in his top hat and formal wear, sits with dignity, watching the unfolding scene with wide eyes, a silent observer to the disaster. Outside, more people, overwhelmed by the situation, fall into the water as others desperately run up the deck to escape the encroaching waves. In the wheelhouse, Smith’s eyes widen in horror as water violently covers the glass windows, a harrowing view confirming the severity of the situation. On another deck, passengers wade determinedly through waist-deep water, attempting to reach the lifeboat positioned centrally on the ship. Fabrizio slices through the rope with precision using his pocket knife, aiming to free the boat; yet, this action causes it to tip precariously onto its side. As events progress, Cal climbs onto the higher side of the capsizing lifeboat, seeking stability amidst the turmoil. Railings, carried by the surge, find new homes on pieces of floating debris. Meanwhile, several desperate individuals sprint toward the aft of the Titanic, which now ominously tilts at a slight angle, signaling its impending fate. Some passengers helplessly dangle from ropes or take their chances by leaping into the icy sea below. In this chaos, Jack and Rose navigate with determination to a nearby railing toward the rear of the ship, taking a moment to turn back. With resolve, Jack firmly grasps Rose’s hand, guiding her through the crowd as they make their way to safety. The water ominously inundates the base of the first funnel, submerging it below the ocean's merciless surface. Inside the ship, seawater relentlessly invades the grand staircase, an influx that prompts both passengers and crew to grab onto anything within reach as the water rapidly rises. In a final heroic effort, Jack climbs over a railing and extends a helping hand to assist Rose, ensuring her safety in the dire circumstances."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The viola player returns and joins a group, including the bass and cello players, around Hartley. Captain Smith gazes at the rising water through the wheelhouse window and places a hand on the helm as water enters beneath the door. In the smoking room, Andrews checks his pocket watch before adjusting the mantel clock. An elderly couple lies in bed, sharing a kiss as water streams beneath them, while a red-haired woman watches over two sleeping children. Nearby, a Degas painting floats submerged. On deck, a chaotic scene unfolds as people, including Fabrizio, scramble away from the rising water, working to right an overturned lifeboat. Amidst the chaos, Cal holds a wide-eyed girl and Fabrizio, now wearing a lifebelt, attempts to cut ropes with a pocket knife as water surges around. Inside, near the Grand Staircase, people slip amidst rising water, while outside, Guggenheim watches the unfolding drama and passengers wade through waist-deep water toward the lifeboat. Jack and Rose make their way to a railing at the rear of the ship, where Jack grabs Rose's hand and leads her through the crowd. Water swamps the base of the first funnel as the Titanic continues to sink, and inside, passengers and crew cling to anything sturdy amidst the flooding. Jack helps Rose climb over a railing to safety."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A viola player, part of the ship's orchestra determined to play until the end as a gesture of calm, glances back, then returns and joins him. The bass player, known for his deep, resonant notes that provided a backdrop to many elegant evenings, carries his bass back, then stands on the other side of Hartley, the bandleader renowned for his bravery. The cello player also returns, contributing to the group's poignant final performance. Captain Smith, the seasoned captain of the Titanic on its ill-fated maiden voyage, stares across the wheelhouse. He gazes through a window at the rising water, the deadly result of the iceberg collision, then places one hand on the helm. Water pours in beneath the door, a harbinger of the ship's inevitable fate. In the smoking room, Andrews, the ship's designer burdened with the failure of his creation, checks his pocket watch as the glass slides off the mantel. He opens the clock on the mantel and adjusts the time, perhaps in a final effort to maintain order amid chaos. He shuts the clock, then leans against the mantel, gazing downward, contemplating the tragedy unfolding. An elderly couple, who chose to stay together despite the danger, lies in bed as water streams beneath them. The man kisses the woman, a testament to their enduring love. A red-haired woman leans over two young children lying in a bed, protecting them as they sleep during the crisis. Elsewhere, a Degas painting of a woman wearing a long tutu, once part of the ship's luxurious art collection, floats beneath water. On deck, people run past the band, terrified but drawn by the music's haunting beauty. People scramble about as their fear escalates. Fabrizio, an Italian immigrant dreaming of a new life in America, unties the lifebelt on Tommy's body. People rush away from the rising water, an unstoppable force. The girl in Cal's arms looks around herself, wide-eyed, overwhelmed by the chaos. People work to right the overturned lifeboat, desperate for survival. One sailor slides down a rope in a last-ditch effort to escape. Fabrizio puts on the lifebelt as water surges around him, a final precaution as the ship sinks. Water rushes over the listing ship, causing some people to fall into the water, the icy Atlantic claiming more lives. Fabrizio opens the knife, a tool for self-preservation, and Cal backs away from the rushing water, driven by fear. Fabrizio and others try to cut the ropes to free the lifeboat. Inside, people slip and fall near the Grand Staircase, a once-opulent centerpiece now overtaken by water. Guggenheim, a wealthy American businessman, wearing a top hat and formal wear, sits in a chair, watching with wide eyes, resigned to his fate. Outside, people fall into the water as others run up the deck from the approaching water, the panic palpable. In the wheelhouse, Smith stares wide-eyed as water covers the glass windows, witnessing the end of his command. Outside, on one of the decks, passengers wade through waist-deep water toward the lifeboat in the middle of the ship, a beacon of hope amid despair. Fabrizio slices through the rope with his pocket knife, partially freeing the boat but causing it to tip onto its side, a precarious balance of survival. Cal climbs onto the high side of the capsizing lifeboat, clinging to a fleeting chance. Railings pull themselves onto pieces of floating debris, the remnants of a once-grand vessel. Several people run toward the back end of the Titanic, which is now tilted up at a slight angle, its stern rising ominously. Some passengers hang from ropes or leap into the icy sea, choosing immediate danger over certain doom. Jack and Rose, young lovers caught in the midst of disaster, make their way to a railing near the rear of the ship and turn back. Jack grabs Rose's hand and runs through the crowd, determined to stay together. They make their way to the crowd, moving with purpose amid panic. Water swamps the base of the first funnel as it sinks below the ocean's surface, a somber marker of the ship's demise. Inside the ship, seawater floods the grand staircase, a once-lavish setting now submerged. Passengers and crew grab onto anything they can as the water rises, fighting for survival in a sinking world. Jack climbs over a railing and helps Rose climb over, their partnership and resolve unwavering in the face of adversity."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He shuts the clock then leans against the mantel gazing downward A viola player glances back then returns and joins him The bass player carries his bass back then stands on the other side of Hartley The cello player also returns Captain Smith stares across the wheelhouse Water swamps the base of the first funnel as it sinks below the ocean's surface One sailor slides down a rope He gazes through a window at the rising water then places one hand on the helm Fabrizio slices through the rope with his pocket knife partially freeing the boat but causing it to tip onto its side Water pours in beneath the door In the smoking room Andrews checks his pocket watch as the glass slides off the mantel He opens the clock on the mantel and adjusts the time Some passengers hang from ropes or leap into the icy sea He shuts the clock then leans against the mantel gazing downward Water pours in beneath the door An elderly couple lies in bed as water streams beneath them Jack climbs over a railing and helps Rose climb over The man kisses the woman A redhaired woman leans over two young children lying in a bed The children sleep Elsewhere a Degas painting of a woman wearing a long tutu floats beneath water The bass player carries his bass back then stands on the other side of Hartley Cal climbs onto the high side of the capsizing lifeboat On deck people run past the band People work to right the overturned lifeboat In the wheelhouse Smith stares wideeyed as water covers the glass windows People scramble about On deck people run past the band Fabrizio unties the lifebelt on Tommy's body A viola player glances back then returns and joins him People rush away from the rising water The girl in Cal's arms looks around herself wideeyed People work to right the overturned lifeboat One sailor slides down a rope Fabrizio puts on the lifebelt as water surges around him Water rushes over the listing ship causing some people to fall into the water The cello player also returns Fabrizio opens the knife and Cal backs away from the rushing water Fabrizio and others try to cut the ropes Inside people slip and fall near the Grand Staircase He opens the clock on the mantel and adjusts the time People rush away from the rising water Guggenheim wearing a top hat and formal wear sits in a chair watching with wide eyes Outside people fall into the water as others run up the deck from the approaching water In the wheelhouse Smith stares wideeyed as water covers the glass windows Outside on one of the decks passengers wade through waistdeep water toward the lifeboat in the middle of the ship Fabrizio slices through the rope with his pocket knife partially freeing the boat but causing it to tip onto its side Cal climbs onto the high side of the capsizing lifeboat Railings pull themselves onto pieces of floating debris Several people run toward the back end of the Titanic which is now tilted up at a slight angle People scramble about Passengers and crew grab onto anything they can as the water rises Some passengers hang from ropes or leap into the icy sea Fabrizio unties the lifebelt on Tommy's body Jack and Rose make their way to a railing near the rear of the ship and turn back Outside people fall into the water as others run up the deck from the approaching water Jack grabs Rose's hand and runs through the crowd They make their way to the crowd Water swamps the base of the first funnel as it sinks below the ocean's surface Inside the ship seawater floods the grand staircase Passengers and crew grab onto anything they can as the water rises In the smoking room Andrews checks his pocket watch as the glass slides off the mantel Jack climbs over a railing and helps Rose climb over"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A viola player glances back then returns and joins him. The bass player carries his bass back then stands on the other side of Hartley. The cello player also returns. Captain Smith stares across the wheelhouse. He gazes through a window at the rising water then places one hand on the helm. Water pours in beneath the door. In the smoking room Andrews checks his pocket watch as the glass slides off the mantel. He opens the clock on the mantel and adjusts the time. He shuts the clock then leans against the mantel gazing downward. An elderly couple lies in bed as water streams beneath them. The man kisses the woman. A redhaired woman leans over two young children lying in a bed. The children sleep. Elsewhere a Degas painting of a woman wearing a long tutu floats beneath water. On deck people run past the band. People scramble about. Fabrizio unties the lifebelt on Tommy's body. People rush away from the rising water. The girl in Cal's arms looks around herself wideeyed. People work to right the overturned lifeboat. One sailor slides down a rope. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Fabrizio puts on the lifebelt as water surges around him. Water rushes over the listing ship causing some people to fall into the water. Fabrizio opens the knife and Cal backs away from the rushing water. Fabrizio and others try to cut the ropes. Inside people slip and fall near the Grand Staircase. Guggenheim wearing a top hat and formal wear sits in a chair watching with wide eyes. Outside people fall into the water as others run up the deck from the approaching water. In the wheelhouse Smith stares wideeyed as water covers the glass windows. Outside on one of the decks passengers wade through waistdeep water toward the lifeboat in the middle of the ship. Fabrizio slices through the rope with his pocket knife partially freeing the boat but causing it to tip onto its side. Cal climbs onto the high side of the capsizing lifeboat. Railings pull themselves onto pieces of floating debris. Several people run toward the back end of the Titanic which is now tilted up at a slight angle. Some passengers hang from ropes or leap into the icy sea. Jack and Rose make their way to a railing near the rear of the ship and turn back. Jack grabs Rose's hand and runs through the crowd. They make their way to the crowd. Water swamps the base of the first funnel as it sinks below the ocean's surface. Inside the ship seawater floods the grand staircase. Passengers and crew grab onto anything they can as the water rises. Jack climbs over a railing and helps Rose climb over."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A viola player glances back then returns and joins him. The bass player carries his bass back then stands on the other side of Hartley. The cello player also returns. Captain Smith stares across the wheelhouse. He gazes through a window at the rising water then places one hand on the helm. Water pours in beneath the door. In the smoking room Andrews checks his pocket watch as the glass slides off the mantel. He opens the clock on the mantel and adjusts the time. He shuts the clock then leans against the mantel gazing downward. An elderly couple lies in bed as water streams beneath them. The man kisses the woman. A redhaired woman leans over two young children lying in a bed. The children sleep. Elsewhere a Degas painting of a woman wearing a long tutu floats beneath water. On deck people run past the band. People scramble about. Fabrizio unties the lifebelt on Tommy's body. People rush away from the rising water. The girl in Cal's arms looks around herself wideeyed. People work to right the overturned lifeboat. One sailor slides down a rope. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Fabrizio puts on the lifebelt as water surges around him. Water rushes over the listing ship causing some people to fall into the water. Fabrizio opens the knife and Cal backs away from the rushing water. Fabrizio and others try to cut the ropes. Inside people slip and fall near the Grand Staircase. Guggenheim wearing a top hat and formal wear sits in a chair watching with wide eyes. Outside people fall into the water as others run up the deck from the approaching water. In the wheelhouse Smith stares wideeyed as water covers the glass windows. Outside on one of the decks passengers wade through waistdeep water toward the lifeboat in the middle of the ship. Fabrizio slices through the rope with his pocket knife partially freeing the boat but causing it to tip onto its side. Cal climbs onto the high side of the capsizing lifeboat. Railings pull themselves onto pieces of floating debris. Several people run toward the back end of the Titanic which is now tilted up at a slight angle. Some passengers hang from ropes or leap into the icy sea. Jack and Rose make their way to a railing near the rear of the ship and turn back. Jack grabs Rose's hand and runs through the crowd. They make their way to the crowd. Water swamps the base of the first funnel as it sinks below the ocean's surface. Inside the ship seawater floods the grand staircase. Passengers and crew grab onto anything they can as the water rises. Jack climbs over a railing and helps Rose climb over."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A viola player glances back then returns and joins him. The bass player carries his bass back then stands on the other side of Hartley. The cello player also returns. Captain Smith stares across the wheelhouse. He gazes through a window at the rising water then places one hand on the helm. Water pours in beneath the door. In the smoking room Andrews checks his pocket watch as the glass slides off the mantel. He opens the clock on the mantel and adjusts the time. He shuts the clock then leans against the mantel gazing downward. An elderly couple lies in bed as water streams beneath them. The man kisses the woman. Railings pull themselves onto pieces of floating debris. Several people run toward the back end of the Titanic which is now tilted up at a slight angle. Some passengers hang from ropes or leap into the icy sea. Jack and Rose make their way to a railing near the rear of the ship and turn back. Jack grabs Rose's hand and runs through the crowd. They make their way to the crowd. Water swamps the base of the first funnel as it sinks below the ocean's surface. Inside the ship seawater floods the grand staircase. Passengers and crew grab onto anything they can as the water rises. Jack climbs over a railing and helps Rose climb over."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A viola player glances back then returns and joins him. The bass player carries his bass back then stands on the other side of Hartley. The cello player also returns. Captain Smith stares across the wheelhouse. He gazes through a window at the rising water then places one hand on the helm. Water swamps the base of the first funnel as it sinks below the ocean's surface. Inside the ship seawater floods the grand staircase. Passengers and crew grab onto anything they can as the water rises. Jack climbs over a railing and helps Rose climb over."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A penguin glances back, then returns and joins the kangaroo. The giraffe carries his bass back, then stands on the other side of the rabbit. The hamster also returns. The astronaut stares across the wheelhouse. The astronaut gazes through a window at the rising water, then places one hand on the helm. Water pours in beneath the door. In the smoking room, the magician checks his pocket watch as the glass slides off the mantel. The magician opens the clock on the mantel and adjusts the time. The magician shuts the clock, then leans against the mantel, gazing downward. A lion and a zebra lie in bed as water streams beneath them. The lion kisses the zebra. A mermaid leans over two young children lying in a bed. The children sleep. Elsewhere, a Degas painting of an elf wearing a long tutu floats beneath water. On deck, aliens run past the band. Aliens scramble about. The dragon unties the lifebelt on the genie’s body. Aliens rush away from the rising water. The unicorn in the leprechaun's arms looks around herself, wide-eyed. Aliens work to right the overturned lifeboat. One pirate slides down a rope. The dragon puts on the lifebelt as water surges around him. Water rushes over the listing ship, causing some aliens to fall into the water. The dragon opens the knife and the leprechaun backs away from the rushing water. The dragon and others try to cut the ropes. Inside, aliens slip and fall near the Grand Staircase. The vampire, wearing a top hat and formal wear, sits in a chair, watching with wide eyes. Outside, aliens fall into the water as others run up the deck from the approaching water. In the wheelhouse, the astronaut stares wide-eyed as water covers the glass windows. Outside, on one of the decks, passengers wade through waist-deep water toward the lifeboat in the middle of the ship. The dragon slices through the rope with his pocket knife, partially freeing the boat but causing it to tip onto its side. The leprechaun climbs onto the high side of the capsizing lifeboat. Railings pull themselves onto pieces of floating debris. Several aliens run toward the back end of the Titanic, which is now tilted up at a slight angle. Some passengers hang from ropes or leap into the icy sea. A robot and a unicorn make their way to a railing near the rear of the ship and turn back. The robot grabs the unicorn's hand and runs through the crowd. They make their way to the crowd. Water swamps the base of the first funnel as it sinks below the ocean's surface. Inside the ship, seawater floods the grand staircase. Passengers and crew grab onto anything they can as the water rises. The robot climbs over a railing and helps the unicorn climb over."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A violinist glances back, then returns and joins him. The drummer carries his drums back, then stands on the other side of Hartley. The harpist also returns. Captain Smith stares across the cockpit. He gazes through a window at the approaching fog, then places one hand on the throttle. Mist pours in beneath the door. In the billiard room, Andrews checks his pocket watch as the sculpture slides off the pedestal. He opens the clock on the pedestal and adjusts the time. He shuts the clock, then leans against the pedestal, gazing downward. An elderly couple lies in bed as sand streams beneath them. The man kisses the woman. A red-haired woman leans over two young children lying in a bunk. The children sleep. Elsewhere, a Monet painting of a woman wearing a long dress floats beneath mist. On deck, people run past the band. People scramble about. Fabrizio unties the lifejacket on Tommy's body. People rush away from the rising fog. The girl in Cal's arms looks around herself, wide-eyed. People work to right the overturned dinghy. One sailor slides down a mast. Fabrizio puts on the lifejacket as mist surges around him. Fog rushes over the leaning ship, causing some people to fall into the mist. Fabrizio opens the wrench and Cal backs away from the rushing fog. Fabrizio and others try to cut the chains. Inside, people slip and fall near the Grand Ballroom. Guggenheim, wearing a bowler hat and evening wear, sits in a bench, watching with wide eyes. Outside, people fall into the mist as others run up the deck from the approaching fog. In the cockpit, Smith stares wide-eyed as mist covers the glass windows. Outside, on one of the decks, passengers wade through knee-deep mist toward the dinghy in the middle of the ship. Fabrizio slices through the chain with his pocket wrench, partially freeing the dinghy but causing it to tip onto its side. Cal climbs onto the high side of the capsizing dinghy. Railings pull themselves onto pieces of floating wood. Several people run toward the back end of the Titanic, which is now tilted up at a slight angle. Some passengers hang from masts or leap into the cloudy sea. Jack and Rose make their way to a railing near the rear of the ship and turn back. Jack grabs Rose's hand and runs through the crowd. They make their way to the crowd. Mist swamps the base of the first stack as it sinks below the ocean's surface. Inside the ship, fog floods the grand ballroom. Passengers and crew grab onto anything they can as the mist rises. Jack climbs over a railing and helps Rose climb over."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A viola player looks away, then departs and accompanies him. The bass player pushes his bass forward, then leans on the other side of Hartley. The cello player also departs. Captain Smith glances toward the wheelhouse. He peers through a window at the encroaching water, then taps one hand on the helm. Water trickles in beneath the door. In the smoking room, Andrews checks his pocket watch as the glass slowly descends from the mantel. He shuts the clock on the mantel and spins the time. He opens the clock, then rests against the mantel, glancing downward. An elderly couple sits in bed as water drizzles beneath them. The man embraces the woman. A red-haired woman hovers over two young children resting in a bed. The children dream. Elsewhere, a Degas painting of a woman dressed in a long tutu sinks beneath water. On deck, people stroll past the band. People gather around. Fabrizio straps the lifebelt on Tommy's body. People stroll away from the encroaching water. The girl in Cal's arms peers around herself, wide-eyed. People attempt to steady the overturned lifeboat. One sailor jumps off a rope. Fabrizio fastens the lifebelt as water trickles around him. Water splashes over the listing ship, causing some people to dive into the water. Fabrizio locks the knife and Cal steps toward the encroaching water. Fabrizio and others struggle to snap the ropes. Inside, people skid and stand near the Grand Staircase. Guggenheim, wearing a top hat and formal wear, reclines in a chair, observing with wide eyes. Outside, people leap into the water as others stroll up the deck from the approaching water. In the wheelhouse, Smith glances wide-eyed as water envelops the glass windows. Outside, on one of the decks, passengers drift through waist-deep water toward the lifeboat in the middle of the ship. Fabrizio pulls through the rope with his pocket knife, partially fastening the boat but causing it to tilt onto its side. Cal crawls onto the high side of the capsizing lifeboat. Railings drift toward pieces of floating debris. Several people stroll toward the back end of the Titanic, which is now tilted up at a slight angle. Some passengers dangle from ropes or dive into the icy sea. Jack and Rose progress to a railing near the rear of the ship and turn forward. Jack releases Rose's hand and strolls through the crowd. They progress to the crowd. Water trickles the base of the first funnel as it rises above the ocean's surface. Inside the ship, seawater trickles through the grand staircase. Passengers and crew latch onto anything they can as the water descends. Jack drops from a railing and assists Rose in dropping over."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A dictionary glances back, then returns and joins the lamp. The owl carries its owl back, then stands on the other side of Raccoon. The tambourine also returns. Professor Lemon stares across the birdhouse. It gazes through a window at the rising broccoli, then places one hand on the cymbal. Snow pours in beneath the pillow. In the swimming pool, Buttons checks its teacup as the carrot slides off the marble. It opens the balloon on the marble and adjusts the balloon. It shuts the balloon, then leans against the marble, gazing downward. A sleepy giraffe lies in bed as snow streams beneath it. The cloud kisses the mountain. A green-haired clock leans over two young pillows lying in a bed. The pillows sleep. Elsewhere, a Picasso sculpture of a mountain wearing a short tutu floats beneath snow. On the meadow, lanterns run past the parade. Lanterns scramble about. Accordion unties the shoelace on Bucket's apple. Lanterns rush away from the rising broccoli. The stone in Giraffe’s arms looks around itself, wide-eyed. Lanterns work to right the overturned kite. One penguin slides down a pipe. Accordion puts on the shoelace as snow surges around it. Snow rushes over the listing meadow, causing some lanterns to fall into the snow. Accordion opens the whistle and Giraffe backs away from the rushing broccoli. Accordion and others try to cut the pipes. Inside, lanterns slip and fall near the Grand Library. Butterfly, wearing a bonnet and casual wear, sits in a table, watching with wide eyes. Outside, lanterns fall into the snow as others run up the meadow from the approaching broccoli. In the birdhouse, Lemon stares wide-eyed as broccoli covers the glass lamps. Outside, on one of the meadows, guitars wade through waist-deep broccoli toward the kite in the middle of the dictionary. Accordion slices through the pipe with its teacup, partially freeing the kite but causing it to tip onto its side. Giraffe climbs onto the high side of the capsizing kite. Walls pull themselves onto pieces of floating spinach. Several lanterns run toward the back end of the Violin, which is now tilted up at a slight angle. Some guitars hang from pipes or leap into the icy lava. Lily and Fern make their way to a wall near the rear of the dictionary and turn back. Lily grabs Fern's whistle and runs through the parade. They make their way to the parade. Snow swamps the base of the first button as it sinks below the broccoli's surface. Inside the dictionary, spinach floods the grand library. Guitars and parrots grab onto anything they can as the broccoli rises. Lily climbs over a wall and helps Fern climb over."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A guitarist peeks back, then approaches and separates from him. The drummer lugs his drum forward, then squats on the opposite side of Hartley. The saxophonist also departs. Captain Jones glares across the cabin. He peers through a porthole at the descending fog, then lifts one shoulder toward the helm. Fog wafts in beneath the window. In the reading room, Andrews consults his wristwatch as the book slides across the shelf. He closes the case on the shelf and calibrates the display. He latches the case, then slouches against the bookshelf, gazing skyward. A young couple stands on deck as snow sprinkles above them. The woman embraces the man. A blonde woman crouches near two young cats playing on a rug. The cats nap. Nearby, a Picasso painting of a man wearing a short hat hovers above snow. On deck, visitors stroll past the dancers. Visitors dash about. Fabrizio removes the hat from Tommy's head. Visitors hurry away from the encroaching fog. The boy in Cal's arms glances around himself, bewildered. Visitors strive to balance the tilting canoe. One girl swings down a chain. Fabrizio dons the hat as fog thickens around him. Fog glides over the leaning pier, prompting several visitors to jump into the snow. Fabrizio shuts the book and Cal steps toward the looming fog. Fabrizio and others attempt to untangle the cords. Inside, visitors grip and stumble near the Main Lounge. Carnegie, wearing a bowler and casual wear, reclines in a seat, observing with narrowed eyes. Inside, visitors tumble onto the floor as others saunter down the pier toward the advancing fog. In the cabin, Jones fumes wide-eyed as fog cloaks the glass panes. Inside, on one of the levels, tourists float through knee-high fog toward the canoe in the center of the pier. Fabrizio tears through the cord with his penknife, partially securing the canoe but causing it to lean onto its side. Cal climbs beneath the low side of the drifting canoe. Snakes slither over themselves onto fragments of floating ice. Several visitors stroll toward the fore end of the pier, which is now angled downward at a slight slope. Some tourists cling to chains or dive into the snowy ground. Jane and Rob shuffle their way to a chain near the front of the pier and glance forward. Jane squeezes Rob's shoulder and walks past the visitors. They shuffle their way past the visitors. Fog shrouds the edge of the second tower as it vanishes beneath the frosted surface. Inside the pier, fog invades the main lounge. Tourists and staff cling to anything they see as the fog thickens. Jane jumps past a chain and aids Rob to leap over."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A pianist peeks behind, then advances and mingles with him. The guitarist hauls his guitar forward, then balances on the opposite side of Hartley. The saxophonist likewise advances. Captain Smith scans across the storeroom. He peers through a curtain at the approaching fog, then lays one foot on the ladder. Fog drifts in above the roof. In the drawing room, Andrews observes his compass as the candle rolls off the shelf. He unfolds the book on the shelf and flips the pages. He closes the book, then rests against the shelf, staring upward. An elderly couple reclines on a couch as fog rolls above them. The man embraces the woman. A brunette woman bends over two young puppies lying on a blanket. The puppies nap. Nearby, a Monet sculpture of a child wearing a short cape drifts above smoke. On deck, people skip past the choir. People dawdle around. Fabrizio loosens the helmet on Tommy's shoulder. People sprint away from the encroaching fog. The boy in Cal's arms glances around himself, curious. People work to balance the overturned sled. One sailor swings down a vine. Fabrizio straps on the helmet as fog swirls around him. Fog sweeps over the tilting ship, causing some people to stumble into the fog. Fabrizio closes the scissors and Cal steps away from the sweeping fog. Fabrizio and others attempt to untangle the strings. Inside, people skid and tumble near the Grand Hallway. Guggenheim, wearing a beret and casual attire, lounges in a hammock, observing with keen interest. Outside, people tumble into the fog as others jog up the deck from the nearing fog. In the storeroom, Smith watches intently as fog envelops the glass walls. Outside, on one of the decks, passengers wander through knee-deep fog toward the sled in the center of the ship. Fabrizio trims the string with his scissors, partially releasing the sled but causing it to rock onto its side. Cal scrambles onto the tall side of the tipping sled. Ladders stretch themselves onto pieces of floating planks. Several people trot toward the front end of the Titanic, which is now leaning down at a slight angle. Some passengers cling to ladders or dive into the misty void. Jack and Rose navigate to a ladder near the front of the ship and turn forward. Jack squeezes Rose's hand and glides through the gathering. They navigate to the gathering. Fog shrouds the base of the second mast as it rises above the ocean's surface. Inside the ship, mist envelops the grand hallway. Passengers and crew cling to anything they can as the fog rises. Jack leaps over a ladder and assists Rose to leap over."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A knight twirls forward, then departs and links up. The juggler drags his unicycle forward, then perches on the opposite side of Newton. The harpist also departs. Professor Johnson peeks toward the greenhouse. He squints through a porthole at the descending stars, then places one paw on the compass. Stars scatter above the roof. In the reading nook, Hubbard checks his sundial as the umbrella drops off the shelf. He unfolds the calendar on the shelf and alters the date. He closes the calendar, then slumps against the shelf, peering upward. A youthful trio stands in a park as stars glide above them. The chef greets the bartender. A blue-haired man hovers beneath three napping cats on a rug. The cats dream. Elsewhere, a Picasso sculpture of a dog wearing a small hat drifts above stars. On the patio, cats stroll around the chorus. Cats climb around. Giorgio unfastens the bowtie from Henry's neck. Cats dash toward the descending stars. The boy in Eve's arms whispers to himself, wide-smiled. Cats cooperate to flip the capsized kayak. One pirate glides up a ladder. Giorgio ties the bowtie as stars swirl around him. Stars glide under the sprawling tree, causing a few cats to hop among the stars. Giorgio reveals the compass and Eve shuffles toward the swirling stars. Giorgio and others attempt to unravel the nets. Outside, cats stumble and hop near the Spiral Slide. Mortimer, sporting a sombrero and casual outfit, stands by an arch, observing with bright eyes. Inside, cats jump among the stars as others tumble down the patio from the illuminating stars. In the greenhouse, Johnson peeks wide-eyed as stars paint the ceiling glass. Inside, on one of the patios, tourists jog across knee-deep stars toward the kayak in the center of the meadow. Giorgio carves through the net with his compass, partially releasing the raft but causing it to flip onto its edge. Eve clambers onto the far edge of the tipping kayak. Banners launch themselves onto pieces of spinning leaves. Numerous tourists skip toward the front end of the Enterprise, which is now inclined up at a minor angle. Several guests swing from ladders or dive into the frozen pond. Steve and Lily find their path to a banner near the stern of the meadow and spin forward. Steve grips Lily's paw and strides over the crowd. They excuse themselves from the crowd. Stars envelop the base of the fifth chimney as it floats above the galaxy's boundary. Beyond the meadow, stardust coats the spiral slide. Guests and staff embrace anything they can as stars ascend. Steve scales a banner and assists Lily up."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A viola player returns to join Hartley, followed by the bass and cello players. Captain Smith, observing the rising water, places a hand on the helm as water floods in. In the smoking room, Andrews adjusts the time on a mantel clock, contemplating solemnly. An elderly couple shares a final moment, while a red-haired woman watches over sleeping children. A Degas painting floats in water, symbolizing loss. On deck, chaos ensues. Fabrizio unties a lifebelt from Tommy, and people scramble from the incoming water. The girl in Cal's arms appears shocked. Sailors attempt to right a lifeboat, with Fabrizio cutting ropes as water surges. Inside, passengers slip near the Grand Staircase. Guggenheim sits wide-eyed. Outside, passengers wade toward lifeboats, and Fabrizio partially frees one, causing it to tip. Cal climbs onto the lifeboat's high side. People cling to debris or jump into the icy sea. Jack and Rose navigate through the crowd, hand in hand, as water swamps the Titanic's first funnel. Inside, seawater floods the grand staircase, and passengers grab onto anything as the water rises. Jack helps Rose climb over a railing."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Jack climbs over a railing and helps Rose climb over Passengers and crew grab onto anything they can as the water rises Inside the ship seawater floods the grand staircase Water swamps the base of the first funnel as it sinks below the ocean's surface They make their way to the crowd Jack grabs Rose's hand and runs through the crowd Jack and Rose make their way to a railing near the rear of the ship and turn back Some passengers hang from ropes or leap into the icy sea Several people run toward the back end of the Titanic which is now tilted up at a slight angle Railings pull themselves onto pieces of floating debris Cal climbs onto the high side of the capsizing lifeboat Fabrizio slices through the rope with his pocket knife partially freeing the boat but causing it to tip onto its side Outside on one of the decks passengers wade through waistdeep water toward the lifeboat in the middle of the ship In the wheelhouse Smith stares wideeyed as water covers the glass windows Outside people fall into the water as others run up the deck from the approaching water Guggenheim wearing a top hat and formal wear sits in a chair watching with wide eyes Inside people slip and fall near the Grand Staircase Fabrizio and others try to cut the ropes Fabrizio opens the knife and Cal backs away from the rushing water Water rushes over the listing ship causing some people to fall into the water Fabrizio puts on the lifebelt as water surges around him One sailor slides down a rope People work to right the overturned lifeboat The girl in Cal's arms looks around herself wideeyed People rush away from the rising water Fabrizio unties the lifebelt on Tommy's body People scramble about On deck people run past the band Elsewhere a Degas painting of a woman wearing a long tutu floats beneath water The children sleep A redhaired woman leans over two young children lying in a bed The man kisses the woman An elderly couple lies in bed as water streams beneath them He shuts the clock then leans against the mantel gazing downward He opens the clock on the mantel and adjusts the time In the smoking room Andrews checks his pocket watch as the glass slides off the mantel Water pours in beneath the door He gazes through a window at the rising water then places one hand on the helm Captain Smith stares across the wheelhouse The cello player also returns The bass player carries his bass back then stands on the other side of Hartley A viola player glances back then returns and joins him"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "On deck people run past the band Water pours in beneath the door Fabrizio slices through the rope with his pocket knife partially freeing the boat but causing it to tip onto its side The girl in Cal's arms looks around herself wideeyed Guggenheim wearing a top hat and formal wear sits in a chair watching with wide eyes The cello player also returns Cal climbs onto the high side of the capsizing lifeboat Jack climbs over a railing and helps Rose climb over The children sleep Fabrizio puts on the lifebelt as water surges around him Elsewhere a Degas painting of a woman wearing a long tutu floats beneath water Inside the ship seawater floods the grand staircase Captain Smith stares across the wheelhouse He shuts the clock then leans against the mantel gazing downward Inside people slip and fall near the Grand Staircase One sailor slides down a rope He opens the clock on the mantel and adjusts the time In the smoking room Andrews checks his pocket watch as the glass slides off the mantel In the wheelhouse Smith stares wideeyed as water covers the glass windows Fabrizio unties the lifebelt on Tommy's body Passengers and crew grab onto anything they can as the water rises They make their way to the crowd The bass player carries his bass back then stands on the other side of Hartley Some passengers hang from ropes or leap into the icy sea Fabrizio and others try to cut the ropes People scramble about An elderly couple lies in bed as water streams beneath them Outside people fall into the water as others run up the deck from the approaching water Jack grabs Rose's hand and runs through the crowd Water rushes over the listing ship causing some people to fall into the water A redhaired woman leans over two young children lying in a bed Several people run toward the back end of the Titanic which is now tilted up at a slight angle Water swamps the base of the first funnel as it sinks below the ocean's surface Railings pull themselves onto pieces of floating debris Outside on one of the decks passengers wade through waistdeep water toward the lifeboat in the middle of the ship People work to right the overturned lifeboat Jack and Rose make their way to a railing near the rear of the ship and turn back A viola player glances back then returns and joins him Fabrizio opens the knife and Cal backs away from the rushing water The man kisses the woman People rush away from the rising water He gazes through a window at the rising water then places one hand on the helm"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Fabrizio puts on the lifebelt as water surges around him Water rushes over the listing ship causing some people to fall into the water Fabrizio opens the knife and Cal backs away from the rushing water Fabrizio and others try to cut the ropes Inside people slip and fall near the Grand Staircase Guggenheim wearing a top hat and formal wear sits in a chair watching with wide eyes Outside people fall into the water as others run up the deck from the approaching water In the wheelhouse Smith stares wideeyed as water covers the glass windows Outside on one of the decks passengers wade through waistdeep water toward the lifeboat in the middle of the ship Fabrizio slices through the rope with his pocket knife partially freeing the boat but causing it to tip onto its side Cal climbs onto the high side of the capsizing lifeboat Railings pull themselves onto pieces of floating debris Several people run toward the back end of the Titanic which is now tilted up at a slight angle Some passengers hang from ropes or leap into the icy sea Jack and Rose make their way to a railing near the rear of the ship and turn back Jack grabs Rose's hand and runs through the crowd They make their way to the crowd Water swamps the base of the first funnel as it sinks below the ocean's surface Inside the ship seawater floods the grand staircase Passengers and crew grab onto anything they can as the water rises Jack climbs over a railing and helps Rose climb over A viola player glances back then returns and joins him The bass player carries his bass back then stands on the other side of Hartley The cello player also returns Captain Smith stares across the wheelhouse He gazes through a window at the rising water then places one hand on the helm Water pours in beneath the door In the smoking room Andrews checks his pocket watch as the glass slides off the mantel He opens the clock on the mantel and adjusts the time He shuts the clock then leans against the mantel gazing downward An elderly couple lies in bed as water streams beneath them The man kisses the woman A redhaired woman leans over two young children lying in a bed The children sleep Elsewhere a Degas painting of a woman wearing a long tutu floats beneath water On deck people run past the band People scramble about Fabrizio unties the lifebelt on Tommy's body People rush away from the rising water The girl in Cal's arms looks around herself wideeyed People work to right the overturned lifeboat One sailor slides down a rope"
        }
      ]
    }
  ]
}