{
  "ground_truth": "Stacks of plates slide off the shelves and smash on the floor as a lifeboat flows with people away from the part of the ship which rises several stories into the night sky. People slide down the slanted deck, and Jack's eyes widen as he watches people and deck chairs smashing into each other. A brunette woman slips out of a man's grasp and slides on the deck on her stomach. All along the Titanic, people dangle from ropes, spill from railings, or slide down into the ocean. More people climb over the railing at the back of the ship. One man jumps and free falls into the icy water where small groups of survivors cling to floating debris. Standing at the rear railing, the black-haired baker watches a falling man bounce off one of the giant propellers and cartwheel into the sea. The baker pulls a flask out of his pocket and takes a drink. Jack wraps his arms around Rose as she grips onto the railing. Sitting beside Molly in a lifeboat, Ruth's eyes are glassy as she watches from a distance, while Ismay, also in a lifeboat, turns away from the carnage and squeezes his eyes shut. A crewman reaches towards a sparking circuit breaker, and a shock flings him. All along the Titanic, electric lights flicker, then go out as the rear of the ship continues to tilt upward. Blood streaming down his forehead, Lovejoy grips a side railing as it splits apart. Inside the ship, a ceiling collapses as several support columns fail, and small explosions shoot flames from portholes. A pair of men slide into the widening chasm, and the mighty ship snaps in half, sending the rear of the boat plunging back toward the sea. The back of the Titanic slaps down on the ocean surface, crushing dozens. The last of the funnels topples over as water rushes into the gap between the two sections, which are still joined at the bottom, and the Titanic rapidly fills with water and sinks. Jack climbs over the railing at the back of the ship as it tilts skyward rapidly, and passengers manage to scramble over the railing. Sheets of water glimmer in the moonlight, which rises up from the ocean, and people dangling from railings lose their grips and fall. One man bounces off a cab stand before slamming into other people hanging on below, creating a domino effect of falling bodies. A blonde maid dangles from the railing near Rose, who looks into the young woman's eyes as she loses her grip and falls. Her breath visible in the cold air, Rose turns toward the baker, who crouches on the railing beside her, and he returns her silent gaze. Finally, the entire ship sinks.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here's a transformation of the text with synonyms for the non-stop words while maintaining the original meaning and context:\n\nStacks of dishes slide off the ledges and shatter on the floor as a lifeboat flows with individuals away from the section of the vessel which ascends several stories into the nighttime sky. Individuals slide down the sloped deck, and Jack's eyes widen as he observes individuals and lounge chairs crashing into each other. A brunette woman slips out of a man's grasp and slides on the deck on her stomach. All along the Titanic, individuals dangle from ropes, spill from railings, or slide down into the ocean. More individuals climb over the railing at the rear of the ship. One man leaps and free falls into the frigid water where small groups of survivors cling to floating wreckage. Standing at the aft railing, the dark-haired baker watches a falling man bounce off one of the giant propellers and somersault into the sea. The baker pulls a flask out of his pocket and takes a sip. Jack wraps his arms around Rose as she grips onto the railing. Sitting beside Molly in a lifeboat, Ruth's eyes are glazed as she observes from a distance, while Ismay, also in a lifeboat, turns away from the destruction and squeezes his eyes shut. A crewman reaches towards a sparking circuit breaker, and a jolt flings him. All along the Titanic, electric lights flicker, then go out as the rear of the ship continues to tilt upward. Blood streaming down his forehead, Lovejoy grips a side railing as it splits apart. Inside the ship, a ceiling collapses as several support columns fail, and small explosions shoot flames from portholes. A pair of men slide into the widening chasm, and the mighty ship snaps in half, sending the rear of the boat plunging back toward the sea. The rear of the Titanic slaps down on the ocean surface, crushing dozens. The last of the funnels topples over as water rushes into the gap between the two sections, which are still joined at the bottom, and the Titanic rapidly fills with water and sinks. Jack climbs over the railing at the rear of the ship as it tilts skyward rapidly, and passengers manage to scramble over the railing. Sheets of water shimmer in the moonlight, which rises up from the ocean, and individuals dangling from railings lose their grips and fall. One man rebounds off a cab stand before slamming into other individuals hanging on below, creating a domino effect of descending bodies. A blonde maid dangles from the railing near Rose, who looks into the young woman's eyes as she loses her grip and descends. Her breath visible in the cold air, Rose turns toward the baker, who crouches on the railing beside her, and he returns her silent gaze. Finally, the entire vessel sinks."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Plates were slid off the shelves and smashed on the floor by stacks as people flowed with a lifeboat away from the part of the ship which was rising several stories into the night sky. The slanted deck was slid down by people, and Jack's eyes widened while he watched people and deck chairs being smashed into each other. A brunette woman was slipped out of a man's grasp and slid on the deck on her stomach. All along the Titanic, people were dangling from ropes, were being spilled from railings, or were sliding down into the ocean. More people were climbed over the railing at the back of the ship. One man was jumped and free fell into the icy water where small groups of survivors clung to floating debris. Standing at the rear railing, a falling man was watched by the black-haired baker as he bounced off one of the giant propellers and was cartwheeled into the sea. A flask was pulled out of his pocket by the baker, and he drank. Rose was wrapped around by Jack as she gripped onto the railing. Sitting beside Molly in a lifeboat, Ruth's eyes were glassy as she watched from a distance, while Ismay, also in a lifeboat, turned away from the carnage and squeezed his eyes shut. A sparking circuit breaker was reached towards by a crewman, and a shock flung him. All along the Titanic, electric lights were flickering, then went out as the rear of the ship was continued to be tilted upward. Blood streaming down his forehead, a side railing was gripped by Lovejoy as it was split apart. Inside the ship, a ceiling was collapsed as several support columns failed, and flames were shot from portholes by small explosions. A widening chasm was slid into by a pair of men, and the mighty ship was snapped in half, sending the rear of the boat plummeting back toward the sea. The ocean surface was slapped down on by the back of the Titanic, crushing dozens. The last of the funnels toppled over as water rushed into the gap between the two sections, which still joined at the bottom, and the Titanic became rapidly filled with water and sank. The railing at the back of the ship was climbed over by Jack as it rapidly tilted skyward, and the railing was scrambled over by passengers. In the moonlight, sheets of water were glimmering, which rose up from the ocean, and grips were lost by people dangling from railings, causing them to fall. A cab stand was bounced off by one man before he slammed into other people hanging on below, creating a domino effect of falling bodies. From the railing near Rose, a blonde maid was dangling, who looked into the young woman's eyes as her grip was lost, and she fell. Breath visible in the cold air, the baker was turned toward by Rose, who crouched on the railing beside her, and her silent gaze was returned by him. Finally, the entire ship was sunk."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Stacks of plates slide and shatter on the floor as a lifeboat carries people away from the ship, rising into the night sky. People slide down the tilted deck; Jack watches as people and deck chairs collide. A brunette woman slips from a man’s grasp, sliding on her stomach. All over Titanic, people dangle from ropes, spill from railings, or slide into the ocean. More climb over the back railing. A man jumps into icy water where survivors cling to debris. At the rear, a black-haired baker watches a man bounce off a propeller into the sea, then takes a drink from a flask. Jack holds Rose as she grips the railing. In a lifeboat with Molly, Ruth's eyes are glassy, while Ismay turns away, shutting his eyes. A crewman reaches a sparking circuit breaker and is flung by a shock. Along the Titanic, lights flicker and go out as the ship tilts further. Blood streaming, Lovejoy grips a railing as it splits. Inside, a ceiling collapses, support columns fail, and flames burst from portholes. Two men slide into a widening chasm, and the ship breaks in half, sending the rear plunging into the sea, crushing dozens. The last funnel topples as water fills the gap, sinking the Titanic. Jack climbs over the tilting back, and passengers scramble over the railing. In moonlight, people dangling from railings fall. One man bounces off a cab stand, causing more to fall. A blonde maid dangles near Rose, who watches her lose grip and fall. Breath visible in the cold air, Rose turns to the baker beside her, sharing a silent moment. Finally, the entire ship sinks."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Plates slide off shelves and smash as a lifeboat carries people from the ship, which rises into the night sky. People slide down the deck; Jack watches in shock as chairs and people collide. A woman slips from a man's grip, sliding on her stomach. Across the Titanic, people dangle, spill, or slide into the ocean. Some climb over the railing; one man jumps into icy water near survivors clinging to debris. A baker watches a man bounce off a propeller into the sea, then drinks from a flask. Jack holds Rose as she grips the railing. In a lifeboat, Ruth watches with glassy eyes, while Ismay turns away. A crewman is shocked reaching for a circuit breaker as Titanic lights flicker and go out. Lovejoy, bleeding, grips a railing as it splits. Inside, a ceiling collapses, columns fail, and flames shoot from portholes. The ship splits, sending the rear plunging into the sea, crushing dozens. Funnels topple as water fills the gap between sections, and Titanic sinks. Jack climbs the tilting ship, and people scramble over the railing. In moonlight, people fall from railings. A maid dangles near Rose before falling. Rose, breath visible in the cold, meets the baker's silent gaze before the ship sinks."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Stacks upon stacks of fragile plates noisily slide off the shelves and crash down onto the floor, scattering into countless pieces as a crowded lifeboat, filled to its capacity with people, drifts away from the towering part of the ship that rises dramatically several stories into the darkened night sky. People helplessly slide down the dangerously slanted deck, and Jack's eyes grow wide with shock and horror as he witnesses people colliding with deck chairs, creating a chaotic scene. A brunette woman, slipping from a man's desperate grasp, finds herself sliding down the deck on her stomach. All along the grand Titanic, individuals dangle precariously from ropes, spill over railings, or helplessly slide straight into the cold ocean. More and more people clamber over the railing at the stern of the ship. With a sudden leap, one man jumps and free-falls into the frigid waters, where small, desperate groups of survivors cling for dear life to any floating debris they can find. Standing by the rear railing, a baker with dark, jet-black hair watches intently as a falling man bounces off one of the enormous propellers and cartwheels into the sea below. The baker, unfazed by the chaos, retrieves a flask from his pocket and takes a swig. Jack wraps his arms securely around Rose as she clutches onto the railing with white-knuckled determination. Sitting close beside Molly in a lifeboat, Ruth's eyes are glazed over with shock as she watches from afar, while Ismay, who is also in a lifeboat, turns away from the horror and squeezes his eyes shut, unable to look any longer. Meanwhile, a crewman reaches out towards a sparking circuit breaker, only to be dramatically flung back by a fierce shock. Throughout the length and breadth of the Titanic, electric lights flicker ominously before going out completely as the rear of the ship continues its upward tilt. Blood streaks down his forehead as Lovejoy clings desperately to a side railing that begins to split apart. Inside the massive ship, a ceiling collapses loudly as several crucial support columns fail, and small but fiery explosions burst from the portholes. A pair of men helplessly slide into the widening chasm, and the mighty ship snaps violently in half, sending the rear of the boat plunging downward back toward the unforgiving sea. The back of the Titanic hits the ocean surface with a resounding slap, crushing dozens in its path. The last of the massive funnels topples over with a crash as water rushes furiously into the widening gap between the two sections, which remain tenuously joined at the bottom, and the Titanic quickly fills with water and begins to sink. Jack, with increasing urgency, climbs over the railing at the stern of the ship as it rapidly tilts skyward, while other passengers scramble frantically over the railing. Sheets of water shimmer in the bright moonlight, rising up from the ocean, as people clinging to railings lose their tenuous grips and fall helplessly. One man bounces off a cab stand before slamming into other people clinging below, creating a devastating domino effect of falling bodies. A blonde maid dangles desperately from the railing near Rose, who looks deeply into the young woman's eyes just as she loses her grip and falls. Her breath visible in the chilled air, Rose turns her gaze toward the baker, who crouches quietly on the railing beside her, and he returns her silent gaze with understanding. Finally, the entire ship succumbs to its fate and sinks beneath the waves."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Stacks upon stacks of fragile, delicate plates, balancing precariously, noisily slide off the shelves, creating a cacophony as they crash down onto the hard floor, scattering into countless shards. Meanwhile, a crowded lifeboat, filled to its utmost capacity with anxious people, drifts away from the looming section of the ship that rises dramatically several stories high into the darkened, starless night sky. People helplessly slide down the dangerously slanted deck, adding to the pandemonium, while Jack's eyes widen with shock and horror as he witnesses individuals colliding violently with deck chairs, resulting in an utterly chaotic scene. A brunette woman, slipping hopelessly from a man's desperate grasp, finds herself sliding down the deck on her stomach, struggling to stop. All along the grand, majestic Titanic, individuals dangle precariously from ropes, spill over railings, or helplessly slide straight into the cold, unforgiving ocean. More and more alarmed passengers clamber over the railing at the stern of the ship in a frantic bid for survival. With a sudden, decisive leap, one man jumps and free-falls into the frigid waters below, where small, desperate groups of survivors cling tenaciously for dear life to any floating debris they can find amidst the chaos. Standing by the rear railing, a baker with dark, jet-black hair watches intently as a falling man bounces off one of the immense propellers and cartwheels into the tumultuous sea below. Unfazed by the surrounding turmoil, the baker nonchalantly retrieves a flask from his pocket and takes a swig, seemingly detached from the disaster unfolding around him. Meanwhile, Jack wraps his protective arms securely around Rose as she clutches onto the railing with white-knuckled determination. Sitting close beside Molly in a lifeboat, Ruth's eyes are glazed over with shock as she watches from a distance, while Ismay, who is also in a lifeboat, turns away from the unfolding horror, squeezing his eyes shut, unable to bear the sight any longer. Meanwhile, elsewhere on the ship, a crewman reaches out towards a sparking circuit breaker, only to be dramatically flung back by a fierce electrical shock that sends him reeling. Throughout the length and breadth of the Titanic, electric lights flicker ominously before giving out completely as the rear of the ship continues its relentless upward tilt. Blood streaks down his forehead as Lovejoy clings desperately to a side railing that begins to split apart under the immense pressure. Inside the massive ship, a ceiling collapses loudly, echoing as several crucial support columns fail, and small but fiery explosions burst forth from the portholes. A pair of men helplessly slide into the widening chasm, and the once-mighty ship snaps violently in half, sending the rear portion of the boat plunging downward back toward the unforgiving sea below. The back of the Titanic hits the ocean surface with a resounding slap, crushing dozens in its path with terrifying force. The last of the ship's massive funnels topples over with a crash as water rushes furiously into the widening gap between the two sections, which remain tenuously joined at the bottom, and the Titanic quickly fills with water, beginning its inevitable descent into the depths. Jack, with increasing urgency and determination, climbs over the railing at the stern of the ship as it rapidly tilts skyward, while other passengers scramble frantically over the railing in a desperate bid to avoid the rising waters. Sheets of water shimmer in the bright, unforgiving moonlight, rising up from the restless ocean, as people clinging to railings lose their tenuous grips and fall helplessly into the void. One man bounces off a nearby cab stand before slamming into other people clinging below, creating a devastating domino effect of falling bodies amidst the chaos. A blonde maid dangles desperately from the railing near Rose, who gazes deeply into the young woman's eyes just before she loses her grip and falls, disappearing from sight. Her breath visible in the chilled night air, Rose turns her gaze toward the baker, who crouches quietly on the railing beside her, and he returns her silent gaze with a look of understanding. Finally, the entire ship succumbs to its tragic fate, sinking beneath the relentless waves."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As stacks of plates begin sliding off the shelves, they crash onto the floor with a resounding smash, creating a chaotic symphony of breaking china as a lifeboat begins to glide away, filled with people eager to distance themselves from the part of the ship that ominously rises several stories into the night sky. On the slanted deck, people find themselves losing their footing, sliding uncontrollably, and Jack's eyes widen in horror as he witnesses the chaotic scene of people and deck chairs colliding violently with each other. A brunette woman, unable to maintain her grip on a man's hand, slips out of his grasp and involuntarily slides along the deck on her stomach, becoming part of the disarray. Throughout the length of the Titanic, the situation is dire as people desperately cling to ropes, spill over railings, or helplessly slide down into the unforgiving ocean. In the midst of the chaos, more individuals continue to scramble over the railing at the back of the ship, with one man making the terrifying decision to leap and free fall into the icy waters below, where small groups of survivors cling desperately to floating debris in hopes of salvation. At the rear railing, a black-haired baker observes the grim spectacle of a falling man impacting one of the giant propellers and cartwheeling into the sea with horrifying momentum. The baker then retrieves a flask from his pocket and calmly takes a drink, seemingly resigned to the unfolding tragedy. Meanwhile, Jack clings tightly to Rose, wrapping his arms protectively around her as she grips onto the railing for dear life. In a lifeboat some distance away, Ruth sits next to Molly, her eyes glazed over with shock as she witnesses the distant horror unfold. On the same lifeboat, Ismay, overcome with guilt and fear, turns away from the devastation, shutting his eyes in an attempt to block out the scene. Amidst the pandemonium, a crewman reaches toward a sparking circuit breaker, only to be violently flung away by an electric shock. The electric lights that illuminate the Titanic flicker uncertainly before extinguishing altogether as the rear of the ship continues its inexorable tilt skyward. With blood trickling down his forehead, Lovejoy clings desperately to a side railing as it begins to splinter and crack apart. Inside the ship, the devastating collapse of the ceiling occurs as several support columns fail, triggering small explosions that send flames shooting dramatically from portholes. Two men find themselves powerless as they slide into the ever-widening chasm, and in a catastrophic moment, the mighty ship snaps in half, sending the rear section plunging precipitously back toward the sea. As the back of the Titanic crashes down onto the ocean's surface with immense force, it crushes dozens in its wake. The final funnel of the ship topples over as water surges into the gap between the two massive sections, still connected at the bottom, and the Titanic rapidly succumbs to the water's embrace, sinking with relentless speed. In a frantic bid for survival, Jack climbs over the railing at the ship's rear as it tilts skyward with alarming rapidity, while other passengers, equally desperate, manage to scramble over the railings. Sheets of water glimmer hauntingly in the moonlight as they rise from the ocean, and those who are dangling from railings lose their grips, plummeting into the depths below. One man meets a grim fate as he bounces off a cab stand before colliding with others hanging on below, setting off a tragic domino effect of falling bodies. A blonde maid clings to the railing near Rose, and as their eyes meet, the young woman loses her grip and falls, vanishing into the chaos below. Her breath visible in the frigid air, Rose turns toward the baker, who crouches on the railing beside her, and in a moment of shared understanding, he returns her silent gaze. Finally, with the unstoppable force of nature, the entire ship succumbs to the depths and sinks completely."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As a lifeboat carries people away from the ship's towering stern, stacks of plates crash to the floor. Passengers slide down the slanted deck, colliding with deck chairs, while Jack watches in horror. A woman slips and slides across the deck as others dangle from ropes, fall from railings, or plunge into the ocean. At the rear of the ship, the black-haired baker observes a man bounce off a propeller and cartwheel into the sea before taking a swig from his flask. Jack holds Rose tightly as she clings to the railing. Meanwhile, Ruth watches from a lifeboat with Molly, her eyes glassy, as Ismay turns away from the devastation, tightly shutting his eyes. A crewman is thrown by a shock from a circuit breaker, and the ship's lights flicker out as it continues to tilt upward. Bloodied, Lovejoy clings to a railing as it collapses. Inside, a ceiling falls, support columns fail, and flames shoot from portholes. The Titanic snaps in half, sending the rear section crashing into the sea, crushing dozens. As water floods in, the ship rapidly descends. Jack and other passengers scramble up the tilting stern, but many lose their grip, falling into the sea below. A maid near Rose falls after meeting her gaze, while Rose and the baker exchange a silent look. Finally, the Titanic disappears beneath the waves."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Stacks of plates slide off the shelves and smash on the floor as a lifeboat, a crucial means of escape during maritime disasters, flows with people away from the part of the Titanic, which rises several stories into the night sky. As passengers struggle for survival, people slide down the slanted deck, and Jack's eyes widen as he observes people and deck chairs smashing into each other. A brunette woman slips out of a man's grasp and slides on the deck on her stomach, amidst the chaos surrounding the sinking of the ill-fated ship. All along the Titanic, people dangle from ropes, a desperate attempt to avoid the freezing Atlantic waters, spill from railings, or slide down into the ocean. More people climb over the railing at the back of the ship, frantically trying to find refuge. One man jumps and free falls into the icy water, where small groups of survivors cling to floating debris, remnants of the luxurious ocean liner. Standing at the rear railing, the black-haired baker, known for his extraordinary survival story, watches a falling man bounce off one of the giant propellers and cartwheel into the sea. The baker pulls a flask out of his pocket and takes a drink, using alcohol to stave off the cold. Jack wraps his arms around Rose as she grips onto the railing, holding on for dear life. Sitting beside Molly, a renowned socialite, in a lifeboat, Ruth's eyes are glassy as she watches from a distance, while Ismay, the chairman of the White Star Line, also in a lifeboat, turns away from the carnage and squeezes his eyes shut in despair. A crewman reaches towards a sparking circuit breaker, which is a dangerous operation on a sinking ship, and a shock flings him. All along the Titanic, electric lights flicker, then go out as the rear of the ship, a towering structure, continues to tilt upward. Blood streaming down his forehead, Lovejoy grips a side railing as it splits apart, highlighting the structural failure facing the ship. Inside the ship, a ceiling collapses as several support columns fail, and small explosions shoot flames from portholes, emphasizing the dire situation aboard. A pair of men slide into the widening chasm, and the mighty ship, renowned for its grandeur and unsinkable reputation, snaps in half, sending the rear of the boat plunging back toward the sea. The back of the Titanic slaps down on the ocean surface, crushing dozens, a tragic end for many passengers. The last of the funnels topples over as water rushes into the gap between the two sections, which are still joined at the bottom, and the Titanic, once a pinnacle of engineering, rapidly fills with water and sinks. Jack climbs over the railing at the back of the ship as it tilts skyward rapidly, a harrowing climb for survival, and passengers manage to scramble over the railing. Sheets of water glimmer in the moonlight, which rises up from the ocean, and people dangling from railings lose their grips and fall, succumbing to the inevitable pull of gravity. One man bounces off a cab stand before slamming into other people hanging on below, creating a domino effect of falling bodies in the chaos. A blonde maid dangles from the railing near Rose, who looks into the young woman's eyes, deeply impacted by the human suffering around her, as she loses her grip and falls. Her breath visible in the cold air, a sign of the freezing conditions, Rose turns toward the baker, who crouches on the railing beside her, and he returns her silent gaze. Finally, the entire ship, a symbol of human ambition and tragic hubris, sinks."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Inside the ship a ceiling collapses as several support columns fail and small explosions shoot flames from portholes The baker pulls a flask out of his pocket and takes a drink Stacks of plates slide off the shelves and smash on the floor as a lifeboat flows with people away from the part of the ship which rises several stories into the night sky People slide down the slanted deck and Jack's eyes widen as he watches people and deck chairs smashing into each other A brunette woman slips out of a man's grasp and slides on the deck on her stomach All along the Titanic people dangle from ropes spill from railings or slide down into the ocean More people climb over the railing at the back of the ship One man jumps and free falls into the icy water where small groups of survivors cling to floating debris One man bounces off a cab stand before slamming into other people hanging on below creating a domino effect of falling bodies All along the Titanic people dangle from ropes spill from railings or slide down into the ocean People slide down the slanted deck and Jack's eyes widen as he watches people and deck chairs smashing into each other Standing at the rear railing the blackhaired baker watches a falling man bounce off one of the giant propellers and cartwheel into the sea The baker pulls a flask out of his pocket and takes a drink Jack wraps his arms around Rose as she grips onto the railing More people climb over the railing at the back of the ship Sitting beside Molly in a lifeboat Ruth's eyes are glassy as she watches from a distance while Ismay also in a lifeboat turns away from the carnage and squeezes his eyes shut A brunette woman slips out of a man's grasp and slides on the deck on her stomach A crewman reaches towards a sparking circuit breaker and a shock flings him All along the Titanic electric lights flicker then go out as the rear of the ship continues to tilt upward Her breath visible in the cold air Blood streaming down his forehead Lovejoy grips a side railing as it splits apart Finally the entire ship sinks Stacks of plates slide off the shelves and smash on the floor as a lifeboat flows with people away from the part of the ship which rises several stories into the night sky Inside the ship a ceiling collapses as several support columns fail and small explosions shoot flames from portholes A pair of men slide into the widening chasm and the mighty ship snaps in half sending the rear of the boat plunging back toward the sea Jack wraps his arms around Rose as she grips onto the railing The back of the Titanic slaps down on the ocean surface crushing dozens The last of the funnels topples over as water rushes into the gap between the two sections which are still joined at the bottom and the Titanic rapidly fills with water and sinks Jack climbs over the railing at the back of the ship as it tilts skyward rapidly and passengers manage to scramble over the railing Rose turns toward the baker who crouches on the railing beside her and he returns her silent gaze Lovejoy grips a side railing as it splits apart Sheets of water glimmer in the moonlight which rises up from the ocean and people dangling from railings lose their grips and fall One man bounces off a cab stand before slamming into other people hanging on below creating a domino effect of falling bodies A blonde maid dangles from the railing near Rose who looks into the young woman's eyes as she loses her grip and falls Her breath visible in the cold air Rose turns toward the baker who crouches on the railing beside her and he returns her silent gaze Finally the entire ship sinks"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Stacks of plates slide off the shelves and smash on the floor as a lifeboat flows with people away from the part of the ship which rises several stories into the night sky. People slide down the slanted deck and Jack's eyes widen as he watches people and deck chairs smashing into each other. A brunette woman slips out of a man's grasp and slides on the deck on her stomach. All along the Titanic people dangle from ropes spill from railings or slide down into the ocean. More people climb over the railing at the back of the ship. One man jumps and free falls into the icy water where small groups of survivors cling to floating debris. Standing at the rear railing the blackhaired baker watches a falling man bounce off one of the giant propellers and cartwheel into the sea. The baker pulls a flask out of his pocket and takes a drink. Jack wraps his arms around Rose as she grips onto the railing. Sitting beside Molly in a lifeboat Ruth's eyes are glassy as she watches from a distance while Ismay also in a lifeboat turns away from the carnage and squeezes his eyes shut. A crewman reaches towards a sparking circuit breaker and a shock flings him. All along the Titanic electric lights flicker then go out as the rear of the ship continues to tilt upward. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Blood streaming down his forehead. Lovejoy grips a side railing as it splits apart. Inside the ship a ceiling collapses as several support columns fail and small explosions shoot flames from portholes. A pair of men slide into the widening chasm and the mighty ship snaps in half sending the rear of the boat plunging back toward the sea. The back of the Titanic slaps down on the ocean surface crushing dozens. The last of the funnels topples over as water rushes into the gap between the two sections which are still joined at the bottom and the Titanic rapidly fills with water and sinks. Jack climbs over the railing at the back of the ship as it tilts skyward rapidly and passengers manage to scramble over the railing. Sheets of water glimmer in the moonlight which rises up from the ocean and people dangling from railings lose their grips and fall. One man bounces off a cab stand before slamming into other people hanging on below creating a domino effect of falling bodies. A blonde maid dangles from the railing near Rose who looks into the young woman's eyes as she loses her grip and falls. Her breath visible in the cold air. Rose turns toward the baker who crouches on the railing beside her and he returns her silent gaze. Finally the entire ship sinks."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Stacks of plates slide off the shelves and smash on the floor as a lifeboat flows with people away from the part of the ship which rises several stories into the night sky. People slide down the slanted deck and Jack's eyes widen as he watches people and deck chairs smashing into each other. A brunette woman slips out of a man's grasp and slides on the deck on her stomach. All along the Titanic people dangle from ropes spill from railings or slide down into the ocean. More people climb over the railing at the back of the ship. One man jumps and free falls into the icy water where small groups of survivors cling to floating debris. Standing at the rear railing the blackhaired baker watches a falling man bounce off one of the giant propellers and cartwheel into the sea. The baker pulls a flask out of his pocket and takes a drink. Jack wraps his arms around Rose as she grips onto the railing. Sitting beside Molly in a lifeboat Ruth's eyes are glassy as she watches from a distance while Ismay also in a lifeboat turns away from the carnage and squeezes his eyes shut. A crewman reaches towards a sparking circuit breaker and a shock flings him. All along the Titanic electric lights flicker then go out as the rear of the ship continues to tilt upward. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Blood streaming down his forehead. Lovejoy grips a side railing as it splits apart. Inside the ship a ceiling collapses as several support columns fail and small explosions shoot flames from portholes. A pair of men slide into the widening chasm and the mighty ship snaps in half sending the rear of the boat plunging back toward the sea. The back of the Titanic slaps down on the ocean surface crushing dozens. The last of the funnels topples over as water rushes into the gap between the two sections which are still joined at the bottom and the Titanic rapidly fills with water and sinks. Jack climbs over the railing at the back of the ship as it tilts skyward rapidly and passengers manage to scramble over the railing. Sheets of water glimmer in the moonlight which rises up from the ocean and people dangling from railings lose their grips and fall. One man bounces off a cab stand before slamming into other people hanging on below creating a domino effect of falling bodies. A blonde maid dangles from the railing near Rose who looks into the young woman's eyes as she loses her grip and falls. Her breath visible in the cold air. Rose turns toward the baker who crouches on the railing beside her and he returns her silent gaze. Finally the entire ship sinks."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Stacks of plates slide off the shelves and smash on the floor as a lifeboat flows with people away from the part of the ship which rises several stories into the night sky. People slide down the slanted deck and Jack's eyes widen as he watches people and deck chairs smashing into each other. A brunette woman slips out of a man's grasp and slides on the deck on her stomach. All along the Titanic people dangle from ropes spill from railings or slide down into the ocean. More people climb over the railing at the back of the ship. One man jumps and free falls into the icy water where small groups of survivors cling to floating debris. Jack climbs over the railing at the back of the ship as it tilts skyward rapidly and passengers manage to scramble over the railing. Sheets of water glimmer in the moonlight which rises up from the ocean and people dangling from railings lose their grips and fall. One man bounces off a cab stand before slamming into other people hanging on below creating a domino effect of falling bodies. A blonde maid dangles from the railing near Rose who looks into the young woman's eyes as she loses her grip and falls. Her breath visible in the cold air. Rose turns toward the baker who crouches on the railing beside her and he returns her silent gaze. Finally the entire ship sinks."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Stacks of plates slide off the shelves and smash on the floor as a lifeboat flows with people away from the part of the ship which rises several stories into the night sky. People slide down the slanted deck and Jack's eyes widen as he watches people and deck chairs smashing into each other. Her breath visible in the cold air. Rose turns toward the baker who crouches on the railing beside her and he returns her silent gaze. Finally the entire ship sinks."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Stacks of plates slide off the shelves and smash on the floor as a dolphin flows with people away from the part of the ship which rises several stories into the night sky. Cats slide down the slanted deck, and Rex's eyes widen as he watches cats and deck chairs smashing into each other. A young girl slips out of a dog's grasp and slides on the deck on her stomach. All along the Titanic, birds dangle from ropes, spill from railings, or slide down into the ocean. More rabbits climb over the railing at the back of the ship. One seal jumps and free falls into the icy water where small groups of survivors cling to floating debris. Standing at the rear railing, the red-haired carpenter watches a falling seal bounce off one of the giant propellers and cartwheel into the sea. The carpenter pulls a flask out of his pocket and takes a drink. Rex wraps his arms around Daisy as she grips onto the railing. Sitting beside Luna in a lifeboat, Eva's eyes are glassy as she watches from a distance, while Oscar, also in a lifeboat, turns away from the carnage and squeezes his eyes shut. A penguin reaches towards a sparking circuit breaker, and a shock flings the penguin. All along the Titanic, electric lights flicker, then go out as the rear of the ship continues to tilt upward. Blood streaming down his forehead, Cooper grips a side railing as it splits apart. Inside the ship, a ceiling collapses as several support columns fail, and small explosions shoot flames from portholes. A pair of squirrels slide into the widening chasm, and the mighty ship snaps in half, sending the rear of the boat plunging back toward the sea. The back of the Titanic slaps down on the ocean surface, crushing dozens. The last of the funnels topples over as water rushes into the gap between the two sections, which are still joined at the bottom, and the Titanic rapidly fills with water and sinks. Rex climbs over the railing at the back of the ship as it tilts skyward rapidly, and passengers manage to scramble over the railing. Sheets of water glimmer in the moonlight, which rises up from the ocean, and birds dangling from railings lose their grips and fall. One monkey bounces off a cab stand before slamming into other birds hanging on below, creating a domino effect of falling bodies. A blonde kitten dangles from the railing near Daisy, who looks into the young kitten's eyes as she loses her grip and falls. Her breath visible in the cold air, Daisy turns toward the carpenter, who crouches on the railing beside her, and he returns her silent gaze. Finally, the entire ship sinks."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Stacks of books slide off the counters and smash on the rug as a streetcar flows with people away from the part of the building which rises several stories into the night sky. People slide down the slanted hallway, and Jack's eyes widen as he watches people and shopping carts smashing into each other. A brunette woman slips out of a man's grasp and slides on the floor on her stomach. All along the mansion, people dangle from curtains, spill from balconies, or slide down into the courtyard. More people climb over the balcony at the back of the building. One man jumps and free falls into the icy pond where small groups of survivors cling to floating crates. Standing at the rear balcony, the black-haired cook watches a falling man bounce off one of the giant statues and cartwheel into the fountain. The cook pulls a biscuit out of his pocket and takes a bite. Jack wraps his arms around Rose as she grips onto the railing. Sitting beside Molly in a streetcar, Ruth's eyes are glassy as she watches from a distance, while Ismay, also in a streetcar, turns away from the chaos and squeezes his eyes shut. A technician reaches towards a sparking light switch, and a shock flings him. All along the mansion, chandeliers flicker, then go out as the rear of the building continues to tilt upward. Blood streaming down his forehead, Lovejoy grips a side railing as it splits apart. Inside the building, a ceiling collapses as several support beams fail, and small explosions shoot flames from windows. A pair of men slide into the widening gap, and the mighty structure snaps in half, sending the rear of the building plunging back toward the ground. The back of the mansion slaps down on the garden surface, crushing dozens. The last of the towers topples over as water rushes into the gap between the two sections, which are still joined at the bottom, and the mansion rapidly fills with water and sinks. Jack climbs over the railing at the back of the building as it tilts skyward rapidly, and guests manage to scramble over the railing. Sheets of water glimmer in the moonlight, which rises up from the garden, and people dangling from balconies lose their grips and fall. One man bounces off a phone booth before slamming into other people hanging on below, creating a domino effect of falling bodies. A blonde librarian dangles from the railing near Rose, who looks into the young woman's eyes as she loses her grip and falls. Her breath visible in the cold air, Rose turns toward the cook, who crouches on the railing beside her, and he returns her silent gaze. Finally, the entire building sinks."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Stacks of plates soar off the shelves and dance on the floor as a lifeboat drifts with people toward the part of the ship which crumbles several stories into the night sky. People glide down the slanted deck, and Jack's eyes narrow as he observes people and deck chairs colliding with each other. A brunette woman wriggles out of a man's grasp and glides on the deck on her stomach. All along the Titanic, people sway from ropes, leap from railings, or dive down into the ocean. More people perch over the railing at the back of the ship. One man floats and drifts into the icy water where small groups of survivors lounge on floating debris. Standing at the rear railing, the black-haired baker glances at a floating man ricochet off one of the giant propellers and pirouette into the sea. The baker retrieves a flask out of his pocket and inspects it. Jack rests his arms around Rose as she leans onto the railing. Sitting beside Molly in a lifeboat, Ruth's eyes are glossy as she squints from a distance, while Ismay, also in a lifeboat, glances away from the carnage and pinches his eyes shut. A crewman stretches toward a sparking circuit breaker, and a surge tosses him. All along the Titanic, electric lights shiver, then vanish as the rear of the ship continues to lean upward. Blood trickling down his forehead, Lovejoy clasps a side railing as it fractures. Inside the ship, a ceiling implodes as several support columns crumble, and small eruptions puff flames from portholes. A pair of men glide into the widening chasm, and the mighty ship cleaves in half, sending the rear of the boat drifting back toward the sea. The back of the Titanic taps down on the ocean surface, scattering dozens. The last of the funnels tumbles over as water dribbles into the gap between the two sections, which are still joined at the bottom, and the Titanic gradually fills with water and dips. Jack hops over the railing at the back of the ship as it inclines skyward quickly, and passengers manage to crawl over the railing. Sheets of water shimmer in the moonlight, which floats up from the ocean, and people dangling from railings misplace their grips and tumble. One man careens off a cab stand before colliding into other people clinging on below, creating a sequence of falling bodies. A blonde maid swings from the railing near Rose, who gazes into the young woman's eyes as she releases her grip and descends. Her breath appearing in the cold air, Rose peers toward the baker, who hunches on the railing beside her, and he returns her quiet gaze. Finally, the entire ship disappears."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Stacks of bananas slide off the cushions and smash on the carpet as a kite flows with cats away from the part of the hill which rises several stories into the night sky. Cats slide down the slanted ramp, and Felix's eyes widen as he watches cats and pillows smashing into each other. A red-haired woman slips out of a dog's grasp and slides on the ramp on her stomach. All along the Ferris wheel, cats dangle from vines, spill from fences, or slide down into the swamp. More cats climb over the fence at the back of the hill. One dog jumps and free falls into the frosty pond where small groups of dolphins cling to floating rafts. Standing at the rear fence, the gray-haired painter watches a diving dog bounce off one of the giant windmills and cartwheel into the river. The painter pulls an umbrella out of his pocket and takes a sip. Felix wraps his arms around Lily as she grips onto the fence. Sitting beside Clara in a kite, Margaret's eyes are glassy as she watches from a distance, while Wilson, also in a kite, turns away from the chaos and squeezes his eyes shut. A farmer reaches towards a sparking kitchen appliance, and a tremor flings him. All along the Ferris wheel, lanterns flicker, then go out as the rear of the hill continues to tilt upward. Juice streaming down his forehead, Thompson grips a side fence as it splits apart. Inside the building, a floor collapses as several support beams fail, and small bursts shoot steam from chimneys. A pair of dogs slide into the widening canyon, and the mighty hill snaps in half, sending the rear of the slope plunging back toward the pond. The back of the Ferris wheel slaps down on the pond surface, crushing dozens. The last of the chimneys topples over as soup rushes into the gap between the two sections, which are still joined at the bottom, and the Ferris wheel rapidly fills with soup and sinks. Felix climbs over the fence at the back of the hill as it tilts skyward swiftly, and visitors manage to scramble over the fence. Sheets of dew glimmer in the starlight, which rises up from the swamp, and cats dangling from fences lose their grips and fall. One dog bounces off a popcorn stand before slamming into other cats hanging on below, creating a domino effect of falling creatures. A blonde nurse dangles from the fence near Lily, who looks into the young woman's eyes as she loses her grip and falls. Her sigh visible in the frigid mist, Lily turns toward the painter, who crouches on the fence beside her, and he returns her silent gaze. Finally, the entire hill sinks."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Stacks of books tumble off the shelves and burst on the floor as a carriage rolls with animals away from the part of the castle which ascends several stories into the night sky. Animals glide down the slanted roof, and Peter's eyes widen as he notices animals and flower pots colliding with each other. A blonde man slips out of a woman's grasp and glides on the roof on his back. All along the galleon, animals dangle from vines, spill from walkways, or glide down into the river. More animals leap over the walkway at the back of the castle. One woman leaps and flies into the frigid lake where small groups of adventurers cling to floating leaves. Standing at the rear walkway, the red-haired gardener observes a leaping woman spin off one of the massive chimneys and somersault into the lake. The gardener retrieves a flask out of his bag and takes a sip. Peter wraps his arms around Mary as she holds onto the walkway. Sitting beside Lucy in a carriage, Edmund's eyes are glazed as he observes from a distance, while Caspian, also in a carriage, averts his eyes from the chaos and squeezes his eyes closed. An artisan reaches towards a sparking control panel, and a jolt tosses him. All along the galleon, lanterns flicker, then extinguish as the rear of the castle continues to tilt skyward. Water streaming down his cheek, Carter grips a side walkway as it fractures apart. Inside the castle, a chandelier collapses as several beams fail, and small fireworks shoot flames from windows. A pair of women glide into the expanding breach, and the majestic castle tears in half, sending the rear of the fortress plunging back toward the lake. The back of the galleon crashes down on the water's surface, crushing dozens. The final of the towers crumples over as water rushes into the space between the two sections, which are still joined at the base, and the galleon rapidly fills with water and submerges. Peter climbs over the walkway at the back of the castle as it tilts skyward rapidly, and visitors manage to scramble over the walkway. Curtains of mist shimmer in the moonlight, which ascends from the lake, and animals dangling from walkways lose their grips and plummet. One woman ricochets off a market stall before crashing into other animals hanging on below, creating a chain reaction of plummeting figures. A brunette butler dangles from the walkway near Mary, who looks into the young man's eyes as he loses his grip and plummets. Her breath visible in the cold air, Mary turns toward the gardener, who crouches on the walkway beside her, and he returns her silent stare. Finally, the entire castle vanishes."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Stacks of glasses tumble out of the cabinets and shatter on the ground as a kayak drifts with animals away from the part of the tower which ascends several stories into the cloudy sky. Animals glide down the inclined ramp, and Jack's eyes narrow as he observes animals and sun loungers colliding with each other. A red-haired woman wriggles out of a woman's embrace and glides on the ramp on her back. All along the Zeppelin, animals dangle from vines, tumble from ledges, or glide down into the jungle. More animals scamper over the ledge at the back of the tower. One animal leaps and free falls into the frigid river where small packs of escapees cling to drifting timber. Standing at the rear ledge, the brown-haired sailor observes a diving animal ricochet off one of the massive turbines and somersault into the lagoon. The sailor extracts a sandwich out of his sack and takes a bite. Jack coils his arms around Rose as she clutches onto the ledge. Lounging beside Molly in a kayak, Ruth's eyes are blurry as she watches from afar, while Ismay, also in a kayak, averts his gaze from the mayhem and pinches his eyes tight. A crewman reaches towards a sparking generator, and a jolt tosses him. All along the Zeppelin, neon lights flutter, then disappear as the rear of the tower continues to ascend. Ink leaking down his chin, Lovejoy clutches a side ledge as it bursts apart. Inside the tower, a floor collapses as several beams buckle, and small fireworks shoot sparks from windows. A duo of animals glide into the widening abyss, and the colossal tower fractures in two, sending the rear of the structure plummeting back toward the lagoon. The back of the Zeppelin slams down on the river surface, squashing dozens. The last of the spires tumbles over as liquid rushes into the rift between the two halves, which are still connected at the bottom, and the Zeppelin swiftly fills with liquid and submerges. Jack clambers over the ledge at the back of the tower as it ascends skyward rapidly, and adventurers manage to scamper over the ledge. Sheets of mist shimmer in the starlight, which ascends from the river, and animals dangling from ledges lose their grips and plunge. One animal ricochets off a signpost before crashing into other animals clinging on below, creating a chain reaction of tumbling bodies. A brunette butler dangles from the ledge near Rose, who gazes into the young man's eyes as he loses his grip and plummets. Her sigh visible in the chilly air, Rose turns toward the sailor, who crouches on the ledge beside her, and he returns her silent glance. Finally, the entire tower submerges."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Heaps of books tumble off the tables and shatter on the sidewalk as a hot air balloon drifts with cats away from the side of the mountain which stretches several clouds into the daytime haze. Creatures glide down the angled slope, and Max's ears twitch as he observes leaves and footstools colliding with each other. A red-haired child wriggles out of a hawk's talons and glides on the slope on her back. All along the skyscraper, animals swing from vines, tumble from ledges, or glide down into the jungle. More creatures scamper over the ledge at the base of the tower. One lizard hops and floats into the warm breeze where tiny flocks of critters cling to drifting logs. Perched at the front ledge, the orange-furred fox observes a soaring bird bounce off one of the colossal wind turbines and spiral into the meadow. The fox extracts a sandwich out of its backpack and takes a nibble. Max coils his legs around Daisy as she clutches onto the ledge. Lying beside Tilly in a gondola, Lucy's ears are misty as she observes from a height, while Harold, also in a gondola, averts his gaze from the chaos and covers his ears tight. A firefighter reaches towards a buzzing power line, and a jolt catapults him. All along the skyscraper, street lamps dim, then extinguish as the front of the mountain continues to lean downward. Ink streaming down her cheek, Harper clutches a top railing as it splinters away. Inside the tower, a floor crumbles as several beams give way, and tiny flares puff sparks from windows. A duo of penguins glide into the expanding cavern, and the sturdy cliff splits in two, sending the front of the slope diving back toward the meadow. The front of the skyscraper thumps down on the jungle canopy, flattening dozens. The final of the antennas collapses as wind rushes into the opening between the sections, which are still connected at the edge, and the skyscraper swiftly fills with leaves and descends. Max swings over the ledge at the front of the mountain as it tilts toward the sky swiftly, and climbers manage to scurry over the ledge. Streaks of rain shimmer in the starlight, which rises up from the meadow, and creatures dangling from ledges lose their clutches and tumble. One lizard bounces off a telephone booth before crashing into other creatures hanging on below, causing a chain reaction of falling forms. A brunette nurse hangs from the ledge near Daisy, who locks eyes with the young creature as she loses her clutch and tumbles. Her voice visible in the warm mist, Daisy turns toward the fox, who perches on the ledge beside her, and he returns her soundless stare. At last, the entire mountain ascends."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Plates crash to the floor as a lifeboat departs from the Titanic's rising stern. Passengers slide along the tilted deck, colliding with deck chairs, while onlookers like Jack watch in horror. People cling to railings or fall into the ocean, with some jumping into icy waters. A baker observes a man bounce off a propeller, taking a drink from his flask. Jack and Rose cling to the railing, while others, like Ruth and Ismay, witness the chaos from lifeboats. A crewmember is electrocuted, causing the Titanic's lights to flicker and die. Lovejoy grips a railing as explosions occur inside, and the ship splits in two, sending the rear crashing into the sea and crushing many. Water floods the ship, and it rapidly sinks. Jack and others scramble to the railing as the stern points skyward. In the moonlight, people lose their grip and fall. A maid near Rose loses her grip and falls, prompting a shared, silent moment between Rose and the baker before the Titanic vanishes beneath the waves."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Finally the entire ship sinks Rose turns toward the baker who crouches on the railing beside her and he returns her silent gaze Her breath visible in the cold air A blonde maid dangles from the railing near Rose who looks into the young woman's eyes as she loses her grip and falls One man bounces off a cab stand before slamming into other people hanging on below creating a domino effect of falling bodies Sheets of water glimmer in the moonlight which rises up from the ocean and people dangling from railings lose their grips and fall Jack climbs over the railing at the back of the ship as it tilts skyward rapidly and passengers manage to scramble over the railing The last of the funnels topples over as water rushes into the gap between the two sections which are still joined at the bottom and the Titanic rapidly fills with water and sinks The back of the Titanic slaps down on the ocean surface crushing dozens A pair of men slide into the widening chasm and the mighty ship snaps in half sending the rear of the boat plunging back toward the sea Inside the ship a ceiling collapses as several support columns fail and small explosions shoot flames from portholes Lovejoy grips a side railing as it splits apart Blood streaming down his forehead All along the Titanic electric lights flicker then go out as the rear of the ship continues to tilt upward A crewman reaches towards a sparking circuit breaker and a shock flings him Sitting beside Molly in a lifeboat Ruth's eyes are glassy as she watches from a distance while Ismay also in a lifeboat turns away from the carnage and squeezes his eyes shut Jack wraps his arms around Rose as she grips onto the railing The baker pulls a flask out of his pocket and takes a drink Standing at the rear railing the blackhaired baker watches a falling man bounce off one of the giant propellers and cartwheel into the sea One man jumps and free falls into the icy water where small groups of survivors cling to floating debris More people climb over the railing at the back of the ship All along the Titanic people dangle from ropes spill from railings or slide down into the ocean A brunette woman slips out of a man's grasp and slides on the deck on her stomach People slide down the slanted deck and Jack's eyes widen as he watches people and deck chairs smashing into each other Stacks of plates slide off the shelves and smash on the floor as a lifeboat flows with people away from the part of the ship which rises several stories into the night sky"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The back of the Titanic slaps down on the ocean surface crushing dozens Blood streaming down his forehead Sitting beside Molly in a lifeboat Ruth's eyes are glassy as she watches from a distance while Ismay also in a lifeboat turns away from the carnage and squeezes his eyes shut Sheets of water glimmer in the moonlight which rises up from the ocean and people dangling from railings lose their grips and fall Jack climbs over the railing at the back of the ship as it tilts skyward rapidly and passengers manage to scramble over the railing Standing at the rear railing the blackhaired baker watches a falling man bounce off one of the giant propellers and cartwheel into the sea One man jumps and free falls into the icy water where small groups of survivors cling to floating debris A crewman reaches towards a sparking circuit breaker and a shock flings him A pair of men slide into the widening chasm and the mighty ship snaps in half sending the rear of the boat plunging back toward the sea A blonde maid dangles from the railing near Rose who looks into the young woman's eyes as she loses her grip and falls All along the Titanic electric lights flicker then go out as the rear of the ship continues to tilt upward The last of the funnels topples over as water rushes into the gap between the two sections which are still joined at the bottom and the Titanic rapidly fills with water and sinks People slide down the slanted deck and Jack's eyes widen as he watches people and deck chairs smashing into each other Inside the ship a ceiling collapses as several support columns fail and small explosions shoot flames from portholes Her breath visible in the cold air Lovejoy grips a side railing as it splits apart A brunette woman slips out of a man's grasp and slides on the deck on her stomach Rose turns toward the baker who crouches on the railing beside her and he returns her silent gaze More people climb over the railing at the back of the ship Finally the entire ship sinks The baker pulls a flask out of his pocket and takes a drink Jack wraps his arms around Rose as she grips onto the railing Stacks of plates slide off the shelves and smash on the floor as a lifeboat flows with people away from the part of the ship which rises several stories into the night sky All along the Titanic people dangle from ropes spill from railings or slide down into the ocean One man bounces off a cab stand before slamming into other people hanging on below creating a domino effect of falling bodies"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Lovejoy grips a side railing as it splits apart Inside the ship a ceiling collapses as several support columns fail and small explosions shoot flames from portholes A pair of men slide into the widening chasm and the mighty ship snaps in half sending the rear of the boat plunging back toward the sea The back of the Titanic slaps down on the ocean surface crushing dozens The last of the funnels topples over as water rushes into the gap between the two sections which are still joined at the bottom and the Titanic rapidly fills with water and sinks Jack climbs over the railing at the back of the ship as it tilts skyward rapidly and passengers manage to scramble over the railing Sheets of water glimmer in the moonlight which rises up from the ocean and people dangling from railings lose their grips and fall One man bounces off a cab stand before slamming into other people hanging on below creating a domino effect of falling bodies A blonde maid dangles from the railing near Rose who looks into the young woman's eyes as she loses her grip and falls Her breath visible in the cold air Rose turns toward the baker who crouches on the railing beside her and he returns her silent gaze Finally the entire ship sinks Stacks of plates slide off the shelves and smash on the floor as a lifeboat flows with people away from the part of the ship which rises several stories into the night sky People slide down the slanted deck and Jack's eyes widen as he watches people and deck chairs smashing into each other A brunette woman slips out of a man's grasp and slides on the deck on her stomach All along the Titanic people dangle from ropes spill from railings or slide down into the ocean More people climb over the railing at the back of the ship One man jumps and free falls into the icy water where small groups of survivors cling to floating debris Standing at the rear railing the blackhaired baker watches a falling man bounce off one of the giant propellers and cartwheel into the sea The baker pulls a flask out of his pocket and takes a drink Jack wraps his arms around Rose as she grips onto the railing Sitting beside Molly in a lifeboat Ruth's eyes are glassy as she watches from a distance while Ismay also in a lifeboat turns away from the carnage and squeezes his eyes shut A crewman reaches towards a sparking circuit breaker and a shock flings him All along the Titanic electric lights flicker then go out as the rear of the ship continues to tilt upward Blood streaming down his forehead"
        }
      ]
    }
  ]
}