{
  "ground_truth": "Below the sky along the horizon, lifeboats row toward a waiting ship anchored amid floating icebergs as Rose opens her eyes when they row up alongside the ship Carpathia. Later, Titanic survivors recover on one of the ship's lower decks as nurses and crewmen flit amongst them. Still dressed in a tuxedo, Cal walks down a staircase onto the lower deck, brushes past a man, and walks into the survivors. Rose sits on a bench with a blanket wrapped around her, hooding her hair and head, and she glances up at Cal's back as he surveys the passengers, then looks away as he turns toward her, closing her eyes as Cal paces behind her. Rose peers sideways at Cal as he walks away. Her hair wet and stringy, Rose stands in pouring rain on the deck of the ship and stares up at the Statue of Liberty, the torch and crown glowing in the night. A ship's crewman holding a clipboard steps up to Rose, but Rose continues to stare up at the giant statue as the crewman moves on. Lizzy smiles. On the ocean floor, the two submersibles shine their lights on the Titanic's remains, then rise, leaving the wreck and darkness. At the surface, crewmen work to recover the submersibles, while standing with Lizzy on the research ship, Brock sniffs a cigar and then throws it into the water. Staring at Brock, Lizzy smiles and shakes her head. He turns and watches lights glint off the surface of rolling waves. Later that night, wearing only a nightgown, across the desolate deck, Rose's loose white hair blows in the wind as she clutches her hands over her heart and walks to a railing at the back of the ship. She grips the railing with one hand, pulls herself up onto the bottom rung, and stares down into the water. She unclasps her left hand, revealing the Heart of the Ocean, a large heart-shaped blue diamond that glints in the moonlight. On the deck of the Carpathia, young Rose stands in the rain and stares at the Statue of Liberty, frowning as she looks down and pulls the Heart of the Ocean out of her jacket pocket. Back on the deck of the Keldysh, Rose tosses the diamond necklace into the sea, and as the necklace sinks, Rose smiles and exhales deeply, watching as it twirls down to the dark ocean depths. Later, Rose sleeps in her berth beside her collection of framed photographs. In one picture, Rose stands beside a large fish; in another, she sits on an elephant's back. In a third, Rose wears a long scarf around her neck as she poses beside a biplane, and in another, Rose smiles astride a horse.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Beneath the heavens along the skyline, lifeboats paddle toward a waiting vessel anchored amid floating icebergs as Rose opens her eyes when they paddle up alongside the ship Carpathia. Later, Titanic survivors recuperate on one of the vessel's lower decks as nurses and crewmen flit amongst them. Still attired in a tuxedo, Cal descends a staircase onto the lower deck, brushes past a man, and walks into the survivors. Rose sits on a bench with a blanket wrapped around her, hooding her hair and head, and she glances up at Cal's back as he surveys the passengers, then looks away as he turns toward her, closing her eyes as Cal paces behind her. Rose peers sideways at Cal as he walks away. Her hair wet and stringy, Rose stands in pouring rain on the deck of the vessel and stares up at the Statue of Liberty, the torch and crown glowing in the night. A ship's crewman holding a clipboard steps up to Rose, but Rose continues to stare up at the giant statue as the crewman moves on. Lizzy smiles. On the ocean floor, the two submersibles shine their lights on the Titanic's remains, then ascend, leaving the wreck and darkness. At the surface, crewmen work to recover the submersibles, while standing with Lizzy on the research vessel, Brock sniffs a cigar and then throws it into the water. Staring at Brock, Lizzy smiles and shakes her head. He turns and watches lights glint off the surface of rolling waves. Later that night, wearing only a nightgown, across the desolate deck, Rose's loose white hair blows in the wind as she clutches her hands over her heart and walks to a railing at the back of the vessel. She grips the railing with one hand, pulls herself up onto the bottom rung, and stares down into the water. She unclasps her left hand, revealing the Heart of the Ocean, a large heart-shaped blue diamond that glints in the moonlight. On the deck of the Carpathia, young Rose stands in the rain and stares at the Statue of Liberty, frowning as she looks down and pulls the Heart of the Ocean out of her jacket pocket. Back on the deck of the Keldysh, Rose tosses the diamond necklace into the sea, and as the necklace sinks, Rose smiles and exhales deeply, watching as it twirls down to the dark ocean depths. Later, Rose sleeps in her berth beside her collection of framed photographs. In one picture, Rose stands beside a large fish; in another, she sits on an elephant's back. In a third, Rose wears a long scarf around her neck as she poses beside a biplane, and in another, Rose smiles astride a horse."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Below the sky along the horizon, lifeboats are rowed toward a waiting ship anchored amid floating icebergs as Rose's eyes are opened when the ship Carpathia is rowed up alongside. Later, nurses and crewmen recover survivors of the Titanic on one of the ship's lower decks, flitting amongst them. Still dressed in a tuxedo, a staircase is walked down by Cal onto the lower deck. He brushes past a man and walks into the survivors. Rose sits on a bench with a blanket wrapped around her, hooding her hair and head, and Cal's back is glanced up at by her as the passengers are surveyed by him, then her eyes are closed by her as he turns toward her, and he is paced behind by Cal. Rose peers sideways at Cal as he walks away. Her hair wet and stringy, the pouring rain is stood in by Rose on the deck of the ship, and the Statue of Liberty is stared up at by her, the torch and crown glowing in the night. A ship's crewman holding a clipboard steps up to Rose, but the giant statue is continued to be stared up at by Rose as the crewman moves on. Lizzy smiles. On the ocean floor, the lights of the two submersibles shine on the Titanic's remains, then the wreck and darkness are left as they rise. At the surface, the submersibles are worked to be recovered by crewmen, while standing with Lizzy on the research ship, a cigar is sniffed by Brock and then thrown into the water. Staring at Brock, a smile is given by Lizzy, and her head is shaken. Lights glint off the surface of rolling waves as he turns and watches. Later that night, wearing only a nightgown, across the desolate deck, Rose's loose white hair is blown in the wind by her as her hands are clutched over her heart, and a railing at the back of the ship is walked to by her. The railing is gripped with one hand by her, the bottom rung is pulled herself up onto, and the water is stared down into by her. Her left hand is unclasped, revealing the Heart of the Ocean, a large heart-shaped blue diamond that glints in the moonlight. On the deck of the Carpathia, standing in the rain, the Statue of Liberty is stared at by young Rose, frowning as the Heart of the Ocean is pulled out of her jacket pocket by her, and she looks down. Back on the deck of the Keldysh, the diamond necklace is tossed into the sea by Rose, and as the necklace sinks, a smile is given by Rose, and she exhales deeply, watching as it twirls down to the dark ocean depths. Later, in her berth, Rose sleeps beside her collection of framed photographs. In one picture, a large fish is stood beside by Rose; in another, an elephant's back is sat on by her. In a third, a long scarf is worn around her neck by Rose as she poses beside a biplane, and in another, Rose astrides a horse, smiling."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Below the horizon, lifeboats row toward the Carpathia amid icebergs as Rose opens her eyes when they reach the ship. Later, Titanic survivors recover on the lower decks as nurses and crew flit about. Still in a tuxedo, Cal descends a staircase, brushes past a man, and enters the survivor area. Rose, cloaked in a blanket on a bench, glances at Cal as he surveys the passengers, then turns away when he approaches. He walks past her, and Rose watches him leave. In pouring rain, Rose stands on deck, staring at the glowing Statue of Liberty. A crewman with a clipboard approaches, but Rose keeps looking at the statue. On the ocean floor, submersibles illuminate the Titanic's remains before rising. At the surface, crewmen recover them, and Brock, standing with Lizzy, tosses a cigar into the water. Lizzy smiles and shakes her head as Brock gazes at the waves. Later, Rose, in a nightgown, walks to the ship's railing, clutches her heart, stands on the rung, and looks into the water. She reveals the Heart of the Ocean, a large blue diamond, sparkling in the moonlight. Young Rose, on the Carpathia deck, pulls it from her pocket while looking at the Statue of Liberty. Back on the Keldysh, Rose throws the necklace into the sea, smiling as it sinks. Later, she sleeps beside framed photographs showing her vibrant life—beside a fish, on an elephant, near a biplane, and astride a horse."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Lifeboats row toward the ship Carpathia amid icebergs as Rose opens her eyes. Titanic survivors recover on the lower decks with nurses and crewmen assisting. Cal, in a tuxedo, descends to the lower deck and passes by the survivors, including Rose, who glances at him but looks away as he approaches. Rose stands in the rain, staring at the Statue of Liberty. A crewman with a clipboard approaches, but she continues to gaze at the statue. On the ocean floor, submersibles illuminate the Titanic before surfacing. Crewmen recover them as Brock, standing with Lizzy, discards a cigar into the sea. Lizzy smiles as they watch the waves. Later that night, Rose, in a nightgown, walks to the ship's railing, clutches the Heart of the Ocean diamond, and lets it fall into the sea. Young Rose, on Carpathia's deck, also stands in the rain staring at the statue. Back on the Keldysh, she smiles, watching the diamond sink. Rose sleeps in her berth surrounded by photographs showing her beside a fish, on an elephant, with a biplane, and astride a horse."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Beneath the vast expanse of the sky, just along the distant horizon, small lifeboats are seen rowing diligently toward a ship that waits, anchored amidst a sea dotted with floating icebergs. As one of the lifeboats pulls up alongside the ship known as the Carpathia, Rose slowly opens her eyes. Later on, the survivors of the Titanic disaster are seen gradually recovering on one of the ship's lower decks, where nurses and crewmen flit efficiently amongst them, tending to their needs. Cal, still dressed impeccably in a tuxedo, makes his way down a staircase and onto the lower deck. He brushes past a man without a second glance and strides purposefully into the area filled with survivors. Seated on a bench with a warm blanket wrapped snugly around her body, hooding both her hair and head, Rose glances up just in time to see Cal’s back as he surveys the passengers. She then averts her gaze when Cal turns toward her, choosing to close her eyes as he paces behind her. Afterward, Rose peers sideways at Cal, watching him as he finally walks away. With her hair wet and stringy from rain, Rose stands alone on the deck of the ship, staring up at the Statue of Liberty. The iconic torch and crown glow brilliantly in the night. A crewman from the ship, holding a clipboard, approaches Rose, but she seems captivated by the giant statue, continuing to gaze upward as the crewman eventually moves on. Lizzy stands nearby, smiling gently. \n\nOn the ocean floor, the two submersibles illuminate the Titanic's haunting remains with their lights before rising up, leaving the wreck in darkness below. At the surface, the dedicated crewmen work diligently to recover the submersibles. Standing alongside Lizzy on the research ship, Brock sniffs a cigar, considers briefly, and then casually tosses it into the water. Lizzy, staring at Brock, smiles warmly and shakes her head in gentle amusement. Brock turns his attention to watch as lights shimmer and glint off the surface of the rolling waves. Later that same night, while wearing nothing more than a nightgown, Rose walks across the desolate, windswept deck, her loose white hair blowing freely in the wind. She clutches her hands firmly over her heart as she approaches a railing positioned at the back of the ship. Gripping the railing with determination, she pulls herself up onto the bottom rung and stares intently down into the vast expanse of water below. She then unclasped her left hand, revealing the Heart of the Ocean—a large, heart-shaped blue diamond that catches and reflects the moonlight brilliantly. Standing on the deck of the Carpathia, young Rose appears alone in the pouring rain, staring solemnly at the Statue of Liberty. She frowns slightly as she looks down and pulls the dazzling Heart of the Ocean out from inside her jacket pocket. Back on the deck of the Keldysh, Rose makes a choice, tossing the diamond necklace into the sea. As the necklace twirls and sinks gracefully, Rose smiles softly and exhales deeply, watching as it descends into the dark ocean depths below. Later on, Rose is seen asleep in her cabin, nestled beside her collection of framed photographs. In one of these cherished pictures, Rose stands proudly beside a large fish; in another, she is seated atop an elephant's back. In a third photograph, Rose, with a long scarf draped elegantly around her neck, poses alongside a biplane. In yet another image, Rose is captured smiling while astride a horse, a picture of timeless grace."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Beneath the sprawling, endless expanse of the blue sky, just along the distant, almost unreachable horizon, several small lifeboats are seen diligently rowing with great effort and determination toward a waiting ship. This ship, known as the Carpathia, remains anchored amidst a vast sea that is dotted with floating icebergs, creating an otherworldly seascape. As one of these lifeboats finally pulls up alongside the ship, Rose slowly and gently opens her eyes, awakening to her new reality. Later, the survivors of the tragic Titanic disaster are observed gradually recovering on one of the lower decks of the ship, where nurses and crewmen are moving efficiently amongst them, attentively tending to their various needs with care and compassion. Cal, still impeccably dressed in a tuxedo, makes his way down a grand staircase and onto the lower deck. He brushes past a man without giving him a second glance and strides with clear purpose into the area where the survivors are gathered. Seated on a bench with a warm, comforting blanket wrapped snugly around her body, hooding both her hair and head, Rose glances up just in time to see Cal’s back as he surveys the passengers. She then deliberately averts her gaze when Cal turns toward her direction, choosing to keep her eyes closed as he paces behind her, unnoticed. Afterward, Rose carefully peers sideways at Cal, watching him intently as he finally walks away from her. With her hair wet and stringy from the drizzling rain, Rose stands alone on the deck of the ship, staring up at the magnificent and iconic Statue of Liberty. The statue's torch and crown glow brilliantly and dramatically in the night. A crewman from the ship, holding a clipboard filled with notes, approaches Rose, but she remains captivated by the immense statue, continuing to gaze upward as the crewman eventually moves on, respecting her trance. Lizzy stands nearby, smiling gently and supportively.\n\nFar below on the ocean floor, two submersibles illuminate the haunting remains of the Titanic with their bright, powerful lights before rising up, leaving the now eerily dark wreck in shadowed silence below. At the surface, the dedicated and hardworking crewmen carefully work to recover the submersibles, bringing them safely back aboard. Standing alongside Lizzy on the research ship, Brock sniffs a cigar, considers its aroma briefly, and then casually decides to toss it into the water. Lizzy, watching Brock with amusement, smiles warmly and shakes her head in gentle amusement. Brock then turns his attention to watch as the lights shimmer and glint off the surface of the rolling, restless waves. Later that same night, while wearing nothing more than a simple nightgown, Rose walks across the deserted, windswept deck, her loose white hair blowing freely in the strong wind. She clutches her hands firmly over her heart as she approaches a railing positioned at the very back of the ship. With determination, she grips the railing and pulls herself up onto the bottom rung, staring intently and thoughtfully down into the vast expanse of water below. She then unclasped her left hand, revealing the Heart of the Ocean—a large, heart-shaped blue diamond that catches and reflects the moonlight brilliantly and with breathtaking beauty. Standing on the deck of the Carpathia, young Rose appears alone and introspective in the pouring rain, staring solemnly at the Statue of Liberty. She frowns slightly as her gaze shifts downward, and she pulls the dazzling Heart of the Ocean out from inside her jacket pocket. Back on the deck of the Keldysh, Rose makes a decisive choice, tossing the diamond necklace into the sea. As the necklace twirls and sinks gracefully, Rose smiles softly and exhales deeply, watching silently as it descends into the dark, mysterious ocean depths below. Later on, Rose is seen peacefully asleep in her cabin, nestled cozily beside her collection of cherished framed photographs. In one of these precious pictures, Rose stands proudly beside a large fish; in another, she is seated atop an elephant's back with a look of adventure. In a third photograph, Rose, with a long scarf draped elegantly around her neck, poses confidently alongside a biplane. In yet another captivating image, Rose is captured smiling while astride a horse, exuding timeless grace and elegance."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Beneath the vast expanse of the sky along the distant horizon, lifeboats steadily row forward, their oars slicing through the water with each synchronized pull, making their way toward the ship Carpathia, which remains anchored amid a scattered field of floating icebergs. As the boats draw nearer, gently bobbing beside the ship, Rose slowly opens her eyes, taking in the sight before her. Later, amid the gentle hum of activity on one of Carpathia's lower decks, Titanic survivors find a moment of recovery, their weary forms nestled together as nurses and crewmen move swiftly among them, attending to their various needs with practiced efficiency. Among the survivors, Cal, still impeccably dressed in his tuxedo, descends a flight of stairs, each step brisk and deliberate. He brushes past a man without a second glance and strides purposefully into the midst of the gathered survivors. Seated on a bench, wrapped snugly in a blanket that shields her from the cold and conceals her hair and head, Rose allows her eyes to drift upward, catching a glimpse of Cal's back as he scans the sea of passengers. Her gaze lingers momentarily before she turns her eyes away, closing them softly as Cal shifts direction, pacing behind her. With a sideways glance, she observes Cal's retreating figure as he moves away from her. On another part of the ship, with rain pouring relentlessly, Rose stands exposed to the elements, her hair wet and stringy, and casts her eyes upward toward the towering figure of the Statue of Liberty, whose torch and crown emit a warm glow against the night sky. A ship's crewman, clipboard in hand, approaches Rose, but her attention remains fixed on the monumental statue above as he eventually moves on without interaction. Nearby, Lizzy observes the scene, a smile playing on her lips. Meanwhile, on the ocean floor, the two submersibles diligently illuminate the remnants of the Titanic with their lights before beginning their ascent, leaving the wreck behind them as darkness closes in. Above the surface, crewmen engage in the task of recovering the submersibles, their efforts a synchronized dance of precision and coordination. On the deck of the research ship, beside Lizzy, Brock lifts a cigar to his nose, taking in its aroma before nonchalantly tossing it into the ocean. As he does so, Lizzy regards him with amusement, her smile broadening as she gently shakes her head. Brock then turns his attention to the horizon, watching as the glinting lights play off the undulating surface of the waves. Later that night, under the cloak of solitude across the desolate deck, Rose, wearing only a nightgown, allows her loose white hair to be caught and whipped by the wind. She places her hands over her heart in a gesture of introspection and walks toward the ship's railing at the stern. Once there, she firmly grips the railing with one hand, carefully pulling herself up onto the bottom rung, her gaze fixed downward into the dark, swirling waters below. With a deliberate motion, she unclenches her left hand, revealing the Heart of the Ocean, a magnificent heart-shaped blue diamond that catches and reflects the moonlight. Transported back to the rain-soaked deck of the Carpathia, young Rose stares intently at the Statue of Liberty, her expression troubled as she looks down, extracting the Heart of the Ocean from her jacket pocket. Returning to the present, on the deck of the Keldysh, Rose releases the diamond necklace into the sea with a graceful toss, watching as it spins and sinks, disappearing into the ocean's depths. A serene smile graces her lips, and she exhales deeply, feeling a sense of closure. Later still, Rose rests peacefully in her berth, surrounded by her cherished collection of framed photographs. In one, she stands proudly beside a large fish, in another, she sits atop an elephant's back, her presence one of assured elegance. In a third image, Rose, adorned with a long scarf around her neck, poses confidently beside a biplane, while in yet another, she smiles joyfully astride a horse, each picture capturing a snippet of the adventurous life she has led."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Beneath the sky, lifeboats row towards the waiting ship Carpathia anchored amidst floating icebergs. Rose opens her eyes as they approach. Later, Titanic survivors gather on the ship's lower deck, attended by nurses and crewmen. Cal, still in his tuxedo, walks among the survivors, briefly passing Rose, who sits wrapped in a blanket. She glances at him as he surveys the passengers. As he moves away, Rose turns her attention elsewhere. Standing in the pouring rain on the deck, Rose gazes up at the illuminated Statue of Liberty, oblivious to a crewman with a clipboard. Meanwhile, on the ocean floor, submersibles illuminate the Titanic's remains before resurfacing, where crewmen recover them. On the research ship, Lizzy smiles at Brock as he discards his cigar into the water, then watches the lights reflect off the waves. Later that night, Rose, in a nightgown and with hair blowing in the wind, walks to the ship's railing. She reveals the Heart of the Ocean diamond before discarding it into the sea, smiling as it sinks into the depths. In her berth, Rose sleeps beside a collection of framed photographs, capturing her adventurous spirit in various moments: standing beside a fish, sitting on an elephant, posing with a biplane, and smiling astride a horse."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Below the sky along the horizon, lifeboats row toward a waiting ship anchored amid floating icebergs, remnants of the massive breakup of the Titanic, as Rose opens her eyes when they row up alongside the ship Carpathia, the vessel famously known for rescuing over 700 Titanic survivors. Later, Titanic survivors recover on one of the ship's lower decks as nurses and crewmen, trained in emergency care due to their roles, flit amongst them. Still dressed in a tuxedo, indicative of his first-class status, Cal walks down a staircase onto the lower deck, brushes past a man who is shivering under a blanket, and walks into the survivors. Rose sits on a bench with a blanket wrapped around her, hooding her hair and head, and she glances up at Cal's back as he surveys the passengers with a cold detachment, then looks away as he turns toward her, closing her eyes as Cal paces behind her. Rose peers sideways at Cal as he walks away. Her hair wet and stringy, Rose stands in pouring rain on the deck of the ship and stares up at the Statue of Liberty, a symbol of hope and freedom for many immigrants arriving in America, the torch and crown glowing in the night. A ship's crewman holding a clipboard, conducting a headcount of survivors, steps up to Rose, but Rose continues to stare up at the giant statue as the crewman moves on. Lizzy, Rose's granddaughter who is learning about her grandmother's past, smiles. On the ocean floor, the two submersibles shine their lights on the Titanic's remains, a relic of early 20th-century engineering triumph and tragedy, then rise, leaving the wreck and darkness. At the surface, crewmen work to recover the submersibles, while standing with Lizzy on the research ship, Brock, a treasure hunter who spent years searching for the Heart of the Ocean, sniffs a cigar and then throws it into the water. Staring at Brock, Lizzy smiles and shakes her head. He turns and watches lights glint off the surface of rolling waves, contemplating the end of his obsessive quest. Later that night, wearing only a nightgown, across the desolate deck, Rose's loose white hair, a striking contrast against the dark sea, blows in the wind as she clutches her hands over her heart and walks to a railing at the back of the ship. She grips the railing with one hand, pulls herself up onto the bottom rung, and stares down into the water. She unclasps her left hand, revealing the Heart of the Ocean, a large heart-shaped blue diamond, rumored to be linked to the Hope Diamond, that glints in the moonlight. On the deck of the Carpathia, young Rose stands in the rain and stares at the Statue of Liberty, frowning as she looks down and pulls the Heart of the Ocean out of her jacket pocket, the weight of its history pressing on her. Back on the deck of the Keldysh, a modern research vessel named after a pioneering Soviet mathematician, Rose tosses the diamond necklace into the sea, and as the necklace sinks, Rose smiles and exhales deeply, finally freed from the burden of her secret, watching as it twirls down to the dark ocean depths. Later, Rose sleeps in her berth beside her collection of framed photographs, representing her adventurous spirit throughout life. In one picture, Rose stands beside a large fish, possibly from a deep-sea fishing trip; in another, she sits on an elephant's back during a trip to India. In a third, Rose wears a long scarf around her neck as she poses beside a biplane, echoing her fascination with the early days of aviation, and in another, Rose smiles astride a horse, her love for equestrian pursuits evident."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He turns and watches lights glint off the surface of rolling waves the torch and crown glowing in the night Below the sky along the horizon lifeboats row toward a waiting ship anchored amid floating icebergs as Rose opens her eyes when they row up alongside the ship Carpathia Later Titanic survivors recover on one of the ship's lower decks as nurses and crewmen flit amongst them Still dressed in a tuxedo Cal walks down a staircase onto the lower deck brushes past a man and walks into the survivors Rose sits on a bench with a blanket wrapped around her hooding her hair and head and she glances up at Cal's back as he surveys the passengers then looks away as he turns toward her closing her eyes as Cal paces behind her Rose peers sideways at Cal as he walks away Her hair wet and stringy Back on the deck of the Keldysh Rose tosses the diamond necklace into the sea and as the necklace sinks Rose smiles and exhales deeply watching as it twirls down to the dark ocean depths Rose sits on a bench with a blanket wrapped around her hooding her hair and head and she glances up at Cal's back as he surveys the passengers then looks away as he turns toward her closing her eyes as Cal paces behind her Later Titanic survivors recover on one of the ship's lower decks as nurses and crewmen flit amongst them Rose stands in pouring rain on the deck of the ship and stares up at the Statue of Liberty the torch and crown glowing in the night A ship's crewman holding a clipboard steps up to Rose but Rose continues to stare up at the giant statue as the crewman moves on Rose peers sideways at Cal as he walks away Lizzy smiles Still dressed in a tuxedo Cal walks down a staircase onto the lower deck brushes past a man and walks into the survivors On the ocean floor the two submersibles shine their lights on the Titanic's remains then rise leaving the wreck and darkness At the surface crewmen work to recover the submersibles while standing with Lizzy on the research ship In one picture Rose stands beside a large fish Brock sniffs a cigar and then throws it into the water Staring at Brock Lizzy smiles and shakes her head In a third Rose wears a long scarf around her neck as she poses beside a biplane and in another Rose smiles astride a horse Below the sky along the horizon lifeboats row toward a waiting ship anchored amid floating icebergs as Rose opens her eyes when they row up alongside the ship Carpathia He turns and watches lights glint off the surface of rolling waves Later that night wearing only a nightgown across the desolate deck A ship's crewman holding a clipboard steps up to Rose but Rose continues to stare up at the giant statue as the crewman moves on Rose's loose white hair blows in the wind as she clutches her hands over her heart and walks to a railing at the back of the ship She grips the railing with one hand pulls herself up onto the bottom rung and stares down into the water She unclasps her left hand revealing the Heart of the Ocean a large heartshaped blue diamond that glints in the moonlight in another she sits on an elephant's back Staring at Brock Lizzy smiles and shakes her head On the deck of the Carpathia young Rose stands in the rain and stares at the Statue of Liberty frowning as she looks down and pulls the Heart of the Ocean out of her jacket pocket Back on the deck of the Keldysh Rose tosses the diamond necklace into the sea and as the necklace sinks Rose smiles and exhales deeply watching as it twirls down to the dark ocean depths Later Rose sleeps in her berth beside her collection of framed photographs In one picture Rose stands beside a large fish in another she sits on an elephant's back In a third Rose wears a long scarf around her neck as she poses beside a biplane and in another Rose smiles astride a horse"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Below the sky along the horizon lifeboats row toward a waiting ship anchored amid floating icebergs as Rose opens her eyes when they row up alongside the ship Carpathia. Later Titanic survivors recover on one of the ship's lower decks as nurses and crewmen flit amongst them. Still dressed in a tuxedo Cal walks down a staircase onto the lower deck brushes past a man and walks into the survivors. Rose sits on a bench with a blanket wrapped around her hooding her hair and head and she glances up at Cal's back as he surveys the passengers then looks away as he turns toward her closing her eyes as Cal paces behind her. Rose peers sideways at Cal as he walks away. Her hair wet and stringy. Rose stands in pouring rain on the deck of the ship and stares up at the Statue of Liberty. the torch and crown glowing in the night. A ship's crewman holding a clipboard steps up to Rose but Rose continues to stare up at the giant statue as the crewman moves on. Lizzy smiles. On the ocean floor the two submersibles shine their lights on the Titanic's remains then rise leaving the wreck and darkness. At the surface crewmen work to recover the submersibles while standing with Lizzy on the research ship. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Brock sniffs a cigar and then throws it into the water. Staring at Brock Lizzy smiles and shakes her head. He turns and watches lights glint off the surface of rolling waves. Later that night wearing only a nightgown across the desolate deck. Rose's loose white hair blows in the wind as she clutches her hands over her heart and walks to a railing at the back of the ship. She grips the railing with one hand pulls herself up onto the bottom rung and stares down into the water. She unclasps her left hand revealing the Heart of the Ocean a large heartshaped blue diamond that glints in the moonlight. On the deck of the Carpathia young Rose stands in the rain and stares at the Statue of Liberty frowning as she looks down and pulls the Heart of the Ocean out of her jacket pocket. Back on the deck of the Keldysh Rose tosses the diamond necklace into the sea and as the necklace sinks Rose smiles and exhales deeply watching as it twirls down to the dark ocean depths. Later Rose sleeps in her berth beside her collection of framed photographs. In one picture Rose stands beside a large fish. in another she sits on an elephant's back. In a third Rose wears a long scarf around her neck as she poses beside a biplane and in another Rose smiles astride a horse."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Below the sky along the horizon lifeboats row toward a waiting ship anchored amid floating icebergs as Rose opens her eyes when they row up alongside the ship Carpathia. Later Titanic survivors recover on one of the ship's lower decks as nurses and crewmen flit amongst them. Still dressed in a tuxedo Cal walks down a staircase onto the lower deck brushes past a man and walks into the survivors. Rose sits on a bench with a blanket wrapped around her hooding her hair and head and she glances up at Cal's back as he surveys the passengers then looks away as he turns toward her closing her eyes as Cal paces behind her. Rose peers sideways at Cal as he walks away. Her hair wet and stringy. Rose stands in pouring rain on the deck of the ship and stares up at the Statue of Liberty. the torch and crown glowing in the night. A ship's crewman holding a clipboard steps up to Rose but Rose continues to stare up at the giant statue as the crewman moves on. Lizzy smiles. On the ocean floor the two submersibles shine their lights on the Titanic's remains then rise leaving the wreck and darkness. At the surface crewmen work to recover the submersibles while standing with Lizzy on the research ship. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Brock sniffs a cigar and then throws it into the water. Staring at Brock Lizzy smiles and shakes her head. He turns and watches lights glint off the surface of rolling waves. Later that night wearing only a nightgown across the desolate deck. Rose's loose white hair blows in the wind as she clutches her hands over her heart and walks to a railing at the back of the ship. She grips the railing with one hand pulls herself up onto the bottom rung and stares down into the water. She unclasps her left hand revealing the Heart of the Ocean a large heartshaped blue diamond that glints in the moonlight. On the deck of the Carpathia young Rose stands in the rain and stares at the Statue of Liberty frowning as she looks down and pulls the Heart of the Ocean out of her jacket pocket. Back on the deck of the Keldysh Rose tosses the diamond necklace into the sea and as the necklace sinks Rose smiles and exhales deeply watching as it twirls down to the dark ocean depths. Later Rose sleeps in her berth beside her collection of framed photographs. In one picture Rose stands beside a large fish. in another she sits on an elephant's back. In a third Rose wears a long scarf around her neck as she poses beside a biplane and in another Rose smiles astride a horse."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Below the sky along the horizon lifeboats row toward a waiting ship anchored amid floating icebergs as Rose opens her eyes when they row up alongside the ship Carpathia. Later Titanic survivors recover on one of the ship's lower decks as nurses and crewmen flit amongst them. Still dressed in a tuxedo Cal walks down a staircase onto the lower deck brushes past a man and walks into the survivors. Rose sits on a bench with a blanket wrapped around her hooding her hair and head and she glances up at Cal's back as he surveys the passengers then looks away as he turns toward her closing her eyes as Cal paces behind her. Rose peers sideways at Cal as he walks away. Her hair wet and stringy. She unclasps her left hand revealing the Heart of the Ocean a large heartshaped blue diamond that glints in the moonlight. On the deck of the Carpathia young Rose stands in the rain and stares at the Statue of Liberty frowning as she looks down and pulls the Heart of the Ocean out of her jacket pocket. Back on the deck of the Keldysh Rose tosses the diamond necklace into the sea and as the necklace sinks Rose smiles and exhales deeply watching as it twirls down to the dark ocean depths. Later Rose sleeps in her berth beside her collection of framed photographs. In one picture Rose stands beside a large fish. in another she sits on an elephant's back. In a third Rose wears a long scarf around her neck as she poses beside a biplane and in another Rose smiles astride a horse."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Below the sky along the horizon lifeboats row toward a waiting ship anchored amid floating icebergs as Rose opens her eyes when they row up alongside the ship Carpathia. Later Titanic survivors recover on one of the ship's lower decks as nurses and crewmen flit amongst them. In one picture Rose stands beside a large fish. in another she sits on an elephant's back. In a third Rose wears a long scarf around her neck as she poses beside a biplane and in another Rose smiles astride a horse."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Below the sky along the horizon, penguins row toward a waiting ship anchored amid floating icebergs as a squirrel opens her eyes when they row up alongside the ship Carpathia. Later, Titanic survivors recover on one of the ship's lower decks as raccoons and dolphins flit amongst them. Still dressed in a tuxedo, a kangaroo walks down a staircase onto the lower deck, brushes past a man, and walks into the survivors. A giraffe sits on a bench with a blanket wrapped around her, hooding her hair and head, and she glances up at the kangaroo's back as he surveys the passengers, then looks away as he turns toward her, closing her eyes as the kangaroo paces behind her. The giraffe peers sideways at the kangaroo as he walks away. Her hair wet and stringy, a penguin stands in pouring rain on the deck of the ship and stares up at the Statue of Liberty, the torch and crown glowing in the night. A ship's turtle holding a clipboard steps up to the penguin, but the penguin continues to stare up at the giant statue as the turtle moves on. A dragonfly smiles. On the ocean floor, the two elephants shine their lights on the Titanic's remains, then rise, leaving the wreck and darkness. At the surface, dolphins work to recover the elephants, while standing with the dragonfly on the research ship, an owl sniffs a cigar and then throws it into the water. Staring at the owl, the dragonfly smiles and shakes her head. He turns and watches lights glint off the surface of rolling waves. Later that night, wearing only a nightgown, across the desolate deck, a hedgehog's loose white hair blows in the wind as she clutches her hands over her heart and walks to a railing at the back of the ship. She grips the railing with one hand, pulls herself up onto the bottom rung, and stares down into the water. She unclasps her left hand, revealing the Heart of the Ocean, a large heart-shaped blue diamond that glints in the moonlight. On the deck of the Carpathia, a young koala stands in the rain and stares at the Statue of Liberty, frowning as she looks down and pulls the Heart of the Ocean out of her jacket pocket. Back on the deck of the Keldysh, a flamingo tosses the diamond necklace into the sea, and as the necklace sinks, the flamingo smiles and exhales deeply, watching as it twirls down to the dark ocean depths. Later, a sloth sleeps in her berth beside her collection of framed photographs. In one picture, the sloth stands beside a large fish; in another, she sits on an elephant's back. In a third, the sloth wears a long scarf around her neck as she poses beside a biplane, and in another, the sloth smiles astride a horse."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Below the sky along the horizon, rafts row toward a waiting lighthouse anchored amid floating lily pads as Rose opens her eyes when they row up alongside the lighthouse Meridian. Later, Titanic survivors recover on one of the lighthouse's lower platforms as medics and sailors flit amongst them. Still dressed in a tuxedo, Cal walks down a ramp onto the lower platform, brushes past a woman, and walks into the survivors. Rose sits on a stool with a shawl wrapped around her, hooding her hair and head, and she glances up at Cal's back as he surveys the visitors, then looks away as he turns toward her, closing her eyes as Cal paces behind her. Rose peers sideways at Cal as he walks away. Her hair wet and stringy, Rose stands in pouring rain on the platform of the lighthouse and stares up at the Eiffel Tower, the lights and beams glowing in the night. A lighthouse keeper holding a notepad steps up to Rose, but Rose continues to stare up at the giant tower as the keeper moves on. Lizzy smiles. On the ocean floor, the two mini-subs shine their lights on the Titanic's remains, then rise, leaving the wreck and darkness. At the surface, sailors work to recover the mini-subs, while standing with Lizzy on the exploration vessel, Brock sniffs a pipe and then throws it into the water. Staring at Brock, Lizzy smiles and shakes her head. He turns and watches lights glint off the surface of rolling waves. Later that night, wearing only a nightgown, across the desolate platform, Rose's loose white hair blows in the wind as she clutches her hands over her heart and walks to a railing at the back of the lighthouse. She grips the railing with one hand, pulls herself up onto the bottom rung, and stares down into the water. She unclasps her left hand, revealing the Sea Whisperer, a large heart-shaped green emerald that glints in the moonlight. On the platform of the Meridian, young Rose stands in the rain and stares at the Eiffel Tower, frowning as she looks down and pulls the Sea Whisperer out of her jacket pocket. Back on the platform of the Antares, Rose tosses the emerald necklace into the sea, and as the necklace sinks, Rose smiles and exhales deeply, watching as it twirls down to the dark ocean depths. Later, Rose sleeps in her cabin beside her collection of framed photographs. In one picture, Rose stands beside a large whale; in another, she sits on a camel's back. In a third, Rose wears a long cape around her shoulders as she poses beside a zeppelin, and in another, Rose smiles astride a donkey."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Below the sky along the horizon, lifeboats float toward a waiting ship anchored amid floating icebergs as Rose closes her eyes when they drift up alongside the ship Carpathia. Later, Titanic survivors assemble on one of the ship's lower decks as nurses and crewmen hover amongst them. Still dressed in a tuxedo, Cal skips down a staircase onto the lower deck, nudges past a man, and skips into the survivors. Rose lounges on a bench with a blanket wrapped around her, sheltering her hair and head, and she peers up at Cal's back as he examines the passengers, then turns away as he shifts toward her, opening her eyes as Cal strolls behind her. Rose squints sideways at Cal as he jogs away. Her hair wet and stringy, Rose stands in pouring rain on the deck of the ship and gapes up at the Statue of Liberty, the torch and crown shimmering in the night. A ship's crewman holding a clipboard approaches Rose, but Rose continues to gape up at the giant statue as the crewman advances on. Lizzy chuckles. On the ocean floor, the two submersibles dim their lights on the Titanic's remains, then drift, leaving the wreck and darkness. At the surface, crewmen strive to secure the submersibles, while standing with Lizzy on the research ship, Brock inhales a cigar and then drops it into the water. Watching Brock, Lizzy chuckles and shakes her head. He rotates and observes lights shimmer off the surface of rolling waves. Later that night, wearing only a nightgown, across the desolate deck, Rose's loose white hair flutters in the wind as she presses her hands over her heart and skips to a railing at the back of the ship. She caresses the railing with one hand, hoists herself up onto the bottom rung, and squints down into the water. She unclenches her left hand, revealing the Heart of the Ocean, a large heart-shaped blue diamond that shimmers in the moonlight. On the deck of the Carpathia, young Rose stands in the rain and gapes at the Statue of Liberty, grimacing as she glances down and extracts the Heart of the Ocean from her jacket pocket. Back on the deck of the Keldysh, Rose releases the diamond necklace into the sea, and as the necklace drifts, Rose chuckles and inhales deeply, watching as it spirals down to the dark ocean depths. Later, Rose naps in her berth beside her collection of framed photographs. In one picture, Rose lounges beside a large fish; in another, she perches on an elephant's back. In a third, Rose wraps a long scarf around her neck as she poses beside a biplane, and in another, Rose grins astride a horse."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Below the clouds along the skyline, wagons glide toward a waiting balloon anchored amid floating lily pads as Lily opens her eyes when they glide up alongside the balloon Odyssey. Later, Concorde escapees lounge on one of the balloon's lower decks as doctors and sailors flit amongst them. Still dressed in a raincoat, Fred walks down a ramp onto the lower deck, brushes past a giraffe, and waltzes into the escapees. Lily sits on a swing with a shawl wrapped around her, covering her ears and face, and she glances up at Fred's hat as he surveys the tourists, then looks away as he turns toward her, closing her eyes as Fred strolls behind her. Lily peers sideways at Fred as he walks away. Her ears wet and tangled, Lily stands in pouring snow on the deck of the balloon and stares up at Big Ben, the spire and clock glowing in the night. A balloon's sailor holding a notepad steps up to Lily, but Lily continues to stare up at the towering clock as the sailor moves on. Martha smiles. On the desert floor, the two tractors shine their lights on Concorde's remains, then rise, leaving the wreck and shadows. At the surface, sailors work to recover the tractors, while standing with Martha on the research balloon, Duke sniffs a pipe and then throws it into the sand. Staring at Duke, Martha smiles and shakes her head. He turns and watches lights glint off the surface of drifting sand dunes. Later that night, wearing only a nightcap, across the empty wing, Lily's loose yellow ears flap in the breeze as she clutches her hands over her knees and walks to a railing at the front of the balloon. She grips the railing with one toe, pulls herself up onto the bottom ridge, and stares down into the fog. She unclasps her right toe, revealing the Heart of the Jungle, a large heart-shaped green emerald that glints in the starlight. On the deck of the Odyssey, young Lily stands in the snow and stares at Big Ben, frowning as she looks down and pulls the Heart of the Jungle out of her coat pocket. Back on the deck of the Voyager, Lily tosses the emerald necklace into the desert, and as the necklace sinks, Lily smiles and exhales deeply, watching as it twirls down to the dark desert depths. Later, Lily dozes in her hammock beside her collection of framed sketches. In one picture, Lily stands beside a massive toad; in another, she sits on a camel's back. In a third, Lily wears a long feather around her neck as she poses beside a windmill, and in another, Lily smiles astride a penguin."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Below the ocean along the reef, sea turtles glide toward a mysterious submarine anchored amid swirling seagrass as Daisy closes her ears when they drift up alongside the submarine Nautilus. Later, Atlantis explorers relax on one of the submarine's upper decks as chefs and scientists dash amongst them. Still dressed in a kimono, Max sails up a ladder onto the upper deck, nods at a dolphin, and meanders into the explorers. Daisy lounges on a hammock with a shawl draped over her, shading her shoulders and arms, and she peers up at Max's shadow as he examines the coral, then turns away as he rotates toward her, blinking her eyes as Max drifts past her. Daisy watches sideways at Max as he floats away. Her hair dry and sandy, Daisy reclines in gentle sunlight on the deck of the submarine and gazes up at the Eiffel Tower, the iron and beams gleaming in the day. A submarine's scientist holding a microphone approaches Daisy, but Daisy continues to gaze up at the towering structure as the scientist drifts on. Nikki frowns. In the coral bed, the two dolphins shine their sonar on Atlantis's relics, then dive, leaving the ruins and mystery. At the shore, scientists toil to repair the dolphins, while floating with Nikki on the research ship, Sam samples a lemon and then drops it into the sand. Watching Sam, Nikki frowns and nods her head. He swings and observes shadows flicker off the surface of rising tides. Later that night, wearing only a parka, across the bustling promenade, Daisy's loose red scarf flutters in the breeze as she clasps her hands over her ears and strides to a wall at the edge of the submarine. She taps the wall with one foot, pulls herself up onto the top rung, and gazes out into the horizon. She releases her right hand, revealing the Gem of the Sea, a large oval-shaped green emerald that sparkles in the starlight. On the surface of the Nautilus, young Daisy stands in the sunlight and gazes at the Eiffel Tower, smiling as she looks up and draws the Gem of the Sea out of her backpack. Back on the surface of the Endeavor, Daisy drops the emerald bracelet into the sky, and as the bracelet flies, Daisy frowns and inhales softly, observing as it spins down to the bright heavens. Later, Daisy dreams in her chamber beside her collection of painted canvases. In one painting, Daisy reclines beside a giant turtle; in another, she stands on a bird's wing. In a third, Daisy wears a short hat on her head as she dances beside a hot air balloon, and in another, Daisy frowns alongside a car."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Below the clouds along the skyline, canoes glide toward a waiting balloon tethered amid floating lily pads as Rose opens her eyes when they drift up alongside the balloon Zephyr. Later, Titanic survivors lounge on one of the balloon's lower baskets as lifeguards and clowns hover amongst them. Still dressed in a kilt, Cal skips down a ladder onto the lower basket, bumps past a woman, and mingles into the survivors. Rose sits on a stool with a towel draped around her, covering her knees and chest, and she gazes up at Cal's silhouette as he examines the crowd, then looks away as he spins toward her, closing her eyes as Cal leaps behind her. Rose glances sideways at Cal as he stomps away. Her hair soaked and tangled, Rose stands in a pouring waterfall on the deck of the balloon and gazes up at the Eiffel Tower, the lights and spire shimmering in the dusk. A balloon's clown holding a book approaches Rose, but Rose continues to gaze up at the towering structure as the clown moves on. Lizzy laughs. On the ocean floor, the two drones flicker their beams on the Titanic's relics, then ascend, leaving the debris and shadows. At the surface, lifeguards struggle to retrieve the drones, while standing with Lizzy on the research balloon, Brock whiffs a flower and then releases it into the breeze. Watching Brock, Lizzy laughs and rolls her eyes. He turns and watches stars twinkle off the cresting waves. Later, wearing only a poncho, across the empty basket, Rose's loose red hair flutters in the breeze as she presses her palms over her chest and wanders to a window at the side of the balloon. She grasps the window with one hand, pulls herself up onto the bottom rail, and peers down into the clouds. She releases her right hand, revealing the Gift of the Sea, a large star-shaped green gem that sparkles in the starlight. On the deck of the Zephyr, young Rose stands in the waterfall and gazes at the Eiffel Tower, frowning as she looks down and pulls the Gift of the Sea out of her coat pocket. Back on the deck of the Puffin, Rose flings the gemstone decoration into the air, and as the decoration floats, Rose giggles and breathes deeply, watching as it spirals down to the dark ocean skies. Later, Rose dreams in her berth beside her collection of framed paintings. In one picture, Rose stands beside a large iguana; in another, she lounges on a camel's back. In a third, Rose wears a long necklace around her waist as she poses beside a helicopter, and in another, Rose giggles astride a zebra."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Beneath the clouds along the skyline, hot air balloons glide toward a waiting lighthouse perched amid drifting islands as Lily closes her ears when they glide near the lighthouse Olympia. Earlier, Festival attendees feast on one of the building's upper balconies as bakers and dancers weave amongst them. Still dressed in a wetsuit, Sam climbs up a ladder onto the upper platform, slides past a woman, and mingles with the attendees. Lily lies on a hammock with a scarf draped around her, shrouding her feet and legs, and she glances down at Sam's face as he examines the crew, then averts her gaze as he faces her, opening her ears as Sam dances around her. Lily peeks upwards at Sam as he dances away. Her shoes dry and tangled, Lily stands in falling snow on the balcony of the building and gazes up at a Ferris wheel, the seats and frames glowing in the daylight. A building's dancer holding a trumpet skips up to Lily, but Lily continues to gaze up at the towering ride as the dancer skips away. Marco frowns. On the mountaintop, the two eagles focus their sights on the festival's tents, then descend, leaving the display and brightness. On the hillside, dancers strive to assemble the tents, while chatting with Marco by the garden, Nick tastes a lollipop and then buries it in the ground. Focusing on Nick, Marco frowns and nods his head. Nick turns and watches lanterns dance off the edge of rolling fields. Earlier that afternoon, clad only in a raincoat, across the bustling garden, Lily's tight red shoes sway in the breeze as she holds her ears over her mouth and runs to a gate at the side of the building. She grips the gate with one foot, hoists herself up onto the top rung, and gazes up into the sky. She clasps her right foot, revealing the Jewel of the Forest, a large star-shaped green emerald that shimmers in the sunshine. On the balcony of the Olympia, young Lily stands in the snow and gazes at a Ferris wheel, smiling as she looks up and tucks the Jewel of the Forest into her hat pocket. Back in the garden of the Odyssey, Lily buries the emerald bracelet into the ground, and as the bracelet descends, Lily frowns and inhales deeply, watching as it drifts up to the bright sky heights. Earlier, Lily runs in her room beside her collection of painted drawings. In one drawing, Lily flies beside a small bird; in another, she hides on a pony's back. In a third, Lily wears a short hat around her hair as she jumps beside a ship, and in another, Lily frowns atop a cow."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Amid floating icebergs, lifeboats row towards the Carpathia, where Rose awakens as a Titanic survivor. On the lower deck, Cal, still in a tuxedo, searches the passengers, missing Rose who averts her gaze. Later, Rose stands in the rain, staring up at the Statue of Liberty. A crewman approaches, but she remains transfixed by the statue. Meanwhile, on a research ship, Brock discards a cigar into the ocean, and Lizzy smiles at him. That night, on the Keldysh, an older Rose, in a nightgown, walks to the railing, holding the Heart of the Ocean—a large blue diamond. She releases the necklace into the sea, watching it sink with a contented smile. Later, Rose rests in her berth, surrounded by photographs depicting her adventurous life, from standing beside a large fish to posing with a biplane."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "In a third Rose wears a long scarf around her neck as she poses beside a biplane and in another Rose smiles astride a horse in another she sits on an elephant's back In one picture Rose stands beside a large fish Later Rose sleeps in her berth beside her collection of framed photographs Back on the deck of the Keldysh Rose tosses the diamond necklace into the sea and as the necklace sinks Rose smiles and exhales deeply watching as it twirls down to the dark ocean depths On the deck of the Carpathia young Rose stands in the rain and stares at the Statue of Liberty frowning as she looks down and pulls the Heart of the Ocean out of her jacket pocket She unclasps her left hand revealing the Heart of the Ocean a large heartshaped blue diamond that glints in the moonlight She grips the railing with one hand pulls herself up onto the bottom rung and stares down into the water Rose's loose white hair blows in the wind as she clutches her hands over her heart and walks to a railing at the back of the ship Later that night wearing only a nightgown across the desolate deck He turns and watches lights glint off the surface of rolling waves Staring at Brock Lizzy smiles and shakes her head Brock sniffs a cigar and then throws it into the water At the surface crewmen work to recover the submersibles while standing with Lizzy on the research ship On the ocean floor the two submersibles shine their lights on the Titanic's remains then rise leaving the wreck and darkness Lizzy smiles A ship's crewman holding a clipboard steps up to Rose but Rose continues to stare up at the giant statue as the crewman moves on the torch and crown glowing in the night Rose stands in pouring rain on the deck of the ship and stares up at the Statue of Liberty Her hair wet and stringy Rose peers sideways at Cal as he walks away Rose sits on a bench with a blanket wrapped around her hooding her hair and head and she glances up at Cal's back as he surveys the passengers then looks away as he turns toward her closing her eyes as Cal paces behind her Still dressed in a tuxedo Cal walks down a staircase onto the lower deck brushes past a man and walks into the survivors Later Titanic survivors recover on one of the ship's lower decks as nurses and crewmen flit amongst them Below the sky along the horizon lifeboats row toward a waiting ship anchored amid floating icebergs as Rose opens her eyes when they row up alongside the ship Carpathia"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Rose's loose white hair blows in the wind as she clutches her hands over her heart and walks to a railing at the back of the ship Brock sniffs a cigar and then throws it into the water Lizzy smiles On the deck of the Carpathia young Rose stands in the rain and stares at the Statue of Liberty frowning as she looks down and pulls the Heart of the Ocean out of her jacket pocket She unclasps her left hand revealing the Heart of the Ocean a large heartshaped blue diamond that glints in the moonlight Rose stands in pouring rain on the deck of the ship and stares up at the Statue of Liberty Her hair wet and stringy On the ocean floor the two submersibles shine their lights on the Titanic's remains then rise leaving the wreck and darkness Later that night wearing only a nightgown across the desolate deck Later Rose sleeps in her berth beside her collection of framed photographs At the surface crewmen work to recover the submersibles while standing with Lizzy on the research ship She grips the railing with one hand pulls herself up onto the bottom rung and stares down into the water Later Titanic survivors recover on one of the ship's lower decks as nurses and crewmen flit amongst them He turns and watches lights glint off the surface of rolling waves In one picture Rose stands beside a large fish Staring at Brock Lizzy smiles and shakes her head Still dressed in a tuxedo Cal walks down a staircase onto the lower deck brushes past a man and walks into the survivors in another she sits on an elephant's back Rose peers sideways at Cal as he walks away In a third Rose wears a long scarf around her neck as she poses beside a biplane and in another Rose smiles astride a horse the torch and crown glowing in the night A ship's crewman holding a clipboard steps up to Rose but Rose continues to stare up at the giant statue as the crewman moves on Below the sky along the horizon lifeboats row toward a waiting ship anchored amid floating icebergs as Rose opens her eyes when they row up alongside the ship Carpathia Rose sits on a bench with a blanket wrapped around her hooding her hair and head and she glances up at Cal's back as he surveys the passengers then looks away as he turns toward her closing her eyes as Cal paces behind her Back on the deck of the Keldysh Rose tosses the diamond necklace into the sea and as the necklace sinks Rose smiles and exhales deeply watching as it twirls down to the dark ocean depths"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Staring at Brock Lizzy smiles and shakes her head He turns and watches lights glint off the surface of rolling waves Later that night wearing only a nightgown across the desolate deck Rose's loose white hair blows in the wind as she clutches her hands over her heart and walks to a railing at the back of the ship She grips the railing with one hand pulls herself up onto the bottom rung and stares down into the water She unclasps her left hand revealing the Heart of the Ocean a large heartshaped blue diamond that glints in the moonlight On the deck of the Carpathia young Rose stands in the rain and stares at the Statue of Liberty frowning as she looks down and pulls the Heart of the Ocean out of her jacket pocket Back on the deck of the Keldysh Rose tosses the diamond necklace into the sea and as the necklace sinks Rose smiles and exhales deeply watching as it twirls down to the dark ocean depths Later Rose sleeps in her berth beside her collection of framed photographs In one picture Rose stands beside a large fish in another she sits on an elephant's back In a third Rose wears a long scarf around her neck as she poses beside a biplane and in another Rose smiles astride a horse Below the sky along the horizon lifeboats row toward a waiting ship anchored amid floating icebergs as Rose opens her eyes when they row up alongside the ship Carpathia Later Titanic survivors recover on one of the ship's lower decks as nurses and crewmen flit amongst them Still dressed in a tuxedo Cal walks down a staircase onto the lower deck brushes past a man and walks into the survivors Rose sits on a bench with a blanket wrapped around her hooding her hair and head and she glances up at Cal's back as he surveys the passengers then looks away as he turns toward her closing her eyes as Cal paces behind her Rose peers sideways at Cal as he walks away Her hair wet and stringy Rose stands in pouring rain on the deck of the ship and stares up at the Statue of Liberty the torch and crown glowing in the night A ship's crewman holding a clipboard steps up to Rose but Rose continues to stare up at the giant statue as the crewman moves on Lizzy smiles On the ocean floor the two submersibles shine their lights on the Titanic's remains then rise leaving the wreck and darkness At the surface crewmen work to recover the submersibles while standing with Lizzy on the research ship Brock sniffs a cigar and then throws it into the water"
        }
      ]
    }
  ]
}