{
  "ground_truth": "Rose gulps as she stares at the comb, and Brock kneels beside her before Rose nods. Later, a computer animation shows the Titanic striking an iceberg. Lizzie stands behind her grandmother as Rose climbs out of her wheelchair, and the crew watches her shuffle to a video monitor displaying footage of the Titanic wreck. Rose blinks and inhales sharply as the door with the ornate, leaded glass window comes into view, while in a flashback, two men in tuxedos smile and nod as they open a pair of doors with leaded glass windows. On the video monitor, grayish growth covers the window's ornate scrollwork, and Rose places her hands over her mouth before turning away from the monitor and returning to her wheelchair. Brock switches on a tape recorder as he sits across from Rose and grins, then nods. On a video monitor behind Rose, the corroded Titanic wreck transforms into a gleaming ocean liner moored alongside a dock as passengers walk up one of three gangplanks. Men and women toting suitcases make their way to the Titanic, and a crane loads an antique car onto the ship. Sitting in her father's arms, a young brunette girl watches a fleet of gleaming automobiles arrive, and a chauffeur wearing a tweed uniform and black leather gloves steps out of the driver's seat to open the car's back door. He takes a woman's gloved hand as she steps out of the car, and the brown-haired woman, wearing a white dress with thin black stripes and a large brimmed hat, gazes up at the enormous ship. A black-haired man in a bowler hat and grey suit steps out behind her and hands over money before checking his pocket watch and stepping to Rose and her mother as Rose follows her fiancee, Cal Hockley, through the crowd. A health inspector runs a comb through a man's dark hair and beard as Ruth strides ahead of Rose and Cal up the gangplank. Inside a saloon with a view of the Titanic, men smoke and drink while playing a game of cards. A brown-haired card player turns to a man beside him, and blonde-haired Jack deals Sven another card before exchanging one of his own for a card from the deck. Jack, eyes narrowed, smokes a cigarette as he peers across the table at Sven's partner with several silver coins, a pocketknife, a pocket watch, and a pair of third class tickets for the Titanic in the middle of the table. A black-haired man raps his knuckles on the table as Sven lays down his cards, and Fabrizio snatches the tickets and dances while Jack sweeps up the coins. Olaf grabs Jack's collar, and Jack closes his eyes as Olaf makes a fist but punches Sven instead.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Rose swallows as she gazes at the comb, and Brock kneels beside her before Rose nods. Later, a computer animation depicts the Titanic hitting an iceberg. Lizzie stands behind her grandmother as Rose climbs out of her wheelchair, and the crew observes her shuffle to a video display showing footage of the Titanic wreck. Rose blinks and inhales sharply as the door with the ornate, leaded glass window comes into view, while in a flashback, two men in tuxedos smile and nod as they open a pair of doors with leaded glass windows. On the video display, grayish growth covers the window's ornate scrollwork, and Rose places her hands over her mouth before turning away from the display and returning to her wheelchair. Brock switches on a tape recorder as he sits across from Rose and grins, then nods. On a video display behind Rose, the corroded Titanic wreck transforms into a gleaming ocean liner moored alongside a dock as passengers walk up one of three gangplanks. Men and women carrying suitcases make their way to the Titanic, and a crane hoists an antique vehicle onto the ship. Sitting in her father's arms, a young brunette girl watches a fleet of gleaming automobiles arrive, and a chauffeur wearing a tweed uniform and black leather gloves steps out of the driver's seat to open the vehicle's back door. He takes a woman's gloved hand as she steps out of the vehicle, and the brown-haired woman, wearing a white dress with thin black stripes and a large brimmed hat, gazes up at the enormous ship. A black-haired man in a bowler hat and grey suit steps out behind her and hands over money before checking his pocket watch and stepping to Rose and her mother as Rose follows her fiancee, Cal Hockley, through the crowd. A health inspector runs a comb through a man's dark hair and beard as Ruth strides ahead of Rose and Cal up the gangplank. Inside a saloon with a view of the Titanic, men smoke and drink while playing a game of cards. A brown-haired card player turns to a man beside him, and blonde-haired Jack deals Sven another card before exchanging one of his own for a card from the deck. Jack, eyes narrowed, smokes a cigarette as he peers across the table at Sven's partner with several silver coins, a pocketknife, a pocket watch, and a pair of third class tickets for the Titanic in the middle of the table. A black-haired man raps his knuckles on the table as Sven lays down his cards, and Fabrizio snatches the tickets and dances while Jack collects the coins. Olaf grabs Jack's collar, and Jack closes his eyes as Olaf makes a fist but strikes Sven instead."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Rose gulps as the comb is stared at by her, and beside her, Brock is knelt by her before a nod is given by Rose. Later, the Titanic striking an iceberg is shown by a computer animation. As Rose climbs out of her wheelchair, her grandmother is stood behind Lizzie, and her shuffle to a video monitor displaying footage of the Titanic wreck is watched by the crew. Rose blinks and a sharp inhale is taken by her as into view comes the door with the ornate, leaded glass window, while in a flashback, smiles and nods are exchanged by two men in tuxedos as a pair of doors with leaded glass windows are opened by them. On the video monitor, the window's ornate scrollwork is covered by grayish growth, and her hands are placed over her mouth by Rose before she turns away from the monitor and returns to her wheelchair. As Brock sits across from Rose, a tape recorder is switched on by him, and grins and nods are exchanged by him. On a video monitor behind Rose, the corroded Titanic wreck transforms into a gleaming ocean liner moored alongside a dock as one of three gangplanks is walked up by passengers. Suitcases are toted by men and women making their way to the Titanic, and an antique car is loaded onto the ship by a crane. Sitting in her father's arms, a fleet of gleaming automobiles is watched by a young brunette girl as they arrive, and a chauffeur wearing a tweed uniform and black leather gloves steps out of the driver's seat to open the car's back door. A woman's gloved hand is taken by him as she steps out of the car, and the brown-haired woman, wearing a white dress with thin black stripes and a large brimmed hat, gazes up at the enormous ship. A black-haired man in a bowler hat and grey suit steps out behind her, hands over money, checks his pocket watch, and steps to Rose and her mother as through the crowd, her fiancé, Cal Hockley, is followed by Rose. A comb is run through a man's dark hair and beard by a health inspector as Ruth strides ahead of Rose and Cal up the gangplank. Inside a saloon with a view of the Titanic, smoking and drinking occur among men playing a game of cards. A brown-haired card player turns to a man beside him, and another card is dealt to Sven by blonde-haired Jack before exchanging one of his own for one from the deck. Jack, eyes narrowed, smokes a cigarette as Sven's partner is peered at by him across the table with several silver coins, a pocketknife, a pocket watch, and a pair of third class tickets for the Titanic in the middle of the table. A black-haired man raps his knuckles on the table as Sven lays down his cards, and the tickets are snatched by Fabrizio who dances while the coins are swept up by Jack. Olaf grabs Jack's collar, and his eyes are closed by Jack as a fist is made by Olaf, but instead, Sven is punched by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Rose gulps at the comb, and Brock kneels beside her before she nods. Later, an animation shows the Titanic hitting an iceberg. Lizzie stands behind her grandmother as Rose climbs from her wheelchair, the crew watching as she shuffles to a monitor showing the Titanic wreck. Rose blinks, inhaling sharply as a door with ornate glass appears. In a flashback, two men in tuxedos open similar doors. On the monitor, gray growths cover the window's scrollwork, and Rose covers her mouth before turning to her wheelchair. Brock switches on a tape recorder, grinning as he sits across from her. The monitor behind Rose shows the corroded Titanic transforming into a gleaming liner docked as passengers board. A young brunette girl watches from her father's arms as a chauffeur, in a tweed uniform and leather gloves, opens a car door. A woman in a striped white dress and large hat steps out, glancing at the enormous ship. A man in a bowler hat and grey suit joins her, handing over money, checking his watch, and joining Rose and her mother as they follow her fiancé, Cal Hockley, through the crowd. A health inspector runs a comb through a man's hair as Ruth strides ahead of Rose and Cal up the gangplank. Inside a saloon with views of the Titanic, men smoke, drink, and play cards. A brown-haired player turns to a man beside him, while blond Jack deals Sven another card, exchanging one from the deck. Jack, eyes narrowed, smokes as he eyes Sven's partner with silver coins, a pocketknife, a pocket watch, and Titanic third-class tickets on the table. A black-haired man taps the table as Sven lays down his cards, and Fabrizio grabs the tickets, dancing, while Jack collects the coins. Olaf grabs Jack's collar, and, when Olaf makes a fist, he accidentally punches Sven instead."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Rose gulps at the comb as Brock kneels beside her before she nods. Later, a computer animation shows the Titanic hitting an iceberg. Lizzie stands behind Rose's grandmother as she leaves her wheelchair, watched by the crew, to view a monitor with Titanic wreck footage. Rose gasps as the ornate glass door appears, recalling tuxedoed men smiling and opening similar doors. The monitor shows gray growth on the window's scrollwork, prompting Rose to cover her mouth and return to her wheelchair. Brock grins, switching on a tape recorder. Behind Rose, a monitor transforms the corroded Titanic into a docked ocean liner as passengers board. People carry suitcases, and a crane loads an antique car. A young girl in her father's arms watches automobiles arrive as a chauffeur opens a car door for a woman in a white, striped dress and hat. A bowler-hatted man follows her, pays, checks his watch, and joins Rose and her mother as Rose follows her fiancé Cal Hockley. A health inspector checks a man's hair as Ruth leads Rose and Cal up the gangplank. In a saloon with a Titanic view, men play cards as Jack deals a card to Sven. Jack, smoking, eyes Sven's partner across the table, surrounded by silver coins, a knife, a pocket watch, and Titanic third class tickets as a black-haired man knocks on the table. Sven shows his cards, Fabrizio grabs the tickets, dances, and Jack collects the coins. Olaf grabs Jack's collar, but punches Sven instead."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Rose takes a deep breath and gulps anxiously as she stands frozen, staring at the comb in her hand. Meanwhile, Brock, her companion, kneels beside her in a supportive manner, waiting patiently until Rose gives him a slight nod of acknowledgment. In a subsequent scene, a detailed computer-generated animation graphically depicts the tragic moment when the Titanic disastrously collides with an enormous iceberg. Lizzie, standing supportively behind her grandmother, watches intently as Rose, with determination, climbs out of her wheelchair. The crew members observe silently as Rose shuffles with effort towards a nearby video monitor that displays haunting footage of the Titanic wreck lying at the ocean's bottom. With a sharp intake of breath, Rose blinks as her eyes fall upon the ornate door with its intricate, leaded glass window coming into focus. In a vivid flashback, the scene shifts to two men clad in elegant tuxedos, who smile warmly and nod while opening a pair of grand doors adorned with similar leaded glass windows. On the video monitor, the camera captures the window's ornate scrollwork, now overgrown with grayish marine life, causing Rose to cover her mouth with her hands in shock before she turns away and returns to her wheelchair. Brock, seated across from Rose, turns on a tape recorder and grins broadly, then nods in understanding. Behind Rose, on the video monitor, the image of the Titanic’s corroded wreck magically transforms into that of a pristine ocean liner docked alongside a bustling dock, while passengers eagerly ascend one of the three gangplanks. Men and women, carrying well-packed suitcases, make their way toward the majestic Titanic, while a crane carefully loads an antique car onto the massive ship. A young brunette girl, safely seated in her father's arms, observes a procession of gleaming automobiles arriving in a neat convoy. A chauffeur, dressed in a proper tweed uniform with black leather gloves, steps out from the driver's seat and gracefully opens the car's back door. Extending his hand, he helps a woman elegantly dressed in a white dress with slim black stripes and a large brimmed hat out of the car. She gazes up in awe at the imposing ship before her. Following closely behind, a man sporting black hair under a bowler hat and clad in a gray suit steps out, hands over some money, checks his pocket watch with practiced precision, and walks purposefully toward Rose and her mother. Rose trails her fiancé, Cal Hockley, through the thronging crowd. Meanwhile, a health inspector methodically runs a comb through a man's dark hair and beard as Ruth strides confidently ahead of Rose and Cal, marching up the gangplank. Inside a dimly lit saloon with a strategic view of the Titanic, men indulge in smoking and drinking while engaged in a lively card game. A brown-haired card player turns to exchange a few words with a man beside him, while blonde-haired Jack deftly deals Sven another card, swapping one of his cards for another from the deck. With narrowed eyes, Jack smokes a cigarette, peering intently across the table at Sven's partner, who eyes a collection of several silver coins, a pocketknife, a pocket watch, and a pair of third-class tickets for the Titanic prominently placed in the center of the table. Adding to the tension, a black-haired man taps his knuckles sharply on the table while Sven lays out his cards with a confident flair. Fabrizio, seizing the opportunity, snatches the tickets and dances jubilantly, while Jack swiftly gathers up the scattered coins. Suddenly, Olaf lunges, grabbing Jack's collar aggressively, making Jack close his eyes in anticipation as Olaf raises his fist, only to unexpectedly punch Sven instead."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Rose takes a deep breath, filling her lungs with air, and gulps anxiously, feeling her throat tighten as she stands frozen in place, unable to move, staring intently at the comb she holds tightly in her hand. Meanwhile, Brock, her steadfast companion, kneels beside her with a supportive demeanor, waiting patiently and attentively until Rose offers him a slight nod of acknowledgment, indicating she is ready. In a subsequent scene, a detailed computer-generated animation graphically unfolds the tragic moment when the Titanic disastrously collides with an enormous, towering iceberg. Lizzie, standing supportively and protectively behind her grandmother, watches intently and with deep concentration as Rose, demonstrating determination and resolve, climbs out of her wheelchair. The crew members observe silently and respectfully as Rose shuffles with considerable effort toward a nearby video monitor that displays haunting footage of the Titanic wreck lying at the ocean's bottom. With a sharp intake of breath, Rose blinks as her eyes come to rest on the ornate door with its intricate and elaborate leaded glass window coming into focus. In a vivid flashback, the scene seamlessly shifts to reveal two men clad in elegant and stylish tuxedos, who smile warmly and nod while opening a pair of grand doors adorned with similar leaded glass windows. On the video monitor, the camera captures the window's ornate scrollwork, now overgrown and encrusted with grayish marine life, prompting Rose to cover her mouth with her hands in shock and disbelief before she turns away and returns to her wheelchair. Brock, seated across from Rose, turns on a tape recorder and grins broadly, then nods in understanding. Behind Rose, on the video monitor, the image of the Titanic's corroded wreck magically transforms into that of a pristine ocean liner docked alongside a bustling dock, while passengers eagerly ascend one of the three gangplanks. Men and women, carrying well-packed and organized suitcases, make their way toward the majestic Titanic, while a crane carefully loads an antique car onto the massive ship. A young brunette girl, safely and comfortably seated in her father's arms, observes a procession of gleaming automobiles arriving in a neat and orderly convoy. A chauffeur, dressed in a proper tweed uniform with black leather gloves, steps out from the driver's seat and gracefully opens the car's back door. Extending his hand with care, he helps a woman elegantly dressed in a white dress with slim black stripes and a large brimmed hat out of the car. She gazes up in awe and admiration at the imposing ship before her. Following closely behind, a man sporting black hair under a bowler hat and clad in a sharp gray suit steps out, hands over some money, checks his pocket watch with practiced precision, and walks purposefully toward Rose and her mother. Rose trails her fiancé, Cal Hockley, through the thronging crowd. Meanwhile, a health inspector methodically runs a comb through a man's dark hair and beard as Ruth strides confidently ahead of Rose and Cal, marching up the gangplank. Inside a dimly lit saloon with a strategic view of the Titanic, men indulge in smoking and drinking while engaged in a lively and animated card game. A brown-haired card player turns to exchange a few words with a man seated beside him, while blonde-haired Jack deftly deals Sven another card, exchanging one of his cards for another from the deck. With narrowed eyes, Jack smokes a cigarette, peering intently across the table at Sven's partner, who eyes a collection of several silver coins, a pocketknife, a pocket watch, and a pair of third-class tickets for the Titanic prominently placed in the center of the table. Adding to the tension, a black-haired man taps his knuckles sharply on the table while Sven lays out his cards with a confident and flamboyant flair. Fabrizio, seizing the opportunity, snatches the tickets and dances jubilantly, while Jack swiftly gathers up the scattered coins. Suddenly, Olaf lunges, grabbing Jack's collar aggressively, making Jack close his eyes in anticipation as Olaf raises his fist, only to unexpectedly punch Sven instead."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Rose, feeling a rush of nerves, gulps as her eyes fixate on the comb, the intensity of the moment mirrored by Brock, who lowers himself onto one knee beside her, offering silent support. Rose, gathering her resolve, gives a slight nod. The scene shifts to a computer animation vividly illustrating the fateful moment when the Titanic collides with the iceberg, a dramatic reenactment of history's tragedy. Meanwhile, in the present, Lizzie stands supportively behind her grandmother, watching as Rose musters her strength to slowly rise from her wheelchair. The crew, gathered with bated breath, observes her careful, determined shuffle towards a video monitor, which flickers with the haunting footage of the Titanic wreck. The moment is emotionally charged as Rose blinks repeatedly, trying to maintain composure, and takes a deep, sharp breath when a door with a beautifully intricate, leaded glass window materializes on the screen. In her mind, a flashback unfolds, transporting her to a time when two men, dressed impeccably in tuxedos, greet her with warm smiles and respectful nods, gently pushing open a pair of similar doors with the same elaborate glass windows. Returning to the present reality, the video monitor starkly shows the ornate window's scrollwork, now marred by grayish growth. Overcome with emotion, Rose instinctively covers her mouth with her hands, turning away to regain steadiness, and with a measured pace, she makes her way back to her wheelchair. Seated opposite her, Brock activates a tape recorder, the device whirring softly to life, then shoots her a reassuring grin and a nod of encouragement. Behind Rose, on another video monitor, the decayed remains of the Titanic shipwreck magically revert to their former glory, transforming into a pristine, gleaming ocean liner docked beside a bustling quay. The scene is vibrant as passengers with eager anticipation thread their way up one of the three waiting gangplanks, their luggage in tow, while a crane methodically hoists an antique car onto the ship’s deck. Nearby, a young brunette girl perches comfortably in her father's arms, her eyes wide with fascination as she watches a convoy of polished automobiles roll up. A well-dressed chauffeur, clad in a neat tweed uniform and snug black leather gloves, steps smoothly from the driver’s seat, respectfully opening the car’s rear door. He extends a courteous hand to assist a poised woman clad in a striking white dress adorned with delicate black stripes, her ensemble completed by a wide-brimmed hat. She emerges gracefully, taking a moment to admire the towering majesty of the Titanic. From the car’s shadow steps a distinguished black-haired man in a bowler hat and an immaculate grey suit. With a practiced motion, he discreetly hands over money before consulting his pocket watch to check the time, ensuring all is in order before proceeding to join Rose and her mother. As he does so, Rose dutifully trails her fiancé, Cal Hockley, maneuvering through the lively crowd. A health inspector, performing routine checks, deftly slides a fine-toothed comb through a man's thick dark hair and beard as Ruth, in a display of confidence and purpose, strides ahead of both Rose and Cal as they ascend the gangplank. Inside the ship, within the warm ambiance of a saloon offering commanding views of the Titanic, men engage in card games, the air thick with the smoke of cigars and the clinking of glasses. Among them, a brown-haired card player momentarily breaks his focus to converse with a neighboring player, while blonde-haired Jack, ever alert, deals another card to Sven and shrewdly swaps one of his own for a new card from the deck. Jack, his eyes narrowed with intense concentration, takes a slow drag from his cigarette, calculating his next move as he scrutinizes Sven’s partner. The middle of the table is cluttered with a haphazard assortment of bets, including several silver coins, a well-used pocketknife, a sturdy pocket watch, and two sought-after third-class tickets for the Titanic. The tension culminates as a black-haired man taps his knuckles rhythmically on the table, urging the game onward. Sven, with measured assurance, reveals his hand of cards. In a burst of triumph, Fabrizio eagerly seizes the tickets, bursting into a jubilant dance, while Jack efficiently collects the scattered coins. However, the victory is marred by sudden conflict as Olaf, his temper flaring, grabs Jack by the collar. In a show of defiance, Jack closes his eyes, bracing for impact as Olaf, impulsive, raises his fist, only to mistakenly strike Sven instead, diffusing the altercation in an unexpected twist."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Rose gulps at the sight of the comb as Brock kneels beside her, and she nods. Later, a computer animation depicts the Titanic striking an iceberg. Lizzie supports her grandmother, Rose, as she exits her wheelchair and approaches a monitor showing the Titanic wreck footage. Rose reacts emotionally to the sight of an ornate door with a leaded glass window, recalling a flashback of two men in tuxedos opening similar doors. On the monitor, the window's scrollwork is covered in grayish growth, prompting Rose to cover her mouth and return to her wheelchair. Brock turns on a tape recorder, smiling and nodding at Rose. Behind her, the monitor transitions from the corroded wreck to a vibrant Titanic at the dock, bustling with passengers and workers loading luggage and cars. A young girl, carried by her father, watches as a chauffeur opens a car door for a woman in a striped dress and large hat. The woman admires the ship as a man in a bowler hat joins her, pays a driver, and checks his pocket watch before meeting Rose and her mother. As they follow Cal Hockley through the crowd, a health inspector checks a man's hair. Meanwhile, Ruth leads them up the gangplank. Inside a saloon with Titanic views, men engage in smoking, drinking, and card games. Jack deals cards, eyeing the table's stakes: silver coins, a pocketknife, a watch, and Titanic tickets. After winning, Fabrizio celebrates with the tickets while Jack collects the coins. A scuffle ensues when Olaf grabs Jack, but a misdirected punch lands on Sven instead."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Rose gulps as she stares at the comb, a relic found during an expedition to the Titanic wreck site, and Brock, a treasure hunter known for his expertise in undersea exploration, kneels beside her before Rose nods. Later, a computer animation shows the Titanic, the British passenger liner that famously sank on its maiden voyage in April 1912, striking an iceberg. Lizzie stands behind her grandmother as Rose climbs out of her wheelchair, and the crew, part of a documentary team chronicling the Titanic's history, watches her shuffle to a video monitor displaying footage of the Titanic wreck. Rose blinks and inhales sharply as the door with the ornate, leaded glass window, reminiscent of the ship's luxurious Edwardian design, comes into view, while in a flashback, two men in tuxedos smile and nod as they open a pair of doors with leaded glass windows. On the video monitor, grayish growth covers the window's ornate scrollwork, testament to over a century underwater, and Rose places her hands over her mouth before turning away from the monitor and returning to her wheelchair. Brock switches on a tape recorder, widely used to document oral histories, as he sits across from Rose and grins, then nods. On a video monitor behind Rose, the corroded Titanic wreck transforms into a gleaming ocean liner moored alongside a dock, evoking the ship's last departure from Southampton, as passengers walk up one of three gangplanks. Men and women toting suitcases make their way to the Titanic, which at the time was the largest ship afloat, and a crane loads an antique car, symbolizing the luxury of its first-class amenities, onto the ship. Sitting in her father's arms, a young brunette girl watches a fleet of gleaming automobiles arrive, and a chauffeur wearing a tweed uniform and black leather gloves, typical of the period's driving attire, steps out of the driver's seat to open the car's back door. He takes a woman's gloved hand as she steps out of the car, and the brown-haired woman, wearing a white dress with thin black stripes and a large brimmed hat, gazes up at the enormous ship, which was famously deemed \"unsinkable.\" A black-haired man in a bowler hat and grey suit, reflecting early 20th-century fashion, steps out behind her and hands over money before checking his pocket watch, a common accessory for men of his status, and stepping to Rose and her mother as Rose follows her fiancé, Cal Hockley, a wealthy steel magnate, through the crowd. A health inspector, tasked with ensuring passengers did not carry communicable diseases, runs a comb through a man's dark hair and beard as Ruth strides ahead of Rose and Cal up the gangplank. Inside a saloon with a view of the Titanic, men smoke and drink while playing a game of cards, a popular pastime during the voyage. A brown-haired card player turns to a man beside him, and blonde-haired Jack deals Sven another card before exchanging one of his own for a card from the deck. Jack, eyes narrowed, smokes a cigarette as he peers across the table at Sven's partner with several silver coins, a pocketknife, a pocket watch, and a pair of third-class tickets for the Titanic in the middle of the table. A black-haired man raps his knuckles on the table as Sven lays down his cards, and Fabrizio, Jack's close friend hoping for a new life in America, snatches the tickets and dances while Jack sweeps up the coins. Olaf grabs Jack's collar, and Jack closes his eyes as Olaf makes a fist but punches Sven instead."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Rose gulps as she stares at the comb and Brock kneels beside her before Rose nods. Later a computer animation shows the Titanic striking an iceberg. Lizzie stands behind her grandmother as Rose climbs out of her wheelchair and the crew watches her shuffle to a video monitor displaying footage of the Titanic wreck. Rose blinks and inhales sharply as the door with the ornate leaded glass window comes into view while in a flashback two men in tuxedos smile and nod as they open a pair of doors with leaded glass windows. On the video monitor grayish growth covers the window's ornate scrollwork and Rose places her hands over her mouth before turning away from the monitor and returning to her wheelchair. Brock switches on a tape recorder as he sits across from Rose and grins then nods. On a video monitor behind Rose the corroded Titanic wreck transforms into a gleaming ocean liner moored alongside a dock as passengers walk up one of three gangplanks. Men and women toting suitcases make their way to the Titanic and a crane loads an antique car onto the ship. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Sitting in her father's arms a young brunette girl watches a fleet of gleaming automobiles arrive and a chauffeur wearing a tweed uniform and black leather gloves steps out of the driver's seat to open the car's back door. He takes a woman's gloved hand as she steps out of the car and the brownhaired woman wearing a white dress with thin black stripes and a large brimmed hat gazes up at the enormous ship. A blackhaired man in a bowler hat and grey suit steps out behind her and hands over money before checking his pocket watch and stepping to Rose and her mother as Rose follows her fiancee Cal Hockley through the crowd. A health inspector runs a comb through a man's dark hair and beard as Ruth strides ahead of Rose and Cal up the gangplank. Inside a saloon with a view of the Titanic men smoke and drink while playing a game of cards. A brownhaired card player turns to a man beside him and blondehaired Jack deals Sven another card before exchanging one of his own for a card from the deck. Jack eyes narrowed smokes a cigarette as he peers across the table at Sven's partner with several silver coins a pocketknife a pocket watch and a pair of third class tickets for the Titanic in the middle of the table. A blackhaired man raps his knuckles on the table as Sven lays down his cards and Fabrizio snatches the tickets and dances while Jack sweeps up the coins. Olaf grabs Jack's collar and Jack closes his eyes as Olaf makes a fist but punches Sven instead."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Rose gulps as she stares at the comb and Brock kneels beside her before Rose nods. Later a computer animation shows the Titanic striking an iceberg. Lizzie stands behind her grandmother as Rose climbs out of her wheelchair and the crew watches her shuffle to a video monitor displaying footage of the Titanic wreck. Rose blinks and inhales sharply as the door with the ornate leaded glass window comes into view while in a flashback two men in tuxedos smile and nod as they open a pair of doors with leaded glass windows. On the video monitor grayish growth covers the window's ornate scrollwork and Rose places her hands over her mouth before turning away from the monitor and returning to her wheelchair. Brock switches on a tape recorder as he sits across from Rose and grins then nods. On a video monitor behind Rose the corroded Titanic wreck transforms into a gleaming ocean liner moored alongside a dock as passengers walk up one of three gangplanks. Men and women toting suitcases make their way to the Titanic and a crane loads an antique car onto the ship. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Sitting in her father's arms a young brunette girl watches a fleet of gleaming automobiles arrive and a chauffeur wearing a tweed uniform and black leather gloves steps out of the driver's seat to open the car's back door. He takes a woman's gloved hand as she steps out of the car and the brownhaired woman wearing a white dress with thin black stripes and a large brimmed hat gazes up at the enormous ship. A blackhaired man in a bowler hat and grey suit steps out behind her and hands over money before checking his pocket watch and stepping to Rose and her mother as Rose follows her fiancee Cal Hockley through the crowd. A health inspector runs a comb through a man's dark hair and beard as Ruth strides ahead of Rose and Cal up the gangplank. Inside a saloon with a view of the Titanic men smoke and drink while playing a game of cards. A brownhaired card player turns to a man beside him and blondehaired Jack deals Sven another card before exchanging one of his own for a card from the deck. Jack eyes narrowed smokes a cigarette as he peers across the table at Sven's partner with several silver coins a pocketknife a pocket watch and a pair of third class tickets for the Titanic in the middle of the table. A blackhaired man raps his knuckles on the table as Sven lays down his cards and Fabrizio snatches the tickets and dances while Jack sweeps up the coins. Olaf grabs Jack's collar and Jack closes his eyes as Olaf makes a fist but punches Sven instead."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Rose gulps as she stares at the comb and Brock kneels beside her before Rose nods. Later a computer animation shows the Titanic striking an iceberg. Lizzie stands behind her grandmother as Rose climbs out of her wheelchair and the crew watches her shuffle to a video monitor displaying footage of the Titanic wreck. Rose blinks and inhales sharply as the door with the ornate leaded glass window comes into view while in a flashback two men in tuxedos smile and nod as they open a pair of doors with leaded glass windows. Inside a saloon with a view of the Titanic men smoke and drink while playing a game of cards. A brownhaired card player turns to a man beside him and blondehaired Jack deals Sven another card before exchanging one of his own for a card from the deck. Jack eyes narrowed smokes a cigarette as he peers across the table at Sven's partner with several silver coins a pocketknife a pocket watch and a pair of third class tickets for the Titanic in the middle of the table. A blackhaired man raps his knuckles on the table as Sven lays down his cards and Fabrizio snatches the tickets and dances while Jack sweeps up the coins. Olaf grabs Jack's collar and Jack closes his eyes as Olaf makes a fist but punches Sven instead."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Rose gulps as she stares at the comb and Brock kneels beside her before Rose nods. Later a computer animation shows the Titanic striking an iceberg. A blackhaired man raps his knuckles on the table as Sven lays down his cards and Fabrizio snatches the tickets and dances while Jack sweeps up the coins. Olaf grabs Jack's collar and Jack closes his eyes as Olaf makes a fist but punches Sven instead."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Daisy whispers as she glances at the pencil, and Max sits beside her before Daisy shrugs. Later, a digital avatar depicts the Columbia launching a comet. Clara stands beside her cousin as Daisy climbs out of her hammock, and the staff observes her crawl to a slideshow showing clips of the Columbia debris. Daisy squints and exhales loudly as the cabinet with the intricate, stained glass door comes into sight, while in a memory, two women in ball gowns laugh and wave as they shut a set of cabinets with stained glass doors. On the slideshow, bluish moss covers the door's intricate carvings, and Daisy places her hat over her ears before moving away from the slideshow and returning to her hammock. Max switches on a microphone as he kneels across from Daisy and chuckles, then waves. On a slideshow screen behind Daisy, the rusty Columbia debris morphs into a polished sky cruiser docked alongside a pier as travelers sprint up one of three escalators. Boys and girls clutching backpacks make their way to the Columbia, and a forklift raises an ancient piano onto the cruiser. Sitting in her uncle's arms, a young redheaded boy observes a procession of polished pianos arrive, and a valet wearing a linen outfit and brown velvet boots hops out of the conductor's seat to close the piano's lid. He holds a boy’s hat as he steps away from the piano, and the redheaded boy, wearing an orange shirt with broad red checks and a tiny straw hat, gazes down at the tiny cruiser. A bald-headed woman in a trilby hat and green coat steps in front of him and hands over a camera before checking her calendar and walking to Daisy and her brother as Daisy follows her teacher, Sam Hawthorne, under the bridge. A customs officer waves a brush through a boy’s curly hair and mustache as Helen skips ahead of Daisy and Sam down the escalator. Inside a library with a glimpse of the Columbia, women chat and write while planning a class of yoga. A redheaded instructor turns to a woman beside her, and blonde-haired Jill hands Ingrid a notebook before replacing one of theirs for a pencil from the shelf. Jill, brows furrowed, sips a milkshake as she gazes across the room at Ingrid's friend with several gold bracelets, a penknife, a calendar, and a set of first class keys for the Columbia on the middle of the table. A bald-headed woman taps her heels on the floor as Ingrid drops her papers, and Marco grabs the keys and leaps while Jill scoops up the bracelets. Hans tugs Jill's sleeve, and Jill opens her eyes as Hans shows a scarf but ties Ingrid instead."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Rose looks at the comb nervously as Brock kneels beside her before she nods. A computer animation then shows the Titanic hitting an iceberg. Lizzie stands behind her grandmother, Rose, as she gets out of her wheelchair, watched by the crew as she approaches a video monitor displaying footage of the Titanic wreck. Rose is emotional seeing the ornate, glass window now covered in gray growth and returns to her wheelchair. Brock, sitting across from Rose, records her as a monitor behind shows the Titanic, newly transformed, with people boarding. Passengers, including Rose with her fiancé Cal Hockley, head to the ship, while a woman in a white dress and large hat gazes at the enormous vessel. Inside a saloon, men drink, smoke, and play cards. Jack deals cards to Sven, and both eye the central pot of coins, a pocketknife, a watch, and Titanic tickets. Jack wins, taking the coins while Fabrizio dances with the tickets. Jack is briefly grabbed by Olaf but avoids a punch directed at him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Olaf grabs Jack's collar and Jack closes his eyes as Olaf makes a fist but punches Sven instead A blackhaired man raps his knuckles on the table as Sven lays down his cards and Fabrizio snatches the tickets and dances while Jack sweeps up the coins Jack eyes narrowed smokes a cigarette as he peers across the table at Sven's partner with several silver coins a pocketknife a pocket watch and a pair of third class tickets for the Titanic in the middle of the table A brownhaired card player turns to a man beside him and blondehaired Jack deals Sven another card before exchanging one of his own for a card from the deck Inside a saloon with a view of the Titanic men smoke and drink while playing a game of cards A health inspector runs a comb through a man's dark hair and beard as Ruth strides ahead of Rose and Cal up the gangplank A blackhaired man in a bowler hat and grey suit steps out behind her and hands over money before checking his pocket watch and stepping to Rose and her mother as Rose follows her fiancee Cal Hockley through the crowd He takes a woman's gloved hand as she steps out of the car and the brownhaired woman wearing a white dress with thin black stripes and a large brimmed hat gazes up at the enormous ship Sitting in her father's arms a young brunette girl watches a fleet of gleaming automobiles arrive and a chauffeur wearing a tweed uniform and black leather gloves steps out of the driver's seat to open the car's back door Men and women toting suitcases make their way to the Titanic and a crane loads an antique car onto the ship On a video monitor behind Rose the corroded Titanic wreck transforms into a gleaming ocean liner moored alongside a dock as passengers walk up one of three gangplanks Brock switches on a tape recorder as he sits across from Rose and grins then nods On the video monitor grayish growth covers the window's ornate scrollwork and Rose places her hands over her mouth before turning away from the monitor and returning to her wheelchair Rose blinks and inhales sharply as the door with the ornate leaded glass window comes into view while in a flashback two men in tuxedos smile and nod as they open a pair of doors with leaded glass windows Lizzie stands behind her grandmother as Rose climbs out of her wheelchair and the crew watches her shuffle to a video monitor displaying footage of the Titanic wreck Later a computer animation shows the Titanic striking an iceberg Rose gulps as she stares at the comb and Brock kneels beside her before Rose nods"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Later a computer animation shows the Titanic striking an iceberg Rose gulps as she stares at the comb and Brock kneels beside her before Rose nods Rose blinks and inhales sharply as the door with the ornate leaded glass window comes into view while in a flashback two men in tuxedos smile and nod as they open a pair of doors with leaded glass windows Lizzie stands behind her grandmother as Rose climbs out of her wheelchair and the crew watches her shuffle to a video monitor displaying footage of the Titanic wreck Brock switches on a tape recorder as he sits across from Rose and grins then nods On the video monitor grayish growth covers the window's ornate scrollwork and Rose places her hands over her mouth before turning away from the monitor and returning to her wheelchair Men and women toting suitcases make their way to the Titanic and a crane loads an antique car onto the ship On a video monitor behind Rose the corroded Titanic wreck transforms into a gleaming ocean liner moored alongside a dock as passengers walk up one of three gangplanks He takes a woman's gloved hand as she steps out of the car and the brownhaired woman wearing a white dress with thin black stripes and a large brimmed hat gazes up at the enormous ship Sitting in her father's arms a young brunette girl watches a fleet of gleaming automobiles arrive and a chauffeur wearing a tweed uniform and black leather gloves steps out of the driver's seat to open the car's back door A health inspector runs a comb through a man's dark hair and beard as Ruth strides ahead of Rose and Cal up the gangplank A blackhaired man in a bowler hat and grey suit steps out behind her and hands over money before checking his pocket watch and stepping to Rose and her mother as Rose follows her fiancee Cal Hockley through the crowd A brownhaired card player turns to a man beside him and blondehaired Jack deals Sven another card before exchanging one of his own for a card from the deck Inside a saloon with a view of the Titanic men smoke and drink while playing a game of cards A blackhaired man raps his knuckles on the table as Sven lays down his cards and Fabrizio snatches the tickets and dances while Jack sweeps up the coins Jack eyes narrowed smokes a cigarette as he peers across the table at Sven's partner with several silver coins a pocketknife a pocket watch and a pair of third class tickets for the Titanic in the middle of the table Olaf grabs Jack's collar and Jack closes his eyes as Olaf makes a fist but punches Sven instead"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He takes a woman's gloved hand as she steps out of the car and the brownhaired woman wearing a white dress with thin black stripes and a large brimmed hat gazes up at the enormous ship A blackhaired man in a bowler hat and grey suit steps out behind her and hands over money before checking his pocket watch and stepping to Rose and her mother as Rose follows her fiancee Cal Hockley through the crowd A health inspector runs a comb through a man's dark hair and beard as Ruth strides ahead of Rose and Cal up the gangplank Inside a saloon with a view of the Titanic men smoke and drink while playing a game of cards A brownhaired card player turns to a man beside him and blondehaired Jack deals Sven another card before exchanging one of his own for a card from the deck Jack eyes narrowed smokes a cigarette as he peers across the table at Sven's partner with several silver coins a pocketknife a pocket watch and a pair of third class tickets for the Titanic in the middle of the table A blackhaired man raps his knuckles on the table as Sven lays down his cards and Fabrizio snatches the tickets and dances while Jack sweeps up the coins Olaf grabs Jack's collar and Jack closes his eyes as Olaf makes a fist but punches Sven instead Rose gulps as she stares at the comb and Brock kneels beside her before Rose nods Later a computer animation shows the Titanic striking an iceberg Lizzie stands behind her grandmother as Rose climbs out of her wheelchair and the crew watches her shuffle to a video monitor displaying footage of the Titanic wreck Rose blinks and inhales sharply as the door with the ornate leaded glass window comes into view while in a flashback two men in tuxedos smile and nod as they open a pair of doors with leaded glass windows On the video monitor grayish growth covers the window's ornate scrollwork and Rose places her hands over her mouth before turning away from the monitor and returning to her wheelchair Brock switches on a tape recorder as he sits across from Rose and grins then nods On a video monitor behind Rose the corroded Titanic wreck transforms into a gleaming ocean liner moored alongside a dock as passengers walk up one of three gangplanks Men and women toting suitcases make their way to the Titanic and a crane loads an antique car onto the ship Sitting in her father's arms a young brunette girl watches a fleet of gleaming automobiles arrive and a chauffeur wearing a tweed uniform and black leather gloves steps out of the driver's seat to open the car's back door"
        }
      ]
    }
  ]
}