{
  "ground_truth": "He pulls Rose up. Three nearby sailors turn and run toward Jack. Rose grips the railing with her free hand as Jack holds her up and onto the poop deck as Jack wraps his arms around Rose's torso and lifts her back over the rail. Jack falls on top of Rose as she is spilled onto the deck. The sailors run up to them. One sailor glances at Jack and then at Rose's torn dress. Jack stands and places his hands into his trouser pockets. Later, Rose is wrapped in a blanket as men handcuffed Jack. Jack glances at wide-eyed Rose. Cal rubs Rose's arms. Cal strides back to Jack. Rose glances at Jack before leaving with Cal. Jack motions over Cal's brown-haired manservant. He steps up to Jack and holds out a cigarette case. Jack takes two cigarettes, placing one in his mouth and the other behind his left ear. Jack looks down at his unlaced boots. Jack looks down as the man walks off. In her berth, Rose sits at a vanity table and holds her silver hand mirror. She sets down the mirror as Cal opens the door. Cal opens a box containing the heart of the ocean. He fastens the necklace with a blue heart-shaped diamond on Rose. Rose strokes the necklace as she gazes at her own reflection on the vanity mirror. Cal kneels beside Rose. She stares at him. Cal smiles at the blank-faced Rose who blinks then turns and stares at her reflection. She places her right hand over the diamond. Daytime, Jack and Rose walk along in the upper deck. Rose holds out her engagement ring. Rose shakes Jack's hand up and down. She releases his hand and walks away. She stares at him with her mouth open. She snatches Jack's sketchbook. Jack sits beside Rose as she flips through his drawings. She studies a sketch of a woman breastfeeding an infant. She turns to a drawing of a nude woman lying on her side with a cigarette in her mouth. Another sketch depicts a nude woman standing against a ballet bar. Rose closes the sketchbook as another passenger walks past. Smiling, Rose turns to his sketch of a nude dark-haired woman lying with one arm stretched over her head. Another drawing of just a pair of hands. Rose looks down open-mouthed as Jack flips to another drawing. A fully-clothed middle-aged woman. Rose smiles at Jack. Her smile fades. In a dining room, Ruth sips tea with two other women. Ruth nods at Molly then strides off. Nearby mustached Ismay sits with the captain. Jack takes Rose's hand. He pulled her to a different section of the railing. Jack spits.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He lifts Rose up. Three close sailors spin and sprint toward Jack. Rose clutches the railing with her liberated hand as Jack supports her up and onto the poop deck as Jack enfolds his arms around Rose's torso and hoists her back over the rail. Jack tumbles atop Rose as she is spilled onto the deck. The sailors dash up to them. One sailor glances at Jack and then at Rose's ripped gown. Jack rises and places his hands into his trouser pockets. Later, Rose is swathed in a blanket as men handcuffed Jack. Jack glances at wide-eyed Rose. Cal rubs Rose's arms. Cal strides back to Jack. Rose glances at Jack before departing with Cal. Jack gestures over Cal's brown-haired servant. He steps up to Jack and extends a cigarette case. Jack takes two cigarettes, placing one in his mouth and the other behind his left ear. Jack gazes down at his unlaced boots. Jack gazes down as the man walks off. In her quarters, Rose sits at a vanity table and holds her silver hand mirror. She sets down the mirror as Cal opens the door. Cal opens a box containing the heart of the ocean. He fastens the necklace with a blue heart-shaped diamond on Rose. Rose caresses the necklace as she gazes at her own reflection on the vanity mirror. Cal kneels beside Rose. She stares at him. Cal smiles at the blank-faced Rose who blinks then turns and stares at her reflection. She places her right hand over the diamond. Daytime, Jack and Rose stroll along in the upper deck. Rose holds out her engagement ring. Rose shakes Jack's hand up and down. She releases his hand and walks away. She stares at him with her mouth agape. She seizes Jack's sketchbook. Jack sits beside Rose as she flips through his drawings. She examines a sketch of a woman breastfeeding an infant. She turns to a drawing of a nude woman lying on her side with a cigarette in her mouth. Another sketch portrays a nude woman standing against a ballet bar. Rose closes the sketchbook as another passenger walks past. Smiling, Rose turns to his sketch of a nude dark-haired woman lying with one arm stretched over her head. Another drawing of just a pair of hands. Rose looks down open-mouthed as Jack flips to another drawing. A fully-clothed middle-aged woman. Rose smiles at Jack. Her smile fades. In a dining room, Ruth sips tea with two other women. Ruth nods at Molly then strides off. Nearby mustached Ismay sits with the captain. Jack takes Rose's hand. He drew her to a different section of the railing. Jack spits."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He pulls Rose up. Three nearby sailors turn and run toward Jack. The railing is gripped by Rose with her free hand as she is held up and onto the poop deck by Jack as Rose's torso is wrapped by Jack's arms, and she is lifted back over the rail. Rose is fallen on by Jack as she is spilled onto the deck. They are run up to by the sailors. Jack is glanced at by one sailor and then Rose's torn dress is glanced at. Jack stands and places his hands into his trouser pockets. Later, a blanket is wrapped around Rose as men handcuff Jack. Wide-eyed Rose is glanced at by Jack. Rose's arms are rubbed by Cal. Jack is strided back to by Cal. Jack is glanced at by Rose before she leaves with Cal. Cal's brown-haired manservant is motioned over by Jack. A cigarette case is held out to Jack as he steps up. Two cigarettes are taken by Jack, one is placed in his mouth, and the other behind his left ear. Jack looks down at his unlaced boots. The man walks off as Jack looks down. In her berth, Rose sits at a vanity table and holds her silver hand mirror. The mirror is set down as the door is opened by Cal. The heart of the ocean is contained in a box opened by Cal. A necklace with a blue heart-shaped diamond is fastened on Rose by him. The necklace is stroked by Rose as her own reflection on the vanity mirror is gazed at by her. Cal kneels beside Rose. He is stared at by her. The blank-faced Rose is smiled at by Cal, who blinks then turns and stares at her reflection. Her right hand is placed over the diamond by her. Daytime, Jack and Rose walk along the upper deck. Her engagement ring is held out by Rose. Jack's hand is shaken up and down by Rose. His hand is released by her, and she walks away. He is stared at by her with her mouth open. Jack's sketchbook is snatched by her. She flips through his drawings as Jack sits beside Rose. She studies a sketch of a woman breastfeeding an infant. A drawing of a nude woman lying on her side with a cigarette in her mouth is turned to by her. Another sketch depicts a nude woman standing against a ballet bar. The sketchbook is closed by Rose as another passenger walks past. Smiling, she turns to his sketch of a nude dark-haired woman lying with one arm stretched over her head. Another drawing of just a pair of hands is seen by her. Open-mouthed, Rose looks down as another drawing is flipped to by Jack. A fully-clothed middle-aged woman. Jack is smiled at by Rose. Her smile fades. In a dining room, tea is sipped by Ruth with two other women. Molly is nodded at by Ruth, then she strides off. Nearby, the captain sits with mustached Ismay. Rose's hand is taken by Jack. She was pulled by him to a different section of the railing. He spits."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He pulls Rose up. Three sailors rush toward Jack. Rose grips the railing while Jack lifts her onto the poop deck, wrapping his arms around her torso. Jack falls on top of Rose onto the deck. The sailors arrive, one glancing at Jack and then at Rose's torn dress. Jack stands, placing his hands in his pockets. Later, Rose is wrapped in a blanket, and Jack is handcuffed. Jack glances at a wide-eyed Rose. Cal rubs her arms and walks back to Jack. Rose glances at Jack before leaving with Cal. Jack motions to Cal's manservant, who offers a cigarette case. Jack takes two cigarettes, placing one in his mouth and another behind his ear. Jack looks down at his unlaced boots as the man leaves. In her berth, Rose sits at a vanity, setting down a mirror as Cal enters. He opens a box containing the heart of the ocean and fastens a blue heart-shaped diamond necklace on Rose, who touches it while gazing at her reflection. Cal kneels beside her, smiling at the blank-faced Rose as she covers the diamond. Daytime, Jack and Rose walk on the upper deck. Rose shows her engagement ring, shakes Jack’s hand, then walks away. She stares at him, snatches his sketchbook, and examines his drawings. She studies sketches, including a nude woman lying with a cigarette and another against a ballet bar. Rose smiles at Jack, then her smile fades. In a dining room, Ruth sips tea with two women, nods at Molly, and walks off. Nearby, Ismay sits with the captain. Jack takes Rose's hand and leads her to another section of the railing, where Jack spits."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Jack lifts Rose onto the poop deck as nearby sailors run towards them. Rose grips the railing while Jack wraps his arms around her torso, lifting her over the rail, but he falls on top of her. Sailors arrive, noticing Jack and Rose's torn dress. Jack stands, placing his hands in his pockets. Later, Rose is wrapped in a blanket as Jack is handcuffed. Cal comforts Rose and then returns to Jack. Before leaving with Cal, Rose exchanges glances with Jack. Jack signals Cal's servant, who offers him a cigarette case; Jack takes two cigarettes, placing one in his mouth. Alone, Rose sits at a vanity and Cal enters, fastening a diamond necklace on her. She gazes at her reflection and touches the necklace, Cal smiles as Rose looks at him blankly before staring at her reflection again. On the upper deck, Rose shows Jack her engagement ring, shakes his hand, then walks away. She grabs Jack's sketchbook, leafing through drawings of women in various poses, smiling at a drawing of a dark-haired woman. Her smile fades. In the dining room, Ruth drinks tea, nods at Molly, and leaves, as Ismay sits with the captain. Jack takes Rose's hand, pulling her to another railing section, and spits."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "With a firm grasp, he pulls Rose up to safety. Observing the situation, three nearby sailors quickly turn on their heels and hasten toward Jack in response to the unfolding scene. Rose grips the railing tightly with her free hand as Jack diligently holds her up. He then manages to carefully maneuver her onto the poop deck, wrapping his arms securely around Rose's torso to lift her back over the rail. As a result, Jack inadvertently falls on top of Rose when she is finally spilled onto the deck. The sailors arrive promptly, running up to the pair. One of the sailors glances back and forth between Jack and the torn state of Rose's dress. Rising to his feet, Jack casually places his hands into his trouser pockets. In a later scene, Rose finds herself wrapped in the comforting embrace of a blanket while men proceed to handcuff Jack. With curiosity and concern, Jack glances at Rose, whose eyes are wide with surprise. Cal, meanwhile, gently rubs Rose's arms in a comforting gesture before striding purposefully back toward Jack. As Rose prepares to leave with Cal, she casts a glance at Jack. With a subtle motion, Jack signals to Cal's brown-haired manservant, who approaches Jack and offers him a cigarette case. Accepting the gesture, Jack takes two cigarettes: one is placed between his lips, and the other is tucked behind his left ear for later. His attention momentarily shifts downward as he notices his unlaced boots, just as the manservant walks off. In her cabin, Rose sits pensively at a vanity table, holding a delicate silver hand mirror. She sets it down just as Cal enters, carrying a box. Inside is the sparkling heart of the ocean. Cal carefully fastens the magnificent necklace, featuring a blue heart-shaped diamond, around Rose's neck. Mesmerized, Rose gently strokes the necklace while gazing intently at her own reflection in the vanity mirror. With Cal kneeling beside her, she stares at him, her expression unreadable. Cal offers a smile to the blank-faced Rose, who blinks, then turns her gaze back to her reflection. She places her right hand protectively over the diamond's surface. In the bright daytime, Jack and Rose walk together on the upper deck. Rose extends her hand, displaying her engagement ring. With a sense of finality, she shakes Jack's hand up and down, then releases it and begins to walk away, her expression open and uncertain. She turns back momentarily, mouth slightly open, and swiftly snatches Jack's sketchbook from him. Jack takes a seat beside Rose as she curiously flips through the pages of his drawings. She pauses to study a detailed sketch of a woman breastfeeding an infant. Turning to another page, she observes a drawing of a nude woman lying on her side, confidently holding a cigarette in her mouth. Yet another sketch captures a nude woman standing gracefully against a ballet bar. Rose, sensing another passenger walking past, closes the sketchbook. With a smile playing at the corners of her lips, she turns to a sketch of a nude, dark-haired woman reclining with one arm stretched languidly over her head. Another drawing presents just a simple yet expressive pair of hands. Rose looks down, her mouth open in surprise, as Jack flips to another drawing. This one features a fully clothed, middle-aged woman. Smiling warmly at Jack, her expression slowly fades away. Meanwhile, in a grand dining room, Ruth sits with two other women, sipping tea thoughtfully. After nodding at Molly, she strides purposefully away. Nearby, the mustached Ismay is engaged in conversation with the captain. As they stand together, Jack takes Rose's hand in his own. He gently pulls her toward a different section of the ship's railing, where, in a moment of lighthearted mischief, Jack spits over the side."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a firm and unwavering grasp, he skillfully pulls Rose up to safety, ensuring her well-being. Observing the unfolding situation, three nearby sailors quickly turn on their heels, hastening with urgency toward Jack in response to the dramatic scene. Rose, feeling the necessity of security, grips the railing tightly with her free hand while Jack diligently holds her up with care and determination. He then manages, with precise effort, to carefully maneuver her onto the poop deck, wrapping his arms securely around Rose's torso to lift her back over the rail. As a result of this action, Jack inadvertently falls on top of Rose when she is finally and unceremoniously spilled onto the deck. The sailors arrive promptly, running up to the pair with notable speed. One of the sailors glances back and forth between Jack and the torn state of Rose's dress, assessing the situation. Rising to his feet with a casual demeanor, Jack places his hands into his trouser pockets. In a scene that occurs later, Rose finds herself wrapped in the comforting embrace of a warm blanket while men proceed to handcuff Jack. With curiosity and concern evident on his face, Jack glances at Rose, whose eyes are wide with surprise and emotion. Meanwhile, Cal gently rubs Rose's arms in a comforting gesture before striding purposefully back toward Jack. As Rose prepares to leave with Cal, she casts a significant glance at Jack. With a subtle motion, Jack signals to Cal's brown-haired manservant, who promptly approaches Jack and offers him a luxurious cigarette case. Accepting the gesture with appreciation, Jack takes two cigarettes: one is placed casually between his lips, and the other is tucked behind his left ear for later use. His attention momentarily shifts downward as he notices his unlaced boots, just as the manservant walks off into the distance. In her cabin, Rose sits pensively at a vanity table, holding a delicate silver hand mirror, reflecting on her circumstances. She sets it down gently just as Cal enters, carrying a beautifully crafted box. Inside is the sparkling heart of the ocean. Cal carefully fastens the magnificent necklace, featuring a stunning blue heart-shaped diamond, around Rose's elegant neck. Mesmerized by its beauty, Rose gently strokes the necklace while gazing intently at her own reflection in the vanity mirror. With Cal kneeling beside her, she stares at him, her expression remaining unreadable and enigmatic. Cal offers a warm smile to the blank-faced Rose, who blinks, then turns her gaze back to her reflection. She places her right hand protectively over the diamond's surface, feeling a sense of ownership. In the bright, sunlit daytime, Jack and Rose walk together on the upper deck. Rose extends her hand, proudly displaying her engagement ring. With a sense of finality and resolution, she shakes Jack's hand up and down before releasing it and beginning to walk away, her expression open yet uncertain. She turns back momentarily, mouth slightly open, and swiftly snatches Jack's sketchbook from him, almost playfully. Jack takes a seat beside Rose as she curiously flips through the pages of his carefully drawn sketches. She pauses to study a detailed sketch of a woman breastfeeding an infant, admiring its intricacy. Turning to another page, she observes a drawing of a nude woman lying on her side, confidently holding a cigarette in her mouth. Yet another sketch captures a nude woman standing gracefully against a ballet bar, exuding elegance. Rose, sensing another passenger walking past, closes the sketchbook quickly. With a smile playing at the corners of her lips, she turns to a sketch of a nude, dark-haired woman reclining with one arm stretched languidly over her head. Another drawing presents just a simple yet expressive pair of hands, capturing pure emotion. Rose looks down, her mouth open in surprise, as Jack flips to another drawing. This one features a fully clothed, middle-aged woman, shown with dignity. Smiling warmly at Jack, her expression slowly fades away as she reflects on the art. Meanwhile, in a grand and opulent dining room, Ruth sits with two other women, sipping tea thoughtfully and engaging in conversation. After nodding at Molly, she strides purposefully away, leaving the table. Nearby, the mustached Ismay is engaged in a deep conversation with the captain. As they stand together, Jack takes Rose's hand in his own with a sense of camaraderie. He gently pulls her toward a different section of the ship's railing, where, in a moment of lighthearted mischief, Jack spits over the side, enjoying the carefree moment."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He reaches out and grasps Rose's hand firmly, pulling her upward with a determined strength. As he does so, three sailors nearby become alert, turning quickly and sprinting toward Jack with urgency in their steps. Meanwhile, Rose clutches the railing tightly with her free hand for support, while Jack lifts her onto the poop deck, wrapping his arms securely around her torso and hoisting her back over the rail with care. In the process, Jack's momentum carries him forward, causing him to fall on top of Rose as she spills onto the deck. The sailors reach them at that moment, glancing first at Jack and then at the torn fabric of Rose's dress, taking in the scene with assessing eyes. Jack pushes himself up from the deck, brushing off the encounter as he stands and slides his hands nonchalantly into his trouser pockets. Later, Rose finds herself enveloped in a warm blanket, a stark contrast to the cold metal of the handcuffs that secure Jack. He casts a glance toward Rose, whose eyes are wide with emotion, before Cal steps in, gently rubbing Rose's arms in a comforting gesture. Cal then takes confident strides back to Jack, who exchanges a lingering glance with Rose before she turns away to leave with Cal. Jack discreetly signals to Cal's brown-haired manservant, who approaches and offers a cigarette case. Jack accepts two cigarettes, placing one casually between his lips and tucking the other behind his left ear. As he looks down at his unlaced boots, Jack watches quietly as the manservant walks away. In the privacy of her berth, Rose sits at her vanity table, holding her silver hand mirror and examining her reflection. She carefully sets down the mirror as Cal enters and opens a box, revealing the heart of the ocean necklace inside. Cal gently fastens the necklace around Rose's neck, the blue heart-shaped diamond resting prominently against her skin. Rose's fingers stroke the necklace as she gazes at her reflection in the vanity mirror, lost in thought. Cal kneels beside her, looking up at her expectantly. Rose stares at him with a blank expression, prompting Cal to smile encouragingly at her. She blinks, then turns back to her reflection, her hand instinctively covering the diamond. In the bright daylight on the upper deck, Jack and Rose walk alongside one another. Rose extends her hand, displaying her engagement ring to Jack. With a firm grip, she shakes Jack's hand up and down before releasing it and walking away, her eyes remaining fixed on him, her mouth slightly open in an unspoken question. She quickly snatches Jack's sketchbook, her curiosity piqued. Jack sits beside her, watching as she flips through the pages, each drawing revealing a new story. She pauses at a sketch of a woman breastfeeding an infant, studies it, then turns to a drawing of a nude woman reclining on her side with a cigarette provocatively in her mouth. Another sketch captures a nude woman posed against a ballet bar, her form elegantly depicted. As another passenger strolls past them, Rose instinctively closes the sketchbook, but a smile tugs at her lips. She reopens it to find a drawing of a nude dark-haired woman lying with one arm stretched above her head, and another sketch focuses solely on a pair of hands. Rose leans in closer, her mouth open in awe as Jack flips to another drawing, this time of a fully-clothed middle-aged woman. Her eyes meet Jack's, and a smile spreads across her face, though it fades quickly into a more serious contemplation. In a nearby dining room, Ruth sips tea with two other women, nodding politely at Molly before striding purposefully away. At another table, Ismay, with his distinguished mustache, sits engaged in conversation with the captain. Meanwhile, Jack reaches for Rose's hand, and together they move to a different section of the railing. With a casual flick, Jack spits over the side, marking the end of their shared moment."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jack pulls Rose up onto the poop deck, where nearby sailors rush toward them. As Rose grips the railing, Jack lifts her over it and they both tumble onto the deck. The sailors arrive, observing Jack and Rose with curiosity, particularly noting Rose's torn dress. Afterward, Jack stands with his hands in his pockets as Rose is wrapped in a blanket and he is handcuffed. Cal comforts Rose and then approaches Jack, while Rose exchanges a glance with Jack before leaving with Cal. Jack signals to Cal's manservant, who offers him a cigarette case. Jack takes two cigarettes, placing one in his mouth and the other behind his ear, and notices his unlaced boots.\n\nIn her cabin, Rose sits at a vanity table, holding her mirror, which she sets down as Cal enters, presenting the Heart of the Ocean necklace. He fastens the necklace around her neck, and Rose touches it, gazing at her reflection. Cal kneels beside her, and though he smiles, Rose remains blank-faced, eventually placing her hand over the diamond as she turns back to her reflection.\n\nDuring the day, Jack and Rose walk together on the upper deck. Rose shows Jack her engagement ring, shakes his hand, then walks away, watching him with a mix of curiosity and intrigue. She quickly takes Jack's sketchbook and begins flipping through it while sitting beside him. She examines various sketches — a woman breastfeeding, a nude woman with a cigarette, and another at a ballet bar. As another passenger passes by, Rose closes the sketchbook and smiles at a particular drawing of a nude, dark-haired woman. As Jack shows her more sketches, she reacts with both surprise and admiration.\n\nMeanwhile, in the dining room, Ruth is sipping tea with two women before she leaves, noticing Molly. Nearby, a mustached Ismay sits with the captain. Jack then takes Rose's hand and leads her to a different part of the railing, where he spits, indicating a moment of shared rebellion."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He pulls Rose up on the Titanic's famous deck, known for its grandeur and opulence. Three nearby sailors, trained rigorously for such emergencies on this maiden voyage of the largest ship afloat, turn and run toward Jack. Rose grips the railing with her free hand, the metal cold as it had been cast in the Harland and Wolff shipyard in Belfast, as Jack holds her up and onto the poop deck, a term used for the elevated stern section of a ship, as Jack wraps his arms around Rose's torso and lifts her back over the rail. Jack falls on top of Rose as she is spilled onto the deck. The sailors, part of a crew responsible for the safety of over two thousand passengers, run up to them. One sailor glances at Jack and then at Rose's torn dress, a delicate piece made in the fashion of 1912. Jack stands and places his hands into his trouser pockets, a gesture betraying his lower-class attire in contrast to the opulent surroundings. Later, Rose is wrapped in a blanket like those provided to first-class passengers, as men handcuffed Jack, suspecting him of theft or misconduct. Jack glances at wide-eyed Rose, who is caught between social expectations and personal feelings. Cal, her wealthy fiancé from one of Pittsburgh's steel dynasties, rubs Rose's arms, trying to assert his protective role. Cal strides back to Jack, exuding an air of entitlement common among the well-to-do aboard. Rose glances at Jack before leaving with Cal, torn by her growing feelings for the free-spirited artist. Jack motions over Cal's brown-haired manservant, whose loyalty is dictated by the rigid class structures of the time. He steps up to Jack and holds out a cigarette case, crafted from silver by a renowned London silversmith. Jack takes two cigarettes, placing one in his mouth and the other behind his left ear, a classic move of carefree individuals. Jack looks down at his unlaced boots, symbolic of his outsider status among the ship’s elite. Jack looks down as the man walks off, maintaining the manservant's discreet presence. In her luxurious first-class berth, decorated with stained glass lamps and velvet furnishings, Rose sits at a vanity table and holds her silver hand mirror, reflecting her inner conflict. She sets down the mirror as Cal opens the door, his entrance an intrusion on her solitude. Cal opens a box containing the heart of the ocean, a fictional but priceless necklace evoking the Hope Diamond in its grandeur. He fastens the necklace with a blue heart-shaped diamond on Rose, a symbol of his wealth and control. Rose strokes the necklace as she gazes at her own reflection on the vanity mirror, contemplating her future. Cal kneels beside Rose, hoping the grand gesture will bind her to him. She stares at him, her emotions hidden. Cal smiles at the blank-faced Rose who blinks then turns and stares at her reflection, trapped in a role she did not choose. She places her right hand over the diamond, feeling the weight of her choices. Daytime, Jack and Rose walk along in the upper deck, where first-class passengers stroll and socialize. Rose holds out her engagement ring, a sparkling testament to her engagement with Cal. Rose shakes Jack's hand up and down, a gesture of newfound trust. She releases his hand and walks away, her heart torn. She stares at him with her mouth open, recognizing the freedom he represents. She snatches Jack's sketchbook, curious about the world he captures through art. Jack sits beside Rose as she flips through his drawings, each telling a unique story. She studies a sketch of a woman breastfeeding an infant, a tender moment of motherhood. She turns to a drawing of a nude woman lying on her side with a cigarette in her mouth, reflecting Jack's bohemian lifestyle. Another sketch depicts a nude woman standing against a ballet bar, showcasing grace and strength. Rose closes the sketchbook as another passenger walks past, aware of the social norms dictating her actions. Smiling, Rose turns to his sketch of a nude dark-haired woman lying with one arm stretched over her head, seeing beauty in every form. Another drawing of just a pair of hands, capturing the simplicity and complexity of human connection. Rose looks down open-mouthed as Jack flips to another drawing, each page an insight into his world. A fully-clothed middle-aged woman, a contrast to the previous sketches, highlighting everyday beauty. Rose smiles at Jack, understanding his vision. Her smile fades, reflecting her internal struggle. In a dining room, opulently set with fine china and crystal chandeliers, Ruth sips tea with two other women, a ritual of elite social life. Ruth nods at Molly, a spirited American millionairess known for her independent ways, then strides off, maintaining her social stature. Nearby mustached Ismay, a key figure in the White Star Line, sits with the captain, discussing the ship's progress. Jack takes Rose's hand, symbolizing his defiance against the world separating them. He pulled her to a different section of the railing, seeking privacy on the vast ship. Jack spits, a rebellious act against the constraints of societal expectations."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He pulls Rose up. Three nearby sailors turn and run toward Jack. Rose grips the railing with her free hand as Jack holds her up and onto the poop deck. as Jack wraps his arms around Rose's torso and lifts her back over the rail. Jack falls on top of Rose as she is spilled onto the deck. The sailors run up to them. One sailor glances at Jack and then at Rose's torn dress. Jack stands and places his hands into his trouser pockets. Later. Rose is wrapped in a blanket as men handcuffed Jack. Jack glances at wideeyed Rose. Cal rubs Rose's arms. Cal strides back to Jack. Rose glances at Jack before leaving with Cal. Jack motions over Cal's brownhaired manservant. He steps up to Jack and holds out a cigarette case. Jack takes two cigarettes placing one in his mouth and the other behind his left ear. Jack looks down at his unlaced boots. Jack looks down as the man walks off. In her berth. Rose sits at a vanity table and holds her silver hand mirror. She sets down the mirror as Cal opens the door. Cal opens a box containing the heart of the ocean. He fastens the necklace with a blue heartshaped diamond on Rose. Rose strokes the necklace as she gazes at her own reflection on the vanity mirror. Cal kneels beside Rose. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. She stares at him. Cal smiles at the blankfaced Rose who blinks then turns and stares at her reflection. She places her right hand over the diamond. Daytime. Jack and Rose walk along in the upper deck. Rose holds out her engagement ring. Rose shakes Jack's hand up and down. She releases his hand and walks away. She stares at him with her mouth open. She snatches Jack's sketchbook. Jack sits beside Rose as she flips through his drawings. She studies a sketch of a woman breastfeeding an infant. She turns to a drawing of a nude woman lying on her side with a cigarette in her mouth. Another sketch depicts a nude woman standing against a ballet bar. Rose closes the sketchbook as another passenger walks past Smiling. Rose turns to his sketch of a nude darkhaired woman lying with one arm stretched over her head. Another drawing of just a pair of hands. Rose looks down openmouthed as Jack flips to another drawing. A fullyclothed middleaged woman. Rose smiles at Jack. Her smile fades. In a dining room Ruth sips tea with two other women. Ruth nods at Molly then strides off. Nearby mustached Ismay sits with the captain. Jack takes Rose's hand. He pulled her to a different section of the railing. Jack spits."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He pulls Rose up. Three nearby sailors turn and run toward Jack. Rose grips the railing with her free hand as Jack holds her up and onto the poop deck. as Jack wraps his arms around Rose's torso and lifts her back over the rail. Jack falls on top of Rose as she is spilled onto the deck. The sailors run up to them. One sailor glances at Jack and then at Rose's torn dress. Jack stands and places his hands into his trouser pockets. Later. Rose is wrapped in a blanket as men handcuffed Jack. Jack glances at wideeyed Rose. Cal rubs Rose's arms. Cal strides back to Jack. Rose glances at Jack before leaving with Cal. Jack motions over Cal's brownhaired manservant. He steps up to Jack and holds out a cigarette case. Jack takes two cigarettes placing one in his mouth and the other behind his left ear. Jack looks down at his unlaced boots. Jack looks down as the man walks off. In her berth. Rose sits at a vanity table and holds her silver hand mirror. She sets down the mirror as Cal opens the door. Cal opens a box containing the heart of the ocean. He fastens the necklace with a blue heartshaped diamond on Rose. Rose strokes the necklace as she gazes at her own reflection on the vanity mirror. Cal kneels beside Rose. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. She stares at him. Cal smiles at the blankfaced Rose who blinks then turns and stares at her reflection. She places her right hand over the diamond. Daytime. Jack and Rose walk along in the upper deck. Rose holds out her engagement ring. Rose shakes Jack's hand up and down. She releases his hand and walks away. She stares at him with her mouth open. She snatches Jack's sketchbook. Jack sits beside Rose as she flips through his drawings. She studies a sketch of a woman breastfeeding an infant. She turns to a drawing of a nude woman lying on her side with a cigarette in her mouth. Another sketch depicts a nude woman standing against a ballet bar. Rose closes the sketchbook as another passenger walks past Smiling. Rose turns to his sketch of a nude darkhaired woman lying with one arm stretched over her head. Another drawing of just a pair of hands. Rose looks down openmouthed as Jack flips to another drawing. A fullyclothed middleaged woman. Rose smiles at Jack. Her smile fades. In a dining room Ruth sips tea with two other women. Ruth nods at Molly then strides off. Nearby mustached Ismay sits with the captain. Jack takes Rose's hand. He pulled her to a different section of the railing. Jack spits."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He pulls Rose up. Three nearby sailors turn and run toward Jack. Rose grips the railing with her free hand as Jack holds her up and onto the poop deck. as Jack wraps his arms around Rose's torso and lifts her back over the rail. Jack falls on top of Rose as she is spilled onto the deck. The sailors run up to them. One sailor glances at Jack and then at Rose's torn dress. Jack stands and places his hands into his trouser pockets. Later. Rose is wrapped in a blanket as men handcuffed Jack. Jack glances at wideeyed Rose. Cal rubs Rose's arms. Cal strides back to Jack. Another sketch depicts a nude woman standing against a ballet bar. Rose closes the sketchbook as another passenger walks past Smiling. Rose turns to his sketch of a nude darkhaired woman lying with one arm stretched over her head. Another drawing of just a pair of hands. Rose looks down openmouthed as Jack flips to another drawing. A fullyclothed middleaged woman. Rose smiles at Jack. Her smile fades. In a dining room Ruth sips tea with two other women. Ruth nods at Molly then strides off. Nearby mustached Ismay sits with the captain. Jack takes Rose's hand. He pulled her to a different section of the railing. Jack spits."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He pulls Rose up. Three nearby sailors turn and run toward Jack. Rose grips the railing with her free hand as Jack holds her up and onto the poop deck. as Jack wraps his arms around Rose's torso and lifts her back over the rail. Jack falls on top of Rose as she is spilled onto the deck. In a dining room Ruth sips tea with two other women. Ruth nods at Molly then strides off. Nearby mustached Ismay sits with the captain. Jack takes Rose's hand. He pulled her to a different section of the railing. Jack spits."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "He lowers Daisy down. Three nearby plumbers swivel and sprint toward Max. Daisy clutches the lamppost with her baggy hand as Max pushes her up and onto the caboose as Max wraps his legs around Daisy's waist and hoists her back over the gate. Max tumbles on top of Daisy as she is tumbled onto the floor. The plumbers dash up to them. One plumber peeks at Max and then at Daisy's ripped skirt. Max leaps and places his fingers into his coat pockets. Later, Daisy is draped in a towel as farmers shackled Max. Max peeks at astonished Daisy. Sam pets Daisy's shoulders. Sam strides back to Max. Daisy peeks at Max before departing with Sam. Max signals over Sam's curly-haired assistant. He steps up to Max and offers a book. Max takes two bookmarks, placing one in his notebook and the other behind his right ear. Max gazes down at his untied shoes. Max gazes down as the assistant strolls away. In her cabin, Daisy rests at a kitchen counter and grasps her golden spoon. She places down the spoon as Sam opens the cupboard. Sam opens a jar containing the key to the attic. He secures the bracelet with a blue heart-shaped emblem on Daisy. Daisy caresses the bracelet as she stares at her own reflection on the kitchen window. Sam crouches beside Daisy. She glances at him. Sam grins at the emotionless Daisy who blinks then turns and gazes at her reflection. She places her right finger over the emblem. Daytime, Max and Daisy stroll along in the main hallway. Daisy extends her friendship bracelet. Daisy shakes Max's foot up and down. She releases his foot and strolls away. She glances at him with her nose flared. She snatches Max's textbook. Max sits beside Daisy as she flips through his doodles. She examines a drawing of a farmer feeding a calf. She flips to a doodle of a clothed woman lying on her back with a pen in her mouth. Another doodle features a clothed woman standing against a lamppost. Daisy closes the textbook as another pedestrian walks past. Grinning, Daisy turns to his doodle of a clothed red-haired woman lying with one arm extended over her head. Another doodle of just a pair of feet. Daisy gazes down surprised as Max flips to another doodle. A fully-dressed elderly man. Daisy grins at Max. Her grin fades. In a living room, Claire sips water with two other men. Claire winks at Sarah then ambles off. Nearby bearded Harold chats with the bartender. Max takes Daisy's foot. He pulled her to a different area of the garden. Max whistles."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jack helps Rose onto the poop deck after rescuing her from a fall. Nearby sailors notice Rose's torn dress and confront Jack, who is later handcuffed, while Cal comforts Rose. In her room, Rose receives a necklace with a blue heart-shaped diamond from Cal, who tries to charm her, but she remains detached. Later, Jack and Rose walk together, and she examines Jack's sketchbook, intrigued by his drawings. They share a moment before being interrupted by another passenger. In the dining room, Jack takes Rose to a different section of the ship, where he spits over the railing, symbolizing their growing bond."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Jack spits He pulled her to a different section of the railing Jack takes Rose's hand Nearby mustached Ismay sits with the captain Ruth nods at Molly then strides off In a dining room Ruth sips tea with two other women Her smile fades Rose smiles at Jack A fullyclothed middleaged woman Rose looks down openmouthed as Jack flips to another drawing Another drawing of just a pair of hands Rose turns to his sketch of a nude darkhaired woman lying with one arm stretched over her head Rose closes the sketchbook as another passenger walks past Smiling Another sketch depicts a nude woman standing against a ballet bar She turns to a drawing of a nude woman lying on her side with a cigarette in her mouth She studies a sketch of a woman breastfeeding an infant Jack sits beside Rose as she flips through his drawings She snatches Jack's sketchbook She stares at him with her mouth open She releases his hand and walks away Rose shakes Jack's hand up and down Rose holds out her engagement ring Jack and Rose walk along in the upper deck Daytime She places her right hand over the diamond Cal smiles at the blankfaced Rose who blinks then turns and stares at her reflection She stares at him Cal kneels beside Rose Rose strokes the necklace as she gazes at her own reflection on the vanity mirror He fastens the necklace with a blue heartshaped diamond on Rose Cal opens a box containing the heart of the ocean She sets down the mirror as Cal opens the door Rose sits at a vanity table and holds her silver hand mirror In her berth Jack looks down as the man walks off Jack looks down at his unlaced boots Jack takes two cigarettes placing one in his mouth and the other behind his left ear He steps up to Jack and holds out a cigarette case Jack motions over Cal's brownhaired manservant Rose glances at Jack before leaving with Cal Cal strides back to Jack Cal rubs Rose's arms Jack glances at wideeyed Rose Rose is wrapped in a blanket as men handcuffed Jack Later Jack stands and places his hands into his trouser pockets One sailor glances at Jack and then at Rose's torn dress The sailors run up to them Jack falls on top of Rose as she is spilled onto the deck as Jack wraps his arms around Rose's torso and lifts her back over the rail Rose grips the railing with her free hand as Jack holds her up and onto the poop deck Three nearby sailors turn and run toward Jack He pulls Rose up"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Three nearby sailors turn and run toward Jack He pulls Rose up as Jack wraps his arms around Rose's torso and lifts her back over the rail Rose grips the railing with her free hand as Jack holds her up and onto the poop deck The sailors run up to them Jack falls on top of Rose as she is spilled onto the deck Jack stands and places his hands into his trouser pockets One sailor glances at Jack and then at Rose's torn dress Rose is wrapped in a blanket as men handcuffed Jack Later Cal rubs Rose's arms Jack glances at wideeyed Rose Rose glances at Jack before leaving with Cal Cal strides back to Jack He steps up to Jack and holds out a cigarette case Jack motions over Cal's brownhaired manservant Jack looks down at his unlaced boots Jack takes two cigarettes placing one in his mouth and the other behind his left ear In her berth Jack looks down as the man walks off She sets down the mirror as Cal opens the door Rose sits at a vanity table and holds her silver hand mirror He fastens the necklace with a blue heartshaped diamond on Rose Cal opens a box containing the heart of the ocean Cal kneels beside Rose Rose strokes the necklace as she gazes at her own reflection on the vanity mirror Cal smiles at the blankfaced Rose who blinks then turns and stares at her reflection She stares at him Daytime She places her right hand over the diamond Rose holds out her engagement ring Jack and Rose walk along in the upper deck She releases his hand and walks away Rose shakes Jack's hand up and down She snatches Jack's sketchbook She stares at him with her mouth open She studies a sketch of a woman breastfeeding an infant Jack sits beside Rose as she flips through his drawings Another sketch depicts a nude woman standing against a ballet bar She turns to a drawing of a nude woman lying on her side with a cigarette in her mouth Rose turns to his sketch of a nude darkhaired woman lying with one arm stretched over her head Rose closes the sketchbook as another passenger walks past Smiling Rose looks down openmouthed as Jack flips to another drawing Another drawing of just a pair of hands Rose smiles at Jack A fullyclothed middleaged woman In a dining room Ruth sips tea with two other women Her smile fades Nearby mustached Ismay sits with the captain Ruth nods at Molly then strides off He pulled her to a different section of the railing Jack takes Rose's hand Jack spits"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Cal smiles at the blankfaced Rose who blinks then turns and stares at her reflection She places her right hand over the diamond Daytime Jack and Rose walk along in the upper deck Rose holds out her engagement ring Rose shakes Jack's hand up and down She releases his hand and walks away She stares at him with her mouth open She snatches Jack's sketchbook Jack sits beside Rose as she flips through his drawings She studies a sketch of a woman breastfeeding an infant She turns to a drawing of a nude woman lying on her side with a cigarette in her mouth Another sketch depicts a nude woman standing against a ballet bar Rose closes the sketchbook as another passenger walks past Smiling Rose turns to his sketch of a nude darkhaired woman lying with one arm stretched over her head Another drawing of just a pair of hands Rose looks down openmouthed as Jack flips to another drawing A fullyclothed middleaged woman Rose smiles at Jack Her smile fades In a dining room Ruth sips tea with two other women Ruth nods at Molly then strides off Nearby mustached Ismay sits with the captain Jack takes Rose's hand He pulled her to a different section of the railing Jack spits He pulls Rose up Three nearby sailors turn and run toward Jack Rose grips the railing with her free hand as Jack holds her up and onto the poop deck as Jack wraps his arms around Rose's torso and lifts her back over the rail Jack falls on top of Rose as she is spilled onto the deck The sailors run up to them One sailor glances at Jack and then at Rose's torn dress Jack stands and places his hands into his trouser pockets Later Rose is wrapped in a blanket as men handcuffed Jack Jack glances at wideeyed Rose Cal rubs Rose's arms Cal strides back to Jack Rose glances at Jack before leaving with Cal Jack motions over Cal's brownhaired manservant He steps up to Jack and holds out a cigarette case Jack takes two cigarettes placing one in his mouth and the other behind his left ear Jack looks down at his unlaced boots Jack looks down as the man walks off In her berth Rose sits at a vanity table and holds her silver hand mirror She sets down the mirror as Cal opens the door Cal opens a box containing the heart of the ocean He fastens the necklace with a blue heartshaped diamond on Rose Rose strokes the necklace as she gazes at her own reflection on the vanity mirror Cal kneels beside Rose She stares at him"
        }
      ]
    }
  ]
}