{
  "ground_truth": "A petite black woman with long plaits comes towards Skeeter, passing beneath the long, wispy branches of the willow. The black woman, Constantine, smiles at her warmly as she sits down next to her. Constantine grips Skeeter by the hand, bringing a grateful smile to her face, and Skeeter nods with tears in her eyes. They walk out of the willow glade, and Constantine slaps an arm around Skeeter's shoulders. Skeeter walks back the same way she came, with a more relaxed pace and a thoughtful look on her face. Later, she is on the phone, and Charlotte has traced the phone flex to the kitchen. Elegant, slim Ms. Elaine Stein is still on the phone, and Skeeter replaces the receiver, grinning as if she'd just won the jackpot. Meanwhile, Hilly is on Elizabeth's back porch with a contractor. Aibileen glances up at a windy sky. Skeeter waits for Hilly to drive away and then looks pointedly at Aibileen, who hurries in with the laundry basket. They come into Elizabeth's kitchen, and Elizabeth's husband, Raleigh, sees Skeeter sitting with Aibileen. Aibileen gets up from sorting the washing, and black storm clouds release heavy rain on Jackson. At Hilly's house, Minnie is fanning Mrs. Walters with a newspaper. She and Minnie glance towards the window and the storm raging outside. Mrs. Walters sits up in her chair, in awe, and fixes Minnie with a look of confused comprehension. Hilly, who has been lighting candles on the dining table, sits fanning herself. Minnie puts down the paper and sidles to the window, looking out over the terrace and the outdoor toilet beyond it. She sees a sun chair being buffeted in the wind, shifts awkwardly from foot to foot, and the pool umbrella has gone the way of the chair. Minnie beats a hasty retreat, and Mrs. Walters lays out some cards. Her daughter's eyes narrow as she watches Minnie disappear down the hall. In the bathroom, as Minnie softly raises the toilet lid, Hilly puts her ear to the bathroom door. Minnie, caught with her knickers down, freezes, but then defiantly flushes the toilet. Minnie stands with her arms folded, then slams down the lid. Mrs. Walters looks up from her cards without expression. Minnie, carrying her handbag, strides out of the front door into the pouring rain. A child's bedroom is turned upside down, and Aibileen sits with Mae Mobley on her lap, sheltering under an upturned mattress. In Elizabeth's sprawling bungalow the next day, Aibileen, in her maid's uniform, is sitting on the toilet. Flies buzz around her; she brings a hand to her mouth, her face perspiring, her expression world-weary. Elizabeth, holding Mae Mobley's hand, stands outside the wooden toilet on the back porch, and Aibileen picks the child up. Aibileen shuts the toilet door with her free hand.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A diminutive ebony woman with lengthy braids approaches Skeeter, moving beneath the lengthy, delicate branches of the willow. The ebony woman, Constantine, beams at her warmly as she seats herself next to her. Constantine clutches Skeeter by the hand, bringing a thankful grin to her countenance, and Skeeter nods with tears in her eyes. They stroll out of the willow grove, and Constantine drapes an arm around Skeeter's shoulders. Skeeter ambles back the same path she came, with a more leisurely stride and a pensive look on her face. Later, she is on the telephone, and Charlotte has tracked the telephone cord to the kitchen. Graceful, slender Ms. Elaine Stein is still on the line, and Skeeter replaces the handset, beaming as if she'd just hit the jackpot. Meanwhile, Hilly is on Elizabeth's back veranda with a builder. Aibileen glances up at a blustery sky. Skeeter waits for Hilly to drive off and then looks pointedly at Aibileen, who hastens in with the laundry hamper. They enter Elizabeth's kitchen, and Elizabeth's spouse, Raleigh, observes Skeeter seated with Aibileen. Aibileen rises from sorting the wash, and ebony thunderclouds unleash heavy rain on Jackson. At Hilly's home, Minnie is fanning Mrs. Walters with a periodical. She and Minnie glance towards the pane and the tempest raging outside. Mrs. Walters sits up in her chair, awestruck, and fixes Minnie with a look of bewildered understanding. Hilly, who has been lighting tapers on the dining table, sits fanning herself. Minnie puts down the periodical and sidles to the window, gazing out over the terrace and the outdoor lavatory beyond it. She sees a sun lounger being buffeted in the gale, shifts awkwardly from foot to foot, and the pool parasol has gone the way of the lounger. Minnie beats a hasty withdrawal, and Mrs. Walters lays out some playing cards. Her daughter's eyes narrow as she watches Minnie vanish down the corridor. In the restroom, as Minnie quietly lifts the lavatory lid, Hilly puts her ear to the bathroom door. Minnie, caught with her underwear down, freezes, but then defiantly flushes the lavatory. Minnie stands with her arms folded, then slams down the lid. Mrs. Walters looks up from her cards impassively. Minnie, carrying her handbag, strides out of the front entry into the pouring rain. A child's chamber is turned topsy-turvy, and Aibileen sits with Mae Mobley on her lap, sheltering under an overturned mattress. In Elizabeth's sprawling bungalow the following day, Aibileen, in her maid's livery, is sitting on the lavatory. Flies buzz around her; she brings a hand to her mouth, her face perspiring, her expression world-weary. Elizabeth, holding Mae Mobley's hand, stands outside the wooden lavatory on the back porch, and Aibileen picks the child up. Aibileen shuts the lavatory door with her free hand."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A petite black woman with long plaits is approached by Skeeter, passing beneath the long, wispy branches of the willow. Skeeter is smiled at warmly by the black woman, Constantine, as she sits down next to her. Skeeter is gripped by Constantine by the hand, bringing a grateful smile to her face, and Skeeter is nodded at with tears in her eyes. The willow glade is walked out of by them, and an arm is slapped around Skeeter's shoulders by Constantine. The same way she came is walked back by Skeeter, with a more relaxed pace and a thoughtful look on her face. Later, she is on the phone, and the phone flex has been traced to the kitchen by Charlotte. Skeeter is still on the phone with elegant, slim Ms. Elaine Stein, and the receiver is replaced by Skeeter, grinning as if she'd just won the jackpot. Meanwhile, Hilly is on Elizabeth's back porch with a contractor. A windy sky is glanced up at by Aibileen. Hilly is waited for by Skeeter to drive away and then Aibileen is looked at pointedly by Skeeter, who hurries in with the laundry basket. Elizabeth's kitchen is entered by them, and Skeeter is seen by Elizabeth's husband, Raleigh, sitting with Aibileen. The washing is sorted by Aibileen, and black storm clouds release heavy rain on Jackson. At Hilly's house, Mrs. Walters is fanned by Minnie with a newspaper. The window and the storm raging outside are glanced towards by her and Minnie. Awe shows on Mrs. Walters' face as she sits up in her chair, fixing Minnie with a look of confused comprehension. The dining table is where candles have been lit by Hilly, and she sits fanning herself. The paper is put down by Minnie, and she sidles to the window, looking out over the terrace and the outdoor toilet beyond it. A sun chair is seen by her being buffeted in the wind, and with awkward shifting from foot to foot by her, the pool umbrella has gone the way of the chair. A hasty retreat is beaten by Minnie, and some cards are laid out by Mrs. Walters. Her eyes narrow as she watches Minnie disappear down the hall. The toilet lid is raised softly by Minnie in the bathroom, and Hilly puts her ear to the bathroom door. Minnie, caught with her knickers down, freezes but then the toilet is flushed defiantly by her. With her arms folded, Minnie stands, then the lid is slammed down by her. Without expression, Mrs. Walters looks up from her cards. Carrying her handbag, Minnie strides out of the front door into the pouring rain. A child's bedroom has been turned upside down, and Mae Mobley is sat with by Aibileen on her lap, sheltering under an upturned mattress. In Elizabeth's sprawling bungalow the next day, the toilet is sat on by Aibileen, in her maid's uniform. Around her buzz flies; a hand is brought to her mouth, her face perspiring, her expression world-weary. Standing outside the wooden toilet on the back porch, Mae Mobley's hand is held by Elizabeth, and the child is picked up by Aibileen. With her free hand, the toilet door is shut by Aibileen."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A petite black woman with long plaits approaches Skeeter under the willow's wispy branches. The woman, Constantine, sits beside her, warmly gripping her hand, bringing a smile to Skeeter's tear-filled eyes. They leave the glade, Constantine's arm around Skeeter. Skeeter returns relaxed and thoughtful, later grinning on the phone with elegant, slim Ms. Elaine Stein. Meanwhile, Hilly is on Elizabeth's back porch with a contractor. Aibileen glances at the windy sky as Skeeter waits for Hilly to leave, looks pointedly at Aibileen, who hurries with laundry. In Elizabeth's kitchen, Raleigh sees Skeeter with Aibileen as storm clouds release rain on Jackson. At Hilly's, Minnie fans Mrs. Walters, both eye the storm. Hilly lights candles at the dining table, Minnie checks the storm-battered terrace, retreats as Mrs. Walters deals cards. Hilly's eyes narrow watching Minnie leave. In the bathroom, Minnie flushes defiantly with Hilly listening at the door. Minnie exits in the rain, arms folded. Aibileen shelters Mae Mobley under an upturned mattress in a chaotic child's room. The next day, Aibileen, weary and perspiring, sits in the outdoor toilet, flies buzzing. Elizabeth, with Mae Mobley, stands outside, Aibileen picks up the child and shuts the door."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A petite black woman with long plaits, Constantine, approaches Skeeter beneath the willow branches. Smiling warmly, she sits and holds Skeeter's hand, making Skeeter smile gratefully with tears. As they leave the glade, Constantine puts an arm around Skeeter. Skeeter returns with a thoughtful look and later, on the phone, grins after speaking to Ms. Elaine Stein. Meanwhile, Hilly is on Elizabeth's porch, and Aibileen hurries in with laundry as black storm clouds unleash rain on Jackson. At Hilly's, Minnie watches a storm from a window, sidles away, and encounters Hilly outside the bathroom, leading to a tense moment. Minnie leaves in the rain, while Aibileen comforts Mae Mobley under an overturned mattress. The next day, Aibileen, weary, sits on the toilet in her uniform as Elizabeth, with Mae Mobley, stands outside. Aibileen picks up the child, closing the door behind them."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A petite, diminutive black woman with long, intricately styled plaits gracefully makes her way towards Skeeter, passing beneath the cascading, wispy branches of the graceful willow tree. This woman, known as Constantine, beams a warm, inviting smile as she takes a seat beside her. With tenderness and affection, Constantine clasps Skeeter's hand, evoking a smile filled with gratitude on Skeeter's face. Skeeter, with tears welling up in her eyes, gives an acknowledging nod. Together, they make their way out of the serene willow glade, with Constantine affectionately draping an arm around Skeeter's shoulders. Skeeter retraces her steps back the way she originally came, moving at a more leisurely pace than before, with a thoughtful expression adorning her face. Later on, she's heard speaking on the phone, while Charlotte traces the phone cord all the way to the kitchen. The elegant and slender Ms. Elaine Stein continues holding the phone, and Skeeter places the receiver back with a grin, as if she'd just hit a jackpot. Meanwhile, Hilly is situated on Elizabeth's back porch, consulting with a contractor, while Aibileen casts a glance upward at the unsettlingly windy sky. Skeeter patiently waits for Hilly's car to drive away, then fixes Aibileen with a telling look, prompting her to swiftly hurry in with the laundry basket. As they enter Elizabeth's kitchen, Elizabeth's husband, Raleigh, observes Skeeter sitting with Aibileen. Aibileen rises from her position of sorting through the washing as ominous black storm clouds unleash a heavy downpour over Jackson. Over at Hilly's residence, Minnie uses a newspaper to fan Mrs. Walters. Both she and Minnie cast glances towards the window, observing the fierce storm raging outside. Mrs. Walters sits up in her chair, looking awe-struck, and directs a look of confused comprehension towards Minnie. Meanwhile, Hilly, who has been engaged in lighting candles on the dining table, now sits and fans herself to cool off. Minnie sets down the newspaper and cautiously sidles over to the window, peering over the terrace and the outdoor toilet beyond it. She observes as a sun chair is buffeted by the relentless wind, shifting awkwardly from one foot to the other, noting that the pool umbrella has met the same fate. Minnie makes a quick retreat, while Mrs. Walters arranges some cards on the table. Her daughter's eyes narrow suspiciously as she watches Minnie disappear down the hallway. In the privacy of the bathroom, as Minnie quietly lifts the toilet lid, Hilly presses her ear against the bathroom door. Caught off guard with her knickers down, Minnie freezes momentarily but then defiantly flushes the toilet. Minnie stands there with arms crossed, then slams the lid shut with force. Mrs. Walters, without changing her expression, looks up from her cards. Minnie, resolute and carrying her handbag, strides out of the front door into the relentless, pouring rain. Meanwhile, in a child's bedroom turned topsy-turvy, Aibileen finds herself sitting with little Mae Mobley perched on her lap, both taking refuge under an overturned mattress. In the sprawling expanse of Elizabeth's bungalow the following day, Aibileen, garbed in her maid's uniform, is seated on the toilet. Flies buzz annoyingly around her; she raises a hand to her mouth, her face glistening with perspiration, a weary expression etched deeply into her features. Elizabeth, holding Mae Mobley's tiny hand, stands outside the wooden toilet situated on the back porch, while Aibileen gently picks up the child. With her free hand, Aibileen shuts the toilet door securely."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A petite, diminutive black woman, known for her stature and the long, intricately styled plaits that adorn her head like a crown, gracefully makes her way toward Skeeter. She moves with a quiet elegance, passing beneath the cascading, wispy branches of the graceful willow tree that sway gently in the breeze. This woman, whose name is Constantine, beams a warm and inviting smile, radiating kindness, as she takes a seat beside Skeeter, providing companionship. With a gesture full of tenderness and genuine affection, Constantine gently clasps Skeeter's hand, evoking a smile filled with gratitude and appreciation on Skeeter's face. As tears begin to well up in Skeeter's eyes, she gives an acknowledging nod, demonstrating her feelings without words. Together, in harmonious unison, they make their way out of the serene and tranquil willow glade, with Constantine affectionately draping an arm around Skeeter's shoulders in a protective gesture. Skeeter retraces her previous steps back the way she originally came, moving at a more thoughtful and leisurely pace than before, with an expression of contemplation adorning her face. Later on, the sound of her voice is heard speaking over the phone, while Charlotte diligently traces the phone cord all the way to the kitchen. The elegant and slender figure of Ms. Elaine Stein continues to hold the phone, maintaining her poised demeanor, and Skeeter places the receiver back with a broad grin on her face, as if she'd just hit a jackpot with good fortune. Meanwhile, elsewhere, Hilly is situated on Elizabeth's back porch, consulting with a contractor, while Aibileen casts a cautious glance upward at the unsettlingly windy sky above. Skeeter patiently waits with anticipation for Hilly's car to drive away, then fixes Aibileen with a telling look, a silent understanding passing between them, prompting her to swiftly hurry in with the laundry basket in tow. As they enter Elizabeth's kitchen together, Elizabeth's husband, Raleigh, observes Skeeter sitting comfortably with Aibileen. Aibileen rises from her position of meticulously sorting through the washing as ominous black storm clouds, heavy with rain, unleash a torrential downpour over the city of Jackson. Over at Hilly's residence, Minnie uses a newspaper to fan Mrs. Walters, creating a gentle breeze with each motion. Both she and Minnie cast concerned glances toward the window, observing the fierce and unrelenting storm raging furiously outside. Mrs. Walters sits up in her chair, looking awe-struck and directing a look of confused comprehension towards Minnie, searching for some understanding in the chaos. Meanwhile, Hilly, who has been preoccupied with lighting candles on the dining table, now sits and fans herself to cool off from the heat. Minnie sets down the newspaper and cautiously sidles over to the window, peering intently over the terrace and the outdoor toilet beyond it. She observes as a sun chair is buffeted by the relentless wind, shifting awkwardly from one foot to the other, and notes that the pool umbrella has met the same unfortunate fate. Minnie makes a quick and prudent retreat, while Mrs. Walters arranges some cards meticulously on the table in front of her. Her daughter's eyes narrow suspiciously as she watches Minnie disappear down the hallway with intent curiosity. In the privacy of the bathroom, as Minnie quietly lifts the toilet lid, Hilly presses her ear against the bathroom door to eavesdrop. Caught off guard with her knickers down, Minnie freezes momentarily, but then defiantly decides to flush the toilet. Minnie stands there with arms defiantly crossed over her chest, then slams the lid shut with a force that leaves an echo. Mrs. Walters, maintaining her composure and without changing her expression, looks up from her cards. Minnie, resolute and determined, carrying her handbag, strides out of the front door into the relentless, pouring rain without hesitation. Meanwhile, in a child's bedroom turned topsy-turvy by the storm's chaos, Aibileen finds herself sitting with little Mae Mobley perched comfortably on her lap, both taking refuge under an overturned mattress for safety. In the sprawling expanse of Elizabeth's bungalow the following day, Aibileen, garbed in her maid's uniform, is seated on the toilet. Flies buzz annoyingly around her, a constant irritation; she raises a hand to her mouth, her face glistening with perspiration, and a weary expression etched deeply into her features. Elizabeth, holding Mae Mobley's tiny hand, stands just outside the wooden toilet situated on the back porch, while Aibileen gently picks up the child with care. With her free hand, Aibileen shuts the toilet door securely, ensuring privacy."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A petite black woman with long plaits gradually approaches Skeeter, moving gently beneath the long, wispy branches of the willow that sway with the breeze. As she draws near, the black woman, Constantine, offers a warm, inviting smile to Skeeter, who welcomes her presence as Constantine gracefully lowers herself next to her. With a familiar and comforting gesture, Constantine firmly grasps Skeeter's hand, causing a grateful smile to spread across Skeeter's face, while her eyes glisten with unshed tears as she nods in acknowledgment. Together, they rise and begin to walk out of the serene willow glade, with Constantine affectionately draping an arm around Skeeter's shoulders, providing a sense of comfort and companionship. As Skeeter retraces her steps back the way she came, her pace is noticeably more relaxed, and her face reflects a contemplative expression, lost in thought. Later, Skeeter finds herself on the phone, the cord tracing a path that leads Charlotte to discover her location in the kitchen. On the other end of the line, the elegant and slim Ms. Elaine Stein continues the conversation, and as Skeeter carefully places the receiver back into its cradle, her face breaks into a grin, as if she had just hit the jackpot with exciting news. Meanwhile, at Elizabeth's home, Hilly occupies the back porch alongside a contractor, discussing matters with focused attention. Inside, Aibileen looks up at the sky, which is filled with swirling, windy clouds. Skeeter waits patiently until Hilly drives away, and then she exchanges a meaningful glance with Aibileen, who hurries into the house with a laundry basket in tow. Once inside, they enter Elizabeth's kitchen where Elizabeth's husband, Raleigh, catches sight of Skeeter sitting alongside Aibileen. Aibileen rises from her task of sorting through the washing, as outside, the black storm clouds unleash a torrential downpour over Jackson. At Hilly's house, Minnie energetically fans Mrs. Walters with a newspaper, casting occasional glances towards the window where the storm rages. Mrs. Walters, seated in her chair, observes with awe, fixing Minnie with a look of confused comprehension. Meanwhile, Hilly busies herself with lighting candles on the dining table, while fanning herself to combat the heat. Minnie sets the paper aside and discreetly edges towards the window, peering out over the terrace towards the outdoor toilet, where a sun chair is being fiercely tossed by the wind. Sensing the worsening storm, Minnie shifts awkwardly from foot to foot and notes that the pool umbrella has suffered the same fate as the chair. With urgency, Minnie makes a hasty retreat back inside. Mrs. Walters, unfazed, begins to lay out some cards on the table, while her daughter, eyes narrowed with suspicion, watches Minnie disappear down the hall. In the bathroom, as Minnie quietly raises the toilet lid, Hilly presses her ear against the bathroom door, eavesdropping. Minnie, caught in a vulnerable moment with her knickers down, temporarily freezes in place but then, with defiant resolve, flushes the toilet. Standing assertively with her arms folded, she slams the lid shut. Mrs. Walters, engrossed in her card game, glances up with an unreadable expression. Determined, Minnie exits the front door into the relentless rain, handbag in hand, her stride purposeful. Elsewhere, a child's bedroom is in disarray, and Aibileen sits with little Mae Mobley on her lap, seeking refuge under an upturned mattress from the chaotic storm. The following day, in Elizabeth's expansive bungalow, Aibileen, donned in her maid's uniform, is found sitting on the toilet, swatting at flies that buzz persistently around her. She brings a weary hand to her mouth, her face glistening with perspiration, her expression one of world-weary resignation. Outside, Elizabeth stands holding Mae Mobley's hand on the porch, and Aibileen, ever attentive, picks up the child with care, closing the toilet door behind her with her free hand."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A petite black woman with long plaits, Constantine, approaches Skeeter under the willow tree's wispy branches and sits warmly beside her. With a grateful smile and tears in her eyes, Skeeter grips Constantine’s hand. They leave the glade with Constantine's arm around Skeeter's shoulders, and Skeeter walks back at a more relaxed pace, looking thoughtful. Later, Skeeter is on the phone with Ms. Elaine Stein, and upon ending the call, she grins triumphantly. Meanwhile, Hilly is on Elizabeth's porch with a contractor as Aibileen notices the windy sky. After Hilly leaves, Skeeter gives Aibileen a pointed look, prompting her to hurry inside with the laundry basket. In Elizabeth's kitchen, Raleigh sees Skeeter with Aibileen as storm clouds release heavy rain over Jackson. At Hilly's house, Minnie fans Mrs. Walters with a newspaper, both glancing at the storm outside. Mrs. Walters looks at Minnie, confused but comprehending, while Hilly lights candles nearby. Minnie, seeing the wind buffet outdoor furniture, retreats and Mrs. Walters lays out cards. Hilly narrows her eyes as Minnie leaves for the bathroom. Caught by Hilly’s eavesdropping, Minnie defiantly flushes the toilet and storms out into the rain with her handbag. Aibileen sits with Mae Mobley under an upturned mattress in a chaotic child's bedroom. The next day, in Elizabeth's bungalow, Aibileen, in her maid's uniform, sits wearily on the toilet as flies buzz around. Outside, Elizabeth stands with Mae Mobley, and Aibileen picks up the child before shutting the toilet door."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A petite black woman with long plaits comes towards Skeeter, passing beneath the long, wispy branches of the willow, often associated with sorrow but here providing a serene canopy. The black woman, Constantine, who has served as Skeeter's beloved nanny since childhood in Jackson, Mississippi, smiles at her warmly as she sits down next to her. Constantine grips Skeeter by the hand, bringing a grateful smile to her face, and Skeeter nods with tears in her eyes, deeply moved by the reunion. They walk out of the willow glade, a place of privacy and reflection, and Constantine slaps an arm around Skeeter's shoulders, offering comfort and renewed strength. Skeeter walks back the same way she came, through paths she's known since childhood, with a more relaxed pace and a thoughtful look on her face. Later, she is on the phone, and Charlotte, her mother, has traced the phone flex to the kitchen, a hub of family activity. Elegant, slim Ms. Elaine Stein, a prominent editor at a New York publishing house who could change Skeeter's career, is still on the phone, and Skeeter replaces the receiver, grinning as if she'd just won the jackpot, feeling a thrilling sense of opportunity. Meanwhile, Hilly, the influential leader of the Junior League, is on Elizabeth's back porch with a contractor, likely planning another one of her grand social events. Aibileen, a patient and wise maid, glances up at a windy sky, anticipating the heavy rain that often lashes Jackson. Skeeter waits for Hilly to drive away and then looks pointedly at Aibileen, who hurries in with the laundry basket, understanding they have much to discuss away from prying eyes. They come into Elizabeth's kitchen, a place where Aibileen spends much of her workday, and Elizabeth's husband, Raleigh, sees Skeeter sitting with Aibileen, a moment that underscores the social boundaries they are quietly challenging. Aibileen gets up from sorting the washing, which is part of her daily chores, and black storm clouds release heavy rain on Jackson, a reminder of the tumultuous social climate. At Hilly's house, Minnie, known for her sharp tongue and culinary skills, is fanning Mrs. Walters with a newspaper, trying to keep her employer cool in the stifling Southern heat. She and Minnie glance towards the window and the storm raging outside. Mrs. Walters sits up in her chair, in awe, and fixes Minnie with a look of confused comprehension about the changing times. Hilly, who has been lighting candles on the dining table, sits fanning herself, annoyed by the oppressive humidity. Minnie puts down the paper and sidles to the window, looking out over the terrace and the outdoor toilet, a symbol of the rigid racial divides, beyond it. She sees a sun chair being buffeted in the wind, shifts awkwardly from foot to foot, and the pool umbrella has gone the way of the chair, further dismantling the picture-perfect Southern elegance. Minnie beats a hasty retreat, exercising caution amidst Hilly's critical gaze, and Mrs. Walters lays out some cards, trying to distract herself. Her daughter's eyes narrow as she watches Minnie disappear down the hall, suspicious of her movements. In the bathroom, as Minnie softly raises the toilet lid, Hilly puts her ear to the bathroom door, intent on maintaining control over her household. Minnie, caught with her knickers down, freezes, but then defiantly flushes the toilet, asserting her dignity. Minnie stands with her arms folded, then slams down the lid, making a statement of finality. Mrs. Walters looks up from her cards without expression, accustomed to the underlying tensions. Minnie, carrying her handbag, strides out of the front door into the pouring rain, symbolizing her determination to face the world on her terms. A child's bedroom is turned upside down, and Aibileen sits with Mae Mobley on her lap, sheltering under an upturned mattress, creating an impromptu fortress against the storm and harsh realities. In Elizabeth's sprawling bungalow the next day, Aibileen, in her maid's uniform, is sitting on the toilet, a place designated for the help, flies buzz around her; she brings a hand to her mouth, her face perspiring, her expression world-weary, reflecting the burdens she carries. Elizabeth, holding Mae Mobley's hand, stands outside the wooden toilet on the back porch, and Aibileen picks the child up, her care and affection evident. Aibileen shuts the toilet door with her free hand, a small act of closing out the world for a moment."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Constantine grips Skeeter by the hand bringing a grateful smile to her face and Skeeter nods with tears in her eyes A petite black woman with long plaits comes towards Skeeter passing beneath the long wispy branches of the willow Hilly who has been lighting candles on the dining table sits fanning herself The black woman Constantine smiles at her warmly as she sits down next to her Constantine grips Skeeter by the hand bringing a grateful smile to her face and Skeeter nods with tears in her eyes They walk out of the willow glade and Constantine slaps an arm around Skeeter's shoulders Skeeter walks back the same way she came with a more relaxed pace and a thoughtful look on her face Later she is on the phone and Charlotte has traced the phone flex to the kitchen Elegant slim Elegant slim Ms Elaine Stein is still on the phone and Skeeter replaces the receiver grinning as if she would just won the jackpot Minnie puts down the paper and sidles to the window looking out over the terrace and the outdoor toilet beyond it Meanwhile Hilly is on Elizabeth's back porch with a contractor Aibileen glances up at a windy sky Skeeter waits for Hilly to drive away and then looks pointedly at Aibileen who hurries in with the laundry basket Aibileen shuts the toilet door with her free hand They come into Elizabeth's kitchen and Elizabeth's husband They walk out of the willow glade and Constantine slaps an arm around Skeeter's shoulders Minnie stands with her arms folded then slams down the lid Raleigh sees Skeeter sitting with Aibileen Aibileen gets up from sorting the washing and black storm clouds release heavy rain on Jackson she brings a hand to her mouth her face perspiring her expression worldweary Ms Elaine Stein is still on the phone and Skeeter replaces the receiver grinning as if she would just won the jackpot A petite black woman with long plaits comes towards Skeeter passing beneath the long wispy branches of the willow At Hilly's house Minnie is fanning Mrs Walters with a newspaper She and Minnie glance towards the window and the storm raging outside Mrs Walters sits up in her chair in awe and fixes Minnie with a look of confused comprehension Hilly who has been lighting candles on the dining table sits fanning herself Minnie puts down the paper and sidles to the window looking out over the terrace and the outdoor toilet beyond it She sees a sun chair being buffeted in the wind shifts awkwardly from foot to foot and the pool umbrella has gone the way of the chair Elizabeth holding Mae Mobley's hand stands outside the wooden toilet on the back porch and Aibileen picks the child up Minnie beats a hasty retreat and Mrs Walters lays out some cards Her daughter's eyes narrow as she watches Minnie disappear down the hall In the bathroom as Minnie softly raises the toilet lid Hilly puts her ear to the bathroom door Her daughter's eyes narrow as she watches Minnie disappear down the hall Hilly puts her ear to the bathroom door Minnie caught with her knickers down freezes but then defiantly flushes the toilet Minnie stands with her arms folded then slams down the lid Mrs Walters looks up from her cards without expression Minnie carrying her handbag strides out of the front door into the pouring rain A child's bedroom is turned upside down and Aibileen sits with Mae Mobley on her lap sheltering under an upturned mattress In Elizabeth's sprawling bungalow the next day Aibileen in her maid's uniform is sitting on the toilet A child's bedroom is turned upside down and Aibileen sits with Mae Mobley on her lap sheltering under an upturned mattress Skeeter walks back the same way she came with a more relaxed pace and a thoughtful look on her face The black woman Constantine smiles at her warmly as she sits down next to her Flies buzz around her Aibileen gets up from sorting the washing and black storm clouds release heavy rain on Jackson She and Minnie glance towards the window and the storm raging outside she brings a hand to her mouth her face perspiring her expression worldweary Elizabeth holding Mae Mobley's hand stands outside the wooden toilet on the back porch and Aibileen picks the child up Aibileen shuts the toilet door with her free hand"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A petite black woman with long plaits comes towards Skeeter passing beneath the long wispy branches of the willow. The black woman Constantine smiles at her warmly as she sits down next to her. Constantine grips Skeeter by the hand bringing a grateful smile to her face and Skeeter nods with tears in her eyes. They walk out of the willow glade and Constantine slaps an arm around Skeeter's shoulders. Skeeter walks back the same way she came with a more relaxed pace and a thoughtful look on her face. Later she is on the phone and Charlotte has traced the phone flex to the kitchen. Elegant slim. Ms Elaine Stein is still on the phone and Skeeter replaces the receiver grinning as if she would just won the jackpot. Meanwhile Hilly is on Elizabeth's back porch with a contractor. Aibileen glances up at a windy sky. Skeeter waits for Hilly to drive away and then looks pointedly at Aibileen who hurries in with the laundry basket. They come into Elizabeth's kitchen and Elizabeth's husband. Raleigh sees Skeeter sitting with Aibileen. Aibileen gets up from sorting the washing and black storm clouds release heavy rain on Jackson. At Hilly's house Minnie is fanning Mrs Walters with a newspaper. She and Minnie glance towards the window and the storm raging outside. Mrs Walters sits up in her chair in awe and fixes Minnie with a look of confused comprehension. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Hilly who has been lighting candles on the dining table sits fanning herself. Minnie puts down the paper and sidles to the window looking out over the terrace and the outdoor toilet beyond it. She sees a sun chair being buffeted in the wind shifts awkwardly from foot to foot and the pool umbrella has gone the way of the chair. Minnie beats a hasty retreat and Mrs Walters lays out some cards. Her daughter's eyes narrow as she watches Minnie disappear down the hall. In the bathroom as Minnie softly raises the toilet lid. Hilly puts her ear to the bathroom door. Minnie caught with her knickers down freezes but then defiantly flushes the toilet. Minnie stands with her arms folded then slams down the lid. Mrs Walters looks up from her cards without expression. Minnie carrying her handbag strides out of the front door into the pouring rain. A child's bedroom is turned upside down and Aibileen sits with Mae Mobley on her lap sheltering under an upturned mattress. In Elizabeth's sprawling bungalow the next day. Aibileen in her maid's uniform is sitting on the toilet. Flies buzz around her. she brings a hand to her mouth her face perspiring her expression worldweary. Elizabeth holding Mae Mobley's hand stands outside the wooden toilet on the back porch and Aibileen picks the child up. Aibileen shuts the toilet door with her free hand."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A petite black woman with long plaits comes towards Skeeter passing beneath the long wispy branches of the willow. The black woman Constantine smiles at her warmly as she sits down next to her. Constantine grips Skeeter by the hand bringing a grateful smile to her face and Skeeter nods with tears in her eyes. They walk out of the willow glade and Constantine slaps an arm around Skeeter's shoulders. Skeeter walks back the same way she came with a more relaxed pace and a thoughtful look on her face. Later she is on the phone and Charlotte has traced the phone flex to the kitchen. Elegant slim. Ms Elaine Stein is still on the phone and Skeeter replaces the receiver grinning as if she would just won the jackpot. Meanwhile Hilly is on Elizabeth's back porch with a contractor. Aibileen glances up at a windy sky. Skeeter waits for Hilly to drive away and then looks pointedly at Aibileen who hurries in with the laundry basket. They come into Elizabeth's kitchen and Elizabeth's husband. Raleigh sees Skeeter sitting with Aibileen. Aibileen gets up from sorting the washing and black storm clouds release heavy rain on Jackson. At Hilly's house Minnie is fanning Mrs Walters with a newspaper. She and Minnie glance towards the window and the storm raging outside. Mrs Walters sits up in her chair in awe and fixes Minnie with a look of confused comprehension. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Hilly who has been lighting candles on the dining table sits fanning herself. Minnie puts down the paper and sidles to the window looking out over the terrace and the outdoor toilet beyond it. She sees a sun chair being buffeted in the wind shifts awkwardly from foot to foot and the pool umbrella has gone the way of the chair. Minnie beats a hasty retreat and Mrs Walters lays out some cards. Her daughter's eyes narrow as she watches Minnie disappear down the hall. In the bathroom as Minnie softly raises the toilet lid. Hilly puts her ear to the bathroom door. Minnie caught with her knickers down freezes but then defiantly flushes the toilet. Minnie stands with her arms folded then slams down the lid. Mrs Walters looks up from her cards without expression. Minnie carrying her handbag strides out of the front door into the pouring rain. A child's bedroom is turned upside down and Aibileen sits with Mae Mobley on her lap sheltering under an upturned mattress. In Elizabeth's sprawling bungalow the next day. Aibileen in her maid's uniform is sitting on the toilet. Flies buzz around her. she brings a hand to her mouth her face perspiring her expression worldweary. Elizabeth holding Mae Mobley's hand stands outside the wooden toilet on the back porch and Aibileen picks the child up. Aibileen shuts the toilet door with her free hand."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A petite black woman with long plaits comes towards Skeeter passing beneath the long wispy branches of the willow. The black woman Constantine smiles at her warmly as she sits down next to her. Constantine grips Skeeter by the hand bringing a grateful smile to her face and Skeeter nods with tears in her eyes. They walk out of the willow glade and Constantine slaps an arm around Skeeter's shoulders. Skeeter walks back the same way she came with a more relaxed pace and a thoughtful look on her face. Later she is on the phone and Charlotte has traced the phone flex to the kitchen. Elegant slim. Ms Elaine Stein is still on the phone and Skeeter replaces the receiver grinning as if she would just won the jackpot. Meanwhile Hilly is on Elizabeth's back porch with a contractor. Mrs Walters looks up from her cards without expression. Minnie carrying her handbag strides out of the front door into the pouring rain. A child's bedroom is turned upside down and Aibileen sits with Mae Mobley on her lap sheltering under an upturned mattress. In Elizabeth's sprawling bungalow the next day. Aibileen in her maid's uniform is sitting on the toilet. Flies buzz around her. she brings a hand to her mouth her face perspiring her expression worldweary. Elizabeth holding Mae Mobley's hand stands outside the wooden toilet on the back porch and Aibileen picks the child up. Aibileen shuts the toilet door with her free hand."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A petite black woman with long plaits comes towards Skeeter passing beneath the long wispy branches of the willow. The black woman Constantine smiles at her warmly as she sits down next to her. Constantine grips Skeeter by the hand bringing a grateful smile to her face and Skeeter nods with tears in her eyes. Flies buzz around her. she brings a hand to her mouth her face perspiring her expression worldweary. Elizabeth holding Mae Mobley's hand stands outside the wooden toilet on the back porch and Aibileen picks the child up. Aibileen shuts the toilet door with her free hand."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A curious raccoon with long plaits comes towards a pelican, passing beneath the long, wispy branches of the willow. The raccoon, a kangaroo, smiles at the pelican warmly as the kangaroo sits down next to the pelican. The kangaroo grips the pelican by the hand, bringing a grateful smile to the pelican's face, and the pelican nods with tears in its eyes. They walk out of the willow glade, and the kangaroo slaps an arm around the pelican's shoulders. The pelican walks back the same way it came, with a more relaxed pace and a thoughtful look on its face. Later, it is on the phone, and a giraffe has traced the phone flex to the kitchen. Elegant, slim Ms. Shark is still on the phone, and the pelican replaces the receiver, grinning as if it had just won the jackpot. Meanwhile, a squirrel is on a rabbit's back porch with a contractor. A camel glances up at a windy sky. The pelican waits for the squirrel to drive away and then looks pointedly at the camel, who hurries in with the laundry basket. They come into the rabbit's kitchen, and the rabbit's husband, a turtle, sees the pelican sitting with the camel. The camel gets up from sorting the washing, and black storm clouds release heavy rain on Jackson. At the squirrel's house, a chimp is fanning a llama with a newspaper. The chimp and the llama glance towards the window and the storm raging outside. The llama sits up in its chair, in awe, and fixes the chimp with a look of confused comprehension. The squirrel, who has been lighting candles on the dining table, sits fanning itself. The chimp puts down the paper and sidles to the window, looking out over the terrace and the outdoor toilet beyond it. The chimp sees a sun chair being buffeted in the wind, shifts awkwardly from foot to foot, and the pool umbrella has gone the way of the chair. The chimp beats a hasty retreat, and the llama lays out some cards. The llama's daughter's eyes narrow as she watches the chimp disappear down the hall. In the bathroom, as the chimp softly raises the toilet lid, the squirrel puts its ear to the bathroom door. The chimp, caught with its knickers down, freezes, but then defiantly flushes the toilet. The chimp stands with its arms folded, then slams down the lid. The llama looks up from its cards without expression. The chimp, carrying its handbag, strides out of the front door into the pouring rain. A child's bedroom is turned upside down, and the camel sits with a duckling on its lap, sheltering under an upturned mattress. In the rabbit's sprawling bungalow the next day, the camel, in its maid's uniform, is sitting on the toilet. Flies buzz around the camel; it brings a hand to its mouth, its face perspiring, its expression world-weary. The rabbit, holding the duckling's hand, stands outside the wooden toilet on the back porch, and the camel picks the child up. The camel shuts the toilet door with its free hand."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A petite black woman with long plaits comes towards Skeeter, passing beneath the long, wispy branches of the palm tree. The black woman, Constantine, smiles at her warmly as she sits down next to her. Constantine grips Skeeter by the hand, bringing a grateful smile to her face, and Skeeter nods with tears in her eyes. They walk out of the palm grove, and Constantine slaps an arm around Skeeter's shoulders. Skeeter walks back the same way she came, with a more relaxed pace and a thoughtful look on her face. Later, she is on the phone, and Charlotte has traced the phone cord to the garage. Elegant, slim Ms. Elaine Stein is still on the phone, and Skeeter replaces the receiver, grinning as if she'd just won the lottery. Meanwhile, Hilly is on Elizabeth's back garden with a painter. Aibileen glances up at a cloudy sky. Skeeter waits for Hilly to drive away and then looks pointedly at Aibileen, who hurries in with the grocery bag. They come into Elizabeth's pantry, and Elizabeth's husband, Raleigh, sees Skeeter sitting with Aibileen. Aibileen gets up from sorting the groceries, and black storm clouds release heavy rain on Birmingham. At Hilly's house, Minnie is fanning Mrs. Walters with a magazine. She and Minnie glance towards the window and the storm raging outside. Mrs. Walters sits up in her chair, in awe, and fixes Minnie with a look of puzzled comprehension. Hilly, who has been lighting candles on the coffee table, sits fanning herself. Minnie puts down the magazine and sidles to the window, looking out over the verandah and the outdoor shed beyond it. She sees a deck chair being buffeted in the wind, shifts awkwardly from foot to foot, and the awning has gone the way of the chair. Minnie beats a hasty retreat, and Mrs. Walters lays out some tiles. Her daughter's eyes narrow as she watches Minnie disappear down the corridor. In the restroom, as Minnie softly raises the toilet lid, Hilly puts her ear to the restroom door. Minnie, caught with her knickers down, freezes, but then defiantly flushes the toilet. Minnie stands with her arms folded, then slams down the lid. Mrs. Walters looks up from her tiles without expression. Minnie, carrying her handbag, strides out of the front door into the pouring rain. A child's nursery is turned upside down, and Aibileen sits with Mae Mobley on her lap, sheltering under an upturned crib. In Elizabeth's sprawling cottage the next day, Aibileen, in her maid's uniform, is sitting on the chair. Flies buzz around her; she brings a hand to her mouth, her face perspiring, her expression world-weary. Elizabeth, holding Mae Mobley's hand, stands outside the wooden chair on the back verandah, and Aibileen picks the child up. Aibileen shuts the chair door with her free hand."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A petite black woman with long plaits skips towards Skeeter, ducking beneath the long, wispy branches of the willow. The black woman, Constantine, winks at her warmly as she leans down next to her. Constantine pats Skeeter on the shoulder, bringing a grateful laugh to her face, and Skeeter shrugs with tears in her eyes. They dance out of the willow glade, and Constantine swings an arm around Skeeter's shoulders. Skeeter jogs back the same way she came, with a more energetic pace and a thoughtful look on her face. Later, she is writing a letter, and Charlotte has traced the phone flex to the kitchen. Elegant, slim Ms. Elaine Stein is still writing, and Skeeter drops the pen, laughing as if she'd just won the jackpot. Meanwhile, Hilly is on Elizabeth's back porch with a decorator. Aibileen peers up at a cloudy sky. Skeeter waits for Hilly to stroll away and then glances pointedly at Aibileen, who jogs in with the laundry basket. They step into Elizabeth's kitchen, and Elizabeth's husband, Raleigh, hears Skeeter chatting with Aibileen. Aibileen sits down from rearranging the dishes, and black storm clouds cast heavy shadows over Jackson. At Hilly's house, Minnie is waving at Mrs. Walters with a newspaper. She and Minnie peer towards the window and the storm rumbling outside. Mrs. Walters rises in her chair, surprised, and fixes Minnie with a look of puzzled recognition. Hilly, who has been arranging flowers on the dining table, sits waving herself. Minnie sets down the paper and shuffles to the window, peering out over the terrace and the outdoor toilet beyond it. She notices a sun chair twirling in the wind, tiptoes awkwardly from side to side, and the pool umbrella has followed the chair. Minnie makes a quick retreat, and Mrs. Walters flips over some cards. Her daughter's eyes narrow as she observes Minnie vanish down the hall. In the bathroom, as Minnie quietly lifts the toilet lid, Hilly places her ear to the bathroom door. Minnie, caught in an awkward moment, pauses, but then defiantly opens the toilet tank. Minnie stands with her arms on her hips, then drops the lid. Mrs. Walters glances up from her cards without expression. Minnie, carrying her handbag, marches out of the front door into the pouring rain. A child's bedroom is scattered with toys, and Aibileen sits with Mae Mobley on her lap, hiding under an upturned mattress. In Elizabeth's sprawling bungalow the next day, Aibileen, in her maid's uniform, is sitting on the bench. Flies circle around her; she raises a hand to her mouth, her face glistening, her expression fatigued. Elizabeth, holding Mae Mobley's hand, stands outside the wooden bench on the back porch, and Aibileen lifts the child up. Aibileen closes the bench door with her free hand."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A tiny green bird with short feathers comes towards the refrigerator, passing beneath the long, flowing vines of the palm tree. The green bird, Jasper, smiles at it warmly as it sits down next to it. Jasper grips the refrigerator by the handle, bringing a grateful smile to its face, and the refrigerator nods with tears in its hinges. They walk out of the palm grove, and Jasper drapes an arm around the refrigerator's shelves. The refrigerator rolls back the same way it came, with a more relaxed pace and a thoughtful look on its door. Later, it is on the skateboard, and the goat has traced the skateboard wheel to the pantry. Majestic, stout Mr. Bruno Rivera is still on the skateboard, and the refrigerator replaces the helmet, grinning as if it had just solved the mystery. Meanwhile, the dolphin is on Toby's treehouse with a gardener. A cactus glances up at a stormy ceiling. The refrigerator waits for the dolphin to hop away and then looks pointedly at the cactus, who hurries in with the picnic basket. They come into Toby's study, and Toby's sister, Michelle, sees the refrigerator sitting with the cactus. The cactus gets up from sorting the cookies, and dark shadows release heavy wind on Tampa. At the dolphin's den, the hamster is fanning Mr. Tortoise with a postcard. It and the hamster glance towards the painting and the blizzard raging outside. Mr. Tortoise sits up in its shell, in awe, and fixes the hamster with a look of puzzled recognition. The dolphin, who has been hanging pictures on the living room wall, sits fanning itself. The hamster puts down the postcard and sidles to the painting, looking out over the balcony and the garden table beyond it. It sees a hammock being swayed in the breeze, shifts awkwardly from paw to paw, and the garden chair has gone the way of the hammock. The hamster beats a hasty retreat, and Mr. Tortoise lays out some dominoes. Its cousin's cheeks narrow as it watches the hamster disappear down the hallway. In the greenhouse, as the hamster softly raises the watering can, the dolphin puts its ear to the greenhouse door. The hamster, caught with its whiskers down, freezes, but then defiantly waters the cactus. The hamster stands with its paws folded, then slams down the shovel. Mr. Tortoise looks up from its dominoes without expression. The hamster, carrying its backpack, strides out of the back gate into the pouring storm. A cat's kennel is turned upside down, and the cactus sits with Spot on its thorns, sheltering under an upturned basket. In Toby's sprawling yurt the next day, the cactus, in its gardener's apron, is sitting on the hammock. Bees buzz around it; it brings a leaf to its stem, its face wilting, its expression jaded. Toby, holding Spot's leash, stands outside the metal hammock on the front porch, and the cactus picks the dog up. The cactus shuts the hammock flap with its free leaf."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A tall red-haired man with short braids strides towards Marcie, moving beneath the dense, sturdy branches of the oak. The red-haired man, Jasper, nods at her solemnly as he kneels down next to her. Jasper pats Marcie on the shoulder, bringing a puzzled frown to her face, and Marcie shakes her head with laughter in her eyes. They hop out of the oak grove, and Jasper throws a scarf around Marcie's neck. Marcie jogs back the same way she came, with an eager pace and a determined look on her face. Later, she is writing a letter, and Gloria has followed the pen marks to the porch. Clumsy, stocky Mr. Roger Blake is still writing, and Marcie tosses the letter, chuckling as if she'd just lost a fortune. Meanwhile, Barry is on Daisy's side patio with a gardener. Harriet gazes down at a rainy garden. Marcie waits for Barry to wander away and then glances quickly at Harriet, who dashes out with the empty basket. They step into Daisy's living room, and Daisy's brother, Martin, hears Marcie talking with Harriet. Harriet stands up from folding the clothes, and bright lightning flashes over Atlanta. At Barry's cottage, Nancy is cooling Mr. Johnson with an old hat. He and Nancy glance towards the door as the sun pierces through. Mr. Johnson springs from his recliner, in admiration, and gives Nancy a look of wary acceptance. Barry, who has been arranging flowers on the coffee table, stands fanning his legs. Nancy picks up the hat and tiptoes to the door, peering out over the veranda and the wooden shed beside it. She glimpses a barbecue grill being thrown in the breeze, shifts uneasily from side to side, and the garden gnome has followed the grill's path. Nancy makes a swift exit, and Mr. Johnson deals out some tiles. His nephew's eyes widen as he watches Nancy step down the corridor. In the garage, as Nancy quietly lowers the car hood, Barry listens with his ear to the garage wall. Nancy, caught with her sweater off, pauses, but then boldly honks the horn. Nancy stands with her arms akimbo, then slams down the hood. Mr. Johnson looks up from his tiles impassively. Nancy, clutching her umbrella, marches out of the garage into the drenching drizzle. A man's office is turned upside down, and Harriet sits with little Carrie on her back, protected under a makeshift fort. In Daisy's narrow apartment the next morning, Harriet, in her nurse's outfit, is standing on the porch. Mosquitoes hover around her; she waves a hand at her ear, her skin gleaming, her expression resigned. Daisy, holding little Carrie's blanket, waits outside the open porch on the side yard, and Harriet lifts the blanket. Harriet closes the yard gate with her elbow."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A petite black woman with long laces moves towards Skeeter, gliding beneath the long, fluttering ribbons of the willow. The black woman, Constantine, grins at her brightly as she kneels down next to her. Constantine pats Skeeter on the knee, bringing a thankful grin to her face, and Skeeter winks with tears in her eyes. They skip out of the willow grove, and Constantine wraps an arm around Skeeter's waist. Skeeter saunters back the same way she arrived, with a more leisurely pace and a pensive look on her face. Later, she is on the telephone, and Charlotte has traced the telephone cable to the pantry. Graceful, thin Ms. Elaine Stein is still on the telephone, and Skeeter hangs up the receiver, beaming as if she'd just found treasure. Meanwhile, Hilly is on Elizabeth's back deck with a painter. Aibileen peers up at a breezy sky. Skeeter waits for Hilly to cycle away and then glances pointedly at Aibileen, who scurries in with the clothes basket. They enter Elizabeth's pantry, and Elizabeth's husband, Raleigh, sees Skeeter lounging with Aibileen. Aibileen stands from folding the linen, and dark storm clouds drop intense rain on Jackson. At Hilly's residence, Minnie is shading Mrs. Walters with a magazine. She and Minnie glance towards the window and the tempest raging outside. Mrs. Walters sits up in her seat, in wonder, and fixes Minnie with a look of perplexed realization. Hilly, who has been lighting lanterns on the dining surface, sits cooling herself. Minnie places down the magazine and edges to the window, peeking out over the porch and the garden shed beyond it. She sees a swing chair being tossed in the wind, shifts uneasily from side to side, and the patio umbrella has gone the way of the chair. Minnie makes a swift exit, and Mrs. Walters arranges some tiles. Her daughter's eyes thin as she watches Minnie vanish down the corridor. In the washroom, as Minnie quietly lifts the sink cover, Hilly presses her ear to the washroom door. Minnie, caught with her socks down, halts, but then boldly runs the water. Minnie stands with her arms crossed, then bangs down the cover. Mrs. Walters looks up from her tiles without emotion. Minnie, clutching her handbag, marches out of the main door into the torrential rain. A child's nursery is turned inside out, and Aibileen sits with Mae Mobley on her knee, sheltering under an overturned desk. In Elizabeth's sprawling villa the next day, Aibileen, in her dress apron, is perched on the wash basin. Bees hum around her; she brings a palm to her lips, her brow sweating, her demeanor weary. Elizabeth, grasping Mae Mobley's hand, stands outside the wooden basin on the rear deck, and Aibileen lifts the child up. Aibileen closes the basin door with her spare hand."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A small green frog with shiny scales hops towards Zephyr, skipping beneath the dense, prickly needles of the cactus. The green frog, Tiberius, croaks at him brightly as he perches down next to him. Tiberius catches Zephyr by the wing, bringing a joyful croak to his beak, and Zephyr blinks with raindrops in his eyes. They bounce out of the cactus grove, and Tiberius wraps a vine around Zephyr's feathers. Zephyr rolls back the same way he came, with a more leisurely bounce and a pensive gleam on his beak. Later, he is on the roof, and Malcolm has twirled the roof antenna to the barn. Agile, round Mr. Vincent Frost is still on the roof, and Zephyr adjusts the umbrella, chirping as if he'd just snatched the largest beetle. Meanwhile, Gilda is on Theodore's back terrace with a gardener. Orion glances down at a silent forest. Zephyr waits for Gilda to float away and then gazes intently at Orion, who scurries out with the yarn basket. They drift into Theodore's barn, and Theodore's cousin, Winston, notices Zephyr hovering with Orion. Orion rises from arranging the fabrics, and grey storm clouds unleash a torrent on Riverton. At Gilda's cavern, Nellie is dusting Mr. Cumberbatch with a feather. She and Nellie squint towards the door and the torrent howling outside. Mr. Cumberbatch straightens in his hammock, in disbelief, and scrutinizes Nellie with an expression of puzzled enlightenment. Gilda, who has been lighting lanterns on the picnic bench, sits puffing herself. Nellie places down the feather and tiptoes to the gutter, peering out over the meadow and the wooden carriage beyond it. She spies a sun hat being tossed in the tempest, trembles awkwardly from claw to claw, and the swing has flown the path of the hat. Nellie makes a swift departure, and Mr. Cumberbatch lays out some stones. Her uncle's wings narrow as he observes Nellie sneak down the tunnel. In the attic, as Nellie gently lowers the crate lid, Gilda presses her beak to the attic trapdoor. Nellie, caught with her beak full, rigidly pauses, but then boldly empties the bowl. Nellie stands with her talons crossed, then snaps shut the bucket. Mr. Cumberbatch peers up from his stones without expression. Nellie, clutching her satchel, paddles out of the balcony into the gusting winds. A puppy's nursery is turned end over end, and Orion cuddles with Toby on his feathers, shielding beneath a toppled basket. In Theodore's sprawling aviary the next dawn, Orion, in his gardener's apron, is resting on the perch. Bees flit around him; he raises a claw to his beak, his feathers glistening, his demeanor weary. Theodore, holding Toby's paw, stands outside the metal perch on the rear terrace, and Orion clasps the pup. Orion closes the perch door with his idle claw."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Skeeter meets Constantine, a supportive figure, under a willow tree. Constantine's warm presence brings Skeeter to tears, and they leave together, with Skeeter feeling thoughtful. Later, on the phone with Ms. Elaine Stein, Skeeter feels a sense of triumph. Concurrently, Hilly is with a contractor, while Aibileen discreetly joins Skeeter at Elizabeth's house despite the impending storm. As the storm hits, Mrs. Walters and Minnie observe the chaos from inside Hilly's home. Suspicious of Minnie's actions, Hilly listens at the bathroom door, catching Minnie in a compromising moment. Minnie, undeterred, conspicuously leaves the house. Meanwhile, Aibileen comforts Mae Mobley during the storm, and the next day, she wearily tends to Mae Mobley while dealing with the challenges of her role as a maid."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Aibileen shuts the toilet door with her free hand Elizabeth holding Mae Mobley's hand stands outside the wooden toilet on the back porch and Aibileen picks the child up she brings a hand to her mouth her face perspiring her expression worldweary Flies buzz around her Aibileen in her maid's uniform is sitting on the toilet In Elizabeth's sprawling bungalow the next day A child's bedroom is turned upside down and Aibileen sits with Mae Mobley on her lap sheltering under an upturned mattress Minnie carrying her handbag strides out of the front door into the pouring rain Mrs Walters looks up from her cards without expression Minnie stands with her arms folded then slams down the lid Minnie caught with her knickers down freezes but then defiantly flushes the toilet Hilly puts her ear to the bathroom door In the bathroom as Minnie softly raises the toilet lid Her daughter's eyes narrow as she watches Minnie disappear down the hall Minnie beats a hasty retreat and Mrs Walters lays out some cards She sees a sun chair being buffeted in the wind shifts awkwardly from foot to foot and the pool umbrella has gone the way of the chair Minnie puts down the paper and sidles to the window looking out over the terrace and the outdoor toilet beyond it Hilly who has been lighting candles on the dining table sits fanning herself Mrs Walters sits up in her chair in awe and fixes Minnie with a look of confused comprehension She and Minnie glance towards the window and the storm raging outside At Hilly's house Minnie is fanning Mrs Walters with a newspaper Aibileen gets up from sorting the washing and black storm clouds release heavy rain on Jackson Raleigh sees Skeeter sitting with Aibileen They come into Elizabeth's kitchen and Elizabeth's husband Skeeter waits for Hilly to drive away and then looks pointedly at Aibileen who hurries in with the laundry basket Aibileen glances up at a windy sky Meanwhile Hilly is on Elizabeth's back porch with a contractor Ms Elaine Stein is still on the phone and Skeeter replaces the receiver grinning as if she would just won the jackpot Elegant slim Later she is on the phone and Charlotte has traced the phone flex to the kitchen Skeeter walks back the same way she came with a more relaxed pace and a thoughtful look on her face They walk out of the willow glade and Constantine slaps an arm around Skeeter's shoulders Constantine grips Skeeter by the hand bringing a grateful smile to her face and Skeeter nods with tears in her eyes The black woman Constantine smiles at her warmly as she sits down next to her A petite black woman with long plaits comes towards Skeeter passing beneath the long wispy branches of the willow"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Aibileen glances up at a windy sky Raleigh sees Skeeter sitting with Aibileen Later she is on the phone and Charlotte has traced the phone flex to the kitchen Minnie beats a hasty retreat and Mrs Walters lays out some cards Flies buzz around her In the bathroom as Minnie softly raises the toilet lid In Elizabeth's sprawling bungalow the next day Mrs Walters sits up in her chair in awe and fixes Minnie with a look of confused comprehension Mrs Walters looks up from her cards without expression Minnie caught with her knickers down freezes but then defiantly flushes the toilet At Hilly's house Minnie is fanning Mrs Walters with a newspaper Skeeter waits for Hilly to drive away and then looks pointedly at Aibileen who hurries in with the laundry basket They come into Elizabeth's kitchen and Elizabeth's husband Minnie carrying her handbag strides out of the front door into the pouring rain Meanwhile Hilly is on Elizabeth's back porch with a contractor She sees a sun chair being buffeted in the wind shifts awkwardly from foot to foot and the pool umbrella has gone the way of the chair Aibileen in her maid's uniform is sitting on the toilet Elegant slim Minnie stands with her arms folded then slams down the lid A petite black woman with long plaits comes towards Skeeter passing beneath the long wispy branches of the willow Elizabeth holding Mae Mobley's hand stands outside the wooden toilet on the back porch and Aibileen picks the child up Aibileen gets up from sorting the washing and black storm clouds release heavy rain on Jackson Minnie puts down the paper and sidles to the window looking out over the terrace and the outdoor toilet beyond it Constantine grips Skeeter by the hand bringing a grateful smile to her face and Skeeter nods with tears in her eyes she brings a hand to her mouth her face perspiring her expression worldweary A child's bedroom is turned upside down and Aibileen sits with Mae Mobley on her lap sheltering under an upturned mattress Her daughter's eyes narrow as she watches Minnie disappear down the hall They walk out of the willow glade and Constantine slaps an arm around Skeeter's shoulders Hilly puts her ear to the bathroom door Skeeter walks back the same way she came with a more relaxed pace and a thoughtful look on her face Aibileen shuts the toilet door with her free hand She and Minnie glance towards the window and the storm raging outside Hilly who has been lighting candles on the dining table sits fanning herself The black woman Constantine smiles at her warmly as she sits down next to her Ms Elaine Stein is still on the phone and Skeeter replaces the receiver grinning as if she would just won the jackpot"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Minnie puts down the paper and sidles to the window looking out over the terrace and the outdoor toilet beyond it She sees a sun chair being buffeted in the wind shifts awkwardly from foot to foot and the pool umbrella has gone the way of the chair Minnie beats a hasty retreat and Mrs Walters lays out some cards Her daughter's eyes narrow as she watches Minnie disappear down the hall In the bathroom as Minnie softly raises the toilet lid Hilly puts her ear to the bathroom door Minnie caught with her knickers down freezes but then defiantly flushes the toilet Minnie stands with her arms folded then slams down the lid Mrs Walters looks up from her cards without expression Minnie carrying her handbag strides out of the front door into the pouring rain A child's bedroom is turned upside down and Aibileen sits with Mae Mobley on her lap sheltering under an upturned mattress In Elizabeth's sprawling bungalow the next day Aibileen in her maid's uniform is sitting on the toilet Flies buzz around her she brings a hand to her mouth her face perspiring her expression worldweary Elizabeth holding Mae Mobley's hand stands outside the wooden toilet on the back porch and Aibileen picks the child up Aibileen shuts the toilet door with her free hand A petite black woman with long plaits comes towards Skeeter passing beneath the long wispy branches of the willow The black woman Constantine smiles at her warmly as she sits down next to her Constantine grips Skeeter by the hand bringing a grateful smile to her face and Skeeter nods with tears in her eyes They walk out of the willow glade and Constantine slaps an arm around Skeeter's shoulders Skeeter walks back the same way she came with a more relaxed pace and a thoughtful look on her face Later she is on the phone and Charlotte has traced the phone flex to the kitchen Elegant slim Ms Elaine Stein is still on the phone and Skeeter replaces the receiver grinning as if she would just won the jackpot Meanwhile Hilly is on Elizabeth's back porch with a contractor Aibileen glances up at a windy sky Skeeter waits for Hilly to drive away and then looks pointedly at Aibileen who hurries in with the laundry basket They come into Elizabeth's kitchen and Elizabeth's husband Raleigh sees Skeeter sitting with Aibileen Aibileen gets up from sorting the washing and black storm clouds release heavy rain on Jackson At Hilly's house Minnie is fanning Mrs Walters with a newspaper She and Minnie glance towards the window and the storm raging outside Mrs Walters sits up in her chair in awe and fixes Minnie with a look of confused comprehension Hilly who has been lighting candles on the dining table sits fanning herself"
        }
      ]
    }
  ]
}