{
  "ground_truth": "A high door swings open, and a caped figure stands in the entrance of a warehouse. He looks around as silver-grey light from the rows of small windows glows on strange objects. To his left, beyond a set of stairs, two looming shapes appear and become recognizable as the ends of two train carriages, slightly bent and twisted. The man walks to the nearer of the two, not badly damaged at the back. As he looks up at the length of it, however, he sees that the sides have been smashed open. The little remaining glass is cracked and shattered, and seats lean drunkenly, having been torn from their mountings, their upholstery charred and blackened. Light catches the man's face as he stares up at the wrecked carriage. He stands quite still, looking up, grim-faced, for a long time, ignoring drops of water falling from his hood. In the dark, a man is crouching on a force. He rises onto his knees. As his head comes up, light falls on the face of David, aged about 20. He looks around, and the light is coming from a burning car, upside down behind him. He staggers towards it, stumbling on his knees, crawling. A young woman lies in the burning car, unconscious. Audrey is lying very still. David grasps the edge of the car door with both hands and pulls. He bends down and checks the door catch, which doesn't move. Audrey's arm is hanging out of the window. David grabs the edge of the door again and heaves. Beyond him, flames rise up into the night sky. He rips the door from its hinges, bends down, and releases Audrey's seat belt. David drags Audrey from the car, cradles her in his arms, and lays her down gently some yards away. He looks over his shoulder and sees the lights of a pickup truck coming slowly around the bend. He waves frantically. When he looks back, Audrey's eyes are open. He holds her head, tenderly. The truck driver runs to them. David looks into the man's concerned face, and back at Audrey. Very slowly, he lifts his head, the flames still flickering behind him. He has a thoughtful expression on his face and doesn't meet the man's eyes. Elijah rolls his wheelchair along a darkened corridor, his right leg still sticking straight out with its two long rows of shiny bolts protruding from the metal frame around it. He picks up the phone. Elijah looks straight ahead, past the rows of shelving, displaying a huge collection of comics. David is standing at the top of the stairs above the concourse of Philadelphia Train Station. On either side of him, tall classical stone pillars.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A tall portal swings open, and a cloaked silhouette stands in the entryway of a storage facility. He gazes around as silvery-grey illumination from the lines of diminutive panes radiates on odd items. To his left, beyond a flight of stairs, two towering forms emerge and become identifiable as the ends of two railway coaches, slightly bent and twisted. The man strides to the nearer one, not seriously impaired at the rear. As he glances upward at the extent of it, however, he observes that the sides have been broken open. The little remaining glass is cracked and shattered, and seats lean drunkenly, having been ripped from their mountings, their upholstery charred and blackened. Light catches the man's visage as he gazes upward at the wrecked coach. He stands quite still, looking up, grim-faced, for a lengthy time, disregarding drops of water falling from his hood. In the dark, a man is crouching on a force. He rises onto his knees. As his head comes up, light falls on the countenance of David, aged about 20. He looks around, and the light is coming from a burning automobile, overturned behind him. He staggers towards it, stumbling on his knees, crawling. A young woman lies in the burning automobile, unconscious. Audrey is lying very still. David grips the edge of the automobile door with both hands and pulls. He bends down and checks the door catch, which doesn't move. Audrey's arm is hanging out of the window. David grabs the edge of the door again and heaves. Beyond him, flames rise into the night sky. He rips the door from its hinges, bends down, and releases Audrey's seat belt. David drags Audrey from the automobile, cradles her in his arms, and lays her down gently some yards away. He glances over his shoulder and sees the lights of a pickup lorry coming slowly around the bend. He waves frantically. When he looks back, Audrey's eyes are open. He holds her head, tenderly. The lorry driver runs to them. David looks into the man's concerned face, and back at Audrey. Very slowly, he raises his head, the flames still flickering behind him. He has a contemplative expression on his face and doesn't meet the man's eyes. Elijah rolls his wheelchair along a dimmed walkway, his right leg still sticking straight out with its two long rows of shiny bolts protruding from the metallic frame around it. He picks up the telecommunication device. Elijah looks straight ahead, past the rows of shelving, displaying a huge collection of comics. David is standing at the top of the stairs above the concourse of Philadelphia Train Station. On either side of him, tall classical stone columns."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A high door is swung open, and the entrance of a warehouse is stood in by a caped figure. Around him, he is looked by silver-grey light from the rows of small windows that glows on strange objects. To his left, beyond a set of stairs, two looming shapes are recognized as the ends of two train carriages, slightly bent and twisted. The nearer of the two is walked to by the man, not badly damaged at the back. As up at the length of it, it is looked by him, however, it is seen that the sides have been smashed open. The little remaining glass is cracked and shattered, and seats drunkenly lean, having been torn from their mountings, their upholstery charred and blackened. Light catches the man's face as the wrecked carriage is stared up at by him. Quite still he stands, looking up, grim-faced, for a long time, ignoring drops of water that fall from his hood. In the dark, on a force, a man crouches. He is risen onto his knees. As up comes his head, the face of David, aged about 20, is illuminated by light. He looks around, and from a burning car, upside down behind him, the light comes. Towards it he staggers, stumbling on his knees, crawling. In the burning car, a young woman is lying unconscious. Very still lies Audrey. The edge of the car door is grasped by David with both hands and pulled. The door catch, which doesn't move, is checked by him as he bends down. Audrey's arm hangs out of the window. The edge of the door is seized by David again and it is heaved. Beyond him, flames are seen rising up into the night sky. From its hinges, he rips the door, bends down, and releases Audrey's seat belt. From the car, Audrey is dragged by David, cradled in his arms, and gently laid down some yards away. His shoulder is looked over by him and slowly the lights of a pickup truck are seen coming around the bend. Frantically, he waves. When back he looks, Audrey's eyes are open. Her head is held tenderly by him. To them, the truck driver runs. Into the man's concerned face, David looks, and back at Audrey. Very slowly, his head is lifted by him, the flames still flickering behind him. A thoughtful expression is on his face and the man's eyes are not met by him. Along a darkened corridor, Elijah rolls his wheelchair, his right leg still protruding straight out with its two long rows of shiny bolts protruding from the metal frame around it. The phone is picked up by him. Straight ahead, Elijah looks, past the rows of shelving, displaying a huge collection of comics. At the top of the stairs above the concourse of Philadelphia Train Station, David stands. On either side of him, tall classical stone pillars are positioned."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A high door opens, revealing a caped figure in a warehouse entrance. Silver-grey light from small windows illuminates strange objects. To his left, beyond stairs, two looming shapes emerge as train carriages, slightly bent. He approaches the nearer one, less damaged at the back, but its sides are smashed, glass shattered, and seats charred. Light reveals his grim face as he stares at the wreckage, ignoring water drops from his hood. In the dark, a man crouches, then rises—it's David, about 20, illuminated by a burning, overturned car. He staggers toward it, finding a young woman, Audrey, unconscious inside. David pulls at the car door, checks the catch, and heaves again, ripping it off. He releases Audrey's seat belt, drags her out, and lays her gently away from the flames. Seeing a pickup truck approaching, he waves frantically. Audrey's eyes open, and he holds her head tenderly. The truck driver arrives, and David looks at him, then back at Audrey, thoughtful, with flames flickering behind. Elijah rolls his wheelchair down a dark corridor, his leg encased in a metal frame. He picks up the phone, looking past shelves of comics. David stands atop the stairs at Philadelphia Train Station, flanked by tall stone pillars."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A high door opens, revealing a caped figure in a warehouse entrance. Silver-grey light illuminates strange objects. To his left, beyond stairs, two train carriages appear, bent and twisted. He approaches the less damaged one, noting its smashed sides, shattered glass, and charred seats. Light reveals his grim face as he stares at the wreckage, ignoring water drops from his hood. In the dark, David, about 20, rises from a crouch, illuminated by an upside-down burning car. He crawls to it, finding an unconscious young woman, Audrey, inside. He struggles with the door, finally ripping it off, and frees her. David carries Audrey away, noticing a pickup truck approaching. He waves frantically, then tenderly holds Audrey as she awakens. The truck driver arrives, and David, thoughtful, looks at Audrey, avoiding the man's eyes. Elijah rolls his wheelchair down a dark corridor, his leg in a metal frame. He picks up the phone, looking past shelves of comics. David stands at the top of stairs in Philadelphia Train Station, flanked by tall stone pillars."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A tall, imposing door swings open with a creak, and a mysterious figure draped in a flowing cape stands silhouetted in the entrance of a vast, dimly lit warehouse. He surveys his surroundings as the soft, silver-grey light filtering through the rows of small, dusty windows casts an eerie glow on the assortment of strange, unidentifiable objects scattered throughout the space. To his left, just beyond a set of narrow stairs, two massive, looming shapes gradually come into focus, revealing themselves to be the ends of two train carriages, each slightly bent and twisted in a haunting manner. The man strides purposefully toward the nearer of the two carriages, which appears to be less severely damaged at the rear. However, as he gazes upward along its length, he notices that the sides have been violently smashed open. The few remaining shards of glass are cracked and shattered, and the seats lean at odd angles, having been violently torn from their mountings, their upholstery charred and blackened by fire. The light catches the man's face as he stands transfixed, staring up at the wrecked carriage with a grim expression, remaining motionless for a long time, seemingly oblivious to the drops of water falling from the edge of his hood. \n\nIn the darkness, another man is crouched low on a force, his form barely visible. He slowly rises onto his knees, and as his head emerges into the light, it reveals the face of David, a young man of about 20 years. He glances around, taking in his surroundings, and sees that the light is emanating from a burning car, which lies overturned behind him. He staggers toward it, stumbling on his knees, crawling with determination. Inside the burning car, a young woman lies unconscious, her body motionless. Audrey is lying very still, her life hanging in the balance. David grasps the edge of the car door with both hands and pulls with all his might. He bends down to check the door catch, which stubbornly refuses to budge. Audrey's arm dangles limply out of the window. With renewed effort, David grabs the edge of the door once more and heaves with all his strength. Beyond him, flames leap up into the night sky, casting a flickering glow. He manages to rip the door from its hinges, bends down, and releases Audrey's seat belt. Gently, he drags Audrey from the car, cradling her in his arms, and lays her down tenderly some yards away from the burning wreckage. He glances over his shoulder and sees the headlights of a pickup truck approaching slowly around the bend. He waves his arms frantically to get the driver's attention. When he turns back, he sees that Audrey's eyes have opened. He holds her head tenderly, reassuringly. The truck driver rushes over to them, his face filled with concern. David looks into the man's worried eyes, then back at Audrey. Very slowly, he lifts his head, the flames still flickering ominously behind him. A thoughtful expression crosses his face, and he avoids meeting the man's gaze.\n\nMeanwhile, Elijah rolls his wheelchair along a darkened corridor, his right leg still extended straight out, with two long rows of shiny bolts protruding from the metal frame encasing it. He picks up the phone, his expression unreadable. Elijah looks straight ahead, past the rows of shelving that display a vast collection of comics, each one meticulously arranged. Elsewhere, David stands at the top of the stairs above the bustling concourse of Philadelphia Train Station. On either side of him, tall, classical stone pillars rise majestically, framing the scene with their timeless elegance."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A tall and imposing door swings open with a prolonged creak, revealing a mysterious figure shrouded in a flowing cape, standing silhouetted against the entrance of an expansive, dimly lit warehouse. The enigmatic figure pauses and surveys his surroundings with keen eyes, as the soft, silver-grey light gently filters through the rows of small, dusty windows, casting an eerie glow upon the eclectic assortment of strange, unidentifiable objects scattered throughout the cavernous space. Just to his left, beyond a narrow staircase, two massive, looming shapes gradually come into clearer focus, unfolding themselves as the ends of two train carriages, each slightly bent and twisted in a haunting and unsettling manner. The man strides forward purposefully toward the nearer of the two carriages, which appears to be less severely damaged at the rear section. However, as he gazes up along its length, he notices with concern that the sides have been violently smashed open. The few remaining shards of glass are cracked and shattered, while the seats lean at odd angles, having been torn forcefully from their mountings, their upholstery charred and blackened by a fierce blaze. The soft light catches the man's face as he stands transfixed, staring intently up at the wrecked carriage with a grim expression. He remains motionless for a very long time, seemingly oblivious to the drops of water that are falling steadily from the edge of his hood.\n\nIn the enveloping darkness, another man is crouched low on the ground, his form barely discernible. Slowly, he rises onto his knees, and as his head lifts into the dim light, it reveals the youthful face of David, a young man of about 20 years. He cautiously glances around, taking in the eerie surroundings, and sees that the light is emanating from a burning car, overturned and lying just behind him. With determination, he staggers toward it, stumbling on his knees and crawling forward with resolve. Inside the blazing vehicle, a young woman lies unconscious, her body utterly motionless. Audrey, as she is known, is lying very still, with her life hanging precariously in the balance. With urgency, David grasps the edge of the car door with both hands and pulls with all his strength. He bends down to check the door catch, but it stubbornly refuses to budge. Audrey's arm dangles limply out of the window, a reminder of the fragility of the situation. With renewed effort and determination, David grabs the edge of the door once more and heaves with all his might. Beyond him, the flames leap up into the night sky, casting a flickering and ominous glow. He manages to rip the door from its hinges, bends down, and releases the seat belt restraining Audrey. Gently, he drags her from the car, cradling her protectively in his arms, and lays her down tenderly some yards away from the inferno of wreckage. He glances over his shoulder and sees the headlights of a pickup truck approaching slowly around the bend. Desperately, he waves his arms frantically to get the driver's attention. When he turns back, he is relieved to see that Audrey's eyes have opened. He holds her head tenderly and reassuringly. The truck driver rushes over to them, his face filled with genuine concern. David locks eyes with the man's worried expression, then glances back at Audrey. Very slowly, he lifts his head, the flames flickering ominously behind him, and a thoughtful expression crosses his face, as he avoids meeting the man's direct gaze.\n\nMeanwhile, Elijah rolls his wheelchair down a darkened corridor, his right leg still extended straight out, with two long rows of shiny bolts protruding from the metal frame encasing it. He picks up the phone, his expression unreadable and enigmatic. Elijah looks straight ahead, past the rows of shelving that display an impressive and vast collection of comics, each one meticulously and carefully arranged. Elsewhere, David stands at the top of the grand stairs above the bustling concourse of Philadelphia Train Station. On either side of him, tall, classical stone pillars rise in majestic grandeur, framing the unfolding scene with their timeless and elegant presence."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the high door swings open with a creak, a caped figure emerges and stands in the entrance of a dimly lit warehouse, pausing to take in his surroundings. He surveys the scene, his eyes adjusting to the silver-grey light filtering through the rows of small windows, casting an eerie glow on the strange objects scattered around. To his left, beyond a set of stairs, two looming shapes gradually come into focus, revealing themselves as the ends of two train carriages, their forms slightly bent and twisted. The man moves deliberately towards the nearer carriage, noting that it is not badly damaged at the back. As he lifts his gaze along its length, he observes that the sides have been violently smashed open. The little remaining glass is cracked and shattered, while the seats inside lean at odd angles, having been torn from their mountings, their upholstery charred and blackened by fire. Light catches the man's face as he stands transfixed, staring up at the wrecked carriage with a grim expression, remaining motionless for a long time, seemingly oblivious to the drops of water falling from his hood. In the darkness, another man is crouched on a force, and as he rises onto his knees, the light from a burning car, overturned behind him, illuminates his face, revealing him to be David, a young man of about 20. He glances around, disoriented, before staggering towards the burning vehicle, stumbling on his knees and crawling with determination. Inside the car, a young woman named Audrey lies unconscious, her body very still. David reaches the car and grasps the edge of the door with both hands, pulling with all his strength. He bends down to check the door catch, but it refuses to budge. Audrey's arm dangles out of the window, and David, undeterred, grabs the door's edge once more and heaves with all his might. Flames continue to rise into the night sky as he rips the door from its hinges, then bends down to release Audrey's seat belt. With care, David drags Audrey from the car, cradling her in his arms as he carries her a safe distance away, laying her down gently on the ground. He glances over his shoulder and notices the lights of a pickup truck approaching slowly around the bend. Frantically, he waves to catch the driver's attention. When he turns back, he sees that Audrey's eyes have opened, and he tenderly holds her head in his hands. The truck driver rushes over to them, and David meets the man's concerned gaze before looking back at Audrey. Slowly, he lifts his head, the flames still flickering in the background, his expression thoughtful as he avoids meeting the man's eyes. Meanwhile, Elijah rolls his wheelchair along a darkened corridor, his right leg extended straight out, encased in a metal frame with two long rows of shiny bolts protruding from it. He picks up the phone, his gaze fixed straight ahead, past the rows of shelving that display a vast collection of comics. Elsewhere, David stands at the top of the stairs above the concourse of Philadelphia Train Station, flanked on either side by tall classical stone pillars, surveying the bustling scene below."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A high door swings open, revealing a caped figure standing in the entrance of a warehouse. He surveys the scene as silver-grey light illuminates strange objects. To his left, beyond a set of stairs, two train carriages emerge from the shadows, their ends slightly bent and twisted. The man approaches the nearer carriage, noting its relatively undamaged back. However, as he examines it further, he observes the sides smashed open, with cracked glass and charred, dislodged seats. Light catches his grim face as he stands motionless, ignoring the water dripping from his hood.\n\nElsewhere, in the dark, a young man named David, around 20 years old, rises from a crouched position, illuminated by the light of a burning, overturned car behind him. He staggers toward the car, crawling on his knees, where a young woman, Audrey, lies unconscious. David struggles with the car door, eventually ripping it from its hinges, and frees Audrey from her seat belt. He gently carries her away from the wreckage and lays her down at a safe distance. Spotting the lights of an approaching pickup truck, he waves frantically. When he turns back, Audrey's eyes are open, and he tenderly holds her head. The truck driver arrives, and David, with a thoughtful expression, looks between the concerned man and Audrey, the flames flickering behind him.\n\nMeanwhile, Elijah rolls his wheelchair along a darkened corridor, his right leg encased in a metal frame with protruding bolts. He picks up the phone, gazing past rows of shelving filled with a vast collection of comics. In another scene, David stands at the top of the stairs above the concourse of Philadelphia Train Station, flanked by tall classical stone pillars."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A high door swings open, and a caped figure, silhouetted in the entrance of a once bustling but now abandoned warehouse on the outskirts of the city, stands in the entrance. He looks around as silver-grey light from the rows of small windows, reminiscent of industrial factory designs from the early 20th century, glows on strange objects. To his left, beyond a set of stairs covered in years of accumulated dust, two looming shapes appear and become recognizable as the ends of two train carriages, slightly bent and twisted from a past collision. The man walks to the nearer of the two, which, despite its apparent wear, is not badly damaged at the back. As he looks up at the length of it, however, he sees that the sides have been smashed open, likely from looters scavenging for scrap. The little remaining glass is cracked and shattered, reminiscent of the shrapnel spread during its last journey, and seats lean drunkenly, having been torn from their mountings, their upholstery charred and blackened from what seems to have been a fire. Light catches the man's face as he stares up at the wrecked carriage. He stands quite still, looking up, grim-faced, for a long time, ignoring drops of water falling from his hood during the constant rain that plagues the area. In the dark, a man is crouching on a force, a police term for an unseen surveillance operation. He rises onto his knees, revealing years of physical training in his poised movements. As his head comes up, light falls on the face of David, aged about 20, his youthful features set with determination and resolve. He looks around, and the light is coming from a burning car, an old model Ford, upside down behind him, its engine still hissing. He staggers towards it, stumbling on his knees, crawling. A young woman lies in the burning car, unconscious. Audrey, a medical student known for her resilience, is lying very still. David grasps the edge of the car door with both hands and pulls. He bends down and checks the door catch, which doesn't move, likely jammed from the impact. Audrey's arm is hanging out of the window, her medical bracelet glinting in the firelight. David grabs the edge of the door again and heaves. Beyond him, flames rise up into the night sky, dancing shadows on the nearby trees. He rips the door from its hinges, bends down, and releases Audrey's seat belt, carefully avoiding the still-hot metal. David drags Audrey from the car, cradles her in his arms, and lays her down gently some yards away, away from the choking smoke. He looks over his shoulder and sees the lights of a pickup truck coming slowly around the bend, its headlights cutting through the smoke. He waves frantically. When he looks back, Audrey's eyes are open, her relief evident. He holds her head, tenderly, whispering reassurances. The truck driver runs to them, a volunteer firefighter by the look of his gear. David looks into the man's concerned face, and back at Audrey. Very slowly, he lifts his head, the flames still flickering behind him, a chaotic halo. He has a thoughtful expression on his face and doesn't meet the man's eyes, pondering the miraculous escape. Elijah, known for his vast knowledge of the obscure and the forgotten, rolls his wheelchair along a darkened corridor, his right leg still sticking straight out with its two long rows of shiny bolts protruding from the metal frame around it, a testament to his recent accident. He picks up the phone, its cord stretching from a dusty corner. Elijah looks straight ahead, past the rows of shelving, displaying a huge collection of comics, many of which are rare first editions. David is standing at the top of the stairs above the concourse of Philadelphia Train Station, a historic hub known as the third busiest rail terminal in the United States. On either side of him, tall classical stone pillars, reminiscent of ancient Greek architecture, frame the bustling scene below."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A high door swings open and a caped figure stands in the entrance of a warehouse. He looks around as silvergrey light from the rows of small windows glows on strange objects. To his left beyond a set of stairs two looming shapes appear and become recognizable as the ends of two train carriages slightly bent and twisted. The man walks to the nearer of the two not badly damaged at the back. As he looks up at the length of it however he sees that the sides have been smashed open. The little remaining glass is cracked and shattered and seats lean drunkenly having been torn from their mountings their upholstery charred and blackened. Light catches the man's face as he stares up at the wrecked carriage. He stands quite still looking up grimfaced for a long time ignoring drops of water falling from his hood. In the dark a man is crouching on a force. He rises onto his knees. As his head comes up light falls on the face of David aged about 20. He looks around and the light is coming from a burning car upside down behind him. He staggers towards it stumbling on his knees crawling. A young woman lies in the burning car unconscious. Audrey is lying very still. David grasps the edge of the car door with both hands and pulls. He bends down and checks the door catch which does not move. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Audrey's arm is hanging out of the window. David grabs the edge of the door again and heaves. Beyond him flames rise up into the night sky. He rips the door from its hinges bends down and releases Audrey's seat belt. David drags Audrey from the car cradles her in his arms and lays her down gently some yards away. He looks over his shoulder and sees the lights of a pickup truck coming slowly around the bend. He waves frantically. When he looks back Audrey's eyes are open. He holds her head tenderly. The truck driver runs to them. David looks into the man's concerned face and back at Audrey. Very slowly he lifts his head the flames still flickering behind him. He has a thoughtful expression on his face and does not meet the man's eyes. Elijah rolls his wheelchair along a darkened corridor his right leg still sticking straight out with its two long rows of shiny bolts protruding from the metal frame around it. He picks up the phone. Elijah looks straight ahead past the rows of shelving displaying a huge collection of comics. David is standing at the top of the stairs above the concourse of Philadelphia Train Station. On either side of him tall classical stone pillars."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A high door swings open and a caped figure stands in the entrance of a warehouse. He looks around as silvergrey light from the rows of small windows glows on strange objects. To his left beyond a set of stairs two looming shapes appear and become recognizable as the ends of two train carriages slightly bent and twisted. The man walks to the nearer of the two not badly damaged at the back. As he looks up at the length of it however he sees that the sides have been smashed open. The little remaining glass is cracked and shattered and seats lean drunkenly having been torn from their mountings their upholstery charred and blackened. Light catches the man's face as he stares up at the wrecked carriage. He stands quite still looking up grimfaced for a long time ignoring drops of water falling from his hood. In the dark a man is crouching on a force. He rises onto his knees. As his head comes up light falls on the face of David aged about 20. He looks around and the light is coming from a burning car upside down behind him. He staggers towards it stumbling on his knees crawling. A young woman lies in the burning car unconscious. Audrey is lying very still. David grasps the edge of the car door with both hands and pulls. He bends down and checks the door catch which does not move. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Audrey's arm is hanging out of the window. David grabs the edge of the door again and heaves. Beyond him flames rise up into the night sky. He rips the door from its hinges bends down and releases Audrey's seat belt. David drags Audrey from the car cradles her in his arms and lays her down gently some yards away. He looks over his shoulder and sees the lights of a pickup truck coming slowly around the bend. He waves frantically. When he looks back Audrey's eyes are open. He holds her head tenderly. The truck driver runs to them. David looks into the man's concerned face and back at Audrey. Very slowly he lifts his head the flames still flickering behind him. He has a thoughtful expression on his face and does not meet the man's eyes. Elijah rolls his wheelchair along a darkened corridor his right leg still sticking straight out with its two long rows of shiny bolts protruding from the metal frame around it. He picks up the phone. Elijah looks straight ahead past the rows of shelving displaying a huge collection of comics. David is standing at the top of the stairs above the concourse of Philadelphia Train Station. On either side of him tall classical stone pillars."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A high door swings open and a caped figure stands in the entrance of a warehouse. He looks around as silvergrey light from the rows of small windows glows on strange objects. To his left beyond a set of stairs two looming shapes appear and become recognizable as the ends of two train carriages slightly bent and twisted. The man walks to the nearer of the two not badly damaged at the back. As he looks up at the length of it however he sees that the sides have been smashed open. The little remaining glass is cracked and shattered and seats lean drunkenly having been torn from their mountings their upholstery charred and blackened. Light catches the man's face as he stares up at the wrecked carriage. He stands quite still looking up grimfaced for a long time ignoring drops of water falling from his hood. In the dark a man is crouching on a force. The truck driver runs to them. David looks into the man's concerned face and back at Audrey. Very slowly he lifts his head the flames still flickering behind him. He has a thoughtful expression on his face and does not meet the man's eyes. Elijah rolls his wheelchair along a darkened corridor his right leg still sticking straight out with its two long rows of shiny bolts protruding from the metal frame around it. He picks up the phone. Elijah looks straight ahead past the rows of shelving displaying a huge collection of comics. David is standing at the top of the stairs above the concourse of Philadelphia Train Station. On either side of him tall classical stone pillars."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A high door swings open and a caped figure stands in the entrance of a warehouse. He looks around as silvergrey light from the rows of small windows glows on strange objects. To his left beyond a set of stairs two looming shapes appear and become recognizable as the ends of two train carriages slightly bent and twisted. He picks up the phone. Elijah looks straight ahead past the rows of shelving displaying a huge collection of comics. David is standing at the top of the stairs above the concourse of Philadelphia Train Station. On either side of him tall classical stone pillars."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A wide gate creaks ajar, and a masked creature lounges in the doorway of a library. She peers around as golden-blue shadows from the line of large lanterns flicker on peculiar shapes. To her right, beside a row of ladders, two towering figures emerge and transform into the tops of two giant books, slightly creased and folded. The girl skips to the farther of the two, not heavily scratched at the top. As she gazes down the breadth of it, however, she notices that the covers have been ripped apart. The remaining paper is torn and shredded, and pages lean haphazardly, having been ripped from their bindings, their margins scorched and yellowed. Shadows fall on the girl's eyes as she gazes down at the broken tome. She stays quite motionless, gazing down, solemnly, for a while, dismissing threads of dust swirling from her cape. In the dimness, a woman is huddling on a platform. She flips onto her side. As her hands rise, shadows fall on the face of Emily, aged about 42. She glances upward, and the shadows are coming from a flickering torch, dangling above her. She creeps toward it, sliding on her side, crouching. An old man stands by the flickering torch, dazed. Jerry is standing quite still. Emily clutches the bottom of the lamp with trembling fingers and shakes. She reaches up and adjusts the lamp chain, which doesn't budge. Jerry's cloak is billowing out of the nook. Emily clutches the bottom of the lamp again and yanks. Overhead, shadows bounce up into the dusk. She tears the chain from its socket, reaches up, and douses Jerry's robe. Emily hauls Jerry from the torch, embraces him in her limbs, and props him down gently several paces away. She peers over her elbow and notices the shadows of a bicycle gliding quickly around the bend. She signals desperately. As she peers back, Jerry's eyes are closed. She lifts his arm, gently. The cyclist rushes toward them. Emily peers into the woman's worried gaze and back at Jerry. Gradually, she bows her gaze, the shadows still dancing around her. She has a puzzled demeanor on her gaze and ignores the woman's concern. Sarah maneuvers her scooter along a brightly lit walkway, her left arm still jutting straight out with its two short rows of golden pins extending from the wooden band around it. She hangs up the lantern. Sarah peers straight ahead, toward the line of banners, showcasing a tiny array of trinkets. Emily is situated at the bottom of the ladders below the balconies of Paris Opera House. Beside her, short modern brick columns."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A caped figure enters a warehouse, illuminated by silver-grey light. He examines two slightly damaged train carriages, one smashed and charred. Water drips from his hood as he grimly assesses the wreck. Nearby, David, about 20, rises near a burning, overturned car. Seeing Audrey unconscious inside, he struggles with the car door, finally tearing it off. He frees and cradles Audrey away from the flames. Spotting a truck, he waves frantically, relief washing over as Audrey regains consciousness. Meanwhile, Elijah, in a wheelchair with a metal-framed leg, picks up a phone in a corridor lined with comics. David stands beneath stone pillars at Philadelphia Train Station."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "On either side of him tall classical stone pillars David is standing at the top of the stairs above the concourse of Philadelphia Train Station  Elijah looks straight ahead past the rows of shelving displaying a huge collection of comics  He picks up the phone  Elijah rolls his wheelchair along a darkened corridor his right leg still sticking straight out with its two long rows of shiny bolts protruding from the metal frame around it  He has a thoughtful expression on his face and doesn't meet the man's eyes  Very slowly he lifts his head the flames still flickering behind him  David looks into the man's concerned face and back at Audrey  The truck driver runs to them  He holds her head tenderly  When he looks back Audrey's eyes are open  He waves frantically  He looks over his shoulder and sees the lights of a pickup truck coming slowly around the bend  David drags Audrey from the car cradles her in his arms and lays her down gently some yards away  He rips the door from its hinges bends down and releases Audrey's seat belt  Beyond him flames rise up into the night sky  David grabs the edge of the door again and heaves  Audrey's arm is hanging out of the window  He bends down and checks the door catch which doesn't move  David grasps the edge of the car door with both hands and pulls  Audrey is lying very still  A young woman lies in the burning car unconscious  He staggers towards it stumbling on his knees crawling  He looks around and the light is coming from a burning car upside down behind him  As his head comes up light falls on the face of David aged about 20  He rises onto his knees  In the dark a man is crouching on a force  He stands quite still looking up grimfaced for a long time ignoring drops of water falling from his hood  Light catches the man's face as he stares up at the wrecked carriage  The little remaining glass is cracked and shattered and seats lean drunkenly having been torn from their mountings their upholstery charred and blackened  As he looks up at the length of it however he sees that the sides have been smashed open  The man walks to the nearer of the two not badly damaged at the back  To his left beyond a set of stairs two looming shapes appear and become recognizable as the ends of two train carriages slightly bent and twisted  He looks around as silvergrey light from the rows of small windows glows on strange objects  A high door swings open and a caped figure stands in the entrance of a warehouse "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He looks around as silvergrey light from the rows of small windows glows on strange objects A high door swings open and a caped figure stands in the entrance of a warehouse The man walks to the nearer of the two not badly damaged at the back To his left beyond a set of stairs two looming shapes appear and become recognizable as the ends of two train carriages slightly bent and twisted The little remaining glass is cracked and shattered and seats lean drunkenly having been torn from their mountings their upholstery charred and blackened As he looks up at the length of it however he sees that the sides have been smashed open He stands quite still looking up grimfaced for a long time ignoring drops of water falling from his hood Light catches the man's face as he stares up at the wrecked carriage He rises onto his knees In the dark a man is crouching on a force He looks around and the light is coming from a burning car upside down behind him As his head comes up light falls on the face of David aged about 20 A young woman lies in the burning car unconscious He staggers towards it stumbling on his knees crawling David grasps the edge of the car door with both hands and pulls Audrey is lying very still Audrey's arm is hanging out of the window He bends down and checks the door catch which does not move Beyond him flames rise up into the night sky David grabs the edge of the door again and heaves David drags Audrey from the car cradles her in his arms and lays her down gently some yards away He rips the door from its hinges bends down and releases Audrey's seat belt He waves frantically He looks over his shoulder and sees the lights of a pickup truck coming slowly around the bend He holds her head tenderly When he looks back Audrey's eyes are open David looks into the man's concerned face and back at Audrey The truck driver runs to them He has a thoughtful expression on his face and does not meet the man's eyes Very slowly he lifts his head the flames still flickering behind him He picks up the phone Elijah rolls his wheelchair along a darkened corridor his right leg still sticking straight out with its two long rows of shiny bolts protruding from the metal frame around it David is standing at the top of the stairs above the concourse of Philadelphia Train Station Elijah looks straight ahead past the rows of shelving displaying a huge collection of comics On either side of him tall classical stone pillars"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "David grabs the edge of the door again and heaves  Beyond him flames rise up into the night sky  He rips the door from its hinges bends down and releases Audrey's seat belt  David drags Audrey from the car cradles her in his arms and lays her down gently some yards away  He looks over his shoulder and sees the lights of a pickup truck coming slowly around the bend  He waves frantically  When he looks back Audrey's eyes are open  He holds her head tenderly  The truck driver runs to them  David looks into the man's concerned face and back at Audrey  Very slowly he lifts his head the flames still flickering behind him  He has a thoughtful expression on his face and doesn't meet the man's eyes  Elijah rolls his wheelchair along a darkened corridor his right leg still sticking straight out with its two long rows of shiny bolts protruding from the metal frame around it  He picks up the phone  Elijah looks straight ahead past the rows of shelving displaying a huge collection of comics  David is standing at the top of the stairs above the concourse of Philadelphia Train Station  On either side of him tall classical stone pillars A high door swings open and a caped figure stands in the entrance of a warehouse  He looks around as silvergrey light from the rows of small windows glows on strange objects  To his left beyond a set of stairs two looming shapes appear and become recognizable as the ends of two train carriages slightly bent and twisted  The man walks to the nearer of the two not badly damaged at the back  As he looks up at the length of it however he sees that the sides have been smashed open  The little remaining glass is cracked and shattered and seats lean drunkenly having been torn from their mountings their upholstery charred and blackened  Light catches the man's face as he stares up at the wrecked carriage  He stands quite still looking up grimfaced for a long time ignoring drops of water falling from his hood  In the dark a man is crouching on a force  He rises onto his knees  As his head comes up light falls on the face of David aged about 20  He looks around and the light is coming from a burning car upside down behind him  He staggers towards it stumbling on his knees crawling  A young woman lies in the burning car unconscious  Audrey is lying very still  David grasps the edge of the car door with both hands and pulls  He bends down and checks the door catch which doesn't move  Audrey's arm is hanging out of the window "
        }
      ]
    }
  ]
}