{
  "ground_truth": "Directly ahead, the enormous, bright disk of the station clock looms as people scurry across the concourse in the beams of cold silver light from lamps high above in the ceiling. Uniformly grey against the grey floor and walls, David descends the stone staircase and stands at the foot of the stairs in a baseball cap and rain cape, watching humanity ebb and flow. He starts to walk unhurriedly through the crowd when a young blonde woman in a bright red jacket bumps into him. He then sees, watching from above, the same woman in a different shiny jacket in a jewelry shop. She points at an elderly assistant, and as his back is turned, she reaches over the counter, takes a bracelet, and drops it into her bag. David watches her disappear into the crowd and then moves slowly on, with other people passing and some touching him. He stops in the middle of the concourse, people swirling around him, and holds his left hand out slightly, fingers extended, as a man in a check shirt worn outside his trousers brushes into David's extended hand. Once again, he's looking down from high above, watching the man in the check shirt lean out of a pickup and smash a bottle over the head of a black woman strolling along a city street at night. Frowning, David sees the man drain a beer can and drop it into a trash bin. A young man in a green shirt kneels by a bed where a young woman in a very short party dress is sprawled. She rolls over, unhearing, the dress revealing her thighs. The boy watches for a moment, rises, and the girl's leg slips off the bed as she lies on her side, blonde hair spread over an assortment of coats, unmoving. The boy leaves, closing the door behind him. David turns and looks around the station as a group of college students, all wearing maroon baseball caps, files past him. He looks beyond them and sees the young man in a green jacket embrace his mother and turn to smile at his father. David watches, starts to walk backwards, swallowing hard, and glancing at other people as they pass by, backing into a maintenance man in orange overalls pushing a trash bin on wheels. A man opens his front door to the maintenance man now in an orange T-shirt, and the two men stare at each other through the outer fly screen door. The maintenance man grabs the door and holds it open while David sees an image of the house owner sprawled on the basement steps. He stares upwards for a moment, his eyes wide, and still looking shocked, he gazes around the concourse and spots the maintenance man emptying the trash can on the far side.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Immediately ahead, the gigantic, luminous disk of the depot clock towers as individuals hurry across the promenade in the rays of frigid argent illumination from lights high above in the roof. Uniformly ashen against the ashen floor and walls, David descends the rock stairway and stands at the base of the steps in a baseball cap and rain cloak, observing humanity flow and ebb. He begins to stride leisurely through the throng when a young fair-haired woman in a vivid crimson jacket collides with him. He then perceives, observing from above, the same woman in an alternate gleaming jacket in a jewelry store. She gestures at an aged clerk, and as his back is turned, she reaches over the counter, grabs a bracelet, and drops it into her purse. David watches her vanish into the multitude and then moves gradually on, with other individuals passing and some brushing against him. He halts in the center of the concourse, people whirling around him, and holds his left hand out slightly, fingers outstretched, as a man in a plaid shirt worn outside his trousers grazes David's extended hand. Once again, he's gazing down from high above, watching the man in the plaid shirt lean out of a pickup truck and smash a bottle over the head of a black woman ambling along a city avenue at night. Scowling, David observes the man drain a beer can and drop it into a trash receptacle. A young male in a green shirt kneels by a bed where a young female in a very short party dress is sprawled. She rolls over, unhearing, the dress exposing her thighs. The boy observes for a moment, rises, and the girl's leg slips off the bed as she lies on her side, blonde hair spread over a variety of coats, motionless. The boy departs, closing the door behind him. David turns and examines the station as a group of college students, all wearing maroon baseball caps, marches past him. He looks beyond them and perceives the young male in a green jacket hug his mother and turn to grin at his father. David observes, begins to walk backwards, swallowing hard, and glancing at other individuals as they pass by, backing into a maintenance worker in orange coveralls pushing a trash receptacle on wheels. A man opens his front door to the maintenance worker now in an orange T-shirt, and the two men gaze at each other through the outer fly screen door. The maintenance worker grabs the door and holds it ajar while David sees an image of the house proprietor sprawled on the basement steps. He gazes upwards for a moment, his eyes wide, and still appearing stunned, he gazes around the concourse and spots the maintenance worker emptying the trash receptacle on the distant side."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Directly ahead, the enormous, bright disk of the station clock is loomed over by the people scurrying across the concourse in the beams of cold silver light from lamps high above in the ceiling. Uniformly grey against the grey floor and walls, the stone staircase is descended by David, who stands at the foot of the stairs in a baseball cap and rain cape, watching humanity ebb and flow. He is started by the crowd, walking unhurriedly through it, when he is bumped into by a young blonde woman in a bright red jacket. David then sees, watching from above, the same woman in a different shiny jacket in a jewelry shop. An elderly assistant is pointed at by her, and as his back turns, the counter is reached over, a bracelet is taken, and it is dropped into her bag. The woman is watched by David as she disappears into the crowd, and then he is moved slowly on, with other people passing and some touching him. In the middle of the concourse, he is stopped by the swirling people and holds his left hand out slightly, fingers extended, as a man in a check shirt worn outside his trousers brushes into David's extended hand. Once again, from high above, he looks down, watching the man in the check shirt lean out of a pickup and smash a bottle over the head of a black woman strolling along a city street at night. Frowning, the man is seen by David as he drains a beer can and drops it into a trash bin. By a bed, a young man in a green shirt kneels where a young woman in a very short party dress is sprawled. She is rolled over, unhearing, the dress revealing her thighs. For a moment, the boy watches, rises, and the girl's leg is slipped off the bed as she lies on her side, blonde hair spread over an assortment of coats, unmoving. Behind him, the door is closed by the boy as he leaves. The station is turned to and looked around by David as past him files a group of college students, all wearing maroon baseball caps. Beyond them, he is looked by him, and he sees the young man in a green jacket embrace his mother and turn to smile at his father. Watching is done by David, who starts to walk backwards, swallowing hard, and glancing at other people as they pass by, backing into a maintenance man in orange overalls pushing a trash bin on wheels. The front door is opened by a man to the maintenance man now in an orange T-shirt, and the two men stare at each other through the outer fly screen door. The door is grabbed by the maintenance man and held open while an image of the house owner sprawled on the basement steps is seen by David. Upwards he stares for a moment, his eyes wide, and still looking shocked, the concourse is gazed around by him and the maintenance man is spotted emptying the trash can on the far side."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Ahead, the large, bright station clock looms as people hurry across the concourse under cold silver light from ceiling lamps. Grey against the grey surroundings, David descends the stone staircase, wearing a baseball cap and rain cape, observing the crowd. He walks slowly when a young blonde woman in a red jacket bumps into him. Later, he sees her in a different shiny jacket at a jewelry shop, pointing at an elderly assistant. As his back turns, she takes a bracelet and drops it into her bag, disappearing into the crowd. David moves on, people brushing past him. He stops, extending his hand, as a man in a check shirt brushes against it. Watching from above, David sees the man in the check shirt smash a bottle over a black woman's head on a city street at night. Frowning, David sees the man discard a beer can. A young man in a green shirt kneels by a bed where a woman in a short dress lies. She rolls over, revealing her thighs, and the boy leaves, closing the door. David turns, observing college students in maroon caps pass by. He sees the young man in a green jacket embrace his mother and smile at his father. David walks backward, swallowing hard, bumping into a maintenance man in orange overalls pushing a trash bin. A man opens his door to the maintenance man in an orange T-shirt, and they stare through the fly screen door. The maintenance man holds the door open as David envisions the house owner sprawled on basement steps. Shocked, he looks around the concourse, spotting the maintenance man emptying a trash can."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Ahead, the large station clock looms as people hurry across the concourse under cold silver light from ceiling lamps. Grey against the grey surroundings, David descends the stone staircase, wearing a baseball cap and rain cape, observing the crowd. He walks slowly when a young blonde woman in a red jacket bumps into him. Later, he sees her in a different shiny jacket at a jewelry shop, stealing a bracelet. David watches her vanish into the crowd and moves on, people brushing past him. He stops, extends his hand, and a man in a check shirt brushes it. Observing from above, David sees the man smash a bottle over a black woman's head at night. Frowning, he watches the man discard a beer can. A young man in a green shirt kneels by a bed where a woman in a short dress lies. She rolls over, revealing her thighs, and the boy leaves, closing the door. David turns, sees college students in maroon caps pass by, and notices the young man in a green jacket embrace his mother. David walks backward, bumping into a maintenance man in orange overalls. A man opens his door to the maintenance man in an orange T-shirt, and they stare through the screen door. The maintenance man holds the door open as David envisions the house owner sprawled on basement steps. Shocked, he looks around the concourse and sees the maintenance man emptying a trash can."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Directly ahead, the enormous and bright disk of the station clock looms prominently, casting its presence over the bustling scene as people scurry across the expansive concourse. They move swiftly in the beams of cold, silver light emanating from the lamps positioned high above in the ceiling. Uniformly grey against the similarly grey floor and walls, David descends the stone staircase with a steady pace and stands at the foot of the stairs. He is wearing a baseball cap and a rain cape, observing the ebb and flow of humanity around him. He begins to walk unhurriedly through the crowd when a young blonde woman, dressed in a strikingly bright red jacket, accidentally bumps into him. Shortly thereafter, he notices the same woman, now clad in a different shiny jacket, inside a jewelry shop, watching from above. She points at an elderly assistant, and as his back is turned, she reaches over the counter, stealthily takes a bracelet, and discreetly drops it into her bag. David watches her as she disappears into the crowd and then moves slowly onward, with other people passing by and some brushing against him. He comes to a stop in the middle of the concourse, people swirling around him like a river, and holds his left hand out slightly, fingers extended. A man in a checkered shirt, worn outside his trousers, brushes into David's extended hand. Once again, David finds himself looking down from high above, observing the man in the checkered shirt as he leans out of a pickup truck and violently smashes a bottle over the head of a black woman who is strolling along a city street at night. Frowning deeply, David sees the man drain a beer can and carelessly drop it into a trash bin. Nearby, a young man in a green shirt kneels by a bed where a young woman in a very short party dress is sprawled. She rolls over, unhearing, the dress revealing her thighs. The boy watches for a moment, then rises, and as he does, the girl's leg slips off the bed as she lies on her side, her blonde hair spread over an assortment of coats, unmoving. The boy leaves, closing the door quietly behind him. David turns and looks around the station as a group of college students, all wearing maroon baseball caps, files past him in an orderly manner. He looks beyond them and sees the young man in a green jacket embrace his mother warmly and then turn to smile at his father. David watches this scene unfold, starts to walk backwards, swallowing hard, and glancing at other people as they pass by, inadvertently backing into a maintenance man dressed in orange overalls who is pushing a trash bin on wheels. A man opens his front door to the maintenance man, now in an orange T-shirt, and the two men stare at each other through the outer fly screen door. The maintenance man grabs the door and holds it open while David envisions an image of the house owner sprawled on the basement steps. He stares upwards for a moment, his eyes wide with shock, and still looking stunned, he gazes around the concourse and spots the maintenance man emptying the trash can on the far side."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Directly in front of him, the enormous, brilliantly illuminated disk of the station clock looms prominently, casting its presence over the bustling scene as people scurry energetically across the expansive, open concourse. They move with a sense of urgency, swiftly navigating the beams of cold, silvery light that emanate from the lamps positioned high above in the lofty ceiling. Against this uniformly grey backdrop of similarly grey floors and walls, David descends the solid stone staircase with a steady, deliberate pace until he reaches the foot of the stairs. He is donning a casual baseball cap along with a practical rain cape, all the while observing the constant ebb and flow of humanity swirling around him. He begins to walk unhurriedly through the crowd when a young woman with striking blonde hair, dressed in a remarkably bright red jacket, accidentally bumps into him. Just moments later, he catches sight of the same young woman, now clad in a noticeably different shiny jacket, within a jewelry shop, observing from above with a watchful eye. She points discreetly at an elderly assistant, and as his back is turned, she reaches over the counter with a deft movement, stealthily taking a bracelet and discreetly dropping it into her bag. David watches her as she disappears seamlessly into the crowd, then moves slowly onward, with other people passing by and occasionally brushing against him. He eventually comes to a stop in the middle of the busy concourse, as people swirl around him like a mighty river, while he holds his left hand out slightly, fingers extended. A man in a checkered shirt, which is worn casually outside his trousers, brushes into David's outstretched hand. Once again, David finds himself looking down from a high vantage point, observing the same man in the checkered shirt as he leans aggressively out of a pickup truck and violently smashes a bottle over the head of a black woman who is strolling along a city street at night. Frowning deeply, David perceives the man draining a beer can and carelessly discarding it into a trash bin. Nearby, a young man clad in a green shirt kneels beside a bed where a young woman dressed in an extremely short party dress is sprawled. The woman rolls over, unhearing, the dress revealing her thighs. The boy watches for a brief moment, then rises, and as he stands, the girl's leg slips off the bed as she lies on her side, with her blonde hair spread widely over an assortment of coats, unmoving. The boy departs, closing the door quietly behind him. David turns and looks around the station as a group of college students, all wearing maroon baseball caps, files past him in a neat, orderly manner. He looks beyond them and sees the young man in a green jacket warmly embracing his mother before turning to share a smile with his father. David watches this touching scene unfold, starts to walk backwards, swallowing hard and glancing at other people as they pass by, inadvertently backing into a maintenance man dressed in bright orange overalls who is pushing a trash bin on wheels. A man opens his front door to the maintenance man, now attired in an orange T-shirt, and the two men lock eyes, staring at each other through the outer fly screen door. The maintenance man grabs the door, holding it open while David envisions a disturbing image of the house owner sprawled awkwardly on the basement steps. He stares upwards for a prolonged moment, his eyes wide with shock, and still looking visibly stunned, he gazes around the concourse and spots the maintenance man emptying the trash can on the far side."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Directly ahead, the enormous, bright disk of the station clock looms prominently, casting its presence over the bustling scene as people scurry across the concourse, their movements illuminated by the cold silver light streaming from the lamps positioned high above in the ceiling. Against the uniformly grey backdrop of the floor and walls, David, clad in a baseball cap and rain cape, descends the stone staircase with deliberate steps, each footfall echoing slightly until he reaches the bottom. There, he pauses momentarily at the foot of the stairs, taking in the ebb and flow of humanity around him. He begins to walk unhurriedly through the crowd, his pace steady and measured, when suddenly a young blonde woman in a bright red jacket collides with him, momentarily disrupting his path. As he regains his composure, he notices the same woman, now wearing a different shiny jacket, from a vantage point above, as she stands in a jewelry shop. He observes her as she points at an elderly assistant, and while the assistant's back is turned, she deftly reaches over the counter, takes a bracelet, and discreetly drops it into her bag before vanishing into the crowd. David watches her disappear, then resumes his slow movement through the throng, feeling the occasional brush of other people passing by. He comes to a halt in the middle of the concourse, surrounded by the swirling mass of commuters, and extends his left hand slightly, fingers splayed, just as a man in a check shirt worn outside his trousers brushes against David's outstretched hand. In an instant, David's perspective shifts, and he finds himself observing from high above as the man in the check shirt leans out of a pickup truck and violently smashes a bottle over the head of a black woman who is strolling along a city street at night. Frowning, David watches the man drain a beer can and casually discard it into a trash bin. His attention then shifts to a young man in a green shirt who kneels by a bed where a young woman in a very short party dress is sprawled. She rolls over, unhearing, the movement causing her dress to reveal her thighs. The boy watches her for a moment, then rises, and as he leaves, the girl's leg slips off the bed, her blonde hair fanning out over an assortment of coats, unmoving. The boy exits, closing the door quietly behind him. Back in the station, David turns and surveys his surroundings as a group of college students, all wearing maroon baseball caps, files past him in an orderly line. His gaze shifts beyond them, and he spots the young man in a green jacket warmly embracing his mother before turning to smile at his father. David watches this familial scene unfold, then begins to walk backwards, swallowing hard and casting glances at the people passing by, inadvertently backing into a maintenance man in orange overalls who is pushing a trash bin on wheels. In a sudden shift, a man opens his front door to the maintenance man, now dressed in an orange T-shirt, and the two men lock eyes through the outer fly screen door. The maintenance man seizes the door and holds it open, while David envisions the house owner sprawled on the basement steps. He stares upwards for a moment, his eyes wide with shock, and still looking stunned, he scans the concourse once more, eventually spotting the maintenance man emptying the trash can on the far side."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "David descends the stone staircase into the station concourse, blending into the grey surroundings in his baseball cap and rain cape. He observes the bustling crowd under the cold silver light from overhead lamps. As he begins to walk through the throng, a young blonde woman in a bright red jacket collides with him. He then notices her again, now in a different shiny jacket, stealing a bracelet from a jewelry shop. She vanishes into the crowd, and David continues moving slowly, occasionally brushed by passersby. He pauses in the concourse, extending his hand as a man in a check shirt brushes against it. From a higher vantage point, David sees this man later assault a woman on a city street at night, then discard a beer can into a trash bin. Meanwhile, a young man in a green shirt kneels by a bed where a woman in a short party dress lies, then leaves as she remains unmoving. Back in the station, David observes a group of college students in maroon baseball caps pass by, and beyond them, the young man in the green jacket embraces his parents. David begins to walk backward, swallowing hard, and accidentally backs into a maintenance man in orange overalls. He then envisions the maintenance man at a house, holding open a door as the homeowner lies sprawled on basement steps. Returning to the present, David spots the maintenance man emptying a trash can across the concourse."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Directly ahead, the enormous, bright disk of the station clock, a historic piece installed in the 1920s to symbolize the station's pivotal role in city life, looms as people scurry across the concourse in the beams of cold silver light from lamps high above in the ceiling. Uniformly grey against the grey floor and walls of this bustling transportation hub, David descends the stone staircase and stands at the foot of the stairs in a baseball cap and rain cape, his attire suggesting a blend of utility and disguise, watching humanity ebb and flow. He starts to walk unhurriedly through the crowd when a young blonde woman in a bright red jacket, reminiscent of those worn by high fashion models in recent city parades, bumps into him. He then sees, watching from above, the same woman in a different shiny jacket browsing a jewelry shop renowned for its high-security systems. She points at an elderly assistant, and as his back is turned, she reaches over the counter, takes a bracelet crafted by a celebrated local artisan, and drops it into her bag. David watches her disappear into the crowd of commuters and then moves slowly on, with other people passing and some touching him. He stops in the middle of the concourse, people swirling around him in a fluid tide, and holds his left hand out slightly, fingers extended, as a man in a check shirt worn outside his trousers brushes into David's extended hand. Once again, he's looking down from high above, watching the man in the check shirt lean out of a pickup, an old model popular in rural areas, and smash a bottle over the head of a black woman strolling along a city street at night, an act of violence that echoes recent reports of rising urban tensions. Frowning, David sees the man drain a beer can and drop it into a trash bin, oblivious to the environmental impact of littering. A young man in a green shirt kneels by a bed where a young woman in a very short party dress, reminiscent of those worn at late-night clubs in the entertainment district, is sprawled. She rolls over, unhearing, the dress revealing her thighs. The boy watches for a moment, rises, and the girl's leg slips off the bed as she lies on her side, blonde hair spread over an assortment of coats, unmoving. The boy leaves, closing the door behind him quietly, as if to conceal the aftermath of a wild night. David turns and looks around the station as a group of college students, all wearing maroon baseball caps, a color denoting their allegiance to a well-known local university, files past him. He looks beyond them and sees the young man in a green jacket embrace his mother in a gesture of familial affection and turn to smile at his father, whose eyes reflect pride. David watches, starts to walk backwards, swallowing hard, and glancing at other people as they pass by, backing into a maintenance man in orange overalls pushing a trash bin on wheels, part of the station's efficient waste management system. A man opens his front door, revealing a maintenance man now in an orange T-shirt, and the two men stare at each other through the outer fly screen door designed to keep insects out. The maintenance man grabs the door and holds it open while David sees an image of the house owner sprawled on the basement steps, a potentially perilous fall. He stares upwards for a moment, his eyes wide, and still looking shocked, he gazes around the concourse and spots the maintenance man emptying the trash can on the far side with a methodical routine."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Directly ahead the enormous bright disk of the station clock looms as people scurry across the concourse in the beams of cold silver light from lamps high above in the ceiling. Uniformly grey against the grey floor and walls. David descends the stone staircase and stands at the foot of the stairs in a baseball cap and rain cape watching humanity ebb and flow. He starts to walk unhurriedly through the crowd when a young blonde woman in a bright red jacket bumps into him. He then sees watching from above the same woman in a different shiny jacket in a jewelry shop. She points at an elderly assistant and as his back is turned she reaches over the counter takes a bracelet and drops it into her bag. David watches her disappear into the crowd and then moves slowly on with other people passing and some touching him. He stops in the middle of the concourse people swirling around him and holds his left hand out slightly fingers extended as a man in a check shirt worn outside his trousers brushes into David's extended hand. Once again he is looking down from high above watching the man in the check shirt lean out of a pickup and smash a bottle over the head of a black woman strolling along a city street at night. Frowning. David sees the man drain a beer can and drop it into a trash bin. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. A young man in a green shirt kneels by a bed where a young woman in a very short party dress is sprawled. She rolls over unhearing the dress revealing her thighs. The boy watches for a moment rises and the girl's leg slips off the bed as she lies on her side. blonde hair spread over an assortment of coats unmoving. The boy leaves closing the door behind him. David turns and looks around the station as a group of college students all wearing maroon baseball caps files past him. He looks beyond them and sees the young man in a green jacket embrace his mother and turn to smile at his father. David watches starts to walk backwards swallowing hard and glancing at other people as they pass by backing into. a maintenance man in orange overalls pushing a trash bin on wheels. A man opens his front door to the maintenance man now in an orange Tshirt and the two men stare at each other through the outer fly screen door. The maintenance man grabs the door and holds it open while David sees an image of the house owner sprawled on the basement steps He stares upwards for a moment his eyes wide and still looking shocked. he gazes around the concourse and spots the maintenance man emptying the trash can on the far side."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Directly ahead the enormous bright disk of the station clock looms as people scurry across the concourse in the beams of cold silver light from lamps high above in the ceiling. Uniformly grey against the grey floor and walls. David descends the stone staircase and stands at the foot of the stairs in a baseball cap and rain cape watching humanity ebb and flow. He starts to walk unhurriedly through the crowd when a young blonde woman in a bright red jacket bumps into him. He then sees watching from above the same woman in a different shiny jacket in a jewelry shop. She points at an elderly assistant and as his back is turned she reaches over the counter takes a bracelet and drops it into her bag. David watches her disappear into the crowd and then moves slowly on with other people passing and some touching him. He stops in the middle of the concourse people swirling around him and holds his left hand out slightly fingers extended as a man in a check shirt worn outside his trousers brushes into David's extended hand. Once again he is looking down from high above watching the man in the check shirt lean out of a pickup and smash a bottle over the head of a black woman strolling along a city street at night. Frowning. David sees the man drain a beer can and drop it into a trash bin. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. A young man in a green shirt kneels by a bed where a young woman in a very short party dress is sprawled. She rolls over unhearing the dress revealing her thighs. The boy watches for a moment rises and the girl's leg slips off the bed as she lies on her side. blonde hair spread over an assortment of coats unmoving. The boy leaves closing the door behind him. David turns and looks around the station as a group of college students all wearing maroon baseball caps files past him. He looks beyond them and sees the young man in a green jacket embrace his mother and turn to smile at his father. David watches starts to walk backwards swallowing hard and glancing at other people as they pass by backing into. a maintenance man in orange overalls pushing a trash bin on wheels. A man opens his front door to the maintenance man now in an orange Tshirt and the two men stare at each other through the outer fly screen door. The maintenance man grabs the door and holds it open while David sees an image of the house owner sprawled on the basement steps He stares upwards for a moment his eyes wide and still looking shocked. he gazes around the concourse and spots the maintenance man emptying the trash can on the far side."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Directly ahead the enormous bright disk of the station clock looms as people scurry across the concourse in the beams of cold silver light from lamps high above in the ceiling. Uniformly grey against the grey floor and walls. David descends the stone staircase and stands at the foot of the stairs in a baseball cap and rain cape watching humanity ebb and flow. He starts to walk unhurriedly through the crowd when a young blonde woman in a bright red jacket bumps into him. He then sees watching from above the same woman in a different shiny jacket in a jewelry shop. She points at an elderly assistant and as his back is turned she reaches over the counter takes a bracelet and drops it into her bag. He looks beyond them and sees the young man in a green jacket embrace his mother and turn to smile at his father. David watches starts to walk backwards swallowing hard and glancing at other people as they pass by backing into. a maintenance man in orange overalls pushing a trash bin on wheels. A man opens his front door to the maintenance man now in an orange Tshirt and the two men stare at each other through the outer fly screen door. The maintenance man grabs the door and holds it open while David sees an image of the house owner sprawled on the basement steps He stares upwards for a moment his eyes wide and still looking shocked. he gazes around the concourse and spots the maintenance man emptying the trash can on the far side."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Directly ahead the enormous bright disk of the station clock looms as people scurry across the concourse in the beams of cold silver light from lamps high above in the ceiling. Uniformly grey against the grey floor and walls. A man opens his front door to the maintenance man now in an orange Tshirt and the two men stare at each other through the outer fly screen door. The maintenance man grabs the door and holds it open while David sees an image of the house owner sprawled on the basement steps He stares upwards for a moment his eyes wide and still looking shocked. he gazes around the concourse and spots the maintenance man emptying the trash can on the far side."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Directly ahead, the colossal, glowing sphere of the garden lantern towers as cats prance across the meadow in the rays of warm golden sunshine from clouds low down in the horizon. Uniformly blue against the blue grass and hedges, Lucy ascends the wooden ladder and sits at the top of the ladder in a straw hat and windbreaker, observing wildlife flow and pause. She starts to swim hurriedly through the leaves when an elderly brunette gentleman in a bright green vest brushes past her. She then notices, gazing from below, the same man in a different faded vest in a bakery. He gestures at a young customer, and as her back is turned, he reaches under the table, snatches a pie, and slips it into his satchel. Lucy observes him vanish into the foliage and then moves quickly on, with other creatures buzzing and some landing on her. She pauses in the center of the meadow, insects flitting around her, and raises her right foot slightly, toes wiggling, as a child in a striped scarf wrapped around his waist stumbles into Lucy's raised foot. Once more, she's peering up from far below, observing the child in the striped scarf lean out of a helicopter and hurl a cushion over the back of a white man jogging across a boardwalk at noon. Smiling, Lucy watches the child sip a milkshake and toss it into a recycling bin. An old woman in a white dress stands by a chair where an old man in a very loose tuxedo is sitting. He shifts, whispering, the tuxedo revealing his ankles. The woman stares for a moment, sits, and the man's foot slips off the chair as he leans on his back, dark hair draped over a pile of newspapers, undisturbed. The woman departs, locking the window behind her. Lucy twists and surveys the garden as a troop of kindergarten children, all sporting blue straw hats, shuffles past her. She observes beyond them and notices the old woman in a white blouse hug her father and turn to wave at her sister. Lucy observes, starts to dance sideways, breathing deeply, and watching other creatures as they flutter by, dancing into a gardener in purple boots pulling a wheelbarrow full of books. A dog opens its kennel door to the gardener now in a purple apron, and the two creatures glare at each other through the inner mesh fence. The gardener shoves the fence and keeps it open while Lucy envisions an image of the cat sprawled on the porch swing. She glances downwards for a moment, her eyes narrowing, and still appearing thoughtful, she scans the meadow and notices the gardener rearranging the compost heap on the opposite edge."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ahead, the large, bright station clock dominates as people hurry under the cold silver light. David, clad in a baseball cap and rain cape, stands at the stair foot, observing the bustling crowd. As he moves leisurely, a blonde woman in a red jacket bumps into him. Later, she steals a bracelet from a jewelry shop. David witnesses another scene: a man in a check shirt attacks a woman on the street. Frowning, David watches a young man by a girl's bed and sees the young man with his parents later. He backs into a maintenance man. The scene shifts to a house where the maintenance man holds open a screen door. David envisions the homeowner sprawled on the basement steps and turns back to see the maintenance man emptying a trash can."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "he gazes around the concourse and spots the maintenance man emptying the trash can on the far side The maintenance man grabs the door and holds it open while David sees an image of the house owner sprawled on the basement steps He stares upwards for a moment his eyes wide and still looking shocked  A man opens his front door to the maintenance man now in an orange Tshirt and the two men stare at each other through the outer fly screen door  a maintenance man in orange overalls pushing a trash bin on wheels  David watches starts to walk backwards swallowing hard and glancing at other people as they pass by backing into  He looks beyond them and sees the young man in a green jacket embrace his mother and turn to smile at his father  David turns and looks around the station as a group of college students all wearing maroon baseball caps files past him  The boy leaves closing the door behind him  blonde hair spread over an assortment of coats unmoving  The boy watches for a moment rises and the girl's leg slips off the bed as she lies on her side  She rolls over unhearing the dress revealing her thighs  A young man in a green shirt kneels by a bed where a young woman in a very short party dress is sprawled  David sees the man drain a beer can and drop it into a trash bin  Frowning  Once again he's looking down from high above watching the man in the check shirt lean out of a pickup and smash a bottle over the head of a black woman strolling along a city street at night  He stops in the middle of the concourse people swirling around him and holds his left hand out slightly fingers extended as a man in a check shirt worn outside his trousers brushes into David's extended hand  David watches her disappear into the crowd and then moves slowly on with other people passing and some touching him  She points at an elderly assistant and as his back is turned she reaches over the counter takes a bracelet and drops it into her bag  He then sees watching from above the same woman in a different shiny jacket in a jewelry shop  He starts to walk unhurriedly through the crowd when a young blonde woman in a bright red jacket bumps into him  David descends the stone staircase and stands at the foot of the stairs in a baseball cap and rain cape watching humanity ebb and flow  Uniformly grey against the grey floor and walls  Directly ahead the enormous bright disk of the station clock looms as people scurry across the concourse in the beams of cold silver light from lamps high above in the ceiling "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Uniformly grey against the grey floor and walls Directly ahead the enormous bright disk of the station clock looms as people scurry across the concourse in the beams of cold silver light from lamps high above in the ceiling He starts to walk unhurriedly through the crowd when a young blonde woman in a bright red jacket bumps into him David descends the stone staircase and stands at the foot of the stairs in a baseball cap and rain cape watching humanity ebb and flow She points at an elderly assistant and as his back is turned she reaches over the counter takes a bracelet and drops it into her bag He then sees watching from above the same woman in a different shiny jacket in a jewelry shop He stops in the middle of the concourse people swirling around him and holds his left hand out slightly fingers extended as a man in a check shirt worn outside his trousers brushes into David's extended hand David watches her disappear into the crowd and then moves slowly on with other people passing and some touching him Frowning Once again he is looking down from high above watching the man in the check shirt lean out of a pickup and smash a bottle over the head of a black woman strolling along a city street at night A young man in a green shirt kneels by a bed where a young woman in a very short party dress is sprawled David sees the man drain a beer can and drop it into a trash bin The boy watches for a moment rises and the girl's leg slips off the bed as she lies on her side She rolls over unhearing the dress revealing her thighs The boy leaves closing the door behind him blonde hair spread over an assortment of coats unmoving He looks beyond them and sees the young man in a green jacket embrace his mother and turn to smile at his father David turns and looks around the station as a group of college students all wearing maroon baseball caps files past him a maintenance man in orange overalls pushing a trash bin on wheels David watches starts to walk backwards swallowing hard and glancing at other people as they pass by backing into The maintenance man grabs the door and holds it open while David sees an image of the house owner sprawled on the basement steps He stares upwards for a moment his eyes wide and still looking shocked A man opens his front door to the maintenance man now in an orange Tshirt and the two men stare at each other through the outer fly screen door he gazes around the concourse and spots the maintenance man emptying the trash can on the far side"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She rolls over unhearing the dress revealing her thighs  The boy watches for a moment rises and the girl's leg slips off the bed as she lies on her side  blonde hair spread over an assortment of coats unmoving  The boy leaves closing the door behind him  David turns and looks around the station as a group of college students all wearing maroon baseball caps files past him  He looks beyond them and sees the young man in a green jacket embrace his mother and turn to smile at his father  David watches starts to walk backwards swallowing hard and glancing at other people as they pass by backing into  a maintenance man in orange overalls pushing a trash bin on wheels  A man opens his front door to the maintenance man now in an orange Tshirt and the two men stare at each other through the outer fly screen door  The maintenance man grabs the door and holds it open while David sees an image of the house owner sprawled on the basement steps He stares upwards for a moment his eyes wide and still looking shocked  he gazes around the concourse and spots the maintenance man emptying the trash can on the far side Directly ahead the enormous bright disk of the station clock looms as people scurry across the concourse in the beams of cold silver light from lamps high above in the ceiling  Uniformly grey against the grey floor and walls  David descends the stone staircase and stands at the foot of the stairs in a baseball cap and rain cape watching humanity ebb and flow  He starts to walk unhurriedly through the crowd when a young blonde woman in a bright red jacket bumps into him  He then sees watching from above the same woman in a different shiny jacket in a jewelry shop  She points at an elderly assistant and as his back is turned she reaches over the counter takes a bracelet and drops it into her bag  David watches her disappear into the crowd and then moves slowly on with other people passing and some touching him  He stops in the middle of the concourse people swirling around him and holds his left hand out slightly fingers extended as a man in a check shirt worn outside his trousers brushes into David's extended hand  Once again he's looking down from high above watching the man in the check shirt lean out of a pickup and smash a bottle over the head of a black woman strolling along a city street at night  Frowning  David sees the man drain a beer can and drop it into a trash bin  A young man in a green shirt kneels by a bed where a young woman in a very short party dress is sprawled "
        }
      ]
    }
  ]
}