{
  "ground_truth": "David follows the man as he pushes his wheelie bin around a corner and along a dimly lit corridor. A couple of people are lounging listlessly against the wall. David stands gazing at the door, seeing shadows of people passing back and forth inside through frosted glass panels. The door opens and the maintenance man reappears, wearing a cap and with a bag slung across his body. The man walks at a steady pace along a dark street lined with cars, and up a long stairway lit by tall bright lamps on alternate sides. David follows him with the hood of his cape up against the teeming rain. At the top of the stairs, he waits and watches. The man continues up a street on a gentle incline, where large houses are set back from the road, and turns and walks up the path to a detached house with a mature tree in the front garden. He stops in the porch, looks up and down the street, takes something from beside the porch, and disappears into the shadows around the side of the house. David drops his head, staring down at the ground. The shadow from his hood obscures all his face but a triangle from his nose to his mouth. He lifts his head and looks towards the house. Two strips of light appear and very slowly widen as a door opens. The spreading light falls on mail scattered over a tiled floor, and on clothes strewn on the floor further inside. Water drips from a cape onto a pair of shoes. David stands silhouetted in the doorway. Lights are on inside the house. Beyond three open doorways, David can see a staircase. He stops in the doorway, and slowly turns back. He takes a step back into a dark lobby, looking to his left, and reaches forward to open another door. He looks around and switches on a light. The house owner is lying head down on the basement steps, and David sees again the maintenance man's violent entry into the house. David closes the door and moves slowly into the next room, which has half paneled walls. He passes a chair at the end of a table, which suggests it's the dining room. The next room has easy chairs, a sitting room. Light from a television flickers and he glances towards it. He stops before moving into the hallway. David's shadow grows larger on the wall at the top of the stairs as he climbs them. He peers through the crack of a partly open door. Frowning, he steps forward and pushes it open wider, and flicks on the light. He steps into a child's bedroom with pop posters on the wall.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "David trails the man as he shoves his wheeled bin around a bend and along a poorly illuminated hallway. A pair of individuals are reclining languidly against the partition. David stands staring at the entrance, noticing silhouettes of individuals moving to and fro inside through opaque glass panes. The entrance opens and the repairman reemerges, donning a hat and with a sack draped over his torso. The man strides at a consistent rhythm along a gloomy road bordered with automobiles, and up an extended staircase illuminated by tall glowing lanterns on alternating sides. David shadows him with the hood of his cloak raised against the pouring rainfall. At the summit of the steps, he pauses and observes. The man proceeds up a road on a slight slope, where sizable dwellings are positioned away from the street, and turns and proceeds up the walkway to a separate house with a mature tree in the front yard. He halts in the portico, glances up and down the avenue, retrieves something from beside the entryway, and vanishes into the gloom around the flank of the residence. David lowers his gaze, peering downward at the surface. The silhouette from his hood conceals all his visage but a triangle from his nose to his lips. He raises his gaze and peers toward the dwelling. Two slivers of illumination emerge and very gradually broaden as an entrance opens. The expanding brightness illuminates correspondence scattered over a tiled surface, and apparel strewn on the floor farther within. Liquid drips from a cloak onto a set of footwear. David stands outlined in the threshold. Illumination is present within the residence. Beyond three ajar doorways, David can view a staircase. He halts in the threshold, and gradually rotates backward. He takes a stride rearward into a shadowy foyer, glancing to his left, and extends a hand to open an additional entrance. He surveys and activates a light. The homeowner is sprawled face down on the cellar stairs, and David recalls the repairman’s forceful intrusion into the dwelling. David shuts the entrance and proceeds gradually into the subsequent chamber, which has partially paneled walls. He moves past a seat at the end of a counter, which implies it's the eating area. The following chamber contains cushioned seats, a lounge. Radiance from a television dances and he looks toward it. He halts before entering the corridor. David’s silhouette expands on the wall at the summit of the stairs as he ascends them. He peers through the gap of a slightly ajar entrance. Scowling, he advances and nudges it open wider, and switches on the light. He enters a child’s sleeping quarters with pop music posters on the partition."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "David is followed by the man as the wheelie bin is pushed by him around a corner and along a dimly lit corridor. A couple of people lounge listlessly against the wall. The door is gazed at by David, who sees shadows of people passing back and forth inside through frosted glass panels. The door is opened and the maintenance man reappears, wearing a cap and with a bag slung across his body. A steady pace is walked by the man along a dark street lined with cars, and a long stairway lit by tall bright lamps on alternate sides is climbed. David has the hood of his cape up against the teeming rain while he follows him. At the top of the stairs, waiting and watching are done by him. The man continues up a street on a gentle incline, where large houses set back from the road are located, and a path to a detached house with a mature tree in the front garden is walked up by him. The porch is stopped in by him, looking up and down the street, taking something from beside the porch, and disappearing into the shadows around the side of the house. David's head drops, with his stare directed down at the ground. A triangle from his nose to his mouth is all of his face not obscured by the shadow from his hood. His head is lifted and the house is looked towards by him. Two strips of light appear and very slowly widen as a door is opened. The spreading light falls on mail scattered over a tiled floor and on clothes strewn on the floor further inside. A cape drips water onto a pair of shoes. The doorway silhouettes David. The house has lights on inside. Beyond three open doorways, a staircase can be seen by David. The doorway is stopped in by him, and a slow turn back is made. A step back into a dark lobby is taken by him, looking to his left, and another door is reached for and opened. Looking around and switching on a light is done by him. The house owner lies head down on the basement steps, and again the maintenance man's violent entry into the house is seen by David. The door is closed by him and a slow movement into the next room, which has half-paneled walls, is made. A chair at the end of a table is passed by him, suggesting it's the dining room. The next room contains easy chairs, a sitting room. Light from a television flickers and it is glanced towards by him. He stops before moving into the hallway. David's shadow grows larger on the wall at the top of the stairs as they are climbed by him. The crack of a partly open door is peered through by him. Frowning, he steps forward, opens it wider, and the light is flicked on. A step is taken by him into a child's bedroom with pop posters on the wall."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "David follows the man pushing a wheelie bin around a corner into a dim corridor. A couple of people lounge listlessly against the wall. David gazes at the door, seeing shadows through frosted glass. The maintenance man reappears, wearing a cap and a bag. He walks steadily along a dark street lined with cars, up a stairway lit by tall lamps. David follows, hood up against the rain. At the top, he watches as the man continues up a gently sloping street with large houses, turning up a path to a detached house with a mature tree. He stops in the porch, looks around, takes something, and disappears into the shadows. David lowers his head, his hood shadowing his face except for a triangle from nose to mouth. He looks at the house as light widens from an opening door, illuminating scattered mail and clothes. Water drips from his cape onto shoes. David stands silhouetted in the doorway, lights on inside. Beyond three open doorways, he sees a staircase. He pauses, turns back, steps into a dark lobby, and opens another door, switching on a light. The house owner lies head down on basement steps, recalling the maintenance man's violent entry. David closes the door, moves into the next room with half-paneled walls, passing a dining table. The next room, a sitting room, has flickering TV light. He stops before the hallway. David's shadow grows on the wall as he climbs the stairs. He peers through a partly open door, frowns, pushes it wider, and turns on the light, stepping into a child's bedroom with pop posters."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "David follows a man pushing a wheelie bin around a corner into a dim corridor, where a couple of people lounge against the wall. David watches shadows through frosted glass. The maintenance man, wearing a cap and bag, exits and walks steadily along a dark, car-lined street and up a lamp-lit stairway. David follows, hood up against the rain. At the top, he watches the man continue up a gently sloping street with large houses, stopping at a detached house with a mature tree. The man checks the street, takes something from the porch, and vanishes into the shadows. David, hood shadowing his face, looks at the house. Light widens from a door, illuminating scattered mail and clothes. Water drips from David's cape as he stands silhouetted in the doorway, seeing lights and a staircase inside. He steps back into a dark lobby, opens another door, and switches on a light. The house owner lies on the basement steps, recalling the maintenance man's violent entry. David moves into a half-paneled dining room, then a sitting room with flickering TV light. He stops in the hallway, his shadow growing as he climbs the stairs. He peers through a partly open door, frowns, pushes it wider, and turns on the light, entering a child's bedroom with pop posters."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "David, with a sense of determination, follows the man as he pushes his wheelie bin around a corner and proceeds along a dimly lit corridor. A couple of people are lounging listlessly against the wall, seemingly lost in their own thoughts. David stands there, gazing intently at the door, observing the shadows of people passing back and forth inside through the frosted glass panels. The door swings open, and the maintenance man reappears, now wearing a cap and with a bag slung casually across his body. The man walks at a steady, unhurried pace along a dark street lined with parked cars, and then ascends a long stairway illuminated by tall, bright lamps positioned on alternate sides. David follows him closely, with the hood of his cape pulled up to shield himself against the relentless, teeming rain. At the top of the stairs, he pauses, waiting and watching intently. The man continues his journey up a street on a gentle incline, where large, imposing houses are set back from the road, and then turns to walk up the path leading to a detached house with a mature tree standing proudly in the front garden. He stops in the porch, glancing up and down the street, takes something from beside the porch, and then disappears into the shadows around the side of the house. David lowers his head, staring down at the ground. The shadow cast by his hood obscures all of his face except for a small triangle from his nose to his mouth. He lifts his head and looks towards the house. Two strips of light appear and very slowly widen as a door opens. The spreading light falls on mail scattered over a tiled floor, and on clothes strewn haphazardly on the floor further inside. Water drips steadily from a cape onto a pair of shoes. David stands silhouetted in the doorway. Lights are on inside the house, casting a warm glow. Beyond three open doorways, David can see a staircase. He stops in the doorway, and slowly turns back. He takes a cautious step back into a dark lobby, looking to his left, and reaches forward to open another door. He looks around and switches on a light. The house owner is lying head down on the basement steps, and David recalls the maintenance man's violent entry into the house. David closes the door and moves slowly into the next room, which has half-paneled walls, suggesting a sense of formality. He passes a chair at the end of a table, indicating it's the dining room. The next room has easy chairs, marking it as a sitting room. Light from a television flickers, catching his attention, and he glances towards it. He stops momentarily before moving into the hallway. David's shadow grows larger on the wall at the top of the stairs as he climbs them. He peers through the crack of a partly open door. Frowning, he steps forward and pushes it open wider, and flicks on the light. He steps into a child's bedroom adorned with pop posters on the wall, adding a touch of youthful vibrancy to the space."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "David, driven by a strong sense of determination, follows closely behind the man as he pushes his wheelie bin around a nearby corner and continues along a dimly lit corridor. In this corridor, a couple of individuals are lounging against the wall without much energy, seemingly lost in their own private thoughts and musings. David stands there, gazing intently at the door, observing with great focus the silhouettes of people moving back and forth inside, visible through the frosted glass panels embedded in the door. Moments later, the door swings open, and the maintenance man reappears, now wearing a cap and with a bag slung casually across his shoulder. The man proceeds to walk at a steady, unhurried pace along a dark street lined with several parked cars, and then begins to ascend a long stairway illuminated by tall, bright lamps strategically positioned on alternate sides. David follows him closely, with the hood of his cape pulled up to shield himself against the relentless, teeming rain that shows no sign of stopping. At the top of the stairs, David pauses, waiting and watching intently. The man continues his journey up a street that gently inclines, where large, imposing houses are set back from the road with an air of grandeur. He then turns to walk up the path that leads to a detached house, notable for having a mature tree standing proudly in the front garden. The man stops in the porch, glancing up and down the street cautiously, then takes something from beside the porch, and finally disappears into the shadows around the side of the house. David lowers his head, staring intently down at the ground. The shadow cast by his hood obscures all but a small triangle of his face, from his nose to his mouth. He then lifts his head to look towards the house. Two strips of light appear and very slowly widen as a door opens. The expanding light falls on mail scattered across a tiled floor and on clothes strewn haphazardly further inside. Water drips steadily from his cape onto a pair of shoes below. David stands silhouetted in the doorway, with lights inside the house casting a warm and inviting glow. Beyond three open doorways, David can see a staircase. He stops in the doorway, slowly turns back, and takes a cautious step back into a dark lobby, looking to his left, and reaches forward to open another door. He looks around carefully and switches on a light. The house owner is lying head down on the basement steps, and David recalls the maintenance man's forceful entry into the house earlier. David closes the door and moves slowly into the next room, which has half-paneled walls, suggesting a sense of formality and order. He passes a chair at the end of a table, indicating that it's the dining room. The next room features easy chairs, marking it distinctively as a sitting room. Light from a television flickers brightly, catching his attention, and he glances towards it with curiosity. He stops momentarily before moving back into the hallway. David's shadow, growing larger and more pronounced, casts on the wall at the top of the stairs as he ascends them. He peers with interest through the crack of a partly open door. Frowning slightly, he steps forward bravely and pushes it open wider, flicking on the light switch. He steps into a child's bedroom, notably adorned with vibrant pop posters on the walls, adding a distinct touch of youthful vibrancy and liveliness to the space."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "David begins by trailing behind the man, who is steadily pushing his wheelie bin around a corner and proceeding along a dimly lit corridor. As they move, David notices a couple of people lounging listlessly against the wall, their presence adding to the corridor's somber atmosphere. He pauses momentarily to gaze at a door, his attention captured by the shadows of people moving back and forth inside, visible through the frosted glass panels. The door then swings open, and the maintenance man reemerges, now wearing a cap and with a bag slung across his body. The man resumes his journey, walking at a steady pace along a dark street lined with parked cars, and begins ascending a long stairway illuminated by tall, bright lamps positioned on alternate sides. David follows closely, pulling up the hood of his cape to shield himself from the relentless rain. Upon reaching the top of the stairs, he halts and observes as the man continues up a gently sloping street, where large houses are set back from the road. The man turns and walks up the path leading to a detached house, which is fronted by a mature tree. He pauses in the porch, casting a glance up and down the street, retrieves something from beside the porch, and then vanishes into the shadows around the side of the house. David lowers his head, his gaze fixed on the ground, with the shadow from his hood obscuring all but a triangle of his face from his nose to his mouth. He then lifts his head, directing his attention towards the house. Two strips of light emerge and gradually widen as a door opens, casting illumination on mail scattered over a tiled floor and clothes strewn further inside. Water drips from David's cape onto a pair of shoes as he stands silhouetted in the doorway, observing the lights that are on inside the house. Beyond three open doorways, he notices a staircase. He pauses in the doorway, slowly turning back, and takes a step into a dark lobby, glancing to his left before reaching forward to open another door. He surveys the area and switches on a light, revealing the house owner lying head down on the basement steps, a sight that prompts him to recall the maintenance man's violent entry into the house. David closes the door and cautiously moves into the next room, which features half-paneled walls, passing a chair at the end of a table that suggests it is the dining room. He proceeds to the next room, which contains easy chairs, indicating it is a sitting room. The flickering light from a television catches his eye, and he glances towards it before pausing at the threshold of the hallway. As he ascends the stairs, his shadow enlarges on the wall at the top. He peers through the crack of a partly open door, frowning as he steps forward to push it open wider and flicks on the light. He steps into a child's bedroom adorned with pop posters on the wall."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "David follows the man with the wheelie bin around a corner and through a dimly lit corridor, passing a couple of people lounging against the wall. He observes shadows moving behind frosted glass panels of a door until the maintenance man reemerges, now wearing a cap and carrying a bag. The man proceeds along a dark, car-lined street and ascends a stairway illuminated by tall lamps, with David trailing behind, hood up against the rain. At the top, David pauses to watch as the man continues up a gently sloping street, turns onto a path leading to a detached house, and disappears into the shadows beside it after checking the street. David, partially obscured by his hood, watches as light slowly spills from an opening door, revealing scattered mail and clothes inside. He stands silhouetted in the doorway, observing the lit interior and a staircase beyond open doorways. After a moment, he steps back into a dark lobby, switches on a light, and discovers the house owner lying on the basement steps, recalling the maintenance man's violent entry. David closes the door, moves through a dining room and a sitting room with flickering TV light, and pauses before ascending the stairs. His shadow enlarges on the wall as he climbs, and he peers through a partly open door, frowns, and enters a child's bedroom adorned with pop posters after turning on the light."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "David follows the man as he pushes his wheelie bin, a common refuse container designed for easy transport, around a corner and along a dimly lit corridor often found in older buildings lacking modern lighting. A couple of people are lounging listlessly against the wall, possibly residents or visitors without immediate obligations. David stands gazing at the door, seeing shadows of people passing back and forth inside through frosted glass panels, a design feature that allows light to pass while obscuring details for privacy. The door opens and the maintenance man reappears, wearing a cap and with a bag slung across his body, a common attire for someone engaged in routine building upkeep. The man walks at a steady pace along a dark street lined with cars, parked in neat rows as typical in an urban neighborhood, and up a long stairway lit by tall bright lamps on alternate sides, reminiscent of the classic street lamps designed to illuminate public paths. David follows him with the hood of his cape up against the teeming rain that had been forecasted in the evening weather report. At the top of the stairs, he waits and watches. The man continues up a street on a gentle incline, where large houses, known to be part of an affluent district, are set back from the road, and turns and walks up the path to a detached house with a mature tree in the front garden, likely an oak or maple given its grandeur and shade-providing canopy. He stops in the porch, looks up and down the street, takes something from beside the porch, perhaps a hidden key or tool, and disappears into the shadows around the side of the house. David drops his head, staring down at the ground. The shadow from his hood obscures all his face but a triangle from his nose to his mouth. He lifts his head and looks towards the house. Two strips of light appear and very slowly widen as a door opens. The spreading light falls on mail scattered over a tiled floor, a common sight suggesting recent deliveries, and on clothes strewn on the floor further inside, indicative of a hurried departure or neglect. Water drips from a cape onto a pair of shoes. David stands silhouetted in the doorway. Lights are on inside the house, suggesting someone recently left or returned. Beyond three open doorways, David can see a staircase, a central feature in multi-level homes. He stops in the doorway, and slowly turns back. He takes a step back into a dark lobby, looking to his left, and reaches forward to open another door. He looks around and switches on a light. The house owner is lying head down on the basement steps, and David sees again the maintenance man's violent entry into the house, recalling the moment of forced entry he had observed earlier. David closes the door and moves slowly into the next room, which has half paneled walls, a decorative touch popular in traditional dining rooms. He passes a chair at the end of a table, which suggests it's the dining room, often used for formal or family meals. The next room has easy chairs, a sitting room where people typically relax or entertain company. Light from a television flickers and he glances towards it, noticing a paused scene of a popular late-night TV show. He stops before moving into the hallway. David's shadow grows larger on the wall at the top of the stairs as he climbs them. He peers through the crack of a partly open door. Frowning, he steps forward and pushes it open wider, and flicks on the light. He steps into a child's bedroom with pop posters on the wall, featuring famous bands and icons, which a child or teenager might admire."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "David follows the man as he pushes his wheelie bin around a corner and along a dimly lit corridor. A couple of people are lounging listlessly against the wall. David stands gazing at the door seeing shadows of people passing back and forth inside through frosted glass panels. The door opens and the maintenance man reappears wearing a cap and with a bag slung across his body. The man walks at a steady pace along a dark street lined with cars and up a long stairway lit by tall bright lamps on alternate sides. David follows him with the hood of his cape up against the teeming rain. At the top of the stairs he waits and watches. The man continues up a street on a gentle incline where large houses are set back from the road and turns and walks up the path to a detached house with a mature tree in the front garden. He stops in the porch looks up and down the street takes something from beside the porch and disappears into the shadows around the side of the house. David drops his head staring down at the ground. The shadow from his hood obscures all his face but a triangle from his nose to his mouth. He lifts his head and looks towards the house. Two strips of light appear and very slowly widen as a door opens. The spreading light falls on mail scattered over a tiled floor and on clothes strewn on the floor further inside. Water drips from a cape onto a pair of shoes. David stands silhouetted in the doorway. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Lights are on inside the house. Beyond three open doorways David can see a staircase. He stops in the doorway and slowly turns back. He takes a step back into a dark lobby looking to his left and reaches forward to open another door. He looks around and switches on a light. The house owner is lying head down on the basement steps and David sees again the maintenance man's violent entry into the house. David closes the door and moves slowly into the next room which has half paneled walls. He passes a chair at the end of a table which suggests it is the dining room. The next room has easy chairs. a sitting room. Light from a television flickers and he glances towards it. He stops before moving into the hallway. David's shadow grows larger on the wall at the top of the stairs as he climbs them. He peers through the crack of a partly open door. Frowning he steps forward and pushes it open wider and flicks on the light. He steps into a child's bedroom with pop posters on the wall."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "David follows the man as he pushes his wheelie bin around a corner and along a dimly lit corridor. A couple of people are lounging listlessly against the wall. David stands gazing at the door seeing shadows of people passing back and forth inside through frosted glass panels. The door opens and the maintenance man reappears wearing a cap and with a bag slung across his body. The man walks at a steady pace along a dark street lined with cars and up a long stairway lit by tall bright lamps on alternate sides. David follows him with the hood of his cape up against the teeming rain. At the top of the stairs he waits and watches. The man continues up a street on a gentle incline where large houses are set back from the road and turns and walks up the path to a detached house with a mature tree in the front garden. He stops in the porch looks up and down the street takes something from beside the porch and disappears into the shadows around the side of the house. David drops his head staring down at the ground. The shadow from his hood obscures all his face but a triangle from his nose to his mouth. He lifts his head and looks towards the house. Two strips of light appear and very slowly widen as a door opens. The spreading light falls on mail scattered over a tiled floor and on clothes strewn on the floor further inside. Water drips from a cape onto a pair of shoes. David stands silhouetted in the doorway. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Lights are on inside the house. Beyond three open doorways David can see a staircase. He stops in the doorway and slowly turns back. He takes a step back into a dark lobby looking to his left and reaches forward to open another door. He looks around and switches on a light. The house owner is lying head down on the basement steps and David sees again the maintenance man's violent entry into the house. David closes the door and moves slowly into the next room which has half paneled walls. He passes a chair at the end of a table which suggests it is the dining room. The next room has easy chairs. a sitting room. Light from a television flickers and he glances towards it. He stops before moving into the hallway. David's shadow grows larger on the wall at the top of the stairs as he climbs them. He peers through the crack of a partly open door. Frowning he steps forward and pushes it open wider and flicks on the light. He steps into a child's bedroom with pop posters on the wall."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "David follows the man as he pushes his wheelie bin around a corner and along a dimly lit corridor. A couple of people are lounging listlessly against the wall. David stands gazing at the door seeing shadows of people passing back and forth inside through frosted glass panels. The door opens and the maintenance man reappears wearing a cap and with a bag slung across his body. The man walks at a steady pace along a dark street lined with cars and up a long stairway lit by tall bright lamps on alternate sides. David follows him with the hood of his cape up against the teeming rain. At the top of the stairs he waits and watches. The man continues up a street on a gentle incline where large houses are set back from the road and turns and walks up the path to a detached house with a mature tree in the front garden. The next room has easy chairs. a sitting room. Light from a television flickers and he glances towards it. He stops before moving into the hallway. David's shadow grows larger on the wall at the top of the stairs as he climbs them. He peers through the crack of a partly open door. Frowning he steps forward and pushes it open wider and flicks on the light. He steps into a child's bedroom with pop posters on the wall."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "David follows the man as he pushes his wheelie bin around a corner and along a dimly lit corridor. A couple of people are lounging listlessly against the wall. David stands gazing at the door seeing shadows of people passing back and forth inside through frosted glass panels. The door opens and the maintenance man reappears wearing a cap and with a bag slung across his body. He peers through the crack of a partly open door. Frowning he steps forward and pushes it open wider and flicks on the light. He steps into a child's bedroom with pop posters on the wall."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Oliver trails the cat as it tugs its skateboard around a boulder and through a brightly lit tunnel. A trio of dolphins are floating energetically next to the ceiling. Oliver stands blinking at the elevator, noticing silhouettes of cars racing round and round outside through transparent stone windows. The elevator descends and the gardener reappears, wearing a helmet and with a book tossed over her shoulder. The cat skips at a rapid pace through a sunny park filled with bicycles, and down a short slide lit by low dim candles on opposing edges. Oliver trails her with the rim of his basket down against the rising breeze. At the bottom of the slide, he pauses and listens. The cat descends a path on a sharp decline, where tiny cabins are perched below the sky, and turns and skips down the trail to a towering cabin with a young shrub in the back yard. She pauses on the stoop, looks left and right across the park, grabs something from under the stoop, and darts into the moonlight beneath the roof of the cabin. Oliver lifts his eyes, glancing up at the stars. The shade from his basket unveils all his ears but a circle from his chin to his forehead. He tilts his eyes and turns away from the cabin. Two beams of darkness vanish and very quickly vanish as a window shuts. The fading darkness rises over leaves stacked on a wooden table, and on toys arranged on the ceiling lower outside. Snow falls from a hood onto a pair of gloves. Oliver stands illuminated in the archway. Shadows are off outside the cabin. Over six closed gates, Oliver cannot view an escalator. He moves in the archway, and quickly spins round. He leaps a leap forward into a bright attic, searching to his right, and pulls backward to close another window. He stares below and turns off a shadow. The forest ranger is crouching feet up on the attic ladder, and Oliver glimpses once more the gardener's sneaky exit from the cabin. Oliver opens the window and leaps swiftly out of the previous closet, which has fully carpeted ceilings. He scoots a table at the beginning of a bench, which indicates it's the kitchen. The previous closet has hard benches, a drawing room. Dark from a fireplace blazes and he peers away from it. He moves after pausing out of the kitchen. Oliver's light shrinks smaller off the ceiling at the bottom of the slide as he descends it. He listens beneath the edge of a slightly closed window. Grinning, he moves backward and pulls it closed narrower, and snaps off the dark. He moves backward from a senior's office with retro paintings on the ceiling."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "David discreetly follows a man pushing a wheelie bin along a dim corridor and watches him disappear into a house after a cautious glance around. In the teeming rain, David remains concealed under his hood, observing as the man slips into the shadows of a large detached house. As David approaches, the house lights reveal a disordered interior with scattered clothes and mail. Entering the house, David sees evidence of the maintenance man's break-in. He discovers the homeowner lying head down on the basement steps, indicating violence. David moves through the house’s dining and sitting rooms, passing furniture and flickering TV light, before ascending the stairs where his shadow looms large. Peering into a partially open door, he enters a child’s bedroom adorned with pop posters, flicking on the light."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He steps into a child's bedroom with pop posters on the wall Frowning he steps forward and pushes it open wider and flicks on the light  He peers through the crack of a partly open door  David's shadow grows larger on the wall at the top of the stairs as he climbs them  He stops before moving into the hallway  Light from a television flickers and he glances towards it  a sitting room  The next room has easy chairs  He passes a chair at the end of a table which suggests it's the dining room  David closes the door and moves slowly into the next room which has half paneled walls  The house owner is lying head down on the basement steps and David sees again the maintenance man's violent entry into the house  He looks around and switches on a light  He takes a step back into a dark lobby looking to his left and reaches forward to open another door  He stops in the doorway and slowly turns back  Beyond three open doorways David can see a staircase  Lights are on inside the house  David stands silhouetted in the doorway  Water drips from a cape onto a pair of shoes  The spreading light falls on mail scattered over a tiled floor and on clothes strewn on the floor further inside  Two strips of light appear and very slowly widen as a door opens  He lifts his head and looks towards the house  The shadow from his hood obscures all his face but a triangle from his nose to his mouth  David drops his head staring down at the ground  He stops in the porch looks up and down the street takes something from beside the porch and disappears into the shadows around the side of the house  The man continues up a street on a gentle incline where large houses are set back from the road and turns and walks up the path to a detached house with a mature tree in the front garden  At the top of the stairs he waits and watches  David follows him with the hood of his cape up against the teeming rain  The man walks at a steady pace along a dark street lined with cars and up a long stairway lit by tall bright lamps on alternate sides  The door opens and the maintenance man reappears wearing a cap and with a bag slung across his body  David stands gazing at the door seeing shadows of people passing back and forth inside through frosted glass panels  A couple of people are lounging listlessly against the wall  David follows the man as he pushes his wheelie bin around a corner and along a dimly lit corridor "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "A couple of people are lounging listlessly against the wall David follows the man as he pushes his wheelie bin around a corner and along a dimly lit corridor The door opens and the maintenance man reappears wearing a cap and with a bag slung across his body David stands gazing at the door seeing shadows of people passing back and forth inside through frosted glass panels David follows him with the hood of his cape up against the teeming rain The man walks at a steady pace along a dark street lined with cars and up a long stairway lit by tall bright lamps on alternate sides The man continues up a street on a gentle incline where large houses are set back from the road and turns and walks up the path to a detached house with a mature tree in the front garden At the top of the stairs he waits and watches David drops his head staring down at the ground He stops in the porch looks up and down the street takes something from beside the porch and disappears into the shadows around the side of the house He lifts his head and looks towards the house The shadow from his hood obscures all his face but a triangle from his nose to his mouth The spreading light falls on mail scattered over a tiled floor and on clothes strewn on the floor further inside Two strips of light appear and very slowly widen as a door opens David stands silhouetted in the doorway Water drips from a cape onto a pair of shoes Beyond three open doorways David can see a staircase Lights are on inside the house He takes a step back into a dark lobby looking to his left and reaches forward to open another door He stops in the doorway and slowly turns back The house owner is lying head down on the basement steps and David sees again the maintenance man's violent entry into the house He looks around and switches on a light He passes a chair at the end of a table which suggests it is the dining room David closes the door and moves slowly into the next room which has half paneled walls a sitting room The next room has easy chairs He stops before moving into the hallway Light from a television flickers and he glances towards it He peers through the crack of a partly open door David's shadow grows larger on the wall at the top of the stairs as he climbs them He steps into a child's bedroom with pop posters on the wall Frowning he steps forward and pushes it open wider and flicks on the light"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Lights are on inside the house  Beyond three open doorways David can see a staircase  He stops in the doorway and slowly turns back  He takes a step back into a dark lobby looking to his left and reaches forward to open another door  He looks around and switches on a light  The house owner is lying head down on the basement steps and David sees again the maintenance man's violent entry into the house  David closes the door and moves slowly into the next room which has half paneled walls  He passes a chair at the end of a table which suggests it's the dining room  The next room has easy chairs  a sitting room  Light from a television flickers and he glances towards it  He stops before moving into the hallway  David's shadow grows larger on the wall at the top of the stairs as he climbs them  He peers through the crack of a partly open door  Frowning he steps forward and pushes it open wider and flicks on the light  He steps into a child's bedroom with pop posters on the wall David follows the man as he pushes his wheelie bin around a corner and along a dimly lit corridor  A couple of people are lounging listlessly against the wall  David stands gazing at the door seeing shadows of people passing back and forth inside through frosted glass panels  The door opens and the maintenance man reappears wearing a cap and with a bag slung across his body  The man walks at a steady pace along a dark street lined with cars and up a long stairway lit by tall bright lamps on alternate sides  David follows him with the hood of his cape up against the teeming rain  At the top of the stairs he waits and watches  The man continues up a street on a gentle incline where large houses are set back from the road and turns and walks up the path to a detached house with a mature tree in the front garden  He stops in the porch looks up and down the street takes something from beside the porch and disappears into the shadows around the side of the house  David drops his head staring down at the ground  The shadow from his hood obscures all his face but a triangle from his nose to his mouth  He lifts his head and looks towards the house  Two strips of light appear and very slowly widen as a door opens  The spreading light falls on mail scattered over a tiled floor and on clothes strewn on the floor further inside  Water drips from a cape onto a pair of shoes  David stands silhouetted in the doorway "
        }
      ]
    }
  ]
}