{
  "ground_truth": "David is sitting alone at the table in a small dimly lit kitchen, staring down at the spoon he’s holding against the rim of a cereal bowl, and nods slightly as he brings the spoon under control. He walks down the hall past an open doorway and starts to go upstairs, where his wife looks up at him from inside the room. He stops and looks down at her; she’s standing in front of an open drawer, drops her eyes momentarily, and looks up again gently. He continues upstairs. David, in a gray jacket, walks past a large sign reading \"Memorial Service for the families of East Rail Train 177.\" In the church, a priest stands in the pulpit, and photos cover a large board by the pulpit. Outside the church, David heads towards his car, stops, looks at the windscreen, walks to it, and takes an envelope from under the windscreen wiper. He turns the envelope over, frowning, flicks open the unsealed flap, and stands looking at the card for some moments before turning and gazing back at the church. In a locker room, David opens one of the chipped green doors, stops in the doorway of an office, and takes off his baseball cap. A gray-haired woman with gold-rimmed glasses sits at a computer, glances at her computer screen, picks up a pen, makes a note, puts down the pen, and returns to her work, ignoring him. David pulls on his baseball cap and goes. A cape-hooded figure stands motionless in an archway silhouetted black against the teeming rain, watching an American football training session. One player suddenly erupts into a sprint, sidestepping opponents without losing speed, captures the ball thrown from behind, and dives over the line, tossing the ball to another player and trotting back again. Protected from the rain by the hood of his cape, David sighs deeply. In the locker room, David towels his head and face, puts his towel away, and glances to his right at an older man in the doorway, then stares at the locker door, and glances at Noel. In a darkened room, a hand reaches out and switches on a bedside lamp, and David, head on a pillow, looks sideways at his son who’s sleeping peacefully, while a clock on the other side of the bed reads a quarter to one. David stands at his wife's closed door, and Audrey frowns and shakes her head. From blackout, a fuzzy grayness takes the shape of a sling holding the arm of a black boy sitting in a strangely hazy living room, with a photo on the wall behind and a corner table with a lamp on it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "David is seated solitary at the desk in a petite dimly illuminated kitchenette, gazing downward at the utensil he’s clutching against the edge of a breakfast dish, and nods faintly as he brings the utensil under restraint. He strides down the corridor past an ajar entryway and begins to ascend upward, where his spouse glances up at him from within the chamber. He halts and gazes down at her; she’s positioned in front of an open compartment, drops her eyes briefly, and gazes up again softly. He proceeds upward. David, in a gray coat, strides past a large placard reading \"Memorial Ceremony for the kin of East Rail Train 177.\" In the chapel, a clergyman stands in the lectern, and photographs cover a large board by the lectern. Outside the chapel, David heads towards his automobile, halts, gazes at the windshield, strides to it, and extracts an envelope from beneath the windshield wiper. He turns the envelope over, scowling, flicks open the unsealed flap, and stands gazing at the card for some instants before turning and gazing back at the chapel. In a locker chamber, David opens one of the chipped green portals, halts in the entryway of an office, and removes his baseball cap. A gray-haired woman with gold-rimmed spectacles sits at a computer, glances at her computer monitor, picks up a pen, makes a note, puts down the pen, and returns to her task, disregarding him. David pulls on his baseball cap and departs. A cloak-hooded figure stands motionless in an archway silhouetted black against the pouring rain, observing an American football training session. One player suddenly bursts into a sprint, sidestepping adversaries without losing velocity, seizes the ball tossed from behind, and dives over the stripe, tossing the ball to another player and jogging back again. Shielded from the rain by the hood of his cloak, David exhales deeply. In the locker chamber, David towels his head and visage, puts his towel away, and glances to his right at an elder gentleman in the entryway, then stares at the locker portal, and glances at Noel. In a dimly lit chamber, a hand reaches out and switches on a bedside lamp, and David, head on a cushion, looks sideways at his offspring who’s slumbering tranquilly, while a clock on the other side of the bed reads a quarter to one. David stands at his spouse's closed portal, and Audrey scowls and shakes her head. From darkness, a fuzzy grayness takes the shape of a sling supporting the arm of a black boy seated in a peculiarly blurred living compartment, with a portrait on the wall behind and a corner table with a lamp on it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Alone at the table in a small dimly lit kitchen, David is being sat by himself, staring down at the spoon being held by him against the rim of a cereal bowl, and a slight nod is given by him as the spoon is brought under control. An open doorway is walked past by him in the hall, and the stairs are started up by him, where he is looked up at by his wife from inside the room. He stops and looks down at her; she stands in front of an open drawer, drops her eyes momentarily, and gently looks up again. The stairs are continued up by him. A gray jacket is worn by David, who walks past a large sign that reads \"Memorial Service for the families of East Rail Train 177.\" In the church, the pulpit is stood at by a priest, and a large board by the pulpit is covered with photos. Outside the church, his car is headed towards by David, stops are made, a look is taken at the windscreen, a walk is made to it, and an envelope is taken from under the windscreen wiper by him. The envelope is turned over by him, frowning, the unsealed flap is flicked open, and he stands looking at the card for some moments before turning and gazing back at the church. In a locker room, one of the chipped green doors is opened by David, who stops in the doorway of an office and takes off his baseball cap. At a computer, sits a gray-haired woman with gold-rimmed glasses who glances at her computer screen, picks up a pen, makes a note, puts down the pen, and returns to her work, ignoring him. His baseball cap is pulled on by David, and he goes. In an archway, a cape-hooded figure stands motionless, silhouetted black against the teeming rain, and an American football training session is watched. One player suddenly erupts into a sprint, sidesteps opponents without losing speed, captures the ball being thrown from behind, dives over the line, tosses the ball to another player, and trots back again. The hood of his cape protects David from the rain, and a deep sigh is made by him. In the locker room, his head and face are toweled by David, his towel is put away, and he glances to his right at an older man in the doorway, then a stare is given at the locker door, and a glance is made at Noel. A hand reaches out and switches on a bedside lamp in a darkened room, and David, with his head on a pillow, looks sideways at his son who sleeps peacefully, while a clock on the other side of the bed reads a quarter to one. His wife's closed door is stood at by David, and a frown and a shake of the head are shown by Audrey. From blackout, a fuzzy grayness takes the shape of a sling holding the arm of a black boy sitting in a strangely hazy living room, with a photo on the wall and a corner table with a lamp on it."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "David sits alone at the table in a dim kitchen, staring at a spoon against a cereal bowl rim, nodding slightly as he controls it. He walks down the hall past an open doorway and then upstairs, where his wife glances up from an open drawer, and he continues upward. Wearing a gray jacket, David passes a large sign for the \"Memorial Service for the families of East Rail Train 177.\" Inside the church, a priest stands at the pulpit near a board covered with photos. Outside, David approaches his car, stops, retrieves an envelope from under the windscreen wiper, and examines the card inside before looking back at the church. In a locker room, David opens a chipped green door, removes his baseball cap in an office doorway, but a gray-haired woman with gold-rimmed glasses ignores him. Putting his cap back on, he leaves. A cape-hooded figure stands in an archway against the rain, watching an American football training session. A player sprints, dodges opponents to catch the ball, scoring and returning it. David, hooded, sighs deeply. Back in the locker room, David dries himself and glances at an older man and Noel. In a dark room, a hand switches on a bedside lamp; David lies on a pillow, looking at his son sleeping peacefully as a clock reads a quarter to one. David stands by his wife's closed door; Audrey frowns and shakes her head. Out of blackout, a gray shape forms of a sling holding the arm of a black boy in a hazy living room with a photo and lamp on a corner table."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "David sits alone in a dim kitchen, controlling a spoon against a cereal bowl rim. He walks past an open doorway and upstairs, where his wife, standing by an open drawer, looks up as he stops briefly. David, in a gray jacket, walks by a sign reading \"Memorial Service for the families of East Rail Train 177.\" Inside, a priest is at the pulpit; outside, David takes an envelope from his car windshield, frowns, and examines the card before looking back at the church. In a locker room, he removes his baseball cap in an office doorway, unnoticed by a woman with gold glasses, resumes it, and leaves. A hooded figure in an archway watches a football practice. A player skillfully sprints, catches a ball, and scores. David, protected by his hood, sighs. Later, in the locker room, he towels off, glances at an older man, and then at a locker. In bed, David watches his son sleep while the clock reads 12:45. He stands by his wife's closed door as she shakes her head. In a hazy living room, a black boy with a sling is seen with a photo and lamp near him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "David finds himself sitting alone in the modest, dimly lit kitchen, his attention fixed on the spoon he holds steadily against the rim of a cereal bowl. He nods slightly as if in agreement with himself while carefully bringing the spoon under his control. Rising from his seat, he traverses the hallway, passing by an open doorway with quiet determination, and begins his ascent up the staircase. At the top, his wife lifts her gaze to him from within the room. He pauses, casting a thoughtful look in her direction; she stands poised in front of an open drawer, momentarily lowering her eyes before meeting his gaze once more with gentle acknowledgment. Continuing his way upstairs, David, clad in a gray jacket, walks by an imposing sign that reads \"Memorial Service for the families of East Rail Train 177.\" Inside the church, a solemn priest occupies the pulpit while an array of photographs is prominently displayed on a large board nearby. Exiting the church, David makes his way towards his parked car, halts for a moment, and shifts his focus to the windshield. He strides over, retrieves an envelope tucked beneath the windshield wiper, and turns it over with a furrowed brow. Carefully opening the unsealed flap, he pauses to study the card inside, lingering in thought before casting a reflective gaze back at the church's facade.\n\nIn the locker room, David approaches one of the worn, chipped green doors, stands in the threshold of an office, and respectfully removes his baseball cap. A gray-haired woman, sporting gold-rimmed glasses, is seated at a computer terminal. She glances at her screen, briefly picks up a pen to jot down a note, then replaces the pen and resumes her work, choosing to disregard his presence. Replacing the cap on his head, David leaves. Outside, a mysterious cape-hooded figure remains motionless, framed against the incessant rain, watching an American football training session unfold. Suddenly, a player bursts into action, sprinting with agility as he weaves past opponents without losing momentum, successfully capturing the ball as it is thrown to him from behind. He dives over the line, discards the ball to a teammate, and jogs back with a sense of accomplishment. Shielded from the relentless rain by the protective hood of his cape, David lets out a deep, reflective sigh. Back in the locker room, David dries his head and face with a towel before stowing it away. He glances to his right where an older man stands in the doorway, then his eyes linger on the locker door, briefly shifting his gaze towards Noel. In the serene tranquility of a darkened room, a hand extends to switch on a bedside lamp, casting a soft glow. David, his head resting on a pillow, looks sideways to see his son, who sleeps peacefully, while a clock on the opposite side of the bed indicates the time as a quarter to one. Standing outside his wife's closed door, David encounters Audrey, who frowns slightly and shakes her head. From the enveloping darkness, a blurred grayness emerges, morphing into the distinct outline of a sling supporting the arm of a young black boy. He sits quietly in a peculiar, hazy living room, with a framed photograph adorning the wall behind him and a corner table topped with a modest lamp."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "David finds himself sitting alone in the modestly furnished, dimly lit kitchen. His attention is fixed intently on a spoon, which he holds steadily against the rim of his cereal bowl. He nods ever so slightly, almost as if he is in silent agreement with himself, while he diligently brings the spoon under his precise control. Rising from his seat with a sense of purpose, he traverses the narrow hallway. As he passes by an open doorway, he carries with him a quiet determination, beginning his ascent up the staircase. At the top of the stairs, his wife lifts her gaze toward him from within a room. Pausing momentarily, he casts a thoughtful look in her direction; she stands poised calmly in front of an open drawer, momentarily lowering her eyes before meeting his gaze once more with gentle acknowledgment. Continuing softly on his way upstairs, David, who is clad in a gray jacket, walks by an imposing sign that solemnly proclaims, \"Memorial Service for the families of East Rail Train 177.\" Inside the church, a solemn priest occupies the pulpit, delivering words of comfort while an array of photographs is prominently displayed on a large board nearby. As he exits the church, David makes his way toward his parked car. He halts for a reflective moment and shifts his focus intently to the windshield. He strides over to the car, retrieves an envelope that is tucked beneath the windshield wiper, and turns it over with a furrowed brow. Carefully opening the unsealed flap of the envelope, he pauses to study the card inside, lingering in thought as he casts a reflective gaze back at the church's imposing facade.\n\nIn the well-used locker room, David approaches one of the worn, chipped green doors. He stands respectfully in the threshold of an office and removes his baseball cap. A gray-haired woman, sporting gold-rimmed glasses, is seated at a computer terminal. She glances at her screen, briefly picking up a pen to jot down a note, and then replaces the pen to resume her work, choosing to disregard his presence entirely. Replacing the cap on his head, David leaves the room. Outside, a mysterious figure, cloaked in a cape with a hood, remains motionless, framed dramatically against the incessant rain, watching an American football training session as it unfolds. Suddenly, a player bursts into dynamic action, sprinting with agility as he skillfully weaves past his opponents, never losing momentum. He successfully captures the ball as it is thrown to him from behind, then dives over the line, discards the ball to a waiting teammate, and jogs back with a sense of accomplishment. Shielded from the relentless rain by the protective hood of his cape, David lets out a deep, reflective sigh. Back in the locker room, David dries his head and face with a towel before stowing it away securely. He glances to his right where he sees an older man standing quietly in the doorway, then his eyes linger on the locker door briefly before shifting his gaze towards Noel. In the serene tranquility of a darkened room, a hand extends to switch on a bedside lamp, which casts a soft, warm glow. David, his head resting comfortably on a pillow, looks sideways to see his son, who sleeps peacefully, while a clock on the opposite side of the bed indicates the time as a quarter to one. Standing outside his wife's closed door, David encounters Audrey, who frowns slightly and gives a subtle shake of her head. From the enveloping darkness, a blurred grayness emerges slowly, morphing into the distinct outline of a sling supporting the arm of a young black boy. He sits quietly in an unusual, hazy living room, with a framed photograph adorning the wall behind him and a corner table topped with a modest lamp."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "David sits alone at the table in a small, dimly lit kitchen, focusing intently on the spoon he grips against the rim of his cereal bowl. He nods slightly, an acknowledgment, as he stabilizes the spoon and brings it under control. Rising from the table, he walks through the hallway, passing by an open doorway before he begins to ascend the stairs. As he reaches the top, his wife looks up from inside a room, catching his gaze. He pauses and gazes down at her; she stands in front of an open drawer, momentarily dropping her eyes before meeting his gaze again with a gentle look. David resumes his ascent and reaches the top. Later, dressed in a gray jacket, he walks past a large sign that reads \"Memorial Service for the families of East Rail Train 177.\" Inside the church, a priest is poised at the pulpit, and a large board nearby is adorned with photographs. After the service, David makes his way outside toward his car. He halts, observing the windscreen carefully, and proceeds to the front of the vehicle where he notices an envelope secured under the windscreen wiper. He retrieves it, studies the envelope with a frown, and flicks open the unsealed flap. He stands there, absorbed in examining the card, moments passing before he turns to cast a contemplative gaze back at the church. In a locker room, David opens one of the worn green doors, hesitates in the office doorway, and removes his baseball cap. Within the office, a gray-haired woman with gold-rimmed glasses sits at a computer. She briefly glances at her computer screen, picks up a pen to jot down a note, and then returns the pen to its place, resuming her work without acknowledging his presence. David replaces his baseball cap and departs. A cape-hooded figure, motionless and clad in black, stands silhouetted in an archway against the pouring rain, gazing at an American football training session. Suddenly, one player bursts into a sprint, deftly sidestepping opponents without losing momentum, snatching a ball thrown from behind, and diving over the line. He tosses the ball to another player and leisurely trots back. Sheltered from the rain by the hood of his cape, David exhales a deep sigh. Back in the locker room, David dries his head and face with a towel, stores it away, glances to his right at an older man standing in the doorway, then averts his eyes to the locker door before casting another glance at Noel. In a darkened room, a hand emerges and switches on a bedside lamp, revealing David on a pillow, gazing sideways at his son who sleeps peacefully. A clock on the other side of the bed indicates it is a quarter to one. David stands at his wife's closed door, where Audrey looks at him, frowning and shaking her head. Out of the darkness, a fuzzy grayness gradually resolves into the image of a sling supporting the arm of a black boy seated in a strangely hazy living room, with a photograph on the wall behind him and a corner table topped with a lamp."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "David sits alone in a dimly lit kitchen, focused on his spoon against the cereal bowl's rim. After controlling his movements, he heads down the hall, passing an open doorway, and begins to ascend the stairs, briefly exchanging glances with his wife standing by an open drawer. Continuing upstairs, David, now wearing a gray jacket, walks past a \"Memorial Service for the families of East Rail Train 177\" sign. Inside the church, a priest stands at the pulpit near a photo-covered board. Outside, David approaches his car, retrieves an envelope from under the windscreen wiper, and examines its contents, pausing to look back at the church. In a locker room, he opens a door and removes his baseball cap while a gray-haired woman at a computer takes notes without acknowledging him. He replaces the cap and leaves. Observing a football training session from an archway, David watches a player skillfully maneuver and score despite the rain. He sighs, protected by his hood. Later, in the locker room, David towels off, notices an older man in the doorway, then refocuses on his locker and glances at Noel. In a darkened room, David turns on a bedside lamp, checking on his peacefully sleeping son while the clock shows it’s a quarter to one. Standing outside his wife's closed door, he sees Audrey frown and shake her head. The scene shifts from darkness to a fuzzy image of a black boy with his arm in a sling, seated in a hazy living room."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "David is sitting alone at the table in a small dimly lit kitchen, a room that often serves as the heart of a household, though tonight it feels deserted. He is staring down at the spoon he’s holding against the rim of a cereal bowl, a simple yet significant gesture showing his contemplative mood, and nods slightly as he brings the spoon under control. He walks down the hall past an open doorway, a route familiar from countless daily routines, and starts to go upstairs, where his wife looks up at him from inside the room filled with soft evening light. He stops and looks down at her; she’s standing in front of an open drawer, a mundane task that now seems poignant, drops her eyes momentarily, and looks up again gently. He continues upstairs. David, in a gray jacket that signifies a somber occasion, walks past a large sign reading \"Memorial Service for the families of East Rail Train 177,\" a reference to the tragic accident that affected many families. In the church, a priest stands in the pulpit, delivering words of solace, and photos cover a large board by the pulpit, each picture a cherished memory of those lost. Outside the church, David heads towards his car, parked in the shadow of the towering spire, stops, looks at the windscreen, walks to it, and takes an envelope from under the windscreen wiper. He turns the envelope over, frowning, flicks open the unsealed flap, and stands looking at the card for some moments before turning and gazing back at the church, whose bells have long tolled. In a locker room, a place echoing with the sounds of past victories and defeats, David opens one of the chipped green doors, stops in the doorway of an office, and takes off his baseball cap, a sign of respect. A gray-haired woman with gold-rimmed glasses sits at a computer, an electronic portal to the outside world, glances at her computer screen, picks up a pen, makes a note, puts down the pen, and returns to her work, ignoring him. David pulls on his baseball cap and goes. A cape-hooded figure stands motionless in an archway silhouetted black against the teeming rain, a scene reminiscent of many a Gothic novel, watching an American football training session, a sport with deep roots in American culture. One player suddenly erupts into a sprint, sidestepping opponents without losing speed, captures the ball thrown from behind, and dives over the line, tossing the ball to another player and trotting back again, a moment of athletic prowess. Protected from the rain by the hood of his cape, David sighs deeply, the sound swallowed by the rain's persistent rhythm. In the locker room, David towels his head and face, puts his towel away, and glances to his right at an older man in the doorway, a figure from past encounters, then stares at the locker door, and glances at Noel, a teammate and friend. In a darkened room, a hand reaches out and switches on a bedside lamp, casting a gentle glow, and David, head on a pillow, looks sideways at his son who’s sleeping peacefully, a picture of innocence, while a clock on the other side of the bed reads a quarter to one, the night deepening. David stands at his wife's closed door, and Audrey frowns and shakes her head, a silent communication of shared sorrows. From blackout, a fuzzy grayness takes the shape of a sling holding the arm of a black boy sitting in a strangely hazy living room, its atmosphere thick with memories, with a photo on the wall behind and a corner table with a lamp on it, illuminating the boy's quiet resilience."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "In the church a priest stands in the pulpit and photos cover a large board by the pulpit In the locker room David towels his head and face puts his towel away and glances to his right at an older man in the doorway then stares at the locker door and glances at Noel David is sitting alone at the table in a small dimly lit kitchen staring down at the spoon David sighs deeply Outside the church David heads towards his car stops looks at the windscreen walks to it and takes an envelope from under the windscreen wiper he is holding against the rim of a cereal bowl and nods slightly as he brings the spoon under control From blackout a fuzzy grayness takes the shape of a sling holding the arm of a black boy sitting in a strangely hazy living room with a photo on the wall behind and a corner table with a lamp on it He walks down the hall past an open doorway and starts to go upstairs where his wife looks up at him from inside the room A grayhaired woman with goldrimmed glasses sits at a computer glances at her computer screen picks up a pen makes a note puts down the pen and returns to her work ignoring him He walks down the hall past an open doorway and starts to go upstairs where his wife looks up at him from inside the room He stops and looks down at her she is standing in front of an open drawer drops her eyes momentarily and looks up again gently He continues upstairs David in a gray jacket walks past a large sign reading Memorial Service for the families of East Rail Train 177 In the church a priest stands in the pulpit and photos cover a large board by the pulpit Outside the church David heads towards his car stops looks at the windscreen walks to it and takes an envelope from under the windscreen wiper He turns the envelope over frowning flicks open the unsealed flap and stands looking at the card for some moments before turning and gazing back at the church he is holding against the rim of a cereal bowl and nods slightly as he brings the spoon under control In a locker room David opens one of the chipped green doors stops in the doorway of an office and takes off his baseball cap A grayhaired woman with goldrimmed glasses sits at a computer glances at her computer screen picks up a pen makes a note puts down the pen and returns to her work ignoring him In a locker room David opens one of the chipped green doors stops in the doorway of an office and takes off his baseball cap David is sitting alone at the table in a small dimly lit kitchen staring down at the spoon David pulls on his baseball cap and goes A capehooded figure stands motionless in an archway silhouetted black against the teeming rain watching an American football training session One player suddenly erupts into a sprint sidestepping opponents without losing speed captures the ball thrown from behind and dives over the line tossing the ball to another player and trotting back again Protected from the rain by the hood of his cape David sighs deeply He stops and looks down at her In the locker room David towels his head and face puts his towel away and glances to his right at an older man in the doorway then stares at the locker door and glances at Noel In a darkened room a hand reaches out and switches on a bedside lamp and David head on a pillow looks sideways at his son who is sleeping peacefully while a clock on the other side of the bed reads a quarter to one David stands at his wife's closed door and Audrey frowns and shakes her head From blackout a fuzzy grayness takes the shape of a sling holding the arm of a black boy sitting in a strangely hazy living room with a photo on the wall behind and a corner table with a lamp on it"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "David is sitting alone at the table in a small dimly lit kitchen staring down at the spoon. he is holding against the rim of a cereal bowl and nods slightly as he brings the spoon under control. He walks down the hall past an open doorway and starts to go upstairs where his wife looks up at him from inside the room. He stops and looks down at her. she is standing in front of an open drawer drops her eyes momentarily and looks up again gently. He continues upstairs. David in a gray jacket walks past a large sign reading Memorial Service for the families of East Rail Train 177. In the church a priest stands in the pulpit and photos cover a large board by the pulpit. Outside the church David heads towards his car stops looks at the windscreen walks to it and takes an envelope from under the windscreen wiper. He turns the envelope over frowning flicks open the unsealed flap and stands looking at the card for some moments before turning and gazing back at the church. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In a locker room David opens one of the chipped green doors stops in the doorway of an office and takes off his baseball cap. A grayhaired woman with goldrimmed glasses sits at a computer glances at her computer screen picks up a pen makes a note puts down the pen and returns to her work ignoring him. David pulls on his baseball cap and goes. A capehooded figure stands motionless in an archway silhouetted black against the teeming rain watching an American football training session. One player suddenly erupts into a sprint sidestepping opponents without losing speed captures the ball thrown from behind and dives over the line tossing the ball to another player and trotting back again. Protected from the rain by the hood of his cape. David sighs deeply. In the locker room David towels his head and face puts his towel away and glances to his right at an older man in the doorway then stares at the locker door and glances at Noel. In a darkened room a hand reaches out and switches on a bedside lamp and David head on a pillow looks sideways at his son who is sleeping peacefully while a clock on the other side of the bed reads a quarter to one. David stands at his wife's closed door and Audrey frowns and shakes her head. From blackout a fuzzy grayness takes the shape of a sling holding the arm of a black boy sitting in a strangely hazy living room with a photo on the wall behind and a corner table with a lamp on it."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "David is sitting alone at the table in a small dimly lit kitchen staring down at the spoon. he is holding against the rim of a cereal bowl and nods slightly as he brings the spoon under control. He walks down the hall past an open doorway and starts to go upstairs where his wife looks up at him from inside the room. He stops and looks down at her. she is standing in front of an open drawer drops her eyes momentarily and looks up again gently. He continues upstairs. David in a gray jacket walks past a large sign reading Memorial Service for the families of East Rail Train 177. In the church a priest stands in the pulpit and photos cover a large board by the pulpit. Outside the church David heads towards his car stops looks at the windscreen walks to it and takes an envelope from under the windscreen wiper. He turns the envelope over frowning flicks open the unsealed flap and stands looking at the card for some moments before turning and gazing back at the church. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. In a locker room David opens one of the chipped green doors stops in the doorway of an office and takes off his baseball cap. A grayhaired woman with goldrimmed glasses sits at a computer glances at her computer screen picks up a pen makes a note puts down the pen and returns to her work ignoring him. David pulls on his baseball cap and goes. A capehooded figure stands motionless in an archway silhouetted black against the teeming rain watching an American football training session. One player suddenly erupts into a sprint sidestepping opponents without losing speed captures the ball thrown from behind and dives over the line tossing the ball to another player and trotting back again. Protected from the rain by the hood of his cape. David sighs deeply. In the locker room David towels his head and face puts his towel away and glances to his right at an older man in the doorway then stares at the locker door and glances at Noel. In a darkened room a hand reaches out and switches on a bedside lamp and David head on a pillow looks sideways at his son who is sleeping peacefully while a clock on the other side of the bed reads a quarter to one. David stands at his wife's closed door and Audrey frowns and shakes her head. From blackout a fuzzy grayness takes the shape of a sling holding the arm of a black boy sitting in a strangely hazy living room with a photo on the wall behind and a corner table with a lamp on it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "David is sitting alone at the table in a small dimly lit kitchen staring down at the spoon. he is holding against the rim of a cereal bowl and nods slightly as he brings the spoon under control. He walks down the hall past an open doorway and starts to go upstairs where his wife looks up at him from inside the room. He stops and looks down at her. she is standing in front of an open drawer drops her eyes momentarily and looks up again gently. Protected from the rain by the hood of his cape. David sighs deeply. In the locker room David towels his head and face puts his towel away and glances to his right at an older man in the doorway then stares at the locker door and glances at Noel. In a darkened room a hand reaches out and switches on a bedside lamp and David head on a pillow looks sideways at his son who is sleeping peacefully while a clock on the other side of the bed reads a quarter to one. David stands at his wife's closed door and Audrey frowns and shakes her head. From blackout a fuzzy grayness takes the shape of a sling holding the arm of a black boy sitting in a strangely hazy living room with a photo on the wall behind and a corner table with a lamp on it."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "David is sitting alone at the table in a small dimly lit kitchen staring down at the spoon. he is holding against the rim of a cereal bowl and nods slightly as he brings the spoon under control. In a darkened room a hand reaches out and switches on a bedside lamp and David head on a pillow looks sideways at his son who is sleeping peacefully while a clock on the other side of the bed reads a quarter to one. David stands at his wife's closed door and Audrey frowns and shakes her head. From blackout a fuzzy grayness takes the shape of a sling holding the arm of a black boy sitting in a strangely hazy living room with a photo on the wall behind and a corner table with a lamp on it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Sam is sitting alone at the table in a small dimly lit kitchen, staring down at the spoon he’s holding against the rim of a cereal bowl, and nods slightly as she brings the spoon under control. She walks down the hall past an open doorway and starts to go upstairs, where a neighbor looks up at her from inside the room. Sam stops and looks down at them; they’re standing in front of an open drawer, drop their eyes momentarily, and look up again gently. She continues upstairs. Sam, in a gray jacket, walks past a large sign reading \"Memorial Service for the families of East Rail Train 177.\" In the church, a florist stands in the pulpit, and photos cover a large board by the pulpit. Outside the church, Sam heads towards a bicycle, stops, looks at the windscreen, walks to it, and takes an envelope from under the windscreen wiper. They turn the envelope over, frowning, flick open the unsealed flap, and stand looking at the card for some moments before turning and gazing back at the church. In a locker room, Sam opens one of the chipped green doors, stops in the doorway of an office, and takes off their baseball cap. A gray-haired librarian with gold-rimmed glasses sits at a computer, glances at her computer screen, picks up a pen, makes a note, puts down the pen, and returns to her work, ignoring them. Sam pulls on their baseball cap and goes. A detective stands motionless in an archway silhouetted black against the teeming rain, watching an American football training session. One coach suddenly erupts into a sprint, sidestepping opponents without losing speed, captures the ball thrown from behind, and dives over the line, tossing the ball to another coach and trotting back again. Protected from the rain by the hood of their cape, Sam sighs deeply. In the locker room, Sam towels their head and face, puts their towel away, and glances to their right at an older woman in the doorway, then stares at the locker door, and glances at Noel. In a darkened room, a cat reaches out and switches on a bedside lamp, and Sam, head on a pillow, looks sideways at a sibling who’s sleeping peacefully, while a clock on the other side of the bed reads a quarter to one. Sam stands at a friend's closed door, and Audrey frowns and shakes her head. From blackout, a fuzzy grayness takes the shape of a sling holding the arm of a black nurse sitting in a strangely hazy living room, with a photo on the wall behind and a corner table with a lamp on it."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "David is sitting alone at the counter in a small dimly lit pantry, staring down at the fork he’s holding against the rim of a pasta plate, and nods slightly as he brings the fork under control. He walks down the passage past an open archway and starts to go upstairs, where his wife looks up at him from inside the nook. He stops and looks down at her; she’s standing in front of an open closet, drops her eyes momentarily, and looks up again gently. He continues upstairs. David, in a gray sweater, walks past a large banner reading \"Commemoration Event for the travelers of East Rail Bus 177.\" In the hall, a minister stands at the lectern, and pictures cover a large easel by the lectern. Outside the hall, David heads towards his bicycle, stops, looks at the handlebars, walks to it, and takes an envelope from under the handlebars. He turns the envelope over, frowning, flicks open the unsealed flap, and stands looking at the postcard for some moments before turning and gazing back at the hall. In a changing room, David opens one of the chipped blue lockers, stops in the doorway of an office, and takes off his sun hat. A gray-haired woman with silver-rimmed spectacles sits at a laptop, glances at her laptop screen, picks up a pencil, makes a note, puts down the pencil, and returns to her work, ignoring him. David pulls on his sun hat and goes. A cloak-hooded figure stands motionless in an alcove silhouetted black against the pouring rain, watching a soccer training session. One player suddenly erupts into a sprint, sidestepping opponents without losing speed, captures the ball kicked from behind, and dives over the line, tossing the ball to another player and trotting back again. Protected from the rain by the hood of his cloak, David sighs deeply. In the changing room, David towels his hair and neck, puts his towel away, and glances to his right at an older man in the doorway, then stares at the locker door, and glances at Noel. In a dim room, a hand reaches out and switches on a nightstand lamp, and David, head on a cushion, looks sideways at his daughter who’s sleeping peacefully, while a clock on the other side of the bed reads a quarter to two. David stands at his wife's closed window, and Audrey frowns and shakes her head. From blackout, a fuzzy grayness takes the shape of a bandage holding the arm of a black boy sitting in a strangely hazy den, with a painting on the wall behind and a wall lamp with a sculpture on it."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "David is reclining alone at the table in a small dimly lit kitchen, glancing up at the spoon he’s balancing on the rim of a cereal bowl, and shakes his head slightly as he lets the spoon fall. He jogs down the hall past an open doorway and hesitantly enters another room, where his wife waves at him from inside the room. He pauses and glances up at her; she’s crouching in front of an open drawer, shuts her eyes momentarily, and frowns gently again. He proceeds downstairs. David, in a gray jacket, leaps past a large sign proclaiming \"Memorial Service for the families of East Rail Train 177.\" In the church, a priest sits in the pulpit, and photos are scattered on a large board by the pulpit. Outside the church, David skips towards his car, pauses, grins at the windscreen, dances to it, and flicks an envelope from under the windscreen wiper. He flips the envelope open, smiling, seals the flap, and stands inspecting the card for some moments before spinning and humming back at the church. In a locker room, David shuts one of the chipped green doors, enters the office, and dons his baseball cap. A gray-haired woman with gold-rimmed glasses hunches at a computer, squints at her computer screen, drops a pen, erases a note, picks up the pen, and focuses on her work, avoiding him. David removes his baseball cap and stays. A cape-hooded figure leans motionless in an archway silhouetted black against the pouring rain, observing an American football practice. One player suddenly dawdles into a shuffle, weaving between opponents without losing momentum, misses the ball thrown from behind, and stumbles over the line, hurling the ball to another player and sauntering back again. Exposed to the rain by the hood of his cape, David chuckles softly. In the locker room, David dries his arms and shoulders, picks up his towel again, and glares to his left at an older man in the corner, then averts his eyes from the locker door, and glares at Noel. In a shadowy room, a hand pulls back and switches off a bedside lamp, and David, head on a pillow, glances upwards at his son who’s snoring peacefully, while a clock on the other side of the bed blinks a quarter to one. David kneels at his wife's open door, and Audrey smiles and shakes her head. From blackout, a fuzzy grayness transforms the shape of a scarf wrapping the neck of a black boy reclining in a strangely hazy living room, with a photo on the wall behind and a corner table with a lamp off."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Michael is sitting alone at the chair in a large brightly lit bathroom, gazing down at the fork he’s holding against the rim of a soup pot, and nods slightly as he brings the fork under control. He walks down the corridor past an open window and starts to go downstairs, where his sister looks up at him from inside the closet. He stops and looks down at her; she’s standing in front of an open wardrobe, drops her eyes momentarily, and looks up again softly. He continues downstairs. Michael, in a red sweater, walks past a small banner reading \"Birthday Party for the students of West Hill School 55.\" In the hall, a singer stands on the stage, and paintings cover a small frame by the stage. Outside the hall, Michael heads towards his bicycle, stops, looks at the mirror, walks to it, and takes a postcard from under the mirror support. He turns the postcard over, frowning, flicks open the unsealed fold, and stands looking at the letter for some moments before turning and gazing back at the hall. In a storage area, Michael opens one of the chipped blue windows, stops in the corridor of a cubicle, and takes off his knit cap. A dark-haired man with silver-rimmed spectacles sits at a laptop, glances at his laptop screen, picks up a pencil, makes a note, puts down the pencil, and returns to his task, ignoring him. Michael pulls on his knit cap and leaves. A cloak-clad figure stands motionless in a doorway silhouetted white against the gentle breeze, observing a soccer training session. One participant suddenly bursts into a dash, dodging rivals without losing momentum, snatches the disc thrown from the side, and leaps over the barrier, tossing the disc to another participant and jogging back again. Sheltered from the breeze by the hood of his cloak, Michael groans softly. In the storage area, Michael dries his arms and neck, puts his towel aside, and glances to his right at a younger woman in the hallway, then stares at the locker frame, and glances at Liam. In a brightened chamber, a foot reaches out and switches off a wall lamp, and Michael, feet on a blanket, looks sideways at his daughter who’s snoring peacefully, while a candle on the opposite side of the bed reads ten to two. Michael stands at his mother's open window, and Sarah frowns and shakes her shoulder. From blackout, a clear brightness takes the shape of a suitcase holding the leg of a white girl standing in a strangely clear dining room, with a painting on the floor behind and a side shelf with a vase on it."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Jonathan is lounging alone at the desk in a small dimly lit study, glancing up at the fork he’s balancing against the rim of a soup bowl, and shrugs slightly as he swings the fork under restraint. He skips across the hall past an open window and starts to go downstairs, where his neighbor glances at him from inside the hallway. He pauses and glances down at her; she’s perching in front of an open cupboard, raises her eyes momentarily, and glances up again softly. He ambles downstairs. Jonathan, in a blue jacket, leaps past a large notice reading \"Commemoration Service for the passengers of Northwest Flight 255.\" In the temple, a monk reclines in the pew, and sketches fill a large canvas by the pew. Outside the temple, Jonathan strolls towards his scooter, pauses, looks at the mirror, ambles to it, and extracts a postcard from under the mirror base. He flips the postcard over, scowling, snaps open the sealed flap, and stands glancing at the note for some moments before twisting and peering back at the temple. In a gymnasium, Jonathan pries open one of the worn blue lockers, freezes in the threshold of a study, and removes his beanie. A bald man with silver-framed glasses types at a laptop, peeks at his laptop monitor, lifts a pencil, writes a line, puts down the pencil, and returns to his task, overlooking him. Jonathan pulls on his beanie and exits. A cloak-draped silhouette stands motionless in an entryway silhouetted gray against the pouring snow, observing a soccer practice match. One player suddenly bursts into a leap, dodging defenders without losing agility, snatches the ball passed from behind, and slides over the line, flipping the ball to another player and jogging back again. Sheltered from the snow by the canopy of his cloak, Jonathan groans deeply. In the gymnasium, Jonathan wipes his brow and cheeks, stows his cloth away, and peeks to his left at a younger woman in the archway, then gazes at the locker handle, and peeks at Mike. In a dim room, a palm extends and clicks on a desk lamp, and Jonathan, head on a cushion, glances sideways at his daughter who’s dozing quietly, while a watch on the far side of the room reads a quarter past two. Jonathan leans at his roommate's ajar door, and Monica grimaces and nods her head. From blackout, a blurred whiteness forms the shape of a bandage encasing the leg of a white girl sitting in a surprisingly misty kitchen, with a painting on the wall beside and a side table with a candle on it."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "David is perched alone at the counter in a small dimly lit basement, peering down at the fork he’s balancing against the edge of a soup bowl, and shrugs slightly as he swings the fork to the side. He saunters down the corridor past an open window and begins to climb downstairs, where his wife glances over at him from within the chamber. He halts and glances up at her; she’s seated in front of an open cupboard, averts her gaze momentarily, and peers back again softly. He proceeds downstairs. David, in a gray sweater, strolls past a large banner stating \"Celebration for the residents of North Lake Boat 99.\" In the hall, a monk sits in the choir stall, and paintings cover a large easel beside the choir stall. Outside the hall, David strides towards his bicycle, pauses, gazes at the handlebars, strolls to it, and retrieves a brochure from under the handlebars. He flips the brochure over, scowling, snaps shut the open cover, and stands gazing at the leaflet for several moments before pivoting and peering back at the hall. In a changing room, David unlatches one of the scratched blue lockers, pauses in the threshold of a study, and removes his beanie. A gray-haired woman with silver-edged spectacles types at a typewriter, peers at her monitor, lifts a pencil, jots a note, drops the pencil, and resumes her task, disregarding him. David dons his beanie and departs. A cloaked silhouette stands frozen in a doorway silhouetted charcoal against the drifting mist, observing a soccer practice. One player abruptly bursts into a jog, weaving past teammates without losing gaze, seizes the frisbee tossed from the side, and leaps over the boundary, flipping the frisbee to another player and jogging forward again. Sheltered from the mist by the cloak of his hood, David exhales heavily. In the changing room, David pats his arms and torso, stows his cloth, and turns to his left at an elderly woman in the threshold, then gazes at the locker handle, and glimpses at Noel. In a dim chamber, a hand reaches out and adjusts a desk lamp, and David, head on a cushion, glances sideways at his daughter who’s resting soundly, while a calendar on the other side of the bed indicates a quarter to noon. David leans at his wife's closed portal, and Audrey grimaces and waves her hand. From blackout, a blurred whiteness transforms into the outline of a cast enfolding the leg of a young girl reclining in a strangely misty dining room, with a painting on the wall above and a side table with a magazine on it."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Tommy is lounging quietly at the counter in a spacious brightly lit library, gazing upwards at the mug he's balancing against the edge of a newspaper, and grins slightly as he maneuvers the mug beside a napkin. He saunters through the courtyard past a closed curtain and begins to descend downstairs, where his cat peers down at him from behind a curtain. He halts and peers up at the feline; it's lounging on top of a closed drawer, blinks its eyes sleepily, and gazes down again lazily. He resumes descending. Tommy, in a red coat, strolls past a giant poster proclaiming \"Gala Event for the residents of Forest Boulevard.\" In the auditorium, a gardener lounges on a bench, and flowers adorn a large vase by the bench. Beside the auditorium, Tommy ambles towards his motorcycle, halts, glances at the seat, wanders to it, and retrieves a package from beneath the seat cover. He flips the package over, puzzled, peels open the sealed tape, and stands inspecting the postcard for a few minutes before turning and gazing back at the auditorium. In a storage room, Tommy pries open one of the polished red lockers, pauses in the entryway of a workshop, and removes his woolen hat. A dark-haired man with silver-lined goggles fiddles with a calculator, checks his device, picks up a screwdriver, tightens a screw, sets the screwdriver down, and continues tinkering, dismissing him. Tommy pops on his woolen hat and exits. A hoodie-clad figure crouches silently in a window frame silhouetted blue against the quiet breeze, observing a golf practice match. One golfer abruptly explodes into a jog, maneuvering past obstacles without losing momentum, catches the club tossed from the side, and swings at the ball, hurling the club to another golfer and jogging back again. Shielded from the breeze by the hood of his jacket, Tommy yawns noisily. In the storage room, Tommy dabs his elbow and neck, stashes the rag, and peeks to his left at a young girl in the hallway, then gazes at the locker latch, and glances at Victor. In a brightened chamber, a foot extends and presses a ceiling fan switch, and Tommy, eyes on a book, peers sideways at his puppy who’s napping quietly, while a calendar on the bookshelf indicates a quarter past noon. Tommy leans against his daughter's open window, and Alice smiles and nods her head. From silence, a blurred darkness forms the outline of a backpack clinging to the shoulder of a brown dog nestled in an oddly vibrant garden, with a poster on the wall ahead and a side table with a sculpture on it."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "David sits alone in a dimly lit kitchen, controlling a spoon on a cereal bowl. He walks past an open doorway, glancing at his wife who is looking down, before continuing upstairs. At a memorial service for East Rail Train 177, David retrieves an envelope from his car's windshield, frowns, and gazes back at the church thoughtfully. In a locker room, he encounters a gray-haired woman engrossed in her work and leaves unnoticed. He watches a football training session from an archway, protected from the rain by his cape, while a player performs impressively. Sighing, David returns to the locker room, towels off, and exchanges glances with an older man. Later, as a bedside lamp illuminates a room, David looks at his son sleeping peacefully. Standing outside his wife's door, Audrey shakes her head. The scene shifts to a fuzzy image of a black boy with a sling in a hazy living room, a photo, and a lamp on a corner table."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "From blackout a fuzzy grayness takes the shape of a sling holding the arm of a black boy sitting in a strangely hazy living room with a photo on the wall behind and a corner table with a lamp on it David stands at his wife's closed door and Audrey frowns and shakes her head In a darkened room a hand reaches out and switches on a bedside lamp and David head on a pillow looks sideways at his son who is sleeping peacefully while a clock on the other side of the bed reads a quarter to one In the locker room David towels his head and face puts his towel away and glances to his right at an older man in the doorway then stares at the locker door and glances at Noel David sighs deeply Protected from the rain by the hood of his cape One player suddenly erupts into a sprint sidestepping opponents without losing speed captures the ball thrown from behind and dives over the line tossing the ball to another player and trotting back again A capehooded figure stands motionless in an archway silhouetted black against the teeming rain watching an American football training session David pulls on his baseball cap and goes A grayhaired woman with goldrimmed glasses sits at a computer glances at her computer screen picks up a pen makes a note puts down the pen and returns to her work ignoring him In a locker room David opens one of the chipped green doors stops in the doorway of an office and takes off his baseball cap He turns the envelope over frowning flicks open the unsealed flap and stands looking at the card for some moments before turning and gazing back at the church Outside the church David heads towards his car stops looks at the windscreen walks to it and takes an envelope from under the windscreen wiper In the church a priest stands in the pulpit and photos cover a large board by the pulpit David in a gray jacket walks past a large sign reading Memorial Service for the families of East Rail Train 177 He continues upstairs she is standing in front of an open drawer drops her eyes momentarily and looks up again gently He stops and looks down at her He walks down the hall past an open doorway and starts to go upstairs where his wife looks up at him from inside the room he is holding against the rim of a cereal bowl and nods slightly as he brings the spoon under control David is sitting alone at the table in a small dimly lit kitchen staring down at the spoon"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "David stands at his wife's closed door and Audrey frowns and shakes her head He continues upstairs One player suddenly erupts into a sprint sidestepping opponents without losing speed captures the ball thrown from behind and dives over the line tossing the ball to another player and trotting back again she is standing in front of an open drawer drops her eyes momentarily and looks up again gently He turns the envelope over frowning flicks open the unsealed flap and stands looking at the card for some moments before turning and gazing back at the church A capehooded figure stands motionless in an archway silhouetted black against the teeming rain watching an American football training session Protected from the rain by the hood of his cape In a darkened room a hand reaches out and switches on a bedside lamp and David head on a pillow looks sideways at his son who is sleeping peacefully while a clock on the other side of the bed reads a quarter to one David in a gray jacket walks past a large sign reading Memorial Service for the families of East Rail Train 177 David pulls on his baseball cap and goes In the locker room David towels his head and face puts his towel away and glances to his right at an older man in the doorway then stares at the locker door and glances at Noel In a locker room David opens one of the chipped green doors stops in the doorway of an office and takes off his baseball cap he is holding against the rim of a cereal bowl and nods slightly as he brings the spoon under control A grayhaired woman with goldrimmed glasses sits at a computer glances at her computer screen picks up a pen makes a note puts down the pen and returns to her work ignoring him He walks down the hall past an open doorway and starts to go upstairs where his wife looks up at him from inside the room David sighs deeply In the church a priest stands in the pulpit and photos cover a large board by the pulpit Outside the church David heads towards his car stops looks at the windscreen walks to it and takes an envelope from under the windscreen wiper David is sitting alone at the table in a small dimly lit kitchen staring down at the spoon He stops and looks down at her From blackout a fuzzy grayness takes the shape of a sling holding the arm of a black boy sitting in a strangely hazy living room with a photo on the wall behind and a corner table with a lamp on it"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A grayhaired woman with goldrimmed glasses sits at a computer glances at her computer screen picks up a pen makes a note puts down the pen and returns to her work ignoring him David pulls on his baseball cap and goes A capehooded figure stands motionless in an archway silhouetted black against the teeming rain watching an American football training session One player suddenly erupts into a sprint sidestepping opponents without losing speed captures the ball thrown from behind and dives over the line tossing the ball to another player and trotting back again Protected from the rain by the hood of his cape David sighs deeply In the locker room David towels his head and face puts his towel away and glances to his right at an older man in the doorway then stares at the locker door and glances at Noel In a darkened room a hand reaches out and switches on a bedside lamp and David head on a pillow looks sideways at his son who is sleeping peacefully while a clock on the other side of the bed reads a quarter to one David stands at his wife's closed door and Audrey frowns and shakes her head From blackout a fuzzy grayness takes the shape of a sling holding the arm of a black boy sitting in a strangely hazy living room with a photo on the wall behind and a corner table with a lamp on it David is sitting alone at the table in a small dimly lit kitchen staring down at the spoon he is holding against the rim of a cereal bowl and nods slightly as he brings the spoon under control He walks down the hall past an open doorway and starts to go upstairs where his wife looks up at him from inside the room He stops and looks down at her she is standing in front of an open drawer drops her eyes momentarily and looks up again gently He continues upstairs David in a gray jacket walks past a large sign reading Memorial Service for the families of East Rail Train 177 In the church a priest stands in the pulpit and photos cover a large board by the pulpit Outside the church David heads towards his car stops looks at the windscreen walks to it and takes an envelope from under the windscreen wiper He turns the envelope over frowning flicks open the unsealed flap and stands looking at the card for some moments before turning and gazing back at the church In a locker room David opens one of the chipped green doors stops in the doorway of an office and takes off his baseball cap"
        }
      ]
    }
  ]
}