{
  "ground_truth": "Elijah anxiously stares around and spots a man on the other side of the road from the dark brick stadium, then sees the man stride down into the subway. Elijah waits for a car to pass, crosses the road against the traffic lights, and the skirt of his coat flaps open to reveal a purple lining. He almost skips across the street in his anxiety, grabs the handrail to steady himself, and silhouetted against the daylight, he stares down the long steep staircase at the man striding into the tiled station. Elijah watches the man disappear into the station, looks down, and launches himself down the stairs. Using his stick and hanging onto the rail, Elijah tries to stay balanced, but his feet don't land accurately, and he slips. His glass stick flies downwards, and he is sprawled on the stairs on his back with his head downwards. Looking upside down into the station, he sees the man glance back before vaulting the ticket barrier. As the man's jacket flips up, Elijah sees a silver gun with a black grip under it, and his eyes flicker and close. On a sunny afternoon, a white bus stops on a hill at a suburban street, and David gets out still in his security uniform of a green jacket and maroon cap, carrying a holdall. He turns and walks slowly and smiling towards a small green park where a group of boys are playing American football on the grass. Joseph runs up some steps to join David, while the other children mill around a young man with a crew cut, admiring his muscles. They turn and walk away together, Joseph with his hand on his father's back. In the dim light of a basement, David, wearing a light grey sweatshirt, is laying flat on a narrow bench, pushing up a weight's bar. He straightens his arms, lets the bar down onto a pair of supports on either side of the bench, and sits up. Joseph, his fringe hanging to his eyebrows, gazes down at David, who looks around at the weights on the ends of the bar. David looks away, walks behind to the weights, and then sits on a bench, looking down while Joseph moves from one end of the bar to the other. David lies back on the bench, grips the bar, lifts it off the supports, frowning, and lowers it to his chest. As he starts to push it up, his mouth contorts with effort, and a large vein stands out on his forehead from between his eyes up into his scalp. His arms quiver, and his head trembles as he lowers the bar to his chest and pushes it up again. He reaches full arm extension and drops the bar back onto the supports.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Elijah apprehensively gazes around and notices a gentleman on the opposite side of the avenue from the dark brick coliseum, then observes the gentleman stride down into the underground. Elijah lingers for a vehicle to pass, traverses the avenue against the traffic signals, and the hem of his overcoat flaps open to disclose a violet lining. He nearly prances across the thoroughfare in his disquiet, clutches the handrail to steady himself, and silhouetted against the daylight, he gazes down the lengthy steep stairway at the gentleman striding into the tiled depot. Elijah observes the gentleman vanish into the depot, looks down, and propels himself down the stairs. Utilizing his cane and clinging onto the rail, Elijah endeavors to remain balanced, but his feet don't land precisely, and he slips. His glass cane flies downward, and he is sprawled on the stairs on his spine with his head downward. Looking inverted into the depot, he sees the gentleman glance back before vaulting the ticket barrier. As the gentleman's jacket flips up, Elijah sees a silver pistol with a black handle beneath it, and his eyes flicker and close. On a sunny afternoon, a white coach halts on a rise at a suburban avenue, and David disembarks still in his security uniform of a green jacket and maroon cap, bearing a holdall. He turns and ambles slowly and smiling towards a small green park where a group of boys are playing American football on the grass. Joseph dashes up some steps to join David, while the other children mill around a young gentleman with a crew cut, admiring his muscles. They turn and amble away together, Joseph with his hand on his father's back. In the dim illumination of a basement, David, wearing a light grey sweatshirt, is lying flat on a narrow bench, pushing up a weight's rod. He straightens his arms, lets the rod down onto a pair of supports on either side of the bench, and sits up. Joseph, his fringe hanging to his eyebrows, gazes down at David, who looks around at the weights on the ends of the rod. David looks away, ambles behind to the weights, and then sits on a bench, looking down while Joseph moves from one end of the rod to the other. David reclines back on the bench, grips the rod, lifts it off the supports, frowning, and lowers it to his chest. As he starts to push it up, his mouth contorts with effort, and a large vein stands out on his forehead from between his eyes up into his scalp. His arms quiver, and his head trembles as he lowers the rod to his chest and pushes it up again. He reaches full arm extension and drops the rod back onto the supports."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Elijah anxiously stares around, and a man on the other side of the road from the dark brick stadium is spotted by him, then the man is seen striding down into the subway. A car is waited for by Elijah to pass, the road is crossed by him against the traffic lights, and the skirt of his coat is flapped open to reveal a purple lining. He is almost skipped by anxiety across the street, the handrail is grabbed to steady himself, and against the daylight, his silhouette is outlined as he stares down the long steep staircase at the man striding into the tiled station. The man disappears into the station as Elijah watches, and he looks down, launching himself down the stairs. Using his stick and hanging onto the rail, Elijah tries to stay balanced, but accurate landings aren’t made by his feet, and a slip occurs. His glass stick flies downward, sprawling him on the stairs on his back with his head downward. Looking upside down into the station, he sees the man glance back before the ticket barrier is vaulted by him. As the jacket of the man flips up, a silver gun with a black grip under it is seen by Elijah, and his eyes flicker and close. On a sunny afternoon, a hill on a suburban street is stopped on by a white bus, and David gets out, still in his security uniform of a green jacket and maroon cap, carrying a holdall. He turns and walks slowly and smiling towards a small green park where American football is being played by a group of boys on the grass. Joseph runs up some steps to join David, while the other children mill around a young man with a crew cut, admiring his muscles. They turn and walk away together, with Joseph’s hand on his father's back. In the dim light of a basement, David, wearing a light grey sweatshirt, lies flat on a narrow bench, and a weight's bar is pushed up by him. His arms are straightened, the bar is let down onto a pair of supports on either side of the bench, and he sits up. Joseph, with his fringe hanging to his eyebrows, gazes down at David, who looks around at the weights on the ends of the bar. David looks away, walks behind to the weights, and then sits on a bench, looking down while Joseph moves from one end of the bar to the other. The bench is laid back on by David, the bar is gripped, lifted off the supports by him while frowning, and it is lowered to his chest. As the bar is started to be pushed up by him, his mouth contorts with effort, and a large vein stands out on his forehead from between his eyes up into his scalp. His arms quiver, and his head trembles as the bar is lowered to his chest and then pushed up again. Full arm extension is reached by him, and the bar is dropped back onto the supports."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Elijah anxiously scans the area, spotting a man across the street from the dark brick stadium, then sees him head into the subway. After a car passes, Elijah crosses against the lights, his coat flaring to reveal a purple lining. Nearly skipping with anxiety, he grabs the handrail, silhouetted against daylight, and watches the man descend into the tiled station. Elijah stares after him, then hurls himself down the stairs. Holding the rail and using his stick, he struggles to stay balanced, but slips—his glass stick flying as he sprawls backward on the stairs. Upside down, he sees the man glance back before vaulting the ticket barrier. As the man’s jacket flips up, Elijah glimpses a silver gun with a black grip. His eyes flicker shut. On a sunny afternoon, a white bus stops on a suburban hill. David steps off in his green security jacket and maroon cap, holding a holdall. Smiling, he walks toward a small green park where boys play football. Joseph joins him, and the two walk off together, Joseph’s hand on his father’s back. In a dim basement, David, in a light grey sweatshirt, lies on a bench pressing weights. He straightens his arms, sets the bar on supports, and sits up. Joseph, fringe to his eyebrows, watches. David glances at the weights, walks behind the bench, then sits. Joseph moves along the bar. David lies back, lifts the bar, frowning, lowers it to his chest. His mouth contorts, a vein bulges from his forehead, arms shaking as he presses up again, then drops the bar onto the supports."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Elijah anxiously spots a man across the road from the dark brick stadium, then sees him enter the subway. Elijah crosses against the traffic lights, his coat's purple lining showing. He almost skips in anxiety, steadies himself on the handrail, and watches the man disappear into the tiled station. Elijah follows, using his stick for balance, but slips, sprawling on the stairs. Upside down, he sees the man vault the ticket barrier, revealing a silver gun, before Elijah's eyes close. On a sunny afternoon, a white bus stops on a suburban hill, and David exits in his security uniform, carrying a holdall. He walks smiling towards a park where boys play football. Joseph joins him, and they walk away together. In a dim basement, David, in a grey sweatshirt, lifts weights. Joseph watches as David sits up, looks at the weights, then lies back, lifting the bar with effort, a vein standing out on his forehead. His arms quiver as he lowers and raises the bar, finally dropping it onto the supports."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Elijah, filled with a sense of anxiety, nervously scans his surroundings and eventually spots a man standing on the opposite side of the road, just across from the dark, imposing brick structure of the stadium. His eyes follow the man as he confidently strides down into the entrance of the subway. Elijah, feeling the urgency of the moment, waits impatiently for a car to pass by, then makes the decision to cross the road, even though the traffic lights are against him. As he moves quickly, the skirt of his coat flutters open, revealing a striking purple lining. In his anxious state, he almost skips across the street, reaching out to grab the handrail to steady himself. Silhouetted against the bright daylight, he peers down the long, steep staircase, watching intently as the man continues to stride into the tiled station below. Elijah observes the man until he disappears from view, then looks down and propels himself down the stairs. Clutching his stick and holding onto the rail for support, Elijah attempts to maintain his balance, but his feet fail to land accurately, causing him to slip. His glass stick slips from his grasp and tumbles downwards, leaving him sprawled on the stairs, lying on his back with his head facing downwards. From this upside-down position, he sees the man glance back before effortlessly vaulting over the ticket barrier. As the man's jacket flips up, Elijah catches a glimpse of a silver gun with a black grip tucked underneath it, and his eyes flicker before closing.\n\nOn a sunny afternoon, a white bus comes to a stop on a hill situated on a suburban street, and David steps out, still dressed in his security uniform, which consists of a green jacket and a maroon cap. He carries a holdall as he turns and walks slowly, a smile on his face, towards a small, inviting green park where a group of boys are energetically playing American football on the grass. Joseph runs up a set of steps to join David, while the other children gather around a young man with a crew cut, admiring his well-defined muscles. Together, Joseph and David turn and walk away, with Joseph placing his hand affectionately on his father's back.\n\nIn the dimly lit confines of a basement, David, now wearing a light grey sweatshirt, is lying flat on a narrow bench, focused on pushing up a weight's bar. He straightens his arms, carefully lowers the bar onto a pair of supports on either side of the bench, and then sits up. Joseph, his fringe hanging down to his eyebrows, gazes down at David, who takes a moment to look around at the weights attached to the ends of the bar. David then looks away, walks behind to the weights, and sits on a bench, his gaze directed downwards while Joseph moves from one end of the bar to the other. David lies back on the bench, grips the bar firmly, lifts it off the supports, frowning with concentration, and lowers it to his chest. As he begins to push it up, his mouth contorts with the effort, and a large vein becomes prominent on his forehead, running from between his eyes up into his scalp. His arms quiver, and his head trembles as he lowers the bar to his chest and pushes it up once more. He finally reaches full arm extension and lets the bar drop back onto the supports."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Elijah, overwhelmed with a palpable sense of anxiety, nervously surveys his immediate surroundings before eventually noticing a man positioned directly across from him, standing firmly on the opposite side of the road. This man is positioned right in front of the dark and imposing brick facade that makes up the structure of the stadium. Elijah’s eyes trail the man as he confidently strides with purpose down into the entrance of the subway. Elijah, feeling the pressing urgency of the situation, waits with mounting impatience for a car to pass by. Despite the traffic lights signaling against him, he makes the quick decision to cross the road. As he moves swiftly, the skirt of his coat flutters dramatically open, revealing a striking lining of vibrant purple. In his anxious and hurried state, he almost skips across the street, reaching out to grasp the handrail in a bid to steady himself. Silhouetted against the bright daylight, he peers down the long, steep staircase, watching intently as the man continues to stride purposefully into the tiled station below. Elijah keeps his gaze fixed on the man until he disappears from view, then glances downward and propels himself down the stairs. Gripping his glass stick and holding onto the rail for support, Elijah tries earnestly to maintain his balance, but his feet fail to land accurately, causing him to slip awkwardly. His glass stick slips from his grasp and tumbles downwards, leaving him sprawled on the stairs, lying on his back with his head facing downwards. From this upside-down position, he manages to see the man glancing back before effortlessly vaulting over the ticket barrier. As the man’s jacket flips up, Elijah catches a fleeting glimpse of a silver gun with a black grip securely tucked underneath it, and his eyes flicker with realization before closing.\n\nOn a sunny and bright afternoon, a white bus comes to a gentle stop on a hill that is situated on a suburban street, and David steps out, still dressed in his formal security uniform. This uniform consists of a neat green jacket and a maroon cap. He is carrying a holdall as he turns and walks slowly, a bright smile on his face, towards a small, inviting green park nearby. In this park, a lively group of boys are energetically playing American football on the grass. Joseph runs eagerly up a set of steps to join David, while the other children gather around a young man with a crew cut. They are visibly admiring his well-defined and prominent muscles. Together, Joseph and David turn and walk away, with Joseph affectionately placing his hand on his father’s back as they depart.\n\nIn the dimly lit and somewhat cramped confines of a basement, David, now comfortably wearing a light grey sweatshirt, lies flat on a narrow bench. He is intently focused on pushing up the bar of weights in a controlled manner. As he straightens his arms, he carefully lowers the bar onto a pair of supports on either side of the bench and then sits up. Joseph, with his fringe hanging down to meet his eyebrows, stands gazing down at David, who pauses for a moment to look around at the weights attached to the ends of the bar. David then averts his gaze, moves towards the back where the weights are located, and sits down on a bench, his eyes directed downwards as Joseph moves from one end of the bar to the other. David lies back on the bench, grips the bar firmly and lifts it off the supports, his brow furrowed with concentration. He lowers it to his chest and begins to push it upwards. As he exerts himself, his mouth contorts with the effort, and a large, prominent vein becomes noticeable on his forehead, running from between his eyes up into his scalp. His arms quiver and his head trembles slightly as he lowers the bar back to his chest and pushes it up once more with determination. He finally reaches full arm extension and lets the bar drop back onto the supports with a sense of relief."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Elijah anxiously scans his surroundings, his eyes darting until they fixate on a man standing on the opposite side of the road from the dark brick stadium. He observes as the man confidently strides down into the subway. Elijah, feeling a surge of urgency, waits for a car to pass before he crosses the road, disregarding the traffic lights. As he moves, the skirt of his coat flutters open, momentarily revealing a purple lining. His anxiety propels him almost into a skip as he crosses the street, and he reaches out to grab the handrail to steady himself. Silhouetted against the daylight, he pauses to stare down the long, steep staircase, watching the man as he strides into the tiled station below. Elijah continues to watch until the man disappears from view, then he looks down and propels himself down the stairs. He uses his stick for support and clings to the rail in an attempt to maintain his balance, but his feet fail to land accurately, causing him to slip. His glass stick slips from his grasp and tumbles down the stairs, leaving him sprawled on his back with his head pointing downwards. From this upside-down position, he sees the man glance back before effortlessly vaulting over the ticket barrier. As the man's jacket flips up, Elijah catches a glimpse of a silver gun with a black grip tucked underneath, and his eyes flicker shut. Meanwhile, on a sunny afternoon, a white bus comes to a halt on a hill along a suburban street, and David steps out, still clad in his security uniform consisting of a green jacket and maroon cap, while carrying a holdall. He turns and walks slowly, a smile on his face, towards a small green park where a group of boys are energetically playing American football on the grass. Joseph runs up some steps to join David, while the other children gather around a young man with a crew cut, admiring his muscular build. Together, David and Joseph turn and walk away, with Joseph placing his hand on his father's back. In the dim light of a basement, David, now wearing a light grey sweatshirt, lies flat on a narrow bench, pushing a weight's bar upwards. He straightens his arms, carefully lowers the bar onto a pair of supports on either side of the bench, and then sits up. Joseph, his fringe hanging down to his eyebrows, gazes intently at David, who takes a moment to glance around at the weights on the ends of the bar. David then looks away, walks behind to the weights, and sits on a bench, his gaze directed downwards while Joseph moves from one end of the bar to the other. David reclines back onto the bench, grips the bar firmly, lifts it off the supports with a frown, and lowers it to his chest. As he begins to push it upwards, his mouth contorts with the exertion, and a prominent vein bulges on his forehead, extending from between his eyes up into his scalp. His arms quiver, and his head trembles as he lowers the bar to his chest and pushes it up once more. He finally reaches full arm extension and lets the bar drop back onto the supports."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Elijah anxiously scans his surroundings and notices a man entering the subway across the road from the dark brick stadium. He crosses the street against the traffic lights, his coat flaring to reveal a purple lining, and steadies himself on the handrail as he peers down the steep staircase. Watching the man disappear into the station, Elijah hurriedly descends the stairs, using his stick for balance. He slips, sending his glass stick flying, and ends up sprawled on the stairs. Upside down, he sees the man glance back and vault the ticket barrier, revealing a silver gun, before Elijah's eyes close.\n\nOn a sunny afternoon, a white bus stops on a suburban hill, and David, in his security uniform, disembarks with a holdall. He walks toward a park where boys play American football, smiling as Joseph joins him. They walk away together, Joseph's hand on his father's back. Later, in a dim basement, David, in a grey sweatshirt, bench presses weights. After setting the bar down, he sits up and exchanges a glance with Joseph. David then resumes his workout, lifting the bar with effort, his forehead vein prominent, before completing his set and resting the bar back on the supports."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Elijah anxiously stares around and spots a man on the other side of the road from the dark brick stadium, a landmark known for hosting local sports and community events, then sees the man stride down into the subway, a common means of transportation in the bustling city. Elijah waits for a car to pass, crosses the road against the traffic lights, a risky decision indicating his urgency, and the skirt of his coat flaps open to reveal a purple lining, a color often associated with nobility and mystery. He almost skips across the street in his anxiety, grabs the handrail to steady himself, and silhouetted against the daylight, he stares down the long steep staircase at the man striding into the tiled station, crafted in an Art Deco style that adds historical charm to the area. Elijah watches the man disappear into the station, looks down, and launches himself down the stairs. Using his stick, a custom-made glass stick that glistens in the ambient light, and hanging onto the rail, Elijah tries to stay balanced, but his feet don't land accurately, and he slips. His glass stick flies downwards, and he is sprawled on the stairs on his back with his head downwards. Looking upside down into the station, he sees the man glance back before vaulting the ticket barrier, an action often associated with fare evasion. As the man's jacket flips up, Elijah sees a silver gun with a black grip under it, likely a semi-automatic, and his eyes flicker and close. On a sunny afternoon, a white bus stops on a hill at a suburban street, a peaceful neighborhood with tree-lined avenues, and David gets out still in his security uniform of a green jacket and maroon cap, signifying his role in ensuring safety, carrying a holdall. He turns and walks slowly and smiling towards a small green park, a popular gathering spot for locals, where a group of boys are playing American football, a sport deeply ingrained in American culture, on the grass. Joseph runs up some steps to join David, while the other children mill around a young man with a crew cut, admiring his muscles, as if he were an athlete. They turn and walk away together, Joseph with his hand on his father's back, a gesture of familial affection and support. In the dim light of a basement, David, wearing a light grey sweatshirt, is laying flat on a narrow bench, pushing up a weight's bar, a common exercise to build upper body strength. He straightens his arms, lets the bar down onto a pair of supports on either side of the bench, and sits up. Joseph, his fringe hanging to his eyebrows, gazes down at David, who looks around at the weights on the ends of the bar, each weighing precisely calibrated for effective training. David looks away, walks behind to the weights, and then sits on a bench, looking down while Joseph moves from one end of the bar to the other, fascinated by the workout regimen. David lies back on the bench, grips the bar, lifts it off the supports, frowning, and lowers it to his chest. As he starts to push it up, his mouth contorts with effort, and a large vein stands out on his forehead from between his eyes up into his scalp, a sign of exertion in heavy lifting. His arms quiver, and his head trembles as he lowers the bar to his chest and pushes it up again. He reaches full arm extension and drops the bar back onto the supports."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Elijah anxiously stares around and spots a man on the other side of the road from the dark brick stadium then sees the man stride down into the subway  Elijah waits for a car to pass crosses the road against the traffic lights and the skirt of his coat flaps open to reveal a purple lining  He almost skips across the street in his anxiety grabs the handrail to steady himself and silhouetted against the daylight he stares down the long steep staircase at the man striding into the tiled station  Joseph runs up some steps to join David while the other children mill around a young man with a crew cut admiring his muscles  They turn and walk away together  Joseph with his hand on his father's back  In the dim light of a basement  David wearing a light grey sweatshirt is laying flat on a narrow bench pushing up a weight's bar  He straightens his arms lets the bar down onto a pair of supports on either side of the bench and sits up  Joseph his fringe hanging to his eyebrows gazes down at David who looks around at the weights on the ends of the bar  David looks away walks behind to the weights and then sits on a bench looking down while Joseph moves from one end of the bar to the other  David lies back on the bench grips  the bar lifts it off the supports frowning and lowers it to his chest  As he starts to push it up his mouth contorts with effort and a large vein stands out on his forehead from between his eyes up into his scalp  His arms quiver and his head trembles as he lowers the bar to his chest and pushes it up again  Elijah watches the man disappear into the station looks down and launches himself down the stairs  Using his stick and hanging onto the rail Elijah tries to stay balanced but his feet don't land accurately and he slips  His glass stick flies downwards and he is sprawled on the stairs on his back with his head downwards  Looking upside down into the station he sees the man glance back before vaulting the ticket barrier  As the man's jacket flips up Elijah sees a silver gun with a black grip under it and his eyes flicker and close  On a sunny afternoon a white bus stops on a hill at a suburban street and David gets out still in his security uniform of a green jacket and maroon cap carrying a holdall  He turns and walks slowly and smiling towards a small green park where a group of boys are playing American football on the grass  Joseph runs up some steps to join David while the other children mill around a young man with a crew cut admiring his muscles  They turn and walk away together  Joseph with his hand on his father's back  In the dim light of a basement  David wearing a light grey sweatshirt is laying flat on a narrow bench pushing up a weight's bar  He straightens his arms lets the bar down onto a pair of supports on either side of the bench and sits up  Joseph his fringe hanging to his eyebrows gazes down at David who looks around at the weights on the ends of the bar  David looks away walks behind to the weights and then sits on a bench looking down while Joseph moves from one end of the bar to the other  David lies back on the bench grips  the bar lifts it off the supports frowning and lowers it to his chest  As he starts to push it up his mouth contorts with effort and a large vein stands out on his forehead from between his eyes up into his scalp  His arms quiver and his head trembles as he lowers the bar to his chest and pushes it up again  He reaches full arm extension and drops the bar back onto the supports"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Elijah anxiously stares around and spots a man on the other side of the road from the dark brick stadium then sees the man stride down into the subway. Elijah waits for a car to pass crosses the road against the traffic lights and the skirt of his coat flaps open to reveal a purple lining. He almost skips across the street in his anxiety grabs the handrail to steady himself and silhouetted against the daylight he stares down the long steep staircase at the man striding into the tiled station. Elijah watches the man disappear into the station looks down and launches himself down the stairs. Using his stick and hanging onto the rail Elijah tries to stay balanced but his feet do not land accurately and he slips. His glass stick flies downwards and he is sprawled on the stairs on his back with his head downwards. Looking upside down into the station he sees the man glance back before vaulting the ticket barrier. As the man's jacket flips up Elijah sees a silver gun with a black grip under it and his eyes flicker and close. On a sunny afternoon a white bus stops on a hill at a suburban street and David gets out still in his security uniform of a green jacket and maroon cap carrying a holdall. He turns and walks slowly and smiling towards a small green park where a group of boys are playing American football on the grass. Joseph runs up some steps to join David while the other children mill around a young man with a crew cut admiring his muscles. They turn and walk away together. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Joseph with his hand on his father's back. In the dim light of a basement. David wearing a light grey sweatshirt is laying flat on a narrow bench pushing up a weight's bar. He straightens his arms. let us the bar down onto a pair of supports on either side of the bench and sits up. Joseph his fringe hanging to his eyebrows gazes down at David who looks around at the weights on the ends of the bar. David looks away walks behind to the weights and then sits on a bench looking down while Joseph moves from one end of the bar to the other. David lies back on the bench grips. the bar lifts it off the supports frowning and lowers it to his chest. As he starts to push it up his mouth contorts with effort and a large vein stands out on his forehead from between his eyes up into his scalp. His arms quiver and his head trembles as he lowers the bar to his chest and pushes it up again. He reaches full arm extension and drops the bar back onto the supports."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Elijah anxiously stares around and spots a man on the other side of the road from the dark brick stadium then sees the man stride down into the subway. Elijah waits for a car to pass crosses the road against the traffic lights and the skirt of his coat flaps open to reveal a purple lining. He almost skips across the street in his anxiety grabs the handrail to steady himself and silhouetted against the daylight he stares down the long steep staircase at the man striding into the tiled station. Elijah watches the man disappear into the station looks down and launches himself down the stairs. Using his stick and hanging onto the rail Elijah tries to stay balanced but his feet do not land accurately and he slips. His glass stick flies downwards and he is sprawled on the stairs on his back with his head downwards. Looking upside down into the station he sees the man glance back before vaulting the ticket barrier. As the man's jacket flips up Elijah sees a silver gun with a black grip under it and his eyes flicker and close. On a sunny afternoon a white bus stops on a hill at a suburban street and David gets out still in his security uniform of a green jacket and maroon cap carrying a holdall. He turns and walks slowly and smiling towards a small green park where a group of boys are playing American football on the grass. Joseph runs up some steps to join David while the other children mill around a young man with a crew cut admiring his muscles. They turn and walk away together. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Joseph with his hand on his father's back. In the dim light of a basement. David wearing a light grey sweatshirt is laying flat on a narrow bench pushing up a weight's bar. He straightens his arms. let us the bar down onto a pair of supports on either side of the bench and sits up. Joseph his fringe hanging to his eyebrows gazes down at David who looks around at the weights on the ends of the bar. David looks away walks behind to the weights and then sits on a bench looking down while Joseph moves from one end of the bar to the other. David lies back on the bench grips. the bar lifts it off the supports frowning and lowers it to his chest. As he starts to push it up his mouth contorts with effort and a large vein stands out on his forehead from between his eyes up into his scalp. His arms quiver and his head trembles as he lowers the bar to his chest and pushes it up again. He reaches full arm extension and drops the bar back onto the supports."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Elijah anxiously stares around and spots a man on the other side of the road from the dark brick stadium then sees the man stride down into the subway. Elijah waits for a car to pass crosses the road against the traffic lights and the skirt of his coat flaps open to reveal a purple lining. He almost skips across the street in his anxiety grabs the handrail to steady himself and silhouetted against the daylight he stares down the long steep staircase at the man striding into the tiled station. Elijah watches the man disappear into the station looks down and launches himself down the stairs. Using his stick and hanging onto the rail Elijah tries to stay balanced but his feet do not land accurately and he slips. His glass stick flies downwards and he is sprawled on the stairs on his back with his head downwards. David looks away walks behind to the weights and then sits on a bench looking down while Joseph moves from one end of the bar to the other. David lies back on the bench grips. the bar lifts it off the supports frowning and lowers it to his chest. As he starts to push it up his mouth contorts with effort and a large vein stands out on his forehead from between his eyes up into his scalp. His arms quiver and his head trembles as he lowers the bar to his chest and pushes it up again. He reaches full arm extension and drops the bar back onto the supports."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Elijah anxiously stares around and spots a man on the other side of the road from the dark brick stadium then sees the man stride down into the subway. Elijah waits for a car to pass crosses the road against the traffic lights and the skirt of his coat flaps open to reveal a purple lining. He almost skips across the street in his anxiety grabs the handrail to steady himself and silhouetted against the daylight he stares down the long steep staircase at the man striding into the tiled station. His arms quiver and his head trembles as he lowers the bar to his chest and pushes it up again. He reaches full arm extension and drops the bar back onto the supports."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat anxiously stares around and spots a squirrel on the other side of the road from the dark brick stadium, then sees the squirrel stride down into the subway. The cat waits for a car to pass, crosses the road against the traffic lights, and the skirt of its coat flaps open to reveal a purple lining. It almost skips across the street in its anxiety, grabs the handrail to steady itself, and silhouetted against the daylight, it stares down the long steep staircase at the squirrel striding into the tiled station. The cat watches the squirrel disappear into the station, looks down, and launches itself down the stairs. Using its stick and hanging onto the rail, the cat tries to stay balanced, but its feet don't land accurately, and it slips. Its glass stick flies downwards, and it is sprawled on the stairs on its back with its head downwards. Looking upside down into the station, it sees the squirrel glance back before vaulting the ticket barrier. As the squirrel's jacket flips up, the cat sees a silver gun with a black grip under it, and its eyes flicker and close. On a sunny afternoon, a white bus stops on a hill at a suburban street, and a penguin gets out still in its security uniform of a green jacket and maroon cap, carrying a holdall. It turns and walks slowly and smiling towards a small green park where a group of boys are playing American football on the grass. A kangaroo runs up some steps to join the penguin, while the other children mill around a young dog with a crew cut, admiring its muscles. They turn and walk away together, the kangaroo with its hand on its father's back. In the dim light of a basement, the penguin, wearing a light grey sweatshirt, is laying flat on a narrow bench, pushing up a weight's bar. It straightens its arms, lets the bar down onto a pair of supports on either side of the bench, and sits up. The kangaroo, its fringe hanging to its eyebrows, gazes down at the penguin, who looks around at the weights on the ends of the bar. The penguin looks away, walks behind to the weights, and then sits on a bench, looking down while the kangaroo moves from one end of the bar to the other. The penguin lies back on the bench, grips the bar, lifts it off the supports, frowning, and lowers it to its chest. As it starts to push it up, its mouth contorts with effort, and a large vein stands out on its forehead from between its eyes up into its scalp. Its arms quiver, and its head trembles as it lowers the bar to its chest and pushes it up again. It reaches full arm extension and drops the bar back onto the supports."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Elijah anxiously stares around and spots a man on the other side of the road from the dark brick library, then sees the man stride down into the arcade. Elijah waits for a bicycle to pass, crosses the road against the traffic lights, and the hem of his jacket flaps open to reveal a purple lining. He almost skips across the street in his anxiety, grabs the lamp post to steady himself, and silhouetted against the daylight, he stares down the long steep ramp at the man striding into the tiled gallery. Elijah watches the man disappear into the gallery, looks down, and launches himself down the ramp. Using his cane and hanging onto the post, Elijah tries to stay balanced, but his feet don't land accurately, and he slips. His glass cane flies downwards, and he is sprawled on the ramp on his back with his head downwards. Looking upside down into the gallery, he sees the man glance back before vaulting the turnstile. As the man's jacket flips up, Elijah sees a silver camera with a black grip under it, and his eyes flicker and close. On a sunny afternoon, a white tram stops on a hill at a suburban street, and David gets out still in his security uniform of a green hoodie and maroon cap, carrying a duffel bag. He turns and walks slowly and smiling towards a small green garden where a group of boys are playing baseball on the grass. Joseph runs up some steps to join David, while the other children mill around a young woman with a bob cut, admiring her tattoos. They turn and walk away together, Joseph with his hand on his father's back. In the dim light of an attic, David, wearing a light grey t-shirt, is laying flat on a narrow cot, pushing up a broomstick. He straightens his arms, lets the stick down onto a pair of holders on either side of the cot, and sits up. Joseph, his fringe hanging to his eyebrows, gazes down at David, who looks around at the boxes on the ends of the stick. David looks away, walks behind to the boxes, and then sits on a stool, looking down while Joseph moves from one end of the stick to the other. David lies back on the cot, grips the stick, lifts it off the holders, frowning, and lowers it to his chest. As he starts to push it up, his mouth contorts with effort, and a large vein stands out on his forehead from between his eyes up into his scalp. His arms quiver, and his head trembles as he lowers the stick to his chest and pushes it up again. He reaches full arm extension and drops the stick back onto the holders."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Elijah nervously circles around and discerns a man on the other side of the road from the dark brick stadium, then observes the man leap down into the subway. Elijah bides his time for a car to pass, ambles across the road against the traffic lights, and the hem of his coat flutters open to reveal a purple lining. He nearly dances across the street in his anxiety, clutches the handrail to brace himself, and silhouetted against the daylight, he gazes down the long steep staircase at the man hopping into the tiled station. Elijah observes the man vanish into the station, glances down, and propels himself down the stairs. Using his stick and gripping onto the rail, Elijah attempts to stay balanced, but his feet don't land precisely, and he stumbles. His glass stick tumbles downwards, and he is scattered on the stairs on his back with his head downwards. Gazing upside down into the station, he sees the man peer back before leaping the ticket barrier. As the man's jacket flips up, Elijah notices a silver gun with a black grip under it, and his eyes flutter and close. On a sunny afternoon, a white bus halts on a hill at a suburban street, and David disembarks still in his security uniform of a green jacket and maroon cap, holding a holdall. He pivots and strides slowly and grinning towards a small green park where a group of boys are tossing an American football on the grass. Joseph dashes up some steps to join David, while the other children gather around a young man with a crew cut, admiring his muscles. They pivot and meander away together, Joseph with his hand on his father's back. In the dim light of a basement, David, wearing a light grey sweatshirt, is perched flat on a narrow bench, pulling down a weight's bar. He bends his arms, raises the bar onto a pair of supports on either side of the bench, and stands up. Joseph, his fringe draping to his eyebrows, peers down at David, who looks around at the weights on the ends of the bar. David glances away, strolls behind to the weights, and then reclines on a bench, gazing down while Joseph shifts from one end of the bar to the other. David reclines back on the bench, seizes the bar, hoists it off the supports, frowning, and elevates it to his chest. As he begins to push it up, his mouth twists with effort, and a large vein protrudes on his forehead from between his eyes up into his scalp. His arms quiver, and his head shakes as he raises the bar to his chest and pulls it up again. He achieves full arm extension and places the bar back onto the supports."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Oliver nervously glances around and notices a penguin on the opposite side of the canal from the bright yellow statue, then watches the penguin amble down into the tunnel. Oliver waits for a bicycle to pass, crosses the canal against the pedestrian signs, and the hem of his cape flutters open to reveal a red lining. He almost hops across the bridge in his nervousness, clutches the lamppost to steady himself, and silhouetted against the moonlight, he peers down the long narrow escalator at the penguin ambling into the tiled cave. Oliver observes the penguin vanish into the cave, glances down, and propels himself down the escalator. Using his umbrella and clutching onto the lamppost, Oliver attempts to remain steady, but his boots don't land precisely, and he stumbles. His ceramic umbrella flies upward, and he is sprawled on the escalator on his stomach with his feet upward. Gazing upside down into the cave, he sees the penguin glance back before leaping over the turnstile. As the penguin's scarf flutters up, Oliver glimpses a bronze flask with a blue handle beneath it, and his vision blurs and fades. On a cloudy morning, a red train halts on a bridge at an alleyway, and Emily disembarks still in her chef's attire of a blue apron and yellow hat, carrying a backpack. She turns and strolls slowly and cheerfully toward a small blue garden where a flock of swans is swimming in the pond. Michael sprints up some rocks to meet Emily, while the other swans glide around an older swan with a sleek neck, admiring its feathers. They turn and stroll away together, Michael with his wing on his mother's tail. In the bright light of a greenhouse, Emily, wearing a dark blue hoodie, is laying flat on a wide hammock, lifting up a kettle's lid. She extends her wings, lets the lid down onto a pair of branches on either side of the hammock, and sits up. Michael, his crest hanging to his beak, gazes down at Emily, who glances around at the kettles on the edges of the lid. Emily looks away, strolls behind to the kettles, and then sits on a hammock, gazing down while Michael flutters from one edge of the lid to the other. Emily reclines on the hammock, grips the lid, lifts it off the branches, frowning, and lowers it to her chest. As she begins to lift it up, her beak contorts with concentration, and a small feather stands out on her wing from between her eyes up into her crest. Her wings quiver, and her neck wobbles as she lowers the lid to her chest and lifts it up again. She reaches full wing extension and drops the lid back onto the branches."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Oliver nervously examines around and notices a woman on the other side of the road from the bright marble library, then observes the woman stroll up into the café. Oliver hesitates for a bicycle to pass, darts across the road despite the traffic lights, and the hem of his jacket swings open to reveal a red lining. He practically dances across the street in his nervousness, clutches the lamppost to balance himself, and silhouetted against the sunlight, he peers down the long gentle hill at the woman strolling into the tiled café. Oliver observes the woman disappear into the café, glances down, and glides down the hill. Using his umbrella and hanging onto the post, Oliver attempts to remain upright, but his shoes don't land precisely, and he stumbles. His crystal umbrella darts downwards, and he is splayed on the hill on his stomach with his feet downwards. Viewing upside down into the café, he sees the woman peek back before leaping the countertop. As the woman's sweater flutters up, Oliver notices a golden watch with a brown strap beneath it, and his eyes flutter and shut. On a rainy morning, a red tram halts on a slope at a rural path, and Michael steps out still in his delivery outfit of a blue jacket and yellow cap, holding a suitcase. He rotates and meanders happily and laughing towards a small yellow garden where a team of girls are playing soccer on the dirt. Edward jogs down several steps to meet Michael, while the other girls flock around an elderly woman with a braid, admiring her knitting. They pivot and amble away together, Edward with his arm on his uncle's shoulder. In the bright light of a loft, Michael, wearing a dark blue hoodie, is sitting cross-legged on a wide chair, pulling down a dumbbell's bar. He bends his arms, raises the bar off a pair of hooks on either side of the chair, and stands up. Edward, his ponytail dangling to his neck, peers up at Michael, who glances around at the weights on the ends of the bar. Michael looks away, strolls in front to the weights, and then stands on a mat, gazing up while Edward shifts from one side of the mat to the other. Michael kneels back on the mat, grips the bar, places it on the hooks, smiling, and raises it to his chin. As he begins to pull it down, his brows knit with concentration, and a fine line stands out on his neck from below his chin up into his ear. His hands shiver, and his shoulders shake as he raises the bar to his chin and pulls it down again. He achieves full leg extension and lifts the bar back onto the hooks."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Elijah nervously glances around and notices a boy on the other side of the river from the bright glass museum, then sees the boy jump up onto the tram. Elijah waits for a bicycle to pass, hops across the river against the sailing boats, and the sleeve of his shirt flares open to reveal an orange lining. He almost dances across the bridge in his nervousness, clutches the lamppost to steady himself, and silhouetted against the moonlight, he peers down the short flat hill at the boy leaping into the painted station. Elijah watches the boy vanish into the station, gazes up, and launches himself onto the hill. Using his umbrella and clutching onto the bench, Elijah tries to stay upright, but his hands don't grip steadily, and he stumbles. His plastic umbrella soars upwards, and he is sprawled on the hill on his stomach with his feet upwards. Looking right side up into the station, he sees the boy glance forward before ducking under the turnstile. As the boy's hat flips down, Elijah sees a golden flute with a red ribbon around it, and his eyes blink and open. On a cloudy evening, a black train halts on a bridge at a rural path, and David steps in still in his delivery suit of a red blazer and yellow beret, holding a suitcase. He spins and strolls quickly and laughing toward a large red garden where a group of girls are playing basketball on the dirt. Joseph leaps down some stairs to meet David, while the other teenagers hover around an old woman with long hair, admiring her earrings. They turn and stroll away together, Joseph with his arm on his father's shoulder. In the bright light of an attic, David, wearing a dark blue tank top, is sitting upright on a wide chair, pulling down a string's knot. He bends his elbows, pulls the knot up onto a pair of hooks on either side of the chair, and stands up. Joseph, his hair hanging to his chin, watches up at David, who glances around at the ropes on the tips of the knot. David gazes back, strides behind to the ropes, and then stands on a chair, gazing up while Joseph leaps from one tip of the knot to the other. David stands back on the floor, holds the knot, pulls it off the hooks, grimacing, and lifts it to his feet. As he starts to pull it down, his mouth stretches with effort, and a small vein appears on his neck from below his ears down into his chest. His legs shake, and his shoulders shiver as he lifts the knot to his feet and pulls it down again. He reaches full leg extension and hangs the knot back onto the hooks."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Gary cautiously surveys nearby and finds a giraffe on the opposite end of the meadow from the wooden stone fortress, then notices the giraffe hop over into the jungle. Gary waits for a tractor to roll by, hops over the meadow against the crosswalk, and the hem of his cape flutters apart to reveal a yellow interior. He nearly dances across the meadow in his nervousness, snatches the vine to brace himself, and silhouetted against the moonlight, he peers down the expansive winding canyon at the giraffe leaping into the rocky grove. Gary observes the giraffe vanish into the grove, gazes up, and catapults himself up the canyon. Using his broomstick and clinging to the vine, Gary struggles to remain steady, but his paws don't settle precisely, and he tumbles. His crystal broomstick flies upwards, and he is splayed on the canyon on his belly with his feet pointing skyward. Gazing right-side up into the grove, he notices the giraffe peek back before hurdling the log fence. As the giraffe's mane sways up, Gary notices a golden shoe with a blue lace beneath it, and his vision dims and fades. On a clear morning, a blue helicopter lands on a peak at a forested path, and Michael hops out wearing his explorer attire of a brown vest and orange scarf, carrying a backpack. He spins and strolls briskly and grinning towards a vast blue lake where a squad of penguins is swimming water polo in the pond. Andrew sprints down some rocks to join Michael, while the other critters gather around an elderly koala with a mohawk, admiring its feathers. They spin and skip away together, Andrew with his wing on his uncle's shoulder. In the bright glow of a greenhouse, Michael, donning a dark blue raincoat, is sprawled out on a wide hammock, pulling up a kite's string. He extends his arms, sets the string down on a couple of branches on either side of the hammock, and stands up. Andrew, his cap hanging to his eyelashes, glances up at Michael, who gazes out at the tree on the tips of the string. Michael gazes ahead, stomps in front of the tree, and then stands on a hammock, facing up while Andrew dances from the edge of the string to the other. Michael sits up on the hammock, grips the string, yanks it off the branches, grimacing, and raises it to his chin. As he begins to tug it down, his mouth contorts in delight, and a tiny feather juts out on his cheek from beside his ears down into his neck. His legs shiver, and his toes tingle as he raises the string to his chin and tugs it down again. He achieves full arm contraction and tosses the string back onto the branches."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Elijah anxiously observes a man near the stadium, following him into the subway. Crossing against traffic, Elijah trips while descending the stairs, and his glass stick slips away. Sprawled on the stairs, he sees the man vault a ticket barrier, revealing a gun before losing consciousness. Meanwhile, on a sunny afternoon, David exits a bus in his security uniform and heads to a park where boys play football. Joseph joins him, and they walk away together. Later, in a dim basement, David, in a grey sweatshirt, bench presses weights while Joseph watches. Despite the effort showing on his face, David manages to lift the bar repeatedly, revealing his determination."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He reaches full arm extension and drops the bar back onto the supports His arms quiver and his head trembles as he lowers the bar to his chest and pushes it up again  As he starts to push it up his mouth contorts with effort and a large vein stands out on his forehead from between his eyes up into his scalp  the bar lifts it off the supports frowning and lowers it to his chest  David lies back on the bench grips  David looks away walks behind to the weights and then sits on a bench looking down while Joseph moves from one end of the bar to the other  Joseph his fringe hanging to his eyebrows gazes down at David who looks around at the weights on the ends of the bar  He straightens his arms lets the bar down onto a pair of supports on either side of the bench and sits up  David wearing a light grey sweatshirt is laying flat on a narrow bench pushing up a weight's bar  In the dim light of a basement  Joseph with his hand on his father's back  They turn and walk away together  Joseph runs up some steps to join David while the other children mill around a young man with a crew cut admiring his muscles  He turns and walks slowly and smiling towards a small green park where a group of boys are playing American football on the grass  On a sunny afternoon a white bus stops on a hill at a suburban street and David gets out still in his security uniform of a green jacket and maroon cap carrying a holdall  As the man's jacket flips up Elijah sees a silver gun with a black grip under it and his eyes flicker and close  Looking upside down into the station he sees the man glance back before vaulting the ticket barrier  His glass stick flies downwards and he is sprawled on the stairs on his back with his head downwards  Using his stick and hanging onto the rail Elijah tries to stay balanced but his feet don't land accurately and he slips  Elijah watches the man disappear into the station looks down and launches himself down the stairs  He almost skips across the street in his anxiety grabs the handrail to steady himself and silhouetted against the daylight he stares down the long steep staircase at the man striding into the tiled station  Elijah waits for a car to pass crosses the road against the traffic lights and the skirt of his coat flaps open to reveal a purple lining  Elijah anxiously stares around and spots a man on the other side of the road from the dark brick stadium then sees the man stride down into the subway "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "David looks away walks behind to the weights and then sits on a bench looking down while Joseph moves from one end of the bar to the other  As the man's jacket flips up Elijah sees a silver gun with a black grip under it and his eyes flicker and close  the bar lifts it off the supports frowning and lowers it to his chest  They turn and walk away together  Using his stick and hanging onto the rail Elijah tries to stay balanced but his feet don't land accurately and he slips  He straightens his arms lets the bar down onto a pair of supports on either side of the bench and sits up  He reaches full arm extension and drops the bar back onto the supports He turns and walks slowly and smiling towards a small green park where a group of boys are playing American football on the grass  Looking upside down into the station he sees the man glance back before vaulting the ticket barrier  Joseph his fringe hanging to his eyebrows gazes down at David who looks around at the weights on the ends of the bar  Elijah waits for a car to pass crosses the road against the traffic lights and the skirt of his coat flaps open to reveal a purple lining  His arms quiver and his head trembles as he lowers the bar to his chest and pushes it up again  Joseph with his hand on his father's back  Elijah watches the man disappear into the station looks down and launches himself down the stairs  He almost skips across the street in his anxiety grabs the handrail to steady himself and silhouetted against the daylight he stares down the long steep staircase at the man striding into the tiled station  As he starts to push it up his mouth contorts with effort and a large vein stands out on his forehead from between his eyes up into his scalp  Joseph runs up some steps to join David while the other children mill around a young man with a crew cut admiring his muscles  In the dim light of a basement  His glass stick flies downwards and he is sprawled on the stairs on his back with his head downwards  Elijah anxiously stares around and spots a man on the other side of the road from the dark brick stadium then sees the man stride down into the subway  On a sunny afternoon a white bus stops on a hill at a suburban street and David gets out still in his security uniform of a green jacket and maroon cap carrying a holdall  David lies back on the bench grips  David wearing a light grey sweatshirt is laying flat on a narrow bench pushing up a weight's bar "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Joseph with his hand on his father's back  In the dim light of a basement  David wearing a light grey sweatshirt is laying flat on a narrow bench pushing up a weight's bar  He straightens his arms lets the bar down onto a pair of supports on either side of the bench and sits up  Joseph his fringe hanging to his eyebrows gazes down at David who looks around at the weights on the ends of the bar  David looks away walks behind to the weights and then sits on a bench looking down while Joseph moves from one end of the bar to the other  David lies back on the bench grips  the bar lifts it off the supports frowning and lowers it to his chest  As he starts to push it up his mouth contorts with effort and a large vein stands out on his forehead from between his eyes up into his scalp  His arms quiver and his head trembles as he lowers the bar to his chest and pushes it up again  He reaches full arm extension and drops the bar back onto the supports Elijah anxiously stares around and spots a man on the other side of the road from the dark brick stadium then sees the man stride down into the subway  Elijah waits for a car to pass crosses the road against the traffic lights and the skirt of his coat flaps open to reveal a purple lining  He almost skips across the street in his anxiety grabs the handrail to steady himself and silhouetted against the daylight he stares down the long steep staircase at the man striding into the tiled station  Elijah watches the man disappear into the station looks down and launches himself down the stairs  Using his stick and hanging onto the rail Elijah tries to stay balanced but his feet don't land accurately and he slips  His glass stick flies downwards and he is sprawled on the stairs on his back with his head downwards  Looking upside down into the station he sees the man glance back before vaulting the ticket barrier  As the man's jacket flips up Elijah sees a silver gun with a black grip under it and his eyes flicker and close  On a sunny afternoon a white bus stops on a hill at a suburban street and David gets out still in his security uniform of a green jacket and maroon cap carrying a holdall  He turns and walks slowly and smiling towards a small green park where a group of boys are playing American football on the grass  Joseph runs up some steps to join David while the other children mill around a young man with a crew cut admiring his muscles  They turn and walk away together "
        }
      ]
    }
  ]
}