{
  "ground_truth": "He reports into a walkie-talkie on the activity by the basin as Long-hair Charlie scarfs a pickle. Jackson sits in the passenger seat of an army jeep, the kids in the back, while soldiers crouch behind him. They arrive at a busy research facility where Jackson smooths back his black hair. In an office with Professor West, Adrienne talks to Satnam via the Internet and observes the great expression worn by Satnam and West. Mouth agape, Adrienne straightens away from the computer screen, then wide-eyed, she frowns while looking out the window and spotting Jackson knocking about with Lily and Noah. She watches as Jackson lifts up Lily and looks around furtively at West, who sits behind him. Satnam disconnects and turns to his wife Aponna, kneeling by his son, Ajeet. At Yellowstone, Charlie spies on Jackson and the kids as night falls. Adrienne climbs on board a helicopter, while in his darkened office at the White House, Anheuser hangs up the phone and looks out of the French windows. At the campsite in Yellowstone, Jackson watches the chopper fly overhead, bringing up Google Maps on his laptop to show Yellowstone. In the tent, Noah swats a bug, but Jackson spots him sending a text on a cell phone and takes it from him. Noah zips the door closed on Jackson, who sits back and reads the text. Jackson sits in his limo, typing on his laptop when he spots Charlie nearby broadcasting from an RV. Newspaper clippings surround Charlie, who has a beard darker than his long, straggly hair and looks around furtively, then leans in close. Jackson frowns dubiously, then nods calmly. Meanwhile, Gordon hugs Kate in a supermarket, and she smirks as a crack appears in the car park outside, rumbling beneath a car and approaching another. As it spreads in the supermarket, he finds something nearby and hands it to her at the checkout, where a customer's trolley rolls slowly away, and a crack appears on the floor. Cereal boxes shake as Kate reaches out for them, and a large crack tears through the floor between them. At Yellowstone, Lily scratches, and Noah looks gravely at Jackson. Anheuser follows Wilson into the White House situation room, while a well-dressed, middle-aged man approaches the boxer's corner of the ring as the fight begins. Sitting by a glamorous, young, blonde Tamara, Uri looks at his mobile and presses his thumb to the screen to confirm his identity. Uri looks up blankly, stands up, and leaves the arena, checking his watch as he goes, while Tamara stands and calls after him. Sultan spots Uri leaving, a massive hit on Sultan, and he runs to the canvas. Jackson drives the kids in the limo as they fall asleep in the back seat.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He communicates into a handheld transceiver on the operation by the sink as Long-hair Charlie devours a gherkin. Jackson rests in the co-driver’s seat of a military vehicle, the children in the rear, while troopers crouch behind him. They reach a bustling study center where Jackson smooths back his dark hair. In an office with Professor West, Adrienne speaks to Satnam via the Web and notices the significant look worn by Satnam and West. Mouth wide open, Adrienne straightens away from the monitor, then wide-eyed, she scowls while staring through the window and noticing Jackson mingling with Lily and Noah. She observes as Jackson lifts up Lily and looks around stealthily at West, who rests behind him. Satnam disconnects and turns to his spouse Aponna, kneeling by his child, Ajeet. At Yellowstone, Charlie surveils Jackson and the kids as dusk descends. Adrienne boards a helicopter, while in his darkened office at the White House, Anheuser hangs up the phone and gazes out of the French windows. At the campsite in Yellowstone, Jackson observes the chopper soar overhead, bringing up Google Maps on his notebook to display Yellowstone. In the tent, Noah swats a bug, but Jackson notices him sending a message on a mobile phone and seizes it from him. Noah zips the flap shut on Jackson, who reclines and reads the message. Jackson reclines in his limousine, typing on his notebook when he notices Charlie nearby transmitting from a recreational vehicle. Newspaper cuttings surround Charlie, who has facial hair darker than his long, unruly hair and looks around stealthily, then leans in closely. Jackson scowls skeptically, then nods serenely. Meanwhile, Gordon embraces Kate in a grocery store, and she grins as a fissure appears in the parking lot outside, vibrating beneath an automobile and nearing another. As it spreads in the grocery store, he discovers something nearby and hands it to her at the checkout, where a customer’s cart rolls slowly away, and a fissure appears on the floor. Cereal packages tremble as Kate reaches out for them, and a large fissure rips through the floor between them. At Yellowstone, Lily itches, and Noah looks gravely at Jackson. Anheuser follows Wilson into the White House situation chamber, while a well-dressed, middle-aged man approaches the pugilist’s corner of the ring as the bout commences. Sitting by a glamorous, young, blonde Tamara, Uri glances at his mobile and presses his thumb to the screen to verify his identity. Uri looks up vacantly, stands up, and exits the arena, checking his timepiece as he goes, while Tamara stands and calls after him. Sultan observes Uri departing, a massive strike on Sultan, and he rushes to the canvas. Jackson drives the kids in the limousine as they doze in the rear seat."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Reports are made by him into a walkie-talkie on the activity by the basin as a pickle is scarfed by Long-hair Charlie. The passenger seat of an army jeep is sat in by Jackson, with the kids in the back, while he is crouched behind by soldiers. They arrive at a busy research facility where the black hair of Jackson is smoothed back by him. In an office with Professor West, Satnam is talked to by Adrienne via the Internet, and the great expression worn by Satnam and West is observed by her. With mouth agape, the computer screen is straightened away from by Adrienne, then wide-eyed, a frown is worn by her while the window is looked out of, and Jackson is spotted knocking about with Lily and Noah. Jackson is watched by her as Lily is lifted up by him and furtive looks around are given by him at West, who sits behind him. His wife Aponna is turned to by Satnam, who kneels by his son, Ajeet, after disconnecting. At Yellowstone, Jackson and the kids are spied on by Charlie as night falls. A helicopter is climbed on board by Adrienne, while, in his darkened office at the White House, the phone is hung up by Anheuser, who looks out of the French windows. At the campsite in Yellowstone, the chopper is watched flying overhead by Jackson, who brings up Google Maps on his laptop to show Yellowstone. In the tent, a bug is swatted by Noah, but Jackson spots him sending a text on a cell phone and takes it from him. The door is zipped closed on Jackson by Noah, who sits back and reads the text. A limo is sat in by Jackson, who types on his laptop when Charlie is spotted nearby broadcasting from an RV. Charlie is surrounded by newspaper clippings, and he has a beard darker than his long, straggly hair and looks around furtively, then leans in close. Jackson frowns dubiously, then nods calmly. Meanwhile, Kate is hugged by Gordon in a supermarket, and a smirk appears on her face as a crack appears in the car park outside, rumbling beneath a car and approaching another. As it spreads in the supermarket, something nearby is found by him and handed to her at the checkout, where a customer's trolley rolls slowly away, and a crack appears on the floor. Cereal boxes are shaken as they are reached for by Kate, and a large crack tears through the floor between them. At Yellowstone, scratching is done by Lily, and Noah looks gravely at Jackson. Wilson is followed by Anheuser into the White House situation room, while the boxer’s corner of the ring is approached by a well-dressed, middle-aged man as the fight begins. Sitting by a glamorous, young, blonde Tamara, a look is given by Uri to his mobile, and his thumb is pressed to the screen to confirm his identity. Blank looks are given by Uri as he stands up and leaves the arena, checking his watch as he goes, while Tamara stands and calls after him. Uri is spotted leaving by Sultan, a massive hit is taken by Sultan, and he runs to the canvas. The kids are driven by Jackson in the limo as they fall asleep in the back seat."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He reports on basin activity via walkie-talkie while Long-hair Charlie devours a pickle. Jackson, in the army jeep's passenger seat, kids in the back, soldiers crouched behind, reaches a bustling research center, smoothing his black hair. In an office, Adrienne video-chats with Satnam, noting his and Professor West's expressions. Surprised, she turns from the screen, then frowns watching Jackson with Lily and Noah outside. Satnam disconnects, turns to his wife Aponna and son Ajeet. At Yellowstone, Charlie observes Jackson and the kids as night falls. Adrienne boards a helicopter, while Anheuser in the White House ends a call, gazing through French windows. Jackson watches the helicopter, uses Google Maps on his laptop to locate Yellowstone. Inside the tent, Noah swats a bug, texting, but Jackson takes his phone. Noah closes the tent, while Jackson reads the text. In the limo, Jackson types on his laptop, noticing Charlie nearby broadcasting from an RV amid newspaper clippings. Charlie, with a dark beard and straggly hair, looks cautiously around. Jackson frowns, then nods. Gordon hugs Kate in a supermarket as a crack appears outside, spreading through the store. He hands her something at the checkout as a crack snakes under a customer's trolley. Cereal boxes shake as a large crack splits the floor. At Yellowstone, Lily scratches while Noah looks seriously at Jackson. Anheuser and Wilson enter the White House situation room. A middle-aged man approaches a boxer's corner as a fight starts. Uri, sitting beside young blonde Tamara, confirms his identity on his phone, stands, and leaves, checking his watch. Tamara calls after him, while Sultan, hit hard, runs to the canvas. Jackson drives the sleeping kids in the limo."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Communicating via walkie-talkie at the basin, Jackson is in an army jeep with kids and soldiers. At a research facility, Jackson fixes his hair. Adrienne converses online with Satnam and observes him and Professor West. Surprised, she looks out the window at Jackson with Lily and Noah. Satnam disconnects, turns to his family. At Yellowstone, Charlie spies on Jackson as it gets dark. Adrienne boards a helicopter, while Anheuser at the White House observes outside. Jackson at the campsite watches the chopper, checking Google Maps for Yellowstone. He notices Noah texting and confiscates the phone. Sitting in his limo, Jackson spots Charlie broadcasting from an RV, surrounded by clippings. Jackson frowns but nods. At a supermarket, Gordon embraces Kate; a crack appears, extending through the parking lot and store. Kate reaches for shaking cereal boxes as a crack forms. At Yellowstone, Lily scratches, and Noah looks gravely at Jackson. Anheuser enters the White House situation room as a fight starts. Uri, with Tamara, confirms his identity on his phone, then leaves the arena, checking his watch. Sultan sees Uri leaving, gets hit, and rushes to the canvas. Jackson drives, kids asleep in the limo's back seat."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He communicates through a walkie-talkie, providing a detailed report on the bustling activity happening near the basin, while Long-hair Charlie eagerly devours a pickle nearby. Jackson is comfortably seated in the passenger spot of an army jeep, with the kids nestled in the back, while vigilant soldiers are crouched protectively behind him. They reach a bustling research facility, where Jackson casually smooths back his sleek black hair. Inside an office shared with Professor West, Adrienne engages in a conversation with Satnam through the Internet, observing with interest the significant expression displayed by both Satnam and West. With her mouth agape in disbelief, Adrienne instinctively straightens away from the glowing computer screen, her eyes widening as she frowns and peers out the window. There, she spots Jackson as he playfully interacts with Lily and Noah, lifting Lily high into the air and sneaking cautious glances in West's direction, who sits attentively behind him. Satnam disconnects the call and turns his attention to his wife, Aponna, who is kneeling beside their son, Ajeet. Meanwhile, as night envelops Yellowstone, Charlie discreetly observes Jackson and the children. Adrienne boards a helicopter, preparing for departure, while Anheuser, situated in his dimly lit office at the White House, hangs up the phone with a contemplative expression and gazes out of the imposing French windows. At the campsite in Yellowstone, Jackson watches the helicopter fly overhead, intently bringing up Google Maps on his laptop to get a detailed view of Yellowstone. In the tent, Noah casually swats at a bug, but Jackson, with a sharp eye, notices him sending a text message on a cell phone and quickly takes it from him. Noah, slightly irritated, zips the door closed on Jackson, who leans back and thoughtfully reads the text message. Sitting in his limousine, Jackson types on his laptop, then catches sight of Charlie nearby, broadcasting animatedly from an RV. Newspaper clippings are scattered around Charlie, whose beard is even darker than his long, straggly hair; he looks around with a furtive glance, then leans in closer. Jackson observes Charlie, frowning dubiously before nodding with calm assurance. Simultaneously, in a supermarket, Gordon warmly embraces Kate, and she responds with a teasing smirk as, outside in the car park, a crack ominously appears, rumbling beneath a car and creeping toward another. As the fissure continues to spread through the supermarket, Gordon finds something close at hand and promptly hands it to her at the checkout, where a customer's trolley rolls slowly away, and yet another crack materializes on the floor. Cereal boxes begin to shake as Kate reaches out for them, and a substantial crack violently splits through the floor separating them. Back at Yellowstone, Lily scratches herself absentmindedly, and Noah gazes gravely at Jackson, who is deep in thought. Elsewhere, Anheuser follows Wilson into the high-stakes situation room of the White House. In an entirely different setting, a well-dressed, middle-aged man strides confidently toward the boxer's corner of the ring as the intense fight gets underway. Seated next to a glamorous, young, blonde Tamara, Uri attentively looks at his mobile phone and presses his thumb to the screen, efficiently confirming his identity. Uri, appearing somewhat detached, then stands up, leaves the arena, and checks his watch as he goes, while Tamara rises and calls after him. Sultan, noticing Uri's abrupt exit, takes a massive hit and rushes headlong onto the canvas. Meanwhile, Jackson drives the kids in the spacious limo as they peacefully drift off to sleep in the comfortable back seat."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He communicates through a walkie-talkie, providing a comprehensive and detailed report on the bustling and lively activity occurring near the basin. Nearby, Long-hair Charlie eagerly devours a pickle with great enthusiasm. Jackson is comfortably seated in the passenger spot of a rugged army jeep, with the kids nestled securely in the backseat. In contrast, vigilant soldiers crouch protectively behind him, forming a watchful barrier. They eventually arrive at a bustling research facility, where Jackson casually smooths back his sleek, glossy black hair. Inside an office shared with the esteemed Professor West, Adrienne engages in a lively conversation with Satnam through the Internet, observing with keen interest the significant expressions displayed by both Satnam and West. With her mouth agape in disbelief, Adrienne instinctively straightens away from the glowing computer screen, her eyes widening as she frowns and peers out the window. Her gaze lands on Jackson as he playfully interacts with Lily and Noah, joyfully lifting Lily high into the air while sneaking cautious glances in the direction of West, who sits attentively behind him. Satnam eventually disconnects the call and shifts his attention to his wife, Aponna, who is tenderly kneeling beside their young son, Ajeet. Meanwhile, as night envelops Yellowstone in darkness, Charlie discreetly observes Jackson and the children from a distance. Adrienne boards a helicopter, preparing for her imminent departure, while Anheuser, situated in his dimly lit office at the White House, hangs up the phone with a contemplative expression and gazes pensively out of the imposing French windows. Back at the campsite in Yellowstone, Jackson watches the helicopter fly overhead, intently bringing up Google Maps on his laptop to get a detailed view of the expansive Yellowstone area. Inside the tent, Noah casually swats at a bug, but Jackson, with a sharp eye, notices him subtly sending a text message on a cell phone and quickly confiscates it from him. Noah, slightly irritated, zips the tent door closed on Jackson, who leans back and thoughtfully reads the text message. Sitting in his limousine, Jackson types diligently on his laptop, then catches sight of Charlie nearby. Charlie is broadcasting animatedly from an RV, surrounded by scattered newspaper clippings. His beard is even darker than his long, straggly hair; he looks around with furtive glances, then leans in closer. Jackson observes Charlie, frowning dubiously before nodding with calm assurance. Simultaneously, in a bustling supermarket, Gordon warmly embraces Kate, and she responds with a teasing smirk. Outside in the car park, a crack ominously appears, rumbling beneath one car and creeping menacingly toward another. As the fissure continues to spread through the supermarket, Gordon finds something close at hand and promptly hands it to her at the checkout, where a customer's trolley rolls slowly away, and yet another crack materializes ominously on the floor. Cereal boxes begin to shake vigorously as Kate reaches out for them, and a substantial crack violently splits through the floor, separating them. Back at Yellowstone, Lily absentmindedly scratches herself, and Noah gazes gravely at Jackson, who is deep in thought. Elsewhere, Anheuser follows Wilson into the high-stakes situation room of the White House. In an entirely different setting, a well-dressed, middle-aged man strides confidently toward the boxer's corner of the ring as the intense fight gets underway. Seated next to the glamorous, young, blonde Tamara, Uri attentively looks at his mobile phone and presses his thumb to the screen, efficiently confirming his identity. Uri, appearing somewhat detached, then stands up, leaves the arena, and checks his watch as he goes, while Tamara rises and calls after him. Sultan, noticing Uri's abrupt exit, takes a massive hit and rushes headlong onto the canvas. Meanwhile, Jackson drives the kids in the spacious limo as they peacefully drift off to sleep in the comfortable back seat."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He begins by holding a walkie-talkie close to his mouth, speaking directly into it to report the ongoing activity by the basin, where Long-hair Charlie rapidly consumes a pickle with vigor. Meanwhile, Jackson occupies the passenger seat of an army jeep, with the kids seated in the back, as the soldiers crouch behind them, staying vigilant. The jeep travels to a bustling research facility, where upon arrival, Jackson takes a moment to smooth back his black hair with his hand. Inside an office, Adrienne engages in a conversation with Satnam over the Internet, closely observing the marked expressions of concentration and concern on the faces of both Satnam and Professor West, who is present in the room. Adrienne, taken aback, opens her mouth in surprise and instinctively straightens her posture away from the computer screen; then, with eyes widened in realization, she frowns while diverting her gaze out the window. There, she notices Jackson interacting with Lily and Noah outside, lifting Lily up with care, his head turning subtly to glance around with a hint of caution toward Professor West sitting behind him. As Adrienne continues to watch, Satnam ends the call, then turns his attention away from the computer to face his wife Aponna, who is kneeling by their son, Ajeet. As night approaches at Yellowstone, Charlie discreetly observes Jackson and the kids, keeping to the shadows. Adrienne boards a helicopter, preparing for departure while elsewhere, in the darkened office of the White House, Anheuser ends a phone call and takes a moment to gaze out of the French windows. Back at the campsite in Yellowstone, Jackson stands and looks up to see the helicopter flying overhead. He quickly opens his laptop, navigating to Google Maps to display a view of Yellowstone. Inside the tent, Noah tries to swat away a bothersome bug, but Jackson notices him sending a text on a cellphone and promptly confiscates it. In response, Noah zips the tent door closed with a hint of defiance, leaving Jackson inside where he sits back and reviews the text message. Later, Jackson is seated in his limo, busy typing on his laptop when he suddenly notices Charlie nearby, who is broadcasting from an RV surrounded by newspaper clippings. Charlie, with a beard that is noticeably darker than his unkempt long hair, glances around cautiously before leaning in close to the camera. Jackson's expression changes to one of skepticism, but he eventually nods with an air of calm acceptance. Meanwhile, inside a supermarket, Gordon embraces Kate affectionately. She offers a playful smirk as outside, a crack forms in the parking lot, rumbling ominously beneath a car and moving toward another. The crack continues its path into the supermarket, leading Gordon to quickly find an item nearby and hand it to Kate at the checkout. As a customer's trolley slowly rolls away unattended, a crack emerges on the floor beneath it. Cereal boxes start to tremble and rattle as Kate instinctively reaches out to steady them, only for a substantial fissure to tear through the floor between her and the shelves. Back at Yellowstone, Lily feels an itch and scratches distractedly, while Noah exchanges a grave look with Jackson. In the White House, Anheuser trails behind Wilson as they advance into the situation room, prepared for urgent discussions. Simultaneously, a well-dressed, middle-aged man approaches the boxer's corner of the ring as the fight is about to commence. Seated beside the glamorous, young, blonde Tamara, Uri turns his attention to his mobile phone, pressing his thumb against the screen to authenticate his identity. Uri then looks up with a blank expression, stands, and exits the arena, checking the time on his watch as he moves through the crowd, all while Tamara rises and calls out to him, trying to catch his attention. Noticing Uri's departure, Sultan, a fighter in the ring, is struck by a massive hit and rushes toward the canvas, feeling the urgency of the moment. Meanwhile, Jackson remains behind the wheel of the limo, driving while the kids gradually drift off to sleep in the back seat, their eyes closing in the gentle motion of the vehicle."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He reports into a walkie-talkie about the basin's activity as Long-hair Charlie eats a pickle. Jackson, sitting in the army jeep with the kids and soldiers, arrives at a busy research facility and smooths back his black hair. In an office, Adrienne converses with Satnam online and notes the expressions of Satnam and Professor West. Surprised, Adrienne steps back from the computer and observes Jackson interacting with Lily and Noah, while West watches from behind. Satnam disconnects and turns to his family. At Yellowstone, Charlie observes Jackson and the kids as night falls. Adrienne boards a helicopter, while Anheuser, in his White House office, looks out the French windows after a phone call. At the Yellowstone campsite, Jackson sees the helicopter overhead, checks Google Maps on his laptop, and notices Noah texting in the tent. He takes the phone from Noah, who then closes the tent door, leaving Jackson to read the text. In his limo, Jackson works on his laptop and spots Charlie broadcasting from an RV surrounded by newspaper clippings. Jackson assesses the situation with some skepticism but decides to nod in agreement. Meanwhile, Gordon hugs Kate in a supermarket, where a crack appears outside and spreads inside. He hands her an item at the checkout as a crack and shaking cereal boxes disrupt the store. Back at Yellowstone, Lily scratches, and Noah exchanges a serious look with Jackson. Anheuser enters the White House situation room with Wilson, as a middle-aged man approaches a boxer's corner at a match beginning. Uri, sitting with Tamara, confirms his identity on his mobile, stands to leave, and checks his watch, prompting Tamara to call after him. Sultan notices Uri's departure during a hit in the ring and rushes to the canvas. Jackson drives the sleeping kids in the limo."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He reports into a walkie-talkie on the activity by the basin, a common feature in natural landscapes used for water collection, as Long-hair Charlie scarfs a pickle. Jackson sits in the passenger seat of an army jeep, a vehicle often used by military personnel for rugged terrain, the kids in the back, while soldiers crouch behind him. They arrive at a busy research facility, a hub of scientific investigation and discovery, where Jackson smooths back his black hair. In an office with Professor West, known for pioneering work in climate science, Adrienne talks to Satnam via the Internet, the global network that facilitates instant communication, and observes the great expression worn by Satnam and West. Mouth agape, Adrienne straightens away from the computer screen, then wide-eyed, she frowns while looking out the window and spotting Jackson knocking about with Lily and Noah. She watches as Jackson lifts up Lily and looks around furtively at West, who sits behind him. Satnam disconnects and turns to his wife Aponna, kneeling by his son, Ajeet, a family known in their community for their hospitality. At Yellowstone, the world's first national park known for its geothermal features, Charlie spies on Jackson and the kids as night falls. Adrienne climbs on board a helicopter, a crucial transport in remote and emergency situations, while in his darkened office at the White House, the official residence of the U.S. president, Anheuser hangs up the phone and looks out of the French windows, known for offering expansive views. At the campsite in Yellowstone, Jackson watches the chopper fly overhead, bringing up Google Maps on his laptop to show Yellowstone's vast expanse of wilderness. In the tent, Noah swats a bug, a common annoyance in the great outdoors, but Jackson spots him sending a text on a cell phone, a modern communication device, and takes it from him. Noah zips the door closed on Jackson, who sits back and reads the text. Jackson sits in his limo, a symbol of luxury and comfort, typing on his laptop when he spots Charlie nearby broadcasting from an RV, a mobile home that allows for a nomadic lifestyle. Newspaper clippings surround Charlie, who has a beard darker than his long, straggly hair and looks around furtively, then leans in close. Jackson frowns dubiously, then nods calmly. Meanwhile, Gordon hugs Kate in a supermarket, a modern marketplace for food and goods, and she smirks as a crack appears in the car park outside, rumbling beneath a car and approaching another. As it spreads in the supermarket, he finds something nearby and hands it to her at the checkout, where a customer's trolley rolls slowly away, and a crack appears on the floor. Cereal boxes shake as Kate reaches out for them, and a large crack tears through the floor between them. At Yellowstone, Lily scratches, and Noah looks gravely at Jackson. Anheuser follows Wilson into the White House situation room, a secure area for national crisis response, while a well-dressed, middle-aged man approaches the boxer's corner of the ring as the fight begins, a classic sport showcasing strength and strategy. Sitting by a glamorous, young, blonde Tamara, Uri looks at his mobile and presses his thumb to the screen to confirm his identity, using biometric security technology. Uri looks up blankly, stands up, and leaves the arena, checking his watch, a timepiece that symbolizes punctuality, as he goes, while Tamara stands and calls after him. Sultan spots Uri leaving, a massive hit on Sultan, and he runs to the canvas. Jackson drives the kids in the limo as they fall asleep in the back seat."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He reports into a walkietalkie on the activity by the basin as Longhair Charlie scarfs a pickle. Jackson sits in the passenger seat of an army jeep the kids in the back while soldiers crouch behind him. They arrive at a busy research facility where Jackson smooths back his black hair. In an office with Professor West Adrienne talks to Satnam via the Internet and observes the great expression worn by Satnam and West. Mouth agape. Adrienne straightens away from the computer screen then wideeyed she frowns while looking out the window and spotting Jackson knocking about with Lily and Noah. She watches as Jackson lifts up Lily and looks around furtively at West who sits behind him. Satnam disconnects and turns to his wife Aponna kneeling by his son Ajeet. At Yellowstone Charlie spies on Jackson and the kids as night falls. Adrienne climbs on board a helicopter while in his darkened office at the White House Anheuser hangs up the phone and looks out of the French windows. At the campsite in Yellowstone Jackson watches the chopper fly overhead bringing up Google Maps on his laptop to show Yellowstone. In the tent Noah swats a bug but Jackson spots him sending a text on a cell phone and takes it from him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Noah zips the door closed on Jackson who sits back and reads the text. Jackson sits in his limo typing on his laptop when he spots Charlie nearby broadcasting from an RV. Newspaper clippings surround Charlie who has a beard darker than his long straggly hair and looks around furtively then leans in close. Jackson frowns dubiously then nods calmly. Meanwhile Gordon hugs Kate in a supermarket and she smirks as a crack appears in the car park outside rumbling beneath a car and approaching another. As it spreads in the supermarket he finds something nearby and hands it to her at the checkout where a customer's trolley rolls slowly away and a crack appears on the floor. Cereal boxes shake as Kate reaches out for them and a large crack tears through the floor between them. At Yellowstone Lily scratches and Noah looks gravely at Jackson. Anheuser follows Wilson into the White House situation room while a welldressed middleaged man approaches the boxer's corner of the ring as the fight begins. Sitting by a glamorous young blonde Tamara Uri looks at his mobile and presses his thumb to the screen to confirm his identity. Uri looks up blankly stands up and leaves the arena checking his watch as he goes while Tamara stands and calls after him. Sultan spots Uri leaving a massive hit on Sultan and he runs to the canvas. Jackson drives the kids in the limo as they fall asleep in the back seat."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He reports into a walkietalkie on the activity by the basin as Longhair Charlie scarfs a pickle. Jackson sits in the passenger seat of an army jeep the kids in the back while soldiers crouch behind him. They arrive at a busy research facility where Jackson smooths back his black hair. In an office with Professor West Adrienne talks to Satnam via the Internet and observes the great expression worn by Satnam and West. Mouth agape. Adrienne straightens away from the computer screen then wideeyed she frowns while looking out the window and spotting Jackson knocking about with Lily and Noah. She watches as Jackson lifts up Lily and looks around furtively at West who sits behind him. Satnam disconnects and turns to his wife Aponna kneeling by his son Ajeet. At Yellowstone Charlie spies on Jackson and the kids as night falls. Adrienne climbs on board a helicopter while in his darkened office at the White House Anheuser hangs up the phone and looks out of the French windows. At the campsite in Yellowstone Jackson watches the chopper fly overhead bringing up Google Maps on his laptop to show Yellowstone. In the tent Noah swats a bug but Jackson spots him sending a text on a cell phone and takes it from him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Noah zips the door closed on Jackson who sits back and reads the text. Jackson sits in his limo typing on his laptop when he spots Charlie nearby broadcasting from an RV. Newspaper clippings surround Charlie who has a beard darker than his long straggly hair and looks around furtively then leans in close. Jackson frowns dubiously then nods calmly. Meanwhile Gordon hugs Kate in a supermarket and she smirks as a crack appears in the car park outside rumbling beneath a car and approaching another. As it spreads in the supermarket he finds something nearby and hands it to her at the checkout where a customer's trolley rolls slowly away and a crack appears on the floor. Cereal boxes shake as Kate reaches out for them and a large crack tears through the floor between them. At Yellowstone Lily scratches and Noah looks gravely at Jackson. Anheuser follows Wilson into the White House situation room while a welldressed middleaged man approaches the boxer's corner of the ring as the fight begins. Sitting by a glamorous young blonde Tamara Uri looks at his mobile and presses his thumb to the screen to confirm his identity. Uri looks up blankly stands up and leaves the arena checking his watch as he goes while Tamara stands and calls after him. Sultan spots Uri leaving a massive hit on Sultan and he runs to the canvas. Jackson drives the kids in the limo as they fall asleep in the back seat."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He reports into a walkietalkie on the activity by the basin as Longhair Charlie scarfs a pickle. Jackson sits in the passenger seat of an army jeep the kids in the back while soldiers crouch behind him. They arrive at a busy research facility where Jackson smooths back his black hair. In an office with Professor West Adrienne talks to Satnam via the Internet and observes the great expression worn by Satnam and West. Mouth agape. Adrienne straightens away from the computer screen then wideeyed she frowns while looking out the window and spotting Jackson knocking about with Lily and Noah. Cereal boxes shake as Kate reaches out for them and a large crack tears through the floor between them. At Yellowstone Lily scratches and Noah looks gravely at Jackson. Anheuser follows Wilson into the White House situation room while a welldressed middleaged man approaches the boxer's corner of the ring as the fight begins. Sitting by a glamorous young blonde Tamara Uri looks at his mobile and presses his thumb to the screen to confirm his identity. Uri looks up blankly stands up and leaves the arena checking his watch as he goes while Tamara stands and calls after him. Sultan spots Uri leaving a massive hit on Sultan and he runs to the canvas. Jackson drives the kids in the limo as they fall asleep in the back seat."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He reports into a walkietalkie on the activity by the basin as Longhair Charlie scarfs a pickle. Jackson sits in the passenger seat of an army jeep the kids in the back while soldiers crouch behind him. Uri looks up blankly stands up and leaves the arena checking his watch as he goes while Tamara stands and calls after him. Sultan spots Uri leaving a massive hit on Sultan and he runs to the canvas. Jackson drives the kids in the limo as they fall asleep in the back seat."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The squirrel whistles into a megaphone about the commotion by the fountain as Fluffy Sam munches a tomato. Parker stands in the driver's seat of a pirate ship, the birds in the hold, while bakers kneel behind him. They reach a bustling museum where Parker brushes back his red feathers. In a laboratory with Captain East, Bella dances with Raj via the radio and admires the puzzled look worn by Raj and East. Eyes wide, Bella leans away from the telescope, then open-mouthed, she scowls while glancing through the telescope and noticing Parker juggling pineapples with Poppy and Oscar. She observes as Parker tosses Poppy and glances around stealthily at East, who stands beside him. Raj disconnects and turns to his cousin Reema, knitting by his uncle, Vikram. At the Eiffel Tower, Sam snoops on Parker and the birds as day breaks. Bella swings onto a seaplane, while in his dimmed library at the Palace, Prince Joffrey hangs up the remote and stares out of the garden doors. At the festival in the Eiffel Tower, Parker observes the balloon sail high above, pulling up a treasure map on his tablet to highlight the Eiffel Tower. In the yurt, Oscar flicks a paper clip, but Parker observes him writing a letter on a typewriter and confiscates it. Oscar buttons the flap shut on Parker, who leans back and deciphers the letter. Parker lounges in his tricycle, writing on his tablet when he notices Sam nearby singing from a caravan. Comic strips surround Sam, who has a mane lighter than his short, wavy mane and peers around surreptitiously, then whispers closely. Parker scowls skeptically, then grins serenely. Meanwhile, Vance embraces Sophie in a factory, and she giggles as a crevice appears in the desert outside, rattling beneath a wagon and nearing another. As it widens in the factory, he grasps something nearby and passes it to her at the register, where a child's skateboard rolls gently away, and a gap emerges on the pavement. Milk cartons tremble as Sophie reaches for them, and a huge gap rips through the pavement between them. At the Eiffel Tower, Poppy sneezes, and Oscar looks sternly at Parker. Prince Joffrey trails King into the Palace briefing hall, while an elegantly dressed, senior woman approaches the actor's corner of the lounge as the show starts. Sitting beside a glamorous, young, brunette Sasha, Leo observes his tablet and taps his palm to the surface to confirm his password. Leo gazes ahead vacantly, rises, and exits the venue, glancing at his phone as he departs, while Sasha rises and calls after him. Sultan notices Leo leaving, a gentle breeze on Sultan, and he hops to the hammock. Parker navigates the birds in the tricycle as they doze off in the hold."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jackson, sitting in an army jeep with his kids and soldiers, arrives at a research facility to meet Professor West. Adrienne, in conversation with Satnam online, notices Jackson with Lily and Noah. At Yellowstone, Charlie spies on them as night falls. Adrienne boards a helicopter, while Anheuser, in the White House, observes from his office. At the campsite, Jackson uses Google Maps to check Yellowstone. Noah sends a text, which Jackson intercepts. Meanwhile, Charlie broadcasts from an RV as Jackson watches. In a supermarket, Gordon and Kate encounter cracks appearing in the floor, causing chaos. At Yellowstone, Lily scratches, and Noah looks concerned. In the White House, Anheuser enters the situation room, while in a boxing arena, Uri checks his phone, leaves abruptly, and Sultan is hit during the fight. Jackson drives his kids in a limo as they sleep in the back seat."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Jackson drives the kids in the limo as they fall asleep in the back seat Sultan spots Uri leaving a massive hit on Sultan and he runs to the canvas Uri looks up blankly stands up and leaves the arena checking his watch as he goes while Tamara stands and calls after him Sitting by a glamorous young blonde Tamara Uri looks at his mobile and presses his thumb to the screen to confirm his identity Anheuser follows Wilson into the White House situation room while a welldressed middleaged man approaches the boxer's corner of the ring as the fight begins At Yellowstone Lily scratches and Noah looks gravely at Jackson Cereal boxes shake as Kate reaches out for them and a large crack tears through the floor between them As it spreads in the supermarket he finds something nearby and hands it to her at the checkout where a customer's trolley rolls slowly away and a crack appears on the floor Meanwhile Gordon hugs Kate in a supermarket and she smirks as a crack appears in the car park outside rumbling beneath a car and approaching another Jackson frowns dubiously then nods calmly Newspaper clippings surround Charlie who has a beard darker than his long straggly hair and looks around furtively then leans in close Jackson sits in his limo typing on his laptop when he spots Charlie nearby broadcasting from an RV Noah zips the door closed on Jackson who sits back and reads the text In the tent Noah swats a bug but Jackson spots him sending a text on a cell phone and takes it from him At the campsite in Yellowstone Jackson watches the chopper fly overhead bringing up Google Maps on his laptop to show Yellowstone Adrienne climbs on board a helicopter while in his darkened office at the White House Anheuser hangs up the phone and looks out of the French windows At Yellowstone Charlie spies on Jackson and the kids as night falls Satnam disconnects and turns to his wife Aponna kneeling by his son Ajeet She watches as Jackson lifts up Lily and looks around furtively at West who sits behind him Adrienne straightens away from the computer screen then wideeyed she frowns while looking out the window and spotting Jackson knocking about with Lily and Noah Mouth agape In an office with Professor West Adrienne talks to Satnam via the Internet and observes the great expression worn by Satnam and West They arrive at a busy research facility where Jackson smooths back his black hair Jackson sits in the passenger seat of an army jeep the kids in the back while soldiers crouch behind him He reports into a walkietalkie on the activity by the basin as Longhair Charlie scarfs a pickle"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Jackson sits in the passenger seat of an army jeep the kids in the back while soldiers crouch behind him He reports into a walkietalkie on the activity by the basin as Longhair Charlie scarfs a pickle In an office with Professor West Adrienne talks to Satnam via the Internet and observes the great expression worn by Satnam and West They arrive at a busy research facility where Jackson smooths back his black hair Adrienne straightens away from the computer screen then wideeyed she frowns while looking out the window and spotting Jackson knocking about with Lily and Noah Mouth agape Satnam disconnects and turns to his wife Aponna kneeling by his son Ajeet She watches as Jackson lifts up Lily and looks around furtively at West who sits behind him Adrienne climbs on board a helicopter while in his darkened office at the White House Anheuser hangs up the phone and looks out of the French windows At Yellowstone Charlie spies on Jackson and the kids as night falls In the tent Noah swats a bug but Jackson spots him sending a text on a cell phone and takes it from him At the campsite in Yellowstone Jackson watches the chopper fly overhead bringing up Google Maps on his laptop to show Yellowstone Jackson sits in his limo typing on his laptop when he spots Charlie nearby broadcasting from an RV Noah zips the door closed on Jackson who sits back and reads the text Jackson frowns dubiously then nods calmly Newspaper clippings surround Charlie who has a beard darker than his long straggly hair and looks around furtively then leans in close As it spreads in the supermarket he finds something nearby and hands it to her at the checkout where a customer's trolley rolls slowly away and a crack appears on the floor Meanwhile Gordon hugs Kate in a supermarket and she smirks as a crack appears in the car park outside rumbling beneath a car and approaching another At Yellowstone Lily scratches and Noah looks gravely at Jackson Cereal boxes shake as Kate reaches out for them and a large crack tears through the floor between them Sitting by a glamorous young blonde Tamara Uri looks at his mobile and presses his thumb to the screen to confirm his identity Anheuser follows Wilson into the White House situation room while a welldressed middleaged man approaches the boxer's corner of the ring as the fight begins Sultan spots Uri leaving a massive hit on Sultan and he runs to the canvas Uri looks up blankly stands up and leaves the arena checking his watch as he goes while Tamara stands and calls after him Jackson drives the kids in the limo as they fall asleep in the back seat"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Jackson sits in his limo typing on his laptop when he spots Charlie nearby broadcasting from an RV Newspaper clippings surround Charlie who has a beard darker than his long straggly hair and looks around furtively then leans in close Jackson frowns dubiously then nods calmly Meanwhile Gordon hugs Kate in a supermarket and she smirks as a crack appears in the car park outside rumbling beneath a car and approaching another As it spreads in the supermarket he finds something nearby and hands it to her at the checkout where a customer's trolley rolls slowly away and a crack appears on the floor Cereal boxes shake as Kate reaches out for them and a large crack tears through the floor between them At Yellowstone Lily scratches and Noah looks gravely at Jackson Anheuser follows Wilson into the White House situation room while a welldressed middleaged man approaches the boxer's corner of the ring as the fight begins Sitting by a glamorous young blonde Tamara Uri looks at his mobile and presses his thumb to the screen to confirm his identity Uri looks up blankly stands up and leaves the arena checking his watch as he goes while Tamara stands and calls after him Sultan spots Uri leaving a massive hit on Sultan and he runs to the canvas Jackson drives the kids in the limo as they fall asleep in the back seat He reports into a walkietalkie on the activity by the basin as Longhair Charlie scarfs a pickle Jackson sits in the passenger seat of an army jeep the kids in the back while soldiers crouch behind him They arrive at a busy research facility where Jackson smooths back his black hair In an office with Professor West Adrienne talks to Satnam via the Internet and observes the great expression worn by Satnam and West Mouth agape Adrienne straightens away from the computer screen then wideeyed she frowns while looking out the window and spotting Jackson knocking about with Lily and Noah She watches as Jackson lifts up Lily and looks around furtively at West who sits behind him Satnam disconnects and turns to his wife Aponna kneeling by his son Ajeet At Yellowstone Charlie spies on Jackson and the kids as night falls Adrienne climbs on board a helicopter while in his darkened office at the White House Anheuser hangs up the phone and looks out of the French windows At the campsite in Yellowstone Jackson watches the chopper fly overhead bringing up Google Maps on his laptop to show Yellowstone In the tent Noah swats a bug but Jackson spots him sending a text on a cell phone and takes it from him Noah zips the door closed on Jackson who sits back and reads the text"
        }
      ]
    }
  ]
}