{
  "ground_truth": "Jackson pulls up outside Kate's house in the early morning dew, climbs out of the limo, and opens the back door. Kate comes outside, and they hug. Jackson watches by the limo as Gordon comes outside, smiles, and waves to Lily as she goes inside. Kate turns, and he holds his phone up. Kate goes indoors while Jackson gets back into the limo and changes into a chauffeur's uniform. Tamara looks fondly at her little Pekingese dog, Caesar. Jackson pulls up on the driveway outside Yuri's palatial mansion in Bel Air, where curly-haired twin boys Alec and Oleg wait on the steps. They both check their watches as Jackson takes their luggage over to the boot. Jackson pulls up on the runway at Santa Monica Airport and jumps out as Yuri's pilot Sasha marches over. A case hits Alec's foot, and Oleg glares over a shoulder as he boards the waiting plane. Jackson gets in the limo and switches on the radio. Meanwhile, Gordon watches TV over breakfast when the whole house shakes violently, prompting Gordon, Kate, and the kids to climb under the table. On the TV, the press conference is similarly affected. Jackson pulls up outside and heads indoors as the house rocks unpredictably then collapses. They board the limo as the trees fall off ahead of them. Jackson reverses the limo, and the back door is knocked off. He bumps on a Porsche, and it falls into an earthquake, while Gordon is slightly pissed. Jackson sets off at high speed as the street falls to pieces, and the creeks off the road rear up savagely behind them, with Kate in the back seat holding Lily. The collapsing road rushes out to them, as two old ladies drive steadily ahead. Jackson powers through gardens, and the old lady powers into a rising section of the road. The limo soars over a gap as buildings have obliterated all around them, sewage throws on the windscreen, and a giant donut rolls across the road. The race freeway breaks in half, and a missed truck smashes into a petrol station and explodes. They drive alongside the collapsing bridge as cars fall from the freeway, smashing into the road around the limo. They approach a huge gap, and Jackson spins the limo into a type hole and accelerates over a pass beneath the freeway. Jackson drives the limo into a ramp and drives into the collapsing building's ground floor while a high-rise falls on the road, and the limo smashes out of the other side. In the corridor of the White House, in the airport, the pilot lies dead near the petrol station as Jackson's limo pulls up. Jackson grabs his case from the limo as a giant fissure hole causes havoc and destruction as it arrows towards the airport, and the runway starts to collapse.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Jackson stops up outside Kate's residence in the early sunrise moisture, exits from the limousine, and unlocks the rear door. Kate steps outside, and they embrace. Jackson observes by the limousine as Gordon steps outside, grins, and gestures to Lily as she goes indoors. Kate turns, and he raises his mobile. Kate goes inside while Jackson enters the limousine and changes into a driver's garb. Tamara gazes fondly at her small Pekingese canine, Caesar. Jackson stops up on the driveway outside Yuri's grand estate in Bel Air, where curly-haired twin boys Alec and Oleg await on the stairs. They both glance at their timepieces as Jackson carries their baggage over to the trunk. Jackson stops up on the runway at Santa Monica Airport and leaps out as Yuri's aviator Sasha strides over. A case strikes Alec's foot, and Oleg stares over a shoulder as he boards the awaiting aircraft. Jackson enters the limousine and switches on the stereo. Meanwhile, Gordon watches television over breakfast when the entire dwelling shakes vigorously, prompting Gordon, Kate, and the children to hide under the table. On the television, the press briefing is similarly affected. Jackson stops up outside and heads indoors as the dwelling rocks unpredictably then collapses. They board the limousine as the trees topple off in front of them. Jackson reverses the limousine, and the rear door is knocked off. He bumps into a Porsche, and it plunges into a quake, while Gordon is somewhat irate. Jackson sets off at high velocity as the street crumbles, and the crevices off the road rear up fiercely behind them, with Kate in the rear seat holding Lily. The crumbling road rushes towards them, as two elderly women drive steadily ahead. Jackson powers through gardens, and the elderly woman powers into a rising portion of the road. The limousine soars over a gap as edifices have obliterated all around them, sewage hurls on the windshield, and a giant donut rolls across the street. The racing highway splits in half, and a missed lorry crashes into a fuel station and detonates. They drive alongside the collapsing overpass as vehicles fall from the highway, crashing into the street around the limousine. They approach a vast gap, and Jackson spins the limousine into a type hole and accelerates over a pass beneath the highway. Jackson drives the limousine onto a ramp and drives into the collapsing building's ground level while a high-rise falls on the street, and the limousine crashes out of the other side. In the corridor of the White House, in the airfield, the aviator lies deceased near the fuel station as Jackson's limousine stops up. Jackson grabs his case from the limousine as a giant crevice hole causes chaos and ruin as it arrows towards the airfield, and the runway starts to collapse."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Jackson pulls up outside Kate's house in the early morning dew, and the back door is opened by him after he climbs out of the limo. Kate comes outside, and she is hugged by him. The limo is watched by Jackson as Gordon comes outside, smiles, and waves to Lily while she goes inside. Kate turns, and his phone is held up by him. Kate goes indoors while Jackson gets back into the limo and changes into a chauffeur's uniform. Tamara looks fondly at her little Pekingese dog, Caesar. On the driveway outside Yuri's palatial mansion in Bel Air, the limo is pulled up by Jackson, where curly-haired twin boys Alec and Oleg wait on the steps. Their watches are both checked by them as their luggage is taken by Jackson over to the boot. On the runway at Santa Monica Airport, Jackson pulls up and jumps out as Yuri's pilot Sasha marches over. Alec's foot is hit by a case, and Oleg glares over a shoulder as he boards the waiting plane. The limo is entered by Jackson, and the radio is switched on by him. Meanwhile, TV is watched by Gordon over breakfast when the whole house shakes violently, prompting Gordon, Kate, and the kids to climb under the table. On the TV, the press conference similarly affects the house. Outside, Jackson pulls up and heads indoors as the house is rocked unpredictably and then collapses. The limo is boarded by them as the trees fall off ahead of them. The limo is reversed by Jackson, and the back door knocks off. He bumps on a Porsche, and an earthquake causes it to fall, while Gordon is slightly pissed. High speed is set off by Jackson as the street falls to pieces, and off the road, the creeks rear up savagely behind them, with Lily being held by Kate in the back seat. The collapsing road rushes out to them as two old ladies drive steadily ahead. Gardens are powered through by Jackson, and the old lady powers into a rising section of the road. Over a gap, the limo soars as all around them, buildings have obliterated, sewage is thrown on the windscreen, and a giant donut rolls across the road. The race freeway breaks in half, and a truck that was missed smashes into a petrol station and explodes. Alongside the collapsing bridge, they drive as cars fall from the freeway, smashing into the road around the limo. A huge gap is approached by them, and the limo is spun by Jackson into a type hole and accelerates over a pass beneath the freeway. Into a ramp, Jackson drives the limo and enters the collapsing building's ground floor while the road is fallen on by a high-rise, and the other side is smashed out of by the limo. In the corridor of the White House, at the airport, the pilot lies dead near the petrol station, and Jackson's limo pulls up. From the limo, Jackson grabs his case as havoc and destruction is caused by a giant fissure hole as it arrows towards the airport, and the runway collapses."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In the early morning, Jackson arrives outside Kate's house, exits the limo, and opens the back door. Kate comes out, and they hug. Jackson stands by the limo as Gordon exits, waves to Lily, and smiles. Kate turns to Jackson, holding his phone, then goes indoors while Jackson changes into a chauffeur's uniform. Tamara looks fondly at her Pekingese, Caesar. Jackson drives to Yuri's mansion in Bel Air, where twin boys Alec and Oleg wait, checking their watches. Jackson loads their luggage into the trunk. At Santa Monica Airport, Jackson jumps out as Yuri's pilot Sasha approaches. Alec's foot gets hit by a case, and Oleg glares as he boards the plane. Jackson turns on the radio in the limo. Meanwhile, Gordon watches TV during breakfast when a violent shake prompts him, Kate, and the kids to hide under the table. Jackson arrives as the house collapses, and they hurriedly board the limo, dodging falling trees. Jackson reverses, losing the back door, and bumps a Porsche that falls into a quake, annoying Gordon. Jackson speeds away as the street crumbles, with creeks rising behind them and Kate holding Lily. The road collapses, and two old ladies drive ahead. Jackson drives through gardens, soaring over gaps as buildings are destroyed, sewage hits the windshield, and a giant donut rolls by. The freeway splits, and a truck crashes into a petrol station, exploding. Jackson drives alongside a collapsing bridge, cars falling around them. Facing a large gap, he spins the limo, accelerating beneath the freeway. Driving through a collapsing building, the limo smashes out the other side. Near the White House, at the airport, the pilot lies dead as Jackson arrives. He grabs his case, navigating chaos as the runway collapses under a giant fissure."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "In the early morning, Jackson arrives at Kate's house, exits the limo, and opens the door for her. They hug as Gordon appears, waves to Lily, and Kate enters the house. Jackson changes into a chauffeur uniform and drives to Yuri's mansion, where Alec and Oleg wait. He loads their luggage and heads to Santa Monica Airport. After a case hits Alec, Jackson turns on the radio as an earthquake shakes Gordon's house. Jackson arrives, and they escape the collapsing house in the limo. He reverses onto a Porsche, which falls into a quake, irritating Gordon. Jackson speeds through crumbling streets, dodging falling debris, while Kate holds Lily. The limo jumps over gaps and crashes through a collapsing building. Finally, Jackson approaches the airport as the runway crumbles, grabbing his case amid the chaos."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the early morning, with the fresh dew still glistening on the grass, Jackson smoothly pulls up outside Kate's house in a sleek limousine. He gracefully exits the luxurious vehicle, making his way to the back door, which he opens with a respectful gesture. As Kate steps outside, the two share a warm embrace, a moment of connection in the quiet stillness of the morning. Jackson stands beside the limo attentively, his eyes following as Gordon emerges from the house, offering a friendly smile and a cheerful wave in Lily's direction as she moves inside. Kate then turns back, and Jackson lifts his phone, capturing the moment before she heads back indoors.\n\nJackson, with a composed demeanor, returns to the limo and changes into his chauffeur's uniform, embodying the role with professionalism. Nearby, Tamara gazes with affection at Caesar, her beloved little Pekingese dog. The limo soon finds its way onto the sweeping driveway of Yuri's grand, palatial mansion located in the prestigious area of Bel Air. Waiting patiently on the steps are the curly-haired twin boys, Alec and Oleg, who simultaneously check their watches with eager anticipation as Jackson carefully transfers their luggage to the trunk.\n\nNext, Jackson navigates the limo onto the runway at Santa Monica Airport, where he promptly leaps out of the vehicle as Sasha, Yuri's pilot, strides purposefully over to meet him. During this bustling activity, a case unexpectedly lands on Alec's foot, prompting Oleg to cast a sharp glare over his shoulder as he makes his way onto the waiting plane. Jackson, maintaining his focus, slides back into the limo's front seat and turns on the radio, filling the air with music.\n\nWhile all this unfolds, Gordon is engrossed in watching TV over breakfast when the entire house suddenly shakes with violent intensity. Acting swiftly, Gordon, along with Kate and the kids, seek safety beneath the sturdy dining table. Meanwhile, the TV screen reveals that a press conference is experiencing similar tremors. Outside, Jackson arrives and steps indoors just as the house begins to rock erratically, ultimately leading to its devastating collapse. Amidst the chaos, they scramble aboard the limo, with towering trees losing their hold and crashing down in front of them.\n\nIn a rapid maneuver, Jackson reverses the limo, only for its back door to be forcefully removed in the ensuing turmoil. As he bumps into a Porsche, it tumbles into the depths of a widening earthquake chasm, an occurrence that leaves Gordon visibly disgruntled. Undeterred, Jackson accelerates with urgency as the very street beneath them crumbles into disarray, and the creeks lining the road rear up menacingly. Seated in the backseat, Kate holds Lily protectively, their worlds thrown into chaos.\n\nThe road, now a scene of devastation, rushes toward them with relentless ferocity, even as two elderly ladies drive calmly ahead, seemingly unfazed. Jackson navigates the limo through gardens, adeptly avoiding obstacles, while one of the old ladies drives into a section of road that suddenly rises up. With impressive skill, the limo soars across a chasm, surrounded by collapsing buildings, sewage splattering across the windshield, and a massive donut rolling unexpectedly across their path.\n\nAs the racing freeway splits apart, a nearby truck, narrowly missed, crashes into a petrol station, triggering an explosive detonation. Racing alongside the crumbling bridge, cars fall from the elevated freeway, crashing onto the road around the speeding limo. Jackson approaches a significant gap, expertly spinning the limo into a narrow opening and accelerating beneath the still-intact section of the freeway.\n\nWith precision and determination, Jackson drives the limo up a ramp and into the ground floor of a collapsing building, emerging unscathed on the other side as a nearby high-rise topples onto the road. Meanwhile, in a bustling corridor of the White House airport, the pilot lies lifeless near the petrol station, while Jackson's limo finally pulls up at the scene. Jackson, ever the picture of resilience, retrieves his case from the limo amidst the chaos, where a giant fissure carves its way toward the airport, wreaking havoc as the runway starts to collapse under the immense pressure."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the tranquil hours of early morning, as the fresh dew still sparkles and glistens on the lush green grass, Jackson skillfully pulls up in front of Kate’s residence in a sleek, elegant limousine. Exuding a composed demeanor, he gracefully exits the luxurious vehicle and makes his way to the back door. With a respectful gesture, he opens it, and as Kate steps outside, they share a warm embrace, a tender moment of connection amid the quiet stillness of the morning. Standing attentively beside the limo, Jackson watches as Gordon emerges from the house. Gordon offers a friendly smile and a cheerful wave in Lily's direction as she moves inside. Kate then turns back, and Jackson, with his phone in hand, captures the heartfelt moment before she heads back indoors.\n\nJackson, maintaining a professional air, returns to the limo where he changes into his polished chauffeur’s uniform, fully embracing the role with a sense of duty and professionalism. Nearby, Tamara gazes affectionately at Caesar, her cherished little Pekingese dog. The limo soon finds its way onto the expansive driveway of Yuri’s grand, palatial mansion, located in the prestigious area of Bel Air. Standing patiently on the front steps are the curly-haired twin boys, Alec and Oleg, who simultaneously check their watches, eagerly anticipating the next move as Jackson carefully transfers their luggage to the trunk of the limo.\n\nNext, Jackson skillfully navigates the limo onto the runway at Santa Monica Airport. He promptly leaps out of the vehicle as Sasha, Yuri's confident pilot, strides purposefully over to meet him. Amidst this bustling activity, an unexpected mishap occurs as a case inadvertently lands on Alec's foot. Oleg, in response, casts a sharp glare over his shoulder while making his way onto the waiting plane. Jackson, maintaining his unwavering focus, slides back into the limo's front seat and turns on the radio, filling the air with the harmonious sound of music.\n\nWhile all this unfolds outside, inside the house, Gordon is absorbed in watching television over breakfast. Suddenly, the entire house is jolted with violent intensity, causing chaos. Acting swiftly, Gordon, along with Kate and the kids, instinctively seek refuge beneath the sturdy dining table. Simultaneously, the TV screen depicts that a press conference is also experiencing similar tremors. Outside, Jackson arrives promptly and steps indoors just as the house begins to rock erratically. Ultimately, this leads to its devastating collapse. Amidst the ensuing chaos, they scramble aboard the limo, with towering trees losing their grip and crashing dramatically down before them.\n\nIn a rapid and dexterous maneuver, Jackson reverses the limo, but in the chaotic turmoil, its back door is violently sheared away. As he inadvertently bumps into a Porsche, it tragically tumbles into the depths of a widening earthquake chasm, an occurrence that visibly leaves Gordon disgruntled. However, undeterred by the chaos surrounding them, Jackson accelerates with urgency as the very street beneath them crumbles into disarray. The creeks lining the road rear up menacingly, adding to the turmoil. Seated in the backseat, Kate holds Lily protectively, their world thrown into a whirlwind of chaos.\n\nThe road becomes a scene of complete devastation, rushing toward them with relentless ferocity. Meanwhile, two elderly ladies drive calmly ahead, seemingly unfazed by the pandemonium. Jackson navigates the limo with precision through gardens, skillfully avoiding one obstacle after another. In a surprising turn, one of the old ladies drives into a section of the road that suddenly rises up. With impressive skill, the limo soars across a chasm, surrounded by collapsing buildings, sewage splattering across the windshield, and a massive donut rolling unexpectedly across their path.\n\nAs the racing freeway splits apart, a nearby truck, narrowly missed, crashes into a petrol station, triggering a catastrophic explosion. Racing alongside the crumbling bridge, cars fall from the elevated freeway, crashing dangerously onto the road around the speeding limo. Approaching a significant gap, Jackson expertly spins the limo into a narrow opening and accelerates beneath the still-intact section of the freeway.\n\nWith remarkable precision and unwavering determination, Jackson drives the limo up a ramp and into the ground floor of a collapsing building, emerging unscathed on the other side as a nearby high-rise topples dramatically onto the road behind them. Meanwhile, in a bustling corridor of the White House airport, chaos reigns as the pilot lies lifeless near the petrol station. Amidst this chaos, Jackson's limo finally pulls up at the scene, and ever the picture of resilience, he retrieves his important case from the limo. Outside, a giant fissure carves its destructive path toward the airport, wreaking havoc as the runway starts to collapse under the immense pressure."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the early morning, Jackson arrives outside Kate's house, carefully navigating the limo through the subtle embrace of the morning dew before bringing the vehicle to a gentle stop. As he exits the driver's seat, he deliberately circles around to the back, pulling open the door with a practiced motion. Kate steps outside, and they embrace warmly, sharing a silent moment of mutual understanding and comfort. Standing a short distance from the limo, Jackson observes with attentive eyes as Gordon emerges from the house, his face breaking into a friendly smile as he waves to Lily, who is making her way inside. With a subtle nod, Kate turns back toward the house, prompting Jackson to lift his phone, holding it poised and ready as she slips indoors. As the door closes behind her, Jackson smoothly reenters the limo, settling into the seat as he changes with purpose into a chauffeur's uniform. Meanwhile, Tamara's gaze is filled with affection as she looks down at her beloved Pekingese dog, Caesar. The limo glides onto the driveway of Yuri's expansive mansion in Bel Air, where the identical curly-haired twin boys, Alec and Oleg, wait patiently on the steps, their eyes frequently darting to their watches as they track the time. Jackson efficiently transfers their luggage, handling it with care as he stows it securely in the boot. Next, the limo advances onto the runway at Santa Monica Airport, where Jackson promptly exits the vehicle just as Yuri's pilot, Sasha, strides over with determination. In a moment of clumsy handling, a case lands heavily on Alec's foot, eliciting a sharp glare from Oleg as he proceeds to board the plane. Back inside the limo, Jackson turns on the radio, filling the vehicle with a soundtrack as he drives. Meanwhile, Gordon, seated at breakfast, watches TV—the tranquility abruptly shattered as the entire house shakes violently. Acting on instinct, Gordon, along with Kate and the children, swiftly crawl under the table for safety. On the TV screen, the ongoing press conference is interrupted by the same tremors affecting the house. Outside, the ground continues to heave unpredictably as Jackson makes his way indoors. The moment the house begins to tremble and finally collapses, chaos erupts, prompting the family to quickly board the limo. With the trees ahead toppling over, Jackson forcefully reverses the limo, resulting in the back door getting torn off in the process. In the ensuing chaos, he collides with a Porsche, causing it to disappear into a yawning earthquake fissure—an action that leaves Gordon visibly irritated. Unfazed, Jackson accelerates rapidly down the disintegrating street, dodging sections of the road that rear up behind them with savage force, Kate holding onto Lily tightly in the back seat. The crumbling pavement races toward them, while two elderly women drive ahead at a steady pace. Determined to escape, Jackson takes a daring detour through the surrounding gardens, just as one of the elderly women courageously drives her car into an uplifting section of the road. In a breath-taking leap, the limo soars over a widening gap, with buildings collapsing in every direction, sewage splattering across the windscreen, and a giant donut rolling ominously across their path. As they speed onward, the freeway before them fractures violently, narrowly avoiding a collision as a speeding truck crashes into a petrol station, resulting in a massive explosion. The limo edges alongside a disintegrating bridge, with cars plummeting from the freeway, smashing chaotically onto the road around them. Approaching a daunting chasm, Jackson deftly spins the limo into a makeshift hole, accelerating hard as he navigates over a precarious pass beneath the freeway. With unwavering focus, he drives the limo onto a ramp, deftly steering into the ground floor of a collapsing building. In a dramatic escape, the limo bursts out the other side just as a high-rise topples onto the road. Amidst this chaos, within the corridors of the White House, the scene shifts to the airport, where Yuri's pilot lies lifeless near the petrol station, and Jackson's limo pulls up. Seizing his case from the vehicle, Jackson faces the frenzy of destruction as a massive fissure wreaks havoc, cutting a destructive path toward the airport, collapsing the runway in its wake."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jackson arrives at Kate's house in the limo early in the morning, greets her with a hug, and then waits by the car as Gordon waves to Lily. Kate heads inside, and Jackson changes into a chauffeur's uniform in the limo. Meanwhile, Tamara affectionately observes her Pekingese dog, Caesar. Jackson drives to Yuri's mansion in Bel Air, where twin boys Alec and Oleg are waiting. After loading their luggage, he drives them to Santa Monica Airport. As they board the plane, Alec's foot is hit by a case, and Oleg casts a glare. Jackson listens to the radio and soon, at Gordon's house, an earthquake disrupts their morning, sending the family under the table. Jackson arrives just as the house collapses, and they quickly board the limo to escape. As Jackson maneuvers the limo through a falling neighborhood, he clips a Porsche, loses the back door, while Gordon is annoyed. With Kate holding Lily in the back seat, Jackson races through chaotic streets, navigating around collapsing roads and obstacles like falling trees, debris, and a giant rolling donut. Buildings crumble around them, and he expertly drives through gardens, over a gap, and beneath a freeway pass. The limo navigates through a collapsing building and emerges safely on the other side. As they reach the airport, Jackson grabs his case from the limo amidst chaos, dodging a giant fissure as the runway begins to cave in around them."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Jackson pulls up outside Kate's house in the early morning dew, a time when mist often hangs lightly over suburban lawns, climbs out of the chauffeur-driven limo, and opens the back door. Kate, dressed for a day filled with unknown adventures, comes outside, and they hug warmly. Jackson, maintaining the demeanor of a professional driver, watches by the limo as Gordon, Kate's jovial and caring neighbor, comes outside, smiles, and waves to Lily, Kate’s young daughter, as she goes inside. Kate turns, and he discreetly holds his phone up to capture the moment. Kate goes indoors while Jackson gets back into the limo and changes into a crisp chauffeur's uniform, a transformation that marks his readiness for the tasks ahead. Tamara, Kate's old college friend who has an affinity for small dogs, looks fondly at her little Pekingese dog, Caesar, a breed known for its companionship and historic ties to Chinese nobility. \n\nJackson pulls up on the expansive, gated driveway outside Yuri's palatial mansion in Bel Air, a neighborhood in Los Angeles renowned for its luxurious homes and celebrity residents, where curly-haired twin boys Alec and Oleg wait impatiently on the steps. They both check their watches, perhaps conscious of the tight schedule, as Jackson efficiently takes their luggage over to the boot. Jackson pulls up on the private runway at Santa Monica Airport, a coastal airport favored by private jet owners, and jumps out as Yuri's pilot Sasha, a seasoned aviator with years of experience, marches over. A case unexpectedly hits Alec's foot, and Oleg glares over a shoulder in displeasure as he boards the waiting, sleek plane. Jackson, unfazed by the minor mishap, gets in the limo and switches on the radio to catch the latest news updates. Meanwhile, Gordon watches TV over a hearty breakfast when the whole house shakes violently due to an unexpected earthquake, prompting Gordon, Kate, and the kids to take cover under the sturdy dining table. On the TV, the press conference is similarly affected, showing officials scrambling for safety. \n\nJackson pulls up outside and heads indoors as the house rocks unpredictably then collapses, a stark reminder of nature’s fury. They quickly board the limo as the trees fall in front of them, uprooted by the tremors. Jackson reverses the limo with urgency, and the back door is knocked off in the chaos. He bumps into a Porsche, a luxury car brand synonymous with speed and style, and it falls into a newly formed earthquake fissure, while Gordon, understandably upset by the damage, is slightly pissed. Jackson sets off at high speed as the street falls to pieces behind them, and the creeks off the road rear up savagely, revealing the destructive power of tectonic shifts, with Kate in the back seat protectively holding Lily. The collapsing road rushes out to them, as two old ladies drive steadily ahead, seemingly unfazed by the chaos. Jackson powers the limo through gardens, narrowly avoiding obstacles, and the old lady powers into a rising section of the road that could trap them at any moment. The limo soars over a gap, an impossible feat achieved only in moments of sheer adrenaline, as buildings have been obliterated all around them, sewage from ruptured pipes splatters on the windscreen, and a giant donut, likely from a toppled diner sign, rolls across the road comically amid the destruction. The freeway breaks in half, and a missed truck, out of control, smashes into a petrol station and explodes in a fiery burst. They drive alongside the collapsing bridge, balancing on the edge of disaster, as cars fall from the freeway, smashing into the road around the limo. They approach a huge gap, and Jackson expertly spins the limo into a safer path, finding a type hole and accelerates over a pass beneath the freeway, dodging debris with remarkable skill.\n\nJackson drives the limo into a ramp and navigates into the collapsing building's ground floor while a high-rise, a symbol of urban growth, falls ominously on the road, and the limo smashes out of the other side unscathed. In the corridor of the White House, no doubt bustling with urgent activity, in the airport, the pilot, who bravely attempted to maintain control, lies dead near the petrol station as Jackson's limo pulls up, emphasizing the tragic human cost of natural disasters. Jackson grabs his case from the limo, containing important documents and valuables essential for their escape, as a giant fissure hole causes havoc and destruction, seismically shifting the landscape as it arrows towards the airport, and the runway starts to collapse, threatening the only way out of the chaos."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "dew climbs out of the limo and opens the back door Jackson pulls up outside Kate's house in the early morning They both check their watches as Jackson takes their luggage over to the boot dew climbs out of the limo and opens the back door Jackson powers through gardens and the old lady powers into a rising section of the road Kate comes outside and they hug Jackson watches by the limo as Gordon comes outside smiles and waves to Lily as she goes inside Kate turns and he holds his phone up Kate goes indoors while Jackson gets back into the limo and changes into a chauffeur's uniform Tamara looks fondly at her little Pekingese dog Caesar In the corridor of the White House in the airport the pilot lies dead Jackson pulls up on the driveway outside Yuri's palatial mansion in Bel Air where curlyhaired twin boys Alec and Oleg wait on the steps They both check their watches as Jackson takes their luggage over to the boot Jackson pulls up on the runway at Santa Monica Airport and jumps out as Yuri's pilot Sasha marches over They drive alongside the collapsing bridge as cars fall from the freeway smashing into the road around the limo A case hits Alec's foot and Oleg glares over a shoulder as he boards the waiting plane He bumps on a Porsche and it falls into an earthquake while Gordon is slightly pissed Jackson gets in the limo and switches on the radio Jackson watches by the limo as Gordon comes outside smiles and waves to Lily as she goes inside On the TV the press conference is similarly affected Jackson pulls up outside Kate's house in the early morning Meanwhile Gordon watches TV over breakfast when the whole house shakes violently prompting Gordon Kate and the kids to climb under the table On the TV the press conference is similarly affected Jackson pulls up outside and heads indoors as the house rocks unpredictably then collapses They board the limo as the trees fall off ahead of them Jackson reverses the limo and the back door is knocked off He bumps on a Porsche and it falls into an earthquake while Gordon is slightly pissed Jackson sets off at high speed as the street falls to pieces and the creeks off the road rear up savagely behind them with Kate in the back seat holding Lily The collapsing road rushes out to them as two old ladies drive steadily ahead Jackson powers through gardens and the old lady powers into a rising section of the road near the petrol station as Jackson's limo pulls up Kate comes outside and they hug The limo soars over a gap as buildings have obliterated all around them sewage throws on the windscreen and a giant donut rolls across the road The race freeway breaks in half and a missed truck smashes into a petrol station and explodes They drive alongside the collapsing bridge as cars fall from the freeway smashing into the road around the limo They approach a huge gap and Jackson spins the limo into a type hole and accelerates over a pass beneath the freeway Jackson drives the limo into a ramp and drives into the collapsing building's ground floor while a highrise falls on the road and the limo smashes out of the other side In the corridor of the White House in the airport the pilot lies dead near the petrol station as Jackson's limo pulls up Jackson sets off at high speed as the street falls to pieces and the creeks off the road rear up savagely behind them with Kate in the back seat holding Lily Kate turns and he holds his phone up The race freeway breaks in half and a missed truck smashes into a petrol station and explodes Jackson grabs his case from the limo as a giant fissure hole causes havoc and destruction as it arrows towards the airport and the runway starts to collapse Jackson pulls up on the driveway outside Yuri's palatial mansion in Bel Air where curlyhaired twin boys Alec and Oleg wait on the steps"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Jackson pulls up outside Kate's house in the early morning. dew climbs out of the limo and opens the back door. Kate comes outside and they hug. Jackson watches by the limo as Gordon comes outside smiles and waves to Lily as she goes inside. Kate turns and he holds his phone up. Kate goes indoors while Jackson gets back into the limo and changes into a chauffeur's uniform. Tamara looks fondly at her little Pekingese dog Caesar. Jackson pulls up on the driveway outside Yuri's palatial mansion in Bel Air where curlyhaired twin boys Alec and Oleg wait on the steps. They both check their watches as Jackson takes their luggage over to the boot. Jackson pulls up on the runway at Santa Monica Airport and jumps out as Yuri's pilot Sasha marches over. A case hits Alec's foot and Oleg glares over a shoulder as he boards the waiting plane. Jackson gets in the limo and switches on the radio. Meanwhile Gordon watches TV over breakfast when the whole house shakes violently prompting Gordon Kate and the kids to climb under the table. On the TV the press conference is similarly affected. Jackson pulls up outside and heads indoors as the house rocks unpredictably then collapses. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. They board the limo as the trees fall off ahead of them. Jackson reverses the limo and the back door is knocked off. He bumps on a Porsche and it falls into an earthquake while Gordon is slightly pissed. Jackson sets off at high speed as the street falls to pieces and the creeks off the road rear up savagely behind them with Kate in the back seat holding Lily. The collapsing road rushes out to them as two old ladies drive steadily ahead. Jackson powers through gardens and the old lady powers into a rising section of the road. The limo soars over a gap as buildings have obliterated all around them. sewage throws on the windscreen and a giant donut rolls across the road. The race freeway breaks in half and a missed truck smashes into a petrol station and explodes. They drive alongside the collapsing bridge as cars fall from the freeway smashing into the road around the limo. They approach a huge gap and Jackson spins the limo into a type hole and accelerates over a pass beneath the freeway. Jackson drives the limo into a ramp and drives into the collapsing building's ground floor while a highrise falls on the road and the limo smashes out of the other side. In the corridor of the White House in the airport the pilot lies dead. near the petrol station as Jackson's limo pulls up. Jackson grabs his case from the limo as a giant fissure hole causes havoc and destruction as it arrows towards the airport and the runway starts to collapse."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Jackson pulls up outside Kate's house in the early morning. dew climbs out of the limo and opens the back door. Kate comes outside and they hug. Jackson watches by the limo as Gordon comes outside smiles and waves to Lily as she goes inside. Kate turns and he holds his phone up. Kate goes indoors while Jackson gets back into the limo and changes into a chauffeur's uniform. Tamara looks fondly at her little Pekingese dog Caesar. Jackson pulls up on the driveway outside Yuri's palatial mansion in Bel Air where curlyhaired twin boys Alec and Oleg wait on the steps. They both check their watches as Jackson takes their luggage over to the boot. Jackson pulls up on the runway at Santa Monica Airport and jumps out as Yuri's pilot Sasha marches over. A case hits Alec's foot and Oleg glares over a shoulder as he boards the waiting plane. Jackson gets in the limo and switches on the radio. Meanwhile Gordon watches TV over breakfast when the whole house shakes violently prompting Gordon Kate and the kids to climb under the table. On the TV the press conference is similarly affected. Jackson pulls up outside and heads indoors as the house rocks unpredictably then collapses. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. They board the limo as the trees fall off ahead of them. Jackson reverses the limo and the back door is knocked off. He bumps on a Porsche and it falls into an earthquake while Gordon is slightly pissed. Jackson sets off at high speed as the street falls to pieces and the creeks off the road rear up savagely behind them with Kate in the back seat holding Lily. The collapsing road rushes out to them as two old ladies drive steadily ahead. Jackson powers through gardens and the old lady powers into a rising section of the road. The limo soars over a gap as buildings have obliterated all around them. sewage throws on the windscreen and a giant donut rolls across the road. The race freeway breaks in half and a missed truck smashes into a petrol station and explodes. They drive alongside the collapsing bridge as cars fall from the freeway smashing into the road around the limo. They approach a huge gap and Jackson spins the limo into a type hole and accelerates over a pass beneath the freeway. Jackson drives the limo into a ramp and drives into the collapsing building's ground floor while a highrise falls on the road and the limo smashes out of the other side. In the corridor of the White House in the airport the pilot lies dead. near the petrol station as Jackson's limo pulls up. Jackson grabs his case from the limo as a giant fissure hole causes havoc and destruction as it arrows towards the airport and the runway starts to collapse."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Jackson pulls up outside Kate's house in the early morning. dew climbs out of the limo and opens the back door. Kate comes outside and they hug. Jackson watches by the limo as Gordon comes outside smiles and waves to Lily as she goes inside. Kate turns and he holds his phone up. Kate goes indoors while Jackson gets back into the limo and changes into a chauffeur's uniform. Tamara looks fondly at her little Pekingese dog Caesar. Jackson pulls up on the driveway outside Yuri's palatial mansion in Bel Air where curlyhaired twin boys Alec and Oleg wait on the steps. The race freeway breaks in half and a missed truck smashes into a petrol station and explodes. They drive alongside the collapsing bridge as cars fall from the freeway smashing into the road around the limo. They approach a huge gap and Jackson spins the limo into a type hole and accelerates over a pass beneath the freeway. Jackson drives the limo into a ramp and drives into the collapsing building's ground floor while a highrise falls on the road and the limo smashes out of the other side. In the corridor of the White House in the airport the pilot lies dead. near the petrol station as Jackson's limo pulls up. Jackson grabs his case from the limo as a giant fissure hole causes havoc and destruction as it arrows towards the airport and the runway starts to collapse."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Jackson pulls up outside Kate's house in the early morning. dew climbs out of the limo and opens the back door. Kate comes outside and they hug. In the corridor of the White House in the airport the pilot lies dead. near the petrol station as Jackson's limo pulls up. Jackson grabs his case from the limo as a giant fissure hole causes havoc and destruction as it arrows towards the airport and the runway starts to collapse."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Carlos pulls up outside Ron's house in the early morning dew, climbs out of the limo, and opens the back door. Angela comes outside, and they hug. Carlos watches by the limo as Derek comes outside, smiles, and waves to Emily as she goes inside. Angela turns, and he holds his phone up. Angela goes indoors while Carlos gets back into the limo and changes into a chauffeur's uniform. Maria looks fondly at her little Pekingese dog, Caesar. Carlos pulls up on the driveway outside Victor's palatial mansion in Bel Air, where curly-haired twin boys Ivan and Boris wait on the steps. They both check their watches as Carlos takes their luggage over to the boot. Carlos pulls up on the runway at Santa Monica Airport and jumps out as Victor's pilot Ivan marches over. A case hits Boris's foot, and Ivan glares over a shoulder as he boards the waiting plane. Carlos gets in the limo and switches on the radio. Meanwhile, Derek watches TV over breakfast when the whole house shakes violently, prompting Derek, Angela, and the kids to climb under the table. On the TV, the press conference is similarly affected. Carlos pulls up outside and heads indoors as the house rocks unpredictably then collapses. They board the limo as the trees fall off ahead of them. Carlos reverses the limo, and the back door is knocked off. He bumps on a Porsche, and it falls into an earthquake, while Derek is slightly pissed. Carlos sets off at high speed as the street falls to pieces, and the creeks off the road rear up savagely behind them, with Angela in the back seat holding Emily. The collapsing road rushes out to them, as two old ladies drive steadily ahead. Carlos powers through gardens, and the old lady powers into a rising section of the road. The limo soars over a gap as buildings have obliterated all around them, sewage throws on the windscreen, and a giant donut rolls across the road. The race freeway breaks in half, and a missed truck smashes into a petrol station and explodes. They drive alongside the collapsing bridge as cars fall from the freeway, smashing into the road around the limo. They approach a huge gap, and Carlos spins the limo into a type hole and accelerates over a pass beneath the freeway. Carlos drives the limo into a ramp and drives into the collapsing building's ground floor while a high-rise falls on the road, and the limo smashes out of the other side. In the corridor of the White House, in the airport, the pilot lies dead near the petrol station as Carlos's limo pulls up. Carlos grabs his case from the limo as a giant fissure hole causes havoc and destruction as it arrows towards the airport, and the runway starts to collapse."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Jackson pulls up outside Kate's apartment in the early morning fog, climbs out of the pickup truck, and opens the back gate. Kate comes outside, and they hug. Jackson watches by the truck as Gordon comes outside, smiles, and waves to Lily as she goes inside. Kate turns, and he holds his tablet up. Kate goes indoors while Jackson gets back into the truck and changes into a mechanic's uniform. Tamara looks fondly at her little Siamese cat, Caesar. Jackson pulls up on the path outside Yuri's grand lodge in Malibu, where curly-haired twin boys Alec and Oleg wait on the porch. They both check their watches as Jackson takes their backpacks over to the trunk. Jackson pulls up on the helipad at Burbank Airport and jumps out as Yuri's pilot Sasha marches over. A suitcase hits Alec's foot, and Oleg glares over a shoulder as he boards the waiting helicopter. Jackson gets in the truck and switches on the music player. Meanwhile, Gordon watches a tablet over breakfast when the whole house shakes violently, prompting Gordon, Kate, and the kids to climb under the counter. On the tablet, the press conference is similarly affected. Jackson pulls up outside and heads indoors as the house rocks unpredictably then collapses. They board the truck as the lampposts fall off ahead of them. Jackson reverses the truck, and the back gate is knocked off. He bumps on a Ferrari, and it falls into a landslide, while Gordon is slightly upset. Jackson sets off at high speed as the highway falls to pieces, and the hills off the path rear up savagely behind them, with Kate in the back seat holding Lily. The collapsing path rushes out to them, as two old men drive steadily ahead. Jackson powers through alleys, and the old man powers into a rising section of the street. The truck soars over a gap as warehouses have obliterated all around them, confetti throws on the windshield, and a giant wheel rolls across the path. The race railway breaks in half, and a missed van smashes into a convenience store and explodes. They drive alongside the collapsing pier as cars fall from the railway, smashing into the path around the truck. They approach a huge gap, and Jackson spins the truck into a garden hole and accelerates over a pass beneath the railway. Jackson drives the truck into a ramp and drives into the collapsing factory's ground floor while a high-rise falls on the path, and the truck smashes out of the other side. In the corridor of the Capitol Building, in the train station, the pilot lies dead near the convenience store as Jackson's truck pulls up. Jackson grabs his backpack from the truck as a giant crevice hole causes havoc and destruction as it arrows towards the train station, and the platform starts to collapse."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Jackson parks outside Kate's house in the early morning dew, leaps out of the limo, and shuts the back door. Kate appears outside, and they high-five. Jackson observes by the limo as Gordon steps outside, laughs, and nods to Lily as she departs inside. Kate pauses, and he raises his phone. Kate enters indoors while Jackson returns to the limo and changes into a magician's costume. Tamara glances warmly at her little Pekingese dog, Caesar. Jackson parks on the driveway outside Yuri's palatial mansion in Bel Air, where curly-haired twin boys Alec and Oleg sit on the steps. They both adjust their watches as Jackson swings their luggage into the boot. Jackson stops on the runway at Santa Monica Airport and bounces out as Yuri's pilot Sasha jogs over. A case brushes Alec's foot, and Oleg frowns over a shoulder as he enters the waiting plane. Jackson gets in the limo and tunes the radio. Meanwhile, Gordon browses a magazine over breakfast when the whole house vibrates intensely, prompting Gordon, Kate, and the kids to slide under the table. On the TV, the press conference is similarly disrupted. Jackson parks outside and darts indoors as the house tilts unpredictably then disintegrates. They enter the limo as the trees tumble ahead of them. Jackson slides the limo forward, and the back door is knocked free. He nudges a Porsche, and it cascades into an earthquake, while Gordon is slightly annoyed. Jackson dashes at high speed as the street crumbles, and the creeks alongside the road rise savagely behind them, with Kate in the back seat hugging Lily. The crumbling road surges towards them, as two old ladies drive cautiously ahead. Jackson steers through gardens, and the old lady steers into an ascending section of the road. The limo glides over a gap as buildings have disintegrated all around them, rain splashes on the windscreen, and a giant donut tumbles across the road. The racing freeway splits in half, and a missed truck slides into a petrol station and detonates. They drive beside the disintegrating bridge as cars tumble from the freeway, scattering across the road around the limo. They near a huge gap, and Jackson twists the limo into a type hole and speeds over a bypass beneath the freeway. Jackson steers the limo onto a ramp and navigates into the collapsing building's ground floor while a high-rise descends on the road, and the limo bursts out of the other side. In the corridor of the White House, in the airport, the pilot rests unconscious near the petrol station as Jackson's limo parks. Jackson retrieves his case from the limo as a giant fissure hole wreaks havoc and chaos as it darts towards the airport, and the runway begins to fragment."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Barnaby parks outside Amelia's cottage in the early morning fog, hops out of the kayak, and opens the front hatch. Amelia steps outside, and they shake hands. Barnaby observes by the kayak as Dexter steps outside, grins, and signals to Daisy as she heads indoors. Amelia pivots, and he raises his tablet up. Amelia goes into the cottage while Barnaby climbs back into the kayak and changes into a magician's outfit. Felicity gazes fondly at her tiny Siamese cat, Napoleon. Barnaby stops on the path outside Igor's sprawling villa in Malibu, where curly-haired twin girls Bella and Clara wait on the porch. They both glance at their phones as Barnaby carries their backpacks over to the trunk. Barnaby stops on the tarmac at Los Angeles Airstrip and springs out as Igor's co-pilot Natasha strides over. A suitcase lands on Bella's toe, and Clara frowns over a shoulder as she boards the idle helicopter. Barnaby hops in the kayak and tunes in the stereo. Meanwhile, Dexter watches a film over brunch when the entire condo trembles violently, prompting Dexter, Amelia, and the pets to duck under the bench. On the screen, the award ceremony experiences the same disruption. Barnaby parks outside and rushes indoors as the condo sways erratically then crumbles. They hop in the kayak as the lampposts tumble off ahead of them. Barnaby backs the kayak, and the rear hatch is smashed off. He bumps on a Vespa, and it slides into a sinkhole, while Dexter is slightly annoyed. Barnaby speeds off as the lane disintegrates, and the hills off the trail rear up fiercely behind them, with Amelia in the rear compartment holding Daisy. The crumbling trail races out to them, as two elderly men cycle steadily ahead. Barnaby maneuvers through fields, and the elderly man maneuvers into an ascending segment of the lane. The kayak leaps over a chasm as skyscrapers collapse all around them, rain pelts on the windshield, and a massive pretzel rolls across the trail. The expressway splits in two, and a meandering van collides into a gas station and erupts. They cruise alongside the disintegrating viaduct as bicycles plummet from the expressway, crashing into the lane surrounding the kayak. They near an enormous gap, and Barnaby twists the kayak into a narrow opening and shoots over a gap beneath the expressway. Barnaby guides the kayak onto a slope and navigates into the crumbling structure's base floor while a tower collapses on the trail, and the kayak bursts out of the opposite side. In the corridor of the Capitol, in the airstrip, the co-pilot lies lifeless near the gas station as Barnaby's kayak halts. Barnaby retrieves his backpack from the kayak as a massive crevice creates chaos and ruin as it barrels towards the airstrip, and the tarmac starts to give way."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Evelyn rolls up outside Mitch's apartment in the late evening haze, leaps out of the van, and shuts the front door. Mitch emerges outside, and they high-five. Evelyn hangs around by the van as Carla strolls outside, giggles, and salutes to Max as he heads inside. Mitch pivots, and she raises her camera up. Mitch goes outdoors while Evelyn hops back into the van and swaps into a magician's costume. Oliver glares sternly at his giant Siamese cat, Boris. Evelyn rolls up on the lawn outside Zane's modest cabin in Malibu, where short-haired twin sisters Mia and Nina lounge on the porch. They both shake their heads as Evelyn drags their backpacks over to the trunk. Evelyn rolls up on the helipad at Long Beach Airport and slides out as Zane's technician Jamie stomps over. A box taps Mia's elbow, and Nina peers over a shoulder as she steps onto the waiting helicopter. Evelyn climbs in the van and tunes the CD player. Meanwhile, Carla plays chess over lunch when the entire barn quivers gently, prompting Carla, Mitch, and the friends to scurry into the closet. On the screen, the award ceremony is similarly disrupted. Evelyn rolls up outside and jogs outdoors as the barn rattles unexpectedly then collapses. They scramble into the van as the branches tumble down ahead of them. Evelyn reverses the van, and the side mirror is scraped off. She scrapes on a bicycle, and it tumbles into a landslide, while Carla is slightly amused. Evelyn cruises at low speed as the avenue crumbles to bits, and the ravines off the trail surge up gently behind them, with Mitch in the front seat cradling Max. The vanishing trail races out to them, as two young gentlemen pedal briskly ahead. Evelyn glides through fields, and the young gentleman glides into a descending part of the trail. The van propels over a trench as skyscrapers have obliterated all around them, confetti showers on the windshield, and a colossal hamburger bounces across the trail. The racing highway separates in quarters, and an overlooked motorcycle careens into a burger joint and bursts. They speed underneath the crumbling pathway as trucks tumble from the highway, careening into the trail around the van. They confront a minor fissure, and Evelyn spins the van into a narrow lane and cruises under a bridge beneath the highway. Evelyn pilots the van up a slope and drives into the crashing cinema's basement while a low-rise topples on the trail, and the van bursts out of the other flank. In the hallway of the Capitol, at the harbor, the flight attendant rests unconscious near the burger joint as Evelyn's van rolls up. Evelyn snatches her bag from the van as a massive crack chasm triggers turmoil and disruption as it streaks towards the harbor, and the landing strip begins to crumble."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Jackson arrives outside Kate's cottage in the early morning mist, hops out of the canoe, and slides open the front gate. Kate emerges, and they fist-bump. Jackson observes by the canoe as Gordon steps out, grins, and salutes to Lily as she steps inside. Kate pivots, and he lifts his camera. Kate heads indoors while Jackson jumps back into the canoe and morphs into a magician's outfit. Tamara gazes lovingly at her little Siamese cat, Caesar. Jackson arrives at the parking lot outside Yuri's elaborate villa in Bel Air, where curly-haired twin boys Alec and Oleg wait on the porch. They both glance at their phones as Jackson rolls their backpacks over to the trunk. Jackson lands on the helipad at Santa Monica Airport and bounces out as Yuri's pilot Sasha strolls over. A backpack taps Alec's hand, and Oleg scowls over a knee as he hops on the waiting helicopter. Jackson slides into the canoe and tunes in the podcast. Meanwhile, Gordon reads a magazine over lunch when the entire room wobbles violently, prompting Gordon, Kate, and the kids to duck under the couch. On the magazine cover, the press briefing is similarly interrupted. Jackson lands outside and heads indoors as the room sways erratically, then implodes. They hop into the canoe as the bushes topple over ahead of them. Jackson maneuvers the canoe backward, and the front gate is torn off. He scrapes past a bicycle, and it disappears into a landslide, while Gordon is mildly irritated. Jackson zooms off at a brisk pace as the avenue disintegrates, and the fences off the course leap erratically behind them, with Kate in the back seat cradling Lily. The crumbling path surges up to them, as two elderly gentlemen stroll calmly ahead. Jackson navigates through parks, and the elderly gentleman strolls into a tilting patch of earth. The canoe glides over an opening as skyscrapers have disintegrated all around them, confetti sprinkles on the windshield, and a giant bagel bounces across the path. The racing circuit splits in two, and a wayward cart collides with a power station and ignites. They cruise alongside the collapsing viaduct as bicycles tumble from the overpass, pounding into the path around the canoe. They near a massive chasm, and Jackson twirls the canoe into a wormhole and speeds over a bypass beneath the overpass. Jackson pilots the canoe into a ramp and dives into the disintegrating structure's basement while a tower tumbles on the course, and the canoe bursts out of the opposite side. In the alley of the Presidential Mansion, at the airfield, the aviator lies motionless near the power station as Jackson's canoe lands. Jackson snatches his backpack from the canoe as a giant crater ripples havoc and turmoil as it darts towards the airfield, and the airstrip begins to crumble."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Gary drifts beside Laura's cabin in the late afternoon mist, hops off the bicycle, and shuts the front gate. Laura emerges, and they high-five. Gary leans against the bicycle as Trevor exits, grins, and salutes to Penny as she strolls outdoors. Laura pivots, and he lifts his umbrella aloft. Laura retreats inside while Gary reboards the bicycle and transforms into a magician's robe. Wendy gazes lovingly at her small Persian cat, Napoleon. Gary drifts onto the patio outside Igor's luxurious villa in Malibu, where redheaded twin girls, Becca and Nadia, squat on the lawn. They both glance at their sundials as Gary deposits their groceries into the cupboard. Gary drifts onto the pier at Long Beach Marina and leaps out as Igor's sailor Ivan strides over. A parcel nudges Becca's elbow, and Nadia scowls over a cheek as she steps onto the waiting yacht. Gary hops on the bicycle and tunes into the podcast. Meanwhile, Trevor glances at the laptop over lunch as the entire condo vibrates wildly, urging Trevor, Laura, and the toddlers to scurry under the bed. On the laptop, the seminar is similarly impacted. Gary drifts nearby and ventures outdoors as the condo sways unpredictably then shatters. They leap onto the bicycle as the boulders tumble off behind them. Gary pedals backward, and the front gate is sheared off. He brushes against a Volkswagen, and it sinks into a landslide, while Trevor is slightly flustered. Gary zooms off at breakneck pace as the avenue crumbles to fragments, and the ravines off the path surge up ferociously behind them, with Laura in the sidecar cuddling Penny. The disintegrating avenue rushes out toward them as two elderly gentlemen row evenly beside. Gary maneuvers through orchards, and the elderly gentleman sails into a rising portion of the avenue. The bicycle flies across a void as high-rises have obliterated everything around them, trash scatters on the windshield, and a massive hamburger rolls along the avenue. The speeding highway snaps in two, and an overlooked boat crashes into a scrapyard and erupts. They glide alongside the crumbling viaduct as motorbikes plummet from the highway, crashing onto the avenue around the bicycle. They near a giant chasm, and Gary swivels the bicycle into a secret tunnel and speeds under a bridge beneath the highway. Gary pilots the bicycle onto a mound and sails into the disintegrating building's basement while a tower tumbles onto the avenue, and the bicycle bursts out of the opposite side. In the gallery of the Capitol, at the marina, the sailor lies unconscious close to the scrapyard as Gary's bicycle drifts nearby. Gary snatches his backpack from the bicycle as a colossal sinkhole triggers chaos and devastation as it zigzags toward the marina, and the pier begins to give way."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jackson arrives at Kate's house in the morning, helps her inside the limo, and changes into a chauffeur's uniform. At Yuri's mansion, he loads Alec and Oleg's luggage. They drive to Santa Monica Airport, where tensions rise between the boys as Jackson stays focused on his job. Meanwhile, Gordon, Kate, and their children experience a violent earthquake at home, prompting them to seek cover. Jackson returns, and they narrowly escape as the house collapses. While driving at high speed through chaos, Jackson maneuvers the limo to dodge collapsing roads and obstacles like fallen trees and rolling debris. Amidst destruction, Jackson expertly navigates through gardens, dodging obstacles and soaring over gaps. As destruction surrounds them—buildings collapse, and vehicles crash—Jackson accelerates over a bridge while narrowly escaping an exploding petrol station. They reach the airport as a giant fissure threatens the runway, with Jackson racing against the destructive forces to ensure their survival."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Jackson grabs his case from the limo as a giant fissure hole causes havoc and destruction as it arrows towards the airport and the runway starts to collapse near the petrol station as Jackson's limo pulls up In the corridor of the White House in the airport the pilot lies dead Jackson drives the limo into a ramp and drives into the collapsing building's ground floor while a highrise falls on the road and the limo smashes out of the other side They approach a huge gap and Jackson spins the limo into a type hole and accelerates over a pass beneath the freeway They drive alongside the collapsing bridge as cars fall from the freeway smashing into the road around the limo The race freeway breaks in half and a missed truck smashes into a petrol station and explodes sewage throws on the windscreen and a giant donut rolls across the road The limo soars over a gap as buildings have obliterated all around them Jackson powers through gardens and the old lady powers into a rising section of the road The collapsing road rushes out to them as two old ladies drive steadily ahead Jackson sets off at high speed as the street falls to pieces and the creeks off the road rear up savagely behind them with Kate in the back seat holding Lily He bumps on a Porsche and it falls into an earthquake while Gordon is slightly pissed Jackson reverses the limo and the back door is knocked off They board the limo as the trees fall off ahead of them Jackson pulls up outside and heads indoors as the house rocks unpredictably then collapses On the TV the press conference is similarly affected Meanwhile Gordon watches TV over breakfast when the whole house shakes violently prompting Gordon Kate and the kids to climb under the table Jackson gets in the limo and switches on the radio A case hits Alec's foot and Oleg glares over a shoulder as he boards the waiting plane Jackson pulls up on the runway at Santa Monica Airport and jumps out as Yuri's pilot Sasha marches over They both check their watches as Jackson takes their luggage over to the boot Jackson pulls up on the driveway outside Yuri's palatial mansion in Bel Air where curlyhaired twin boys Alec and Oleg wait on the steps Tamara looks fondly at her little Pekingese dog Caesar Kate goes indoors while Jackson gets back into the limo and changes into a chauffeur's uniform Kate turns and he holds his phone up Jackson watches by the limo as Gordon comes outside smiles and waves to Lily as she goes inside Kate comes outside and they hug dew climbs out of the limo and opens the back door Jackson pulls up outside Kate's house in the early morning"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The collapsing road rushes out to them as two old ladies drive steadily ahead Jackson pulls up outside and heads indoors as the house rocks unpredictably then collapses A case hits Alec's foot and Oleg glares over a shoulder as he boards the waiting plane Jackson drives the limo into a ramp and drives into the collapsing building's ground floor while a highrise falls on the road and the limo smashes out of the other side sewage throws on the windscreen and a giant donut rolls across the road Tamara looks fondly at her little Pekingese dog Caesar Kate goes indoors while Jackson gets back into the limo and changes into a chauffeur's uniform Meanwhile Gordon watches TV over breakfast when the whole house shakes violently prompting Gordon Kate and the kids to climb under the table Jackson gets in the limo and switches on the radio They board the limo as the trees fall off ahead of them Jackson pulls up on the runway at Santa Monica Airport and jumps out as Yuri's pilot Sasha marches over They approach a huge gap and Jackson spins the limo into a type hole and accelerates over a pass beneath the freeway Jackson grabs his case from the limo as a giant fissure hole causes havoc and destruction as it arrows towards the airport and the runway starts to collapse The limo soars over a gap as buildings have obliterated all around them Jackson reverses the limo and the back door is knocked off In the corridor of the White House in the airport the pilot lies dead dew climbs out of the limo and opens the back door On the TV the press conference is similarly affected Jackson sets off at high speed as the street falls to pieces and the creeks off the road rear up savagely behind them with Kate in the back seat holding Lily Kate comes outside and they hug He bumps on a Porsche and it falls into an earthquake while Gordon is slightly pissed near the petrol station as Jackson's limo pulls up Kate turns and he holds his phone up They drive alongside the collapsing bridge as cars fall from the freeway smashing into the road around the limo Jackson pulls up on the driveway outside Yuri's palatial mansion in Bel Air where curlyhaired twin boys Alec and Oleg wait on the steps They both check their watches as Jackson takes their luggage over to the boot The race freeway breaks in half and a missed truck smashes into a petrol station and explodes Jackson pulls up outside Kate's house in the early morning Jackson watches by the limo as Gordon comes outside smiles and waves to Lily as she goes inside Jackson powers through gardens and the old lady powers into a rising section of the road"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They board the limo as the trees fall off ahead of them Jackson reverses the limo and the back door is knocked off He bumps on a Porsche and it falls into an earthquake while Gordon is slightly pissed Jackson sets off at high speed as the street falls to pieces and the creeks off the road rear up savagely behind them with Kate in the back seat holding Lily The collapsing road rushes out to them as two old ladies drive steadily ahead Jackson powers through gardens and the old lady powers into a rising section of the road The limo soars over a gap as buildings have obliterated all around them sewage throws on the windscreen and a giant donut rolls across the road The race freeway breaks in half and a missed truck smashes into a petrol station and explodes They drive alongside the collapsing bridge as cars fall from the freeway smashing into the road around the limo They approach a huge gap and Jackson spins the limo into a type hole and accelerates over a pass beneath the freeway Jackson drives the limo into a ramp and drives into the collapsing building's ground floor while a highrise falls on the road and the limo smashes out of the other side In the corridor of the White House in the airport the pilot lies dead near the petrol station as Jackson's limo pulls up Jackson grabs his case from the limo as a giant fissure hole causes havoc and destruction as it arrows towards the airport and the runway starts to collapse Jackson pulls up outside Kate's house in the early morning dew climbs out of the limo and opens the back door Kate comes outside and they hug Jackson watches by the limo as Gordon comes outside smiles and waves to Lily as she goes inside Kate turns and he holds his phone up Kate goes indoors while Jackson gets back into the limo and changes into a chauffeur's uniform Tamara looks fondly at her little Pekingese dog Caesar Jackson pulls up on the driveway outside Yuri's palatial mansion in Bel Air where curlyhaired twin boys Alec and Oleg wait on the steps They both check their watches as Jackson takes their luggage over to the boot Jackson pulls up on the runway at Santa Monica Airport and jumps out as Yuri's pilot Sasha marches over A case hits Alec's foot and Oleg glares over a shoulder as he boards the waiting plane Jackson gets in the limo and switches on the radio Meanwhile Gordon watches TV over breakfast when the whole house shakes violently prompting Gordon Kate and the kids to climb under the table On the TV the press conference is similarly affected Jackson pulls up outside and heads indoors as the house rocks unpredictably then collapses"
        }
      ]
    }
  ]
}