{
  "ground_truth": "Wilson puts his hand on Adrian's shoulder, and they hold each other's gaze. Smoke fills the sky above Las Vegas as buildings burn by a deep chasm through town. A light plane approaches McAllen airport as the runway crumbles into the chasm, and they land on a chaotic runway. Twins Alec and Oleg are with Yuri and Tamara by the grounded plane as the mechanic runs off. The fireman forces Yuri to move. A limo pulls up by Air Force One, and Adrian gets out. On board, Anheuser hangs up his cell phone in the busy control room lined with computer equipment and terminals. Adrian enters and stands before Anheuser, who tries to read his expression, as the staff onboard stop what they're doing. Adrian stares forlornly as Anheuser walks off. Air Force One taxis along the runway, and on board, Laura comes out of the president's cabin as a steward approaches. Laura goes into the cabin and picks up the phone. She leans against the wall, and as she sobs, a light goes out behind Wilson. His secretary, Sally, stands in the doorway, and he lowers the phone from his ear. Air Force One takes off, and Wilson sits before a TV camera in the office as the broadcast fades. Everyone turns, and the fireman's face falls as he shuts the glass door, which reflects the fast-approaching ash cloud. Sasha leads Jackson and the others to a cargo plane, an Antonov, and they board. The lights come on in the cargo hold, revealing it is full of gleaming sports cars. Sasha does it for him as the Antonov taxis into position while the ash cloud billows across the airport, engulfing the control tower. The Antonov loses a tire as they approach the runway's damaged end, and the plane drops into the chasm. Onboard, Yuri holds his sons to their seats as Tamara touches Caesar. Two buildings appear ahead, and Gordon pilots them between the buildings. The plane's wide wings narrowly scrape through and they rise. Control shakes their hands as they clear another building, and Gordon gawps as they drive towards a tall tower, taking the tip off with the plane's underside. Jackson pats Noah's hand, and Kate hugs Lilly. In Tibet, Nima and Lama Rinpoche sit together on the balcony of a small monastery overlooking a snow-covered mountain range. Lama Rinpoche looks calmly at Nema and pours out some tea for both of them, filling Nema's cup until it overflows. Nema reaches out to stop him from pouring, and Rinpoche stops. A breeze blows across the balcony, and prayer flags hanging from the eaves of the roof billow. Rinpoche holds something up and tosses it to Nema, who catches it. It is a truck key, and Nema grins at the key, then at Rinpoche.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Wilson places his hand on Adrian's shoulder, and they maintain each other's stare. Smoke occupies the sky above Las Vegas as structures ignite by a profound abyss through town. A small aircraft nears McAllen airfield as the tarmac disintegrates into the chasm, and they touch down on a disorderly runway. Twins Alec and Oleg are with Yuri and Tamara by the grounded aircraft as the technician dashes away. The firefighter compels Yuri to move. A limousine arrives by Air Force One, and Adrian exits. Onboard, Anheuser disconnects his mobile in the bustling control chamber lined with computer apparatus and consoles. Adrian enters and stands before Anheuser, who attempts to interpret his expression, as the staff onboard pause what they're doing. Adrian gazes despondently as Anheuser departs. Air Force One taxis along the runway, and onboard, Laura exits the president's cabin as an attendant nears. Laura enters the cabin and picks up the phone. She leans against the wall, and as she weeps, a light extinguishes behind Wilson. His assistant, Sally, stands in the doorway, and he lowers the phone from his ear. Air Force One departs, and Wilson sits before a TV camera in the office as the transmission diminishes. Everyone turns, and the firefighter's face falls as he closes the glass door, which reflects the rapidly approaching ash cloud. Sasha guides Jackson and the others to a freight aircraft, an Antonov, and they embark. The lights activate in the cargo hold, revealing it is full of shiny sports cars. Sasha operates it for him as the Antonov taxis into position while the ash cloud swells across the airport, inundating the control tower. The Antonov loses a tire as they near the runway's ruined end, and the aircraft drops into the abyss. Onboard, Yuri holds his sons to their seats as Tamara touches Caesar. Two buildings materialize ahead, and Gordon navigates them between the structures. The aircraft's expansive wings narrowly graze through, and they ascend. Control shakes their hands as they clear another structure, and Gordon gawps as they course towards a towering edifice, taking the tip off with the plane's underside. Jackson pats Noah's hand, and Kate embraces Lilly. In Tibet, Nima and Lama Rinpoche sit together on the balcony of a small monastery overlooking a snow-covered mountain range. Lama Rinpoche looks serenely at Nema and pours out some tea for both of them, filling Nema's cup until it overflows. Nema reaches out to halt him from pouring, and Rinpoche stops. A breeze sweeps across the balcony, and prayer flags hanging from the eaves of the roof flutter. Rinpoche holds something up and tosses it to Nema, who catches it. It is a truck key, and Nema grins at the key, then at Rinpoche."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Wilson's hand is put on Adrian's shoulder, and each other's gaze is held by them. The sky above Las Vegas is filled with smoke as a deep chasm through the town causes the buildings to burn. McAllen airport is approached by a light plane as the runway crumbles into the chasm, and a chaotic runway is landed on by them. Yuri and Tamara are with twins Alec and Oleg by the grounded plane as a mechanic runs off. Yuri is forced to move by the fireman. Air Force One is pulled up to by a limo, and Adrian gets out. Anheuser hangs up his cell phone in the busy control room lined with computer equipment and terminals on board. Anheuser tries to read Adrian's expression as he enters and stands before him, and what they're doing is stopped by the staff onboard. As Anheuser walks off, Adrian is stared at forlornly. The runway is taxied along by Air Force One, and a steward approaches as Laura comes out of the president's cabin on board. The cabin is entered by Laura, and the phone is picked up by her. As she leans against the wall and sobs, a light goes out behind Wilson. Sally, his secretary, stands in the doorway, and the phone is lowered from Wilson's ear by him. Air Force One is taken off, and before a TV camera in the office, Wilson sits as the broadcast fades. The fireman turns and shuts the glass door, which reflects the fast-approaching ash cloud, as everyone turns. Jackson and the others are led to a cargo plane, an Antonov, by Sasha, and it is boarded by them. The lights come on in the cargo hold, revealing it is full of gleaming sports cars. Sasha does it for him as the Antonov is taxied into position while the ash cloud billows across the airport, engulfing the control tower. A tire is lost by the Antonov as the runway's damaged end is approached, and into the chasm, the plane drops. Yuri holds his sons to their seats onboard as Caesar is touched by Tamara. Two buildings appear ahead, and they are piloted between the buildings by Gordon. The plane's wide wings narrowly scrape through, and the rise is made by them. Gordon gawps as their hands are shaken by Control when they clear another building, and a tall tower is driven toward, with its tip taken off by the plane's underside. Noah's hand is patted by Jackson, and Lilly is hugged by Kate. In Tibet, on the balcony of a small monastery overlooking a snow-covered mountain range, Nima and Lama Rinpoche sit together. Nima is looked at calmly by Lama Rinpoche, who pours out some tea for both of them, filling Nema's cup until it overflows. Rinpoche is stopped from pouring by Nema as he reaches out, and stopping occurs. A breeze blows across the balcony, and the prayer flags hanging from the eaves of the roof are billowed. Something is held up by Rinpoche and tossed to Nema, who catches it. It is a truck key, and Nema grins at the key, then at Rinpoche."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Wilson places his hand on Adrian's shoulder, and they lock eyes. Smoke fills the Las Vegas sky as buildings burn by a deep chasm. A light plane lands chaotically at McAllen airport as the runway crumbles. Twins Alec and Oleg are with Yuri and Tamara by the grounded plane as the mechanic flees. A fireman forces Yuri to move. A limo arrives at Air Force One, and Adrian exits. Inside, Anheuser hangs up his phone in the busy control room. Adrian enters, and Anheuser tries to read his expression as the staff pause. Adrian looks forlorn as Anheuser departs. Air Force One taxis, and Laura exits the president's cabin as a steward approaches. She enters the cabin, picks up the phone, and leans against the wall, sobbing as a light goes out behind Wilson. His secretary, Sally, stands in the doorway as he lowers the phone. Air Force One takes off, and Wilson sits before a TV camera as the broadcast fades. Everyone turns, and the fireman's face falls as he shuts the glass door, reflecting the approaching ash cloud. Sasha leads Jackson and others to a cargo plane, an Antonov, and they board. The lights reveal it is full of gleaming sports cars. Sasha helps as the Antonov taxis while the ash cloud engulfs the control tower. The Antonov loses a tire near the runway's damaged end and drops into the chasm. Onboard, Yuri holds his sons as Tamara touches Caesar. Two buildings appear, and Gordon pilots between them, narrowly scraping through. Control shakes hands as they clear another building, and Gordon gawps as they approach a tall tower, clipping it with the plane's underside. Jackson pats Noah's hand, and Kate hugs Lilly. In Tibet, Nima and Lama Rinpoche sit on a monastery balcony overlooking snow-covered mountains. Lama Rinpoche calmly pours tea for Nima, filling his cup until it overflows. Nima stops him, and Rinpoche halts. A breeze blows, and prayer flags billow. Rinpoche tosses a truck key to Nima, who grins at it and Rinpoche."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Wilson places his hand on Adrian's shoulder, and they lock eyes. Smoke fills the Las Vegas sky as buildings burn by a chasm. A light plane lands chaotically at McAllen airport as the runway crumbles. Twins Alec and Oleg are with Yuri and Tamara by the plane as the mechanic flees. A fireman forces Yuri to move. A limo arrives at Air Force One, and Adrian exits. Inside, Anheuser hangs up his phone in the busy control room. Adrian enters, and Anheuser tries to read his expression as the staff pause. Adrian looks forlorn as Anheuser leaves. Air Force One taxis, and Laura exits the president's cabin as a steward approaches. She enters the cabin, picks up the phone, leans against the wall, and sobs as a light goes out behind Wilson. His secretary, Sally, stands in the doorway as he lowers the phone. Air Force One takes off, and Wilson sits before a TV camera as the broadcast fades. The fireman's face falls as he shuts the glass door, reflecting the approaching ash cloud. Sasha leads Jackson and others to a cargo plane, an Antonov, and they board. The cargo hold lights reveal gleaming sports cars. Sasha helps as the Antonov taxis while the ash cloud engulfs the control tower. The Antonov loses a tire near the runway's end and drops into the chasm. Onboard, Yuri holds his sons as Tamara touches Caesar. Gordon pilots between buildings, narrowly scraping through, and they rise. Control shakes hands as they clear another building, and Gordon gawps as they hit a tower's tip. Jackson pats Noah's hand, and Kate hugs Lilly. In Tibet, Nima and Lama Rinpoche sit on a monastery balcony overlooking mountains. Rinpoche pours tea for Nema until it overflows. Nema stops him, and Rinpoche tosses him a truck key. Nema grins at the key and Rinpoche."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Wilson gently places his hand on Adrian's shoulder, and for a moment, they hold each other's gaze with a deep, unspoken understanding. Above the city of Las Vegas, smoke billows into the sky as buildings are consumed by flames, a result of a deep chasm that cuts through the heart of the town. Meanwhile, a small light aircraft makes its approach to McAllen airport, only to find the runway crumbling into the same chasm, creating a chaotic scene as they manage to land on the tumultuous runway. Nearby, twins Alec and Oleg stand with Yuri and Tamara beside the now-grounded plane, watching as the mechanic hastily runs off. A determined fireman arrives and insists that Yuri move away from the area. \n\nA sleek limousine pulls up beside the imposing Air Force One, and Adrian steps out with a sense of urgency. Inside the aircraft, Anheuser is in the midst of a bustling control room, filled with an array of computer equipment and terminals, as he hangs up his cell phone. Adrian enters the room and stands before Anheuser, who attempts to decipher Adrian's expression, while the staff onboard pause their activities to observe the interaction. Adrian's eyes are filled with a forlorn look as Anheuser turns and walks away. Air Force One begins to taxi along the runway, and onboard, Laura emerges from the president's cabin just as a steward approaches her. She enters the cabin and picks up the phone, leaning against the wall as she begins to sob. Behind Wilson, a light flickers and goes out, and his secretary, Sally, appears in the doorway. Wilson lowers the phone from his ear, a somber expression on his face. \n\nAs Air Force One takes off, Wilson sits before a TV camera in his office, and the broadcast gradually fades away. Outside, everyone turns their attention to the fireman, whose face falls as he closes the glass door, which reflects the ominous, fast-approaching ash cloud. Meanwhile, Sasha leads Jackson and the others to a cargo plane, an Antonov, and they quickly board. The lights illuminate the cargo hold, revealing it to be filled with an impressive collection of gleaming sports cars. Sasha takes charge as the Antonov taxis into position, while the ash cloud continues to billow across the airport, engulfing the control tower in its path. As they near the damaged end of the runway, the Antonov loses a tire and drops into the chasm. Onboard, Yuri holds his sons securely in their seats, while Tamara gently touches Caesar. \n\nAhead, two buildings loom, and Gordon skillfully pilots the plane between them, the wide wings narrowly scraping through as they ascend. The control team shakes hands in relief as they clear another building, but Gordon is taken aback as they head towards a tall tower, clipping its tip with the plane's underside. Jackson reassuringly pats Noah's hand, and Kate embraces Lilly tightly. \n\nIn the serene setting of Tibet, Nima and Lama Rinpoche sit together on the balcony of a small monastery, overlooking a breathtaking snow-covered mountain range. Lama Rinpoche gazes calmly at Nema and pours tea for both of them, continuing to fill Nema's cup until it overflows. Nema reaches out to stop the pouring, and Rinpoche obliges. A gentle breeze sweeps across the balcony, causing the prayer flags hanging from the eaves of the roof to flutter gracefully. Rinpoche holds up an object and tosses it to Nema, who catches it with ease. It is a truck key, and Nema grins broadly at the key, then at Rinpoche, a silent understanding passing between them."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Wilson gently places his hand on Adrian's shoulder, and for a brief moment, they share a deep, unspoken understanding through their locked gazes. High above the sprawling cityscape of Las Vegas, smoke rises ominously into the sky as numerous buildings are engulfed by relentless flames. This destruction is the aftermath of a massive chasm that dramatically slices through the very heart of the town. Meanwhile, a small light aircraft dares to make its approach to McAllen airport, only to discover that the runway itself, succumbing to the same menacing chasm, crumbles apart, creating a chaotic scene. In a remarkable feat, they manage to land on the tumultuous, unstable runway. Not far from this scene, twins Alec and Oleg stand with Yuri and Tamara beside the now-grounded plane, watching intently as the mechanic hastily runs away from the chaos. At that moment, a determined fireman arrives, adamantly insisting that Yuri move away from the hazardous area.\n\nA sleek, luxurious limousine makes its way to the side of the imposing Air Force One, and with a palpable sense of urgency, Adrian steps out. Inside the aircraft, Anheuser is deeply immersed in a bustling and frenetic control room. The room is filled to the brim with an array of computer equipment and busy terminals as he concludes a call on his cell phone. Adrian enters the room, positioning himself in front of Anheuser, who tries to decipher the meaning behind Adrian's expression, while the staff onboard pause their activities to observe the unfolding interaction. Adrian's eyes convey a forlorn look as Anheuser, unable to fully understand, turns away and walks off. Air Force One begins to taxi down the runway, and onboard, Laura emerges from the president's cabin just as a steward is about to approach her. She enters the cabin, picks up the phone, and leans against the wall as she begins to sob quietly. Behind Wilson, a light flickers and then suddenly goes out, as his secretary, Sally, appears in the doorway. Wilson lowers the phone from his ear, his face marked by a somber expression.\n\nAs Air Force One lifts off the ground, Wilson sits poised in front of a TV camera in his office, with the broadcast images gradually fading away. Outside, everyone shifts their attention toward the fireman, whose face falls as he closes the glass door that reflects the ominous, fast-approaching ash cloud. Meanwhile, Sasha leads Jackson and the others towards a cargo plane, an Antonov, and they quickly board it. The lights inside illuminate the cargo hold, revealing a remarkable collection of gleaming sports cars within. Sasha takes charge as the Antonov taxis into its takeoff position, while the ash cloud ominously continues to billow across the airport, eventually engulfing the control tower in its relentless path. As they near the damaged end of the runway, the Antonov loses a tire and dramatically drops into the gaping chasm. Onboard, Yuri securely holds his sons in their seats, while Tamara gently comforts Caesar.\n\nAhead, two towering buildings loom large, and with considerable skill, Gordon pilots the plane between them, the plane's wide wings narrowly scraping through as they successfully ascend. The control team breathes a sigh of relief and shakes hands as they clear yet another building. However, Gordon is taken by surprise as they head towards a tall tower, clipping its tip with the underside of the plane. Jackson reassuringly pats Noah's hand in comfort, while Kate embraces Lilly tightly, offering solace.\n\nIn the tranquil and serene setting of Tibet, Nima and Lama Rinpoche sit together on the balcony of a small monastery, which offers a breathtaking view of the snow-covered mountain range. Lama Rinpoche gazes with calm serenity at Nema and pours tea for both of them, continuing to fill Nema's cup until it overflows with liquid. Nema reaches out to stop the pouring, and Rinpoche obliges with a nod. A gentle breeze sweeps across the balcony, causing the prayer flags hanging from the eaves of the roof to flutter gracefully. Rinpoche holds up an object and tosses it effortlessly to Nema, who catches it with ease and skill. It is a truck key, and Nema beams broadly at the key, then at Rinpoche, a silent understanding and bond passing between them."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Wilson gently places his hand on Adrian's shoulder, and they lock eyes, holding each other's gaze in a moment of silent understanding. Meanwhile, the sky above Las Vegas is filled with thick, dark smoke as flames consume the buildings, creating a deep chasm that cuts through the town. In the distance, a light plane makes its approach to McAllen airport, but as it nears the runway, the ground beneath begins to crumble, threatening to swallow the plane as it lands amidst the chaos. Nearby, twins Alec and Oleg stand with Yuri and Tamara beside the now-grounded plane, watching as the mechanic hastily runs off, leaving them behind. A fireman, determined and forceful, urges Yuri to move away from the danger. At the same time, a sleek limo arrives and comes to a stop beside Air Force One, allowing Adrian to step out and make his way on board. Inside the bustling control room of Air Force One, lined with an array of computer equipment and terminals, Anheuser finishes a call and hangs up his cell phone. Adrian enters the room, standing before Anheuser, who attempts to decipher Adrian's expression while the staff around them pause their activities to watch. Adrian's eyes are filled with a deep sense of sorrow as Anheuser turns and walks away. As Air Force One begins to taxi along the runway, Laura emerges from the president's cabin, meeting a steward who approaches her. She then retreats back into the cabin, picking up the phone and leaning against the wall, overcome with emotion as she begins to sob. Meanwhile, a light flickers and goes out behind Wilson, who is seated with a phone to his ear. His secretary, Sally, appears in the doorway, prompting him to lower the phone. As Air Force One takes off, Wilson sits before a TV camera in his office, and the broadcast fades away. Back on the ground, everyone turns their attention to the fireman, whose face falls as he closes the glass door, which now reflects the rapidly advancing ash cloud. Sasha takes charge, leading Jackson and the others to a cargo plane, an Antonov, and they quickly board. The lights flicker on in the cargo hold, revealing a collection of gleaming sports cars. Sasha takes control as the Antonov taxis into position, while the ash cloud looms ominously, engulfing the control tower. As the Antonov approaches the damaged end of the runway, it loses a tire and drops precariously into the chasm. Onboard, Yuri holds his sons tightly to their seats, while Tamara reaches out to touch Caesar for comfort. Two towering buildings loom ahead, and Gordon skillfully pilots the plane between them, the wide wings narrowly scraping through as they ascend. The control team shakes hands in relief as they clear another building, but Gordon's eyes widen in disbelief as they head towards a tall tower, clipping its tip with the plane's underside. Jackson reassures Noah with a pat on the hand, and Kate embraces Lilly tightly. Far away in Tibet, Nima and Lama Rinpoche sit together on the balcony of a small monastery, gazing out over the snow-covered mountain range. Lama Rinpoche, with a serene expression, looks at Nema and begins to pour tea for both of them, continuing until Nema's cup overflows. Nema reaches out to stop the pouring, and Rinpoche obliges. A gentle breeze sweeps across the balcony, causing the prayer flags hanging from the eaves to flutter. Rinpoche then holds up an object and tosses it to Nema, who catches it with ease. It is a truck key, and Nema's face lights up with a grin as he looks from the key to Rinpoche, sharing a moment of understanding and anticipation."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Wilson and Adrian share a moment of connection amidst the chaos as smoke fills the sky over Las Vegas, where a chasm divides the burning city. A light plane lands precariously on a crumbling runway at McAllen airport, where twins Alec and Oleg stand with Yuri and Tamara by the grounded plane. As a mechanic flees, a fireman urges Yuri to move. Meanwhile, a limo arrives at Air Force One, and Adrian disembarks to confront Anheuser in the bustling control room. Anheuser, after a brief exchange, departs, leaving Adrian in a somber state. As Air Force One taxis, Laura exits the president's cabin, takes a call, and breaks down in tears, while Wilson, interrupted by his secretary Sally, lowers his phone. The plane takes off, and Wilson prepares for a broadcast as the scene shifts to a fireman witnessing an ash cloud approaching. Sasha leads Jackson and others to board a cargo plane, the Antonov, filled with sports cars. As the Antonov taxis, the ash cloud engulfs the airport, and the plane loses a tire, dropping into the chasm. Onboard, Yuri secures his sons, and Tamara comforts Caesar as Gordon navigates the plane between buildings, narrowly avoiding disaster. In Tibet, Nima and Lama Rinpoche share a tranquil moment on a monastery balcony. Rinpoche pours tea until Nima's cup overflows, then hands Nima a truck key, prompting a shared smile as prayer flags flutter in the breeze."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Wilson puts his hand on Adrian's shoulder, and they hold each other's gaze, sharing a moment of understanding in the chaos surrounding them. Smoke fills the sky above Las Vegas, a city famed for its vibrant nightlife and casinos, as buildings burn by a deep chasm through town, a dramatic reminder of the city's vulnerability to seismic events. A light plane, a Cessna known for its reliability, approaches McAllen airport, a small yet crucial transport hub on the Texas-Mexico border, as the runway crumbles into the chasm, and they land on a chaotic runway scattered with debris.\n\nTwins Alec and Oleg are with Yuri and Tamara by the grounded plane as the mechanic runs off, overwhelmed by the unfolding disaster. The fireman, a seasoned first responder trained for emergencies, forces Yuri to move to safety. A limo, a symbol of power and urgency, pulls up by Air Force One, the highly specialized aircraft used by the President of the United States, and Adrian gets out. On board, Anheuser, a high-ranking official coordinating crisis communications, hangs up his cell phone in the busy control room lined with state-of-the-art computer equipment and terminals. Adrian enters and stands before Anheuser, who tries to read his expression, as the staff onboard stop what they're doing, sensing the gravity of the moment. Adrian stares forlornly as Anheuser walks off, burdened by the weight of leadership in this crisis.\n\nAir Force One taxis along the runway, and on board, Laura, a senior aide with intimate knowledge of the president's schedule, comes out of the president's cabin as a steward approaches, ready to assist with any need. Laura goes into the cabin and picks up the phone, aware that each call could be of critical importance. She leans against the wall, and as she sobs, a light, symbolic of hope, goes out behind Wilson. His secretary, Sally, stands in the doorway, offering silent support, and he lowers the phone from his ear, his face drawn with worry.\n\nAir Force One takes off, a testament to human ingenuity, and Wilson sits before a TV camera in the office as the broadcast fades, preparing to address the nation. Everyone turns, and the fireman's face falls as he shuts the glass door, which reflects the fast-approaching ash cloud, a visible threat signaling impending danger. Sasha, a skilled pilot with a reputation for daring escapes, leads Jackson and the others to a cargo plane, an Antonov known for its robust design and capacity, and they board. The lights come on in the cargo hold, revealing it is full of gleaming sports cars, a stark contrast to the dire situation outside.\n\nSasha does it for him as the Antonov taxis into position while the ash cloud billows across the airport, engulfing the control tower and leaving the airport staff powerless. The Antonov loses a tire as they approach the runway's damaged end, and the plane drops into the chasm, showcasing the precariousness of their escape. Onboard, Yuri, demonstrating paternal protectiveness, holds his sons to their seats as Tamara touches Caesar, their loyal dog offering comfort.\n\nTwo buildings appear ahead, iconic remnants of the city's skyline, and Gordon expertly pilots them between the buildings. The plane's wide wings narrowly scrape through, a testament to Gordon's skill, and they rise. Control, witnessing the tense maneuver, shakes their hands as they clear another building, collectively experiencing relief. Gordon gawps as they drive towards a tall tower, one of the last standing structures, taking the tip off with the plane's underside, a narrow escape that marks their precarious survival.\n\nJackson pats Noah's hand, offering solace, and Kate hugs Lilly, drawing strength from each other in the face of overwhelming odds. In Tibet, known for its serene landscapes and spiritual heritage, Nima and Lama Rinpoche sit together on the balcony of a small monastery overlooking a snow-covered mountain range, a place of peace amidst global turmoil. Lama Rinpoche looks calmly at Nema, embodying centuries of Buddhist wisdom, and pours out some tea for both of them, filling Nema's cup until it overflows, a symbolic gesture of abundance and mindfulness. Nema reaches out to stop him from pouring, and Rinpoche stops, their silent communication rich with meaning.\n\nA breeze, carrying the ancient stories and prayers of the land, blows across the balcony, and prayer flags hanging from the eaves of the roof billow, their colors representing the elements and spreading blessings to the wind. Rinpoche holds something up and tosses it to Nema, who catches it with anticipation. It is a truck key, a symbol of a new journey or hope, and Nema grins at the key, then at Rinpoche, acknowledging this unexpected gift and the trust it represents."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Wilson puts his hand on Adrian's shoulder and they hold each other's gaze. Smoke fills the sky above Las Vegas as buildings burn by a deep chasm through town. A light plane approaches McAllen airport as the runway crumbles into the chasm and they land on a chaotic runway. Twins Alec and Oleg are with Yuri and Tamara by the grounded plane as the mechanic runs off. The fireman forces Yuri to move. A limo pulls up by Air Force One and Adrian gets out. On board. Anheuser hangs up his cell phone in the busy control room lined with computer equipment and terminals. Adrian enters and stands before Anheuser who tries to read his expression as the staff onboard stop what they are doing. Adrian stares forlornly as Anheuser walks off. Air Force One taxis along the runway and on board. Laura comes out of the president's cabin as a steward approaches. Laura goes into the cabin and picks up the phone. She leans against the wall and as she sobs a light goes out behind Wilson. His secretary Sally stands in the doorway and he lowers the phone from his ear. Air Force One takes off and Wilson sits before a TV camera in the office as the broadcast fades. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Everyone turns and the fireman's face falls as he shuts the glass door which reflects the fastapproaching ash cloud. Sasha leads Jackson and the others to a cargo plane an Antonov and they board. The lights come on in the cargo hold revealing it is full of gleaming sports cars. Sasha does it for him as the Antonov taxis into position while the ash cloud billows across the airport engulfing the control tower. The Antonov loses a tire as they approach the runway's damaged end and the plane drops into the chasm. Onboard Yuri holds his sons to their seats as Tamara touches Caesar. Two buildings appear ahead and Gordon pilots them between the buildings. The plane's wide wings narrowly scrape through and they rise. Control shakes their hands as they clear another building and Gordon gawps as they drive towards a tall tower taking the tip off with the plane's underside. Jackson pats Noah's hand and Kate hugs Lilly In Tibet. Nima and Lama Rinpoche sit together on the balcony of a small monastery overlooking a snowcovered mountain range. Lama Rinpoche looks calmly at Nema and pours out some tea for both of them filling Nema's cup until it overflows. Nema reaches out to stop him from pouring and Rinpoche stops. A breeze blows across the balcony and prayer flags hanging from the eaves of the roof billow. Rinpoche holds something up and tosses it to Nema who catches it. It is a truck key and Nema grins at the key then at Rinpoche."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Wilson puts his hand on Adrian's shoulder and they hold each other's gaze. Smoke fills the sky above Las Vegas as buildings burn by a deep chasm through town. A light plane approaches McAllen airport as the runway crumbles into the chasm and they land on a chaotic runway. Twins Alec and Oleg are with Yuri and Tamara by the grounded plane as the mechanic runs off. The fireman forces Yuri to move. A limo pulls up by Air Force One and Adrian gets out. On board. Anheuser hangs up his cell phone in the busy control room lined with computer equipment and terminals. Adrian enters and stands before Anheuser who tries to read his expression as the staff onboard stop what they are doing. Adrian stares forlornly as Anheuser walks off. Air Force One taxis along the runway and on board. Laura comes out of the president's cabin as a steward approaches. Laura goes into the cabin and picks up the phone. She leans against the wall and as she sobs a light goes out behind Wilson. His secretary Sally stands in the doorway and he lowers the phone from his ear. Air Force One takes off and Wilson sits before a TV camera in the office as the broadcast fades. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Everyone turns and the fireman's face falls as he shuts the glass door which reflects the fastapproaching ash cloud. Sasha leads Jackson and the others to a cargo plane an Antonov and they board. The lights come on in the cargo hold revealing it is full of gleaming sports cars. Sasha does it for him as the Antonov taxis into position while the ash cloud billows across the airport engulfing the control tower. The Antonov loses a tire as they approach the runway's damaged end and the plane drops into the chasm. Onboard Yuri holds his sons to their seats as Tamara touches Caesar. Two buildings appear ahead and Gordon pilots them between the buildings. The plane's wide wings narrowly scrape through and they rise. Control shakes their hands as they clear another building and Gordon gawps as they drive towards a tall tower taking the tip off with the plane's underside. Jackson pats Noah's hand and Kate hugs Lilly In Tibet. Nima and Lama Rinpoche sit together on the balcony of a small monastery overlooking a snowcovered mountain range. Lama Rinpoche looks calmly at Nema and pours out some tea for both of them filling Nema's cup until it overflows. Nema reaches out to stop him from pouring and Rinpoche stops. A breeze blows across the balcony and prayer flags hanging from the eaves of the roof billow. Rinpoche holds something up and tosses it to Nema who catches it. It is a truck key and Nema grins at the key then at Rinpoche."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Wilson puts his hand on Adrian's shoulder and they hold each other's gaze. Smoke fills the sky above Las Vegas as buildings burn by a deep chasm through town. A light plane approaches McAllen airport as the runway crumbles into the chasm and they land on a chaotic runway. Twins Alec and Oleg are with Yuri and Tamara by the grounded plane as the mechanic runs off. The fireman forces Yuri to move. A limo pulls up by Air Force One and Adrian gets out. On board. Anheuser hangs up his cell phone in the busy control room lined with computer equipment and terminals. Control shakes their hands as they clear another building and Gordon gawps as they drive towards a tall tower taking the tip off with the plane's underside. Jackson pats Noah's hand and Kate hugs Lilly In Tibet. Nima and Lama Rinpoche sit together on the balcony of a small monastery overlooking a snowcovered mountain range. Lama Rinpoche looks calmly at Nema and pours out some tea for both of them filling Nema's cup until it overflows. Nema reaches out to stop him from pouring and Rinpoche stops. A breeze blows across the balcony and prayer flags hanging from the eaves of the roof billow. Rinpoche holds something up and tosses it to Nema who catches it. It is a truck key and Nema grins at the key then at Rinpoche."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Wilson puts his hand on Adrian's shoulder and they hold each other's gaze. Smoke fills the sky above Las Vegas as buildings burn by a deep chasm through town. A light plane approaches McAllen airport as the runway crumbles into the chasm and they land on a chaotic runway. Twins Alec and Oleg are with Yuri and Tamara by the grounded plane as the mechanic runs off. A breeze blows across the balcony and prayer flags hanging from the eaves of the roof billow. Rinpoche holds something up and tosses it to Nema who catches it. It is a truck key and Nema grins at the key then at Rinpoche."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Daphne places her elbow on Clyde's knee, and they blink at the ceiling. Fog envelops the ocean above Miami as forests dance by a shallow river through forest. A blue bird flies toward Austin harbor as the dock shatters into the river, and they swim on a calm harbor. Neighbors Mia and Zoe are with Oscar and Nina by the floating bird as the plumber skips away. The artist invites Oscar to sing. A van idles by a submarine, and Clyde hops out. On board, Harrison turns off his laptop in the quiet study lined with comic books and dictionaries. Clyde arrives and stares at Harrison, who tries to decode his shoes, as the guests above ignore what they're hearing. Clyde whistles happily as Harrison climbs away. The submarine floats down the waterway, and on board, Monica emerges from the captain's closet as a chef beckons. Monica exits the closet and grabs the remote. She slouches against the sofa, and as she smiles, a bulb shines above Daphne. His hairdresser, Nora, waits in the hallway, and he lifts the book from his lap. The submarine submerges, and Daphne crouches before a stereo in the attic as the music resumes. Everyone swivels, and the artist's mouth rises as he opens the wooden window, which reveals the slowly-retreating dust storm. Rose guides Walter and the others to a lifeboat, a Cessna, and they jump. The engines roar in the cargo bay, revealing it is full of ancient sewing machines. Rose carries it for him as the Cessna floats into place while the dust storm pounds the harbor, revealing the radio tower. The Cessna pops a balloon as they leave the runway's pristine edge, and the bird lifts above the river. Onboard, Oscar ties his cousins to their berths as Nina brushes Hector. Two bridges emerge ahead, and Nigel maneuvers them around the bridges. The bird's narrow beak barely scratches through and they ascend. Crew nods their heads as they clear another bridge, and Nigel gasps as they slide towards a small chimney, clipping the top off with the bird's underbelly. Walter rubs Paul's elbow, and Hannah squeezes Gina. In Nepal, Zane and Monk Jinpa recline together on the terrace of a tall pagoda overlooking a rain-soaked valley. Monk Jinpa peers quietly at Zane and pours out some lemonade for both of them, filling Zane's mug until it spills. Zane reaches out to stop him from pouring, and Jinpa halts. A gust sweeps across the terrace, and wind chimes hanging from the rafters of the roof tinkle. Jinpa lifts something up and throws it to Zane, who catches it. It is a bicycle horn, and Zane smirks at the horn, then at Jinpa."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Wilson and Adrian share a moment as chaos unfolds in Las Vegas, with the runway at McAllen airport crumbling. Twins Alec and Oleg are with Yuri and Tamara by a grounded plane. Anheuser receives a call aboard Air Force One, observing Adrian's forlorn entrance. Laura, in tears, calls from the president's cabin as Wilson prepares for a broadcast amidst an approaching ash cloud. Sasha leads Jackson and others to a cargo plane, revealing it packed with sports cars. They narrowly escape along a damaged runway, with Gordon piloting through tight spaces. In Tibet, Nema and Lama Rinpoche sit on a balcony. Rinpoche pours overflowing tea before handing Nema a truck key, who smiles at him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "It is a truck key and Nema grins at the key then at Rinpoche Rinpoche holds something up and tosses it to Nema who catches it  A breeze blows across the balcony and prayer flags hanging from the eaves of the roof billow  Nema reaches out to stop him from pouring and Rinpoche stops  Lama Rinpoche looks calmly at Nema and pours out some tea for both of them filling Nema's cup until it overflows  Nima and Lama Rinpoche sit together on the balcony of a small monastery overlooking a snowcovered mountain range  Jackson pats Noah's hand and Kate hugs Lilly In Tibet  Control shakes their hands as they clear another building and Gordon gawps as they drive towards a tall tower taking the tip off with the plane's underside  The plane's wide wings narrowly scrape through and they rise  Two buildings appear ahead and Gordon pilots them between the buildings  Onboard Yuri holds his sons to their seats as Tamara touches Caesar  The Antonov loses a tire as they approach the runway's damaged end and the plane drops into the chasm  Sasha does it for him as the Antonov taxis into position while the ash cloud billows across the airport engulfing the control tower  The lights come on in the cargo hold revealing it is full of gleaming sports cars  Sasha leads Jackson and the others to a cargo plane an Antonov and they board  Everyone turns and the fireman's face falls as he shuts the glass door which reflects the fastapproaching ash cloud  Air Force One takes off and Wilson sits before a TV camera in the office as the broadcast fades  His secretary Sally stands in the doorway and he lowers the phone from his ear  She leans against the wall and as she sobs a light goes out behind Wilson  Laura goes into the cabin and picks up the phone  Laura comes out of the president's cabin as a steward approaches  Air Force One taxis along the runway and on board  Adrian stares forlornly as Anheuser walks off  Adrian enters and stands before Anheuser who tries to read his expression as the staff onboard stop what they're doing  Anheuser hangs up his cell phone in the busy control room lined with computer equipment and terminals  On board  A limo pulls up by Air Force One and Adrian gets out  The fireman forces Yuri to move  Twins Alec and Oleg are with Yuri and Tamara by the grounded plane as the mechanic runs off  A light plane approaches McAllen airport as the runway crumbles into the chasm and they land on a chaotic runway  Smoke fills the sky above Las Vegas as buildings burn by a deep chasm through town  Wilson puts his hand on Adrian's shoulder and they hold each other's gaze "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Smoke fills the sky above Las Vegas as buildings burn by a deep chasm through town Wilson puts his hand on Adrian's shoulder and they hold each other's gaze Twins Alec and Oleg are with Yuri and Tamara by the grounded plane as the mechanic runs off A light plane approaches McAllen airport as the runway crumbles into the chasm and they land on a chaotic runway A limo pulls up by Air Force One and Adrian gets out The fireman forces Yuri to move Anheuser hangs up his cell phone in the busy control room lined with computer equipment and terminals On board Adrian stares forlornly as Anheuser walks off Adrian enters and stands before Anheuser who tries to read his expression as the staff onboard stop what they are doing Laura comes out of the president's cabin as a steward approaches Air Force One taxis along the runway and on board She leans against the wall and as she sobs a light goes out behind Wilson Laura goes into the cabin and picks up the phone Air Force One takes off and Wilson sits before a TV camera in the office as the broadcast fades His secretary Sally stands in the doorway and he lowers the phone from his ear Sasha leads Jackson and the others to a cargo plane an Antonov and they board Everyone turns and the fireman's face falls as he shuts the glass door which reflects the fastapproaching ash cloud Sasha does it for him as the Antonov taxis into position while the ash cloud billows across the airport engulfing the control tower The lights come on in the cargo hold revealing it is full of gleaming sports cars Onboard Yuri holds his sons to their seats as Tamara touches Caesar The Antonov loses a tire as they approach the runway's damaged end and the plane drops into the chasm The plane's wide wings narrowly scrape through and they rise Two buildings appear ahead and Gordon pilots them between the buildings Jackson pats Noah's hand and Kate hugs Lilly In Tibet Control shakes their hands as they clear another building and Gordon gawps as they drive towards a tall tower taking the tip off with the plane's underside Lama Rinpoche looks calmly at Nema and pours out some tea for both of them filling Nema's cup until it overflows Nima and Lama Rinpoche sit together on the balcony of a small monastery overlooking a snowcovered mountain range A breeze blows across the balcony and prayer flags hanging from the eaves of the roof billow Nema reaches out to stop him from pouring and Rinpoche stops It is a truck key and Nema grins at the key then at Rinpoche Rinpoche holds something up and tosses it to Nema who catches it"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Everyone turns and the fireman's face falls as he shuts the glass door which reflects the fastapproaching ash cloud  Sasha leads Jackson and the others to a cargo plane an Antonov and they board  The lights come on in the cargo hold revealing it is full of gleaming sports cars  Sasha does it for him as the Antonov taxis into position while the ash cloud billows across the airport engulfing the control tower  The Antonov loses a tire as they approach the runway's damaged end and the plane drops into the chasm  Onboard Yuri holds his sons to their seats as Tamara touches Caesar  Two buildings appear ahead and Gordon pilots them between the buildings  The plane's wide wings narrowly scrape through and they rise  Control shakes their hands as they clear another building and Gordon gawps as they drive towards a tall tower taking the tip off with the plane's underside  Jackson pats Noah's hand and Kate hugs Lilly In Tibet  Nima and Lama Rinpoche sit together on the balcony of a small monastery overlooking a snowcovered mountain range  Lama Rinpoche looks calmly at Nema and pours out some tea for both of them filling Nema's cup until it overflows  Nema reaches out to stop him from pouring and Rinpoche stops  A breeze blows across the balcony and prayer flags hanging from the eaves of the roof billow  Rinpoche holds something up and tosses it to Nema who catches it  It is a truck key and Nema grins at the key then at Rinpoche Wilson puts his hand on Adrian's shoulder and they hold each other's gaze  Smoke fills the sky above Las Vegas as buildings burn by a deep chasm through town  A light plane approaches McAllen airport as the runway crumbles into the chasm and they land on a chaotic runway  Twins Alec and Oleg are with Yuri and Tamara by the grounded plane as the mechanic runs off  The fireman forces Yuri to move  A limo pulls up by Air Force One and Adrian gets out  On board  Anheuser hangs up his cell phone in the busy control room lined with computer equipment and terminals  Adrian enters and stands before Anheuser who tries to read his expression as the staff onboard stop what they're doing  Adrian stares forlornly as Anheuser walks off  Air Force One taxis along the runway and on board  Laura comes out of the president's cabin as a steward approaches  Laura goes into the cabin and picks up the phone  She leans against the wall and as she sobs a light goes out behind Wilson  His secretary Sally stands in the doorway and he lowers the phone from his ear  Air Force One takes off and Wilson sits before a TV camera in the office as the broadcast fades "
        }
      ]
    }
  ]
}