{
  "ground_truth": "From RACHEL's viewpoint, through a screen, she sees PREACHER's face twitch with emotion, and he breaks out into great thankful sobs. As RUBY minces off around the side of the house, PREACHER watches her and wipes off his tears with the heel of his left hand. He holds up his right hand as all the CHILDREN enter around the corner of the house. As they move in, RACHEL replies, and by now, JOHN is on the top step beside her, one of his hands holding on to her skirt as if pulling her towards him, his eyes never leaving hers. All the CHILDREN freeze, with PEARL on the ground just beyond JOHN. He looks up at RACHEL, and JOHN looks deep into her eyes, wanting the situation clarified. She takes this in, realizing JOHN has sold her, then looks to PREACHER o.s., who gets to his feet with an open knife in his hand. As they see it, a gun-barrel twitches. PREACHER backs away towards his horse, bouncing the knife lightly in his hand, and as he mounts his horse, the scene shifts. RACHEL sits in profile with a gun across her knees in a big bed, while RUBY sits up listening to a song o.s. We pan to PREACHER outside, seen through the window as he sits hunched on a stump. After a moment, as RACHEL opens her mouth, either to comfort herself or to drown out PREACHER's voice, she joins in the hymn. A descending candle moves past a window as RACHEL and PREACHER sing o.s., and over the back of RACHEL's head, the song ends. RUBY enters the shot carrying a candle, which blacks out the window-glass. RACHEL looks up and blows out the candle; through the window, PREACHER has gone. She stands up as RUBY leaves the shot, and RACHEL moves towards the window, looks up, and sees the CHILDREN looking at her with complete trust. She turns around and walks back to her chair, with the CHILDREN's eyes always on her, her eyes glittering as she turns to look towards us. As the clock starts striking three, RACHEL looks to the sound o.s. In the mirror, a shadow ducks. RACHEL gets up, gun at port, and faces into the darkness. Eyes on the darkness, she bends low to the CHILDREN, who scatter out of the shot; RUBY lingers, then obeys in a trance. RACHEL, gun at the ready, looks into the darkness as PREACHER's satanic face and his hand lifting the open knife rise swiftly from the floor. She fires off her gun, and PREACHER staggers out, runs yelping with pain into the barn. The CHILDREN huddle on the stairs in reverent silence while RACHEL, her gun slung sportily under one arm, talks into the wall phone, which hangs just within the box stairway. RACHEL sits on the screened porch, awake, with a gun on her knees, as JOHN sits on the floor asleep, his head leaning against her.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "From RACHEL's perspective, through a display, she observes PREACHER's visage flinch with feeling, and he erupts into immense grateful weeping. As RUBY prances off around the edge of the dwelling, PREACHER observes her and dabs off his weeping with the base of his left hand. He raises his right hand as all the CHILDREN appear around the bend of the house. As they proceed in, RACHEL answers, and by now, JOHN is on the upper step beside her, one of his hands clutching her dress as if drawing her toward him, his gaze never leaving hers. All the CHILDREN halt, with PEARL on the ground just beyond JOHN. He gazes up at RACHEL, and JOHN peers deep into her eyes, needing the situation elucidated. She comprehends this, realizing JOHN has betrayed her, then glances toward PREACHER o.s., who rises to his feet with an open blade in his hand. As they notice it, a firearm-barrel quivers. PREACHER retreats toward his steed, juggling the knife lightly in his hand, and as he mounts his horse, the scene transitions. RACHEL sits in profile with a firearm across her lap in a large bed, while RUBY sits up tuning in to a melody o.s. We pan to PREACHER outside, viewed through the pane as he sits hunched on a log. After a moment, as RACHEL opens her mouth, either to soothe herself or to muffle PREACHER's sound, she joins in the anthem. A descending taper shifts past a pane as RACHEL and PREACHER chant o.s., and over the back of RACHEL's head, the hymn concludes. RUBY enters the frame carrying a taper, which blacks out the pane-glass. RACHEL gazes up and extinguishes the taper; through the pane, PREACHER has departed. She stands up as RUBY exits the frame, and RACHEL moves toward the pane, gazes up, and notices the CHILDREN observing her with absolute confidence. She turns around and strides back to her seat, with the CHILDREN's gazes perpetually on her, her eyes shimmering as she turns to gaze towards us. As the clock begins tolling three, RACHEL looks to the sound o.s. In the reflection, a silhouette dives. RACHEL rises, firearm at port, and faces into the gloom. Eyes on the gloom, she bends low to the CHILDREN, who disperse out of the frame; RUBY hesitates, then complies in a daze. RACHEL, firearm primed, gazes into the gloom as PREACHER's fiendish visage and his hand lifting the open blade ascend quickly from the surface. She discharges her firearm, and PREACHER stumbles out, dashes howling with agony into the shed. The CHILDREN cluster on the stairs in devout silence while RACHEL, her firearm slung casually under one arm, converses into the wall telephone, which hangs just inside the box stairway. RACHEL sits on the screened veranda, alert, with a firearm on her lap, as JOHN sits on the floor dozing, his head resting against her."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "From RACHEL's viewpoint, through a screen, PREACHER's face is seen by her twitching with emotion, and he breaks out into great thankful sobs. As RUBY minces off around the side of the house, she is watched by PREACHER, and his tears are wiped off with the heel of his left hand. His right hand is held up by him as all the CHILDREN enter around the corner of the house. As they are moved in, RACHEL is replied by JOHN, and by now, he is on the top step beside her, one of his hands holding on to her skirt as if pulling her towards him, his eyes never leaving hers. All the CHILDREN freeze, with PEARL on the ground just beyond JOHN. RACHEL is looked up to by him, and JOHN looks deep into her eyes, wanting the situation clarified. This is taken in by her, realizing she has been sold by JOHN, then she looks to PREACHER o.s., who gets to his feet with an open knife in his hand. As it is seen by them, a gun-barrel twitches. PREACHER backs away towards his horse, bouncing the knife lightly in his hand, and as he mounts his horse, the scene shifts. In profile, RACHEL sits with a gun across her knees in a big bed, while RUBY sits up listening to a song o.s. We pan to PREACHER outside, through the window, as he sits hunched on a stump. After a moment, RACHEL opens her mouth either to comfort herself or to drown out PREACHER's voice, and she joins in the hymn. Past a window, a descending candle moves as RACHEL and PREACHER sing o.s., and over the back of RACHEL's head, the song ends. The shot is entered by RUBY carrying a candle, which blacks out the window-glass. Upward is looked by RACHEL, and the candle is blown out by her; through the window, PREACHER has gone. She stands up as the shot is left by RUBY, and RACHEL moves towards the window, looks up, and sees the CHILDREN looking at her with complete trust. She is turned around, and her chair is walked back to, with the CHILDREN's eyes always on her, her eyes glittering as she turns to look towards us. As the clock starts striking three, the sound o.s. is looked to by RACHEL. In the mirror, a shadow ducks. The gun at port is held by RACHEL, and she faces into the darkness. Eyes on the darkness, she bends low to the CHILDREN, who scatter out of the shot; RUBY lingers, then is obeyed in a trance. Gun at the ready, RACHEL looks into the darkness as PREACHER's satanic face and his hand lifting the open knife rise swiftly from the floor. Her gun is fired off by her, and PREACHER staggers out, runs yelping with pain into the barn. On the stairs, the CHILDREN huddle in reverent silence while the wall phone, which hangs just within the box stairway, is talked into by RACHEL, her gun slung sportily under one arm. RACHEL sits on the screened porch, awake, with a gun on her knees, as the floor is sat on by JOHN asleep, his head leaning against her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "From RACHEL's perspective, she sees PREACHER's face twitch with emotion, leading to thankful sobs. As RUBY walks around the house, PREACHER wipes his tears with his left hand and raises his right as the CHILDREN appear. RACHEL responds, with JOHN beside her, holding her skirt, eyes locked on hers. The CHILDREN freeze, PEARL just beyond JOHN, who seeks clarity from RACHEL. Realizing JOHN's betrayal, she looks at PREACHER, who stands with an open knife. A gun-barrel twitches as PREACHER retreats to his horse, bouncing the knife, and mounts. The scene shifts to RACHEL in bed with a gun, RUBY listening to a song. We see PREACHER outside through a window. RACHEL joins the hymn, a candle descends past the window, and the song ends. RUBY enters with a candle, blacking out the window. RACHEL blows out the candle; PREACHER is gone. She approaches the window, sees the CHILDREN's trusting eyes, and returns to her chair, their eyes on her. As the clock strikes three, RACHEL hears a sound, sees a shadow in the mirror, and faces the darkness. She bends to the CHILDREN, who scatter; RUBY lingers, then obeys. RACHEL, gun ready, confronts PREACHER's satanic face and knife. She fires, and PREACHER, wounded, runs to the barn. The CHILDREN huddle silently on the stairs while RACHEL, gun under her arm, talks on the wall phone. RACHEL sits on the porch, awake, with a gun on her knees, as JOHN sleeps, leaning against her."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "From RACHEL's view, she sees PREACHER's face twitch with emotion, leading to thankful sobs. As RUBY leaves, PREACHER wipes his tears and raises his hand as the CHILDREN arrive. JOHN, beside RACHEL, holds her skirt, eyes locked on hers. The CHILDREN freeze, with PEARL nearby. JOHN seeks clarity from RACHEL, who realizes JOHN has betrayed her. PREACHER stands with a knife, and a gun-barrel twitches. He retreats to his horse, bouncing the knife, and mounts it. RACHEL, with a gun on her knees, joins a hymn as PREACHER sits outside. A candle passes a window as they sing, and RUBY enters with a candle, blacking out the window. RACHEL blows it out; PREACHER is gone. She moves to the window, seeing the CHILDREN's trusting eyes, then returns to her chair. As the clock strikes three, RACHEL hears a sound, sees a shadow, and readies her gun. She bends to the CHILDREN, who scatter; RUBY hesitates, then follows. RACHEL faces the darkness as PREACHER's face and knife rise. She fires, and PREACHER runs, wounded, to the barn. The CHILDREN huddle silently while RACHEL, gun under her arm, talks on the wall phone. RACHEL sits on the porch, awake, with a gun, as JOHN sleeps against her."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "From RACHEL's perspective, as she peers through a screen, she observes PREACHER's face contorting with a surge of emotion, leading him to break down into profound, grateful sobs. Meanwhile, RUBY delicately makes her way around the side of the house, and PREACHER, with a heavy heart, watches her depart, using the heel of his left hand to wipe away his tears. He raises his right hand in a gesture as all the CHILDREN come into view, rounding the corner of the house. As they approach, RACHEL responds, and by this time, JOHN has positioned himself on the top step beside her. One of his small hands clings to her skirt, as if trying to draw her closer to him, his eyes unwaveringly fixed on hers. All the CHILDREN come to a sudden halt, with PEARL standing on the ground just beyond where JOHN is. He gazes up at RACHEL, and JOHN looks deeply into her eyes, seeking clarity about the unfolding situation. She absorbs this, coming to the realization that JOHN has betrayed her trust, then shifts her gaze to PREACHER off-screen, who rises to his feet, an open knife glinting in his hand. As they witness this, a gun-barrel twitches ominously. PREACHER retreats cautiously towards his horse, lightly bouncing the knife in his hand, and as he mounts his horse, the scene transitions. RACHEL is now seated in profile, a gun resting across her knees in a large bed, while RUBY sits up attentively, listening to a song off-screen. The camera pans to PREACHER outside, visible through the window as he sits hunched over on a stump. After a brief moment, RACHEL opens her mouth, perhaps to comfort herself or to drown out PREACHER's voice, and she joins in the hymn. A descending candle passes by a window as RACHEL and PREACHER sing off-screen, and over the back of RACHEL's head, the song concludes. RUBY enters the frame carrying a candle, which obscures the window-glass. RACHEL looks up and extinguishes the candle; through the window, PREACHER has vanished. She stands as RUBY exits the frame, and RACHEL moves towards the window, looking up to see the CHILDREN gazing at her with complete trust. She turns around and walks back to her chair, the CHILDREN's eyes following her every move, her eyes sparkling as she turns to look towards us. As the clock begins to strike three, RACHEL turns her attention to the sound off-screen. In the mirror, a shadow ducks out of sight. RACHEL rises, gun at the ready, and faces into the darkness. With her eyes fixed on the darkness, she bends low to the CHILDREN, who scatter out of the frame; RUBY hesitates, then follows in a trance-like state. RACHEL, gun poised, peers into the darkness as PREACHER's sinister face and his hand, lifting the open knife, swiftly emerge from the floor. She fires her gun, and PREACHER, yelping in pain, staggers out and runs into the barn. The CHILDREN huddle together on the stairs in reverent silence while RACHEL, her gun slung casually under one arm, speaks into the wall phone, which hangs just within the box stairway. RACHEL sits on the screened porch, wide awake, with a gun resting on her knees, as JOHN sits on the floor asleep, his head leaning gently against her."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "From RACHEL’s perspective, as she gazes intently through the screen, she takes in the sight of PREACHER’s face, which is twisting and contorting with a powerful surge of emotion. This overwhelming feeling eventually causes him to break down, leading to a torrent of profound and grateful sobs. Meanwhile, with delicate and careful steps, RUBY makes her way around the side of the house. Observing this, PREACHER, with a heavy heart weighed down by emotion, watches her leave. He uses the heel of his left hand to brush away the tears streaming down his face. In a motion filled with mixed emotions, he raises his right hand in a gesture as all the CHILDREN come into view, rounding the corner of the house. As they make their approach, RACHEL responds to the situation, and by this time, JOHN has taken up a position next to her, sitting on the top step. One of his small hands clutches her skirt, as if he is trying to draw her nearer to him, his eyes locked unwaveringly on hers. Suddenly, all the CHILDREN come to a standstill, with PEARL standing firmly on the ground just a little beyond where JOHN is. He looks up at RACHEL, and JOHN maintains his deep gaze into her eyes, seeking some clarity or understanding about the unfolding situation. Absorbing this, RACHEL comes to the painful realization that JOHN has betrayed her trust, then shifts her gaze to where PREACHER is off-screen. Rising to his feet, an open knife glittering menacingly in his hand, PREACHER moves. As they all witness this tense moment, a gun-barrel twitches ominously. PREACHER, with cautious steps, retreats towards his horse, lightly and rhythmically bouncing the knife in his hand. As he mounts his horse, the scene outside transitions. Now, RACHEL is seated in profile, with a gun resting across her knees on the large bed. RUBY sits up attentively, her ears tuned to a song playing off-screen. The camera pans to reveal PREACHER outside, visible through the window as he sits hunched over on a stump, deep in thought. After a brief moment of silence, RACHEL opens her mouth, perhaps intending to comfort herself or maybe to drown out PREACHER's voice, and she joins in the hymn. A descending candle moves past a window as RACHEL and PREACHER sing off-screen; eventually, over the back of RACHEL's head, the song concludes. RUBY appears within the frame, carrying a candle that obstructs the window-glass. RACHEL looks up thoughtfully and extinguishes the candle; through the window, PREACHER has vanished from sight. Rising to her feet as RUBY exits the frame, RACHEL moves towards the window, looking up to see the CHILDREN peering at her with an expression of complete trust. She turns around and walks back towards her chair, the CHILDREN's eyes following her every movement, her own eyes sparkling with emotion as she turns to look towards us. As the clock begins the solemn task of striking three, RACHEL turns her attention to the sound resonating off-screen. In the mirror, a shadow quickly ducks out of sight. RACHEL rises with her gun at the ready, facing into the threatening darkness. With eyes fixed on the obscured space, she bends low towards the CHILDREN, who scatter out of the frame; RUBY hesitates momentarily, then follows in a trance-like state. RACHEL, her gun poised and ready, peers into the enveloping darkness as PREACHER's sinister face and his hand, lifting the open knife, swiftly emerge from below the floor. With resolve, she fires her gun, and PREACHER, yelping in sharp pain, staggers out and hastily retreats into the barn. The CHILDREN huddle together on the stairs, enveloped in reverent silence, while RACHEL, her gun slung casually under one arm, speaks into the wall phone, which hangs conveniently just within the box stairway. She sits on the screened porch, wide awake, with the gun resting securely on her knees, as JOHN sits on the floor asleep, his head gently leaning against her for comfort."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "From RACHEL's viewpoint, through a screen, she observes PREACHER's face contort with emotion, leading him to break into great, thankful sobs. As RUBY minces off around the side of the house, PREACHER watches her departure and uses the heel of his left hand to wipe away his tears. He then raises his right hand as all the CHILDREN come into view, entering around the corner of the house. As they approach, RACHEL responds, and by this time, JOHN has positioned himself on the top step beside her, one of his hands clutching her skirt as if trying to pull her closer, his eyes fixed intently on hers. All the CHILDREN come to a halt, with PEARL positioned on the ground just beyond JOHN. He glances up at RACHEL, and JOHN gazes deeply into her eyes, seeking clarification of the situation. RACHEL processes this, realizing that JOHN has betrayed her, and then shifts her gaze to PREACHER off-screen, who rises to his feet with an open knife in his hand. As they notice this, a gun-barrel twitches. PREACHER retreats towards his horse, lightly bouncing the knife in his hand, and as he mounts his horse, the scene transitions. RACHEL is now seated in profile with a gun resting across her knees in a large bed, while RUBY sits up, listening to a song off-screen. The camera pans to PREACHER outside, visible through the window as he sits hunched on a stump. After a moment, RACHEL opens her mouth, either to comfort herself or to drown out PREACHER's voice, and joins in the hymn. A descending candle moves past a window as RACHEL and PREACHER sing off-screen, and over the back of RACHEL's head, the song concludes. RUBY enters the frame carrying a candle, which obscures the window-glass. RACHEL looks up and extinguishes the candle; through the window, PREACHER has disappeared. She stands as RUBY exits the frame, and RACHEL moves towards the window, looking up to see the CHILDREN gazing at her with complete trust. She turns around and walks back to her chair, the CHILDREN's eyes following her, her own eyes glittering as she turns to look towards us. As the clock begins to strike three, RACHEL turns her attention to the sound off-screen. In the mirror, a shadow ducks. RACHEL rises, gun at the ready, and faces into the darkness. Keeping her eyes on the darkness, she bends low to the CHILDREN, who scatter out of the frame; RUBY hesitates, then follows in a trance. RACHEL, with her gun poised, peers into the darkness as PREACHER's sinister face and his hand lifting the open knife swiftly emerge from the floor. She fires her gun, and PREACHER staggers out, running and yelping in pain into the barn. The CHILDREN huddle on the stairs in reverent silence while RACHEL, her gun slung casually under one arm, speaks into the wall phone, which hangs just within the box stairway. RACHEL sits on the screened porch, alert, with a gun on her knees, as JOHN sits on the floor asleep, his head resting against her."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "From RACHEL's viewpoint, she observes PREACHER's emotional breakdown, marked by thankful sobs, as RUBY departs around the house. PREACHER wipes his tears, signals to the CHILDREN as they approach, and RACHEL responds while JOHN clings to her, seeking clarity. The CHILDREN pause, and RACHEL realizes JOHN's betrayal as PREACHER stands with a knife. A gun-barrel twitches, prompting PREACHER to retreat to his horse, shifting the scene. RACHEL, with a gun across her knees, sits in bed while RUBY listens to a song. PREACHER is visible outside through the window, and RACHEL joins the hymn, drowning out his presence. As a candle passes the window, RUBY enters with another candle, blacking out the glass. RACHEL extinguishes it, noticing PREACHER's absence, and moves to the window, meeting the CHILDREN's trusting gaze. She returns to her chair, their eyes on her, and turns as the clock strikes three. Hearing a sound, she readies her gun, bends to the CHILDREN, who scatter, and faces the darkness. PREACHER's menacing figure emerges, and RACHEL fires, driving him into the barn. The CHILDREN huddle silently on the stairs while RACHEL, gun in hand, uses the wall phone. Later, she sits on the porch, alert with a gun, as JOHN sleeps beside her."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "From RACHEL's viewpoint, through a screen similar to those common in old farmhouses that provide a thin barrier between the internal and external world, she sees PREACHER's face twitch with emotion, and he breaks out into great thankful sobs. As RUBY, likely known for her cautious demeanor, minces off around the side of the rustic country house, PREACHER watches her and wipes off his tears with the heel of his left hand, a gesture often associated with wiping away more than just surface emotion. He holds up his right hand as all the CHILDREN, a group entrusted to RACHEL's protection, enter around the corner of the house. As they move in, RACHEL replies, and by now, JOHN, a child who has become a steadfast companion to her, is on the top step beside her, one of his hands holding on to her skirt as if pulling her towards him with the innocence of a child needing reassurance, his eyes never leaving hers. All the CHILDREN freeze, with PEARL, possibly the youngest, on the ground just beyond JOHN. He looks up at RACHEL, and JOHN looks deep into her eyes, wanting the situation clarified. She takes this in, realizing JOHN has sold her trust, then looks to PREACHER o.s., who gets to his feet with an open knife in his hand, a symbol of the conflicting threats they face. As they see it, a gun-barrel, cold and unyielding, twitches. PREACHER backs away towards his horse, a reliable steed in times of urgency, bouncing the knife lightly in his hand, and as he mounts his horse, the scene shifts. RACHEL sits in profile with a gun across her knees in a big bed indicative of the kind found in old frontier homes, while RUBY sits up listening to a song o.s., perhaps a hymn that carries significance in their community. We pan to PREACHER outside, seen through the window as he sits hunched on a stump, resembling a penitent figure. After a moment, as RACHEL opens her mouth, either to comfort herself or to drown out PREACHER's voice, she joins in the hymn, a shared act of defiance or faith. A descending candle, symbolizing the passage of time or the end of a confrontation, moves past a window as RACHEL and PREACHER sing o.s., and over the back of RACHEL's head, the song ends. RUBY enters the shot carrying a candle, which blacks out the window-glass, a visual metaphor for obscuring the reality outside. RACHEL looks up and blows out the candle, through the window, PREACHER has gone. She stands up as RUBY leaves the shot, and RACHEL moves towards the window, looks up, and sees the CHILDREN looking at her with complete trust, a relationship forged in shared adversity. She turns around and walks back to her chair, with the CHILDREN's eyes always on her, her eyes glittering with determination as she turns to look towards us. As the clock starts striking three, a time often associated with pivotal moments or resolutions, RACHEL looks to the sound o.s. In the mirror, a shadow ducks, hinting at unseen dangers. RACHEL gets up, gun at port, a military stance, and faces into the darkness, a physical manifestation of their ongoing struggle. Eyes on the darkness, she bends low to the CHILDREN, who scatter out of the shot; RUBY lingers, then obeys in a trance, perhaps realizing the gravity of the situation. RACHEL, gun at the ready, looks into the darkness as PREACHER's satanic face and his hand lifting the open knife rise swiftly from the floor, underscoring his menacing presence. She fires off her gun, and PREACHER staggers out, runs yelping with pain into the barn, a symbol of temporary refuge. The CHILDREN huddle on the stairs in reverent silence, a shared sense of relief and awe, while RACHEL, her gun slung sportily under one arm, talks into the wall phone, a connection to the outside world, which hangs just within the box stairway. RACHEL sits on the screened porch, awake, with a gun on her knees, a readiness borne of necessity, as JOHN sits on the floor asleep, his head leaning against her, comforted by her presence."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "From RACHEL's viewpoint through a screen she sees PREACHER's face twitch with emotion and he breaks out into great thankful sobs. As RUBY minces off around the side of the house PREACHER watches her and wipes off his tears with the heel of his left hand. He holds up his right hand as all the CHILDREN enter around the corner of the house. As they move in RACHEL replies and by now JOHN is on the top step beside her one of his hands holding on to her skirt as if pulling her towards him his eyes never leaving hers. All the CHILDREN freeze with PEARL on the ground just beyond JOHN. He looks up at RACHEL and JOHN looks deep into her eyes wanting the situation clarified. She takes this in realizing JOHN has sold her then looks to PREACHER os who gets to his feet with an open knife in his hand. As they see it a gunbarrel twitches. PREACHER backs away towards his horse bouncing the knife lightly in his hand and as he mounts his horse the scene shifts. RACHEL sits in profile with a gun across her knees in a big bed while RUBY sits up listening to a song os. We pan to PREACHER outside seen through the window as he sits hunched on a stump. After a moment as RACHEL opens her mouth either to comfort herself or to drown out PREACHER's voice she joins in the hymn. A descending candle moves past a window as RACHEL and PREACHER sing os and over the back of RACHEL's head the song ends. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. RUBY enters the shot carrying a candle which blacks out the windowglass. RACHEL looks up and blows out the candle through the window. PREACHER has gone. She stands up as RUBY leaves the shot and RACHEL moves towards the window looks up and sees the CHILDREN looking at her with complete trust. She turns around and walks back to her chair with the CHILDREN's eyes always on her her eyes glittering as she turns to look towards us. As the clock starts striking three RACHEL looks to the sound os. In the mirror a shadow ducks. RACHEL gets up gun at port and faces into the darkness. Eyes on the darkness she bends low to the CHILDREN who scatter out of the shot. RUBY lingers then obeys in a trance. RACHEL gun at the ready looks into the darkness as PREACHER's satanic face and his hand lifting the open knife rise swiftly from the floor. She fires off her gun and PREACHER staggers out runs yelping with pain into the barn. The CHILDREN huddle on the stairs in reverent silence while RACHEL her gun slung sportily under one arm talks into the wall phone which hangs just within the box stairway. RACHEL sits on the screened porch awake with a gun on her knees as JOHN sits on the floor asleep his head leaning against her."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "From RACHEL's viewpoint through a screen she sees PREACHER's face twitch with emotion and he breaks out into great thankful sobs. As RUBY minces off around the side of the house PREACHER watches her and wipes off his tears with the heel of his left hand. He holds up his right hand as all the CHILDREN enter around the corner of the house. As they move in RACHEL replies and by now JOHN is on the top step beside her one of his hands holding on to her skirt as if pulling her towards him his eyes never leaving hers. All the CHILDREN freeze with PEARL on the ground just beyond JOHN. He looks up at RACHEL and JOHN looks deep into her eyes wanting the situation clarified. She takes this in realizing JOHN has sold her then looks to PREACHER os who gets to his feet with an open knife in his hand. As they see it a gunbarrel twitches. PREACHER backs away towards his horse bouncing the knife lightly in his hand and as he mounts his horse the scene shifts. RACHEL sits in profile with a gun across her knees in a big bed while RUBY sits up listening to a song os. We pan to PREACHER outside seen through the window as he sits hunched on a stump. After a moment as RACHEL opens her mouth either to comfort herself or to drown out PREACHER's voice she joins in the hymn. A descending candle moves past a window as RACHEL and PREACHER sing os and over the back of RACHEL's head the song ends. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. RUBY enters the shot carrying a candle which blacks out the windowglass. RACHEL looks up and blows out the candle through the window. PREACHER has gone. She stands up as RUBY leaves the shot and RACHEL moves towards the window looks up and sees the CHILDREN looking at her with complete trust. She turns around and walks back to her chair with the CHILDREN's eyes always on her her eyes glittering as she turns to look towards us. As the clock starts striking three RACHEL looks to the sound os. In the mirror a shadow ducks. RACHEL gets up gun at port and faces into the darkness. Eyes on the darkness she bends low to the CHILDREN who scatter out of the shot. RUBY lingers then obeys in a trance. RACHEL gun at the ready looks into the darkness as PREACHER's satanic face and his hand lifting the open knife rise swiftly from the floor. She fires off her gun and PREACHER staggers out runs yelping with pain into the barn. The CHILDREN huddle on the stairs in reverent silence while RACHEL her gun slung sportily under one arm talks into the wall phone which hangs just within the box stairway. RACHEL sits on the screened porch awake with a gun on her knees as JOHN sits on the floor asleep his head leaning against her."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "From RACHEL's viewpoint through a screen she sees PREACHER's face twitch with emotion and he breaks out into great thankful sobs. As RUBY minces off around the side of the house PREACHER watches her and wipes off his tears with the heel of his left hand. He holds up his right hand as all the CHILDREN enter around the corner of the house. As they move in RACHEL replies and by now JOHN is on the top step beside her one of his hands holding on to her skirt as if pulling her towards him his eyes never leaving hers. All the CHILDREN freeze with PEARL on the ground just beyond JOHN. He looks up at RACHEL and JOHN looks deep into her eyes wanting the situation clarified. She takes this in realizing JOHN has sold her then looks to PREACHER os who gets to his feet with an open knife in his hand. RACHEL gets up gun at port and faces into the darkness. Eyes on the darkness she bends low to the CHILDREN who scatter out of the shot. RUBY lingers then obeys in a trance. RACHEL gun at the ready looks into the darkness as PREACHER's satanic face and his hand lifting the open knife rise swiftly from the floor. She fires off her gun and PREACHER staggers out runs yelping with pain into the barn. The CHILDREN huddle on the stairs in reverent silence while RACHEL her gun slung sportily under one arm talks into the wall phone which hangs just within the box stairway. RACHEL sits on the screened porch awake with a gun on her knees as JOHN sits on the floor asleep his head leaning against her."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "From RACHEL's viewpoint through a screen she sees PREACHER's face twitch with emotion and he breaks out into great thankful sobs. As RUBY minces off around the side of the house PREACHER watches her and wipes off his tears with the heel of his left hand. He holds up his right hand as all the CHILDREN enter around the corner of the house. She fires off her gun and PREACHER staggers out runs yelping with pain into the barn. The CHILDREN huddle on the stairs in reverent silence while RACHEL her gun slung sportily under one arm talks into the wall phone which hangs just within the box stairway. RACHEL sits on the screened porch awake with a gun on her knees as JOHN sits on the floor asleep his head leaning against her."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "From TOBY's perspective, through a painting, he notices BAKER's face shimmer with confusion, and he erupts into loud joyful whispers. As LILY dances around the corner of the garden, BAKER observes her and brushes away his thoughts with the heel of his right shoe. He raises his left shoe as all the CATS emerge from behind the hedge. As they advance, TOBY responds, and by this time, GEORGE is on the highest branch beside him, one of his shoes gripping on to his jacket as if pulling him towards it, his gaze never leaving his. All the CATS halt, with DAISY on the rock just beyond GEORGE. He glances at TOBY, and GEORGE peers deep into his face, seeking the statement clarified. He absorbs this, realizing GEORGE has lent him out, then glances to BAKER o.s., who stands with a closed book in his arm. As they observe it, a candle flickers. BAKER moves away towards his cart, twirling the book lightly in his fingers, and as he climbs into his cart, the narrative shifts. TOBY reclines in silhouette with a candle across his lap in a large chair, while LILY reclines up listening to a tune o.s. We pan to BAKER outside, seen through the doorway as he rests curled on a log. After a moment, as TOBY opens his mouth, either to console himself or to drown out BAKER's murmur, he joins in the chant. A floating lantern moves past a door as TOBY and BAKER hum o.s., and over the back of TOBY's head, the melody concludes. LILY enters the frame carrying a lantern, which blacks out the glass-pane. TOBY gazes up and extinguishes the lantern; through the door, BAKER has vanished. He rises as LILY exits the frame, and TOBY advances towards the door, looks up, and sees the CATS staring at him with absolute confidence. He pivots and strolls back to his seat, with the CATS' gaze constantly on him, his eyes sparkling as he turns to glance towards us. As the clock begins chiming six, TOBY listens to the noise o.s. In the reflection, a figure leaps. TOBY rises, lantern in hand, and peers into the shadows. Eyes on the shadows, he lowers closely to the CATS, who disperse out of the scene; LILY hesitates, then follows in a daze. TOBY, lantern at the ready, peers into the shadows as BAKER's ghostly visage and his arm lifting the closed book ascend rapidly from the ground. He flashes his lantern, and BAKER stumbles out, dashes groaning with distress into the workshop. The CATS cluster on the landing in respectful silence while TOBY, his lantern resting elegantly under one elbow, converses into the corner radio, which hangs just within the shelf landing. TOBY reclines on the screened patio, alert, with a lantern on his lap, as GEORGE lounges on the mat asleep, his hat leaning against him."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "From RACHEL's perspective through a screen, PREACHER's face shows emotion, breaking into thankful sobs. As RUBY leaves the house, PREACHER watches her and wipes his tears, raising his hand as the CHILDREN arrive. JOHN, holding RACHEL's skirt, seeks clarity in her eyes. RACHEL notices PREACHER with a knife, backing to his horse. RACHEL later sits with a gun on her knees in bed, joining in a hymn, as PREACHER sits outside. A candle blacks out the window when RUBY enters, and RACHEL, now alone, sees trusting CHILDREN outside. Hearing a clock strike, she faces the darkness, scattering the CHILDREN. PREACHER's menacing face appears, and RACHEL fires her gun, wounding him. The CHILDREN observe silently as she calls for help on the phone. RACHEL remains vigilant on the porch, with JOHN asleep beside her."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "RACHEL sits on the screened porch awake with a gun on her knees as JOHN sits on the floor asleep his head leaning against her The CHILDREN huddle on the stairs in reverent silence while RACHEL her gun slung sportily under one arm talks into the wall phone which hangs just within the box stairway  She fires off her gun and PREACHER staggers out runs yelping with pain into the barn  RACHEL gun at the ready looks into the darkness as PREACHER's satanic face and his hand lifting the open knife rise swiftly from the floor  RUBY lingers then obeys in a trance  Eyes on the darkness she bends low to the CHILDREN who scatter out of the shot  RACHEL gets up gun at port and faces into the darkness  In the mirror a shadow ducks  As the clock starts striking three RACHEL looks to the sound os  She turns around and walks back to her chair with the CHILDREN's eyes always on her her eyes glittering as she turns to look towards us  She stands up as RUBY leaves the shot and RACHEL moves towards the window looks up and sees the CHILDREN looking at her with complete trust  PREACHER has gone  RACHEL looks up and blows out the candle through the window  RUBY enters the shot carrying a candle which blacks out the windowglass  A descending candle moves past a window as RACHEL and PREACHER sing os and over the back of RACHEL's head the song ends  After a moment as RACHEL opens her mouth either to comfort herself or to drown out PREACHER's voice she joins in the hymn  We pan to PREACHER outside seen through the window as he sits hunched on a stump  RACHEL sits in profile with a gun across her knees in a big bed while RUBY sits up listening to a song os  PREACHER backs away towards his horse bouncing the knife lightly in his hand and as he mounts his horse the scene shifts  As they see it a gunbarrel twitches  She takes this in realizing JOHN has sold her then looks to PREACHER os who gets to his feet with an open knife in his hand  He looks up at RACHEL and JOHN looks deep into her eyes wanting the situation clarified  All the CHILDREN freeze with PEARL on the ground just beyond JOHN  As they move in RACHEL replies and by now JOHN is on the top step beside her one of his hands holding on to her skirt as if pulling her towards him his eyes never leaving hers  He holds up his right hand as all the CHILDREN enter around the corner of the house  As RUBY minces off around the side of the house PREACHER watches her and wipes off his tears with the heel of his left hand  From RACHEL's viewpoint through a screen she sees PREACHER's face twitch with emotion and he breaks out into great thankful sobs "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "As RUBY minces off around the side of the house PREACHER watches her and wipes off his tears with the heel of his left hand From RACHEL's viewpoint through a screen she sees PREACHER's face twitch with emotion and he breaks out into great thankful sobs As they move in RACHEL replies and by now JOHN is on the top step beside her one of his hands holding on to her skirt as if pulling her towards him his eyes never leaving hers He holds up his right hand as all the CHILDREN enter around the corner of the house He looks up at RACHEL and JOHN looks deep into her eyes wanting the situation clarified All the CHILDREN freeze with PEARL on the ground just beyond JOHN As they see it a gunbarrel twitches She takes this in realizing JOHN has sold her then looks to PREACHER os who gets to his feet with an open knife in his hand RACHEL sits in profile with a gun across her knees in a big bed while RUBY sits up listening to a song os PREACHER backs away towards his horse bouncing the knife lightly in his hand and as he mounts his horse the scene shifts After a moment as RACHEL opens her mouth either to comfort herself or to drown out PREACHER's voice she joins in the hymn We pan to PREACHER outside seen through the window as he sits hunched on a stump RUBY enters the shot carrying a candle which blacks out the windowglass A descending candle moves past a window as RACHEL and PREACHER sing os and over the back of RACHEL's head the song ends PREACHER has gone RACHEL looks up and blows out the candle through the window She turns around and walks back to her chair with the CHILDREN's eyes always on her her eyes glittering as she turns to look towards us She stands up as RUBY leaves the shot and RACHEL moves towards the window looks up and sees the CHILDREN looking at her with complete trust In the mirror a shadow ducks As the clock starts striking three RACHEL looks to the sound os Eyes on the darkness she bends low to the CHILDREN who scatter out of the shot RACHEL gets up gun at port and faces into the darkness RACHEL gun at the ready looks into the darkness as PREACHER's satanic face and his hand lifting the open knife rise swiftly from the floor RUBY lingers then obeys in a trance The CHILDREN huddle on the stairs in reverent silence while RACHEL her gun slung sportily under one arm talks into the wall phone which hangs just within the box stairway She fires off her gun and PREACHER staggers out runs yelping with pain into the barn RACHEL sits on the screened porch awake with a gun on her knees as JOHN sits on the floor asleep his head leaning against her"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "RACHEL looks up and blows out the candle through the window  PREACHER has gone  She stands up as RUBY leaves the shot and RACHEL moves towards the window looks up and sees the CHILDREN looking at her with complete trust  She turns around and walks back to her chair with the CHILDREN's eyes always on her her eyes glittering as she turns to look towards us  As the clock starts striking three RACHEL looks to the sound os  In the mirror a shadow ducks  RACHEL gets up gun at port and faces into the darkness  Eyes on the darkness she bends low to the CHILDREN who scatter out of the shot  RUBY lingers then obeys in a trance  RACHEL gun at the ready looks into the darkness as PREACHER's satanic face and his hand lifting the open knife rise swiftly from the floor  She fires off her gun and PREACHER staggers out runs yelping with pain into the barn  The CHILDREN huddle on the stairs in reverent silence while RACHEL her gun slung sportily under one arm talks into the wall phone which hangs just within the box stairway  RACHEL sits on the screened porch awake with a gun on her knees as JOHN sits on the floor asleep his head leaning against her From RACHEL's viewpoint through a screen she sees PREACHER's face twitch with emotion and he breaks out into great thankful sobs  As RUBY minces off around the side of the house PREACHER watches her and wipes off his tears with the heel of his left hand  He holds up his right hand as all the CHILDREN enter around the corner of the house  As they move in RACHEL replies and by now JOHN is on the top step beside her one of his hands holding on to her skirt as if pulling her towards him his eyes never leaving hers  All the CHILDREN freeze with PEARL on the ground just beyond JOHN  He looks up at RACHEL and JOHN looks deep into her eyes wanting the situation clarified  She takes this in realizing JOHN has sold her then looks to PREACHER os who gets to his feet with an open knife in his hand  As they see it a gunbarrel twitches  PREACHER backs away towards his horse bouncing the knife lightly in his hand and as he mounts his horse the scene shifts  RACHEL sits in profile with a gun across her knees in a big bed while RUBY sits up listening to a song os  We pan to PREACHER outside seen through the window as he sits hunched on a stump  After a moment as RACHEL opens her mouth either to comfort herself or to drown out PREACHER's voice she joins in the hymn  A descending candle moves past a window as RACHEL and PREACHER sing os and over the back of RACHEL's head the song ends  RUBY enters the shot carrying a candle which blacks out the windowglass "
        }
      ]
    }
  ]
}