{
  "ground_truth": "Jane starts her day by going to the bathroom to moisturize her hands and then does some work on her laptop. Shuffling papers, she glances at the door before doing sit-ups and cleaning the cooker in rubber gloves. Jane struggles with her emotions, and the next day, the sisters arrive at Hell's hardware store. Jane lets the door close on Tess as her father stares disapprovingly at Jane's agonized expression. While Tess and George flirt in his office, Jane frowns upon seeing Kevin's name in her filofax, then decides to dial Kevin's number. Kevin grins and hangs up, while a youngster with a baseball glove enters, and Pedro frowns. They arrive at the Department of Parks and Recreation Youth Sports ground, where Pedro grins at them from the baseball field as Jane rolls her eyes in disbelief. A large bunch of yellow flowers is delivered, and Jane hands them to Tess with a tight smile. Later, she brings paperwork to George's office, grinning as he happily talks on the phone, but her smile fades at the sight of pictures of him and Tess. They all have dinner at Jane's father's house, where she unhappily stuffs her face with food as Tess chatters and the men smile. At her apartment, Jane finds Tess and George kissing on the couch and, feeling crushed, leaves them to it and goes out again. She attends a leather and bondage wedding, wearing a spiked leather collar, trying to be in a party mood. Jane flicks the heavy metal devil horns at George and Tess, who do the same as they grin. When they kiss, Jane looks mortified as Casey catches her eye. George holds up two ties for her approval, and he nods tight-lipped as she knots the tie. She smiles after him and heads back to her desk. In the evening at the office, Jane tidies away files on George's desk and finds his wallet underneath. After consulting his appointments, she sighs and leaves. A taxi pulls up outside a restaurant, and Jane gets out. Tess looks stunned, and Jane is at a loss. A small white box is tucked in the dog's collar, which contains a diamond ring. He slips the ring on her finger, and they kiss as Jane stands helplessly nearby. It's a wedding dress, and Jane later meets up with Kevin in a bar, where she looks pleased with herself. He takes her hand, and Jane stares in shock across the Central Park boating lake before they return to their yoga. There's a meeting at the New Warsaw bakery, where Kevin claps, and Jane, who looks tearful, pulls herself together. Kevin looks down a street past a shop and up the steps to Jane's building.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Jane begins her morning by heading to the lavatory to hydrate her palms and then performs some tasks on her notebook. Sorting documents, she peeks at the entryway before performing sit-ups and scrubbing the stove in latex gloves. Jane grapples with her feelings, and the subsequent day, the siblings visit Hell's tool shop. Jane permits the entrance to shut on Tess as her father gazes disapprovingly at Jane's pained visage. While Tess and George court in his workspace, Jane scowls upon observing Kevin's title in her planner, then resolves to call Kevin's numeral. Kevin beams and disconnects, while a youngster with a baseball mitt arrives, and Pedro scowls. They reach the Department of Parks and Recreation Youth Sports field, where Pedro beams at them from the baseball grounds as Jane rolls her eyes in incredulity. A large bouquet of yellow blossoms is delivered, and Jane presents them to Tess with a strained grin. Later, she conveys documentation to George's workspace, beaming as he cheerfully converses on the phone, but her grin diminishes at the sight of images of him and Tess. They all dine at Jane's father's residence, where she sorrowfully stuffs her face with nourishment as Tess chatters and the gentlemen grin. At her flat, Jane discovers Tess and George embracing on the sofa and, feeling crushed, leaves them to it and departs again. She attends a leather and bondage ceremony, wearing a spiked leather choker, attempting to be in a festive mood. Jane flicks the heavy metal devil horns at George and Tess, who replicate the gesture as they grin. When they embrace, Jane appears horrified as Casey catches her gaze. George holds up two neckties for her endorsement, and he nods tight-lipped as she fastens the tie. She grins after him and returns to her workstation. In the evening at the office, Jane organizes files on George's desk and discovers his billfold beneath. After consulting his engagements, she exhales and exits. A cab pulls up outside an eatery, and Jane disembarks. Tess appears astounded, and Jane is bewildered. A small alabaster box is tucked in the dog's choker, which contains a diamond band. He slides the band on her digit, and they embrace as Jane stands helplessly nearby. It's a bridal gown, and Jane later rendezvous with Kevin in a tavern, where she appears content with herself. He clasps her hand, and Jane gazes in astonishment across the Central Park boating basin before they return to their yoga. There's a gathering at the New Warsaw bakery, where Kevin applauds, and Jane, who appears tearful, pulls herself together. Kevin glances down a road past a shop and up the steps to Jane's building."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Jane's day is started by going to the bathroom to moisturize her hands, and then some work on her laptop is done by her. Papers are shuffled, the door is glanced at by her before sit-ups are done and the cooker is cleaned by her in rubber gloves. Emotions are struggled with by Jane, and the next day, the sisters arrive at Hell's hardware store. The door is let close on Tess by Jane as Jane is stared at by her father disapprovingly for her agonized expression. While Tess and George are flirted with in his office, Kevin's name is frowned upon by Jane in her filofax, then Kevin's number is decided by her to be dialed. Kevin grins and a youngster with a baseball glove enters, frowning at Pedro. They arrive at the Department of Parks and Recreation Youth Sports ground, where Pedro grins at them from the baseball field as Jane's eyes are rolled in disbelief by her. A large bunch of yellow flowers is delivered, and Tess is handed them by Jane with a tight smile. Later, paperwork is brought by her to George's office, grinning as he happily talks on the phone, but her smile fades at the sight of pictures of him and Tess. All have dinner at Jane's father's house, where her face is unhappily stuffed with food by her as Tess chatters and the men smile. At her apartment, Tess and George are found by Jane kissing on the couch, and feeling crushed, they are left to it by her, and she goes out again. She attends a leather and bondage wedding, wearing a spiked leather collar, trying to be in a party mood. George and Tess are flicked the heavy metal devil horns by Jane, who do the same as they grin. When they kiss, Jane's mortification is looked at by Casey as she catches her eye. Two ties are held up by George for her approval, and he nods tight-lipped as the tie is knotted by her. After him, she smiles and heads back to her desk. In the evening at the office, George's desk is tidied away files on by Jane, and his wallet is found underneath by her. His appointments are consulted by her, and a sigh is given before she leaves. A taxi pulls up outside a restaurant, and Jane gets out. Stunned looks are given by Tess, and Jane is at a loss. A small white box is tucked in the dog's collar, which contains a diamond ring. The ring is slipped on her finger, and they kiss as Jane stands helplessly nearby. It's a wedding dress, and Kevin is later met up with by Jane in a bar, where pleased looks are on her face. Her hand is taken by him, and shocked stares are given by Jane across the Central Park boating lake before a return to yoga takes place. A meeting is held at the New Warsaw bakery, where claps are given by Kevin, and Jane, who looks tearful, pulls herself together. Kevin looks down a street past a shop and up the steps to Jane's building."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Jane begins her day with moisturizing, followed by laptop work. She glances at the door while doing sit-ups and cleaning the cooker in rubber gloves. Struggling emotionally, the next day, Jane and Tess visit Hell's hardware store. Jane lets the door close on Tess as their father disapproves of her pained expression. While Tess and George flirt, Jane frowns at Kevin's name in her filofax and calls him. Kevin grins and hangs up. At the Department of Parks and Recreation Youth Sports ground, Pedro greets them from the baseball field as Jane rolls her eyes. Yellow flowers arrive, and Jane gives them to Tess with a tight smile. Later, she brings paperwork to George's office, grinning until she sees pictures of him with Tess. At a family dinner, Jane unhappily eats while Tess chatters. At her apartment, she finds Tess and George kissing and leaves, feeling crushed. She attends a leather and bondage wedding, trying to enjoy the party. Jane and George exchange devil horn gestures. When they kiss, Jane looks mortified, caught by Casey. George shows her two ties; she nods as she knots one. Later, Jane tidies George's desk, finds his wallet, sighs, and leaves. Jane exits a taxi outside a restaurant, leaving Tess stunned. A small white box with a diamond ring is in the dog's collar. He proposes, and they kiss as Jane watches helplessly. Later, Jane meets Kevin at a bar, pleased. They return to their yoga after a moment at Central Park. At a New Warsaw bakery meeting, Kevin claps as Jane, looking tearful, composes herself. Kevin looks up at Jane's building."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Jane begins her day by moisturizing her hands in the bathroom and works on her laptop. After organizing papers, she glances at the door, does sit-ups, and cleans the cooker with rubber gloves. Struggling emotionally, she and her sisters visit Hell's hardware store the next day. Jane lets the door close on Tess, facing her father's disapproval of her distressed look. While Tess and George flirt in his office, Jane frowns at Kevin's name in her filofax and calls him. Kevin grins and hangs up as a young boy enters, and Pedro frowns. They go to the Department of Parks and Recreation Youth Sports ground, where Pedro smiles from the baseball field as Jane rolls her eyes. A bouquet of yellow flowers arrives, and Jane hands them to Tess with a forced smile. Later, she brings paperwork to George, grinning as he chats on the phone but frowning at his pictures with Tess. At her father's house for dinner, Jane unhappily eats as Tess chats and the men smile. At her apartment, Jane finds Tess and George kissing, feels crushed, and leaves. She attends a bondage wedding with a spiked collar, flicking devil horns at George and Tess, who kiss, mortifying Jane as Casey watches. George shows her two ties; she knots one, smiles, and returns to her desk. That evening, she tidies George's files, finds his wallet, checks his appointments, sighs, and leaves. Jane exits a taxi outside a restaurant, surprising Tess. A small white box with a diamond ring in a dog's collar leads to a kiss, leaving Jane helplessly nearby. Later, she meets Kevin at a bar, pleased with herself. He takes her hand; Jane is shocked at the Central Park boating lake before they return to yoga. At the New Warsaw bakery meeting, Kevin claps, and Jane, tearful, pulls herself together as he looks toward her building."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Jane begins her day by heading straight to the bathroom, where she takes a moment to meticulously moisturize her hands. After this brief ritual, she settles down to diligently work on her laptop. While shuffling through several papers, her attention momentarily shifts as she glances toward the door. Following this, she energetically completes some sit-ups before donning rubber gloves to thoroughly clean the cooker. On top of everything, Jane finds herself grappling with her emotions. As the following day unfolds, the sisters make their way to the local establishment known as Hell's Hardware Store. As they enter, Jane inadvertently lets the door swing closed right in Tess's face, while their father stands by, staring with a look of disapproval at Jane’s agonized expression. During this time, Tess and George are in the office, where they engage in lighthearted flirting. Simultaneously, Jane, upon noticing Kevin's name in her filofax, frowns yet eventually decides to make a call to him. When Kevin answers, he simply grins and hangs up, and at that moment, a youngster clutching a baseball glove walks in, causing Pedro to frown. Eventually, they all arrive at the Department of Parks and Recreation Youth Sports ground. Once there, Pedro cannot help but grin at them from the baseball field, to which Jane responds by rolling her eyes in disbelief.\n\nLater on, a vibrant and large bunch of striking yellow flowers is delivered, which Jane hands over to Tess with a tight-lipped smile. Sometime afterward, she delivers some paperwork to George's office, where she finds him happily engaged in a phone conversation. Her smile, however, gradually fades when she notices the pictures of him and Tess displayed prominently. When they all gather for dinner at Jane's father's house, she unhappily stuffs her face with food, while Tess chatters away and the men sit, smiling. Returning to her apartment later, Jane is confronted with the sight of Tess and George kissing on the couch. Feeling utterly crushed, she decides to leave them to it and ventures out once more. She finds herself attending a rather unconventional leather and bondage wedding, where she wears a spiked leather collar in an attempt to get into a party mood. Jane makes the heavy metal devil horns gesture at George and Tess, who return the gesture with grins. As they share a kiss, Jane appears mortified, and Casey catches her eye in the process.\n\nAt another moment, George holds up two ties for her approval, and he nods, attempting a tight-lipped smile as she helps him knot the tie. She then smiles at him before heading back to her desk. Later that evening at the office, Jane busies herself by tidying away files on George’s desk and stumbles across his wallet underneath. After taking a moment to consult his appointments, she lets out a sigh and decides to leave. A taxi then arrives, pulling up right outside a restaurant, and Jane steps out. Tess looks utterly stunned, and Jane is momentarily at a loss for words. A small white box is discretely tucked into the dog's collar, and it contains a dazzling diamond ring. As he places the ring on her finger, they share a kiss while Jane stands nearby, feeling helpless. It turns out to be a wedding dress, and Jane later makes arrangements to meet up with Kevin at a bar, where she seems quite pleased with herself. When he takes her hand, Jane finds herself staring in shock across the serene Central Park boating lake before they both return to their yoga routine. There's a meeting taking place at the New Warsaw Bakery, where Kevin claps encouragingly, and tearful Jane manages to pull herself together. Kevin shifts his gaze, looking down a street past a shop and eventually making his way up the steps to Jane's building."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Jane starts her day by heading directly to the bathroom, where she takes a moment to meticulously apply moisturizer to her hands, ensuring they remain soft and hydrated. After this brief but important ritual, she settles down at her desk to diligently focus on her work using her laptop. As she shuffles through several papers, her attention momentarily shifts as she glances toward the door, perhaps anticipating a visitor. Following this, she energetically engages in some sit-ups, which invigorate her before she dons rubber gloves to thoroughly clean the cooker, ensuring it is spotless. On top of everything, Jane finds herself wrestling with her emotions, a struggle that seems to linger throughout her day.\n\nAs the next day unfolds, the sisters make their way to the local establishment known as Hell's Hardware Store. Upon entering, Jane inadvertently lets the door swing closed right in Tess's face, causing a slight ripple of awkwardness, while their father stands nearby, staring at Jane with a disapproving look as he notices her agonized expression. During this time, Tess and George find themselves in the office, where they engage in lighthearted and playful flirting. Simultaneously, Jane, upon noticing Kevin's name scribbled in her filofax, frowns with frustration yet eventually decides to pick up the phone and make a call to him. When Kevin answers, he simply grins and hangs up, adding to Jane's exasperation. At that very moment, a youngster clutching a baseball glove enters the scene, prompting Pedro to frown with dismay. Eventually, the group arrives at the Department of Parks and Recreation Youth Sports ground. Once there, Pedro cannot help but grin at them from the baseball field with genuine amusement, to which Jane responds by rolling her eyes in disbelief, seemingly unimpressed.\n\nLater on, a vibrant and large bouquet of striking yellow flowers is delivered, which Jane hands over to Tess with a tight-lipped smile, masking her true feelings. Sometime afterward, she delivers some paperwork to George's office, where she finds him happily engaged in a phone conversation. Her smile, however, gradually fades when she notices the pictures of him and Tess prominently displayed, making her feel increasingly insecure. When they all gather for dinner at Jane's father's house, she unhappily stuffs her face with food, while Tess chatters away and the men sit nearby, smiling contentedly. Returning to her apartment later, Jane is confronted with the sight of Tess and George kissing on the couch, a moment that leaves her feeling utterly crushed. She decides to leave them to it and ventures out once more, this time finding herself attending a rather unconventional leather and bondage wedding. In an attempt to get into the party spirit, she wears a spiked leather collar, trying to embrace the unique atmosphere. Jane makes the heavy metal devil horns gesture at George and Tess, who return the gesture with grins, sharing a kiss that leaves Jane appearing mortified, a sentiment that Casey catches through eye contact.\n\nAt another moment, George holds up two ties for her approval, seeking her opinion, and he nods, attempting a tight-lipped smile as she helps him knot the tie, a small gesture that seems to bridge the emotional gap between them. She then smiles at him before heading back to her desk, feeling slightly more at ease. Later that evening at the office, Jane busies herself by tidying away files on George’s desk, and in the process, she stumbles across his wallet underneath. Taking a moment to consult his appointments, she lets out a sigh of resignation and decides to leave, opting not to dwell on it. A taxi arrives shortly thereafter, pulling up right outside a restaurant, and Jane steps out with a sense of purpose. Tess, upon seeing her, looks utterly stunned, and Jane is momentarily at a loss for words, struggling to articulate her thoughts. A small white box is discreetly tucked into the dog's collar, and it contains a dazzling diamond ring. As he carefully places the ring on her finger, they share a kiss, while Jane stands nearby, feeling utterly helpless in the moment. It turns out to be a wedding dress, and Jane later makes arrangements to meet up with Kevin at a bar, where she seems quite pleased with herself, despite the day's earlier challenges. When he takes her hand, Jane finds herself staring in shock across the serene Central Park boating lake, a view that seems to offer some peace before they both return to their yoga routine. There's a meeting taking place at the New Warsaw Bakery shortly thereafter, where Kevin claps encouragingly, and a tearful Jane manages to pull herself together, finding strength in his support. Kevin then shifts his gaze, looking down a bustling street past a shop, and eventually makes his way up the steps to Jane's building, a journey that reflects his commitment to their connection."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Jane begins her day by entering the bathroom where she carefully applies moisturizer to her hands, feeling the creamy texture as it absorbs into her skin. Satisfied with the softness of her hands, she makes her way to her laptop, powering it on and getting comfortable at her desk. She then becomes engrossed in her work, moving papers around with a steady hand, and her eyes momentarily flash to the door, noticing any activity outside her space. After completing her work, she lowers herself to the floor to perform sit-ups, counting each as she tightens her core. Once finished, she heads to the kitchen, slips on rubber gloves, and meticulously scrubs the cooker until it's spotless. Throughout her day, Jane finds herself wrestling with her emotions, trying to keep them in check. The following day, she accompanies her sisters to Hell's hardware store. As they enter, Jane lets the door swing shut on Tess, her father catching sight of her conflicted expression, offering her a look of disapproval. Inside George's office, Tess and George engage in flirtation while Jane, upon noticing Kevin's name in her filofax, hesitates and then dials his number. On the other end, Kevin picks up with a grin, only to hang up shortly after. Meanwhile, a youngster enters the scene, clutching a baseball glove, and Pedro watches with a frown. They then make their way to the Department of Parks and Recreation Youth Sports ground. As Jane witnesses Pedro grinning from the baseball field, she dismisses it with an eye roll. Later, a delivery arrives with a large bouquet of yellow flowers, which Jane reluctantly presents to Tess, her smile tight and forced. Her day continues as she carries paperwork to George's office, where she catches him animatedly chatting on the phone and momentarily mirrors his joy with a grin until her gaze lands on photos of George and Tess, her smile faltering. The day concludes with a dinner at her father's house, where Jane unhappily indulges in food, only half-listening as Tess chatters animatedly and the men share smiles. Returning to her apartment, she is taken aback to find Tess and George in an embrace on the couch, feeling her heart sink, she quietly leaves them behind and ventures back out. Later, she attends a wedding with a leather and bondage theme, donning a spiked leather collar in the spirit of celebration. Amidst the festivities, she throws a heavy metal devil horn gesture at George and Tess, who reciprocate with grins before sharing a kiss, leaving Jane feeling mortified just as Casey looks her way. At a later point, George holds up two ties for Jane’s opinion; she assists him in selecting one and ties it with deft fingers, nodding lightly as he leaves, and she follows him with a smile before returning to her desk to resume her tasks. In the evening, she diligently tidies George's desk, organizing files until she spots his wallet tucked beneath the paperwork. She pauses, checking his appointments with a sigh before leaving the office. A taxi deposits Jane outside a restaurant, and as she steps out, she finds herself facing Tess, who appears stunned. Jane stands there, momentarily at a loss, before noticing a small white box secured to a dog's collar, inside which lies a diamond ring. Witnessing the ring being placed on Tess's finger, Jane watches as they kiss, feeling helpless and sidelined. She later learns it's for a wedding dress fitting, and later meets Kevin at a bar, feeling a sense of accomplishment as he acknowledges her with a warm gesture. They clasp hands, and Jane, in disbelief, gazes out across the Central Park boating lake before they return to their yoga practice. The scene shifts to a meeting at the New Warsaw bakery, where Kevin's enthusiasm is evident as he claps, prompting Jane, despite her tearful demeanor, to regain her composure and join in. Kevin's attention moves elsewhere as he glances down a street, past a familiar shop, and up the steps leading to Jane's building, contemplating the next chapter."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jane begins her day by moisturizing her hands in the bathroom and then working on her laptop. After some sit-ups and cleaning the cooker, she struggles with her emotions. The next day, at Hell's hardware store, Jane lets the door close on Tess, drawing disapproval from their father. As Tess flirts with George, Jane frowns at Kevin's name in her filofax and calls him, only for Kevin to hang up with a grin. Later, at the Department of Parks and Recreation Youth Sports ground, Jane rolls her eyes at Pedro's grin. A bouquet of yellow flowers arrives, which Jane hands to Tess with a tight smile. In George's office, she initially grins at seeing him on the phone but frowns at photos of him and Tess. During dinner at her father's house, Tess chatters while Jane unhappily eats, with the men smiling. Discovering Tess and George kissing at her apartment, Jane leaves feeling crushed and attends a leather and bondage wedding. She interacts reluctantly with George and Tess, feeling mortified as Casey notices her distress. Later, George seeks her approval on ties, which she gives before returning to her desk. In the evening, tidying George's desk, she finds his wallet, checks his schedule, and sighs before leaving. Jane exits a taxi outside a restaurant to find Tess stunned as a diamond ring is slipped onto a finger, leaving Jane helpless. Afterward, Jane meets Kevin at a bar, feeling pleased with herself. They share a moment by the Central Park boating lake before returning to yoga. At a meeting in New Warsaw bakery, Jane regains her composure after appearing tearful, as Kevin observes her building from the street."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Jane starts her day by going to the bathroom to moisturize her hands with a lotion recommended by dermatologists for dry skin and then does some work on her laptop, a high-performance model well-suited for her freelance graphic design projects. Shuffling papers, she glances at the door, a sturdy oak entryway recently installed by a local craftsman, before doing sit-ups as part of her regular morning exercise routine and cleaning the cooker in rubber gloves, which she bought from a well-known eco-friendly brand. Jane struggles with her emotions, which she has been processing since starting therapy last month, and the next day, the sisters arrive at Hell's hardware store, a family-owned business known for its eccentric owner and old-fashioned charm. Jane lets the door close on Tess as her father stares disapprovingly at Jane's agonized expression, a look he's worn since their family dispute over the sale of their childhood home. While Tess and George flirt in his office, which is decorated with vintage baseball memorabilia, Jane frowns upon seeing Kevin's name in her filofax, then decides to dial Kevin's number to discuss a project deadline. Kevin grins and hangs up, feeling smug about their recent conversation, while a youngster with a baseball glove enters, and Pedro frowns, disliking the interruption to their game. They arrive at the Department of Parks and Recreation Youth Sports ground, an expansive facility hosting various local sports events, where Pedro grins at them from the baseball field as Jane rolls her eyes in disbelief at his enthusiasm. A large bunch of yellow flowers, typical of Jane's favorite blooms from the local florist, is delivered, and Jane hands them to Tess with a tight smile. Later, she brings paperwork to George's office, grinning as he happily talks on the phone about a new business deal, but her smile fades at the sight of pictures of him and Tess taken during their recent trip to the coast. They all have dinner at Jane's father's house, a charming Victorian-style home, where she unhappily stuffs her face with food as Tess chatters and the men smile, reminiscing about old family stories. At her apartment, Jane finds Tess and George kissing on the couch, a mid-century piece she inherited from their grandmother and, feeling crushed, leaves them to it and goes out again. She attends a leather and bondage wedding at a trendy downtown venue, wearing a spiked leather collar, trying to be in a party mood despite her inner turmoil. Jane flicks the heavy metal devil horns at George and Tess, who do the same as they grin, embodying the night's playful, rebellious theme. When they kiss, Jane looks mortified as Casey, her close friend and confidant, catches her eye. George holds up two ties for her approval, and he nods tight-lipped as she knots the tie, a skill she learned from her grandfather. She smiles after him and heads back to her desk, cluttered with colorful notebooks and pens. In the evening at the office, Jane tidies away files on George's desk, organizing them as she learned in her administrative training, and finds his wallet underneath. After consulting his appointments, she sighs and leaves, feeling the weight of a busy schedule. A taxi pulls up outside a restaurant, a Michelin-starred favorite among the locals, and Jane gets out. Tess looks stunned, and Jane is at a loss, unsure of how to bridge the growing gap between them. A small white box is tucked in the dog's collar, an antique piece, which contains a diamond ring sourced from a local jeweler. He slips the ring on her finger, and they kiss as Jane stands helplessly nearby, witnessing their joyful moment. It's a wedding dress, a custom piece designed by a renowned local designer, and Jane later meets up with Kevin in a bar, a cozy spot they frequent, where she looks pleased with herself. He takes her hand, and Jane stares in shock across the Central Park boating lake, its serene waters reflecting the city skyline, before they return to their yoga class, a mindfulness practice they both enjoy. There's a meeting at the New Warsaw bakery, famous for its artisanal bread, where Kevin claps, celebrating their latest success, and Jane, who looks tearful, pulls herself together, determined to face the challenges ahead. Kevin looks down a street past a shop, known for its eclectic window displays, and up the steps to Jane's building, a historic brownstone she adores."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He takes her hand and Jane stares in shock across the Central Park boating lake before they return to their yoga Jane starts her day by going to the bathroom to moisturize her hands and then does some work on her laptop He slips the ring on her finger and they kiss as Jane stands helplessly nearby Shuffling papers she glances at the door before doing situps and cleaning the cooker in rubber gloves A small white box is tucked in the dog's collar which contains a diamond ring Jane struggles with her emotions and the next day the sisters arrive at Hell's hardware store Jane let us the door close on Tess as her father stares disapprovingly at Jane's agonized expression While Tess and George flirt in his office Jane frowns upon seeing Kevin's name in her filofax then decides to dial Kevin's number Jane let us the door close on Tess as her father stares disapprovingly at Jane's agonized expression Jane starts her day by going to the bathroom to moisturize her hands and then does some work on her laptop George holds up two ties for her approval and he nods tightlipped as she knots the tie Kevin grins and hangs up while a youngster with a baseball glove enters and Pedro frowns They arrive at the Department of Parks and Recreation Youth Sports ground where Pedro grins at them from the baseball field as Jane rolls her eyes in disbelief A large bunch of yellow flowers is delivered and Jane hands them to Tess with a tight smile While Tess and George flirt in his office Jane frowns upon seeing Kevin's name in her filofax then decides to dial Kevin's number Later she brings paperwork to George's office grinning as he happily talks on the phone but her smile fades at the sight of pictures of him and Tess After consulting his appointments she sighs and leaves They all have dinner at Jane's father's house where she unhappily stuffs her face with food as Tess chatters and the men smile At her apartment Jane finds Tess and George kissing on the couch and feeling crushed leaves them to it and goes out again When they kiss Jane looks mortified as Casey catches her eye She attends a leather and bondage wedding wearing a spiked leather collar trying to be in a party mood Jane flicks the heavy metal devil horns at George and Tess who do the same as they grin Later she brings paperwork to George's office grinning as he happily talks on the phone but her smile fades at the sight of pictures of him and Tess When they kiss Jane looks mortified as Casey catches her eye George holds up two ties for her approval and he nods tightlipped as she knots the tie A large bunch of yellow flowers is delivered and Jane hands them to Tess with a tight smile She smiles after him and heads back to her desk In the evening at the office Jane tidies away files on George's desk and finds his wallet underneath After consulting his appointments she sighs and leaves A taxi pulls up outside a restaurant and Jane gets out There is a meeting at the New Warsaw bakery where Kevin claps and Jane who looks tearful pulls herself together Jane struggles with her emotions and the next day the sisters arrive at Hell's hardware store Tess looks stunned and Jane is at a loss A small white box is tucked in the dog's collar which contains a diamond ring He slips the ring on her finger and they kiss as Jane stands helplessly nearby It is a wedding dress and Jane later meets up with Kevin in a bar where she looks pleased with herself He takes her hand and Jane stares in shock across the Central Park boating lake before they return to their yoga There is a meeting at the New Warsaw bakery where Kevin claps and Jane who looks tearful pulls herself together Kevin looks down a street past a shop and up the steps to Jane's building"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Jane starts her day by going to the bathroom to moisturize her hands and then does some work on her laptop. Shuffling papers she glances at the door before doing situps and cleaning the cooker in rubber gloves. Jane struggles with her emotions and the next day the sisters arrive at Hell's hardware store. Jane let us the door close on Tess as her father stares disapprovingly at Jane's agonized expression. While Tess and George flirt in his office Jane frowns upon seeing Kevin's name in her filofax then decides to dial Kevin's number. Kevin grins and hangs up while a youngster with a baseball glove enters and Pedro frowns. They arrive at the Department of Parks and Recreation Youth Sports ground where Pedro grins at them from the baseball field as Jane rolls her eyes in disbelief. A large bunch of yellow flowers is delivered and Jane hands them to Tess with a tight smile. Later she brings paperwork to George's office grinning as he happily talks on the phone but her smile fades at the sight of pictures of him and Tess. They all have dinner at Jane's father's house where she unhappily stuffs her face with food as Tess chatters and the men smile. At her apartment Jane finds Tess and George kissing on the couch and feeling crushed leaves them to it and goes out again. She attends a leather and bondage wedding wearing a spiked leather collar trying to be in a party mood. Jane flicks the heavy metal devil horns at George and Tess who do the same as they grin. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. When they kiss Jane looks mortified as Casey catches her eye. George holds up two ties for her approval and he nods tightlipped as she knots the tie. She smiles after him and heads back to her desk. In the evening at the office Jane tidies away files on George's desk and finds his wallet underneath. After consulting his appointments she sighs and leaves. A taxi pulls up outside a restaurant and Jane gets out. Tess looks stunned and Jane is at a loss. A small white box is tucked in the dog's collar which contains a diamond ring. He slips the ring on her finger and they kiss as Jane stands helplessly nearby. It is a wedding dress and Jane later meets up with Kevin in a bar where she looks pleased with herself. He takes her hand and Jane stares in shock across the Central Park boating lake before they return to their yoga. There is a meeting at the New Warsaw bakery where Kevin claps and Jane who looks tearful pulls herself together. Kevin looks down a street past a shop and up the steps to Jane's building."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Jane starts her day by going to the bathroom to moisturize her hands and then does some work on her laptop. Shuffling papers she glances at the door before doing situps and cleaning the cooker in rubber gloves. Jane struggles with her emotions and the next day the sisters arrive at Hell's hardware store. Jane let us the door close on Tess as her father stares disapprovingly at Jane's agonized expression. While Tess and George flirt in his office Jane frowns upon seeing Kevin's name in her filofax then decides to dial Kevin's number. Kevin grins and hangs up while a youngster with a baseball glove enters and Pedro frowns. They arrive at the Department of Parks and Recreation Youth Sports ground where Pedro grins at them from the baseball field as Jane rolls her eyes in disbelief. A large bunch of yellow flowers is delivered and Jane hands them to Tess with a tight smile. Later she brings paperwork to George's office grinning as he happily talks on the phone but her smile fades at the sight of pictures of him and Tess. They all have dinner at Jane's father's house where she unhappily stuffs her face with food as Tess chatters and the men smile. At her apartment Jane finds Tess and George kissing on the couch and feeling crushed leaves them to it and goes out again. She attends a leather and bondage wedding wearing a spiked leather collar trying to be in a party mood. Jane flicks the heavy metal devil horns at George and Tess who do the same as they grin. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. When they kiss Jane looks mortified as Casey catches her eye. George holds up two ties for her approval and he nods tightlipped as she knots the tie. She smiles after him and heads back to her desk. In the evening at the office Jane tidies away files on George's desk and finds his wallet underneath. After consulting his appointments she sighs and leaves. A taxi pulls up outside a restaurant and Jane gets out. Tess looks stunned and Jane is at a loss. A small white box is tucked in the dog's collar which contains a diamond ring. He slips the ring on her finger and they kiss as Jane stands helplessly nearby. It is a wedding dress and Jane later meets up with Kevin in a bar where she looks pleased with herself. He takes her hand and Jane stares in shock across the Central Park boating lake before they return to their yoga. There is a meeting at the New Warsaw bakery where Kevin claps and Jane who looks tearful pulls herself together. Kevin looks down a street past a shop and up the steps to Jane's building."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Jane starts her day by going to the bathroom to moisturize her hands and then does some work on her laptop. Shuffling papers she glances at the door before doing situps and cleaning the cooker in rubber gloves. Jane struggles with her emotions and the next day the sisters arrive at Hell's hardware store. Jane let us the door close on Tess as her father stares disapprovingly at Jane's agonized expression. While Tess and George flirt in his office Jane frowns upon seeing Kevin's name in her filofax then decides to dial Kevin's number. Kevin grins and hangs up while a youngster with a baseball glove enters and Pedro frowns. They arrive at the Department of Parks and Recreation Youth Sports ground where Pedro grins at them from the baseball field as Jane rolls her eyes in disbelief. A small white box is tucked in the dog's collar which contains a diamond ring. He slips the ring on her finger and they kiss as Jane stands helplessly nearby. It is a wedding dress and Jane later meets up with Kevin in a bar where she looks pleased with herself. He takes her hand and Jane stares in shock across the Central Park boating lake before they return to their yoga. There is a meeting at the New Warsaw bakery where Kevin claps and Jane who looks tearful pulls herself together. Kevin looks down a street past a shop and up the steps to Jane's building."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Jane starts her day by going to the bathroom to moisturize her hands and then does some work on her laptop. Shuffling papers she glances at the door before doing situps and cleaning the cooker in rubber gloves. Jane struggles with her emotions and the next day the sisters arrive at Hell's hardware store. He takes her hand and Jane stares in shock across the Central Park boating lake before they return to their yoga. There is a meeting at the New Warsaw bakery where Kevin claps and Jane who looks tearful pulls herself together. Kevin looks down a street past a shop and up the steps to Jane's building."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Liam starts his day by going to the bathroom to moisturize his hands and then does some work on his laptop. Shuffling papers, he glances at the door before doing sit-ups and cleaning the cooker in rubber gloves. Liam struggles with his emotions, and the next day, the cousins arrive at Hell's hardware store. Liam lets the door close on Sam as her mother stares disapprovingly at Liam's agonized expression. While Sam and Robert flirt in his office, Liam frowns upon seeing Paul's name in his filofax, then decides to dial Paul's number. Paul grins and hangs up, while a youngster with a baseball glove enters, and Oliver frowns. They arrive at the Department of Parks and Recreation Youth Sports ground, where Oliver grins at them from the baseball field as Liam rolls his eyes in disbelief. A large bunch of yellow flowers is delivered, and Liam hands them to Sam with a tight smile. Later, he brings paperwork to Robert's office, grinning as he happily talks on the phone, but his smile fades at the sight of pictures of him and Sam. They all have dinner at Liam's mother's house, where he unhappily stuffs his face with food as Sam chatters and the women smile. At his apartment, Liam finds Sam and Robert kissing on the couch and, feeling crushed, leaves them to it and goes out again. He attends a leather and bondage wedding, wearing a spiked leather collar, trying to be in a party mood. Liam flicks the heavy metal devil horns at Robert and Sam, who do the same as they grin. When they kiss, Liam looks mortified as Jamie catches his eye. Robert holds up two ties for his approval, and he nods tight-lipped as she knots the tie. He smiles after her and heads back to his desk. In the evening at the office, Liam tidies away files on Robert's desk and finds his wallet underneath. After consulting his appointments, he sighs and leaves. A taxi pulls up outside a restaurant, and Liam gets out. Sam looks stunned, and Liam is at a loss. A small white box is tucked in the cat's collar, which contains a diamond ring. She slips the ring on his finger, and they kiss as Liam stands helplessly nearby. It's a wedding dress, and Liam later meets up with Paul in a bar, where he looks pleased with himself. Paul takes his hand, and Liam stares in shock across the Central Park boating lake before they return to their yoga. There's a meeting at the New Warsaw bakery, where Paul claps, and Liam, who looks tearful, pulls himself together. Paul looks down a street past a shop and up the steps to Liam's building."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Jane starts her day by going to the kitchen to moisturize her feet and then does some work on her tablet. Shuffling magazines, she glances at the window before doing push-ups and cleaning the fridge in gardening gloves. Jane struggles with her emotions, and the next day, the sisters arrive at Heaven's pet store. Jane lets the gate close on Tess as her father stares disapprovingly at Jane's agonized expression. While Tess and George flirt in his garage, Jane frowns upon seeing Kevin's name in her journal, then decides to dial Kevin's number. Kevin grins and hangs up, while a youngster with a soccer ball enters, and Pedro frowns. They arrive at the Department of Transportation Youth Sports court, where Pedro grins at them from the tennis court as Jane rolls her eyes in disbelief. A large bunch of blue balloons is delivered, and Jane hands them to Tess with a tight smile. Later, she brings documents to George's workshop, grinning as he happily talks on the phone, but her smile fades at the sight of pictures of him and Tess. They all have dinner at Jane's mother's house, where she unhappily stuffs her face with pie as Tess chatters and the men smile. At her loft, Jane finds Tess and George kissing on the balcony and, feeling crushed, leaves them to it and goes out again. She attends a masquerade ball, wearing a feathered mask, trying to be in a party mood. Jane flicks the foam party fingers at George and Tess, who do the same as they grin. When they kiss, Jane looks mortified as Casey catches her eye. George holds up two hats for her approval, and he nods tight-lipped as she adjusts the hat. She smiles after him and heads back to her station. In the evening at the office, Jane tidies away books on George's shelf and finds his briefcase underneath. After consulting his schedule, she sighs and leaves. A limousine pulls up outside a café, and Jane gets out. Tess looks stunned, and Jane is at a loss. A small white box is tucked in the cat's collar, which contains a pearl bracelet. He slips the bracelet on her wrist, and they kiss as Jane stands helplessly nearby. It's a ball gown, and Jane later meets up with Kevin in a pub, where she looks pleased with herself. He takes her hand, and Jane stares in shock across the Central Park carousel before they return to their tai chi. There's a meeting at the New Warsaw confectionery, where Kevin claps, and Jane, who looks tearful, pulls herself together. Kevin looks down a path past a kiosk and up the steps to Jane's apartment."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Jane starts her day by entering the bathroom to organize her hands and then relaxes on her laptop. Shuffling papers, she peeks at the door before jumping and decorating the cooker in rubber gloves. Jane laughs with her emotions, and the following day, the sisters depart to Hell's hardware store. Jane lets the door swing on Tess as her father sings disapprovingly at Jane's delighted expression. While Tess and George gossip in his office, Jane giggles upon seeing Kevin's name in her filofax, then decides to jot down Kevin's number. Kevin frowns and picks up, while a youngster with a baseball glove exits, and Pedro smirks. They leave the Department of Parks and Recreation Youth Sports ground, where Pedro frowns at them from the baseball field as Jane applauds in disbelief. A large bunch of yellow flowers is abandoned, and Jane tosses them to Tess with a tight smile. Later, she throws paperwork to George's office, giggling as he silently whispers on the phone, but her smile vanishes at the sight of pictures of him and Tess. They all relax at Jane's father's house, where she cheerfully sips her drink as Tess whispers and the men frown. At her apartment, Jane observes Tess and George laughing on the couch and, feeling thrilled, leaves them to it and stays in. She skips a leather and bondage wedding, wearing a spiked leather collar, trying to be in a sleepy mood. Jane waves the heavy metal devil horns at George and Tess, who do the same as they grimace. When they jump, Jane looks excited as Casey catches her eye. George holds up two ties for her approval, and he nods tight-lipped as she drops the tie. She applauds after him and heads back to her desk. In the evening at the office, Jane scatters files on George's desk and hides his wallet underneath. After browsing his appointments, she giggles and drifts. A taxi pulls up outside a restaurant, and Jane hops out. Tess looks amused, and Jane is at a loss. A small white box is hung on the dog's collar, which contains a diamond ring. He flips the ring on her finger, and they nod as Jane stands helplessly nearby. It's a wedding dress, and Jane later bumps into Kevin in a bar, where she looks stunned with herself. He drops her hand, and Jane blinks in shock across the Central Park boating lake before they drift to their yoga. There's a gathering at the New Warsaw bakery, where Kevin yawns, and Jane, who looks tearful, claps herself together. Kevin looks down a street past a shop and up the steps to Jane's building."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Marvin starts his day by going to the kitchen to polish his shoes and then does some reading on his tablet. Folding clothes, he glances at the window before doing push-ups and scrubbing the toaster in gardening gloves. Marvin struggles with his thoughts, and the following week, the brothers arrive at Heaven's flower shop. Marvin lets the window close on Sam as his neighbor stares disapprovingly at Marvin's delighted expression. While Sam and Alex joke in her workshop, Marvin grins upon seeing Hannah's name in his planner, then decides to text Hannah's phone. Hannah laughs and turns off her device, while a child with a football enters, and Marcus grimaces. They arrive at the Department of Transportation Public Facilities lot, where Marcus laughs at them from the soccer field as Marvin shakes his head in disbelief. A large box of blue balloons is delivered, and Marvin hands them to Sam with a forced grin. Later, he brings documents to Alex's workshop, chuckling as she eagerly chats on the phone, but his laughter fades at the view of images of her and Sam. They all have lunch at Marvin's neighbor's house, where he unhappily talks through a mouthful of salad as Sam jokes and the women laugh. At his apartment, Marvin finds Sam and Alex dancing on the rug and, feeling lost, leaves them to it and steps out again. He attends a masquerade and costume event, wearing a feathered cape, trying to be in a festive mood. Marvin waves the dance floor disco moves at Alex and Sam, who do the same as they chuckle. When they dance together, Marvin looks horrified as Morgan catches his eye. Alex shows two hats for her choice, and he nods tight-lipped as she adjusts the hat. He waves after her and heads back to his chair. In the evening at the cafe, Marvin tidies away cups on Alex's table and finds her keys underneath. After checking her messages, he sighs and departs. A bus stops outside a hotel, and Marvin disembarks. Sam looks surprised, and Marvin is at a loss. A small red envelope is tucked in the cat's collar, which contains a gold bracelet. She slips the bracelet on his wrist, and they embrace as Marvin stands awkwardly nearby. It's a tuxedo, and Marvin later meets up with Hannah in a diner, where he looks confident. She takes his arm, and Marvin stares in disbelief across the Brooklyn Bridge before they return to their jogging. There's a gathering at the Old Vienna cafe, where Hannah cheers, and Marvin, who looks tearful, regains his composure. Hannah looks down an alley past a theater and up the path to Marvin's office."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Liam begins his afternoon by heading to the garage to detail his hair and then sketches some art on his notepad. Organizing photos, he peeks at the window before doing squats and polishing the microwave in garden boots. Liam triumphs over his thoughts, and the following afternoon, the brothers arrive at Heaven's bookstore. Liam lets the window slam on Leo as his mother grins approvingly at Liam's relieved demeanor. While Leo and Nora joke in her study, Liam smirks upon finding Colin's name in his planner, then opts to text Colin's number. Colin giggles and switches off his phone, while a senior with a basketball walks in, and Maria smiles. They arrive at the Department of Fisheries and Wildlife Conservation field, where Maria waves at them from the tennis court as Liam shakes his head in wonder. A large stack of red books is delivered, and Liam passes them to Leo with a broad grin. Later, he passes documents to Nora's studio, chuckling as she enthusiastically writes an email, but his laughter dwindles at the sight of sketches of her and Leo. They all enjoy a brunch at Liam's mother's condo, where he reluctantly sips his drink as Leo giggles and the women nod. At his studio, Liam finds Leo and Nora dancing on the carpet and, feeling bewildered, abandons them and steps out once more. He participates in a rock punk anniversary, sporting a feathered leather hat, attempting to be in a festive spirit. Liam waves the peace sign at Nora and Leo, who mirror him as they smirk. When they embrace, Liam feels confused as Jamie glances at her. Nora presents three shirts for his opinion, and he shakes his head happily as she folds the garment. He nods after them and returns to his chair. Later in the office at dusk, Liam rearranges notebooks on Nora's table and spots her bracelet underneath. After reflecting on her itinerary, he grins and departs. A bicycle parks outside a café, and Liam disembarks. Leo looks amused, and Liam is uncertain. A large green envelope is hidden in the dog's pouch, which holds a sapphire bracelet. She fastens the bracelet around his wrist, and they embrace as Liam watches bemusedly. It's a floral bouquet, and Liam later catches up with Colin in a bookstore, where he seems content. Colin takes his shoulder, and Liam gazes in surprise across the Golden Gate Park landscape before they return to their jogging. There's a discussion at the Old Berlin coffeehouse, where Colin cheers, and Liam, who appears relieved, collects himself. Colin glances down an alley past a stall and up the escalator to Liam's studio."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Jane begins her day by heading to the garage to energize her elbows and then crafts some art on her canvas. Juggling marbles, she peeks at the window before doing cartwheels and polishing the blender in velvet mittens. Jane tangles with her thoughts, and the following day, the sisters arrive at Paradise's grocery store. Jane lets the window slam on Tess as her father gazes approvingly at Jane's joyful expression. While Tess and George giggle in his studio, Jane grimaces upon spotting Kevin's name in her sketchbook, then decides to scribble Kevin's address. Kevin smirks and disconnects, while a teenager with a soccer ball bounds in, and Pedro grimaces. They reach the Department of Museums and Libraries Art Gallery, where Pedro beams at them from the sculpture garden as Jane shakes her head in disbelief. A huge bunch of blue balloons is delivered, and Jane passes them to Tess with a forced grin. Later, she carries sketches to George's studio, beaming as he animatedly chats on the tablet, but her grin fades at the sight of paintings of him and Tess. They all dine at Jane's uncle's house, where she reluctantly munches on snacks as Tess babbles and the others chuckle. At her flat, Jane finds Tess and George napping on the rug and, feeling bewildered, leaves them to it and sets out again. She attends a sci-fi cosplay gala, wearing a neon light-up helmet, trying to get into the festive spirit. Jane flashes the peace sign at George and Tess, who respond similarly as they chuckle. When they embrace, Jane looks appalled as Casey catches her attention. George holds up two hats for her assessment, and he nods tight-lipped as she adjusts the hat. She waves after him and returns to her easel. In the evening at the studio, Jane organizes canvases on George's shelf and discovers his notebook underneath. After reviewing his sketches, she exhales and departs. A bicycle pulls up outside a café, and Jane steps off. Tess looks bewildered, and Jane feels puzzled. A tiny black envelope is tucked in the cat’s collar, which holds a sapphire bracelet. He clasps the bracelet on her wrist, and they hug as Jane watches powerlessly nearby. It's an evening gown, and Jane later meets up with Kevin at a diner, where she looks satisfied with herself. He squeezes her shoulder, and Jane gazes in amazement across the Central Park chess tables before they return to their knitting. There's a gathering at the Old Warsaw market, where Kevin cheers, and Jane, who appears tearful, composes herself. Kevin scans a boulevard past a library and down the corridor to Jane's office."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Marla begins her morning by heading to the greenhouse to adjust her shoes and then completes some puzzles on her tablet. Tossing scarves, she peers at the window before doing handstands and washing the bicycle with cotton mittens. Marla battles with her memories, and the following afternoon, the cousins reach Neptune's art gallery. Marla lets the curtain sway on Violet as her brother gapes disapprovingly at Marla’s relieved demeanor. While Violet and Oscar chat in his kitchen, Marla scowls upon seeing Lenny’s name in her sketchbook, then resolves to write Lenny’s address. Lenny chuckles and closes the laptop, while a teenager with a frisbee exits, and Marco scowls. They reach the Bureau of Transportation Youth League stadium, where Marco beams at them from the soccer pitch as Marla shrugs in confusion. A huge pile of red balloons is dispatched, and Marla passes them to Violet with a forced grin. Later, she carries blueprints to Oscar’s studio, laughing as he eagerly chats on the walkie-talkie, but her mirth diminishes at the sight of sketches of him and Violet. They all dine at Marla’s brother’s apartment, where she regretfully devours her meal as Violet nibbles and the kids laugh. At her loft, Marla discovers Violet and Oscar embracing on the recliner and, feeling disappointed, leaves them be and steps outside once more. She attends a wool and lace anniversary, wearing a shiny velvet bracelet, attempting to be in a festive spirit. Marla waves the jazz peace sign at Oscar and Violet, who reciprocate as they laugh. When they hug, Marla appears shocked as Jordan catches her gaze. Oscar displays two scarves for her consideration, and he gestures approvingly as she knots the scarf. She smiles after him and returns to her counter. In the night at the studio, Marla organizes folders on Oscar’s workstation and locates his backpack beneath. After reviewing his messages, she groans and departs. A carriage pulls up outside a theater, and Marla steps out. Violet looks amazed, and Marla is speechless. A tiny green cube is nestled in the cat’s bow tie, which holds a pearl bracelet. He places the bracelet on her wrist, and they embrace as Marla stands awkwardly nearby. It’s a raincoat, and Marla later reconnects with Lenny in a cafe, where she feels content with herself. He clasps her wrist, and Marla gazes in surprise over the Grand Canyon swimming pool before they return to their meditation. There's a gathering at the Old Lisbon coffeehouse, where Lenny cheers, and Marla, who appears emotional, steadies herself. Lenny peers down a boulevard past a boutique and up the stairs to Marla’s cottage."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jane begins her routine by moisturizing and working on her laptop before doing sit-ups and cleaning. Struggling with emotions, she visits Hell's hardware store with her sister Tess. Jane receives disapproval from her father when she lets the door close on Tess. Tess flirts with George, while Jane calls Kevin, who hangs up. At a baseball field, Pedro grins at them, and Jane rolls her eyes. Jane gives Tess flowers with a forced smile, and later in George's office, she sees pictures of him with Tess which dampens her mood. During dinner at her father's house, Jane unhappily stuffs herself as Tess chatters. Discovering Tess and George kissing at her apartment, Jane leaves distressed. She attends a leather-themed wedding party, donning a spiked collar, and exchanges devil horns with Tess and George. Jane's mood sours as she knots George's tie and finds his wallet on his desk. Later, she exits a taxi at a restaurant where Tess is stunned by a diamond ring engagement. Feeling helpless, Jane stands by. Afterward, she meets Kevin at a bar, feeling pleased. Kevin takes her hand as they return to yoga. At a meeting in New Warsaw bakery, Kevin claps supportively as Jane recovers from her tears, and he gazes toward her building."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Kevin looks down a street past a shop and up the steps to Jane's building There is a meeting at the New Warsaw bakery where Kevin claps and Jane who looks tearful pulls herself together He takes her hand and Jane stares in shock across the Central Park boating lake before they return to their yoga It is a wedding dress and Jane later meets up with Kevin in a bar where she looks pleased with herself He slips the ring on her finger and they kiss as Jane stands helplessly nearby A small white box is tucked in the dog's collar which contains a diamond ring Tess looks stunned and Jane is at a loss A taxi pulls up outside a restaurant and Jane gets out After consulting his appointments she sighs and leaves In the evening at the office Jane tidies away files on George's desk and finds his wallet underneath She smiles after him and heads back to her desk George holds up two ties for her approval and he nods tightlipped as she knots the tie When they kiss Jane looks mortified as Casey catches her eye Jane flicks the heavy metal devil horns at George and Tess who do the same as they grin She attends a leather and bondage wedding wearing a spiked leather collar trying to be in a party mood At her apartment Jane finds Tess and George kissing on the couch and feeling crushed leaves them to it and goes out again They all have dinner at Jane's father's house where she unhappily stuffs her face with food as Tess chatters and the men smile Later she brings paperwork to George's office grinning as he happily talks on the phone but her smile fades at the sight of pictures of him and Tess A large bunch of yellow flowers is delivered and Jane hands them to Tess with a tight smile They arrive at the Department of Parks and Recreation Youth Sports ground where Pedro grins at them from the baseball field as Jane rolls her eyes in disbelief Kevin grins and hangs up while a youngster with a baseball glove enters and Pedro frowns While Tess and George flirt in his office Jane frowns upon seeing Kevin's name in her filofax then decides to dial Kevin's number Jane let us the door close on Tess as her father stares disapprovingly at Jane's agonized expression Jane struggles with her emotions and the next day the sisters arrive at Hell's hardware store Shuffling papers she glances at the door before doing situps and cleaning the cooker in rubber gloves Jane starts her day by going to the bathroom to moisturize her hands and then does some work on her laptop"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "In the evening at the office Jane tidies away files on George's desk and finds his wallet underneath Jane flicks the heavy metal devil horns at George and Tess who do the same as they grin They all have dinner at Jane's father's house where she unhappily stuffs her face with food as Tess chatters and the men smile Kevin looks down a street past a shop and up the steps to Jane's building Tess looks stunned and Jane is at a loss They arrive at the Department of Parks and Recreation Youth Sports ground where Pedro grins at them from the baseball field as Jane rolls her eyes in disbelief Kevin grins and hangs up while a youngster with a baseball glove enters and Pedro frowns At her apartment Jane finds Tess and George kissing on the couch and feeling crushed leaves them to it and goes out again She smiles after him and heads back to her desk It is a wedding dress and Jane later meets up with Kevin in a bar where she looks pleased with herself She attends a leather and bondage wedding wearing a spiked leather collar trying to be in a party mood A taxi pulls up outside a restaurant and Jane gets out Shuffling papers she glances at the door before doing situps and cleaning the cooker in rubber gloves George holds up two ties for her approval and he nods tightlipped as she knots the tie He takes her hand and Jane stares in shock across the Central Park boating lake before they return to their yoga When they kiss Jane looks mortified as Casey catches her eye Jane struggles with her emotions and the next day the sisters arrive at Hell's hardware store After consulting his appointments she sighs and leaves There is a meeting at the New Warsaw bakery where Kevin claps and Jane who looks tearful pulls herself together While Tess and George flirt in his office Jane frowns upon seeing Kevin's name in her filofax then decides to dial Kevin's number He slips the ring on her finger and they kiss as Jane stands helplessly nearby A large bunch of yellow flowers is delivered and Jane hands them to Tess with a tight smile Later she brings paperwork to George's office grinning as he happily talks on the phone but her smile fades at the sight of pictures of him and Tess Jane starts her day by going to the bathroom to moisturize her hands and then does some work on her laptop Jane let us the door close on Tess as her father stares disapprovingly at Jane's agonized expression A small white box is tucked in the dog's collar which contains a diamond ring"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "When they kiss Jane looks mortified as Casey catches her eye George holds up two ties for her approval and he nods tightlipped as she knots the tie She smiles after him and heads back to her desk In the evening at the office Jane tidies away files on George's desk and finds his wallet underneath After consulting his appointments she sighs and leaves A taxi pulls up outside a restaurant and Jane gets out Tess looks stunned and Jane is at a loss A small white box is tucked in the dog's collar which contains a diamond ring He slips the ring on her finger and they kiss as Jane stands helplessly nearby It is a wedding dress and Jane later meets up with Kevin in a bar where she looks pleased with herself He takes her hand and Jane stares in shock across the Central Park boating lake before they return to their yoga There is a meeting at the New Warsaw bakery where Kevin claps and Jane who looks tearful pulls herself together Kevin looks down a street past a shop and up the steps to Jane's building Jane starts her day by going to the bathroom to moisturize her hands and then does some work on her laptop Shuffling papers she glances at the door before doing situps and cleaning the cooker in rubber gloves Jane struggles with her emotions and the next day the sisters arrive at Hell's hardware store Jane let us the door close on Tess as her father stares disapprovingly at Jane's agonized expression While Tess and George flirt in his office Jane frowns upon seeing Kevin's name in her filofax then decides to dial Kevin's number Kevin grins and hangs up while a youngster with a baseball glove enters and Pedro frowns They arrive at the Department of Parks and Recreation Youth Sports ground where Pedro grins at them from the baseball field as Jane rolls her eyes in disbelief A large bunch of yellow flowers is delivered and Jane hands them to Tess with a tight smile Later she brings paperwork to George's office grinning as he happily talks on the phone but her smile fades at the sight of pictures of him and Tess They all have dinner at Jane's father's house where she unhappily stuffs her face with food as Tess chatters and the men smile At her apartment Jane finds Tess and George kissing on the couch and feeling crushed leaves them to it and goes out again She attends a leather and bondage wedding wearing a spiked leather collar trying to be in a party mood Jane flicks the heavy metal devil horns at George and Tess who do the same as they grin"
        }
      ]
    }
  ]
}