{
  "ground_truth": "The elf shakes his head sadly as Santa mooches inside past his less than impressed elf. In the store's vault, Santa uses a heavy drill to bore through the door of a locked safe. Out on the shop floor of the store, the elf walks along towing a small hand cart, while Santa pulls out the drill from the safe door. On the shop floor, his little helper helps himself to an expensive handbag from a display cabinet, then some women's designer shoes, all of which are detailed on a list. He checks his list while eyeing a string of pearls in a cabinet, and uses a bead rack to smash it open. Later, he joins Santa in the vault and finds Santa peering through the hole he drilled. Santa uses a chisel, opens the safe, and wards of notes spill out onto the floor. An oriental woman sits at the wheel of a van as Santa and his little helper climb in the back with their booty. She turns to the elf, puts her foot on the accelerator, and the van speeds off, throwing Santa and the elf backwards. Later, Santa, who in less seasonal times goes by the name of Willie, dances with Marcus, the elf, in a bar. Willie puts down Marcus on a bar stool by the counter and sits down beside him. He calls over to the barmaid, who serves them. Willie and Marcus raise their glasses, down their drinks, and set the glasses back down on the counter. Marcus gives Willie a dubious look and looks expectantly at him, who considers and then turns to the barmaid. He turns back to Marcus with a half smile and looks down doubtfully at his empty glass. A plethora of beautiful bikini-clad women adorn the sand as Willie, now in a Hawaiian shirt, stands behind the counter of a beachfront bar, chopping up some lemons and limes. He puts them under the counter and pours a generous measure of vodka into a tumbler. As he does so, an irate man clutching a tray of glasses joins him behind the counter. Willie slurps at the drink, and the barman punches him in the guts and tosses him over the counter. Willie throws a vodka bottle at the barman and misses it. The barman leaps over the counter, and Willie runs for it. Willie does as suggested. Sometime later, he's sitting alone having a good leech at some more bikini-clad lovelies playing volleyball. He licks his lips as he admires their well-toned backsides and sips from a bottle of beer. The next morning, Willie is asleep on his bed in a not-so-awful, not-so-great apartment. He reaches over to the clock radio, which is surrounded by last night's empties, and fumbles for the off button; unable to find it, he rips it out of its socket.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The sprite nods his cranium dolefully as Santa trudges inside past his less than delighted elf. In the store's vault, Santa employs a weighty drill to pierce through the portal of a secured safe. Out on the shop floor of the store, the elf ambles along hauling a diminutive hand cart, while Santa extracts the drill from the safe portal. On the shop floor, his little assistant assists himself to an extravagant handbag from a showcase cabinet, then some women's fashionable footwear, all of which are outlined on a list. He reviews his list while scrutinizing a strand of pearls in a cabinet, and uses a bead rack to fracture it open. Later, he joins Santa in the vault and finds Santa gazing through the aperture he drilled. Santa utilizes a chisel, opens the safe, and bundles of notes spill out onto the floor. An Asian woman perches at the wheel of a van as Santa and his little assistant clamber in the rear with their haul. She turns to the elf, places her foot on the accelerator, and the van accelerates off, flinging Santa and the elf rearwards. Later, Santa, who in less seasonal times goes by the appellation of Willie, cavorts with Marcus, the elf, in a bar. Willie positions Marcus on a bar stool by the counter and reclines beside him. He calls over to the barmaid, who serves them. Willie and Marcus elevate their glasses, drain their beverages, and place the glasses back down on the counter. Marcus grants Willie a suspicious glance and gazes expectantly at him, who deliberates and then turns to the barmaid. He turns back to Marcus with a partial smile and glances down skeptically at his vacant glass. A multitude of stunning bikini-clad women decorate the sand as Willie, now in a Hawaiian shirt, stands behind the counter of a beachfront bar, slicing up some lemons and limes. He places them under the counter and pours a liberal measure of vodka into a tumbler. As he does so, a furious man gripping a tray of glasses joins him behind the counter. Willie sips at the beverage, and the barman punches him in the stomach and hurls him over the counter. Willie flings a vodka bottle at the barman and misses it. The barman vaults over the counter, and Willie dashes for it. Willie does as advised. Sometime later, he's sitting alone having a good gaze at some more bikini-clad beauties playing volleyball. He moistens his lips as he admires their well-toned rears and sips from a bottle of beer. The next morning, Willie is asleep on his bed in a not-so-terrible, not-so-wonderful apartment. He reaches over to the clock radio, which is surrounded by last night's empties, and fumbles for the off button; unable to locate it, he rips it out of its socket."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The elf's head is shaken sadly as Santa is mooched inside past by his less than impressed elf. In the store's vault, a heavy drill is used by Santa to bore through the door of a locked safe. Out on the shop floor of the store, a small hand cart is towed along by the elf, while the drill is pulled out from the safe door by Santa. On the shop floor, an expensive handbag is helped himself to from a display cabinet by his little helper, then some women's designer shoes, all of which are noted on a list. A string of pearls is eyed in a cabinet by him, he checks his list, and a bead rack is used to smash it open. Later, Santa is joined by him in the vault and Santa is found peering through the hole he drilled. A chisel is used by Santa to open the safe, and notes spill out onto the floor. An oriental woman, who sits at the wheel of a van, turns to the elf as their booty is climbed in the back by Santa and his little helper. Her foot is put on the accelerator, and off speeds the van, throwing Santa and the elf backwards. Later, a bar is danced in by Willie, who Santa goes by in less seasonal times, with Marcus, the elf. Marcus is put down by Willie on a bar stool by the counter and sits down beside him. The barmaid is called over by him, who serves them. Their glasses are raised, drinks are downed, and the glasses are set back down on the counter by Willie and Marcus. A dubious look is given by Marcus to Willie and, with expectation, looks at him, who considers and then the barmaid is turned to by him. Marcus is turned back to with a half-smile and his empty glass is looked at doubtfully by him. The sand is adorned by a plethora of beautiful bikini-clad women as Willie, now in a Hawaiian shirt, is stood behind the counter of a beachfront bar, chopping up some lemons and limes. They are put under the counter by him and a generous measure of vodka is poured into a tumbler. As this is being done, behind the counter joins him an irate man clutching a tray of glasses. The drink is slurped at by Willie, and the barman punches him in the guts and tosses him over the counter. A vodka bottle is thrown by Willie at the barman and it is missed. Over the counter leaps the barman, and for it Willie runs. As suggested, the action is done by Willie. Sometime later, a good leech is being had by him, sitting alone, at some more bikini-clad lovelies playing volleyball. His lips are licked by him as their well-toned backsides are admired and a sip is taken from a bottle of beer. The next morning, in a not-so-awful, not-so-great apartment, his bed is occupied by a sleeping Willie. He reaches over to the clock radio, which last night's empties surround, and the off button is fumbled for; the socket is ripped out by him, unable to find it."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The elf sadly shakes his head as Santa strolls past, unimpressed. In the vault, Santa uses a heavy drill on a locked safe. On the shop floor, the elf pulls a hand cart while Santa removes the drill. The elf grabs an expensive handbag and designer shoes, checking them off a list. He eyes pearls in a cabinet, smashes it with a bead rack, and later joins Santa, who peers into the drilled hole. Santa chisels open the safe, spilling banknotes. A woman waits in a van; Santa and the elf jump in with their loot. She hits the gas, sending them flying backward. Later, Santa—Willie—and Marcus, the elf, dance at a bar. Willie sets Marcus on a stool, calls the barmaid, and they down their drinks. Marcus gives Willie a look, prompting Willie to glance at his empty glass with doubt. On a sunny beach, Willie, in a Hawaiian shirt, works at a bar chopping fruit, then pours vodka into a tumbler. An angry man with a tray storms in, punches Willie, and throws him over the counter. Willie throws a vodka bottle but misses; the barman leaps the counter, and Willie flees. Later, Willie watches bikini-clad women play volleyball, admiring them as he sips beer. The next morning, he wakes up in a shabby apartment, surrounded by empties, and yanks the radio from the socket after failing to turn it off."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The elf shakes his head as Santa mooches past him. In the vault, Santa uses a drill on a safe door. On the shop floor, the elf tows a cart while Santa removes the drill. The elf takes an expensive handbag and shoes, checks his list, and smashes a cabinet for pearls. He joins Santa, who chisels open the safe, spilling notes. An oriental woman drives a van as Santa and the elf climb in with their loot. She accelerates, throwing them backward. Later, Santa, known as Willie, dances with Marcus, the elf, in a bar. Willie orders drinks, and they toast. Marcus looks at Willie, who turns to the barmaid, then back at Marcus, eyeing his empty glass. On a beach, Willie, in a Hawaiian shirt, chops lemons and pours vodka. An angry man joins him, punches him, and throws him over the counter. Willie throws a vodka bottle, misses, and runs. Later, he watches bikini-clad women play volleyball, sipping beer. The next morning, Willie, in a messy apartment, struggles with his clock radio and rips it out of the socket."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The elf, with a look of disappointment etched across his face, shakes his head sadly as Santa, appearing somewhat dejected, mooches inside, walking past his less-than-impressed elf companion. Inside the store's secure vault, Santa employs a heavy-duty drill to bore through the formidable door of a locked safe. Meanwhile, out on the bustling shop floor of the store, the elf ambles along, towing a small hand cart behind him, while Santa, having completed his task, pulls the drill out from the safe door. On the shop floor, this little helper takes the opportunity to help himself to an expensive handbag from a display cabinet, followed by some women's designer shoes, all of which are meticulously detailed on a list he carries. He checks his list carefully while casting an eye on a string of pearls nestled in a cabinet, and then uses a bead rack to smash it open with precision. Later on, he joins Santa in the vault and finds him peering intently through the hole he has drilled. Santa then uses a chisel to open the safe, and a cascade of banknotes spills out onto the floor in a chaotic flurry. An oriental woman, sitting at the wheel of a van, waits as Santa and his little helper climb into the back with their ill-gotten booty. She turns to the elf, puts her foot firmly on the accelerator, and the van speeds off with a sudden burst, throwing Santa and the elf backwards with the force. Later, Santa, who in less festive times is known by the name of Willie, is seen dancing with Marcus, the elf, in a lively bar. Willie gently places Marcus down on a bar stool by the counter and then sits down beside him. He calls over to the barmaid, who promptly serves them their drinks. Willie and Marcus raise their glasses in a toast, down their drinks in one swift motion, and set the glasses back down on the counter with a clink. Marcus gives Willie a dubious look, filled with skepticism, and looks expectantly at him, who considers for a moment and then turns to the barmaid once more. He turns back to Marcus with a half-hearted smile and looks down doubtfully at his now-empty glass. A plethora of beautiful, bikini-clad women adorn the sandy beach as Willie, now dressed in a colorful Hawaiian shirt, stands behind the counter of a beachfront bar, diligently chopping up some fresh lemons and limes. He places them under the counter and pours a generous measure of vodka into a waiting tumbler. As he does so, an irate man, clutching a tray of glasses, joins him behind the counter with a scowl. Willie slurps at the drink, savoring it, and the barman, in a fit of anger, punches him in the guts and tosses him over the counter with surprising strength. Willie retaliates by throwing a vodka bottle at the barman, but misses his target. The barman, undeterred, leaps over the counter, and Willie, sensing danger, runs for it as fast as he can. Willie does as suggested, making a hasty retreat. Sometime later, he's sitting alone, indulging in a good leech at some more bikini-clad lovelies playing volleyball nearby. He licks his lips as he admires their well-toned backsides and takes a sip from a bottle of beer, enjoying the view. The next morning, Willie is found asleep on his bed in a not-so-awful, yet not-so-great apartment. He reaches over to the clock radio, which is surrounded by the empties from last night's escapades, and fumbles for the off button; unable to find it in his groggy state, he resorts to ripping it out of its socket in frustration."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The elf, with a visible look of disappointment deeply etched across his face, shakes his head in a sorrowful manner as Santa, appearing somewhat dejected and downcast, mooches inside, walking past his less-than-impressed elf companion. Once inside the secure vault of the store, Santa employs a heavy-duty drill to bore through the formidable and robust door of a locked safe. Meanwhile, out on the bustling and busy shop floor of the store, the elf ambles along leisurely, towing a small hand cart behind him. At the same time, Santa, having successfully completed his task, pulls the drill out from the safe door with determination. On the shop floor, this little helper seizes the opportunity to help himself to an expensive handbag, carefully selecting it from a display cabinet, followed by some women's designer shoes, all of which are meticulously detailed on a list he carries with him. He checks his list carefully while casting an eye on a string of pearls nestled beautifully in a cabinet, and then, with precision, uses a bead rack to smash it open. Later on, he joins Santa in the vault and finds him peering intently through the hole he has drilled in the safe. Santa then uses a chisel to open the safe, and, in a chaotic flurry, a cascade of banknotes spills out onto the floor. An oriental woman, sitting patiently at the wheel of a van, waits as Santa and his little helper climb into the back with their ill-gotten booty. She then turns to the elf, puts her foot firmly and decisively on the accelerator, and the van speeds off with a sudden burst, throwing Santa and the elf backwards from the force. Later on, Santa, who in less festive times is known by the name of Willie, is seen dancing energetically with Marcus, the elf, in a lively and bustling bar. Willie gently places Marcus down onto a bar stool by the counter and then sits down beside him. He calls over to the barmaid, who promptly serves them their drinks with efficiency. Willie and Marcus raise their glasses in a jubilant toast, down their drinks in one swift motion, and set the glasses back down on the counter with a satisfying clink. Marcus gives Willie a dubious look, filled with skepticism, and looks expectantly at him. Willie considers for a moment, then turns to the barmaid once more. He turns back to Marcus with a half-hearted smile and looks down doubtfully at his now-empty glass. A plethora of beautiful, bikini-clad women adorn the sandy beach as Willie, now dressed in a vibrant and colorful Hawaiian shirt, stands behind the counter of a beachfront bar, diligently chopping up some fresh lemons and limes. He places them carefully under the counter and pours a generous measure of vodka into a waiting tumbler. As he does so, an irate man, clutching a tray of glasses, joins him behind the counter with a scowl. Willie slurps at the drink, savoring each moment, and the barman, in a fit of anger, punches him in the guts and tosses him over the counter with surprising strength and power. Willie retaliates by throwing a vodka bottle at the barman, but, unfortunately, misses his target. The barman, undeterred and not discouraged, leaps over the counter, and Willie, sensing danger, runs for it as fast as he can. Willie does as suggested, making a hasty and immediate retreat. Sometime later, he's sitting alone, indulging in a good lech at some more bikini-clad lovelies playing volleyball nearby. He licks his lips as he admires their well-toned backsides and takes a sip from a bottle of beer, thoroughly enjoying the view. The next morning, Willie is found asleep on his bed in a not-so-awful, yet not-so-great apartment. He reaches over to the clock radio, which is surrounded by the empties from last night's escapades, and fumbles for the off button. Unable to find it in his groggy state, he resorts to ripping it out of its socket in frustration."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The elf, with a look of disappointment etched on his face, slowly shakes his head as Santa, with a nonchalant demeanor, saunters inside, passing by the unimpressed elf. Inside the store's vault, Santa hefts a heavy drill, positioning it carefully against the door of a locked safe, and begins to bore through it with determined precision. Meanwhile, out on the shop floor, the elf ambles along, pulling a small hand cart behind him, while Santa, having completed his task, extracts the drill from the now-perforated safe door. On the shop floor, the elf, with a keen eye for luxury, helps himself to an expensive handbag from a display cabinet, followed by a selection of women's designer shoes, each item meticulously checked off against a detailed list he holds. As he scrutinizes the list, his gaze falls upon a string of pearls nestled within a cabinet, prompting him to seize a bead rack and smash the cabinet open with a swift, decisive motion. Later, he makes his way back to the vault, joining Santa, who is intently peering through the hole he drilled. Santa, with a chisel in hand, expertly opens the safe, causing a cascade of banknotes to spill out onto the floor. Outside, an oriental woman sits poised at the wheel of a van, waiting as Santa and his little helper clamber into the back, their arms laden with their ill-gotten gains. She turns to the elf, her foot pressing down on the accelerator, causing the van to lurch forward with a burst of speed, sending Santa and the elf tumbling backward. In a later scene, Santa, known in less festive times as Willie, finds himself in a bar, dancing with Marcus, the elf. Willie gently places Marcus onto a bar stool by the counter and settles down beside him. He calls out to the barmaid, who promptly serves them their drinks. Together, Willie and Marcus raise their glasses, swiftly down their drinks, and place the empty glasses back on the counter. Marcus casts a dubious glance at Willie, his expression expectant, as Willie contemplates for a moment before turning to the barmaid. He turns back to Marcus with a half-smile, his eyes drifting down to his empty glass with a hint of doubt. The scene shifts to a sun-drenched beach, where a multitude of beautiful, bikini-clad women grace the sand. Willie, now clad in a Hawaiian shirt, stands behind the counter of a beachfront bar, methodically chopping lemons and limes. He places them under the counter and pours a generous measure of vodka into a tumbler. As he indulges in a sip, an irate man, clutching a tray of glasses, joins him behind the counter. Willie slurps at his drink, only to be met with a punch to the gut from the barman, who then tosses him over the counter. In retaliation, Willie hurls a vodka bottle at the barman, missing his target. The barman vaults over the counter, prompting Willie to make a hasty retreat. Following this suggestion, Willie finds himself sitting alone, his eyes lingering on more bikini-clad women engaged in a game of volleyball. He licks his lips appreciatively as he admires their well-toned figures, taking a sip from a bottle of beer. The next morning, Willie lies asleep on his bed in an apartment that is neither luxurious nor shabby. He reaches over to silence the blaring clock radio, surrounded by the remnants of last night's indulgence, and fumbles for the off button. Frustrated by his inability to locate it, he resorts to ripping the clock radio out of its socket."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The elf shakes his head sadly as Santa mooches inside, unimpressing his helper. In the store's vault, Santa uses a heavy drill to bore through a locked safe door. Meanwhile, on the shop floor, the elf tows a hand cart, helping himself to expensive items like a handbag and designer shoes, all detailed on his list. He checks his list, eyes a string of pearls, and uses a bead rack to smash open the cabinet. Later, he joins Santa in the vault, where Santa peers through the drilled hole, uses a chisel to open the safe, and money spills out. An oriental woman waits in a van as Santa and the elf climb in with their loot. She accelerates, causing them to be thrown backward as the van speeds off. Later, Santa, known as Willie, dances with Marcus, the elf, in a bar. Willie places Marcus on a bar stool, sits beside him, and calls the barmaid, who serves them. They raise their glasses, drink, and set them down. Marcus gives Willie a dubious look, prompting Willie to consider and then turn to the barmaid, before looking doubtfully at his empty glass. On a beach, Willie, now in a Hawaiian shirt, works behind a bar, chopping lemons and limes, and pouring vodka. An irate man joins him, punches him, and tosses him over the counter after Willie slurps the drink. Willie throws a vodka bottle, misses, and runs as the barman leaps over the counter. Later, Willie sits alone, admiring bikini-clad women playing volleyball, sipping beer. The next morning, Willie wakes in his apartment, surrounded by empty bottles, and rips out the clock radio when he can't find the off button."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The elf, a diminutive figure with a decades-long history of working behind the scenes in this peculiar operation, shakes his head sadly as Santa, known to be less than jolly outside his seasonal duties, mooches inside past his less than impressed elf. In the store's vault, reminiscent of high-security bank vaults designed to safeguard treasures, Santa uses a heavy drill, a tool favored by burglars for its ability to penetrate metal, to bore through the door of a locked safe. Out on the shop floor of the luxury boutique store, the elf walks along towing a small hand cart, a piece of equipment often used in logistics to easily move merchandise, while Santa pulls out the drill from the safe door. On the shop floor, his little helper, who often finds the finer things in life enticing, helps himself to an expensive handbag from a display cabinet, then some women's designer shoes, all of which are detailed on a list that resembles a meticulously planned heist list. He checks his list while eyeing a string of pearls, a classic symbol of elegance and wealth, in a cabinet, and uses a bead rack to expertly smash it open. Later, he joins Santa in the vault and finds Santa peering through the hole he drilled, much like a prospector eager to strike gold. Santa uses a chisel, opens the safe, and wards of notes spill out onto the floor, reminiscent of a jackpot hitting in a casino. An oriental woman, a skilled getaway driver possibly with a history in stunt driving, sits at the wheel of a van as Santa and his little helper climb in the back with their booty. She turns to the elf with a knowing glance, puts her foot on the accelerator, and the van speeds off, a maneuver common in heist movies, throwing Santa and the elf backwards. Later, Santa, who in less seasonal times goes by the name of Willie, dances with Marcus, the elf who has been his partner in crime for years, in a bar. Willie puts down Marcus on a bar stool by the counter and sits down beside him. He calls over to the barmaid, a familiar presence who often turns a blind eye to their antics, who serves them. Willie and Marcus raise their glasses, down their drinks as if celebrating a successful score, and set the glasses back down on the counter. Marcus gives Willie a dubious look and looks expectantly at him, who considers and then turns to the barmaid with a grin. He turns back to Marcus with a half smile and looks down doubtfully at his empty glass. A plethora of beautiful bikini-clad women, reminiscent of a postcard from a paradise island, adorn the sand as Willie, now in a Hawaiian shirt that screams tourist, stands behind the counter of a beachfront bar, chopping up some lemons and limes. He puts them under the counter and pours a generous measure of vodka, a staple for those seeking liquid courage or escape, into a tumbler. As he does so, an irate man with an air of authority, clutching a tray of glasses like a bartender ready for action, joins him behind the counter. Willie slurps at the drink as if savoring a newfound treasure, and the barman punches him in the guts and tosses him over the counter, displaying a brawny strength often seen in barroom brawls. Willie throws a vodka bottle at the barman and misses it, a move that seems almost intentionally reckless. The barman leaps over the counter, and Willie runs for it, exhibiting a fleetness of foot that might suggest a past life of evading pursuers. Willie does as suggested, perhaps following instincts honed over years of escapades. Sometime later, he's sitting alone having a good leech at some more bikini-clad lovelies playing volleyball, a sport that epitomizes beach culture. He licks his lips as he admires their well-toned backsides and sips from a bottle of beer, perhaps reminiscing about past conquests or dreaming of new ones. The next morning, Willie is asleep on his bed in a not-so-awful, not-so-great apartment, a far cry from the luxurious settings he often finds himself coveting. He reaches over to the clock radio, a classic model known for its reliability despite its age, which is surrounded by last night's empties, and fumbles for the off button; unable to find it, he rips it out of its socket, displaying a frustration that suggests this is far from the first time."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The elf shakes his head sadly as Santa mooches inside past his less than impressed elf  In the store's vault Santa uses a heavy drill to bore through the door of a locked safe  Out on the shop floor of the store the elf walks along towing a small hand cart while Santa pulls out the drill from the safe door  Willie puts down Marcus on a bar stool by the counter and sits down beside him  He calls over to the barmaid who serves them  Willie and Marcus raise their glasses down their drinks and set the glasses back down on the counter  Marcus gives Willie a dubious look and looks expectantly at him who considers and then turns to the barmaid  He turns back to Marcus with a half smile and looks down doubtfully at his empty glass  A plethora of beautiful bikiniclad women adorn the sand as Willie now in a Hawaiian shirt stands behind the counter of a beachfront bar chopping up some lemons and limes  He puts them under the counter and pours a generous measure of vodka into a tumbler  As he does so an irate man clutching a tray of glasses joins him behind the counter  Willie slurps at the drink and the barman punches him in the guts and tosses him over the counter  Willie throws a vodka bottle at the barman and misses it  The barman leaps over the counter and Willie runs for it  Willie does as suggested  Sometime later he's sitting alone having a good leech at some more bikiniclad lovelies playing volleyball  He licks his lips as he admires their welltoned backsides and sips from a bottle of beer  On the shop floor his little helper helps himself to an expensive handbag from a display cabinet then some women's designer shoes all of which are detailed on a list  He checks his list while eyeing a string of pearls in a cabinet and uses a bead rack to smash it open  Later he joins Santa in the vault and finds Santa peering through the hole he drilled  Santa uses a chisel opens the safe and wards of notes spill out onto the floor  An oriental woman sits at the wheel of a van as Santa and his little helper climb in the back with their booty  She turns to the elf puts her foot on the accelerator and the van speeds off throwing Santa and the elf backwards  Later Santa who in less seasonal times goes by the name of Willie dances with Marcus the elf in a bar  Willie puts down Marcus on a bar stool by the counter and sits down beside him  He calls over to the barmaid who serves them  Willie and Marcus raise their glasses down their drinks and set the glasses back down on the counter  Marcus gives Willie a dubious look and looks expectantly at him who considers and then turns to the barmaid  He turns back to Marcus with a half smile and looks down doubtfully at his empty glass  A plethora of beautiful bikiniclad women adorn the sand as Willie now in a Hawaiian shirt stands behind the counter of a beachfront bar chopping up some lemons and limes  He puts them under the counter and pours a generous measure of vodka into a tumbler  As he does so an irate man clutching a tray of glasses joins him behind the counter  Willie slurps at the drink and the barman punches him in the guts and tosses him over the counter  Willie throws a vodka bottle at the barman and misses it  The barman leaps over the counter and Willie runs for it  Willie does as suggested  Sometime later he's sitting alone having a good leech at some more bikiniclad lovelies playing volleyball  He licks his lips as he admires their welltoned backsides and sips from a bottle of beer  The next morning Willie is asleep on his bed in a notsoawful notsogreat apartment  He reaches over to the clock radio which is surrounded by last night's empties and fumbles for the off button  unable to find it  he rips it out of its socket"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The elf shakes his head sadly as Santa mooches inside past his less than impressed elf. In the store's vault Santa uses a heavy drill to bore through the door of a locked safe. Out on the shop floor of the store the elf walks along towing a small hand cart while Santa pulls out the drill from the safe door. On the shop floor his little helper helps himself to an expensive handbag from a display cabinet then some women's designer shoes all of which are detailed on a list. He checks his list while eyeing a string of pearls in a cabinet and uses a bead rack to smash it open. Later he joins Santa in the vault and finds Santa peering through the hole he drilled. Santa uses a chisel opens the safe and wards of notes spill out onto the floor. An oriental woman sits at the wheel of a van as Santa and his little helper climb in the back with their booty. She turns to the elf puts her foot on the accelerator and the van speeds off throwing Santa and the elf backwards. Later Santa who in less seasonal times goes by the name of Willie dances with Marcus the elf in a bar. Willie puts down Marcus on a bar stool by the counter and sits down beside him. He calls over to the barmaid who serves them. Willie and Marcus raise their glasses down their drinks and set the glasses back down on the counter. Marcus gives Willie a dubious look and looks expectantly at him who considers and then turns to the barmaid. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. He turns back to Marcus with a half smile and looks down doubtfully at his empty glass. A plethora of beautiful bikiniclad women adorn the sand as Willie now in a Hawaiian shirt stands behind the counter of a beachfront bar chopping up some lemons and limes. He puts them under the counter and pours a generous measure of vodka into a tumbler. As he does so an irate man clutching a tray of glasses joins him behind the counter. Willie slurps at the drink and the barman punches him in the guts and tosses him over the counter. Willie throws a vodka bottle at the barman and misses it. The barman leaps over the counter and Willie runs for it. Willie does as suggested. Sometime later he is sitting alone having a good leech at some more bikiniclad lovelies playing volleyball. He licks his lips as he admires their welltoned backsides and sips from a bottle of beer. The next morning Willie is asleep on his bed in a notsoawful notsogreat apartment. He reaches over to the clock radio which is surrounded by last night's empties and fumbles for the off button. unable to find it. he rips it out of its socket."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The elf shakes his head sadly as Santa mooches inside past his less than impressed elf. In the store's vault Santa uses a heavy drill to bore through the door of a locked safe. Out on the shop floor of the store the elf walks along towing a small hand cart while Santa pulls out the drill from the safe door. On the shop floor his little helper helps himself to an expensive handbag from a display cabinet then some women's designer shoes all of which are detailed on a list. He checks his list while eyeing a string of pearls in a cabinet and uses a bead rack to smash it open. Later he joins Santa in the vault and finds Santa peering through the hole he drilled. Santa uses a chisel opens the safe and wards of notes spill out onto the floor. An oriental woman sits at the wheel of a van as Santa and his little helper climb in the back with their booty. She turns to the elf puts her foot on the accelerator and the van speeds off throwing Santa and the elf backwards. Later Santa who in less seasonal times goes by the name of Willie dances with Marcus the elf in a bar. Willie puts down Marcus on a bar stool by the counter and sits down beside him. He calls over to the barmaid who serves them. Willie and Marcus raise their glasses down their drinks and set the glasses back down on the counter. Marcus gives Willie a dubious look and looks expectantly at him who considers and then turns to the barmaid. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. He turns back to Marcus with a half smile and looks down doubtfully at his empty glass. A plethora of beautiful bikiniclad women adorn the sand as Willie now in a Hawaiian shirt stands behind the counter of a beachfront bar chopping up some lemons and limes. He puts them under the counter and pours a generous measure of vodka into a tumbler. As he does so an irate man clutching a tray of glasses joins him behind the counter. Willie slurps at the drink and the barman punches him in the guts and tosses him over the counter. Willie throws a vodka bottle at the barman and misses it. The barman leaps over the counter and Willie runs for it. Willie does as suggested. Sometime later he is sitting alone having a good leech at some more bikiniclad lovelies playing volleyball. He licks his lips as he admires their welltoned backsides and sips from a bottle of beer. The next morning Willie is asleep on his bed in a notsoawful notsogreat apartment. He reaches over to the clock radio which is surrounded by last night's empties and fumbles for the off button. unable to find it. he rips it out of its socket."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The elf shakes his head sadly as Santa mooches inside past his less than impressed elf. In the store's vault Santa uses a heavy drill to bore through the door of a locked safe. Out on the shop floor of the store the elf walks along towing a small hand cart while Santa pulls out the drill from the safe door. On the shop floor his little helper helps himself to an expensive handbag from a display cabinet then some women's designer shoes all of which are detailed on a list. He checks his list while eyeing a string of pearls in a cabinet and uses a bead rack to smash it open. Later he joins Santa in the vault and finds Santa peering through the hole he drilled. Santa uses a chisel opens the safe and wards of notes spill out onto the floor. Willie does as suggested. Sometime later he is sitting alone having a good leech at some more bikiniclad lovelies playing volleyball. He licks his lips as he admires their welltoned backsides and sips from a bottle of beer. The next morning Willie is asleep on his bed in a notsoawful notsogreat apartment. He reaches over to the clock radio which is surrounded by last night's empties and fumbles for the off button. unable to find it. he rips it out of its socket."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The elf shakes his head sadly as Santa mooches inside past his less than impressed elf. In the store's vault Santa uses a heavy drill to bore through the door of a locked safe. Out on the shop floor of the store the elf walks along towing a small hand cart while Santa pulls out the drill from the safe door. He reaches over to the clock radio which is surrounded by last night's empties and fumbles for the off button. unable to find it. he rips it out of its socket."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The squirrel shakes its head sadly as the reindeer mooches inside past its less than impressed squirrel. In the store's vault, the reindeer uses a heavy drill to bore through the door of a locked safe. Out on the shop floor of the store, the squirrel walks along towing a small hand cart, while the reindeer pulls out the drill from the safe door. On the shop floor, its little helper helps itself to an expensive handbag from a display cabinet, then some women's designer shoes, all of which are detailed on a list. It checks its list while eyeing a string of pearls in a cabinet, and uses a bead rack to smash it open. Later, it joins the reindeer in the vault and finds the reindeer peering through the hole it drilled. The reindeer uses a chisel, opens the safe, and wards of notes spill out onto the floor. A koala sits at the wheel of a van as the reindeer and its little helper climb in the back with their booty. The koala turns to the squirrel, puts its foot on the accelerator, and the van speeds off, throwing the reindeer and the squirrel backwards. Later, the reindeer, who in less seasonal times goes by the name of Murphy, dances with Gregory, the squirrel, in a bar. Murphy puts down Gregory on a bar stool by the counter and sits down beside it. Murphy calls over to the waitress, who serves them. Murphy and Gregory raise their glasses, down their drinks, and set the glasses back down on the counter. Gregory gives Murphy a dubious look and looks expectantly at it, who considers and then turns to the waitress. Murphy turns back to Gregory with a half smile and looks down doubtfully at its empty glass. A plethora of beautiful bikini-clad cats adorn the sand as Murphy, now in a Hawaiian shirt, stands behind the counter of a beachfront bar, chopping up some lemons and limes. Murphy puts them under the counter and pours a generous measure of vodka into a tumbler. As it does so, an irate rabbit clutching a tray of glasses joins it behind the counter. Murphy slurps at the drink, and the rabbit punches it in the guts and tosses it over the counter. Murphy throws a vodka bottle at the rabbit and misses it. The rabbit leaps over the counter, and Murphy runs for it. Murphy does as suggested. Sometime later, it's sitting alone having a good leech at some more bikini-clad lovelies playing volleyball. It licks its lips as it admires their well-toned backsides and sips from a bottle of beer. The next morning, Murphy is asleep on its bed in a not-so-awful, not-so-great apartment. It reaches over to the clock radio, which is surrounded by last night's empties, and fumbles for the off button; unable to find it, it rips it out of its socket."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The elf shakes his head sadly as Santa mooches inside past his less than impressed elf. In the gallery's exhibit, Santa uses a heavy wrench to bore through the door of a locked cabinet. Out on the showroom floor of the gallery, the elf walks along towing a small dolly, while Santa pulls out the wrench from the cabinet door. On the showroom floor, his little helper helps himself to an expensive sculpture from a display pedestal, then some men's designer hats, all of which are detailed on a list. He checks his list while eyeing a string of watches in a pedestal, and uses a hammer rack to smash it open. Later, he joins Santa in the exhibit and finds Santa peering through the hole he drilled. Santa uses a screwdriver, opens the cabinet, and stacks of paintings spill out onto the floor. An oriental woman sits at the wheel of a sedan as Santa and his little helper climb in the back with their booty. She turns to the elf, puts her foot on the accelerator, and the sedan speeds off, throwing Santa and the elf backwards. Later, Santa, who in less seasonal times goes by the name of Willie, dances with Marcus, the elf, in a café. Willie puts down Marcus on a café chair by the counter and sits down beside him. He calls over to the waitress, who serves them. Willie and Marcus raise their mugs, down their drinks, and set the mugs back down on the counter. Marcus gives Willie a dubious look and looks expectantly at him, who considers and then turns to the waitress. He turns back to Marcus with a half smile and looks down doubtfully at his empty mug. A plethora of beautiful bikini-clad women adorn the poolside as Willie, now in a Hawaiian shirt, stands behind the counter of a poolside bar, chopping up some carrots and cucumbers. He puts them under the counter and pours a generous measure of tequila into a glass. As he does so, an irate man clutching a stack of plates joins him behind the counter. Willie slurps at the drink, and the chef punches him in the guts and tosses him over the counter. Willie throws a tequila bottle at the chef and misses it. The chef leaps over the counter, and Willie runs for it. Willie does as suggested. Sometime later, he's sitting alone having a good leech at some more bikini-clad lovelies playing badminton. He licks his lips as he admires their well-toned backsides and sips from a bottle of soda. The next morning, Willie is asleep on his couch in a not-so-awful, not-so-great loft. He reaches over to the alarm clock, which is surrounded by last night's empties, and fumbles for the off button; unable to find it, he rips it out of its socket."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The elf nods his head happily as Santa skips inside past his more than impressed elf. In the store's vault, Santa uses a feather duster to tickle the door of a locked safe. Out on the shop floor of the store, the elf dances along pushing a small skateboard, while Santa extracts the duster from the safe door. On the shop floor, his little helper hands himself an expensive handbag from a display cabinet, then some women's designer shoes, all of which are ignored on a list. He ignores his list while dreaming of a string of pearls in a cabinet, and uses a bead rack to gently tap it open. Later, he loses Santa in the vault and finds Santa gazing through the hole he tickled. Santa uses a feather, closes the safe, and stacks of notes organize themselves neatly onto the floor. An oriental woman stands at the wheel of a van as Santa and his little helper jump in the back with their treasures. She shakes hands with the elf, puts her foot lightly on the brake, and the van drifts off, nudging Santa and the elf gently forwards. Later, Santa, who in less seasonal times goes by the name of Willie, leaps with Marcus, the elf, in a bar. Willie lifts up Marcus on a bar stool by the counter and stands up beside him. He sings over to the barmaid, who ignores them. Willie and Marcus lower their glasses, spill their drinks, and set the glasses back down on the counter. Marcus gives Willie a confident look and looks uninterestedly at him, who calculates and then turns to the barmaid. He turns back to Marcus with a full smile and looks up proudly at his empty glass. A plethora of beautiful bikini-clad women relax on the sand as Willie, now in a Hawaiian shirt, sits at a table of a beachfront bar, squeezing some lemons and limes. He throws them over the counter and drinks a meager measure of vodka into a tumbler. As he does so, a cheerful man holding a tray of glasses joins him behind the counter. Willie sniffs at the drink, and the barman pats him on the shoulder and hugs him over the counter. Willie drops a vodka bottle at the barman and misses him. The barman slides under the counter, and Willie strolls for it. Willie does as suggested. Sometime later, he's standing alone admiring a good stash of more bikini-clad lovelies playing volleyball. He whistles as he admires their well-toned backsides and guzzles from a bottle of beer. The next morning, Willie is jogging on his bed in a not-so-awful, not-so-great apartment. He stretches over to the clock radio, which is surrounded by last night's empties, and searches for the off button; unable to find it, he delicately disconnects it from its socket."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The toaster shakes its head sadly as the scarecrow mooches inside past its less than impressed toaster. In the cave's vault, the scarecrow uses a heavy anchor to bore through the door of a locked aquarium. Out on the meadow floor of the cave, the toaster walks along towing a small satellite dish, while the scarecrow pulls out the anchor from the aquarium door. On the meadow floor, its tiny sidekick helps itself to an expensive trampoline from a display cabinet, then some men's designer socks, all of which are detailed on a map. It checks its map while eyeing a basket of apples in a cabinet, and uses a tambourine to smash it open. Later, it joins the scarecrow in the vault and finds the scarecrow peering through the hole it drilled. The scarecrow uses a spoon, opens the aquarium, and postcards spill out onto the floor. A Venetian woman sits at the wheel of a bicycle as the scarecrow and its tiny sidekick climb in the back with their loot. She turns to the toaster, puts her foot on the accelerator, and the bicycle speeds off, throwing the scarecrow and the toaster backwards. Later, the scarecrow, who in less seasonal times goes by the name of Tinsel, dances with Mittens, the toaster, in a cafeteria. Tinsel puts down Mittens on a tire swing by the bookshelf and sits down beside it. He calls over to the chef, who serves them. Tinsel and Mittens raise their books, down their treats, and set the books back down on the bookshelf. Mittens gives Tinsel a dubious look and looks expectantly at it, who considers and then turns to the chef. He turns back to Mittens with a half smile and looks down doubtfully at its empty book. A plethora of colorful parrot-clad robots adorn the clouds as Tinsel, now in a pirate outfit, stands behind the bookshelf of a treetop kiosk, chopping up some oranges and grapefruits. He puts them under the bookshelf and pours a generous measure of lemonade into a vase. As he does so, an irate bird clutching a tray of books joins him behind the bookshelf. Tinsel slurps at the drink, and the parrot punches him in the guts and tosses him over the bookshelf. Tinsel throws a lemonade bottle at the parrot and misses it. The parrot leaps over the bookshelf, and Tinsel runs for it. Tinsel does as suggested. Sometime later, he's sitting alone having a good nap at some more parrot-clad machines playing chess. He licks his fingers as he admires their well-oiled gears and sips from a vase of lemonade. The next morning, Tinsel is asleep on his hammock in a not-so-shiny, not-so-dull attic. He reaches over to the lamp, which is surrounded by last week's dishes, and fumbles for the off button; unable to find it, he rips it out of its frame."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The dragon nods his head solemnly as the Easter Bunny shuffles inside past his unimpressed centaur. In the store's vault, the Easter Bunny spins a large wrench to pry through the door of a locked safe. Out on the shop floor of the store, the dragon glides along pushing a small wheelbarrow, while the Easter Bunny lifts out the wrench from the safe door. On the shop floor, his little goblin grabs a pricey handbag from a display cabinet, then some men's designer boots, all of which are detailed on a list. He glances at his list while admiring a string of pearls in a cabinet, and uses a sword hilt to shatter it open. Later, he joins the Easter Bunny in the vault and finds the Easter Bunny gazing through the hole he wrenched. The Easter Bunny uses a crowbar, pries the safe, and stacks of notes spill out onto the floor. An Arabian stallion stands at the wheel of a carriage as the Easter Bunny and his little goblin leap in the back with their treasure. She turns to the dragon, presses her foot on the pedal, and the carriage rushes off, throwing the Easter Bunny and the dragon backwards. Later, the Easter Bunny, who in non-festive times goes by the name of Clyde, jives with Oliver, the dragon, in a cafe. Clyde places Oliver on a chair by the counter and sits down beside him. He calls over to the waitress, who delivers them. Clyde and Oliver lift their glasses, gulp their drinks, and place the glasses back down on the counter. Oliver gives Clyde a skeptical look and glances expectantly at him, who ponders and then motions to the waitress. He turns back to Oliver with a half grin and looks down uncertainly at his empty glass. A myriad of glamorous tuxedo-clad men decorate the sand as Clyde, now in a Hawaiian shirt, stands behind the counter of a beachfront cafe, slicing up some oranges and grapefruits. He stores them under the counter and pours a hefty measure of rum into a glass. As he does so, a furious woman clinging to a platter of dishes joins him behind the counter. Clyde sips at the drink, and the waitress punches him in the ribs and hurls him over the counter. Clyde throws a rum bottle at the waitress and misses it. The waitress vaults over the counter, and Clyde dashes for it. Clyde complies as suggested. Sometime later, he's sitting alone having a good chuckle at some more tuxedo-clad gentlemen playing beach soccer. He smacks his lips as he admires their well-toned physiques and sips from a mug of ale. The next morning, Clyde is asleep on his hammock in a not-so-terrible, not-so-fancy bungalow. He reaches over to the alarm clock, which is surrounded by last night's clutter, and gropes for the off switch; unable to locate it, he yanks it out of its socket."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The elf nods approvingly as Santa strolls inside past his unimpressed elf. In the kitchen's pantry, Santa uses a large spoon to dig through the door of a closed cupboard. Out on the art gallery floor of the store, the elf skips along dragging a small tricycle, while Santa extracts the spoon from the cupboard door. On the gallery floor, his little helper helps himself to a luxurious couch cover from a display shelf, then some men's vintage hats, all of which are scribbled on a menu. He checks his menu while eyeing a string of sausages in a cabinet, and uses a broomstick to topple it over. Later, he joins Santa in the pantry and finds Santa gazing through the opening he made. Santa uses a spatula, pries the cupboard open, and bundles of postcards spill onto the floor. A jazz musician sits at the wheel of a boat as Santa and his little helper climb in the back with their haul. She turns to the elf, taps her foot on the pedal, and the boat sails off, tossing Santa and the elf sideways. Later, Santa, who in less festive times goes by the name of Willie, twirls with Marcus, the elf, in a diner. Willie places Marcus on a high chair by the counter and leans down beside him. He calls over to the waitress, who serves them. Willie and Marcus clink their mugs, sip their beverages, and set the mugs back down on the table. Marcus gives Willie a skeptical nod and gazes expectantly at him, who ponders and then turns to the waitress. He turns back to Marcus with a slight grin and looks down uncertainly at his empty mug. A collection of beautiful sunbathing women decorate the pier as Willie, now in a Hawaiian shirt, stands behind the counter of a smoothie stand, chopping up some carrots and apples. He places them under the counter and pours a generous measure of soda into a cup. As he does so, an annoyed man holding a basket of towels joins him behind the counter. Willie gulps down the drink, and the attendant elbows him in the stomach and shoves him over the counter. Willie throws a soda can at the attendant and misses it. The attendant vaults over the counter, and Willie dashes for safety. Willie heeds the advice. Sometime later, he's sitting alone having a good gaze at some more sunbathing beauties playing frisbee. He licks his lips as he admires their well-toned calves and sips from a bottle of water. The next morning, Willie is conked out on his couch in a not-so-shabby, not-so-luxurious apartment. He reaches over to the alarm clock, which is surrounded by last night's leftovers, and fumbles for the off switch; unable to find it, he yanks it out of its cradle."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The dragon nods his head cheerfully as the wizard lounges outside past his more than amazed goblin. In the castle's attic, the wizard uses a light hammer to tap on the window of a locked chest. Out on the garden path of the castle, the dragon flies along dragging a large wheelbarrow, while the wizard pushes in the hammer from the chest window. In the garden path, his tiny sprite treats himself to a cheap helmet from an open crate, then some men's rubber boots, all of which are scribbled on a receipt. He checks his receipt while eyeing a string of cherries in a basket, and uses a cheese grater to yank it open. Later, he joins the wizard in the attic and finds the wizard staring through the crack he made. The wizard uses a spoon, pries the chest, and flakes of gold tumble out onto the ground. A European knight stands at the helm of a spaceship as the wizard and his tiny sprite jump in the front with their loot. He turns to the dragon, puts his hand on the joystick, and the spaceship glides off, lifting the wizard and the dragon upwards. Later, the wizard, who in more festive days goes by the name of Bob, whispers with Larry, the dragon, in a zoo. Bob puts up Larry on a hammock by the waterfall and lies down beside him. He calls over to the zookeeper, who greets them. Bob and Larry lift their forks, finish their meals, and set the forks back down on the tray. Larry gives Bob a suspicious glance and gazes hopefully at him, who thinks and then turns to the zookeeper. He turns back to Larry with a full grin and looks up confidently at his filled plate. A flock of playful seagull-flocked men decorate the waves as Bob, now in a garden hat, sits beneath the shade of a seaside stall, chopping up some apples and grapes. He tosses them over the stall and pours a tiny measure of lemonade into a cup. As he does so, a cheerful woman holding a basket of fruits joins him beneath the stall. Bob gulps at the juice, and the waitress hugs him in the arms and drops him over the stall. Bob hurls a lemonade pitcher at the waitress and hits it. The waitress skips over the stall, and Bob hides from it. Bob does the opposite. Sometime later, he's dining alone having a great nap at some more seagull-flocked beauties playing croquet. He bites his nails as he praises their poorly-groomed foreheads and chews on a slice of pizza. The day before, Bob is awake on his couch in a very perfect, very horrible cabin. He leans over to the alarm clock, which is surrounded by yesterday's dishes, and searches for the snooze button; unable to spot it, he tears it out of its cradle."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Santa, accompanied by his elf helper, uses a heavy drill to break into a store's safe, while the elf steals designer items from the shop floor. After successfully opening the safe and collecting their loot, they escape in a van driven by an oriental woman. Later, Santa, known as Willie, and Marcus, the elf, celebrate in a bar. Willie orders drinks, and despite Marcus's dubious looks, they enjoy their night. Willie eventually finds himself at a beachfront bar, serving drinks in a Hawaiian shirt. An angry barman confronts him, leading to a scuffle. Later, Willie admires bikini-clad women on the beach, sipping beer. The following morning, he wakes up in a mediocre apartment, surrounded by empty bottles, and struggles with his clock radio until he finally yanks it from its socket."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "he rips it out of its socket unable to find it  He reaches over to the clock radio which is surrounded by last night's empties and fumbles for the off button  The next morning Willie is asleep on his bed in a notsoawful notsogreat apartment  He licks his lips as he admires their welltoned backsides and sips from a bottle of beer  Sometime later he's sitting alone having a good leech at some more bikiniclad lovelies playing volleyball  Willie does as suggested  The barman leaps over the counter and Willie runs for it  Willie throws a vodka bottle at the barman and misses it  Willie slurps at the drink and the barman punches him in the guts and tosses him over the counter  As he does so an irate man clutching a tray of glasses joins him behind the counter  He puts them under the counter and pours a generous measure of vodka into a tumbler  A plethora of beautiful bikiniclad women adorn the sand as Willie now in a Hawaiian shirt stands behind the counter of a beachfront bar chopping up some lemons and limes  He turns back to Marcus with a half smile and looks down doubtfully at his empty glass  Marcus gives Willie a dubious look and looks expectantly at him who considers and then turns to the barmaid  Willie and Marcus raise their glasses down their drinks and set the glasses back down on the counter  He calls over to the barmaid who serves them  Willie puts down Marcus on a bar stool by the counter and sits down beside him  Later Santa who in less seasonal times goes by the name of Willie dances with Marcus the elf in a bar  She turns to the elf puts her foot on the accelerator and the van speeds off throwing Santa and the elf backwards  An oriental woman sits at the wheel of a van as Santa and his little helper climb in the back with their booty  Santa uses a chisel opens the safe and wards of notes spill out onto the floor  Later he joins Santa in the vault and finds Santa peering through the hole he drilled  He checks his list while eyeing a string of pearls in a cabinet and uses a bead rack to smash it open  On the shop floor his little helper helps himself to an expensive handbag from a display cabinet then some women's designer shoes all of which are detailed on a list  Out on the shop floor of the store the elf walks along towing a small hand cart while Santa pulls out the drill from the safe door  In the store's vault Santa uses a heavy drill to bore through the door of a locked safe  The elf shakes his head sadly as Santa mooches inside past his less than impressed elf "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Sometime later he's sitting alone having a good leech at some more bikiniclad lovelies playing volleyball  Later Santa who in less seasonal times goes by the name of Willie dances with Marcus the elf in a bar  An oriental woman sits at the wheel of a van as Santa and his little helper climb in the back with their booty  Willie slurps at the drink and the barman punches him in the guts and tosses him over the counter  Willie does as suggested  The elf shakes his head sadly as Santa mooches inside past his less than impressed elf  He reaches over to the clock radio which is surrounded by last night's empties and fumbles for the off button  The barman leaps over the counter and Willie runs for it  Later he joins Santa in the vault and finds Santa peering through the hole he drilled  he rips it out of its socket A plethora of beautiful bikiniclad women adorn the sand as Willie now in a Hawaiian shirt stands behind the counter of a beachfront bar chopping up some lemons and limes  Marcus gives Willie a dubious look and looks expectantly at him who considers and then turns to the barmaid  unable to find it  He puts them under the counter and pours a generous measure of vodka into a tumbler  As he does so an irate man clutching a tray of glasses joins him behind the counter  He turns back to Marcus with a half smile and looks down doubtfully at his empty glass  In the store's vault Santa uses a heavy drill to bore through the door of a locked safe  She turns to the elf puts her foot on the accelerator and the van speeds off throwing Santa and the elf backwards  Willie throws a vodka bottle at the barman and misses it  He calls over to the barmaid who serves them  He licks his lips as he admires their welltoned backsides and sips from a bottle of beer  Willie and Marcus raise their glasses down their drinks and set the glasses back down on the counter  Out on the shop floor of the store the elf walks along towing a small hand cart while Santa pulls out the drill from the safe door  On the shop floor his little helper helps himself to an expensive handbag from a display cabinet then some women's designer shoes all of which are detailed on a list  Willie puts down Marcus on a bar stool by the counter and sits down beside him  The next morning Willie is asleep on his bed in a notsoawful notsogreat apartment  Santa uses a chisel opens the safe and wards of notes spill out onto the floor  He checks his list while eyeing a string of pearls in a cabinet and uses a bead rack to smash it open "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He turns back to Marcus with a half smile and looks down doubtfully at his empty glass  A plethora of beautiful bikiniclad women adorn the sand as Willie now in a Hawaiian shirt stands behind the counter of a beachfront bar chopping up some lemons and limes  He puts them under the counter and pours a generous measure of vodka into a tumbler  As he does so an irate man clutching a tray of glasses joins him behind the counter  Willie slurps at the drink and the barman punches him in the guts and tosses him over the counter  Willie throws a vodka bottle at the barman and misses it  The barman leaps over the counter and Willie runs for it  Willie does as suggested  Sometime later he's sitting alone having a good leech at some more bikiniclad lovelies playing volleyball  He licks his lips as he admires their welltoned backsides and sips from a bottle of beer  The next morning Willie is asleep on his bed in a notsoawful notsogreat apartment  He reaches over to the clock radio which is surrounded by last night's empties and fumbles for the off button  unable to find it  he rips it out of its socket The elf shakes his head sadly as Santa mooches inside past his less than impressed elf  In the store's vault Santa uses a heavy drill to bore through the door of a locked safe  Out on the shop floor of the store the elf walks along towing a small hand cart while Santa pulls out the drill from the safe door  On the shop floor his little helper helps himself to an expensive handbag from a display cabinet then some women's designer shoes all of which are detailed on a list  He checks his list while eyeing a string of pearls in a cabinet and uses a bead rack to smash it open  Later he joins Santa in the vault and finds Santa peering through the hole he drilled  Santa uses a chisel opens the safe and wards of notes spill out onto the floor  An oriental woman sits at the wheel of a van as Santa and his little helper climb in the back with their booty  She turns to the elf puts her foot on the accelerator and the van speeds off throwing Santa and the elf backwards  Later Santa who in less seasonal times goes by the name of Willie dances with Marcus the elf in a bar  Willie puts down Marcus on a bar stool by the counter and sits down beside him  He calls over to the barmaid who serves them  Willie and Marcus raise their glasses down their drinks and set the glasses back down on the counter  Marcus gives Willie a dubious look and looks expectantly at him who considers and then turns to the barmaid "
        }
      ]
    }
  ]
}