{
  "ground_truth": "Willie and his companion knock back their drinks, and Willie puffs on his cigarette. She nods and looks at his glass, pours him another shot and then one for herself. They down them in one, and she gives him a coy look. Willie gets into his beaten-up old car. After the festive fornication, Willie leans against the car having a smoke, while she gets out and faces him. He half-smiles and nods, and she gives him a smile and heads off. Once she's gone, the moody-looking Indian guy from the bar runs over and shoves Willie, and Curly Head Fat Ass pulls Mr. Not Gay off Willie. Mr. Not Gay marches off into the night, and Willie catches his breath and turns to Fat Ass. Fat Ass turns to him. Sometime later, Willie gives Fat Ass a lift home in his knackered old car. Sitting in the passenger seat, the kid stares at Willie and smiles warmly, but Willie looks away. Apparently unmoved, the kid keeps staring at Willie. Willie turns off his engine and one working headlight, then gets out of the car with the kid. Willie admires the affluent suburban house they're in front of and frowns. As the kid unlocks the door, Willie pulls out a cotch and puts on a black balaclava. Inside, Grandma is watching a TV program featuring dancing fruit. Grandma walks past Willie, apparently unmoved by the fact that Santa is wearing a black balaclava. Willie turns to the kid, who nods. Willie pulls up his balaclava, opens a safe, and removes wads of cash and a passport, then shuts the safe and goes and sits down in an armchair. The credulous kid beams at him. Willie drives away in a very nice BMW. The next day at the mall, Bob, the manager, is doing his rounds and strolls through a woman's wear shop for larger ladies. Some noise emanating from the changing room catches his attention, and Bob decides to investigate. He looks under a cubicle door and sees a woman's feet and a man's feet behind them, with red Santa pants at his ankles. Marcus gives Bob a reproachful look and takes a candy from a jar on Bob's desk as he leaves. Later, Marcus wanders through a restaurant in the mall sipping a Coke and spots Willie putting the moves on a hot-bodied blonde at a pinball machine. Willie thrusts his crotch into the blonde. As he opens the car door, a pile of empties spills out, and he drives off, crashing them under his wheels. Bob is with Gin, the security chief, who eats an orange while Bob winces at the phrase.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Willie and his associate knock back their beverages, and Willie puffs on his cigarette. She nods and glances at his glass, pours him another shot and then one for herself. They down them in one, and she gives him a coy look. Willie gets into his battered old car. After the festive fornication, Willie leans against the car having a smoke, while she gets out and faces him. He half-smiles and nods, and she gives him a smile and heads off. Once she's gone, the moody-looking Indian guy from the bar runs over and shoves Willie, and Curly Head Fat Ass pulls Mr. Not Gay off Willie. Mr. Not Gay marches off into the night, and Willie catches his breath and turns to Fat Ass. Fat Ass turns to him. Sometime later, Willie gives Fat Ass a lift home in his worn-out old car. Sitting in the passenger seat, the youngster stares at Willie and smiles warmly, but Willie looks away. Apparently unmoved, the youngster keeps staring at Willie. Willie turns off his engine and one working headlight, then gets out of the car with the youngster. Willie admires the affluent suburban house they're in front of and frowns. As the youngster unlocks the door, Willie pulls out a cotch and puts on a black balaclava. Inside, Grandma is watching a TV program featuring dancing fruit. Grandma walks past Willie, apparently unmoved by the fact that Santa is wearing a black balaclava. Willie turns to the youngster, who nods. Willie pulls up his balaclava, opens a safe, and removes wads of cash and a passport, then shuts the safe and goes and sits down in an armchair. The naive youngster beams at him. Willie drives away in a very nice BMW. The next day at the mall, Bob, the supervisor, is doing his rounds and strolls through a women's wear shop for larger ladies. Some noise emanating from the changing room catches his attention, and Bob decides to investigate. He looks under a cubicle door and sees a woman's feet and a man's feet behind them, with red Santa trousers at his ankles. Marcus gives Bob a reproachful look and takes a candy from a jar on Bob's desk as he leaves. Later, Marcus wanders through a restaurant in the mall sipping a Coke and spots Willie putting the moves on a hot-bodied blonde at a pinball machine. Willie thrusts his crotch into the blonde. As he opens the car door, a pile of empties spills out, and he drives off, crashing them under his wheels. Bob is with Gin, the security chief, who eats an orange while Bob winces at the phrase."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Willie and his companion have their drinks knocked back by themselves, and his cigarette is puffed on by Willie. A nod is given by her, and his glass is looked at by her, then another shot is poured for him and one for herself. The shots are downed by them in one, and a coy look is given to him by her. Willie gets into his beaten-up old car. After the festive fornication, the car is leaned against by Willie having a smoke, while she gets out and faces him. A half-smile and a nod are given by him, and a smile is given to him by her before she heads off. Once she's gone, the moody-looking Indian guy from the bar runs over and shoves Willie, and Curly Head Fat Ass pulls Mr. Not Gay off him. Mr. Not Gay marches off into the night, and Willie catches his breath and turns to Fat Ass. Fat Ass turns to him. Sometime later, Fat Ass is given a lift home by Willie in his knackered old car. Sitting in the passenger seat, Willie is stared at by the kid, who smiles warmly, but Willie looks away. Apparently unmoved, Willie is kept under the kid's stare. The engine and one working headlight are turned off by Willie, then he gets out of the car with the kid. The affluent suburban house they're in front of is admired by Willie, who frowns. As the door is unlocked by the kid, a cotch is pulled out by Willie, and a black balaclava is put on. Inside, a TV program featuring dancing fruit is watched by Grandma. Grandma walks past Willie, apparently unmoved by the fact that Santa is wearing a black balaclava. The kid is turned to by Willie, who nods. The balaclava is pulled up by Willie, a safe is opened by him, and wads of cash and a passport are removed, then the safe is shut, and he sits down in an armchair. A credulous beam is given to him by the kid. A very nice BMW is driven away by Willie. The next day at the mall, Bob, the manager, does his rounds and strolls through a woman's wear shop for larger ladies. Some noise emanating from the changing room catches his attention, and Bob decides to investigate. Under a cubicle door, he looks and sees a woman's feet and a man's feet behind them, with red Santa pants at his ankles. Marcus gives Bob a reproachful look and takes a candy from a jar on Bob's desk as he leaves. Later, Marcus wanders through a restaurant in the mall sipping a Coke and spots Willie putting the moves on a hot-bodied blonde at a pinball machine. The blonde is thrust into by Willie with his crotch. As the car door is opened, a pile of empties spills out, and they are driven over by him, crashing under his wheels. Bob is with Gin, the security chief, who eats an orange while Bob winces at the phrase."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Willie and his friend finish their drinks, and Willie smokes a cigarette. She nods, refills their glasses, and they drink together. Afterward, Willie drives his old car, smokes, and exchanges smiles with her before she leaves. An angry Indian man from the bar confronts Willie, but Curly Head Fat Ass intervenes. Mr. Not Gay leaves, and Willie turns to Fat Ass. Later, Willie drives Fat Ass home, ignoring the kid's warm smile. Stopping outside a fancy house, Willie dons a black balaclava as the kid unlocks the door. Inside, Grandma is unfazed by Willie’s disguise. Willie retrieves cash and a passport from a safe, sits in an armchair, and the kid beams. Willie later drives a BMW. At the mall, Bob, the manager, hears noise in a shop’s changing room and finds a man and woman, with Santa pants down. Marcus scolds Bob and leaves, taking candy. Marcus then sees Willie flirting with a blonde at a pinball machine. Willie gets into his car, spilling bottles, and drives off. Bob and security chief Gin, who is eating an orange, discuss the situation."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Willie and his companion enjoy drinks, and Willie smokes. She pours them both shots; they drink, share a coy glance, and Willie leaves in his old car. After festivities, Willie smokes as she exits, smiles, and departs. A moody Indian man confronts Willie, but Curly Head Fat Ass intervenes. Willie later drives Fat Ass home. The kid stares at Willie, who looks away. Outside a suburban house, Willie dons a black balaclava. Inside, Grandma ignores \"Santa.\" Willie opens a safe, takes cash and a passport, then relaxes in a chair. The kid beams, and Willie drives off in a BMW. The next day, mall manager Bob hears noise from a changing room and sees a man's feet in Santa pants. Marcus gives Bob a look, takes candy, and later sees Willie flirting with a blonde. Willie drives off, crushing empty cans. Bob and security chief Gin discuss this, with Bob wincing at Gin's words."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Willie and his companion throw back their drinks with gusto, and Willie takes a long, deliberate drag on his cigarette. She acknowledges his empty glass with a nod and proceeds to pour him another generous shot, followed by one for herself. Together, they down the shots in a single, swift motion, after which she flashes him a playful, coy look. Willie then makes his way to his well-worn old car, clearly showing signs of age and use. After their festive and intimate encounter, Willie leans casually against the car, enjoying another cigarette, while she exits the vehicle and turns to face him. He offers a slight, knowing smile and a nod, which she returns with her own smile before walking away. Once she has departed, an Indian man with a moody demeanor, whom Willie recognizes from the bar, rushes over and gives Willie a forceful shove. Curly Head Fat Ass intervenes, pulling Mr. Not Gay away from Willie. Mr. Not Gay, still bristling with anger, strides off into the night, leaving Willie to catch his breath and turn towards Fat Ass. Fat Ass locks eyes with him. Some time later, Willie offers Fat Ass a ride home in his tired and dilapidated old car. While sitting in the passenger seat, the kid gazes at Willie with a warm, unwavering smile, which Willie deliberately avoids by looking away. Unperturbed by Willie’s lack of response, the kid continues to fix him with a steady stare. Willie eventually turns off his engine, along with the one headlight that still functions, and exits the car with the kid. As they stand there, Willie observes the affluent suburban house looming before them and frowns with evident disapproval. The kid, meanwhile, unlocks the door, while Willie retrieves a cotch from his pocket and pulls a black balaclava over his head. Inside the house, Grandma is engrossed in a television program showcasing animated, dancing fruit. As she walks past Willie, she seems completely unfazed by the sight of Santa wearing a black balaclava. Willie looks to the kid, who gives him an affirming nod. With that, Willie adjusts his balaclava, opens a nearby safe, and removes bundles of cash along with a passport. After securing the safe once more, he proceeds to settle into a comfortable armchair. The credulous kid beams at him with an expression of pure admiration. Willie then drives off in a sleek and luxurious BMW. The following day, at the bustling mall, Bob, the store manager, is making his routine rounds and sauntering through a specialty women's wear shop designed for larger ladies. A curious noise emanating from the changing room piques his interest, prompting him to investigate further. Peering under a cubicle door, he catches sight of a woman's feet alongside a man's feet, with the man's red Santa pants conspicuously pooled around his ankles. Marcus throws Bob a disapproving glance and casually helps himself to a candy from a jar on Bob's desk as he saunters out. Later on, Marcus meanders through a mall restaurant, sipping a Coke, and notices Willie flirting with a strikingly attractive blonde at a pinball machine. Willie brazenly thrusts his hips towards the blonde. When he opens the car door, a heap of empty bottles cascades out, and he drives away, crushing them noisily beneath his wheels. Meanwhile, Bob is meeting with Gin, the security chief, who is casually eating an orange while Bob grimaces at some unsettling phrase."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a sense of enthusiasm, Willie and his companion energetically down their drinks, savoring the moment. Willie then takes a lengthy, intentional drag on his cigarette. Observing his empty glass, she subtly nods in acknowledgment and proceeds to pour him another generous shot, following it with one for herself. Together, they enthusiastically consume the shots in a swift, singular motion. Afterward, she throws him a playful, teasing glance. Willie eventually heads towards his timeworn and weathered old car, which clearly shows signs of aging and frequent use. Following their festive and intimate encounter, Willie casually leans against the car, taking pleasure in another cigarette while she exits the vehicle and turns to face him. He responds with a faint, knowing smile and a nod, which she reciprocates with her own smile before walking away. Once she has left, an Indian man with a brooding demeanor, whom Willie recognizes from the bar, hastily approaches and forcefully shoves Willie. Curly Head Fat Ass steps in, pulling Mr. Not Gay away from the confrontation with Willie. Mr. Not Gay, still seething with anger, strides off into the dark night, leaving Willie to catch his breath and shift his attention to Fat Ass. Fat Ass locks eyes with him in a moment of silent understanding. Some time later, Willie offers Fat Ass a ride back home in his tired and dilapidated old car. While seated in the passenger seat, the kid gazes at Willie with a warm and unwavering smile, which Willie deliberately avoids by turning his gaze elsewhere. Unbothered by Willie’s lack of response, the kid maintains his steady stare. Willie eventually turns off his sputtering engine and the one remaining functioning headlight, then steps out of the car with the kid. As they stand together, Willie observes the affluent suburban house looming before them, frowning with clear disapproval. Meanwhile, the kid unlocks the door, while Willie retrieves a cotch from his pocket and pulls a black balaclava over his head. Inside the house, Grandma is fully absorbed in a television program featuring animated, dancing fruit. As she strolls past Willie, she appears entirely undisturbed by the sight of Santa wearing a black balaclava. Willie glances at the kid, who responds with an affirming nod. With that, Willie adjusts his balaclava, opens a nearby safe, and removes bundles of cash along with a passport. After carefully securing the safe once more, he settles into a comfortable armchair. The credulous kid beams at him with pure admiration radiating from his expression. Willie then drives off in a sleek and luxurious BMW. The following day, at the bustling mall, Bob, the store manager, is making his routine rounds while sauntering through a specialty women's wear shop designed for larger ladies. A curious noise coming from the changing room captures his attention, prompting him to investigate further. Peering under a cubicle door, he notices a pair of a woman’s feet alongside a man’s feet, with the man's red Santa pants conspicuously gathered around his ankles. Marcus throws Bob a disapproving glance and casually helps himself to a candy from a jar on Bob’s desk as he saunters out. Later on, Marcus meanders through a mall restaurant, sipping a Coke, and catches sight of Willie flirting with an exceptionally attractive blonde at a pinball machine. Willie brazenly thrusts his hips towards the blonde in a bold gesture. When he opens the car door, a heap of empty bottles cascades out, and he drives away, noisily crunching them under his wheels. Meanwhile, Bob meets with Gin, the security chief, who nonchalantly eats an orange while Bob grimaces at some unsettling phrase."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Willie and his companion quickly drink their respective beverages, with Willie taking a drag from his cigarette before she gestures toward his empty glass, signaling her intention to refill it. Observing his response, she pours a fresh shot for him and one for herself, and together they swiftly consume their drinks, locking eyes as she sends him a coy look. Willie then approaches his old, worn-out car and, following a moment of intimacy, leans casually against it, enjoying another cigarette while she steps out to face him. The exchange is brief as she returns his half-smile with one of her own before turning away and walking off. Not long after her departure, a somber Indian man from the bar urgently approaches Willie and delivers a forceful shove, prompting Curly Head Fat Ass to intervene by pulling the man, referred to as Mr. Not Gay, off Willie. With a sense of indignation, Mr. Not Gay then strides away into the night, leaving Willie to catch his breath as he exchanges glances with Fat Ass, who reciprocates the look. Later on, Willie offers Fat Ass a ride home in his dilapidated vehicle, and as they sit inside, Fat Ass gazes at Willie with a warm smile, which Willie does not return, instead diverting his gaze. Unperturbed, the kid continues to watch Willie, who subsequently switches off the car's engine along with its single functional headlight before they both exit the vehicle. Willie casts a critical eye over the upscale suburban house they stand before, his brow furrowing with discontent. As the kid unlocks the door, Willie retrieves and dons a balaclava over his face. Once inside, they pass by Grandma, who is engrossed in a television program featuring animated dancing fruit. Grandma walks by Willie without acknowledging the bizarre sight of him wearing a Santa outfit topped with a black balaclava. With a silent nod from the kid, Willie removes the balaclava, methodically opens a safe, and extracts bundles of cash along with a passport, securing them before heading over to an armchair and settling into it. The naive kid grins at him with admiration. Willie subsequently leaves the scene, driving off in a luxurious BMW. The following day in the mall, Bob, the manager, is conducting his routine inspections and moves through a women's clothing store catering to larger sizes when an unfamiliar noise from the fitting room captures his attention. Curiosity piqued, Bob bends down to peer under a cubicle door, revealing a pair of women’s feet accompanied by a man’s feet clad in red Santa pants pooled around his ankles. Marcus catches Bob’s eye, casting a look of reproach his way, before helping himself to a candy from a jar on Bob’s desk as he makes his exit. Later, Marcus meanders through a mall restaurant, sipping on a Coke, when he catches sight of Willie flirting with an attractive blonde at a pinball machine, brazenly thrusting his hips toward her. Upon opening his car door, a cascade of empty bottles tumbles out, which are then crushed under the wheels as he drives away. Meanwhile, Bob is accompanied by Gin, the security chief, who snacks on an orange while Bob grimaces at an expression that seems to discomfort him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Willie and his companion finish their drinks as he smokes a cigarette. She refills their glasses, and they both toss back another shot, exchanging a coy smile. Willie then gets into his old car, and after some intimate time, leans against it, smoking as she exits to face him. They share a half-smile before she departs. Soon after, the moody guy from the bar confronts Willie, but Curly Head Fat Ass intervenes, pulling him away. Willie regains his composure, and after some time, drives Fat Ass home in his worn-out vehicle. During the ride, the kid warmly smiles at Willie, who remains aloof. They arrive at an affluent suburban house, and as the kid unlocks the door, Willie dons a black balaclava. Inside, Grandma nonchalantly passes by him while watching TV. Willie, with the kid's nod of approval, retrieves cash and a passport from a safe, then relaxes in an armchair, prompting an admiring smile from the kid. Willie later drives off in a luxurious BMW. The following day at the mall, Bob, the manager, notices some noise in a women's wear shop and finds Marcus in a compromising position in a changing room. Marcus gives Bob a reproachful look and, as he leaves, takes a candy from Bob's desk. Later, Marcus spots Willie flirting with a blonde at a pinball machine. As Willie drives away, empty bottles spill from his car, crunching beneath his wheels. Elsewhere, Bob and Gin, the security chief, have a conversation while Gin snacks on an orange, leaving Bob to grimace."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Willie and his companion knock back their drinks, and Willie puffs on his cigarette, a habit still prevalent despite public smoking bans in many places. She nods and looks at his glass, pours him another shot of whiskey, a favored spirit originating from Scotland and Ireland, and then one for herself. They down them in one, a common custom in drinking culture to signal camaraderie, and she gives him a coy look. Willie gets into his beaten-up old car, a relic of a bygone era with its chipped paint and rusted bumper. After the festive fornication, a slang term for casual and celebratory intimacy, Willie leans against the car having a smoke, while she gets out and faces him. He half-smiles and nods, and she gives him a smile and heads off. Once she's gone, the moody-looking Indian guy from the bar, whose intensity had been noticed earlier, runs over and shoves Willie, and Curly Head Fat Ass, known for his peculiar nickname and distinct hairstyle, pulls Mr. Not Gay off Willie. Mr. Not Gay, whose name suggests a play on stereotypes, marches off into the night, and Willie catches his breath and turns to Fat Ass. Fat Ass turns to him. Sometime later, Willie gives Fat Ass a lift home in his knackered old car, an embarrassing but functional vehicle. Sitting in the passenger seat, the kid stares at Willie and smiles warmly, revealing a genuine affection, but Willie looks away. Apparently unmoved, the kid keeps staring at Willie. Willie turns off his engine and one working headlight, a testament to the car's decrepitude, then gets out of the car with the kid. Willie admires the affluent suburban house they're in front of, a marked contrast to his economic situation, and frowns. As the kid unlocks the door, Willie pulls out a cotch, a concealed weapon often used in stealth, and puts on a black balaclava, reminiscent of bank heists in movies. Inside, Grandma is watching a TV program featuring dancing fruit, an absurdist comedy series popular for its quirky humor. Grandma walks past Willie, apparently unmoved by the fact that Santa is wearing a black balaclava, adding a surreal touch to the scene. Willie turns to the kid, who nods. Willie pulls up his balaclava, opens a safe with a skill honed by years of practice, and removes wads of cash and a passport, then shuts the safe and goes and sits down in an armchair. The credulous kid beams at him, clearly impressed by the night's adventure. Willie drives away in a very nice BMW, a luxury car that starkly contrasts with his usual ride. The next day at the mall, a bustling hub of consumer activity, Bob, the manager, is doing his rounds and strolls through a woman's wear shop for larger ladies, a niche retail segment that has grown in recent years. Some noise emanating from the changing room catches his attention, and Bob decides to investigate. He looks under a cubicle door and sees a woman's feet and a man's feet behind them, with red Santa pants at his ankles, suggesting a clandestine encounter. Marcus gives Bob a reproachful look and takes a candy from a jar on Bob's desk as he leaves, showcasing his mischievous character. Later, Marcus wanders through a restaurant in the mall, sipping a classic American Coke, and spots Willie putting the moves on a hot-bodied blonde at a pinball machine, a retro game experiencing a resurgence in popularity. Willie thrusts his crotch into the blonde, an overt display of machismo. As he opens the car door, a pile of empties, evidence of his excessive drinking, spills out, and he drives off, crashing them under his wheels. Bob is with Gin, the security chief known for her sharp instincts, who eats an orange while Bob winces at the phrase, highlighting his aversion to certain expressions."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Willie and his companion knock back their drinks and Willie puffs on his cigarette. She nods and looks at his glass pours him another shot and then one for herself. They down them in one and she gives him a coy look. Willie gets into his beatenup old car. After the festive fornication Willie leans against the car having a smoke while she gets out and faces him. He halfsmiles and nods and she gives him a smile and heads off. Once she is gone the moodylooking Indian guy from the bar runs over and shoves Willie and Curly Head. Fat Ass pulls Mr Not Gay off Willie. Mr Not Gay marches off into the night and Willie catches his breath and turns to Fat Ass. Fat Ass turns to him. Sometime later Willie gives Fat Ass a lift home in his knackered old car. Sitting in the passenger seat the kid stares at Willie and smiles warmly but Willie looks away. Apparently unmoved the kid keeps staring at Willie. Willie turns off his engine and one working headlight then gets out of the car with the kid. Willie admires the affluent suburban house they are in front of and frowns. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. As the kid unlocks the door Willie pulls out a cotch and puts on a black balaclava. Inside Grandma is watching a TV program featuring dancing fruit. Grandma walks past Willie apparently unmoved by the fact that Santa is wearing a black balaclava. Willie turns to the kid who nods. Willie pulls up his balaclava opens a safe and removes wads of cash and a passport then shuts the safe and goes and sits down in an armchair. The credulous kid beams at him. Willie drives away in a very nice BMW. The next day at the mall Bob the manager is doing his rounds and strolls through a woman's wear shop for larger ladies. Some noise emanating from the changing room catches his attention and Bob decides to investigate. He looks under a cubicle door and sees a woman's feet and a man's feet behind them with red. Santa pants at his ankles. Marcus gives Bob a reproachful look and takes a candy from a jar on Bob's desk as he leaves. Later Marcus wanders through a restaurant in the mall sipping a Coke and spots Willie putting the moves on a hotbodied blonde at a pinball machine. Willie thrusts his crotch into the blonde. As he opens the car door a pile of empties spills out and he drives off crashing them under his wheels. Bob is with Gin the security chief who eats an orange while Bob winces at the phrase."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Willie and his companion knock back their drinks and Willie puffs on his cigarette. She nods and looks at his glass pours him another shot and then one for herself. They down them in one and she gives him a coy look. Willie gets into his beatenup old car. After the festive fornication Willie leans against the car having a smoke while she gets out and faces him. He halfsmiles and nods and she gives him a smile and heads off. Once she is gone the moodylooking Indian guy from the bar runs over and shoves Willie and Curly Head. Fat Ass pulls Mr Not Gay off Willie. Mr Not Gay marches off into the night and Willie catches his breath and turns to Fat Ass. Fat Ass turns to him. Sometime later Willie gives Fat Ass a lift home in his knackered old car. Sitting in the passenger seat the kid stares at Willie and smiles warmly but Willie looks away. Apparently unmoved the kid keeps staring at Willie. Willie turns off his engine and one working headlight then gets out of the car with the kid. Willie admires the affluent suburban house they are in front of and frowns. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. As the kid unlocks the door Willie pulls out a cotch and puts on a black balaclava. Inside Grandma is watching a TV program featuring dancing fruit. Grandma walks past Willie apparently unmoved by the fact that Santa is wearing a black balaclava. Willie turns to the kid who nods. Willie pulls up his balaclava opens a safe and removes wads of cash and a passport then shuts the safe and goes and sits down in an armchair. The credulous kid beams at him. Willie drives away in a very nice BMW. The next day at the mall Bob the manager is doing his rounds and strolls through a woman's wear shop for larger ladies. Some noise emanating from the changing room catches his attention and Bob decides to investigate. He looks under a cubicle door and sees a woman's feet and a man's feet behind them with red. Santa pants at his ankles. Marcus gives Bob a reproachful look and takes a candy from a jar on Bob's desk as he leaves. Later Marcus wanders through a restaurant in the mall sipping a Coke and spots Willie putting the moves on a hotbodied blonde at a pinball machine. Willie thrusts his crotch into the blonde. As he opens the car door a pile of empties spills out and he drives off crashing them under his wheels. Bob is with Gin the security chief who eats an orange while Bob winces at the phrase."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Willie and his companion knock back their drinks and Willie puffs on his cigarette. She nods and looks at his glass pours him another shot and then one for herself. They down them in one and she gives him a coy look. Willie gets into his beatenup old car. After the festive fornication Willie leans against the car having a smoke while she gets out and faces him. He halfsmiles and nods and she gives him a smile and heads off. Once she is gone the moodylooking Indian guy from the bar runs over and shoves Willie and Curly Head. Fat Ass pulls Mr Not Gay off Willie. Some noise emanating from the changing room catches his attention and Bob decides to investigate. He looks under a cubicle door and sees a woman's feet and a man's feet behind them with red. Santa pants at his ankles. Marcus gives Bob a reproachful look and takes a candy from a jar on Bob's desk as he leaves. Later Marcus wanders through a restaurant in the mall sipping a Coke and spots Willie putting the moves on a hotbodied blonde at a pinball machine. Willie thrusts his crotch into the blonde. As he opens the car door a pile of empties spills out and he drives off crashing them under his wheels. Bob is with Gin the security chief who eats an orange while Bob winces at the phrase."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Willie and his companion knock back their drinks and Willie puffs on his cigarette. She nods and looks at his glass pours him another shot and then one for herself. They down them in one and she gives him a coy look. Later Marcus wanders through a restaurant in the mall sipping a Coke and spots Willie putting the moves on a hotbodied blonde at a pinball machine. Willie thrusts his crotch into the blonde. As he opens the car door a pile of empties spills out and he drives off crashing them under his wheels. Bob is with Gin the security chief who eats an orange while Bob winces at the phrase."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Benny and his associate sip their milkshakes, and Benny inhales from his pipe. He winks and glances at her plate, tosses him a pebble, and then one for herself. They sip them down in one, and he gives her a playful grin. Benny hops into his rusted-out bicycle. After the cheerful knitting, Benny leans against the bicycle chewing gum, while he steps out and stares at him. He smirks and winks, and he gives her a nod and skips away. Once he’s gone, the sullen-looking Dutch fellow from the café prances over and nudges Benny, and Curly Tail Thin Guy pushes Mr. Also Smart off Benny. Mr. Also Smart strides off into the dawn, and Benny catches his breath and glances at Thin Guy. Thin Guy glances at him. Much later, Benny offers Thin Guy a ride on his dilapidated old skateboard. Sitting on the skateboard, the cat gazes at Benny and grins broadly, but Benny gazes away. Seemingly unimpressed, the cat continues staring at Benny. Benny shuts off his engine and the broken headlamp, then stumbles off the skateboard with the cat. Benny admires the sprawling industrial complex they're near and grimaces. As the cat cracks open the gate, Benny pulls out a violin and dons a purple ski mask. Inside, Grandpa is enjoying a radio program featuring singing vegetables. Grandpa walks past Benny, apparently undisturbed by the fact that an elf is wearing a purple ski mask. Benny turns to the cat, who nods. Benny pulls down his ski mask, unseals a jar, and retrieves stacks of paper and an ID card, then closes the jar and goes and lounges on a sofa. The gullible cat beams at him. Benny cycles away on a very sleek scooter. The following morning at the park, Tim, the coordinator, is making his rounds and meanders through a men's shoe shop for tiny feet. Some noise arising from the storage room piques his interest, and Tim opts to examine. He peers under a shelf and sees a child's feet and a dog's paws behind them, with blue Santa shorts at his toes. Dexter gives Tim a scornful stare and snatches a plum from a basket on Tim's table as he departs. Later, Dexter strolls through a cinema in the park sipping a smoothie and spots Benny wooing a well-dressed redhead at a game console. Benny thrusts his elbows into the redhead. As he opens the bicycle basket, a heap of bananas spills out, and he rides off, squishing them beneath his gears. Tim is with Tea, the supervision leader, who devours a melon while Tim winces at the expression."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Willie and his companion enjoy drinks, then she gives him a coy look after pouring more shots. After a tryst in his old car, she leaves, and Willie faces an altercation with a moody Indian guy, with Curly Head Fat Ass intervening. Willie later gives Fat Ass a lift home in his rundown car, where they arrive at a suburban house. Willie dons a black balaclava and robs a safe while Grandma watches TV. The kid beams at him, and Willie departs in a BMW. At the mall, Bob, the manager, investigates noise in a changing room, finding a man with red Santa pants. Marcus, spotted sipping a Coke, sees Willie flirting with a blonde. Willie drives away, leaving empty bottles in his wake. Bob and security chief Gin continue observing the scene."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Bob is with Gin the security chief who eats an orange while Bob winces at the phrase As he opens the car door a pile of empties spills out and he drives off crashing them under his wheels Willie thrusts his crotch into the blonde Later Marcus wanders through a restaurant in the mall sipping a Coke and spots Willie putting the moves on a hotbodied blonde at a pinball machine Marcus gives Bob a reproachful look and takes a candy from a jar on Bob's desk as he leaves Santa pants at his ankles He looks under a cubicle door and sees a woman's feet and a man's feet behind them with red Some noise emanating from the changing room catches his attention and Bob decides to investigate The next day at the mall Bob the manager is doing his rounds and strolls through a woman's wear shop for larger ladies Willie drives away in a very nice BMW The credulous kid beams at him Willie pulls up his balaclava opens a safe and removes wads of cash and a passport then shuts the safe and goes and sits down in an armchair Willie turns to the kid who nods Grandma walks past Willie apparently unmoved by the fact that Santa is wearing a black balaclava Inside Grandma is watching a TV program featuring dancing fruit As the kid unlocks the door Willie pulls out a cotch and puts on a black balaclava Willie admires the affluent suburban house they are in front of and frowns Willie turns off his engine and one working headlight then gets out of the car with the kid Apparently unmoved the kid keeps staring at Willie Sitting in the passenger seat the kid stares at Willie and smiles warmly but Willie looks away Sometime later Willie gives Fat Ass a lift home in his knackered old car Fat Ass turns to him Mr Not Gay marches off into the night and Willie catches his breath and turns to Fat Ass Fat Ass pulls Mr Not Gay off Willie Once she is gone the moodylooking Indian guy from the bar runs over and shoves Willie and Curly Head He halfsmiles and nods and she gives him a smile and heads off After the festive fornication Willie leans against the car having a smoke while she gets out and faces him Willie gets into his beatenup old car They down them in one and she gives him a coy look She nods and looks at his glass pours him another shot and then one for herself Willie and his companion knock back their drinks and Willie puffs on his cigarette"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "She nods and looks at his glass pours him another shot and then one for herself Willie and his companion knock back their drinks and Willie puffs on his cigarette Willie gets into his beatenup old car They down them in one and she gives him a coy look He halfsmiles and nods and she gives him a smile and heads off After the festive fornication Willie leans against the car having a smoke while she gets out and faces him Fat Ass pulls Mr Not Gay off Willie Once she is gone the moodylooking Indian guy from the bar runs over and shoves Willie and Curly Head Fat Ass turns to him Mr Not Gay marches off into the night and Willie catches his breath and turns to Fat Ass Sitting in the passenger seat the kid stares at Willie and smiles warmly but Willie looks away Sometime later Willie gives Fat Ass a lift home in his knackered old car Willie turns off his engine and one working headlight then gets out of the car with the kid Apparently unmoved the kid keeps staring at Willie As the kid unlocks the door Willie pulls out a cotch and puts on a black balaclava Willie admires the affluent suburban house they are in front of and frowns Grandma walks past Willie apparently unmoved by the fact that Santa is wearing a black balaclava Inside Grandma is watching a TV program featuring dancing fruit Willie pulls up his balaclava opens a safe and removes wads of cash and a passport then shuts the safe and goes and sits down in an armchair Willie turns to the kid who nods Willie drives away in a very nice BMW The credulous kid beams at him Some noise emanating from the changing room catches his attention and Bob decides to investigate The next day at the mall Bob the manager is doing his rounds and strolls through a woman's wear shop for larger ladies Santa pants at his ankles He looks under a cubicle door and sees a woman's feet and a man's feet behind them with red Later Marcus wanders through a restaurant in the mall sipping a Coke and spots Willie putting the moves on a hotbodied blonde at a pinball machine Marcus gives Bob a reproachful look and takes a candy from a jar on Bob's desk as he leaves As he opens the car door a pile of empties spills out and he drives off crashing them under his wheels Willie thrusts his crotch into the blonde Bob is with Gin the security chief who eats an orange while Bob winces at the phrase"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Inside Grandma is watching a TV program featuring dancing fruit Grandma walks past Willie apparently unmoved by the fact that Santa is wearing a black balaclava Willie turns to the kid who nods Willie pulls up his balaclava opens a safe and removes wads of cash and a passport then shuts the safe and goes and sits down in an armchair The credulous kid beams at him Willie drives away in a very nice BMW The next day at the mall Bob the manager is doing his rounds and strolls through a woman's wear shop for larger ladies Some noise emanating from the changing room catches his attention and Bob decides to investigate He looks under a cubicle door and sees a woman's feet and a man's feet behind them with red Santa pants at his ankles Marcus gives Bob a reproachful look and takes a candy from a jar on Bob's desk as he leaves Later Marcus wanders through a restaurant in the mall sipping a Coke and spots Willie putting the moves on a hotbodied blonde at a pinball machine Willie thrusts his crotch into the blonde As he opens the car door a pile of empties spills out and he drives off crashing them under his wheels Bob is with Gin the security chief who eats an orange while Bob winces at the phrase Willie and his companion knock back their drinks and Willie puffs on his cigarette She nods and looks at his glass pours him another shot and then one for herself They down them in one and she gives him a coy look Willie gets into his beatenup old car After the festive fornication Willie leans against the car having a smoke while she gets out and faces him He halfsmiles and nods and she gives him a smile and heads off Once she is gone the moodylooking Indian guy from the bar runs over and shoves Willie and Curly Head Fat Ass pulls Mr Not Gay off Willie Mr Not Gay marches off into the night and Willie catches his breath and turns to Fat Ass Fat Ass turns to him Sometime later Willie gives Fat Ass a lift home in his knackered old car Sitting in the passenger seat the kid stares at Willie and smiles warmly but Willie looks away Apparently unmoved the kid keeps staring at Willie Willie turns off his engine and one working headlight then gets out of the car with the kid Willie admires the affluent suburban house they are in front of and frowns As the kid unlocks the door Willie pulls out a cotch and puts on a black balaclava"
        }
      ]
    }
  ]
}