{
  "ground_truth": "Outside a door, a tall, blonde security guard is on duty and checks his watch. In a back room, Willie puts a sack down while Marcus points to an air conditioning vent. Marcus removes the cover from the vent, clambers into the duct, and crawls along it clutching a torch. In an office, a man looks up at the duct as noises emanate from it, and a woman working at her desk also looks up, along with a woman at the next desk who then turns around, looks at the duct, shrugs, and resumes her work. Marcus arrives at a vent and observes a security office filled with monitors, looks at the equipment, and makes notes on a pad. Meanwhile, Gin is having a pedicure and answers his phone. Roger Merriman, the kid's dad, is in prison, and Gin walks into the prison visitors' room where Roger, who is balding and bespectacled, is sitting. Gin nods his head and gets up as Roger looks confused. Willie cooks for the kid and Grandma, serves it up, spoons a dollop onto it, turns back to the stove to flip the bologna, and serves a plate of North Pole-style fried bologna for himself, placing it on the breakfast bar. The kid heads off to get it, hands it to Willie, who gives it back to the kid struggling to open the door, which appears to have been stuck with excessive adhesive. Willie watches as the kid finds a cheap sweet inside. Bob is with Gin, who mixes and slurps a dose of Fibracell stool softener, grimacing as Bob winces. A bus pulls up outside the mall, and skaterats see the kid getting off at the stop. The kid sees them, hesitates, then walks down the street, with the skaterats following maliciously. They get him and grot him. The boy wanders off as Santa scratches his own ass, and the kid appears with his pants around his armpits. Marcus heads off while Willie looks at the kid, stares incredulously, shakes his head, and the kid just stares back before walking away with his underpants still around his armpits. Willie watches him go with a doleful expression and turns back to Marcus, who stares at him with a very deadpan expression for an elf. Gin is next in line, and Gin, Willie, and Marcus are in a bar, where Marcus shifts uneasily.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Beyond a portal, a tall, fair security sentinel is on watch and inspects his timepiece. In a rear chamber, Willie places a bag down while Marcus gestures to an air conditioning duct. Marcus extracts the cover from the duct, clambers into the conduit, and crawls along it clutching a flashlight. In an office, a man gazes up at the conduit as sounds emit from it, and a woman working at her desk also gazes up, along with a woman at the adjacent desk who then pivots, gazes at the conduit, shrugs, and resumes her task. Marcus arrives at a duct and observes a security office filled with screens, surveys the apparatus, and makes notes on a pad. Meanwhile, Gin is having a pedicure and answers his phone. Roger Merriman, the child's father, is in incarceration, and Gin enters the prison visitors' room where Roger, who is balding and bespectacled, is sitting. Gin nods his head and rises as Roger looks perplexed. Willie cooks for the child and Grandma, serves it up, spoons a dollop onto it, turns back to the stove to flip the bologna, and serves a plate of North Pole-style fried bologna for himself, placing it on the breakfast bar. The child departs to retrieve it, hands it to Willie, who hands it back to the child struggling to open the door, which appears to have been stuck with excessive adhesive. Willie observes as the child discovers a cheap treat inside. Bob is with Gin, who mixes and slurps a dose of Fibracell stool softener, grimacing as Bob winces. A bus halts outside the mall, and skaterats see the child disembarking at the stop. The child notices them, hesitates, then walks down the street, with the skaterats pursuing maliciously. They capture him and grot him. The boy drifts off as Santa scratches his own behind, and the child appears with his trousers around his armpits. Marcus departs while Willie looks at the child, stares incredulously, shakes his head, and the child just stares back before walking away with his underpants still around his armpits. Willie watches him go with a doleful expression and turns back to Marcus, who stares at him with a very deadpan expression for an elf. Gin is next in line, and Gin, Willie, and Marcus are in a tavern, where Marcus shifts uneasily."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Outside a door, a tall, blonde security guard is on duty and his watch is checked by him. In a back room, a sack is put down by Willie while an air conditioning vent is pointed to by Marcus. The cover is removed from the vent by Marcus, who clambers into the duct and crawls along it clutching a torch. In an office, the duct is looked up at by a man as noises emanate from it, and a woman working at her desk also looks up, along with a woman at the next desk who then turns around, looks at the duct, shrugs, and her work is resumed by her. Marcus arrives at a vent and observes a security office filled with monitors, the equipment is looked at by him, and notes are made on a pad. Meanwhile, Gin has a pedicure done and his phone is answered by him. Roger Merriman, the kid's dad, is in prison, and into the prison visitors' room Gin walks, where Roger, who is balding and bespectacled, is sitting. Gin nods his head and gets up as Roger looks confused. The kid and Grandma are cooked for by Willie, it is served up by him, a dollop is spooned onto it, he turns back to the stove to flip the bologna, and a plate of North Pole-style fried bologna is served for himself, placing it on the breakfast bar. The kid heads off to get it, hands it to Willie, and it is given back to the kid by Willie, who struggles to open the door, which excessive adhesive appears to have stuck. Willie watches as a cheap sweet is found inside by the kid. Bob is with Gin, who mixes and slurps a dose of Fibracell stool softener, grimaces as Bob winces. A bus pulls up outside the mall, and the kid is seen getting off at the stop by skaterats. The kid sees them, hesitates, then walks down the street, and they follow him maliciously. The skaterats get him and grot him. The boy wanders off as Santa scratches his own ass, and the kid appears with his pants around his armpits. While Willie looks at the kid, Marcus heads off, and his head is shaken incredulously by Willie, and the kid just stares back before walking away with his underpants still around his armpits. The kid is watched go by Willie with a doleful expression and he turns back to Marcus, who stares at him with a very deadpan expression for an elf. Gin is next in line, and Gin, Willie, and Marcus are in a bar, where Marcus shifts uneasily."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Outside a door, a tall, blonde security guard is on duty and checks his watch. In a back room, Willie places a sack down while Marcus points to an air conditioning vent. Marcus removes the cover, clambers into the duct, and crawls with a torch. In an office, noises from the duct draw the attention of a man and two women, one of whom shrugs and resumes work. Marcus observes a security office filled with monitors, examines the equipment, and takes notes. Meanwhile, Gin, having a pedicure, answers his phone. Roger Merriman, the kid's dad, is in prison, and Gin visits him in the visitors' room. Roger, confused, watches Gin get up and leave. Willie cooks for the kid and Grandma, serves, then prepares his own North Pole-style fried bologna, placing it on the breakfast bar. The kid attempts to open a sticky door and finds a cheap sweet inside. Bob is with Gin, who grimaces while drinking Fibracell stool softener, as Bob winces. A bus arrives at the mall; skaterats see the kid get off, follow him, and harass him. The boy leaves as Santa scratches himself, and the kid reappears with his pants comically high. Marcus departs while Willie incredulously stares at the kid before he walks away, his underpants still high. Willie, looking doleful, turns to Marcus, who maintains a deadpan elf expression. Gin joins Willie and Marcus in a bar where Marcus shifts uneasily."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Outside a door, a tall, blonde guard checks his watch. In a back room, Willie drops a sack as Marcus points to an air vent, removes its cover, and crawls inside with a torch. In an office, three workers hear noises from the duct. Marcus reaches a vent, sees a security office with monitors, and makes notes. Gin, having a pedicure, answers his phone. Roger Merriman, in prison, meets Gin, who nods as Roger appears confused. Willie cooks for the kid and Grandma, serving North Pole-style fried bologna. The kid struggles with a sticky door, finds a sweet inside. Bob watches Gin grimace at Fibracell stool softener. A bus arrives at the mall; skaterats see the kid, follow, and grot him. Santa scratches himself; the kid appears with pants up high. Marcus leaves while Willie stares at the kid, shaking his head. Gin, Willie, and Marcus are in a bar, where Marcus shifts uneasily."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Outside a sturdy door, a tall and fair-haired security guard stands attentively on duty, occasionally glancing down to check his watch with a practiced motion. In the quieter confines of a back room, Willie busily places a sizable sack down while Marcus gestures meaningfully toward an air conditioning vent nearby. Marcus then skillfully removes the vent cover, hoists himself into the narrow duct, and begins to navigate through it, clutching a small torch to illuminate his path. In a nearby office, a man seated at his desk looks up curiously at the ductwork as peculiar noises emanate from above, and a woman, also working diligently at her desk, does the same. Another woman, positioned at an adjacent desk, glances up, then casually turns around to examine the duct, shrugs in a nonchalant manner, and returns to her tasks.\n\nMarcus eventually arrives at another vent and peers through it to take in the view of a security office filled with monitors and various pieces of equipment. He carefully observes the setup and takes detailed notes on a small pad. Meanwhile, Gin, indulging in some self-care, is having a pedicure when his phone rings, and he answers it. Roger Merriman, the father of a young child, is currently in prison. Gin then enters the stark visitors' room at the penitentiary, where Roger, noticeably balding and wearing glasses, sits waiting. Gin nods his head in acknowledgment and rises from his seat, while Roger remains seated, looking somewhat confused by the interaction.\n\nIn another setting, Willie is preparing a meal for the kid and Grandma, diligently cooking, serving the food, and adding a generous spoonful of something onto the dish. He then turns back to the stove momentarily to flip a slice of bologna, which he proceeds to serve on a plate for himself, styled to resemble a North Pole delicacy, and places it on the breakfast bar. The young child sets off to collect it, handing the plate to Willie, who promptly returns it to the child, who struggles slightly with a door that seems stubbornly stuck due to an excessive amount of adhesive. Willie watches as the child discovers a cheap sweet inside.\n\nElsewhere, Bob joins Gin, who is in the process of mixing and rather reluctantly slurping down a dose of Fibracell stool softener, grimacing at the taste while Bob cringes in sympathy nearby. Outside, a bus pulls up in front of the bustling mall, and a group of skaterats spots the child as he disembarks at the bus stop. Observing them, the kid hesitates for a moment before deciding to walk determinedly down the street, with the skaterats following maliciously in his wake. They catch him, taunt him, and the boy eventually wanders off, with a Santa nearby scratching absent-mindedly. The kid appears with his trousers humorously pulled up to his armpits. Marcus departs the scene while Willie, observing the kid, stares in disbelief, shaking his head incredulously. The child simply gazes back at him before continuing on his way, his underpants still humorously positioned around his armpits. Willie watches the boy with a doleful expression before turning back to Marcus, who regards him with a notably deadpan expression, particularly for an elf-like character. Finally, Gin is next in line at the bar, where he is joined by Willie and Marcus, the latter shifting uneasily on his seat."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Outside a robust and sturdy door, a tall security guard with fair hair stands vigilantly on duty, exuding an air of attentiveness. He occasionally glances down at his watch with a practiced, almost rhythmic motion. In the quieter, more secluded confines of a back room, Willie is busy with his tasks, placing a sizable sack down with a sense of purpose, while Marcus gestures meaningfully toward an air conditioning vent located nearby. Marcus skillfully removes the vent cover with practiced ease, hoists himself into the narrow, dark duct, and begins to navigate through it, clutching a small torch to illuminate his path as he progresses.\n\nIn a nearby office, a man seated at his desk looks up curiously toward the ductwork as peculiar noises emanate from above, catching his attention. A woman, also working diligently at her desk, does the same, her curiosity piqued by the strange sounds. Another woman, positioned at an adjacent desk, glances up at the source of the noise, then casually turns around to examine the duct. She shrugs in a nonchalant, dismissive manner and returns to her tasks, seemingly unbothered.\n\nMarcus eventually arrives at another vent and peers through it, taking in the view of a bustling security office filled with an array of monitors and various pieces of equipment. He carefully observes the setup with keen attention and takes detailed notes on a small notepad. Meanwhile, Gin, indulging in a moment of self-care, is having a pedicure when his phone rings. He answers it with a mix of surprise and interest. Roger Merriman, the father of a young child, is currently serving time in prison. Gin then enters the stark, unwelcoming visitors' room at the penitentiary, where Roger, noticeably balding and wearing glasses, sits waiting with an air of expectancy. Gin nods his head in acknowledgment and rises from his seat, a gesture that is met with Roger's slightly confused expression.\n\nIn a different setting, Willie is in the process of preparing a meal for the kid and Grandma, diligently cooking and serving the food with care. He adds a generous spoonful of something onto the dish, enhancing its flavor. He then turns back to the stove momentarily, flipping a slice of bologna with precision, which he proceeds to serve on a plate for himself, styled to resemble a North Pole delicacy, and places it on the breakfast bar invitingly. The young child sets off to collect it, handing the plate to Willie, who promptly returns it to the child. The child struggles slightly with a door that seems stubbornly stuck, likely due to an excessive amount of adhesive, but perseveres. Willie watches as the child discovers a cheap sweet inside, a small reward for his efforts.\n\nElsewhere, Bob joins Gin, who is in the process of mixing and reluctantly slurping down a dose of Fibracell stool softener, grimacing at the unpleasant taste while Bob cringes sympathetically nearby. Outside, a bus pulls up in front of the bustling mall, and a group of skaterats spots the child as he disembarks at the bus stop. Observing them, the kid hesitates for a moment, a flicker of uncertainty crossing his face, before deciding to walk determinedly down the street, with the skaterats following maliciously in his wake. They catch up to him, taunting him cruelly, and the boy eventually wanders off, a Santa nearby scratching absent-mindedly. The kid appears with his trousers humorously pulled up to his armpits, creating quite a comical sight. Marcus departs the scene while Willie, observing the kid, stares in disbelief, shaking his head incredulously at the amusing spectacle. The child simply gazes back at him before continuing on his way, his underpants still humorously positioned around his armpits. Willie watches the boy with a doleful expression before turning back to Marcus, who regards him with a notably deadpan expression, particularly for an elf-like character. Finally, Gin is next in line at the bar, where he is joined by Willie and Marcus, the latter shifting uneasily on his seat, adding to the atmosphere."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Outside a door, a tall, blonde security guard stands vigilantly on duty, casting occasional glances at his wristwatch to keep track of time. In a hidden back room, Willie carefully lowers a sack to the floor, while Marcus gestures purposefully toward an air conditioning vent. Marcus then methodically removes the cover from the vent, hoisting himself up with effort to enter the duct. As he clambers in, he clutches a torch tightly to illuminate his path, crawling cautiously along the confined space. In the nearby office, a man sits at his desk when sudden noises draw his attention upwards to the ceiling duct, causing a woman engrossed in her tasks at an adjacent desk to also look up, curious. Another woman at the next desk momentarily diverts her gaze to the duct, registers the noise with a nonchalant shrug, and returns to her work without further concern. Meanwhile, Marcus continues on his journey through the ducts until he reaches a strategic location where he peers through a vent, observing a security office brimming with monitors. He takes in the array of equipment intently, jotting down detailed notes on a pad for future reference. Simultaneously, Gin indulges in a leisurely pedicure session when his phone rings, prompting him to answer. In the grim confines of a prison, Roger Merriman, the kid's father, sits balding and bespectacled, waiting in the visitors' room as Gin enters. With a subtle nod of acknowledgment, Gin rises to leave while Roger's expression remains puzzled by the interaction. Back at home, Willie busies himself in the kitchen, cooking for the kid and Grandma. He meticulously serves up a portion, adding a dollop with care before returning to the stove to deftly flip the sizzling bologna. Once satisfied, he prepares a plate of North Pole-style fried bologna for himself and places it on the breakfast bar. The kid, eager, approaches to retrieve it but struggles with a sticky door, attempting to open it as if hindered by excessive adhesive. As Willie watches, the kid discovers a cheap sweet inside, much to Willie's mixed amusement and bemusement. Elsewhere, Bob accompanies Gin, who nonchalantly mixes a dose of Fibracell stool softener, gulping it down with a grimace while Bob winces in shared discomfort. Outside the bustling mall, a bus arrives at the stop, catching the attention of lurking skaterats as they spot the kid disembarking. Sensing potential trouble, the kid hesitates momentarily before resolutely continuing down the street, aware of the skaterats tracking him with malicious intent. They eventually catch up, surrounding him, and grot him. The boy manages to wander off afterward, as Santa stands nearby, scratching his own ass, seemingly oblivious while the kid reappears with his pants awkwardly hiked up to his armpits. With a resigned expression, Marcus prepares to depart as Willie, still staring incredulously at the kid's peculiar attire, shakes his head in disbelief. The kid merely stares back before nonchalantly walking away, leaving Willie to watch him go with a doleful look. Willie then turns back to Marcus, who regards him with the solemn, deadpan demeanor befitting an elf. In the bar, Gin stands next in line, joining Willie and Marcus, while Marcus shifts uneasily, the tension palpable among them."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Outside a door, a tall, blonde security guard checks his watch. In a back room, Willie puts down a sack as Marcus points to an air conditioning vent, removes the cover, and crawls through the duct with a torch. In an office, people notice noises from the duct but then resume their work. Marcus reaches a vent, observes a security office, and makes notes on a pad. Meanwhile, Gin, having a pedicure, answers his phone and later visits Roger Merriman, the kid's dad, in prison, where Roger looks confused as Gin acknowledges him with a nod. Willie prepares and serves meals to the kid and Grandma, then cooks North Pole-style fried bologna for himself. The kid attempts to open a door stuck with adhesive, finds a sweet inside, and shares a moment with Willie before leaving. Bob watches as Gin grimaces while mixing and drinking Fibracell stool softener. Outside the mall, skaterats see the kid getting off a bus, follow him, and eventually confront him. The kid wanders away as Santa scratches himself, appearing with his pants up high, prompting Willie to watch incredulously. Marcus leaves while Willie and the kid share a stare before the kid departs with his underpants still raised. Willie, with a doleful expression, turns back to Marcus, who regards him with a deadpan expression. Later, Gin, Willie, and Marcus are in a bar where Marcus shifts uneasily."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Outside a door of the shopping mall, which is known for its high-end stores, a tall, blonde security guard is on duty and checks his watch, a Rolex Submariner known for its durability and style. In a back room, Willie puts a sack down while Marcus points to an air conditioning vent, a common target in heist scenarios because of its metal structure that can easily be manipulated. Marcus removes the cover from the vent, clambers into the duct, and crawls along it clutching a torch, a high-lumen flashlight favored by professionals for its brightness and reliability. In an office, a man looks up at the duct as noises emanate from it, the clattering echoing in the quiet space, and a woman working at her desk also looks up, along with a woman at the next desk who then turns around, looks at the duct, shrugs, and resumes her work, accustomed to strange noises in the old, temperamental building's ventilation system. Marcus arrives at a vent and observes a security office filled with monitors, displaying live feeds from various cameras around the mall, looks at the equipment, and makes notes on a pad, recording each camera's blind spots methodically. Meanwhile, Gin is having a pedicure at Luxe Nails, a popular nail salon for the affluent, and answers his phone. Roger Merriman, the kid's dad, is in prison for a series of bank robberies, and Gin walks into the prison visitors' room where Roger, who is balding and bespectacled, is sitting. Gin nods his head and gets up as Roger looks confused, the brief interaction raising more questions than it answers. Willie cooks for the kid and Grandma, serves it up, spoons a dollop onto it, turns back to the stove to flip the bologna, and serves a plate of North Pole-style fried bologna for himself, a dish inspired by the harsh winters of Alaska, placing it on the breakfast bar. The kid heads off to get it, hands it to Willie, who gives it back to the kid struggling to open the door, which appears to have been stuck with excessive adhesive, a makeshift security measure grandma uses to feel safe. Willie watches as the kid finds a cheap sweet inside, an unexpected treat that reveals a softer side to the gruff atmosphere. Bob is with Gin, who mixes and slurps a dose of Fibracell stool softener, grimacing as Bob winces, knowing the effects are both immediate and uncomfortable. A bus pulls up outside the mall, a public transport hub bustling with activity, and skaterats see the kid getting off at the stop. The kid sees them, hesitates, then walks down the street, lined with shops closing for the evening, with the skaterats following maliciously. They get him and grot him, a slang term for mugging originating in the local dialect. The boy wanders off as Santa, the mall's seasonal worker, scratches his own ass, oblivious to the chaos outside, and the kid appears with his pants around his armpits, a comical sight that elicits smirks from passersby. Marcus heads off while Willie looks at the kid, stares incredulously, shakes his head, and the kid just stares back, the bizarre scene frozen in time before walking away with his underpants still around his armpits. Willie watches him go with a doleful expression and turns back to Marcus, who stares at him with a very deadpan expression for an elf, his costume adding to the surreal atmosphere. Gin is next in line, and Gin, Willie, and Marcus are in a bar known for its cheap drinks and loud patrons, where Marcus shifts uneasily, aware of the unpredictable nature of the night ahead."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Outside a door a tall blonde security guard is on duty and checks his watch. In a back room Willie puts a sack down while Marcus points to an air conditioning vent. Marcus removes the cover from the vent clambers into the duct and crawls along it clutching a torch. In an office a man looks up at the duct as noises emanate from it and a woman working at her desk also looks up along with a woman at the next desk who then turns around looks at the duct shrugs and resumes her work. Marcus arrives at a vent and observes a security office filled with monitors looks at the equipment and makes notes on a pad. Meanwhile Gin is having a pedicure and answers his phone. Roger Merriman the kid's dad is in prison and Gin walks into the prison visitors' room where Roger who is balding and bespectacled is sitting. Gin nods his head and gets up as Roger looks confused. Willie cooks for the kid and Grandma serves it up spoons a dollop onto it turns back to the stove to flip the bologna and serves a plate of North Polestyle fried bologna for himself placing it on the breakfast bar. The kid heads off to get it hands it to Willie who gives it back to the kid struggling to open the door which appears to have been stuck with excessive adhesive. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Willie watches as the kid finds a cheap sweet inside. Bob is with Gin who mixes and slurps a dose of Fibracell stool softener grimacing as Bob winces. A bus pulls up outside the mall and skaterats see the kid getting off at the stop. The kid sees them hesitates then walks down the street with the skaterats following maliciously. They get him and grot him. The boy wanders off as Santa scratches his own ass and the kid appears with his pants around his armpits. Marcus heads off while Willie looks at. the kid stares incredulously shakes his head and the kid just stares back before walking away with his underpants still around his armpits. Willie watches him go with a doleful expression and turns back to Marcus who stares at him with a very deadpan expression for an elf. Gin is next in line and Gin. Willie and Marcus are in a bar where Marcus shifts uneasily."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Outside a door a tall blonde security guard is on duty and checks his watch. In a back room Willie puts a sack down while Marcus points to an air conditioning vent. Marcus removes the cover from the vent clambers into the duct and crawls along it clutching a torch. In an office a man looks up at the duct as noises emanate from it and a woman working at her desk also looks up along with a woman at the next desk who then turns around looks at the duct shrugs and resumes her work. Marcus arrives at a vent and observes a security office filled with monitors looks at the equipment and makes notes on a pad. Meanwhile Gin is having a pedicure and answers his phone. Roger Merriman the kid's dad is in prison and Gin walks into the prison visitors' room where Roger who is balding and bespectacled is sitting. Gin nods his head and gets up as Roger looks confused. Willie cooks for the kid and Grandma serves it up spoons a dollop onto it turns back to the stove to flip the bologna and serves a plate of North Polestyle fried bologna for himself placing it on the breakfast bar. The kid heads off to get it hands it to Willie who gives it back to the kid struggling to open the door which appears to have been stuck with excessive adhesive. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Willie watches as the kid finds a cheap sweet inside. Bob is with Gin who mixes and slurps a dose of Fibracell stool softener grimacing as Bob winces. A bus pulls up outside the mall and skaterats see the kid getting off at the stop. The kid sees them hesitates then walks down the street with the skaterats following maliciously. They get him and grot him. The boy wanders off as Santa scratches his own ass and the kid appears with his pants around his armpits. Marcus heads off while Willie looks at. the kid stares incredulously shakes his head and the kid just stares back before walking away with his underpants still around his armpits. Willie watches him go with a doleful expression and turns back to Marcus who stares at him with a very deadpan expression for an elf. Gin is next in line and Gin. Willie and Marcus are in a bar where Marcus shifts uneasily."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Outside a door a tall blonde security guard is on duty and checks his watch. In a back room Willie puts a sack down while Marcus points to an air conditioning vent. Marcus removes the cover from the vent clambers into the duct and crawls along it clutching a torch. In an office a man looks up at the duct as noises emanate from it and a woman working at her desk also looks up along with a woman at the next desk who then turns around looks at the duct shrugs and resumes her work. Marcus arrives at a vent and observes a security office filled with monitors looks at the equipment and makes notes on a pad. The boy wanders off as Santa scratches his own ass and the kid appears with his pants around his armpits. Marcus heads off while Willie looks at. the kid stares incredulously shakes his head and the kid just stares back before walking away with his underpants still around his armpits. Willie watches him go with a doleful expression and turns back to Marcus who stares at him with a very deadpan expression for an elf. Gin is next in line and Gin. Willie and Marcus are in a bar where Marcus shifts uneasily."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Outside a door a tall blonde security guard is on duty and checks his watch. In a back room Willie puts a sack down while Marcus points to an air conditioning vent. Willie watches him go with a doleful expression and turns back to Marcus who stares at him with a very deadpan expression for an elf. Gin is next in line and Gin. Willie and Marcus are in a bar where Marcus shifts uneasily."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Outside a portal, a short, red-haired firefighter is on patrol and adjusts his glasses. In a front yard, Benny places a crate down while Leo gestures toward a ceiling fan. Leo dismantles the blade from the fan, leaps into the hammock, and slides across it holding a lantern. In a cubicle, a woman glances up at the hammock as sounds resonate from it, and a man typing at his computer also glances up, along with a man at the adjacent station who then spins around, peers at the hammock, sighs, and returns to his typing. Leo reaches a curtain and examines a janitor's closet stuffed with brooms, scans the supplies, and sketches in a notebook. Meanwhile, Tim is watching a movie and ignores a text message. Walter Brinkman, the cat's owner, is at a theme park, and Tim strolls into the theme park visitors' lounge where Walter, who is tall and wearing sunglasses, is lounging. Tim shakes his fists and sits down as Walter appears intrigued. Benny bakes for the cat and Grandpa, slices it up, drizzles syrup onto it, turns back to the oven to rotate the lasagna, and serves a tray of South Pole-style roasted lasagna for himself, setting it on the dining table. The cat saunters over to fetch it, passes it to Benny, who hands it back to the cat struggling to close the window, which seems to have been sealed with excessive tape. Benny observes as the cat discovers a cheap trinket inside. Tom is with Tim, who blends and gulps a shot of Fibracell cough syrup, cringing as Tom winces. A train arrives outside the theater, and ballerinas observe the cat disembarking at the platform. The cat notices them, pauses, then skips down the alley, with the ballerinas trailing mischievously. They catch him and tickle him. The boy meanders away as an actor scratches his chin, and the cat appears with his tie around his knees. Leo proceeds while Benny gazes at the cat, blinks incredulously, shakes his foot, and the cat just gazes back before drifting away with his necktie still around his knees. Benny watches him depart with a wistful expression and turns back to Leo, who gazes at him with a very impassive expression for a jester. Tim is next in sequence, and Tim, Benny, and Leo are in a café, where Leo fidgets awkwardly."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Outside a door, a tall, blonde security guard checks his watch. In a back room, Willie drops a sack as Marcus points to an air conditioning vent, climbs in, and crawls through with a torch. In an office, a man and two women notice the noise from the duct. Marcus reaches a vent overlooking a security office with monitors, makes notes, and observes the equipment. Meanwhile, Gin receives a pedicure, answers his phone, and visits Roger, the kid's dad, in prison, who looks confused by Gin's nod. Willie cooks for the kid and Grandma, serving North Pole-style fried bologna. The kid struggles with a door stuck by excessive adhesive and finds a cheap sweet inside with Willie watching. Bob winces as Gin slurps Fibracell stool softener. A bus stops at the mall, and the skaterats maliciously follow the kid getting off. They catch him, and Santa scratches himself. Marcus departs as Willie watches the kid with his pants around his armpits and shakes his head. Willie then turns back to Marcus, who has a deadpan expression. Gin, Willie, and Marcus gather in a bar, and Marcus shifts uneasily."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Willie and Marcus are in a bar where Marcus shifts uneasily Gin is next in line and Gin Willie watches him go with a doleful expression and turns back to Marcus who stares at him with a very deadpan expression for an elf the kid stares incredulously shakes his head and the kid just stares back before walking away with his underpants still around his armpits Marcus heads off while Willie looks at The boy wanders off as Santa scratches his own ass and the kid appears with his pants around his armpits They get him and grot him The kid sees them hesitates then walks down the street with the skaterats following maliciously A bus pulls up outside the mall and skaterats see the kid getting off at the stop Bob is with Gin who mixes and slurps a dose of Fibracell stool softener grimacing as Bob winces Willie watches as the kid finds a cheap sweet inside The kid heads off to get it hands it to Willie who gives it back to the kid struggling to open the door which appears to have been stuck with excessive adhesive Willie cooks for the kid and Grandma serves it up spoons a dollop onto it turns back to the stove to flip the bologna and serves a plate of North Polestyle fried bologna for himself placing it on the breakfast bar Gin nods his head and gets up as Roger looks confused Roger Merriman the kid's dad is in prison and Gin walks into the prison visitors' room where Roger who is balding and bespectacled is sitting Meanwhile Gin is having a pedicure and answers his phone Marcus arrives at a vent and observes a security office filled with monitors looks at the equipment and makes notes on a pad In an office a man looks up at the duct as noises emanate from it and a woman working at her desk also looks up along with a woman at the next desk who then turns around looks at the duct shrugs and resumes her work Marcus removes the cover from the vent clambers into the duct and crawls along it clutching a torch In a back room Willie puts a sack down while Marcus points to an air conditioning vent Outside a door a tall blonde security guard is on duty and checks his watch"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "In a back room Willie puts a sack down while Marcus points to an air conditioning vent Outside a door a tall blonde security guard is on duty and checks his watch In an office a man looks up at the duct as noises emanate from it and a woman working at her desk also looks up along with a woman at the next desk who then turns around looks at the duct shrugs and resumes her work Marcus removes the cover from the vent clambers into the duct and crawls along it clutching a torch Meanwhile Gin is having a pedicure and answers his phone Marcus arrives at a vent and observes a security office filled with monitors looks at the equipment and makes notes on a pad Gin nods his head and gets up as Roger looks confused Roger Merriman the kid's dad is in prison and Gin walks into the prison visitors' room where Roger who is balding and bespectacled is sitting The kid heads off to get it hands it to Willie who gives it back to the kid struggling to open the door which appears to have been stuck with excessive adhesive Willie cooks for the kid and Grandma serves it up spoons a dollop onto it turns back to the stove to flip the bologna and serves a plate of North Polestyle fried bologna for himself placing it on the breakfast bar Bob is with Gin who mixes and slurps a dose of Fibracell stool softener grimacing as Bob winces Willie watches as the kid finds a cheap sweet inside The kid sees them hesitates then walks down the street with the skaterats following maliciously A bus pulls up outside the mall and skaterats see the kid getting off at the stop The boy wanders off as Santa scratches his own ass and the kid appears with his pants around his armpits They get him and grot him the kid stares incredulously shakes his head and the kid just stares back before walking away with his underpants still around his armpits Marcus heads off while Willie looks at Gin is next in line and Gin Willie watches him go with a doleful expression and turns back to Marcus who stares at him with a very deadpan expression for an elf Willie and Marcus are in a bar where Marcus shifts uneasily"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Bob is with Gin who mixes and slurps a dose of Fibracell stool softener grimacing as Bob winces A bus pulls up outside the mall and skaterats see the kid getting off at the stop The kid sees them hesitates then walks down the street with the skaterats following maliciously They get him and grot him The boy wanders off as Santa scratches his own ass and the kid appears with his pants around his armpits Marcus heads off while Willie looks at the kid stares incredulously shakes his head and the kid just stares back before walking away with his underpants still around his armpits Willie watches him go with a doleful expression and turns back to Marcus who stares at him with a very deadpan expression for an elf Gin is next in line and Gin Willie and Marcus are in a bar where Marcus shifts uneasily Outside a door a tall blonde security guard is on duty and checks his watch In a back room Willie puts a sack down while Marcus points to an air conditioning vent Marcus removes the cover from the vent clambers into the duct and crawls along it clutching a torch In an office a man looks up at the duct as noises emanate from it and a woman working at her desk also looks up along with a woman at the next desk who then turns around looks at the duct shrugs and resumes her work Marcus arrives at a vent and observes a security office filled with monitors looks at the equipment and makes notes on a pad Meanwhile Gin is having a pedicure and answers his phone Roger Merriman the kid's dad is in prison and Gin walks into the prison visitors' room where Roger who is balding and bespectacled is sitting Gin nods his head and gets up as Roger looks confused Willie cooks for the kid and Grandma serves it up spoons a dollop onto it turns back to the stove to flip the bologna and serves a plate of North Polestyle fried bologna for himself placing it on the breakfast bar The kid heads off to get it hands it to Willie who gives it back to the kid struggling to open the door which appears to have been stuck with excessive adhesive Willie watches as the kid finds a cheap sweet inside"
        }
      ]
    }
  ]
}