{
  "ground_truth": "Rows of old film studio buildings are reflected in a shiny, gold surface, followed by a shaky animation of a figure wearing a long coat and a hat. The figure runs towards light, and its arms spread out, becoming wings as it takes flight and, as a bird, comes to rest. Al-Saleem, a bearded man wearing a loose-fitting robe and a pale cream cap, appears in a house where three young Middle Eastern men listen to him on a television. Meanwhile, on a cordoned-off street, a policeman pats the roof of a milk float that then drives off. Armed special branch officers in black run across wasteland as more officers huddle on a street corner while the milk float drives around. Officers make their way upstairs at the back of a boarded-up house and train their automatic weapons on the front of the terraced house. The Sikh milkman stops to pick up some pints of milk, and a marksman on the roof takes aim. Daylight floods through windows into the gloomy house as the milkman walks up to the front door, placing two pints of milk on the doorstep. One of the armed officers opens the back door and enters, alerting the three men inside. Bomb-making equipment is spread out on a table, and one of the men presses a key on a mobile phone, triggering a golden fireball that rips through the building. Police and civilians dive for cover as debris rains down, thick gray smoke fills the air, and plumes of smoke rise. Letters emerge from brief flashes of grainy surveillance footage of densely packed buildings bisected by streets. A casually dressed young man with a beard, Ferris, lies on a bed, deep in troubled thought with a pinched brow as he recalls sitting in a room watching a prisoner gagged and beaten to death with a cricket bat. In a large house, a craggy-faced man in his 40s, Edward Hoffman, dictates into a laptop while on TV. Ferris cocks a pistol in a meeting room. A car is blown up, and a soldier is shot as Hoffman talks to officials. Ferris, wearing jeans, a shirt, a casual top, and a baseball cap, sits at an Iraqi street cafe sipping coffee when a four-by-four pulls up. The driver, Bassam, with long black hair in a ponytail, yells to Ferris, who picks up his bag and coffee and gets in the four-by-four. Ferris sips his coffee as Bassam drives to a checkpoint on a dirt road where they're watched. Ferris looks at a stone house through binoculars, with goats swarming around in front. Bassam calls on his mobile while they're watched on a screen in a CIA surveillance room.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Lines of ancient cinema studio structures are mirrored in a lustrous, golden facade, succeeded by an unsteady cartoon of a silhouette donning a lengthy coat and a hat. The silhouette dashes towards illumination, and its limbs extend, transforming into appendages as it ascends and, as a fowl, settles. Al-Saleem, a whiskered gentleman clad in a loose garment and a light cream cap, emerges in a dwelling where three youthful Middle Eastern males heed him on a television. Meanwhile, on a cordoned-off avenue, a lawman taps the top of a milk vehicle that then moves away. Armed special division agents in dark sprint across wasteland as additional agents cluster on a street intersection while the milk vehicle maneuvers around. Agents make their way upstairs at the rear of a barricaded house and target their automatic arms on the facade of the lined house. The Sikh dairyman halts to collect some quarts of milk, and a sharpshooter on the rooftop takes aim. Sunlight floods through panes into the dim abode as the dairyman approaches the main entryway, placing two quarts of milk on the threshold. One of the armed agents opens the rear portal and enters, alerting the three males inside. Explosive equipment is spread out on a table, and one of the males presses a button on a cell phone, triggering a golden explosion that tears through the structure. Law enforcement and civilians dive for shelter as fragments rain down, thick gray fumes fill the atmosphere, and plumes of smoke ascend. Characters materialize from brief flashes of grainy observation footage of densely packed edifices intersected by roadways. A casually attired young gentleman with a beard, Ferris, reclines on a bed, deep in disturbed reflection with a furrowed brow as he recalls sitting in a chamber observing a captive gagged and bludgeoned to death with a cricket club. In a large abode, a rugged-faced gentleman in his 40s, Edward Hoffman, dictates into a laptop while on TV. Ferris cocks a handgun in a conference chamber. An automobile is blown up, and a trooper is shot as Hoffman talks to authorities. Ferris, wearing jeans, a shirt, a casual top, and a baseball cap, sits at an Iraqi street café sipping coffee when a four-by-four pulls up. The operator, Bassam, with lengthy black hair in a ponytail, yells to Ferris, who retrieves his satchel and coffee and enters the four-by-four. Ferris sips his coffee as Bassam navigates to a checkpoint on a dirt path where they're observed. Ferris examines a stone dwelling through field glasses, with goats swarming around in front. Bassam calls on his cell while they're observed on a screen in a CIA observation room."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Rows of old film studio buildings reflect in a shiny, gold surface, and a shaky animation of a figure wearing a long coat and a hat follows. Light is run towards by the figure, and its arms are spread out, becoming wings as flight is taken and, as a bird, it comes to rest. In a house, Al-Saleem, a bearded man wearing a loose-fitting robe and a pale cream cap, appears where three young Middle Eastern men watch him on a television. Meanwhile, on a cordoned-off street, the roof of a milk float is patted by a policeman, and it then drives off. Armed special branch officers in black run across wasteland as more officers huddle on a street corner while the milk float is driven around. Their way upstairs is made by officers at the back of a boarded-up house, and they train their automatic weapons on the front of the terraced house. Pints of milk are picked up by the Sikh milkman, and a marksman on the roof takes aim. Windows flood daylight into the gloomy house as the milkman walks up to the front door, placing two pints of milk on the doorstep. The back door is opened by one of the armed officers, who enters and alerts the three men inside. Bomb-making equipment has been spread out on a table, and a key on a mobile phone is pressed by one of the men, triggering a golden fireball that rips through the building. Police and civilians dive for cover as debris rains down, thick gray smoke fills the air, and plumes of smoke rise. Grainy surveillance footage of densely packed buildings bisected by streets briefly flashes, and letters emerge. A casually dressed young man with a beard, Ferris, lies on a bed, deep in troubled thought with a pinched brow as he recalls sitting in a room where he watched a prisoner gagged and beaten to death with a cricket bat. In a large house, Edward Hoffman, a craggy-faced man in his 40s, dictates into a laptop while a TV is on. In a meeting room, Ferris cocks a pistol. Someone blows up a car, and another person shoots a soldier as Hoffman talks to officials. At an Iraqi street cafe, Ferris, wearing jeans, a shirt, a casual top, and a baseball cap, sits sipping coffee when a four-by-four pulls up. Bassam, with long black hair in a ponytail, drives the car and yells to Ferris, who picks up his bag and coffee and gets into the four-by-four. As Bassam drives to a checkpoint on a dirt road where they're watched, Ferris sips his coffee. Through binoculars, Ferris looks at a stone house with goats swarming around in front. While watched on a screen in a CIA surveillance room, Bassam calls on his mobile."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Old film studio buildings reflect in a shiny gold surface, followed by a shaky animation of a figure in a coat and hat running toward light. The figure's arms spread into wings as it transforms into a bird. Al-Saleem, with a beard, robe, and cream cap, appears on TV in a house with three young Middle Eastern men. On a cordoned street, a policeman pats a milk float, which drives off as armed officers run across wasteland and gather on a corner. Officers ascend a boarded-up house, aiming weapons at the terraced house's front. A Sikh milkman stops for milk pints; a marksman aims from the roof. Daylight floods a gloomy house as the milkman places milk on the doorstep. An officer enters through the back, alerting the men inside. Bomb-making equipment lies on a table, and a man presses a phone key, triggering an explosion. Police and civilians dive for cover amid debris and smoke. Letters appear in grainy footage of packed buildings. A bearded young man, Ferris, lies on a bed, recalling a prisoner beaten to death. In a large house, Edward Hoffman, craggy-faced, dictates into a laptop. Ferris cocks a pistol in a meeting room. A car is blown up, and a soldier is shot as Hoffman talks to officials. Ferris, wearing casual clothes and a cap, sits in an Iraqi cafe. Bassam, with long hair, arrives in a four-by-four, picking up Ferris, who sips coffee as they drive to a checkpoint. Ferris looks at a stone house, goats swarming outside, as they are monitored from a CIA room."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Old film studio buildings reflect in a shiny, gold surface, followed by an animation of a figure in a long coat and hat. The figure runs towards light, transforms into a bird, and lands. Al-Saleem, a bearded man in a loose robe and cream cap, is on TV speaking to three young Middle Eastern men. On a cordoned street, a policeman sends a milk float off. Armed officers run across wasteland as others huddle at a street corner, while a marksman on a roof aims. The Sikh milkman places milk on a doorstep as an officer enters and alerts the three men inside. Bomb-making equipment lies on a table; a man triggers an explosion with a key press, causing debris and smoke. Letters appear from surveillance footage of buildings and streets. A young man, Ferris, lies in troubled thought, recalling a prisoner beaten to death. Edward Hoffman, a craggy-faced man in his 40s, dictates into a laptop. Ferris cocks a pistol; a car explodes, a soldier is shot, and Hoffman talks to officials. Ferris, in casual wear, sits at an Iraqi cafe when Bassam, with long hair, pulls up in a four-by-four. Ferris leaves with him to a checkpoint, watching a stone house and goats through binoculars, while being monitored from a CIA surveillance room."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Rows upon rows of timeworn film studio buildings cast their reflections on a lustrous, golden surface, which is immediately followed by a somewhat shaky animation depicting a mysterious figure clad in a long coat and a hat. The figure is seen hastening towards a source of light, and as it does so, the arms of the figure spread wide, transforming into wings that allow it to take flight. This figure, now a bird, comes to a gentle rest. Al-Saleem, a man with a distinct beard, dressed in a loose-fitting robe accompanied by a pale cream cap, makes his appearance inside a house. Within this house, three young Middle Eastern men are observed intently listening to him through the television. Meanwhile, on a nearby street that has been cordoned off, a policeman gives a reassuring pat on the roof of a milk float, which then begins to drive away. Armed officers from the special branch, all dressed in black, are seen running across a barren wasteland. Simultaneously, additional officers are huddled together on a street corner as the milk float continues its path. A group of officers cautiously proceed upstairs at the rear of a boarded-up house, training their automatic weapons on the front of the terraced house. The Sikh milkman, methodically making his rounds, pauses to pick up a few pints of milk, and elsewhere, a marksman takes precise aim from atop a roof. Daylight washes into the dim house through windows as the milkman approaches the front door, carefully placing two pints of milk on the doorstep. An armed officer then quietly opens the back door and steps inside, alerting the three men present. Spread out on a table before them is bomb-making equipment, and one of the men presses a key on a mobile phone, setting off a resplendent golden fireball that tears through the structure. Police and civilians alike instinctively dive for cover as debris begins to rain down, while thick gray smoke rapidly engulfs the air, with plumes of it rising into the atmosphere. Letters gradually emerge from brief, flickering frames of grainy surveillance footage depicting tightly packed buildings, divided by intersecting streets. We then see Ferris, a young man dressed in casual attire, with a beard, lying on a bed, deeply immersed in troubled thoughts, his brow furrowed as he vividly recalls the harrowing moment of watching a prisoner being gagged and brutally beaten to death with a cricket bat in a room. In the spacious confines of a large house, a man in his 40s with a rugged face, Edward Hoffman, is seen dictating into a laptop while also appearing on TV. Ferris, in a meeting room, cocks a pistol with determination. A car erupts in an explosion, and a soldier is fatally shot as Hoffman continues his discussions with officials. Ferris, comfortably dressed in jeans, a shirt, a casual top, and topped with a baseball cap, sits at a street cafe in Iraq, leisurely sipping coffee when a four-by-four vehicle pulls up nearby. The driver, named Bassam, sporting long black hair tied neatly into a ponytail, calls out to Ferris, who promptly gathers his bag and coffee before getting into the four-by-four. As Bassam drives toward a checkpoint situated on a dirt road, Ferris continues sipping his coffee while they are being watched. Through binoculars, Ferris fixes his gaze on a stone house, observing the goats that swarm around in front of it. Bassam uses his mobile phone to make a call while they remain under the watchful eye of a CIA surveillance room, where they are scrutinized on a screen."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Stretching across the landscape are rows upon rows of timeworn film studio buildings, their aged facades reflecting onto a lustrous, golden surface, creating an almost otherworldly tableau. Immediately following this, we are introduced to a somewhat shaky but intriguing animation that portrays a mysterious figure. This enigmatic figure, draped in a long coat and topped with a hat, is seen making a hurried approach towards a bright source of light. As the figure strides forward, its arms dramatically spread wide, transforming in a magical metamorphosis into wings, allowing it to soar into the sky. The figure, now elegantly transformed into a bird, comes to a gentle rest. In another scene, Al-Saleem, a man distinguished by his unique beard and attire—a loose-fitting robe paired with a pale cream cap—makes his entrance within the confines of a house. Inside this residence, three young Middle Eastern men are portrayed as paying close attention to him through their television set. \n\nMeanwhile, on a nearby street that has been securely cordoned off, a policeman is seen giving a reassuring pat on the roof of a milk float, which subsequently begins to make its way down the road. At the same time, armed officers from the special branch, all dressed in their uniform black attire, are observed sprinting across a barren and desolate wasteland. Simultaneously, additional officers gather together in a huddle on a street corner as the milk float continues along its path. A group of officers, moving cautiously, ascend the stairs at the rear of a boarded-up house, carefully training their automatic weapons on the front of the terraced house. A Sikh milkman, methodically making his usual rounds, pauses momentarily to pick up a few pints of milk, while elsewhere, a marksman takes precise aim from his vantage point on a rooftop. As daylight washes into the dimly lit house through its windows, the milkman approaches the front door, meticulously placing two pints of milk on the doorstep. An armed officer then discreetly opens the back door and steps inside, taking care to alert the three men present. Spread out before them on a table is an arrangement of bomb-making equipment, and one of the men presses a key on a mobile phone, detonating a magnificent golden fireball that rips through the structure. Both police and civilians instinctively dive for cover as debris rains down from above, while thick gray smoke quickly fills the air, its plumes rising ominously into the atmosphere.\n\nIn subsequent frames of grainy surveillance footage that depict tightly packed buildings intersected by streets, letters gradually begin to emerge from the brief, flickering images. We then transition to Ferris, a young man with a beard, dressed in casual attire, lying on a bed. He is deeply immersed in troubled thoughts, his brow furrowed as he vividly recalls the harrowing and brutal moment of witnessing a prisoner being gagged and savagely beaten to death with a cricket bat in a room. In the spacious interior of a large house, a rugged-faced man in his 40s, identified as Edward Hoffman, is seen dictating into a laptop while also appearing on TV. In a meeting room, Ferris energetically cocks a pistol, his determination evident. A car bursts into a fiery explosion, and a soldier is tragically shot as Hoffman continues his discussions with officials. Ferris, comfortably dressed in jeans, a shirt, and a casual top, with a baseball cap completing his look, sits at a street cafe in Iraq. He leisurely sips coffee when a four-by-four vehicle pulls up nearby. The driver, Bassam, characterized by his long black hair neatly tied into a ponytail, calls out to Ferris, who quickly gathers his bag and coffee before getting into the vehicle. As Bassam drives towards a checkpoint situated on a dusty dirt road, Ferris continues sipping his coffee, aware that they are being closely monitored. Through binoculars, Ferris fixes his gaze on a stone house, keenly observing the goats that swarm around its front. Bassam uses his mobile phone to make a call while they remain under the vigilant watch of a CIA surveillance room, where their every move is scrutinized on a screen."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Rows of old film studio buildings stand tall, their aged structures vividly mirrored in a pristine, gold surface, capturing the glint of sunlight. Following this serene reflection, a sudden, shaky animation emerges, depicting a figure clad in a long coat and a hat. This figure begins to move with increasing speed, dashing toward a distant source of light. As it propels forward, its arms extend outward, transforming into wings that grant it the power of flight. This animated being, now a bird, glides gracefully through the air before gently coming to rest. Meanwhile, Al-Saleem, a man with a thick beard, enveloped in a loose-fitting robe and topped with a pale cream cap, unexpectedly appears inside a house. In this house, three young Middle Eastern men are intently focused on his presence as they watch him on the screen of a television. Concurrently, outside on a street sectioned off from the public, a policeman gives a reassuring pat on the roof of a milk float, which then starts to drive away. At the same time, armed officers clad in black, members of the special branch, sprint across an expanse of wasteland. More officers can be seen converging at a street corner, huddling together as the milk float continues its circuitous journey. The officers stealthily approach a boarded-up house, making their way up the stairs at the back of the building. From this vantage point, they aim their automatic weapons towards the front of a terraced house, standing poised for action. The Sikh milkman, making his daily rounds, pauses briefly to collect some pints of milk, while high above, a marksman positions himself on the roof, carefully taking aim. As daylight pours relentlessly through the windows of the dim house, the milkman approaches the front door, setting down two pints of milk on the doorstep. One of the armed officers quietly opens the back door, slipping inside and creating a stir among the three men inside. The table before them is cluttered with bomb-making equipment, and in a tense moment, one of the men presses a key on a mobile phone. This act triggers an explosive golden fireball that viciously tears through the building. Outside, police and civilians alike scramble for cover as debris rains down upon them, thick gray smoke rapidly filling the air, creating spiraling plumes that ascend ominously. In the midst of this chaos, letters materialize, emerging briefly from grainy flashes of surveillance footage depicting densely packed buildings divided by narrow streets. In a separate scene, a young man with a beard, Ferris, lies sprawled on a bed, his expression deeply troubled. His brow furrows as he recalls a haunting memory: sitting in a room where a prisoner was gagged and beaten to death with a cricket bat. Elsewhere, in a grand house, Edward Hoffman, a man in his 40s with a rugged face, diligently dictates into a laptop while a television murmurs on in the background. In a meeting room, Ferris methodically cocks a pistol, preparing for the next step. Outside, a car is violently blown up, and a soldier is shot, events unfolding as Hoffman consults with officials. Ferris, now dressed in jeans, a shirt, a casual top, and concealed under a baseball cap, sits at an Iraqi street café, leisurely sipping coffee. Suddenly, a four-by-four vehicle pulls up beside him. The driver, Bassam, his long black hair tied back in a ponytail, shouts out to Ferris. Without hesitation, Ferris gathers his belongings, encompassing his bag and coffee, and climbs into the four-by-four. As they drive, Ferris continues sipping his coffee while Bassam steers them toward a checkpoint situated on a dusty road. Here, they are keenly observed. Ferris raises a pair of binoculars to his eyes, peering through them to scrutinize a stone house that stands in the distance, surrounded by goats that swarm the front of it. Meanwhile, Bassam places a call on his mobile phone, fully aware that they are being watched on a screen within the confines of a CIA surveillance room."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Rows of old film studio buildings reflect in a shiny, gold surface, transitioning to a shaky animation of a figure whose arms transform into wings as it runs toward light and takes flight, eventually coming to rest as a bird. Al-Saleem, a bearded man in traditional attire, appears on a television watched by three young Middle Eastern men inside a house. Concurrently, a policeman on a cordoned-off street signals a milk float to drive on, while armed special branch officers coordinate their movements, some running across wasteland and others taking positions on a street corner. The officers advance up a boarded-up house, aiming their weapons at the front of a terraced house. As a Sikh milkman places milk on a doorstep, a marksman targets from a nearby roof. Inside the house, daylight illuminates the room as an armed officer enters through the back, alerting the three men. One of them detonates a golden fireball using a mobile phone, resulting in an explosion that sends debris raining down, causing police and civilians to dive for cover as thick smoke billows into the air. Grainy surveillance footage briefly reveals densely packed buildings bisected by streets. Ferris, a casually dressed young man, lies in bed, troubled by memories of witnessing a violent interrogation. Meanwhile, Edward Hoffman, a craggy-faced man in his 40s, dictates into a laptop while appearing on TV. Ferris, holding a pistol, witnesses a car explosion and a soldier being shot as Hoffman converses with officials. Later, Ferris, dressed casually, sits at an Iraqi street cafe with a coffee when Bassam, a ponytailed man driving a four-by-four, arrives. Ferris joins him, and they drive to a checkpoint, closely observed by a CIA surveillance room as Ferris uses binoculars to survey a stone house surrounded by goats."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Rows of old film studio buildings, remnants of a once-thriving movie production era in Hollywood, are reflected in a shiny, gold surface, followed by a shaky animation of a figure wearing a long coat and a hat, reminiscent of classic noir films. The figure runs towards light, and its arms spread out, becoming wings as it takes flight and, as a bird, comes to rest, an allusion to mythological stories of transformation. Al-Saleem, a bearded man wearing a loose-fitting robe and a pale cream cap, appears in a house where three young Middle Eastern men listen to him on a television, tuned to a channel known for broadcasting extremist rhetoric. Meanwhile, on a cordoned-off street, a policeman pats the roof of a milk float, a type of vehicle commonly used in the UK for delivering milk, that then drives off. Armed special branch officers, part of a counter-terrorism unit, in black run across wasteland as more officers huddle on a street corner while the milk float drives around, disguised as part of the operation. Officers make their way upstairs at the back of a boarded-up house, a common hideout for illicit activities, and train their automatic weapons on the front of the terraced house. The Sikh milkman, representing the diverse communities within the UK, stops to pick up some pints of milk, and a marksman on the roof takes aim. Daylight floods through windows into the gloomy house as the milkman walks up to the front door, placing two pints of milk on the doorstep, a routine symbolic of normalcy amidst chaos. One of the armed officers opens the back door and enters, alerting the three men inside. Bomb-making equipment is spread out on a table, indicative of a planned attack, and one of the men presses a key on a mobile phone, triggering a golden fireball that rips through the building. Police and civilians dive for cover as debris rains down, thick gray smoke fills the air, and plumes of smoke rise, echoing scenes of urban warfare. Letters emerge from brief flashes of grainy surveillance footage of densely packed buildings bisected by streets, typical of Middle Eastern cities like Baghdad. A casually dressed young man with a beard, Ferris, lies on a bed, deep in troubled thought with a pinched brow as he recalls sitting in a room watching a prisoner gagged and beaten to death with a cricket bat, a violent scene reminiscent of torture methods used in war zones. In a large house, a craggy-faced man in his 40s, Edward Hoffman, dictates into a laptop while on TV, possibly coordinating intelligence operations. Ferris cocks a pistol in a meeting room, preparing for an uncertain mission. A car is blown up, and a soldier is shot as Hoffman talks to officials, illustrating the volatile environment in conflict areas. Ferris, wearing jeans, a shirt, a casual top, and a baseball cap, sits at an Iraqi street cafe sipping coffee when a four-by-four, a common vehicle for rough terrain, pulls up. The driver, Bassam, with long black hair in a ponytail, yells to Ferris, who picks up his bag and coffee and gets in the four-by-four, ready for their next covert operation. Ferris sips his coffee as Bassam drives to a checkpoint on a dirt road where they're watched, a common security measure in conflict zones. Ferris looks at a stone house through binoculars, with goats swarming around in front, illustrating a typical rural Middle Eastern setting. Bassam calls on his mobile while they're watched on a screen in a CIA surveillance room, highlighting the global reach of intelligence networks."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Ferris wearing jeans a shirt a casual top and a baseball cap sits at an Iraqi street cafe sipping coffee when a fourbyfour pulls up Police and civilians dive for cover as debris rains down Rows of old film studio buildings are reflected in a shiny gold surface followed by a shaky animation of a figure wearing a long coat and a hat Armed special branch officers in black run across wasteland as more officers huddle on a street corner while the milk float drives around Daylight floods through windows into the gloomy house as the milkman walks up to the front door placing two pints of milk on the doorstep The figure runs towards light and its arms spread out becoming wings as it takes flight and as a bird comes to rest Meanwhile on a cordonedoff street a policeman pats the roof of a milk float that then drives off thick gray smoke fills the air and plumes of smoke rise The figure runs towards light and its arms spread out becoming wings as it takes flight and as a bird comes to rest AlSaleem a bearded man wearing a loosefitting robe and a pale cream cap appears in a house where three young Middle Eastern men listen to him on a television Meanwhile on a cordonedoff street a policeman pats the roof of a milk float that then drives off Armed special branch officers in black run across wasteland as more officers huddle on a street corner while the milk float drives around In a large house a craggyfaced man in his 40s Edward Hoffman dictates into a laptop while on TV Officers make their way upstairs at the back of a boardedup house and train their automatic weapons on the front of the terraced house The Sikh milkman stops to pick up some pints of milk and a marksman on the roof takes aim Daylight floods through windows into the gloomy house as the milkman walks up to the front door placing two pints of milk on the doorstep One of the armed officers opens the back door and enters alerting the three men inside Bombmaking equipment is spread out on a table and one of the men presses a key on a mobile phone triggering a golden fireball that rips through the building Police and civilians dive for cover as debris rains down thick gray smoke fills the air and plumes of smoke rise One of the armed officers opens the back door and enters alerting the three men inside Letters emerge from brief flashes of grainy surveillance footage of densely packed buildings bisected by streets A casually dressed young man with a beard Ferris lies on a bed deep in troubled thought with a pinched brow as he recalls sitting in a room watching a prisoner gagged and beaten to death with a cricket bat In a large house a craggyfaced man in his 40s Edward Hoffman dictates into a laptop while on TV Ferris cocks a pistol in a meeting room A car is blown up and a soldier is shot as Hoffman talks to officials Rows of old film studio buildings are reflected in a shiny gold surface followed by a shaky animation of a figure wearing a long coat and a hat Ferris looks at a stone house through binoculars with goats swarming around in front Ferris wearing jeans a shirt a casual top and a baseball cap sits at an Iraqi street cafe sipping coffee when a fourbyfour pulls up The driver Bassam with long black hair in a ponytail yells to Ferris who picks up his bag and coffee and gets in the fourbyfour Ferris sips his coffee as Bassam drives to a checkpoint on a dirt road where they are watched Ferris looks at a stone house through binoculars with goats swarming around in front Bassam calls on his mobile while they are watched on a screen in a CIA surveillance room"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Rows of old film studio buildings are reflected in a shiny gold surface followed by a shaky animation of a figure wearing a long coat and a hat. The figure runs towards light and its arms spread out becoming wings as it takes flight and as a bird comes to rest. AlSaleem a bearded man wearing a loosefitting robe and a pale cream cap appears in a house where three young Middle Eastern men listen to him on a television. Meanwhile on a cordonedoff street a policeman pats the roof of a milk float that then drives off. Armed special branch officers in black run across wasteland as more officers huddle on a street corner while the milk float drives around. Officers make their way upstairs at the back of a boardedup house and train their automatic weapons on the front of the terraced house. The Sikh milkman stops to pick up some pints of milk and a marksman on the roof takes aim. Daylight floods through windows into the gloomy house as the milkman walks up to the front door placing two pints of milk on the doorstep. One of the armed officers opens the back door and enters alerting the three men inside. Bombmaking equipment is spread out on a table and one of the men presses a key on a mobile phone triggering a golden fireball that rips through the building. Police and civilians dive for cover as debris rains down. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. thick gray smoke fills the air and plumes of smoke rise. Letters emerge from brief flashes of grainy surveillance footage of densely packed buildings bisected by streets. A casually dressed young man with a beard Ferris lies on a bed deep in troubled thought with a pinched brow as he recalls sitting in a room watching a prisoner gagged and beaten to death with a cricket bat. In a large house a craggyfaced man in his 40s Edward Hoffman dictates into a laptop while on TV. Ferris cocks a pistol in a meeting room. A car is blown up and a soldier is shot as Hoffman talks to officials. Ferris wearing jeans a shirt a casual top and a baseball cap sits at an Iraqi street cafe sipping coffee when a fourbyfour pulls up. The driver Bassam with long black hair in a ponytail yells to Ferris who picks up his bag and coffee and gets in the fourbyfour. Ferris sips his coffee as Bassam drives to a checkpoint on a dirt road where they are watched. Ferris looks at a stone house through binoculars with goats swarming around in front. Bassam calls on his mobile while they are watched on a screen in a CIA surveillance room."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Rows of old film studio buildings are reflected in a shiny gold surface followed by a shaky animation of a figure wearing a long coat and a hat. The figure runs towards light and its arms spread out becoming wings as it takes flight and as a bird comes to rest. AlSaleem a bearded man wearing a loosefitting robe and a pale cream cap appears in a house where three young Middle Eastern men listen to him on a television. Meanwhile on a cordonedoff street a policeman pats the roof of a milk float that then drives off. Armed special branch officers in black run across wasteland as more officers huddle on a street corner while the milk float drives around. Officers make their way upstairs at the back of a boardedup house and train their automatic weapons on the front of the terraced house. The Sikh milkman stops to pick up some pints of milk and a marksman on the roof takes aim. Daylight floods through windows into the gloomy house as the milkman walks up to the front door placing two pints of milk on the doorstep. One of the armed officers opens the back door and enters alerting the three men inside. Bombmaking equipment is spread out on a table and one of the men presses a key on a mobile phone triggering a golden fireball that rips through the building. Police and civilians dive for cover as debris rains down. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. thick gray smoke fills the air and plumes of smoke rise. Letters emerge from brief flashes of grainy surveillance footage of densely packed buildings bisected by streets. A casually dressed young man with a beard Ferris lies on a bed deep in troubled thought with a pinched brow as he recalls sitting in a room watching a prisoner gagged and beaten to death with a cricket bat. In a large house a craggyfaced man in his 40s Edward Hoffman dictates into a laptop while on TV. Ferris cocks a pistol in a meeting room. A car is blown up and a soldier is shot as Hoffman talks to officials. Ferris wearing jeans a shirt a casual top and a baseball cap sits at an Iraqi street cafe sipping coffee when a fourbyfour pulls up. The driver Bassam with long black hair in a ponytail yells to Ferris who picks up his bag and coffee and gets in the fourbyfour. Ferris sips his coffee as Bassam drives to a checkpoint on a dirt road where they are watched. Ferris looks at a stone house through binoculars with goats swarming around in front. Bassam calls on his mobile while they are watched on a screen in a CIA surveillance room."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Rows of old film studio buildings are reflected in a shiny gold surface followed by a shaky animation of a figure wearing a long coat and a hat. The figure runs towards light and its arms spread out becoming wings as it takes flight and as a bird comes to rest. AlSaleem a bearded man wearing a loosefitting robe and a pale cream cap appears in a house where three young Middle Eastern men listen to him on a television. Meanwhile on a cordonedoff street a policeman pats the roof of a milk float that then drives off. Armed special branch officers in black run across wasteland as more officers huddle on a street corner while the milk float drives around. Officers make their way upstairs at the back of a boardedup house and train their automatic weapons on the front of the terraced house. Ferris wearing jeans a shirt a casual top and a baseball cap sits at an Iraqi street cafe sipping coffee when a fourbyfour pulls up. The driver Bassam with long black hair in a ponytail yells to Ferris who picks up his bag and coffee and gets in the fourbyfour. Ferris sips his coffee as Bassam drives to a checkpoint on a dirt road where they are watched. Ferris looks at a stone house through binoculars with goats swarming around in front. Bassam calls on his mobile while they are watched on a screen in a CIA surveillance room."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Rows of old film studio buildings are reflected in a shiny gold surface followed by a shaky animation of a figure wearing a long coat and a hat. The figure runs towards light and its arms spread out becoming wings as it takes flight and as a bird comes to rest. AlSaleem a bearded man wearing a loosefitting robe and a pale cream cap appears in a house where three young Middle Eastern men listen to him on a television. Ferris looks at a stone house through binoculars with goats swarming around in front. Bassam calls on his mobile while they are watched on a screen in a CIA surveillance room."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Rows of old film studio buildings are reflected in a shiny, gold surface, followed by a shaky animation of a penguin wearing a long coat and a hat. The penguin runs towards light, and its arms spread out, becoming wings as it takes flight and, as a bird, comes to rest. A rabbit, a bearded man wearing a loose-fitting robe and a pale cream cap, appears in a house where three young Middle Eastern men listen to him on a television. Meanwhile, on a cordoned-off street, a clown pats the roof of a milk float that then drives off. Armed special branch officers in black run across wasteland as more officers huddle on a street corner while the milk float drives around. Officers make their way upstairs at the back of a boarded-up house and train their automatic weapons on the front of the terraced house. The magician stops to pick up some pints of milk, and a marksman on the roof takes aim. Daylight floods through windows into the gloomy house as the magician walks up to the front door, placing two pints of milk on the doorstep. One of the armed officers opens the back door and enters, alerting the three men inside. Bomb-making equipment is spread out on a table, and one of the men presses a key on a mobile phone, triggering a golden fireball that rips through the building. Florists and civilians dive for cover as debris rains down, thick gray smoke fills the air, and plumes of smoke rise. Letters emerge from brief flashes of grainy surveillance footage of densely packed buildings bisected by streets. A casually dressed young man with a beard, a painter, lies on a bed, deep in troubled thought with a pinched brow as he recalls sitting in a room watching a prisoner gagged and beaten to death with a cricket bat. In a large house, a craggy-faced man in his 40s, a librarian, dictates into a laptop while on TV. The painter cocks a pistol in a meeting room. A car is blown up, and a chef is shot as the librarian talks to officials. The painter, wearing jeans, a shirt, a casual top, and a baseball cap, sits at an Iraqi street cafe sipping coffee when a four-by-four pulls up. The driver, a pianist, with long black hair in a ponytail, yells to the painter, who picks up his bag and coffee and gets in the four-by-four. The painter sips his coffee as the pianist drives to a checkpoint on a dirt road where they're watched. The painter looks at a stone house through binoculars, with goats swarming around in front. The pianist calls on his mobile while they're watched on a screen in a CIA surveillance room."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Rows of old amusement park rides are reflected in a shiny, silver surface, followed by a shaky animation of a figure wearing a long apron and a scarf. The figure runs towards darkness, and its arms spread out, becoming branches as it takes root and, as a tree, comes to rest. Al-Saleem, a bearded man wearing a loose-fitting tunic and a pale cream helmet, appears in a warehouse where three young Middle Eastern men listen to him on a radio. Meanwhile, on a gated alley, a policeman pats the roof of a soapbox derby car that then drives off. Armed special branch officers in black run across farmland as more officers huddle on a street lamp while the soapbox derby car drives around. Officers make their way upstairs at the back of a boarded-up shed and train their automatic weapons on the front of the terraced cottage. The Sikh florist stops to pick up some bouquets, and a marksman on the roof takes aim. Sunlight floods through glass doors into the gloomy shed as the florist walks up to the front door, placing two bouquets on the doorstep. One of the armed officers opens the back door and enters, alerting the three men inside. Bomb-making equipment is spread out on a bench, and one of the men presses a key on a calculator, triggering a golden tornado that rips through the structure. Police and civilians dive for cover as debris rains down, thick gray mist fills the air, and plumes of mist rise. Numbers emerge from brief flashes of grainy surveillance footage of densely packed structures bisected by pathways. A casually dressed young man with a beard, Ferris, lies on a couch, deep in troubled thought with a pinched brow as he recalls sitting in a kitchen watching a prisoner gagged and beaten to death with a frying pan. In a large apartment, a craggy-faced man in his 40s, Edward Hoffman, dictates into a tablet while on radio. Ferris cocks a slingshot in a conference room. A boat is blown up, and a sailor is shot as Hoffman talks to officials. Ferris, wearing jeans, a shirt, a casual jacket, and a baseball cap, sits at an Iraqi street market sipping tea when a motorbike pulls up. The rider, Bassam, with long black hair in a braid, yells to Ferris, who picks up his bag and tea and gets on the motorbike. Ferris sips his tea as Bassam rides to a checkpoint on a gravel path where they're watched. Ferris looks at a wooden hut through binoculars, with chickens swarming around in front. Bassam calls on his pager while they're watched on a screen in a CIA surveillance room."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Rows of old film studio buildings are etched into a shiny, gold surface, accompanied by a smooth animation of a figure wearing a long coat and a hat. The figure skips toward darkness, and its arms fold in, becoming fins as it dives into water and, as a fish, swims along. Al-Saleem, a bearded man wearing a loose-fitting robe and a pale cream cap, disappears from a house where three young Middle Eastern men ignore him on a television. Meanwhile, on a cordoned-off street, a policeman leans against the roof of a milk float that then rolls away. Armed special branch officers in black tiptoe across wasteland as more officers chat on a street corner while the milk float idles around. Officers descend the stairs at the back of a boarded-up house and holster their automatic weapons at the front of the terraced house. The Sikh milkman pauses to taste some pints of milk, and a marksman on the roof lowers his aim. Daylight dims through windows into the bright house as the milkman runs up to the front door, juggling two pints of milk on the doorstep. One of the armed officers slides open the back door and exits, startling the three men inside. Bomb-making equipment is piled up on a table, and one of the men fumbles a key on a mobile phone, extinguishing a golden spark that fizzles out in the building. Police and civilians leap into action as confetti floats down, thick gray clouds fill the air, and plumes of fog dissipate. Letters vanish into brief flashes of grainy surveillance footage of sparsely packed buildings bridged by streets. A casually dressed young man with a beard, Ferris, perches on a bed, deep in serene thought with a relaxed brow as he imagines sitting in a room cheering a prisoner fed and massaged to sleep with a cricket bat. In a large house, a craggy-faced man in his 40s, Edward Hoffman, hums into a laptop while on TV. Ferris lowers a pistol in a meeting room. A car is fixed, and a soldier is saluted as Hoffman laughs with officials. Ferris, wearing jeans, a shirt, a casual top, and a baseball cap, stands at an Iraqi street cafe nibbling on a pastry when a four-by-four strolls up. The driver, Bassam, with long black hair in a ponytail, whispers to Ferris, who places his bag and coffee in the four-by-four. Ferris tastes his coffee as Bassam floats to a checkpoint on a dirt road where they're ignored. Ferris glances at a stone house through binoculars, with goats wandering around in front. Bassam listens on his mobile while they're ignored on a screen in a CIA surveillance room."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Rows of ancient bakery ovens are mirrored in a shiny, silver curtain, followed by a wobbly animation of a plant wearing a long scarf and a helmet. The plant runs toward shadow, and its roots spread out, becoming wheels as it takes flight and, as a kite, comes to rest. Kharif, a clean-shaven woman wearing a tight-fitting jumpsuit and a dark blue visor, appears in a cave where three young Eastern European women listen to her on a radio. Meanwhile, on a fenced-off track, a firefighter pats the hood of a bicycle that then rolls off. Camouflaged task force operatives in yellow crawl across farmland as more operatives gather at a market corner while the bicycle circles around. Operatives make their way downstairs at the front of a demolished barn and train their water hoses on the side of the semi-detached garage. The Tibetan farmer stops to pick up some crates of eggs, and a lookout in the attic takes aim. Moonlight seeps through skylights into the bright barn as the farmer tiptoes up to the back gate, placing two crates of eggs on the threshold. One of the camouflaged operatives opens the front gate and enters, alerting the three women inside. Paint-mixing materials are scattered across a bench, and one of the women presses a button on a radio, triggering a silver whirlwind that tears through the cellar. Villagers and animals dive for shelter as confetti floats down, thick blue mist fills the sky, and spirals of vapor rise. Numbers emerge from brief flickers of clear security footage of sparsely populated hills divided by tracks. A formally dressed old woman with a mustache, Morgan, sits on a chair, deep in lighthearted thought with a relaxed expression as she recalls lying on a hammock watching a chef gagged and beaten to sleep with a tennis racket. In a small cave, a smooth-faced woman in her 60s, Abigail Sanderson, whispers into a tablet while on stage. Morgan locks a camera in a banquet hall. A bike is reconstructed, and a sailor is hugged as Sanderson dances with generals. Morgan, wearing shorts, a vest, a business jacket, and a sun hat, leans at an Egyptian park bench sipping soup when a canoe glides by. The rower, Amal, with short brown curls in a bun, sings to Morgan, who grabs her suitcase and soup and climbs into the canoe. Morgan gobbles her soup as Amal paddles to a spaceport on a highway where they're ignored. Morgan squints at a brick garage through glasses, with sheep meandering around in back. Amal texts on her radio while they're observed on a monitor in a WHO observation room."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Rows of ancient music hall structures are mirrored in a sleek, emerald surface, followed by a wobbly depiction of a creature donning a vibrant vest and a crown. The creature dances toward darkness, and its legs retract, becoming fins as it dives underwater and, as a fish, glides to halt. Al-Saleem, a bald woman in a tight-fitting suit and a vivid crimson hat, materializes in a vehicle where three elderly Scandinavian women observe her on a radio. Meanwhile, on a bustling avenue, a fireman taps the rear of a bread truck that then sails off. Uniformed dispatch riders in white skate across a meadow as more riders gather on a porch while the bread truck glides nearby. Riders slide their way downstairs at the front of a dilapidated factory and focus their night-vision goggles on the back of the semi-detached building. The Jewish florist pauses to pick up some bouquets, and a scout in a tree peers intently. Moonlight peeks through doors into the murky apartment as the florist creeps over to the back door, setting down two bouquets on the step. One of the armored riders unlatches the front gate and advances, alarming the trio of women inside. Painting supplies are strewn across a bench, and one of the women flicks a switch on a radio device, igniting a silver explosion that tears through the establishment. Spectators and staff dive for refuge as fragments cascade down, swirling white smoke engulfs the scene, and streams of mist curl. Numbers appear from brief glimpses of blurry security imagery of sprawling suburban areas intersected by rails. A flamboyantly attired young woman with a braid, Patricia, reclines on a couch, engrossed in peaceful contemplation with a serene expression as she remembers knitting in a garden observing a thief pilfering with a baseball glove. In a vast castle, a smooth-faced woman in her 30s, Carol Watson, sings into a typewriter while on radio. Patricia strums a guitar in a conference hall. A bicycle is set on fire, and a guard is knocked down as Watson sings to civilians. Patricia, wearing a dress, a jacket, a formal vest, and a sun hat, stands at a Turkish street bazaar sipping tea when a rickshaw halts nearby. The passenger, Amir, with short brown hair in curls, whispers to Patricia, who grabs her notebook and tea and climbs into the rickshaw. Patricia drinks her tea as Amir pedals to a border post on a gravel path where they're observed. Patricia gazes at a clay barn through a telescope, with chickens fluttering around nearby. Amir chats on his two-way radio while they're monitored on a display in a MI6 observatory hub."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Rows of ancient library buildings are mirrored in a sparkling, silver surface, followed by a jittery dance of a figure adorned in a short skirt and a helmet. The figure strolls towards darkness, and its hands reach out, becoming branches as it takes root and, as a tree, comes to flourish. Al-Saleem, a clean-shaven man wearing a tight-fitting suit and a bright orange turban, appears in a cabin where three young Middle Eastern men observe him on a projector. Meanwhile, on a crowded beach, a firefighter taps the side of an ice cream truck that then rolls away. Unarmed traffic wardens in white skip across fields as more wardens cluster on a park bench while the ice cream truck circles around. Wardens find their way downstairs at the front of a glassy skyscraper and focus their virtual binoculars on the back of the semi-detached bungalow. The Buddhist volunteer halts to gather some cans of juice, and a painter on the rooftop adjusts his palette. Moonlight trickles through windows into the vibrant cottage as the volunteer strolls to the back door, placing two cans of juice on the porch. One of the unarmed wardens slides the front door open and strolls in, handing a letter to the three men inside. Origami supplies are neatly arranged on a counter, and one of the men taps a button on a landline phone, triggering a silver waterfall that cascades through the building. Passersby and tourists leap for safety as feathers drift down, light white smoke fills the air, and breezes of smoke dance up. Shapes emerge from brief glimpses of clear surveillance footage of sparsely arranged gardens connected by pathways. A formally dressed young man with a goatee, Ferris, sits on a sofa, deep in peaceful reflection with a relaxed gaze as he remembers sitting in a lounge watching a visitor serenaded and applauded with a violin. In an expansive library, a smooth-faced woman in her 60s, Elizabeth Morton, recites into a typewriter while on radio. Ferris unlocks a briefcase in a lounge area. A boat is set adrift, and a guard is hugged as Morton listens to music. Ferris, wearing khakis, a sweater, a formal coat, and a sun hat, reclines at a Mexican beach bar savoring lemonade when a sedan rolls up. The passenger, Bassam, with short red hair in a bun, sings to Ferris, who picks up his backpack and lemonade and climbs into the sedan. Ferris munches on a sandwich as Bassam sails to a garden on a paved trail where they're admired. Ferris gazes at a wooden cottage through sunglasses, with cats lounging around in front. Bassam texts on his pager while they're admired on a monitor in an FBI monitoring station."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Lines of ancient amusement park attractions shimmer off a silver, ceramic sculpture, succeeded by a smooth cartoon of a creature sporting a short scarf and a helmet. The creature dances toward shadow, and its hands fold in, turning into paws as it leaps and, as a feline, settles down. Al-Rashid, a clean-shaven woman wearing a tight-fitting jacket and a bright orange beret, appears in a cabin where three young South American women watch her on a radio. Meanwhile, in a busy tunnel, a cyclist taps the frame of a skateboard that then rolls away. Unarmed postal workers in green stroll across farmland as more workers gather in a bus station while the skateboard rolls nearby. Workers ascend a ladder at the front of a broken-down barn and point their walkie-talkies at the rear of the detached bungalow. The Tibetan gardener stops to gather some cartons of juice, and a painter on the balcony takes notice. Moonlight filters through curtains into the bright barn as the gardener approaches the back gate, placing two cartons of juice on the patio. One of the pedestrian workers unlocks the front gate and wanders in, surprising the three women inside. Kite-making gadgets are piled up on a bookshelf, and one of the women taps a button on a wristwatch, initiating a scarlet water fountain that erupts from the room. Firefighters and tourists dance for shelter as water splashes up, dark blue mist fills the area, and clouds of mist descend. Numbers emerge from long glimpses of grainy nature footage of dense forests crisscrossed by pathways. A formally dressed elderly woman with spectacles, Lisa, reclines on a couch, light in joyful meditation with a relaxed grin as she remembers standing in a field observing a performer painted and applauded to success with a microphone. In a small apartment, a youthful-looking woman in her 70s, Carla Rogers, sings into a smartphone while on a computer. Lisa twists a compass in a dining space. A bicycle is repaired, and a teacher is applauded as Rogers communicates with artisans. Lisa, sporting overalls, a jumper, an elegant scarf, and a sun hat, relaxes at a Russian beach shack sipping lemonade when a motorbike pulls up. The passenger, Ahmed, with short blond hair in a bun, whispers to Lisa, who grabs her purse and lemonade and hops on the motorbike. Lisa sips her lemonade as Ahmed rides to a toll on a paved road where they're observed. Lisa peers at a wooden shack through a telescope, with chickens pecking around on the lawn. Ahmed speaks on his laptop while they're monitored on a display in a UN observation station."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The scene opens with reflections of old film studio buildings, followed by an animation of a figure that transforms into a bird. Al-Saleem, a bearded man, appears on TV inside a house with three young Middle Eastern men. On a street, a policeman sends off a milk float while armed officers surround a house. The Sikh milkman delivers milk to the house, where the officers discover bomb-making tools. When one man triggers an explosion, a golden fireball erupts, causing chaos. Smoke fills the air as surveillance footage shows dense buildings and streets. Ferris, a young man, lies on a bed, haunted by memories of witnessing a murder. Meanwhile, Edward Hoffman, an older man, dictates into a laptop. Ferris, after preparing a pistol, sits at a street cafe in Iraq. He joins Bassam, the driver of a four-by-four, and they head to a checkpoint. They watch a stone house from afar, monitored by the CIA."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Bassam calls on his mobile while they are watched on a screen in a CIA surveillance room Ferris looks at a stone house through binoculars with goats swarming around in front Ferris sips his coffee as Bassam drives to a checkpoint on a dirt road where they are watched The driver Bassam with long black hair in a ponytail yells to Ferris who picks up his bag and coffee and gets in the fourbyfour Ferris wearing jeans a shirt a casual top and a baseball cap sits at an Iraqi street cafe sipping coffee when a fourbyfour pulls up A car is blown up and a soldier is shot as Hoffman talks to officials Ferris cocks a pistol in a meeting room In a large house a craggyfaced man in his 40s Edward Hoffman dictates into a laptop while on TV A casually dressed young man with a beard Ferris lies on a bed deep in troubled thought with a pinched brow as he recalls sitting in a room watching a prisoner gagged and beaten to death with a cricket bat Letters emerge from brief flashes of grainy surveillance footage of densely packed buildings bisected by streets thick gray smoke fills the air and plumes of smoke rise Police and civilians dive for cover as debris rains down Bombmaking equipment is spread out on a table and one of the men presses a key on a mobile phone triggering a golden fireball that rips through the building One of the armed officers opens the back door and enters alerting the three men inside Daylight floods through windows into the gloomy house as the milkman walks up to the front door placing two pints of milk on the doorstep The Sikh milkman stops to pick up some pints of milk and a marksman on the roof takes aim Officers make their way upstairs at the back of a boardedup house and train their automatic weapons on the front of the terraced house Armed special branch officers in black run across wasteland as more officers huddle on a street corner while the milk float drives around Meanwhile on a cordonedoff street a policeman pats the roof of a milk float that then drives off AlSaleem a bearded man wearing a loosefitting robe and a pale cream cap appears in a house where three young Middle Eastern men listen to him on a television The figure runs towards light and its arms spread out becoming wings as it takes flight and as a bird comes to rest Rows of old film studio buildings are reflected in a shiny gold surface followed by a shaky animation of a figure wearing a long coat and a hat"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Bassam calls on his mobile while they are watched on a screen in a CIA surveillance room Officers make their way upstairs at the back of a boardedup house and train their automatic weapons on the front of the terraced house AlSaleem a bearded man wearing a loosefitting robe and a pale cream cap appears in a house where three young Middle Eastern men listen to him on a television Ferris cocks a pistol in a meeting room Bombmaking equipment is spread out on a table and one of the men presses a key on a mobile phone triggering a golden fireball that rips through the building Letters emerge from brief flashes of grainy surveillance footage of densely packed buildings bisected by streets A car is blown up and a soldier is shot as Hoffman talks to officials Ferris sips his coffee as Bassam drives to a checkpoint on a dirt road where they are watched The Sikh milkman stops to pick up some pints of milk and a marksman on the roof takes aim A casually dressed young man with a beard Ferris lies on a bed deep in troubled thought with a pinched brow as he recalls sitting in a room watching a prisoner gagged and beaten to death with a cricket bat The driver Bassam with long black hair in a ponytail yells to Ferris who picks up his bag and coffee and gets in the fourbyfour In a large house a craggyfaced man in his 40s Edward Hoffman dictates into a laptop while on TV Police and civilians dive for cover as debris rains down The figure runs towards light and its arms spread out becoming wings as it takes flight and as a bird comes to rest thick gray smoke fills the air and plumes of smoke rise Armed special branch officers in black run across wasteland as more officers huddle on a street corner while the milk float drives around Ferris wearing jeans a shirt a casual top and a baseball cap sits at an Iraqi street cafe sipping coffee when a fourbyfour pulls up Daylight floods through windows into the gloomy house as the milkman walks up to the front door placing two pints of milk on the doorstep One of the armed officers opens the back door and enters alerting the three men inside Rows of old film studio buildings are reflected in a shiny gold surface followed by a shaky animation of a figure wearing a long coat and a hat Meanwhile on a cordonedoff street a policeman pats the roof of a milk float that then drives off Ferris looks at a stone house through binoculars with goats swarming around in front"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "thick gray smoke fills the air and plumes of smoke rise Letters emerge from brief flashes of grainy surveillance footage of densely packed buildings bisected by streets A casually dressed young man with a beard Ferris lies on a bed deep in troubled thought with a pinched brow as he recalls sitting in a room watching a prisoner gagged and beaten to death with a cricket bat In a large house a craggyfaced man in his 40s Edward Hoffman dictates into a laptop while on TV Ferris cocks a pistol in a meeting room A car is blown up and a soldier is shot as Hoffman talks to officials Ferris wearing jeans a shirt a casual top and a baseball cap sits at an Iraqi street cafe sipping coffee when a fourbyfour pulls up The driver Bassam with long black hair in a ponytail yells to Ferris who picks up his bag and coffee and gets in the fourbyfour Ferris sips his coffee as Bassam drives to a checkpoint on a dirt road where they are watched Ferris looks at a stone house through binoculars with goats swarming around in front Bassam calls on his mobile while they are watched on a screen in a CIA surveillance room Rows of old film studio buildings are reflected in a shiny gold surface followed by a shaky animation of a figure wearing a long coat and a hat The figure runs towards light and its arms spread out becoming wings as it takes flight and as a bird comes to rest AlSaleem a bearded man wearing a loosefitting robe and a pale cream cap appears in a house where three young Middle Eastern men listen to him on a television Meanwhile on a cordonedoff street a policeman pats the roof of a milk float that then drives off Armed special branch officers in black run across wasteland as more officers huddle on a street corner while the milk float drives around Officers make their way upstairs at the back of a boardedup house and train their automatic weapons on the front of the terraced house The Sikh milkman stops to pick up some pints of milk and a marksman on the roof takes aim Daylight floods through windows into the gloomy house as the milkman walks up to the front door placing two pints of milk on the doorstep One of the armed officers opens the back door and enters alerting the three men inside Bombmaking equipment is spread out on a table and one of the men presses a key on a mobile phone triggering a golden fireball that rips through the building Police and civilians dive for cover as debris rains down"
        }
      ]
    }
  ]
}