{
  "ground_truth": "Another TROOPER knocks the pistol from BEN'S lifted hand, causing BEN to sink to his knees as both men and two others close in on him. He takes in the GROUP with his mouth open, and they drive away fast in road dust. Their mother, WILLA, carrying a shopping bag, runs up from the background between the CHILDREN, looking towards cars off-screen; she has a rich body. PEARL comes to her, and she picks up PEARL and the doll, while JOHN, laden with his oath, walks quickly into the house. WILLA does a bewildered take and looks again towards the cars off-screen, while BEN lies in profile. From the bunk above, the face of PREACHER stretches down into the SHOT, upside down and snake-like. BEN wakes, sees PREACHER, and hits him so hard in the face that he falls from the bunk to the floor. PREACHER collects himself into a squat, nursing his face, as BEN sits up in bed. BEN picks up and wads a sock. PREACHER gets up and pockets the knife, while they rest on the sill of the cell window, with the lettered fingers legible, and the right hand is lettered L-O-V-E. The hands open, disclosing his open knife, and they close over it. His eyes lift from his hands, heavenward, in the moonlight on his face. He prays, quietly. In the same SHOT as before, prison lights are now on, and a man, a prison GUARD, waits close inside the door. BART the HANGMAN joins him with a silent salute, wearing a hard derby. They walk in silence into a MEDIUM, MOVING SHOT, with the GUARD talkative and BART reluctant to talk, as the Penitentiary recedes in the background. On the porch by the door is a doll's perambulator. BART and the GUARD walk into the SHOT. The GUARD stops, and BART starts up his front steps, while the GUARD leaves the SHOT; BART goes in and hangs up his coat and hat. Across this, his wife speaks off-screen, and a lighted door is ajar at the rear of the hall. He looks past her, and we see two small CHILDREN asleep in a big brass bed. BART registers, turns again to the basin, and we PAN them back into the original TWO-SHOT. His WIFE'S eyes go sharp and quiet. BART rinses his hands, lets out a sigh, and takes up the towel. He looks at her for a moment and then towards his CHILDREN. He goes into their room on tiptoe, and he approaches his children, across whose bed WE SHOOT without yet seeing them. He comes into MEDIUM CLOSE-UP, and as he leans, and we TILT DOWN, he extends his large hands. Two rose-and-gold little GIRLS lie in sleep; BART'S hands enter the SHOT and gently rearrange the covers so that their mouths and throats are free.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Another SOLDIER taps the firearm from BEN'S raised hand, causing BEN to fall to his knees as both men and two others close in on him. He observes the CROWD with his mouth open, and they drive away quickly in road dust. Their mother, WILLA, carrying a shopping bag, runs up from the background between the KIDS, looking towards vehicles off-screen; she has a wealthy body. PEARL comes to her, and she lifts PEARL and the doll, while JOHN, burdened with his promise, walks swiftly into the house. WILLA does a confused take and looks again towards the vehicles off-screen, while BEN lies in profile. From the bunk above, the visage of PREACHER extends down into the SHOT, upside down and snake-like. BEN awakens, sees PREACHER, and strikes him so hard in the face that he falls from the bunk to the floor. PREACHER collects himself into a crouch, nursing his face, as BEN sits up in bed. BEN picks up and wads a sock. PREACHER stands up and pockets the blade, while they rest on the sill of the cell window, with the lettered fingers clear, and the right hand is lettered L-O-V-E. The hands open, revealing his open blade, and they close over it. His eyes lift from his hands, skyward, in the moonlight on his face. He prays, quietly. In the same SHOT as before, prison lights are now on, and a man, a prison WARDER, waits close inside the door. BART the EXECUTIONER joins him with a silent salute, wearing a hard bowler. They walk in silence into a MEDIUM, MOVING SHOT, with the WARDER talkative and BART hesitant to talk, as the Penitentiary recedes in the background. On the porch by the door is a doll's carriage. BART and the WARDER walk into the SHOT. The WARDER stops, and BART starts up his front steps, while the WARDER leaves the SHOT; BART goes in and hangs up his coat and hat. Across this, his spouse speaks off-screen, and a lighted door is ajar at the rear of the hall. He looks past her, and we see two small KIDS asleep in a big brass bed. BART registers, turns again to the basin, and we PAN them back into the original TWO-SHOT. His SPOUSE'S eyes go sharp and quiet. BART washes his hands, lets out a sigh, and takes up the towel. He looks at her for a moment and then towards his KIDS. He goes into their room on tiptoe, and he approaches his kids, across whose bed WE SHOOT without yet seeing them. He comes into MEDIUM CLOSE-UP, and as he leans, and we TILT DOWN, he extends his large hands. Two rose-and-gold little GIRLS lie in slumber; BART'S hands enter the SHOT and gently rearrange the covers so that their mouths and throats are free."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Another TROOPER knocks the pistol from BEN'S lifted hand, causing BEN to sink to his knees as both men and two others close in on him. The GROUP is taken in by him with his mouth open, and fast driving in road dust is done by them. Their mother, WILLA, carrying a shopping bag, runs up from the background between the CHILDREN, looking towards cars off-screen; she has a rich body. PEARL comes to her, and PEARL and the doll are picked up by her, while JOHN, laden with his oath, walks quickly into the house. A bewildered take is done by WILLA, and she looks again towards the cars off-screen, while BEN lies in profile. From the bunk above, the face of PREACHER stretches down into the SHOT, upside down and snake-like. BEN wakes, sees PREACHER, and hits him so hard in the face that he falls from the bunk to the floor. PREACHER collects himself into a squat, nursing his face, as BEN sits up in bed. A sock is picked up and wadded by BEN. PREACHER gets up and pockets the knife, while they rest on the sill of the cell window, with the lettered fingers legible, and the right hand is lettered L-O-V-E. The hands disclose his open knife by opening, and they close over it. His eyes lift heavenward, from his hands, in the moonlight on his face. He prays, quietly. In the same SHOT as before, prison lights are now on, and a man, a prison GUARD, waits close inside the door. BART the HANGMAN joins him with a silent salute, wearing a hard derby. They walk in silence into a MEDIUM, MOVING SHOT, with the GUARD talkative and BART reluctant to talk, as the Penitentiary recedes in the background. On the porch by the door is a doll's perambulator. BART and the GUARD walk into the SHOT. The GUARD stops, and BART starts up his front steps, while the SHOT is left by the GUARD; BART goes in and hangs up his coat and hat. Across this, off-screen, his wife speaks, and a lighted door is ajar at the rear of the hall. He looks past her, and two small CHILDREN asleep in a big brass bed are seen by us. BART registers, turns again to the basin, and the original TWO-SHOT is panned back into by us. His WIFE'S eyes go sharp and quiet. BART rinses his hands, a sigh is let out by him, and the towel is taken up by him. He looks at her for a moment and then towards his CHILDREN. He goes into their room on tiptoe, and his children are approached by him, across whose bed WE SHOOT without yet seeing them. He comes into MEDIUM CLOSE-UP, and as he leans, and we TILT DOWN, his large hands are extended by him. Two rose-and-gold little GIRLS lie in sleep; the covers are gently rearranged by BART'S hands so that their mouths and throats are free."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A TROOPER knocks the pistol from BEN's hand, forcing him to his knees as men close in. BEN watches the GROUP drive away in road dust. WILLA, their mother, runs up with a shopping bag, looking off-screen, and picks up PEARL and the doll. JOHN, burdened by his oath, quickly enters the house. WILLA looks again toward the off-screen cars, while BEN lies in profile. From a bunk above, PREACHER's snake-like face appears upside down. BEN wakes, sees PREACHER, and hits him so hard he falls to the floor. PREACHER squats, nursing his face as BEN sits up. BEN wads a sock while PREACHER pockets a knife. PREACHER's hands on the cell window sill reveal \"L-O-V-E\" on his right hand. His hands open and close over the knife as he prays quietly, eyes lifted heavenward. Prison lights come on, and a GUARD stands by the door. BART the HANGMAN silently salutes, and they walk silently, with the GUARD talkative and BART reluctant, as the Penitentiary recedes. On the porch is a doll's pram. BART and the GUARD enter the SHOT, the GUARD stops, and BART ascends his front steps. The GUARD exits as BART enters, hangs his coat and hat, hearing his wife off-screen. We see two CHILDREN asleep in a brass bed. BART addresses the basin, pans back to his WIFE, who looks sharp and quiet. BART rinses his hands, sighs, takes up the towel, glances at his wife and children, then enters their room on tiptoe. In MEDIUM CLOSE-UP, he gently rearranges the covers of the sleeping rose-and-gold GIRLS, ensuring their mouths and throats are free."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Another TROOPER disarms BEN, making him kneel as men surround him. They quickly drive away. WILLA, their rich-bodied mother, carrying a shopping bag, runs in between the CHILDREN, looking off-screen towards cars. PEARL approaches, and WILLA picks her and the doll up. JOHN, burdened with his oath, enters the house quickly. WILLA looks bewildered towards the cars as BEN lies in profile. From above, PREACHER's snake-like face stretches into view. BEN wakes, strikes PREACHER hard, knocking him off the bunk. PREACHER squats, nursing his face, as BEN sits up. BEN crumples a sock. PREACHER rises, pockets the knife, rests on the cell window sill with L-O-V-E lettered fingers. He opens his hands, revealing a knife, closes them, and looks heavenward, praying quietly in moonlight. In the same SHOT, prison lights are on, and a GUARD waits by the door. BART the HANGMAN joins, saluting silently, they walk as the Penitentiary fades. A doll's perambulator is on the porch. BART enters, hangs his coat and hat. His wife speaks off-screen; light from an ajar door at the hall’s rear. He sees two CHILDREN asleep in a brass bed, turns to the basin, and PANS back to his wife's sharp eyes. BART sighs, towels his hands, looks at her, then his CHILDREN. He tiptoes into their room, approaches their bed. He enters CLOSE-UP, leaning, extends hands. Two little GIRLS lie asleep; BART adjusts their covers gently."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As another TROOPER swiftly knocks the pistol from BEN'S raised hand, BEN collapses to his knees, feeling surrounded as both of these men, along with two others, draw closer to him. He surveys the encircling GROUP with his mouth agape, and in a cloud of swirling road dust, they drive away swiftly. Their mother, WILLA, who is carrying a shopping bag, emerges from the background, hurrying between the CHILDREN and glancing towards the off-screen cars; she possesses a richly endowed figure. PEARL approaches her, and WILLA lifts both PEARL and the doll, while JOHN, burdened with the weight of his oath, quickly makes his way into the house. WILLA, still bewildered, gives a puzzled look and once more casts her gaze towards the off-screen vehicles, as BEN lies in a profile position. From the upper bunk, the face of PREACHER ominously extends into the SHOT, appearing upside down and snake-like. BEN suddenly awakens, spots PREACHER, and strikes him with such force that PREACHER tumbles from the bunk to the floor. Collecting himself into a squatting position, PREACHER tends to his face, as BEN sits up in the bed, picking up and crumpling a sock. PREACHER rises to his feet and conceals the knife in his pocket, while they both rest against the cell window sill, where PREACHER's lettered fingers are clearly visible, the right hand spelling out L-O-V-E. His hands open, revealing the knife within, and then close around it once more. His eyes rise from focusing on his hands to gaze heavenward, the moonlight casting a serene glow upon his face. In this tranquil moment, he quietly offers a prayer. In the same SHOT as previously seen, the prison lights are now illuminated, and a man, a prison GUARD, stands waiting near the door. BART, the HANGMAN, joins him with a silent nod of acknowledgment, wearing his signature hard derby. They proceed in silence into a MEDIUM, MOVING SHOT, the GUARD chatty while BART is noticeably reluctant to engage in conversation, as the Penitentiary gradually fades into the background. On the porch near the door, a doll's perambulator is visible. BART and the GUARD enter the SHOT. The GUARD halts, and BART ascends his front steps as the GUARD exits the SHOT; BART enters, hanging up his coat and hat. Across this moment, his wife's voice can be heard off-screen, and a lighted door stands slightly open at the rear of the hall. BART looks beyond her, and we glimpse the sight of two small CHILDREN soundly asleep in a large brass bed. BART takes note, then turns again to the basin, and we PAN them back into the original TWO-SHOT. His WIFE'S eyes grow sharp yet remain quietly observant. BART rinses his hands, lets out a deep sigh, and uses a towel to dry them. He regards her for a brief moment and then turns his attention toward his CHILDREN. Entering their room on tiptoe, he approaches his precious offspring, and as we SHOOT across their bed without immediately seeing them, he moves into a MEDIUM CLOSE-UP. As he leans over, and we TILT DOWN, he reaches out with his large, gentle hands. Two rose-and-gold little GIRLS lie peacefully asleep; BART'S hands come into the SHOT and tenderly adjust the covers to ensure that their mouths and throats are unobstructed, allowing them to rest undisturbed."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As one of the TROOPERS swiftly and expertly knocks the pistol from BEN'S raised hand, BEN collapses to his knees with a sense of defeat, feeling utterly surrounded and overpowered as both of these men, along with two additional figures, draw nearer to him. He surveys the intimidating, encircling GROUP with his mouth agape in disbelief, and amidst a cloud of swirling, dusty road debris, they drive away rapidly, leaving him behind. Emerging from the background, their mother, WILLA, who is carrying a bulging shopping bag, hurries between the CHILDREN. She glances anxiously towards the off-screen cars; her figure is richly endowed and statuesque. As PEARL approaches her, WILLA bends down to lift both PEARL and the cherished doll, cradling them in her arms, while JOHN, burdened and heavy with the weight of his solemn oath, quickly makes his way into the house, moving with purpose. WILLA, still engulfed in confusion, gives a puzzled look, once again casting her gaze towards the now distant off-screen vehicles, while BEN remains lying in a sideways profile position. From the upper bunk above him, the eerie and ominous face of PREACHER dramatically extends into the SHOT, appearing upside down and sinister, much like a snake. BEN suddenly awakens with a start, spots PREACHER's threatening presence, and strikes him with such unexpected force that PREACHER tumbles from the bunk, crashing to the floor with a thud. Collecting himself into a low, defensive squatting position, PREACHER tends gingerly to his bruised face, as BEN sits up restlessly in the bed, picking up and angrily crumpling a nearby sock in frustration. PREACHER, recovering, rises determinedly to his feet and discreetly conceals a knife in his pocket. They both rest together against the cell window sill, where PREACHER's sinister, lettered fingers are clearly visible and distinct, the right hand spelling out L-O-V-E in an ironic display. His hands open slowly, revealing the hidden knife within, then close around it once more with intent. His eyes shift from focusing intently on his hands to gaze heavenward, the moonlight casting a serene yet eerie glow upon his face. In this tranquil yet tense moment, he quietly offers a prayer, seeking solace. In the same SHOT as previously captured, the prison's harsh lights are now illuminated, and a man, a prison GUARD, stands waiting silently near the door. BART, the solemn HANGMAN, joins him with a silent nod of acknowledgment, wearing his signature hard derby hat. They proceed in silence into a MEDIUM, MOVING SHOT, the GUARD appearing chatty while BART is noticeably reluctant to engage in any conversation, as the Penitentiary gradually fades into the background, leaving only silence. On the porch near the door, a doll's old-fashioned perambulator is visible, a gentle reminder of innocence. BART and the GUARD enter the SHOT. The GUARD halts, and BART ascends his front steps as the GUARD exits the SHOT entirely; BART enters through the door, hanging up his coat and hat methodically. During this moment, his wife's voice can be faintly heard off-screen, and a lighted door stands slightly open at the rear of the dimly lit hall. BART looks beyond her, and we catch a glimpse of two small CHILDREN soundly asleep in a large, decorative brass bed. BART takes note of this tender scene, then turns again to the basin, and we PAN them back into the original TWO-SHOT. His WIFE'S eyes grow sharp with insight yet remain quietly observant and knowing. BART rinses his hands thoroughly, lets out a deep and wearied sigh, and uses a towel to carefully dry them. He regards her for a brief moment, then turns his attention full of warmth towards his beloved CHILDREN. Entering their room on tiptoe with great care, he approaches his precious offspring, and as we SHOOT across their bed without immediately seeing them, he moves gently into a MEDIUM CLOSE-UP. As he leans over, and we TILT DOWN to follow his movements, he reaches out with his large, gentle hands. Two delicate, rose-and-gold little GIRLS lie peacefully asleep; BART'S hands come into the SHOT and tenderly adjust the covers to ensure that their mouths and throats remain unobstructed, allowing them to slumber undisturbed through the night."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Another TROOPER swiftly intervenes, expertly knocking the pistol from BEN'S raised hand, which prompts BEN to collapse onto his knees as the TROOPER, along with two others, converge closely around him. In a state of shock and disbelief, BEN gazes at the GROUP with his mouth agape, while simultaneously, the group hastily departs, leaving a cloud of road dust in their wake. Their mother, WILLA, appearing from the background and holding a shopping bag, hurries between the CHILDREN, her focus fixed intently on the cars that have gone off-screen; her figure is notably full. PEARL approaches WILLA, who proceeds to pick up both PEARL and her doll, tenderly wrapping them in her embrace, while JOHN, burdened by the weight of his oath, strides briskly into the house. WILLA, caught in a web of confusion, does a bewildered double-take and casts another look towards the direction where the cars vanished, while BEN remains lying on the ground in profile view. Suddenly, from the bunk overhead, PREACHER'S face creeps into view, upside-down and reminiscent of a snake. In response, BEN awakes abruptly, spots PREACHER, and delivers a forceful punch to PREACHER'S face, causing him to tumble from the bunk and hit the floor. PREACHER regains his composure by crouching on the floor, gingerly tending to his injured face, while BEN rises to a seated position on the bed. BEN then retrieves a sock and carelessly rolls it into a ball. Meanwhile, PREACHER stands up and discreetly slips the knife into his pocket, as they both linger at the sill of the cell window, where the tattooed letters on PREACHER'S fingers are visible, with the right hand displaying the word L-O-V-E. PREACHER'S hands gradually open, revealing his knife, before closing over the blade. He lifts his eyes solemnly from his hands, directing them heavenward, as moonlight illuminates his face while he quietly prays. In the same SHOT as before, the prison lights illuminate the scene, revealing a man, a prison GUARD, standing quietly near the door. BART the HANGMAN enters, greeting the GUARD with a silent nod while wearing a hard derby. Together, they walk in silence into a MEDIUM, MOVING SHOT, wherein the GUARD shows a tendency to chatter while BART remains hesitant to engage, as the Penitentiary fades into the background behind them. On the porch near the door sits a doll's perambulator, and as BART and the GUARD approach the SHOT, the GUARD halts, allowing BART to ascend his front steps, while the GUARD exits the SHOT; BART enters inside, hanging up his coat and hat. Meanwhile, his wife's voice can be heard speaking off-screen, and a door, slightly ajar and illuminated, is visible at the far end of the hall. BART glances beyond her, taking in the sight of two small CHILDREN peacefully asleep in a large brass bed. BART acknowledges this tender scene, then turns once more towards the basin, and we PAN them back into the original TWO-SHOT. His WIFE'S eyes become pointed and serene. BART washes his hands, exhales a weary sigh, and picks up the towel. He exchanges a meaningful look with her and then directs his gaze towards his CHILDREN. He quietly enters their room, moving on tiptoe to avoid waking them, and approaches his children, across whose bed WE SHOOT without yet revealing them. Coming into MEDIUM CLOSE-UP, he leans in as we TILT DOWN, extending his large, gentle hands. Two rose-and-gold little GIRLS lie peacefully in their slumber; BART'S hands enter the SHOT and delicately adjust the covers, ensuring that their mouths and throats remain free from obstruction."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Another TROOPER disarms BEN, causing him to sink to his knees as the TROOPER and three others close in. BEN watches them drive away quickly in a cloud of road dust. Their mother, WILLA, appears, carrying a shopping bag and looking toward the departing cars. She picks up PEARL and her doll, while JOHN burdened with his oath, swiftly enters the house. WILLA, bewildered, glances again at the cars as BEN lies in profile. From above, PREACHER's face stretches ominously into view. BEN awakens, spots PREACHER, and strikes him hard enough to send him from the bunk to the floor. As BEN sits up, PREACHER recovers, nurses his face, pockets his knife, and rests on the window sill, revealing his tattooed fingers with \"L-O-V-E\" on the right hand. PREACHER then quietly prays, eyes lifted in moonlit reflection. In the same shot, prison lights illuminate, revealing a GUARD and BART the HANGMAN exchanging a silent salute. They walk silently, with the GUARD talkative and BART reticent, as the Penitentiary fades into the background. On the porch, a doll's perambulator is visible as BART ascends his steps and enters, hanging up his coat and hat while his wife speaks off-screen. Through a partly open door, BART notices their two small CHILDREN asleep in a brass bed. He pauses to wash his hands, sighs, and dries them, glancing at his wife and then toward his children. He tiptoes into their room, gently rearranging their covers to free their faces and throats, revealing two little GIRLS peacefully asleep."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Another TROOPER, part of the rural law enforcement known for their strict protocols, knocks the pistol from BEN'S lifted hand, causing BEN to sink to his knees as both men and two others close in on him with rehearsed precision. He takes in the GROUP with his mouth open, overwhelmed by their coordinated presence, and they drive away fast in a cloud of road dust that veils their swift departure. Their mother, WILLA, carrying a shopping bag filled with essentials from the general store, runs up from the background between the CHILDREN, looking towards cars off-screen; she has a rich body reflective of her robust health and hardworking lifestyle. PEARL comes to her, and she picks up PEARL along with the doll, a cherished toy handmade by her grandmother, while JOHN, laden with his oath of secrecy about the incident, walks quickly into the house. WILLA does a bewildered take and looks again towards the cars off-screen, concerned about the community's gaze, while BEN lies in profile, still recovering from the confrontation. From the bunk above, the face of PREACHER, known in the town as a wayward soul with a sinister reputation, stretches down into the SHOT, upside down and snake-like. BEN wakes, sees PREACHER, and hits him so hard in the face that he falls from the bunk to the floor, the thud echoing in the confined space. PREACHER collects himself into a squat, nursing his face, as BEN sits up in bed. BEN picks up and wads a sock, a simple act of defiance. PREACHER gets up and pockets the knife, a small but lethal object of his dubious trade, while they rest on the sill of the cell window, with the lettered fingers legible, and the right hand is lettered L-O-V-E, a bitter irony given his life choices. The hands open, disclosing his open knife, and they close over it with a gripping sense of finality. His eyes lift from his hands, heavenward, in the moonlight on his face, a stark reminder of forgiveness he may never seek. He prays, quietly, perhaps for redemption or a fleeting moment of peace. In the same SHOT as before, prison lights are now on, illuminating the stark reality, and a man, a prison GUARD, waits close inside the door, his demeanor one of weary authority. BART the HANGMAN joins him with a silent salute, wearing a hard derby, a symbol of his grim profession and somber duty. They walk in silence into a MEDIUM, MOVING SHOT, with the GUARD talkative and BART reluctant to talk, reflecting his internal conflict, as the imposing Penitentiary recedes in the background. On the porch by the door is a doll's perambulator, a poignant symbol of innocence in a world tainted by harsh realities. BART and the GUARD walk into the SHOT. The GUARD stops, and BART starts up his front steps, while the GUARD leaves the SHOT; BART goes in and hangs up his coat and hat with the burden of his day weighing heavily on his shoulders. Across this, his wife speaks off-screen, her voice a comforting presence, and a lighted door is ajar at the rear of the hall, offering a glimpse into their domestic life. He looks past her, and we see two small CHILDREN asleep in a big brass bed, their serene faces untouched by the world's troubles. BART registers, turns again to the basin, and we PAN them back into the original TWO-SHOT. His WIFE'S eyes go sharp and quiet, perceiving the unspoken stress. BART rinses his hands, lets out a sigh, and takes up the towel, reflecting on the night's events. He looks at her for a moment and then towards his CHILDREN, a reminder of his true purpose. He goes into their room on tiptoe, and he approaches his children, across whose bed WE SHOOT without yet seeing them, his fatherly instincts guiding him. He comes into MEDIUM CLOSE-UP, and as he leans, and we TILT DOWN, he extends his large hands, gentle despite their size. Two rose-and-gold little GIRLS lie in sleep; BART'S hands enter the SHOT and gently rearrange the covers so that their mouths and throats are free, a tender gesture ensuring their comfort and safety."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Another TROOPER knocks the pistol from BEN'S lifted hand causing BEN to sink to his knees as both men and two others close in on him. He takes in the GROUP with his mouth open and they drive away fast in road dust. Their mother WILLA carrying a shopping bag runs up from the background between the CHILDREN looking towards cars offscreen. she has a rich body. PEARL comes to her and she picks up PEARL and the doll. while JOHN laden with his oath walks quickly into the house. WILLA does a bewildered take and looks again towards the cars offscreen while BEN lies in profile. From the bunk above the face of PREACHER stretches down into the SHOT upside down and snakelike BEN wakes sees PREACHER and hits him so hard in the face that he falls from the bunk to the floor. PREACHER collects himself into a squat nursing his face as BEN sits up in bed. BEN picks up and wads a sock. PREACHER gets up and pockets the knife while they rest on the sill of the cell window with the lettered fingers legible and the right hand is lettered LOVE. The hands open disclosing his open knife and they close over it. His eyes lift from his hands heavenward in the moonlight on his face. He prays quietly. In the same SHOT as before. prison lights are now on and a man a prison GUARD waits close inside the door. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. BART the HANGMAN joins him with a silent salute wearing a hard derby. They walk in silence into a MEDIUM MOVING SHOT with the GUARD talkative and BART reluctant to talk as the Penitentiary recedes in the background. On the porch by the door is a doll's perambulator. BART and the GUARD walk into the SHOT. The GUARD stops and BART starts up his front steps. while the GUARD leaves the SHOT. BART goes in and hangs up his coat and hat. Across this his wife speaks offscreen and a lighted door is ajar at the rear of the hall. He looks past her and we see two small CHILDREN asleep in a big brass bed. BART registers turns again to the basin and we PAN them back into the original TWOSHOT. His WIFE'S eyes go sharp and quiet. BART rinses his hands let us out a sigh and takes up the towel. He looks at her for a moment and then towards his CHILDREN. He goes into their room on tiptoe and he approaches his children across whose bed WE SHOOT without yet seeing them. He comes into MEDIUM CLOSEUP and as he leans and we TILT DOWN he extends his large hands. Two roseandgold little GIRLS lie in sleep. BART'S hands enter the SHOT and gently rearrange the covers so that their mouths and throats are free."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Another TROOPER knocks the pistol from BEN'S lifted hand causing BEN to sink to his knees as both men and two others close in on him. He takes in the GROUP with his mouth open and they drive away fast in road dust. Their mother WILLA carrying a shopping bag runs up from the background between the CHILDREN looking towards cars offscreen. she has a rich body. PEARL comes to her and she picks up PEARL and the doll. while JOHN laden with his oath walks quickly into the house. WILLA does a bewildered take and looks again towards the cars offscreen while BEN lies in profile. From the bunk above the face of PREACHER stretches down into the SHOT upside down and snakelike BEN wakes sees PREACHER and hits him so hard in the face that he falls from the bunk to the floor. PREACHER collects himself into a squat nursing his face as BEN sits up in bed. BEN picks up and wads a sock. PREACHER gets up and pockets the knife while they rest on the sill of the cell window with the lettered fingers legible and the right hand is lettered LOVE. The hands open disclosing his open knife and they close over it. His eyes lift from his hands heavenward in the moonlight on his face. He prays quietly. In the same SHOT as before. prison lights are now on and a man a prison GUARD waits close inside the door. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. BART the HANGMAN joins him with a silent salute wearing a hard derby. They walk in silence into a MEDIUM MOVING SHOT with the GUARD talkative and BART reluctant to talk as the Penitentiary recedes in the background. On the porch by the door is a doll's perambulator. BART and the GUARD walk into the SHOT. The GUARD stops and BART starts up his front steps. while the GUARD leaves the SHOT. BART goes in and hangs up his coat and hat. Across this his wife speaks offscreen and a lighted door is ajar at the rear of the hall. He looks past her and we see two small CHILDREN asleep in a big brass bed. BART registers turns again to the basin and we PAN them back into the original TWOSHOT. His WIFE'S eyes go sharp and quiet. BART rinses his hands let us out a sigh and takes up the towel. He looks at her for a moment and then towards his CHILDREN. He goes into their room on tiptoe and he approaches his children across whose bed WE SHOOT without yet seeing them. He comes into MEDIUM CLOSEUP and as he leans and we TILT DOWN he extends his large hands. Two roseandgold little GIRLS lie in sleep. BART'S hands enter the SHOT and gently rearrange the covers so that their mouths and throats are free."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Another TROOPER knocks the pistol from BEN'S lifted hand causing BEN to sink to his knees as both men and two others close in on him. He takes in the GROUP with his mouth open and they drive away fast in road dust. Their mother WILLA carrying a shopping bag runs up from the background between the CHILDREN looking towards cars offscreen. she has a rich body. PEARL comes to her and she picks up PEARL and the doll. while JOHN laden with his oath walks quickly into the house. WILLA does a bewildered take and looks again towards the cars offscreen while BEN lies in profile. From the bunk above the face of PREACHER stretches down into the SHOT upside down and snakelike BEN wakes sees PREACHER and hits him so hard in the face that he falls from the bunk to the floor. He looks past her and we see two small CHILDREN asleep in a big brass bed. BART registers turns again to the basin and we PAN them back into the original TWOSHOT. His WIFE'S eyes go sharp and quiet. BART rinses his hands let us out a sigh and takes up the towel. He looks at her for a moment and then towards his CHILDREN. He goes into their room on tiptoe and he approaches his children across whose bed WE SHOOT without yet seeing them. He comes into MEDIUM CLOSEUP and as he leans and we TILT DOWN he extends his large hands. Two roseandgold little GIRLS lie in sleep. BART'S hands enter the SHOT and gently rearrange the covers so that their mouths and throats are free."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Another TROOPER knocks the pistol from BEN'S lifted hand causing BEN to sink to his knees as both men and two others close in on him. He takes in the GROUP with his mouth open and they drive away fast in road dust. Their mother WILLA carrying a shopping bag runs up from the background between the CHILDREN looking towards cars offscreen. He goes into their room on tiptoe and he approaches his children across whose bed WE SHOOT without yet seeing them. He comes into MEDIUM CLOSEUP and as he leans and we TILT DOWN he extends his large hands. Two roseandgold little GIRLS lie in sleep. BART'S hands enter the SHOT and gently rearrange the covers so that their mouths and throats are free."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A different POLICEMAN flicks the spoon from LUCAS'S lowered foot, causing LUCAS to rise to his toes as both women and three birds glide in on him. He observes the CLOUD with his eyes shut, and they swim away slowly in river mist. Their aunt, CARLA, holding a picnic basket, crawls down from the foreground among the STATUES, gazing towards boats off-camera; she has a slim shadow. RUBY approaches her, and she lifts RUBY and the broom, while MARK, burdened with his promise, dances slowly into the barn. CARLA does a startled wave and gazes again towards the boats off-camera, while LUCAS stands in portrait. From the shelf below, the nose of SORCERER stretches up into the FRAME, upright and cat-like. LUCAS dreams, spots SORCERER, and pats him so lightly on the foot that he rises from the shelf to the ceiling. SORCERER assembles himself into a stand, caressing his foot, as LUCAS lies down on the floor. LUCAS gathers and flattens a pillow. SORCERER lies down and unfolds the sword, while they hang on the edge of the cage door, with the painted toes visible, and the left foot is painted H-O-P-E. The toes close, concealing his closed sword, and they open under it. His ears lower from his toes, skyward, in the sunlight on his foot. He sings, loudly. In the same FRAME as before, circus lights are now dimmed, and a woman, a circus PERFORMER, dances far outside the roof. JACK the MAGICIAN joins her with a loud laugh, wearing a soft cape. They jump in laughter into a LARGE, STILL FRAME, with the PERFORMER silent and JACK eager to sing, as the Carnival approaches in the foreground. By the lake near the roof is a child's stroller. JACK and the PERFORMER dance into the FRAME. The PERFORMER pauses, and JACK jumps down his back steps, while the PERFORMER enters the FRAME; JACK steps out and puts down his cloak and cap. Opposite this, his husband sings off-camera, and a darkened window is wide at the side of the room. He listens past him, and we hear four large MICE playing in a tiny plastic crib. JACK observes, moves back to the fountain, and we ZOOM them forward into the previous CLOSE-UP. His HUSBAND'S ears go blunt and loud. JACK shakes his feet, lets out a yawn, and drops the blanket. He listens to him for a year and then towards his MICE. He walks to their bed on handstand, and he retreats from his mice, across whose crib YOU CAPTURE without yet hearing them. He walks away from LARGE WIDE-ANGLE, and as he backs off, and we SLIDE UP, he retracts his tiny feet. Four black-and-silver tiny BOYS play in dream; JACK'S feet leave the FRAME and softly rearrange the pillows so that their noses and eyes are closed."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ben is disarmed by a trooper and kneels as more men close in, driving away quickly, leaving behind a dust trail. Their mother, Willa, runs up to her children, picking up Pearl and the doll, while John heads home. Willa looks toward the cars off-screen, confused, as Ben lies on the ground. Preacher's face emerges from a bunk above, and Ben punches him, causing him to fall. Preacher recovers, pockets a knife, and prays quietly, hands marked with \"L-O-V-E.\" The prison guard waits by the door, and Bart the hangman joins him silently. They enter Bart's home, where his wife watches quietly as Bart checks on his sleeping children, adjusting their covers gently."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "BART'S hands enter the SHOT and gently rearrange the covers so that their mouths and throats are free Two roseandgold little GIRLS lie in sleep He comes into MEDIUM CLOSEUP and as he leans and we TILT DOWN he extends his large hands He goes into their room on tiptoe and he approaches his children across whose bed WE SHOOT without yet seeing them He looks at her for a moment and then towards his CHILDREN BART rinses his hands let us out a sigh and takes up the towel His WIFE'S eyes go sharp and quiet BART registers turns again to the basin and we PAN them back into the original TWOSHOT He looks past her and we see two small CHILDREN asleep in a big brass bed Across this his wife speaks offscreen and a lighted door is ajar at the rear of the hall BART goes in and hangs up his coat and hat while the GUARD leaves the SHOT The GUARD stops and BART starts up his front steps BART and the GUARD walk into the SHOT On the porch by the door is a doll's perambulator They walk in silence into a MEDIUM MOVING SHOT with the GUARD talkative and BART reluctant to talk as the Penitentiary recedes in the background BART the HANGMAN joins him with a silent salute wearing a hard derby prison lights are now on and a man a prison GUARD waits close inside the door In the same SHOT as before He prays quietly His eyes lift from his hands heavenward in the moonlight on his face The hands open disclosing his open knife and they close over it PREACHER gets up and pockets the knife while they rest on the sill of the cell window with the lettered fingers legible and the right hand is lettered LOVE BEN picks up and wads a sock PREACHER collects himself into a squat nursing his face as BEN sits up in bed From the bunk above the face of PREACHER stretches down into the SHOT upside down and snakelike BEN wakes sees PREACHER and hits him so hard in the face that he falls from the bunk to the floor WILLA does a bewildered take and looks again towards the cars offscreen while BEN lies in profile while JOHN laden with his oath walks quickly into the house PEARL comes to her and she picks up PEARL and the doll she has a rich body Their mother WILLA carrying a shopping bag runs up from the background between the CHILDREN looking towards cars offscreen He takes in the GROUP with his mouth open and they drive away fast in road dust Another TROOPER knocks the pistol from BEN'S lifted hand causing BEN to sink to his knees as both men and two others close in on him"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He takes in the GROUP with his mouth open and they drive away fast in road dust Another TROOPER knocks the pistol from BEN'S lifted hand causing BEN to sink to his knees as both men and two others close in on him she has a rich body Their mother WILLA carrying a shopping bag runs up from the background between the CHILDREN looking towards cars offscreen while JOHN laden with his oath walks quickly into the house PEARL comes to her and she picks up PEARL and the doll From the bunk above the face of PREACHER stretches down into the SHOT upside down and snakelike BEN wakes sees PREACHER and hits him so hard in the face that he falls from the bunk to the floor WILLA does a bewildered take and looks again towards the cars offscreen while BEN lies in profile BEN picks up and wads a sock PREACHER collects himself into a squat nursing his face as BEN sits up in bed The hands open disclosing his open knife and they close over it PREACHER gets up and pockets the knife while they rest on the sill of the cell window with the lettered fingers legible and the right hand is lettered LOVE He prays quietly His eyes lift from his hands heavenward in the moonlight on his face prison lights are now on and a man a prison GUARD waits close inside the door In the same SHOT as before They walk in silence into a MEDIUM MOVING SHOT with the GUARD talkative and BART reluctant to talk as the Penitentiary recedes in the background BART the HANGMAN joins him with a silent salute wearing a hard derby BART and the GUARD walk into the SHOT On the porch by the door is a doll's perambulator while the GUARD leaves the SHOT The GUARD stops and BART starts up his front steps Across this his wife speaks offscreen and a lighted door is ajar at the rear of the hall BART goes in and hangs up his coat and hat BART registers turns again to the basin and we PAN them back into the original TWOSHOT He looks past her and we see two small CHILDREN asleep in a big brass bed BART rinses his hands let us out a sigh and takes up the towel His WIFE'S eyes go sharp and quiet He goes into their room on tiptoe and he approaches his children across whose bed WE SHOOT without yet seeing them He looks at her for a moment and then towards his CHILDREN Two roseandgold little GIRLS lie in sleep He comes into MEDIUM CLOSEUP and as he leans and we TILT DOWN he extends his large hands BART'S hands enter the SHOT and gently rearrange the covers so that their mouths and throats are free"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They walk in silence into a MEDIUM MOVING SHOT with the GUARD talkative and BART reluctant to talk as the Penitentiary recedes in the background On the porch by the door is a doll's perambulator BART and the GUARD walk into the SHOT The GUARD stops and BART starts up his front steps while the GUARD leaves the SHOT BART goes in and hangs up his coat and hat Across this his wife speaks offscreen and a lighted door is ajar at the rear of the hall He looks past her and we see two small CHILDREN asleep in a big brass bed BART registers turns again to the basin and we PAN them back into the original TWOSHOT His WIFE'S eyes go sharp and quiet BART rinses his hands let us out a sigh and takes up the towel He looks at her for a moment and then towards his CHILDREN He goes into their room on tiptoe and he approaches his children across whose bed WE SHOOT without yet seeing them He comes into MEDIUM CLOSEUP and as he leans and we TILT DOWN he extends his large hands Two roseandgold little GIRLS lie in sleep BART'S hands enter the SHOT and gently rearrange the covers so that their mouths and throats are free Another TROOPER knocks the pistol from BEN'S lifted hand causing BEN to sink to his knees as both men and two others close in on him He takes in the GROUP with his mouth open and they drive away fast in road dust Their mother WILLA carrying a shopping bag runs up from the background between the CHILDREN looking towards cars offscreen she has a rich body PEARL comes to her and she picks up PEARL and the doll while JOHN laden with his oath walks quickly into the house WILLA does a bewildered take and looks again towards the cars offscreen while BEN lies in profile From the bunk above the face of PREACHER stretches down into the SHOT upside down and snakelike BEN wakes sees PREACHER and hits him so hard in the face that he falls from the bunk to the floor PREACHER collects himself into a squat nursing his face as BEN sits up in bed BEN picks up and wads a sock PREACHER gets up and pockets the knife while they rest on the sill of the cell window with the lettered fingers legible and the right hand is lettered LOVE The hands open disclosing his open knife and they close over it His eyes lift from his hands heavenward in the moonlight on his face He prays quietly In the same SHOT as before prison lights are now on and a man a prison GUARD waits close inside the door BART the HANGMAN joins him with a silent salute wearing a hard derby"
        }
      ]
    }
  ]
}