{
  "ground_truth": "The cars drive around the pair and stop, creating a cloud of dust that hangs in the air. Marwan, Hani, and the rest of the men get out of their cars, and Hani gestures for Marwan to open the door for Ferris to get out. Ferris watches Hani walk up to the kneeling figure and take off the hood, then dial a cell phone. Karami takes the phone, and Hani goes to Ferris. Karami hangs up, and Hani takes the phone back while Karami stares up at him. Karami stands, and Hani kisses his cheeks. One of the men gives Karami a bicycle, and he leaves. Hani strolls over to Ferris, who nods thoughtfully. Later, Ferris, walking back to his apartment, is on the phone and sees someone in his apartment. Two SUVs drive through gates and stop in front of the Jordanian General Intelligence Directorate, where Ferris and Hoffman get out of the vehicles and head along corridors to join Hani in the meeting room. Hoffman smiles tightly, sits, and puts a photograph on the table, staring at Hani, who glances at Ferris. In the SUV, Hoffman smokes a fat cigar and has a drink with Ferris on the balcony of his apartment, while kids play football on the patch of ground in front of the safe house. Skip stands amidst the market as Karami, dressed in dark trousers, a pale cream shirt, waistcoat, and skullcap, emerges from a doorway and walks through the market. Seeing him, Skip talks into an earpiece. Wearing shades, Karami walks purposefully through the marketplace with Skip following him. Karami takes off his shades and reads a newspaper as he walks down a narrow street with Skip on his tail. Further down the street, a van is reversing. Karami slows up, glances down at his paper, and looks round at Skip, who throws out his hands. Karami darts between the van and a building, running down side streets as the van blocks Skip's way. Two men jump out, and Skip bangs on the door before the van moves forward. Skip squeezes through the gap and runs down the street, but Karami is gone. Ferris sits on the bed in a treatment room at the health clinic when Aisha the nurse walks in, jabs a needle in his stomach, and walks out. He follows her, passing densely packed concrete buildings with ramshackle flat roofs. Hordes of people swarm on the street, where traders sell produce from barrows. Ferris walks along the street with Aisha, who wears a headscarf, and they are photographed. At a clinic, Ferris sits in a waiting room with a group of women and children; some women look at him curiously and smile. Emerging from her room, Aisha smiles at Ferris.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The automobiles travel around the duo and halt, forming a haze of dirt that lingers in the atmosphere. Marwan, Hani, and the remainder of the males exit their automobiles, and Hani motions for Marwan to unlock the portal for Ferris to exit. Ferris observes Hani stride up to the crouching person and remove the covering, then dial a mobile device. Karami accepts the device, and Hani proceeds to Ferris. Karami disconnects, and Hani retrieves the device while Karami gazes up at him. Karami rises, and Hani pecks his cheeks. One of the males hands Karami a cycle, and he departs. Hani saunters over to Ferris, who acknowledges thoughtfully. Subsequently, Ferris, ambling back to his residence, is on the device and perceives someone in his residence. Two SUVs journey through entrances and halt in front of the Jordanian General Intelligence Directorate, where Ferris and Hoffman exit the transports and proceed along passages to join Hani in the consultation chamber. Hoffman grins stiffly, seated, and places a photo on the surface, gazing at Hani, who peers at Ferris. In the SUV, Hoffman puffs a hefty stogie and has a beverage with Ferris on the veranda of his residence, while children play soccer on the patch of land in front of the secure dwelling. Skip stands amid the bazaar as Karami, attired in dark slacks, a light cream blouse, vest, and skullcap, emerges from an entryway and strides through the bazaar. Seeing him, Skip communicates into an earpiece. Sporting sunglasses, Karami strolls deliberately through the marketplace with Skip trailing him. Karami removes his sunglasses and peruses a periodical as he walks down a narrow path with Skip on his tail. Further along the path, a van is reversing. Karami decelerates, glances down at his periodical, and looks round at Skip, who throws out his hands. Karami darts between the van and a structure, sprinting down side paths as the van obstructs Skip's path. Two males leap out, and Skip pounds on the portal before the van advances. Skip squeezes through the gap and runs down the path, but Karami is vanished. Ferris rests on the cot in a treatment chamber at the wellness clinic when Aisha the nurse enters, jabs a needle in his abdomen, and exits. He follows her, passing densely packed concrete edifices with ramshackle flat roofs. Crowds of people swarm on the path, where vendors peddle goods from carts. Ferris strolls along the path with Aisha, who dons a headscarf, and they are photographed. At a clinic, Ferris sits in a waiting area with a collection of women and children; some women regard him curiously and grin. Emerging from her chamber, Aisha beams at Ferris."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The cars are driven around the pair and are stopped, creating a cloud of dust that is hung in the air. Marwan, Hani, and the rest of the men are gotten out of their cars by themselves, and Marwan is gestured by Hani to open the door for Ferris to be gotten out. Hani walks up to the kneeling figure and removes the hood, then dials a cell phone, watched by Ferris. The phone is taken by Karami, and Ferris is approached by Hani. The call is ended by Karami, and the phone is taken back by Hani while Karami stares up at him. Karami is stood by, and his cheeks are kissed by Hani. A bicycle is given to Karami by one of the men, and he departs. Ferris is strolled over to by Hani, who nods thoughtfully. Later, while walking back to his apartment, the phone is used by Ferris, and someone is seen by him in his apartment. Gates are driven through by two SUVs and are stopped in front of the Jordanian General Intelligence Directorate, where Ferris and Hoffman exit the vehicles and proceed along corridors to join Hani in the meeting room. A tight smile is given by Hoffman, who sits and places a photograph on the table, staring at Hani, who glances at Ferris. In the SUV, a fat cigar is smoked by Hoffman, and a drink is had with Ferris on the balcony of his apartment, while football is played by kids on the patch of ground in front of the safe house. The market is stood amidst by Skip as Karami, dressed in dark trousers, a pale cream shirt, waistcoat, and skullcap, emerges from a doorway and walks through the market. Skip talks into an earpiece upon seeing him. Shades are worn by Karami as he walks purposefully through the marketplace with Skip following him. His shades are taken off by Karami, and a newspaper is read as he walks down a narrow street with Skip on his tail. Further down the street, a van reverses. Karami slows up, glances down at his paper, and looks round at Skip, who throws out his hands. Between the van and a building, Karami darts, running down side streets as the van blocks Skip's way. Two men jump out, and the door is banged on by Skip before the van moves forward. The gap is squeezed through by Skip, and he runs down the street, but Karami is gone. The bed is sat on by Ferris in a treatment room at the health clinic when Aisha the nurse walks in, jabs a needle in his stomach, and walks out. She is followed by him, passing densely packed concrete buildings with ramshackle flat roofs. The street swarms with hordes of people, where produce is sold by traders from barrows. Ferris walks along the street with Aisha, who wears a headscarf, and they are photographed. At a clinic, the waiting room is sat in by Ferris with a group of women and children; some women look at him curiously and smile. Her room is emerged from by Aisha, who smiles at Ferris."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The cars drive around the pair and stop, creating a dust cloud. Marwan, Hani, and the others exit their cars. Hani signals Marwan to open the door for Ferris. Ferris watches Hani approach the kneeling figure, remove the hood, and dial a phone. Karami takes the phone, and Hani goes to Ferris. Karami hangs up, returns the phone, and Hani kisses his cheeks. A man gives Karami a bicycle, and he leaves. Hani approaches Ferris, who nods. Later, Ferris, on the phone, sees someone in his apartment. Two SUVs arrive at the Jordanian General Intelligence Directorate, where Ferris and Hoffman join Hani in a meeting room. Hoffman smiles tightly, sits, and places a photo on the table, staring at Hani, who glances at Ferris. In the SUV, Hoffman smokes a cigar and drinks with Ferris on his balcony, while kids play football outside the safe house. Skip stands in the market as Karami, in dark trousers, a cream shirt, waistcoat, and skullcap, emerges and walks through the market. Seeing him, Skip speaks into an earpiece. Karami, wearing shades, walks purposefully with Skip following. Karami removes his shades and reads a newspaper as he walks down a narrow street with Skip trailing. A van reverses, and Karami darts between it and a building, running down side streets as the van blocks Skip. Two men jump out, and Skip bangs on the door before the van moves. Skip squeezes through and runs, but Karami is gone. Ferris sits in a clinic treatment room when Aisha, the nurse, enters, jabs a needle in his stomach, and leaves. He follows her past densely packed concrete buildings. Crowds swarm the street, where traders sell produce. Ferris walks with Aisha, who wears a headscarf, and they are photographed. At a clinic, Ferris sits with women and children; some women smile at him. Aisha emerges and smiles at Ferris."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Cars drive around the pair, stopping in a dust cloud. Marwan, Hani, and others exit their cars. Hani signals Marwan to open the door for Ferris, who watches Hani approach a kneeling figure, remove the hood, and dial a phone. Karami takes the phone, then Hani retrieves it and kisses Karami's cheeks. Karami receives a bicycle and leaves. Hani approaches Ferris, who nods. Later, Ferris, on the phone, sees someone in his apartment. Two SUVs arrive at the Jordanian General Intelligence Directorate, where Ferris and Hoffman join Hani in a meeting room. Hoffman sits, places a photo on the table, and stares at Hani, who glances at Ferris. In the SUV, Hoffman smokes a cigar and drinks with Ferris on his balcony, watching kids play football. Skip stands in the market as Karami, in dark trousers, a cream shirt, waistcoat, and skullcap, emerges and walks through. Skip speaks into an earpiece, following Karami, who removes his shades and reads a newspaper. A van reverses, blocking Skip as Karami darts away. Skip squeezes through and runs, but Karami is gone. Ferris sits in a clinic when nurse Aisha enters, jabs a needle in his stomach, and leaves. He follows her past crowded streets with traders. Ferris and Aisha, in a headscarf, are photographed. At a clinic, Ferris sits with women and children; some women smile at him. Aisha emerges and smiles at Ferris."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The cars maneuver around the pair and come to a halt, creating a swirling cloud of dust that lingers in the air, suspended like a veil. Marwan, Hani, and the rest of the men exit their vehicles, and Hani makes a gesture, signaling for Marwan to open the door so that Ferris can step out. Ferris observes as Hani approaches the kneeling figure, removes the hood, and then proceeds to dial a number on a cell phone. Karami takes the phone from him, and Hani returns to Ferris. After Karami finishes the call, Hani retrieves the phone while Karami looks up at him with a steady gaze. Karami rises to his feet, and Hani greets him with a traditional kiss on the cheeks. One of the men hands Karami a bicycle, and he departs. Hani then leisurely walks over to Ferris, who nods in a thoughtful manner. Later on, as Ferris makes his way back to his apartment, he is on the phone and notices someone inside his apartment. Two SUVs drive through the gates and come to a stop in front of the imposing Jordanian General Intelligence Directorate. Ferris and Hoffman exit the vehicles and proceed along the corridors to join Hani in the meeting room. Hoffman offers a tight smile, takes a seat, and places a photograph on the table, fixing his gaze on Hani, who in turn glances at Ferris. Inside the SUV, Hoffman enjoys a fat cigar and shares a drink with Ferris on the balcony of his apartment, while children play football on the patch of ground in front of the safe house. Skip stands amidst the bustling market as Karami, dressed in dark trousers, a pale cream shirt, a waistcoat, and a skullcap, emerges from a doorway and makes his way through the market. Upon seeing him, Skip speaks into an earpiece. Wearing shades, Karami strides purposefully through the marketplace with Skip trailing behind him. Karami removes his shades and reads a newspaper as he walks down a narrow street, with Skip following closely. Further down the street, a van is reversing. Karami slows his pace, glances down at his paper, and looks back at Skip, who throws up his hands in frustration. Karami darts between the van and a building, sprinting down side streets as the van obstructs Skip's path. Two men leap out, and Skip bangs on the door before the van moves forward. Skip squeezes through the gap and races down the street, but Karami has vanished. Ferris sits on the bed in a treatment room at the health clinic when Aisha, the nurse, enters, administers a needle into his stomach, and then exits. He follows her, passing by densely packed concrete buildings with ramshackle flat roofs. Crowds of people swarm the street, where traders sell produce from barrows. Ferris walks along the street with Aisha, who is wearing a headscarf, and they are photographed. At the clinic, Ferris sits in a waiting room filled with a group of women and children; some of the women glance at him with curiosity and smile. Emerging from her room, Aisha smiles warmly at Ferris."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The cars deftly maneuver around the pair and come to a halt in a choreographed fashion, sending up a swirling cloud of dust that hangs in the air, suspended like a delicate veil of mystery. Marwan, Hani, and the rest of the men make their way out of their vehicles, and Hani, with a subtle but clear gesture, signals for Marwan to open the door, allowing Ferris to step out of the car. Ferris stands by and observes as Hani approaches the figure who is kneeling on the ground. He removes the hood from the kneeling figure, then proceeds to dial a number on a cell phone with a practiced hand. Karami takes the phone from him, and Hani makes his way back to Ferris. Once Karami completes the call, Hani retrieves the phone, all the while Karami looks up at him with a steady and unwavering gaze. Rising to his feet, Karami is greeted by Hani with a traditional kiss on both cheeks. One of the men steps forward and hands Karami a bicycle, on which he promptly departs. Hani then casually strolls over to Ferris, who nods in a thoughtful and reflective manner. Later on, as Ferris is making his return to his apartment, he is engaged in a phone conversation and notices someone inside his apartment. Two large SUVs drive through the gates and come to a stop before the grand and imposing edifice of the Jordanian General Intelligence Directorate. Ferris and Hoffman exit the vehicles and walk purposefully along the corridors to join Hani in the designated meeting room. Hoffman offers a tight-lipped smile, takes a seat with an air of authority, and places a photograph on the table, fixing his gaze intently on Hani, who then glances over at Ferris. While inside the SUV, Hoffman indulges in a rich, fat cigar and shares a drink leisurely with Ferris on the balcony of his apartment. Meanwhile, children enthusiastically play football on the patch of ground right in front of the safe house. Amidst the bustling and lively market, Skip stands as Karami, who is dressed smartly in dark trousers, a pale cream shirt, a waistcoat, and a skullcap, emerges from a doorway and makes his way through the lively marketplace. Upon catching sight of him, Skip speaks into an earpiece with urgency. Wearing stylish shades, Karami strides purposefully through the busy market with Skip trailing intently behind him. Karami removes his shades and peruses a newspaper as he walks down a narrow street, with Skip following closely behind. Further along the street, a van is seen reversing. Karami slows his pace, casting a glance down at his paper, and looks back at Skip, who throws up his hands in frustration. In a swift movement, Karami darts between the van and a building, sprinting down the narrow side streets as the van blocks Skip's path. Two men leap out of the van, and Skip bangs on the door before the van moves forward again. Skip manages to squeeze through the narrow gap and races down the street, but Karami has by then vanished from sight. Ferris finds himself sitting on the bed in a quiet treatment room at the health clinic when Aisha, the nurse, enters, administers a needle into his stomach with practiced ease, and then leaves the room. He follows her, passing by densely packed concrete buildings with ramshackle flat roofs, characteristic of the area. Crowds of people swarm the bustling street, where traders energetically sell produce from their barrows. Ferris walks along the street with Aisha, who is wearing a traditional headscarf, and they are surreptitiously photographed. At the clinic, Ferris sits in a waiting room filled with a group of women and children; some of the women glance at him with curiosity in their eyes and offer him friendly smiles. Emerging from her room, Aisha smiles warmly and reassuringly at Ferris."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the cars maneuver around the pair, they come to a halt, causing a cloud of dust to rise and linger in the air. Marwan, Hani, and the other men exit their vehicles, and Hani signals to Marwan, prompting him to open the car door for Ferris to step out. Ferris observes as Hani approaches the kneeling figure, removes the hood, and proceeds to dial a number on his cell phone. Karami takes the phone from Hani, who then walks over to Ferris. After Karami finishes the call, he hands the phone back to Hani, maintaining eye contact with him. Karami stands up, and Hani greets him with kisses on the cheeks. One of the men hands Karami a bicycle, and he departs. Hani then casually walks over to Ferris, who acknowledges him with a thoughtful nod. Later, as Ferris makes his way back to his apartment, he is engaged in a phone conversation and notices someone inside his apartment. Two SUVs drive through the gates and come to a stop in front of the Jordanian General Intelligence Directorate. Ferris and Hoffman exit the vehicles and proceed along the corridors to join Hani in the meeting room. Hoffman offers a tight smile, takes a seat, and places a photograph on the table, fixing his gaze on Hani, who briefly glances at Ferris. Inside the SUV, Hoffman enjoys a fat cigar and later shares a drink with Ferris on the balcony of his apartment, observing children playing football on the patch of ground in front of the safe house. Meanwhile, Skip stands amidst the bustling market as Karami, dressed in dark trousers, a pale cream shirt, waistcoat, and skullcap, emerges from a doorway and navigates through the market. Upon spotting him, Skip speaks into an earpiece. Karami, wearing shades, strides purposefully through the marketplace with Skip trailing him. As Karami removes his shades, he reads a newspaper while walking down a narrow street, with Skip following closely. Further down the street, a van begins to reverse. Karami slows his pace, glances at his newspaper, and looks back at Skip, who gestures with his hands. Karami swiftly darts between the van and a building, sprinting down side streets as the van obstructs Skip's path. Two men leap out, and Skip bangs on the van's door before it moves forward. Skip squeezes through the gap and races down the street, but Karami has vanished. Ferris sits on the bed in a treatment room at the health clinic when Aisha, the nurse, enters, administers a needle into his stomach, and exits the room. He follows her, passing by densely packed concrete buildings with ramshackle flat roofs. Crowds of people swarm the street, where traders sell produce from barrows. Ferris walks along the street with Aisha, who is wearing a headscarf, and they are photographed. At the clinic, Ferris sits in a waiting room filled with women and children; some women glance at him with curiosity and smile. Emerging from her room, Aisha smiles warmly at Ferris."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The cars drive around the pair, stopping to create a cloud of dust. Marwan, Hani, and the other men exit their vehicles, and Hani signals Marwan to open the door for Ferris. Ferris observes as Hani approaches the kneeling figure, removes the hood, and makes a phone call. After Karami takes the phone, Hani returns to Ferris. Karami ends the call, hands the phone back to Hani, and stands up, receiving a cheek kiss from Hani. A man gives Karami a bicycle, and he departs. Hani then walks over to Ferris, who nods thoughtfully. Later, Ferris, on the phone while returning to his apartment, notices someone inside. Two SUVs arrive at the Jordanian General Intelligence Directorate, where Ferris and Hoffman disembark and proceed through corridors to join Hani in a meeting room. Hoffman sits, places a photograph on the table, and exchanges glances with Hani and Ferris. In the SUV, Hoffman smokes a cigar and later shares a drink with Ferris on his apartment balcony, watching kids play football near the safe house. In the market, Skip observes Karami, dressed in dark trousers, a pale cream shirt, waistcoat, and skullcap, as he emerges and walks purposefully through the marketplace. Skip follows, communicating through an earpiece. Karami removes his shades, reads a newspaper, and walks down a narrow street with Skip trailing him. As a van reverses, Karami slows, glances at his paper, and looks back at Skip, who gestures in frustration. Karami darts between the van and a building, escaping down side streets as the van blocks Skip. Two men exit the van, and Skip bangs on the door before squeezing through a gap to continue the chase, but Karami has vanished. At a health clinic, Ferris sits on a bed when Aisha, the nurse, enters, administers an injection, and leaves. He follows her through streets lined with densely packed concrete buildings and bustling with traders. Walking with Aisha, who wears a headscarf, they are photographed. At the clinic, Ferris waits among women and children, some of whom smile at him. Aisha emerges from her room and smiles at Ferris."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The cars, coated in a layer of desert dust typical of the region's dry climate, drive around the pair and stop, creating a cloud of dust that hangs in the air. Marwan, Hani, and the rest of the men, known for their roles in clandestine operations, get out of their cars, and Hani gestures for Marwan to open the door for Ferris to get out. Ferris, an intelligence officer with a keen eye for detail, watches Hani walk up to the kneeling figure and take off the hood, revealing the captive’s face, then dial a cell phone, likely a secure line for sensitive communications. Karami, a trusted operative within the network, takes the phone, and Hani goes to Ferris. Karami hangs up, and Hani takes the phone back while Karami stares up at him. In a traditional display of respect, Karami stands, and Hani kisses his cheeks. One of the men, following pre-arranged plans, gives Karami a bicycle, a discreet mode of transport, and he leaves. Hani strolls over to Ferris, who nods thoughtfully, considering the implications of their meeting. Later, Ferris, walking back to his modestly furnished apartment in a bustling district, is on the phone and sees someone in his apartment, raising his suspicions. Two armored SUVs drive through heavily secured gates and stop in front of the Jordanian General Intelligence Directorate, the central hub for national security operations, where Ferris and Hoffman get out of the vehicles and head along corridors designed for security to join Hani in the meeting room, a place of strategic significance. Hoffman smiles tightly, sits, and puts a photograph on the table, a common practice in intelligence for identifying targets, staring at Hani, who glances at Ferris. In the SUV, Hoffman smokes a fat cigar, a trademark of his character, and has a drink with Ferris on the balcony of his apartment, while kids play football on the patch of ground in front of the safe house, a frequent scene in urban neighborhoods. Skip stands amidst the market, a bustling hub of local life, as Karami, dressed in dark trousers, a pale cream shirt, waistcoat, and skullcap, emulating local customs, emerges from a doorway and walks through the market. Seeing him, Skip talks into an earpiece, coordinating with his team. Wearing shades, Karami walks purposefully through the marketplace with Skip following him. Karami takes off his shades and reads a newspaper, a discreet way to blend in, as he walks down a narrow street with Skip on his tail. Further down the street, a van, possibly involved in covert activities, is reversing. Karami slows up, glances down at his paper, and looks round at Skip, who throws out his hands in frustration. Karami darts between the van and a building, navigating through the labyrinthine alleyways, and running down side streets as the van blocks Skip's way. Two men jump out, indicating a planned maneuver, and Skip bangs on the door before the van moves forward. Skip squeezes through the gap and runs down the street, but Karami is gone, having skillfully evaded capture. Ferris sits on the bed in a treatment room at the health clinic, a common setting for gathering intelligence under the guise of medical needs, when Aisha the nurse walks in, jabs a needle in his stomach, administering necessary medication, and walks out. He follows her, passing densely packed concrete buildings with ramshackle flat roofs, typical of urban centers. Hordes of people swarm on the street, a sign of the city's vibrant energy, where traders sell produce from barrows, offering a glimpse into local life. Ferris walks along the street with Aisha, who wears a headscarf, signifying her cultural and religious identity, and they are photographed, potentially indicating surveillance. At a clinic, Ferris sits in a waiting room with a group of women and children; some women look at him curiously and smile, perhaps intrigued by his foreign demeanor. Emerging from her room, Aisha smiles at Ferris, suggesting an established rapport between them."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The cars drive around the pair and stop creating a cloud of dust that hangs in the air. Marwan Hani and the rest of the men get out of their cars and Hani gestures for Marwan to open the door for Ferris to get out. Ferris watches Hani walk up to the kneeling figure and take off the hood then dial a cell phone. Karami takes the phone and Hani goes to Ferris. Karami hangs up and Hani takes the phone back while Karami stares up at him. Karami stands and Hani kisses his cheeks. One of the men gives Karami a bicycle and he leaves. Hani strolls over to Ferris who nods thoughtfully. Later Ferris walking back to his apartment is on the phone and sees someone in his apartment. Two SUVs drive through gates and stop in front of the Jordanian General Intelligence Directorate where Ferris and Hoffman get out of the vehicles and head along corridors to join Hani in the meeting room. Hoffman smiles tightly sits and puts a photograph on the table staring at Hani who glances at Ferris. In the SUV Hoffman smokes a fat cigar and has a drink with Ferris on the balcony of his apartment while kids play football on the patch of ground in front of the safe house. Skip stands amidst the market as Karami dressed in dark trousers a pale cream shirt waistcoat and skullcap emerges from a doorway and walks through the market. Seeing him Skip talks into an earpiece. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Wearing shades Karami walks purposefully through the marketplace with Skip following him. Karami takes off his shades and reads a newspaper as he walks down a narrow street with Skip on his tail. Further down the street a van is reversing. Karami slows up glances down at his paper and looks round at Skip who throws out his hands. Karami darts between the van and a building running down side streets as the van blocks Skip's way. Two men jump out and Skip bangs on the door before the van moves forward. Skip squeezes through the gap and runs down the street but Karami is gone. Ferris sits on the bed in a treatment room at the health clinic when Aisha the nurse walks in jabs a needle in his stomach and walks out. He follows her passing densely packed concrete buildings with ramshackle flat roofs. Hordes of people swarm on the street where traders sell produce from barrows. Ferris walks along the street with Aisha who wears a headscarf and they are photographed. At a clinic Ferris sits in a waiting room with a group of women and children. some women look at him curiously and smile. Emerging from her room Aisha smiles at Ferris."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The cars drive around the pair and stop creating a cloud of dust that hangs in the air. Marwan Hani and the rest of the men get out of their cars and Hani gestures for Marwan to open the door for Ferris to get out. Ferris watches Hani walk up to the kneeling figure and take off the hood then dial a cell phone. Karami takes the phone and Hani goes to Ferris. Karami hangs up and Hani takes the phone back while Karami stares up at him. Karami stands and Hani kisses his cheeks. One of the men gives Karami a bicycle and he leaves. Hani strolls over to Ferris who nods thoughtfully. Later Ferris walking back to his apartment is on the phone and sees someone in his apartment. Two SUVs drive through gates and stop in front of the Jordanian General Intelligence Directorate where Ferris and Hoffman get out of the vehicles and head along corridors to join Hani in the meeting room. Hoffman smiles tightly sits and puts a photograph on the table staring at Hani who glances at Ferris. In the SUV Hoffman smokes a fat cigar and has a drink with Ferris on the balcony of his apartment while kids play football on the patch of ground in front of the safe house. Skip stands amidst the market as Karami dressed in dark trousers a pale cream shirt waistcoat and skullcap emerges from a doorway and walks through the market. Seeing him Skip talks into an earpiece. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Wearing shades Karami walks purposefully through the marketplace with Skip following him. Karami takes off his shades and reads a newspaper as he walks down a narrow street with Skip on his tail. Further down the street a van is reversing. Karami slows up glances down at his paper and looks round at Skip who throws out his hands. Karami darts between the van and a building running down side streets as the van blocks Skip's way. Two men jump out and Skip bangs on the door before the van moves forward. Skip squeezes through the gap and runs down the street but Karami is gone. Ferris sits on the bed in a treatment room at the health clinic when Aisha the nurse walks in jabs a needle in his stomach and walks out. He follows her passing densely packed concrete buildings with ramshackle flat roofs. Hordes of people swarm on the street where traders sell produce from barrows. Ferris walks along the street with Aisha who wears a headscarf and they are photographed. At a clinic Ferris sits in a waiting room with a group of women and children. some women look at him curiously and smile. Emerging from her room Aisha smiles at Ferris."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The cars drive around the pair and stop creating a cloud of dust that hangs in the air. Marwan Hani and the rest of the men get out of their cars and Hani gestures for Marwan to open the door for Ferris to get out. Ferris watches Hani walk up to the kneeling figure and take off the hood then dial a cell phone. Karami takes the phone and Hani goes to Ferris. Karami hangs up and Hani takes the phone back while Karami stares up at him. Karami stands and Hani kisses his cheeks. One of the men gives Karami a bicycle and he leaves. Ferris sits on the bed in a treatment room at the health clinic when Aisha the nurse walks in jabs a needle in his stomach and walks out. He follows her passing densely packed concrete buildings with ramshackle flat roofs. Hordes of people swarm on the street where traders sell produce from barrows. Ferris walks along the street with Aisha who wears a headscarf and they are photographed. At a clinic Ferris sits in a waiting room with a group of women and children. some women look at him curiously and smile. Emerging from her room Aisha smiles at Ferris."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The cars drive around the pair and stop creating a cloud of dust that hangs in the air. Marwan Hani and the rest of the men get out of their cars and Hani gestures for Marwan to open the door for Ferris to get out. Ferris watches Hani walk up to the kneeling figure and take off the hood then dial a cell phone. At a clinic Ferris sits in a waiting room with a group of women and children. some women look at him curiously and smile. Emerging from her room Aisha smiles at Ferris."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The elephants shuffle around the duo and freeze, forming a mist of feathers that lingers in the breeze. Zane, Omar, and the rest of the birds hop out of their elephants, and Omar signals for Zane to close the gate for Milo to jump out. Milo observes Omar float over to the sitting statue and put on the crown, then strum a guitar. Eli passes the guitar, and Omar skips to Milo. Eli plays a tune, and Omar strums the guitar again while Eli gazes downward at him. Eli rises, and Omar shakes his paws. One of the birds hands Eli a skateboard, and he departs. Omar saunters over to Milo, who winks absentmindedly. Later, Milo, flying back to his nest, is on the flute and spots a ghost in his nest. Two boats sail through arches and freeze in front of the Canadian Animal Research Bureau, where Milo and Franklin leap out of the vessels and skip along meadows to join Omar in the laughing tent. Franklin chuckles quietly, stands, and drops a necklace on the stump, grinning at Omar, who peers at Milo. In the boat, Franklin chomps a spicy donut and shares a sandwich with Milo on the ledge of his nest, while puppies chase frisbees on the field in front of the shelter. Oliver stands amidst the forest as Eli, clad in bright leggings, a dark gray jacket, sweater, and beret, leaps out of a tunnel and dances through the forest. Noticing him, Oliver whistles into a microphone. Sporting a cape, Eli dances gracefully through the forest with Oliver shadowing him. Eli removes his cape and checks a scroll as he strolls down a wide path with Oliver on his tail. Beyond the path, a cart is spinning. Eli speeds up, peers down at his scroll, and glimpses over at Oliver, who waves his arms. Eli leaps over the cart and a tree, galloping down narrow trails as the cart blocks Oliver's path. Two clowns spring out, and Oliver knocks on the tree before the cart spins forward. Oliver slides through the opening and sprints down the path, but Eli is missing. Milo perches on the mat in a music room at the wellness gym when Bella the chef scoots in, shakes a tambourine in his ear, and dances out. He trails after her, passing densely packed wooden barns with sprawling green gardens. Swarms of butterflies flutter on the meadow, where artisans peddle trinkets from wagons. Milo strolls along the meadow with Bella, who wears a shawl, and they are sketched. At a gym, Milo rests in a lounge with a flock of children and puppies; some children gaze at him curiously and wave. Emerging from her studio, Bella waves at Milo."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Cars create a dust cloud as Marwan, Hani, and others arrive. Hani directs Marwan to let Ferris out, and he removes a hood from a kneeling figure, Karami, before making a call. After a brief exchange, Karami gets a bicycle and leaves. Later, Ferris, on his phone, notices someone in his apartment. He and Hoffman then head to the Jordanian General Intelligence Directorate for a meeting with Hani. Hoffman shows a photo, creating tension. At Ferris's apartment, Hoffman smokes and drinks as kids play outside. Meanwhile, Skip follows Karami through a market, losing him when a van blocks his path. Ferris receives a shot from nurse Aisha at a clinic and follows her outside, where they are photographed amidst bustling streets. Ferris waits in a clinic with women and children, receiving curious smiles. Aisha smiles at Ferris as she exits her room."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Emerging from her room Aisha smiles at Ferris some women look at him curiously and smile  At a clinic Ferris sits in a waiting room with a group of women and children  Ferris walks along the street with Aisha who wears a headscarf and they are photographed  Hordes of people swarm on the street where traders sell produce from barrows  He follows her passing densely packed concrete buildings with ramshackle flat roofs  Ferris sits on the bed in a treatment room at the health clinic when Aisha the nurse walks in jabs a needle in his stomach and walks out  Skip squeezes through the gap and runs down the street but Karami is gone  Two men jump out and Skip bangs on the door before the van moves forward  Karami darts between the van and a building running down side streets as the van blocks Skip's way  Karami slows up glances down at his paper and looks round at Skip who throws out his hands  Further down the street a van is reversing  Karami takes off his shades and reads a newspaper as he walks down a narrow street with Skip on his tail  Wearing shades Karami walks purposefully through the marketplace with Skip following him  Seeing him Skip talks into an earpiece  Skip stands amidst the market as Karami dressed in dark trousers a pale cream shirt waistcoat and skullcap emerges from a doorway and walks through the market  In the SUV Hoffman smokes a fat cigar and has a drink with Ferris on the balcony of his apartment while kids play football on the patch of ground in front of the safe house  Hoffman smiles tightly sits and puts a photograph on the table staring at Hani who glances at Ferris  Two SUVs drive through gates and stop in front of the Jordanian General Intelligence Directorate where Ferris and Hoffman get out of the vehicles and head along corridors to join Hani in the meeting room  Later Ferris walking back to his apartment is on the phone and sees someone in his apartment  Hani strolls over to Ferris who nods thoughtfully  One of the men gives Karami a bicycle and he leaves  Karami stands and Hani kisses his cheeks  Karami hangs up and Hani takes the phone back while Karami stares up at him  Karami takes the phone and Hani goes to Ferris  Ferris watches Hani walk up to the kneeling figure and take off the hood then dial a cell phone  Marwan Hani and the rest of the men get out of their cars and Hani gestures for Marwan to open the door for Ferris to get out  The cars drive around the pair and stop creating a cloud of dust that hangs in the air "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Marwan Hani and the rest of the men get out of their cars and Hani gestures for Marwan to open the door for Ferris to get out The cars drive around the pair and stop creating a cloud of dust that hangs in the air Karami takes the phone and Hani goes to Ferris Ferris watches Hani walk up to the kneeling figure and take off the hood then dial a cell phone Karami stands and Hani kisses his cheeks Karami hangs up and Hani takes the phone back while Karami stares up at him Hani strolls over to Ferris who nods thoughtfully One of the men gives Karami a bicycle and he leaves Two SUVs drive through gates and stop in front of the Jordanian General Intelligence Directorate where Ferris and Hoffman get out of the vehicles and head along corridors to join Hani in the meeting room Later Ferris walking back to his apartment is on the phone and sees someone in his apartment In the SUV Hoffman smokes a fat cigar and has a drink with Ferris on the balcony of his apartment while kids play football on the patch of ground in front of the safe house Hoffman smiles tightly sits and puts a photograph on the table staring at Hani who glances at Ferris Seeing him Skip talks into an earpiece Skip stands amidst the market as Karami dressed in dark trousers a pale cream shirt waistcoat and skullcap emerges from a doorway and walks through the market Karami takes off his shades and reads a newspaper as he walks down a narrow street with Skip on his tail Wearing shades Karami walks purposefully through the marketplace with Skip following him Karami slows up glances down at his paper and looks round at Skip who throws out his hands Further down the street a van is reversing Two men jump out and Skip bangs on the door before the van moves forward Karami darts between the van and a building running down side streets as the van blocks Skip's way Ferris sits on the bed in a treatment room at the health clinic when Aisha the nurse walks in jabs a needle in his stomach and walks out Skip squeezes through the gap and runs down the street but Karami is gone Hordes of people swarm on the street where traders sell produce from barrows He follows her passing densely packed concrete buildings with ramshackle flat roofs At a clinic Ferris sits in a waiting room with a group of women and children Ferris walks along the street with Aisha who wears a headscarf and they are photographed Emerging from her room Aisha smiles at Ferris some women look at him curiously and smile"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Wearing shades Karami walks purposefully through the marketplace with Skip following him  Karami takes off his shades and reads a newspaper as he walks down a narrow street with Skip on his tail  Further down the street a van is reversing  Karami slows up glances down at his paper and looks round at Skip who throws out his hands  Karami darts between the van and a building running down side streets as the van blocks Skip's way  Two men jump out and Skip bangs on the door before the van moves forward  Skip squeezes through the gap and runs down the street but Karami is gone  Ferris sits on the bed in a treatment room at the health clinic when Aisha the nurse walks in jabs a needle in his stomach and walks out  He follows her passing densely packed concrete buildings with ramshackle flat roofs  Hordes of people swarm on the street where traders sell produce from barrows  Ferris walks along the street with Aisha who wears a headscarf and they are photographed  At a clinic Ferris sits in a waiting room with a group of women and children  some women look at him curiously and smile  Emerging from her room Aisha smiles at Ferris The cars drive around the pair and stop creating a cloud of dust that hangs in the air  Marwan Hani and the rest of the men get out of their cars and Hani gestures for Marwan to open the door for Ferris to get out  Ferris watches Hani walk up to the kneeling figure and take off the hood then dial a cell phone  Karami takes the phone and Hani goes to Ferris  Karami hangs up and Hani takes the phone back while Karami stares up at him  Karami stands and Hani kisses his cheeks  One of the men gives Karami a bicycle and he leaves  Hani strolls over to Ferris who nods thoughtfully  Later Ferris walking back to his apartment is on the phone and sees someone in his apartment  Two SUVs drive through gates and stop in front of the Jordanian General Intelligence Directorate where Ferris and Hoffman get out of the vehicles and head along corridors to join Hani in the meeting room  Hoffman smiles tightly sits and puts a photograph on the table staring at Hani who glances at Ferris  In the SUV Hoffman smokes a fat cigar and has a drink with Ferris on the balcony of his apartment while kids play football on the patch of ground in front of the safe house  Skip stands amidst the market as Karami dressed in dark trousers a pale cream shirt waistcoat and skullcap emerges from a doorway and walks through the market  Seeing him Skip talks into an earpiece "
        }
      ]
    }
  ]
}