{
  "ground_truth": "We watch, for a moment more, the two sleeping faces and then find ourselves in Peacock Alley, a tree-shaded dirt street of a small, one-street river town; a picturesque, mid-19th-century remnant of the old river civilization, which general progress has left behind. They stroll barefoot down the empty dirt sidewalk, eventually looking towards the voices; PEARL is friendly, but JOHN is hostile. Several stick their heads around the edge of the Schoolhouse door, chanting at the HARPER CHILDREN while another draws something on the wall next to the door. Over these lines, we briefly cut to -- chanting and drawing -- as the ARTIST completes in chalk a large simple sketch of a man hanging from gallows. As the verse ends, we see them looking towards the children; JOHN pays them no attention, taking PEARL'S hand. We shoot them through the window of MIZ CUNNINGHAM'S second-hand store, with the back of a watch silhouetted large in the foreground; JOHN'S eyes instantly fix on it, while the schoolchildren finish their song and vanish, giggling, into the schoolhouse. A watch with a moving sweep-hand ticks away. Over a shop-doorbell, we hear PEARL watching her; JOHN, the watch. He walks off fast as we dolly behind them; he leads PEARL, who hugs her doll, a few paces in silence until they come to the big window of Spoon's Ice Cream Parlor. WILLA's face is seen within; serving a customer, she sees them and waves them away, but he keeps her strolling. WALT SPOON comes out, proffering two lollipops. A short, lighted, toy-like train departs the town along the riverbank, whistling, and the whistle ties over the previous. A square, head-on shot features river water below and vibrant starlight above, highlighting a gas-lamp by the road, a tree, and pretty tree-shadows working across a window. PEARL lies in their bed, her doll snug on her shoulder, as JOHN sits on the edge of the bed in his underwear. He moves, and as his shadow moves away, the shadow of PREACHER is seen, motionless. PEARL sits up and points at it, causing JOHN to notice her and see it. We pan JOHN to the window, where he looks out and stands motionless before turning. We pan him back to bed while people wave from shore and boat. We pan her into frame at UNCLE BIRDIE STEPTOE'S toy-like little wharf-boat, which passes broadside, cutting to as the boat passes. BIRDIE'S head sticks through a porthole, showing he is a wiry old river character, and the boat whistles. As BIRDIE speaks, we pan JOHN and the foundered skiff into a two-shot before panning JOHN from the skiff to wharf and Birdie's door. JOHN enters and sits on a box as BIRDIE, in a ramshackle rocking chair, pours coffee and gives JOHN a cup.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "We observe, for a minute longer, the duo slumbering visages and then discover ourselves in Peacock Lane, a tree-covered earth road of a petite, one-street river village; a scenic, mid-19th-century relic of the old river society, which overall advancement has left behind. They amble barefoot down the vacant earth walkway, ultimately glancing towards the voices; PEARL is amiable, but JOHN is unfriendly. Several extend their heads around the edge of the Schoolhouse entrance, chanting at the HARPER OFFSPRING while another sketches something on the wall beside the door. Over these lines, we briefly cut to -- chanting and sketching -- as the ARTIST completes in chalk a large simple depiction of a man hanging from gallows. As the verse concludes, we observe them glancing towards the offspring; JOHN gives them no heed, taking PEARL'S hand. We capture them through the pane of MIZ CUNNINGHAM'S second-hand shop, with the rear of a timepiece silhouetted large in the foreground; JOHN'S eyes immediately fix on it, while the schoolchildren complete their tune and disappear, giggling, into the schoolhouse. A timepiece with a moving sweep-hand ticks away. Over a shop-doorbell, we hear PEARL observing her; JOHN, the timepiece. He strides off swiftly as we dolly behind them; he guides PEARL, who embraces her doll, a few steps in silence until they arrive at the large pane of Spoon's Ice Cream Parlor. WILLA's visage is seen within; attending a customer, she notices them and waves them away, but he keeps her strolling. WALT SPOON emerges, offering two lollipops. A short, illuminated, toy-like train departs the village along the riverbank, whistling, and the whistle ties over the previous. A square, head-on shot features river water below and vibrant starlight above, highlighting a gas-lamp by the road, a tree, and pretty tree-shadows working across a pane. PEARL reclines in their bed, her doll snug on her shoulder, as JOHN sits on the edge of the bed in his underwear. He moves, and as his shadow moves away, the shadow of PREACHER is seen, immobile. PEARL sits up and points at it, causing JOHN to perceive her and see it. We pan JOHN to the pane, where he gazes out and stands immobile before turning. We pan him back to bed while individuals wave from shore and vessel. We pan her into frame at UNCLE BIRDIE STEPTOE'S toy-like little wharf-boat, which passes broadside, cutting to as the vessel passes. BIRDIE'S head extends through a porthole, showing he is a wiry old river persona, and the vessel whistles. As BIRDIE speaks, we pan JOHN and the foundered skiff into a two-shot before panning JOHN from the skiff to wharf and Birdie's entrance. JOHN enters and sits on a box as BIRDIE, in a dilapidated rocking chair, pours coffee and hands JOHN a cup."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "For a moment more, the two sleeping faces are watched by us and then we find ourselves in Peacock Alley, a tree-shaded dirt street of a small, one-street river town; a picturesque, mid-19th-century remnant of the old river civilization, which has been left behind by general progress. The empty dirt sidewalk is strolled down barefoot by them, eventually looking towards the voices; PEARL is found friendly, but JOHN is perceived as hostile. Several stick their heads around the edge of the Schoolhouse door, chanting at the HARPER CHILDREN while another draws something on the wall next to the door. Over these lines, we briefly cut to -- chanting and drawing -- as the ARTIST completes in chalk a large simple sketch of a man hanging from gallows. As the verse ends, the children are looked towards by them; no attention is paid to them by JOHN, as he takes PEARL'S hand. Through the window of MIZ CUNNINGHAM'S second-hand store, they are shot by us, with the back of a watch silhouetted large in the foreground; JOHN'S eyes are instantly fixed on it, while the schoolchildren finish their song and vanish, giggling, into the schoolhouse. A watch with a moving sweep-hand ticks away. Over a shop-doorbell, she is watched by PEARL; the watch is watched by JOHN. Fast, he walks off as they are followed by us with a dolly; he leads PEARL, who hugs her doll, a few paces in silence until the big window of Spoon's Ice Cream Parlor is reached by them. Within, WILLA's face is seen; a customer is served by her, she sees them and waves them away, but she is kept strolling by him. WALT SPOON comes out, offering two lollipops. Along the riverbank, a short, lighted, toy-like train departs the town, whistling, and the whistle ties over the previous. A square, head-on shot features river water below and vibrant starlight above, highlighting a gas-lamp by the road, a tree, and pretty tree-shadows working across a window. In their bed, PEARL lies, her doll snug on her shoulder, as on the edge of the bed in his underwear, JOHN sits. He moves, and as away his shadow moves, motionless, the shadow of PREACHER is seen. PEARL sits up and points at it, causing him to notice her and see it. To the window, JOHN is panned by us, where he looks out and stands motionless before turning. Back to bed, he is panned by us while from shore and boat, people wave. Into frame, she is panned by us at UNCLE BIRDIE STEPTOE'S toy-like little wharf-boat, which passes broadside, cutting to as the boat passes. Through a porthole, BIRDIE'S head sticks, showing a wiry old river character, and he is as the boat whistles. As he speaks, JOHN and the foundered skiff are panned by us into a two-shot before JOHN is panned from the skiff to wharf and Birdie's door. The door is entered by JOHN and, on a box, he sits as coffee is poured by BIRDIE, in a ramshackle rocking chair, giving JOHN a cup."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "We linger on the two sleeping faces, then move to Peacock Alley, a tree-lined dirt street in a quaint, mid-19th-century river town left behind by progress. Barefoot, they wander the empty sidewalk and hear voices; PEARL is amicable, but JOHN is unfriendly. Children at the Schoolhouse taunt the HARPER CHILDREN and draw next to the door. The ARTIST sketches a man on gallows in chalk. JOHN ignores the children, taking PEARL’s hand. Viewed through MIZ CUNNINGHAM'S shop window, a watch looms large as JOHN focuses on it, while the children giggle into the schoolhouse. A ticking watch is heard as PEARL and JOHN walk; PEARL hugs her doll. At Spoon's Ice Cream Parlor, WILLA waves them away, but they continue. WALT SPOON offers lollipops. A toy-like train leaves town, its whistle merging into the scene. A view of river water and starlight highlights a gas-lamp, tree, and shadows on a window. PEARL lies in bed with her doll as JOHN sits nearby. PREACHER’s shadow appears; PEARL points it out, making JOHN notice. We follow JOHN to the window and back to the bed as people wave from shore and boat. PEARL is on UNCLE BIRDIE STEPTOE'S passing wharf-boat. Through a porthole, BIRDIE, a wiry old river character, is visible. The boat whistles as BIRDIE talks, and JOHN enters to sit on a box. BIRDIE, in a worn rocking chair, pours coffee and hands JOHN a cup."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "We observe the two sleeping faces briefly before shifting to Peacock Alley, a shaded dirt street in a quaint, mid-19th-century river town left behind by progress. They walk barefoot, PEARL is friendly, JOHN hostile. Children chant and draw at the schoolhouse, creating a chalk gallows sketch. JOHN ignores them, holding PEARL’S hand. Through MIZ CUNNINGHAM'S shop window, he notices a watch. The schoolchildren finish their song, giggling back inside. A shop-doorbell is heard; PEARL watches MIZ CUNNINGHAM while JOHN focuses on the watch. He quickly walks off, leading PEARL to Spoon's Ice Cream Parlor. WILLA waves them away, but WALT SPOON offers lollipops. A toy-like train departs, whistling, reinforcing the scene. River water and starlight highlight the setting with tree-shadows. PEARL lies in bed, clutching her doll, as JOHN sits nearby. His shadow reveals PREACHER’s, which PEARL points out, causing JOHN to see it. He looks out the window, then returns as a boat passes. UNCLE BIRDIE STEPTOE appears from a porthole of his boat, whistling. BIRDIE speaks, and JOHN sits on a box while BIRDIE, in a rocking chair, pours coffee for both."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "For a brief moment longer, we observe the two peacefully sleeping faces before finding ourselves transported to the charming setting of Peacock Alley. This is a quaint, tree-shaded dirt street situated in a small, single-road river town. It stands as a picturesque, mid-19th-century remnant of the bygone river civilization, a world that the march of general progress has left behind in the pages of history. Here, they wander, barefoot, down the quiet and empty pathway composed of dirt, eventually casting their gaze towards the source of some voices. PEARL maintains a friendly demeanor, while JOHN's attitude is one of hostility.\n\nSeveral individuals poke their heads around the corner of the Schoolhouse door, engaging in chanting directed at the HARPER CHILDREN, while another individual is preoccupied with drawing something on the wall adjacent to the door. Through these actions, we momentarily cut to the scene of chanting and drawing as the ARTIST completes a large, simple chalk sketch depicting a man hanging from gallows. As the verse concludes, we witness them gazing towards the group of children; JOHN, however, pays them no heed, choosing instead to hold PEARL'S hand with determination.\n\nOur perspective shifts to a view through the window of MIZ CUNNINGHAM'S second-hand store, where a watch's back is prominently silhouetted in the foreground. JOHN'S eyes are immediately captivated by it, while the schoolchildren bring their song to an end and disappear, giggling, into the welcoming confines of the schoolhouse. The watch, with its moving sweep-hand, ticks away the moments. Accompanying the distinct sound of a shop-doorbell, we hear PEARL observing her surroundings; meanwhile, JOHN remains fixated on the watch. He walks briskly as we follow behind them, leading PEARL, who clings to her cherished doll, in silence for a few paces until they reach the expansive window of Spoon's Ice Cream Parlor.\n\nWithin the parlor, WILLA'S face becomes visible, busy serving a customer. She notices them and gestures for them to leave, but he continues onward, guiding her along. WALT SPOON emerges, offering two lollipops to the pair. A short, brightly lit, toy-like train departs the town along the scenic riverbank with a whistle, the sound of which blends seamlessly with the previous scene. A square, head-on shot captures the river water below and the vibrant starlight above, beautifully illuminating a gas-lamp by the roadside, a solitary tree, and the lovely tree-shadows dancing across a window.\n\nWithin the room, PEARL lies in their bed, her doll cozily nestled on her shoulder, while JOHN sits perched on the edge of the bed in his underwear. As he moves, and his shadow shifts, the ominous shadow of PREACHER becomes visible, remaining completely still. PEARL sits up suddenly and points at the shadow, prompting JOHN to notice her gesture and see the shadow for himself. Our view pans from JOHN to the window as he gazes out, standing stationary before finally turning back. We track his movement back to the bed while people onshore and aboard a boat can be seen waving. Our perspective widens to include her as she enters the frame at UNCLE BIRDIE STEPTOE'S toy-like little wharf-boat, which glides broadside, creating a transition as the boat progresses.\n\nBIRDIE'S head pokes through a porthole, revealing he is a wiry old character, embodying the river's spirit, as the boat emits a whistle. As BIRDIE begins speaking, our view follows JOHN and the foundered skiff together in a two-shot before panning from JOHN on the skiff to the wharf and Birdie's welcoming door. JOHN makes his way inside and takes a seat on a box, as BIRDIE, sitting in a rickety rocking chair, pours a cup of coffee and graciously offers it to JOHN."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "For just a moment longer, we find ourselves absorbed in the serene sight of two faces in peaceful slumber before being effortlessly transported to the delightful and picturesque setting of Peacock Alley. This quaint, tree-shaded pathway of dirt meanders through a small, single-road river town. It remains as a charming, mid-19th-century relic of a river-bound civilization—an era that, with the relentless march of general progress, has been left behind, embedded in the annals of history. In this nostalgic atmosphere, they meander, barefoot, along the tranquil and empty dirt path until their attention is drawn towards the source of some distant voices. While PEARL maintains a warm and amiable demeanor, JOHN's attitude clearly brims with hostility.\n\nSeveral curious individuals peek around the corner of the Schoolhouse door, engaging in a rhythmic chant directed at the HARPER CHILDREN. Meanwhile, another individual occupies themselves with the task of drawing something on the wall adjacent to the door. In this instant, we are transported to the scene of chanting and drawing, where the ARTIST completes a bold, simplistic chalk drawing of a man hanging from gallows. As the chant reaches its conclusion, we see them shift their gaze towards the group of children; JOHN, however, remains unaffected by this, choosing instead to hold PEARL'S hand with unyielding determination.\n\nOur vantage point changes to peer through the window of MIZ CUNNINGHAM'S second-hand store, where the silhouette of a watch's back is prominently displayed against the foreground. JOHN'S eyes are instantly drawn to it as the schoolchildren bring their song to a joyous end and disappear in fits of giggles into the inviting confines of the schoolhouse. The watch, with its unwavering moving sweep-hand, ticks away the fleeting moments. Alongside the distinct chime of a shop-doorbell, we hear PEARL taking in her surroundings with curiosity; meanwhile, JOHN remains transfixed by the watch. He walks briskly forward as we follow closely behind them, leading PEARL, who clutches her beloved doll tightly, in silence for several paces until they arrive at the expansive window of Spoon's Ice Cream Parlor.\n\nInside the parlor, WILLA'S face comes into view as she busily attends to a customer. She notices them and gestures politely for them to leave, but JOHN presses on, guiding PEARL along under his care. WALT SPOON emerges with a smile, proffering two lollipops to the pair. Meanwhile, a small, brightly illuminated, toy-like train departs the town along the scenic riverbank, heralded by a whistle that harmoniously blends with the preceding scene. A square, head-on shot beautifully captures the rippling river water below and the twinkling starlight above, casting a radiant glow over a solitary gas-lamp by the roadside, a lone tree, and the charming, playful tree-shadows that dance across a nearby window.\n\nWithin the cozy confines of the room, PEARL stretches out in their bed, her cherished doll nestled comfortably on her shoulder, while JOHN sits perched at the edge of the bed clad in his underwear. As he moves, creating a shift in shadows, the ominous silhouette of PREACHER emerges, starkly still. PEARL bolts upright and points at the shadow, prompting JOHN to follow her gesture and observe it for himself. Our view sweeps from JOHN to the window as he stands firmly gazing out before eventually turning back. We follow his movement as he returns to the bed, while people onshore and aboard a boat can be seen waving. Our perspective broadens to include her as she steps into the frame at UNCLE BIRDIE STEPTOE'S toy-like little wharf-boat, which glides gracefully broadside, facilitating a transition as the boat continues its journey.\n\nBIRDIE'S head protrudes through a porthole, revealing him to be a wiry old character who embodies the essence of the river, as the boat emits a friendly whistle. As BIRDIE begins to speak, our focus trails after JOHN alongside the foundered skiff into a two-shot before sweeping from JOHN on the skiff to the wharf and Birdie's welcoming door. JOHN makes his way inside and takes a seat on a modest box, while BIRDIE, seated in a creaky rocking chair, pours a steaming cup of coffee and extends it generously to JOHN."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "We linger briefly, observing the two sleeping faces in peaceful repose, before the scene shifts to Peacock Alley, a quaint, tree-shaded dirt street belonging to a small, one-street river town. This picturesque scene, a vestige of mid-19th-century river civilization, remains untouched by the march of progress. They, barefoot and unhurried, amble down the deserted dirt sidewalk, eventually turning their attention toward the source of distant voices. PEARL responds with friendliness, while JOHN's demeanor contrasts with hostility. Meanwhile, several children peek around the edge of the Schoolhouse door, their teasing chants directed at the HARPER CHILDREN, as another child begins sketching something on the wall beside the door. We momentarily cut to the children chanting and drawing, and the ARTIST finishing a simple, chalk sketch of a man hanging from gallows on the wall. As the verse concludes, we see JOHN and PEARL observing the children; JOHN remains detached, uninterested, and instead clasps PEARL'S hand. From inside MIZ CUNNINGHAM'S second-hand store, we look out through a window, noticing the large silhouette of a watch's backside in the foreground. JOHN's eyes are instantly drawn to it, even as the schoolchildren's song ends and they vanish, giggling, into the schoolhouse. The watch's sweeping hand ticks rhythmically. Over the tinkling sound of a shop-doorbell, PEARL watches intently, while JOHN's focus remains on the watch. He briskly walks away, and we follow as he guides PEARL, who clutches her doll, moving silently for several steps until they halt before the large window of Spoon's Ice Cream Parlor. Inside, WILLA serves a customer and, upon noticing them, dismissively waves them away; however, JOHN continues on, unperturbed. WALT SPOON emerges, offering them two lollipops. As a short, toy-like train departs the town by the riverbank, its whistle echoes over the scene. The head-on shot frames the river water below and the vivid starlight above, casting interesting tree-shadow patterns on a window near the road, illuminated by a gas-lamp. PEARL is comfortably reclined in their bed, her doll resting on her shoulder, while JOHN, clad in his underwear, sits pensively at the bed's edge. He shifts, and as his shadow recedes, the stationary shadow of PREACHER becomes visible. PEARL, noticing it, alerts JOHN by sitting up and pointing, drawing his attention to the shadow. We follow JOHN as he peers out the window, holding his position briefly before turning back. We track him as he returns to bed, amidst the waves from shore and boat. The camera pans to encompass PEARL at UNCLE BIRDIE STEPTOE'S quaint wharf-boat, which sails past, providing a broadside view. BIRDIE'S head pops through a porthole, revealing him to be a wiry old river character, as the boat lets out a whistle. As BIRDIE speaks, the camera follows JOHN and the foundered skiff into a two-shot, then continues to pan from the skiff to the wharf and Birdie's door. JOHN enters, settling onto a box, as BIRDIE, seated in a dilapidated rocking chair, pours coffee and hands a cup to JOHN."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "We briefly observe the two sleeping faces before transitioning to Peacock Alley, a serene dirt street in a small, historically preserved river town from the mid-19th century. PEARL and JOHN walk barefoot down the sidewalk, drawn by nearby voices; PEARL remains friendly, whereas JOHN appears hostile. A group of children chant at the HARPER CHILDREN, and one child sketches a gallows scene on the schoolhouse wall. As the chant concludes, JOHN dismisses their antics, taking PEARL's hand. They are seen through MIZ CUNNINGHAM'S store window, where JOHN's gaze locks onto a watch while the children retreat giggling into the schoolhouse. The sound of a ticking watch and shop-doorbell underscores the moment; JOHN is captivated by the watch while PEARL observes the scene. Moving quickly, he leads PEARL, clutching her doll, past Spoon's Ice Cream Parlor, where WILLA signals them away, but he presses on. WALT SPOON emerges, offering lollipops. Simultaneously, a small, illuminated train departs the town along the riverbank, its whistle blending with the scene. The ambiance transitions to a square shot featuring the river, starlit sky, gas-lamp, and tree shadows. Later, PEARL is in bed with her doll while JOHN sits at the edge. As he moves, PREACHER's shadow appears, prompting PEARL to alert him. JOHN notices and approaches the window, standing still before turning back. Meanwhile, UNCLE BIRDIE STEPTOE's quaint wharf-boat glides by, revealing BIRDIE, who interacts with JOHN as the boat whistles. BIRDIE, a seasoned river character, invites JOHN into his rustic space, where they share coffee, seated amidst the river's quietude."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "We watch, for a moment more, the two sleeping faces and then find ourselves in Peacock Alley, a tree-shaded dirt street of a small, one-street river town; a picturesque, mid-19th-century remnant of the old river civilization where steamboats once thrived, which general progress has left behind with the advent of railroads and highways. They stroll barefoot down the empty dirt sidewalk, evoking a sense of simpler times, eventually looking towards the voices; PEARL is friendly, reflecting her innocent nature, but JOHN is hostile, revealing his guarded disposition. Several stick their heads around the edge of the Schoolhouse door, a small building emblematic of early American public education, chanting at the HARPER CHILDREN while another draws something on the wall next to the door. Over these lines, we briefly cut to -- chanting and drawing -- as the ARTIST completes in chalk a large simple sketch of a man hanging from gallows, a grim reminder of frontier justice. As the verse ends, we see them looking towards the children; JOHN pays them no attention, taking PEARL'S hand, his protective instinct prevailing. We shoot them through the window of MIZ CUNNINGHAM'S second-hand store, a treasure trove of items from past decades, with the back of a watch silhouetted large in the foreground; JOHN'S eyes instantly fix on it, captivated by its intricate design, while the schoolchildren finish their song and vanish, giggling, into the schoolhouse. A watch with a moving sweep-hand ticks away, echoing the relentless passage of time. Over a shop-doorbell, we hear PEARL watching her surroundings with childlike curiosity; JOHN, the watch, absorbed in its craftsmanship. He walks off fast as we dolly behind them; he leads PEARL, who hugs her doll, a beloved companion, a few paces in silence until they come to the big window of Spoon's Ice Cream Parlor. WILLA's face is seen within; serving a customer, she sees them and waves them away, protective of her peace, but he keeps her strolling. WALT SPOON comes out, a jovial figure known for his sweet treats, proffering two lollipops. A short, lighted, toy-like train, a recent addition to the town's modest attractions, departs the town along the riverbank, whistling, and the whistle ties over the previous. A square, head-on shot features river water below, reminiscent of the lifeblood of the town's history, and vibrant starlight above, highlighting a gas-lamp by the road, a tree, and pretty tree-shadows working across a window. PEARL lies in their bed, her doll snug on her shoulder, as JOHN sits on the edge of the bed in his underwear. He moves, and as his shadow moves away, the shadow of PREACHER is seen, motionless, emblematic of an ominous presence. PEARL sits up and points at it, causing JOHN to notice her and see it. We pan JOHN to the window, where he looks out over the mesmerizing reflection of moonlight on the water and stands motionless before turning. We pan him back to bed while people wave from shore and boat, echoes of a once-thriving community. We pan her into frame at UNCLE BIRDIE STEPTOE'S toy-like little wharf-boat, a quaint vessel that has seen many stories, which passes broadside, cutting to as the boat passes. BIRDIE'S head sticks through a porthole, showing he is a wiry old river character, embodying the spirit of river folk, and the boat whistles. As BIRDIE speaks, we pan JOHN and the foundered skiff, a vessel past its prime, into a two-shot before panning JOHN from the skiff to wharf and Birdie's door. JOHN enters and sits on a box as BIRDIE, in a ramshackle rocking chair that creaks with age, pours coffee and gives JOHN a cup, sharing warmth and stories as old friends do."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He walks off fast as we dolly behind them We watch for a moment more the two sleeping faces and then find ourselves in Peacock Alley a treeshaded dirt street of a small onestreet river town a picturesque mid19thcentury remnant of the old river civilization which general progress has left behind rocking chair pours coffee and gives JOHN a cup They stroll barefoot down the empty dirt sidewalk eventually looking towards the voices PEARL is friendly but JOHN is hostile Several stick their heads around the edge of the Schoolhouse door chanting at the HARPER CHILDREN while another draws something on the wall next to the door Over these lines we briefly cut to  chanting and drawing  as the ARTIST completes in chalk a large simple sketch of a man hanging from gallows We shoot them through the window of MIZ CUNNINGHAM'S secondhand store with the back of a watch silhouetted large in the foreground As the verse ends we see them looking towards the children JOHN pays them no attention taking PEARL'S hand They stroll barefoot down the empty dirt sidewalk eventually looking towards the voices We shoot them through the window of MIZ CUNNINGHAM'S secondhand store with the back of a watch silhouetted large in the foreground JOHN'S eyes instantly fix on it while the schoolchildren finish their song and vanish giggling into the schoolhouse Over these lines we briefly cut to  chanting and drawing  as the ARTIST completes in chalk a large simple sketch of a man hanging from gallows A watch with a moving sweephand ticks away PEARL lies in their bed her doll snug on her shoulder as JOHN sits on the edge of the bed in his underwear Over a shopdoorbell we hear PEARL watching her We watch for a moment more the two sleeping faces and then find ourselves in Peacock Alley a treeshaded dirt street of a small onestreet river town a picturesque mid19thcentury remnant of the old river civilization which general progress has left behind A short lighted toylike train departs the town along the riverbank whistling and the whistle ties over the previous PEARL sits up and points at it causing JOHN to notice her and see it JOHN the watch He walks off fast as we dolly behind them he leads PEARL who hugs her doll a few paces in silence until they come to the big window of Spoon's Ice Cream Parlor WILLA's face is seen within serving a customer she sees them and waves them away but he keeps her strolling WALT SPOON comes out proffering two lollipops A short lighted toylike train departs the town along the riverbank whistling and the whistle ties over the previous A square headon shot features river water below and vibrant starlight above highlighting a gaslamp by the road a tree and pretty treeshadows working across a window Several stick their heads around the edge of the Schoolhouse door chanting at the HARPER CHILDREN while another draws something on the wall next to the door WALT SPOON comes out proffering two lollipops PEARL lies in their bed her doll snug on her shoulder as JOHN sits on the edge of the bed in his underwear He moves and as his shadow moves away the shadow of PREACHER is seen motionless PEARL sits up and points at it causing JOHN to notice her and see it We pan JOHN to the window where he looks out and stands motionless before turning We pan him back to bed while people wave from shore and boat We pan her into frame at UNCLE BIRDIE STEPTOE'S toylike little wharfboat which passes broadside cutting to as the boat passes BIRDIE'S head sticks through a porthole showing he is a wiry old river character and the boat whistles PEARL is friendly but JOHN is hostile As BIRDIE speaks we pan JOHN and the foundered skiff into a twoshot before panning JOHN from the skiff to wharf and Birdie's door JOHN'S eyes instantly fix on it As BIRDIE speaks we pan JOHN and the foundered skiff into a twoshot before panning JOHN from the skiff to wharf and Birdie's door JOHN enters and sits on a box as BIRDIE in a ramshackle BIRDIE STEPTOE'S toylike little wharfboat which passes broadside cutting to as the boat passes JOHN enters and sits on a box as BIRDIE in a ramshackle rocking chair pours coffee and gives JOHN a cup"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "We watch for a moment more the two sleeping faces and then find ourselves in Peacock Alley a treeshaded dirt street of a small onestreet river town a picturesque mid19thcentury remnant of the old river civilization which general progress has left behind. They stroll barefoot down the empty dirt sidewalk eventually looking towards the voices. PEARL is friendly but JOHN is hostile. Several stick their heads around the edge of the Schoolhouse door chanting at the HARPER CHILDREN while another draws something on the wall next to the door. Over these lines we briefly cut to  chanting and drawing  as the ARTIST completes in chalk a large simple sketch of a man hanging from gallows. As the verse ends we see them looking towards the children. JOHN pays them no attention taking PEARL'S hand. We shoot them through the window of MIZ CUNNINGHAM'S secondhand store with the back of a watch silhouetted large in the foreground. JOHN'S eyes instantly fix on it. while the schoolchildren finish their song and vanish giggling into the schoolhouse. A watch with a moving sweephand ticks away. Over a shopdoorbell we hear PEARL watching her. JOHN the watch. He walks off fast as we dolly behind them. he leads PEARL who hugs her doll a few paces in silence until they come to the big window of Spoon's Ice Cream Parlor. WILLA's face is seen within serving a customer. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. she sees them and waves them away but he keeps her strolling. WALT SPOON comes out proffering two lollipops. A short lighted toylike train departs the town along the riverbank whistling and the whistle ties over the previous. A square headon shot features river water below and vibrant starlight above highlighting a gaslamp by the road. a tree and pretty treeshadows working across a window. PEARL lies in their bed her doll snug on her shoulder as JOHN sits on the edge of the bed in his underwear. He moves and as his shadow moves away the shadow of PREACHER is seen motionless. PEARL sits up and points at it causing JOHN to notice her and see it. We pan JOHN to the window where he looks out and stands motionless before turning. We pan him back to bed while people wave from shore and boat. We pan her into frame at UNCLE. BIRDIE STEPTOE'S toylike little wharfboat which passes broadside cutting to as the boat passes. BIRDIE'S head sticks through a porthole showing he is a wiry old river character and the boat whistles. As BIRDIE speaks we pan JOHN and the foundered skiff into a twoshot before panning JOHN from the skiff to wharf and Birdie's door. JOHN enters and sits on a box as BIRDIE in a ramshackle. rocking chair pours coffee and gives JOHN a cup."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "We watch for a moment more the two sleeping faces and then find ourselves in Peacock Alley a treeshaded dirt street of a small onestreet river town a picturesque mid19thcentury remnant of the old river civilization which general progress has left behind. They stroll barefoot down the empty dirt sidewalk eventually looking towards the voices. PEARL is friendly but JOHN is hostile. Several stick their heads around the edge of the Schoolhouse door chanting at the HARPER CHILDREN while another draws something on the wall next to the door. Over these lines we briefly cut to  chanting and drawing  as the ARTIST completes in chalk a large simple sketch of a man hanging from gallows. As the verse ends we see them looking towards the children. JOHN pays them no attention taking PEARL'S hand. We shoot them through the window of MIZ CUNNINGHAM'S secondhand store with the back of a watch silhouetted large in the foreground. JOHN'S eyes instantly fix on it. while the schoolchildren finish their song and vanish giggling into the schoolhouse. A watch with a moving sweephand ticks away. Over a shopdoorbell we hear PEARL watching her. JOHN the watch. He walks off fast as we dolly behind them. he leads PEARL who hugs her doll a few paces in silence until they come to the big window of Spoon's Ice Cream Parlor. WILLA's face is seen within serving a customer. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. she sees them and waves them away but he keeps her strolling. WALT SPOON comes out proffering two lollipops. A short lighted toylike train departs the town along the riverbank whistling and the whistle ties over the previous. A square headon shot features river water below and vibrant starlight above highlighting a gaslamp by the road. a tree and pretty treeshadows working across a window. PEARL lies in their bed her doll snug on her shoulder as JOHN sits on the edge of the bed in his underwear. He moves and as his shadow moves away the shadow of PREACHER is seen motionless. PEARL sits up and points at it causing JOHN to notice her and see it. We pan JOHN to the window where he looks out and stands motionless before turning. We pan him back to bed while people wave from shore and boat. We pan her into frame at UNCLE. BIRDIE STEPTOE'S toylike little wharfboat which passes broadside cutting to as the boat passes. BIRDIE'S head sticks through a porthole showing he is a wiry old river character and the boat whistles. As BIRDIE speaks we pan JOHN and the foundered skiff into a twoshot before panning JOHN from the skiff to wharf and Birdie's door. JOHN enters and sits on a box as BIRDIE in a ramshackle. rocking chair pours coffee and gives JOHN a cup."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "We watch for a moment more the two sleeping faces and then find ourselves in Peacock Alley a treeshaded dirt street of a small onestreet river town a picturesque mid19thcentury remnant of the old river civilization which general progress has left behind. They stroll barefoot down the empty dirt sidewalk eventually looking towards the voices. PEARL is friendly but JOHN is hostile. Several stick their heads around the edge of the Schoolhouse door chanting at the HARPER CHILDREN while another draws something on the wall next to the door. Over these lines we briefly cut to  chanting and drawing  as the ARTIST completes in chalk a large simple sketch of a man hanging from gallows. As the verse ends we see them looking towards the children. JOHN pays them no attention taking PEARL'S hand. We shoot them through the window of MIZ CUNNINGHAM'S secondhand store with the back of a watch silhouetted large in the foreground. We pan JOHN to the window where he looks out and stands motionless before turning. We pan him back to bed while people wave from shore and boat. We pan her into frame at UNCLE. BIRDIE STEPTOE'S toylike little wharfboat which passes broadside cutting to as the boat passes. BIRDIE'S head sticks through a porthole showing he is a wiry old river character and the boat whistles. As BIRDIE speaks we pan JOHN and the foundered skiff into a twoshot before panning JOHN from the skiff to wharf and Birdie's door. JOHN enters and sits on a box as BIRDIE in a ramshackle. rocking chair pours coffee and gives JOHN a cup."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "We watch for a moment more the two sleeping faces and then find ourselves in Peacock Alley a treeshaded dirt street of a small onestreet river town a picturesque mid19thcentury remnant of the old river civilization which general progress has left behind. They stroll barefoot down the empty dirt sidewalk eventually looking towards the voices. PEARL is friendly but JOHN is hostile. Several stick their heads around the edge of the Schoolhouse door chanting at the HARPER CHILDREN while another draws something on the wall next to the door. As BIRDIE speaks we pan JOHN and the foundered skiff into a twoshot before panning JOHN from the skiff to wharf and Birdie's door. JOHN enters and sits on a box as BIRDIE in a ramshackle. rocking chair pours coffee and gives JOHN a cup."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "We watch, for a moment more, the two sleeping faces and then find ourselves in Peacock Alley, a tree-shaded dirt street of a small, one-street river town; a picturesque, mid-19th-century remnant of the old river civilization, which general progress has left behind. A rabbit strolls barefoot down the empty dirt sidewalk, eventually looking towards the voices; a squirrel is friendly, but a turtle is hostile. Several mice stick their heads around the edge of the Schoolhouse door, chanting at the HARPER CHILDREN while another draws something on the wall next to the door. Over these lines, we briefly cut to -- chanting and drawing -- as the fox completes in chalk a large simple sketch of a man hanging from gallows. As the verse ends, we see a deer looking towards the children; the turtle pays them no attention, taking the squirrel's hand. We shoot a bear through the window of MIZ CUNNINGHAM'S second-hand store, with the back of a watch silhouetted large in the foreground; a turtle's eyes instantly fix on it, while the schoolchildren finish their song and vanish, giggling, into the schoolhouse. A watch with a moving sweep-hand ticks away. Over a shop-doorbell, we hear a rabbit watching her; a turtle, the watch. A fox walks off fast as we dolly behind them; it leads a rabbit, who hugs her doll, a few paces in silence until they come to the big window of Spoon's Ice Cream Parlor. An owl's face is seen within; serving a customer, it sees them and waves them away, but a fox keeps her strolling. A lion comes out, proffering two lollipops. A short, lighted, toy-like train departs the town along the riverbank, whistling, and the whistle ties over the previous. A square, head-on shot features river water below and vibrant starlight above, highlighting a gas-lamp by the road, a tree, and pretty tree-shadows working across a window. A rabbit lies in their bed, her doll snug on her shoulder, as a turtle sits on the edge of the bed in his underwear. It moves, and as its shadow moves away, the shadow of a giraffe is seen, motionless. A rabbit sits up and points at it, causing a turtle to notice her and see it. We pan a turtle to the window, where it looks out and stands motionless before turning. We pan it back to bed while elephants wave from shore and boat. We pan a rabbit into frame at UNCLE BIRDIE STEPTOE'S toy-like little wharf-boat, which passes broadside, cutting to as the boat passes. BIRDIE's head sticks through a porthole, showing it is a wiry old river character, and the boat whistles. As a dolphin speaks, we pan a turtle and the foundered skiff into a two-shot before panning a turtle from the skiff to wharf and BIRDIE'S door. A turtle enters and sits on a box as a dolphin, in a ramshackle rocking chair, pours coffee and gives a turtle a cup."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "We watch, for a moment more, the two sleeping faces and then find ourselves in Swan Lane, a sun-dappled cobblestone path of a small, one-path mountain village; a quaint, mid-19th-century remnant of the old mountain civilization, which general progress has left behind. They stroll barefoot down the empty cobblestone pavement, eventually looking towards the voices; PEARL is friendly, but JOHN is hostile. Several stick their heads around the edge of the Post Office door, chanting at the HARPER CHILDREN while another draws something on the wall next to the door. Over these lines, we briefly cut to -- chanting and drawing -- as the ARTIST completes in crayon a large simple sketch of a man hanging from gallows. As the verse ends, we see them looking towards the children; JOHN pays them no attention, taking PEARL'S hand. We shoot them through the window of MIZ CUNNINGHAM'S second-hand bakery, with the back of a clock silhouetted large in the foreground; JOHN'S eyes instantly fix on it, while the schoolchildren finish their song and vanish, giggling, into the post office. A clock with a moving sweep-hand ticks away. Over a church bell, we hear PEARL watching her; JOHN, the clock. He walks off fast as we dolly behind them; he leads PEARL, who hugs her teddy bear, a few paces in silence until they come to the big window of Spoon's Candy Shop. WILLA's face is seen within; serving a customer, she sees them and waves them away, but he keeps her strolling. WALT SPOON comes out, proffering two apples. A short, lighted, toy-like carriage departs the village along the mountain path, whistling, and the whistle ties over the previous. A square, head-on shot features mountain rocks below and vibrant moonlight above, highlighting a kerosene lamp by the path, a rock, and pretty rock-shadows working across a window. PEARL lies in their bed, her teddy bear snug on her shoulder, as JOHN sits on the edge of the bed in his pajamas. He moves, and as his shadow moves away, the shadow of PREACHER is seen, motionless. PEARL sits up and points at it, causing JOHN to notice her and see it. We pan JOHN to the window, where he looks out and stands motionless before turning. We pan him back to bed while people wave from shore and carriage. We pan her into frame at UNCLE BIRDIE STEPTOE'S toy-like little mountain-top cabin, which passes broadside, cutting to as the cabin passes. BIRDIE'S head sticks through a window, showing he is a wiry old mountain character, and the cabin whistles. As BIRDIE speaks, we pan JOHN and the grounded sled into a two-shot before panning JOHN from the sled to cabin and Birdie's door. JOHN enters and sits on a crate as BIRDIE, in a rickety rocking chair, pours cider and gives JOHN a cup."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "We observe, for a moment more, the two resting faces and then guide ourselves to Peacock Alley, a tree-lined dirt street of a small, single-street river town; a charming, mid-19th-century relic of the old river civilization, which general progress has neglected. They hop barefoot down the vacant dirt sidewalk, eventually glancing towards the voices; PEARL is cordial, but JOHN is indifferent. Several poke their heads around the edge of the Schoolhouse door, shouting at the HARPER CHILDREN while another scribbles something on the wall next to the door. Over these lines, we briefly transition to -- shouting and scribbling -- as the ARTIST completes in chalk a massive simple doodle of a man flying from gallows. As the verse concludes, we see them glancing towards the children; JOHN ignores them, clutching PEARL'S hand. We capture them through the window of MIZ CUNNINGHAM'S second-hand store, with the back of a watch silhouetted large in the foreground; JOHN'S eyes immediately fix on it, while the schoolchildren conclude their chant and disappear, laughing, into the schoolhouse. A watch with a rotating sweep-hand ticks away. Over a shop-doorbell, we hear PEARL observing her; JOHN, the watch. He rushes off quickly as we glide behind them; he guides PEARL, who cradles her doll, a few steps in silence until they arrive at the large window of Spoon's Ice Cream Parlor. WILLA's face is seen inside; serving a customer, she notices them and dismisses them, but he keeps her ambling. WALT SPOON emerges, holding out two lollipops. A compact, illuminated, toy-like train exits the town along the riverbank, whistling, and the whistle blends over the previous. A square, head-on shot features river water below and vivid starlight above, showcasing a gas-lamp by the road, a tree, and delightful tree-shadows playing across a window. PEARL rests in their bed, her doll snug on her shoulder, as JOHN perches on the edge of the bed in his underwear. He shifts, and as his shadow recedes, the shadow of PREACHER is observed, unmoving. PEARL rises and points at it, prompting JOHN to notice her and recognize it. We pivot JOHN to the window, where he gazes out and stands unmoving before turning. We pivot him back to bed while people cheer from shore and boat. We pivot her into frame at UNCLE BIRDIE STEPTOE'S toy-like little wharf-boat, which glides broadside, transitioning to as the boat glides. BIRDIE'S head pops through a porthole, revealing he is a wiry old river character, and the boat whistles. As BIRDIE speaks, we pivot JOHN and the foundered skiff into a two-shot before pivoting JOHN from the skiff to wharf and Birdie's door. JOHN enters and perches on a box as BIRDIE, in a ramshackle rocking chair, brews coffee and hands JOHN a cup."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "We watch, for a moment more, the two dreaming pillows and then find ourselves in Caterpillar Pathway, a flower-covered cobblestone alley of a tiny, two-lane mountain village; a charming, early 20th-century remnant of the historic mountain culture, which modern innovation has left behind. They amble barefoot down the crowded cobblestone path, eventually glancing towards the echoes; the SQUIRREL is jovial, but the LIZARD is aloof. Many poke their ears around the edge of the Bakery window, humming at the GOLDFISH SIBLINGS while another etches something on the fence next to the window. Over these doodles, we briefly cut to -- humming and etching -- as the SCULPTOR finishes in charcoal a large simple illustration of a cat climbing a mountain. As the melody dies, we see them glancing towards the siblings; the LIZARD pays them no attention, taking the SQUIRREL’S tail. We shoot them through the doorway of MRS. HATTER’S antique library, with the back of a book silhouetted large in the foreground; the LIZARD’S eyes instantly fix on it, while the bakery patrons complete their tune and disappear, chuckling, into the bakery. A clock with a rotating second-hand ticks away. Over a church-bell, we hear the SQUIRREL observing him; the LIZARD, the clock. He strides off quickly as we glide behind them; he guides the SQUIRREL, who cradles her kite, a few steps in silence until they reach the large doorway of Cup’s Candy Shop. DAVID'S top is seen within; serving a visitor, he notices them and gestures them away, but she keeps him ambling. SAM CUP strides out, presenting two cookies. A short, radiant, toy-like tram exits the village along the meadow, hooting, and the hoot blends over the earlier. A rectangular, head-on frame depicts mountain mist below and brilliant moonlight above, showcasing a lantern by the path, a bench, and delicate bench-shadows working across a mirror. The SQUIRREL rests in their hammock, her kite snug on her paw, as the LIZARD sits on the foot of the hammock in his pajamas. He shifts, and as his outline shifts away, the outline of TEACHER is seen, unmoving. The SQUIRREL rises and gestures at it, prompting the LIZARD to acknowledge her and observe it. We pan the LIZARD to the mirror, where he peers out and stands unmoving before twirling. We pan him back to hammock while cars wave from shore and ferry. We pan her into focus at COUSIN FOXIE OAK'S toy-like little lake-ferry, which glides sideways, cutting to as the ferry glides. FOXIE'S ear peeks through a hatch, revealing he is a spry old mountain figure, and the ferry hoots. As FOXIE comments, we pan the LIZARD and the capsized canoe into a duo-frame before panning the LIZARD from the canoe to ferry and Foxie's hatch. The LIZARD enters and perches on a stool as FOXIE, in a vintage armchair, brews tea and hands the LIZARD a mug."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "We observe, for a brief moment longer, the two snoring dogs and then relocate ourselves to Hemlock Alley, a flower-lined brick path of a bustling, two-lane prairie town; a charming, early 20th-century example of the bygone prairie life, which modern evolution has passed by. They amble barefoot down the desolate brick sidewalk, eventually glancing towards the clamor; RUBY is aloof, but MIKE is welcoming. A few peek their noses around the edge of the Bakery door, humming at the CARTER CHILDREN while another scribbles something on the wall next to the door. Over these scenes, we briefly cut to -- humming and scribbling -- as the CARPENTER finishes in charcoal a sizable rudimentary silhouette of a cat perched on a fence. As the rhyme concludes, we see them glancing towards the children; MIKE ignores them, grasping RUBY'S elbow. We capture them through the window of MISS ANDERSON'S second-hand boutique, with the back of a vase silhouetted prominently in the foreground; MIKE'S eyes immediately lock on it, while the young ones conclude their jingle and disappear, chuckling, into the bakery. A clock with a swinging pendulum ticks steadily. Over a door-chime, we hear RUBY contemplating him; MIKE, the clock. He strides off swiftly as we glide behind them; he guides RUBY, who cradles her figurine, a few steps in silence until they arrive at the grand display of Spoon's Candy Store. CLARA's face is seen inside; assisting a patron, she notices them and gestures them away, but he keeps her meandering. BEN SPOON comes out, offering two bubble gums. A small, glowing, toy-like ferry leaves the town alongside the bank, hooting, and the horn transitions over the past scene. A square, frontal view shows prairie grass below and shimmering moonlight above, accentuating a lantern by the road, a shrub, and charming shrub-shadows shifting across a pane. RUBY rests on their couch, her figurine nestled on her arm, as MIKE leans on the arm of the couch in his pajamas. He adjusts, and as his figure withdraws, the silhouette of TEACHER is seen, unchanging. RUBY stands up and gestures at it, prompting MIKE to acknowledge her and notice it. We shift MIKE to the pane, where he peers out and stays stationary before swiveling. We shift him back to the couch while folks greet from shore and raft. We shift her into view at COUSIN PETE STEPOE'S toy-like little raft, which floats past, merging to as the raft passes. PETE'S hand extends through a window, showing he is a spry old prairie character, and the raft hoots. As PETE converses, we shift MIKE and the foundered raft into a two-shot before shifting MIKE from the raft to pier and Pete's shed. MIKE enters and reclines on a barrel as PETE, in a makeshift seat, brews tea and offers MIKE a mug."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "We watch, for a moment more, the two sleeping pelicans and then find ourselves in Peacock Alley, a kite-dotted stone avenue of a small, one-street mountain village; a picturesque, mid-19th-century remnant of the old mountain civilization, which general progress has left behind. They skip barefoot down the empty stone pathway, eventually glancing towards the drums; PEARL is cheerful, but JOHN is wary. Several pop their hats around the edge of the Bakery door, singing at the HARPER CHILDREN while another writes something on the ceiling next to the door. Over these notes, we briefly cut to -- singing and writing -- as the SCRIBE completes in ink a large simple sketch of a horse jumping over fences. As the verse ends, we see them glancing towards the children; JOHN pays them no attention, grabbing PEARL'S hand. We shoot them through the window of MIZ CUNNINGHAM'S vintage bookshop, with the back of a compass silhouetted large in the foreground; JOHN'S eyes instantly fix on it, while the schoolchildren finish their rhyme and dash, giggling, into the bakery. A clock with a spinning second-hand ticks away. Over a shop-doorbell, we hear PEARL examining her; JOHN, the clock. He marches off fast as we glide behind them; he leads PEARL, who hugs her kite, a few strides in silence until they come to the large window of Spoon's Candy Store. WILLA's face is seen within; serving a guest, she sees them and gestures them away, but he keeps her skipping. WALT SPOON comes out, offering two cupcakes. A small, glowing, toy-like helicopter departs the village along the mountain path, humming, and the hum ties over the previous. A square, head-on shot features mountain mist below and vibrant moonlight above, highlighting a gas-lamp by the path, a stone, and pretty stone-shadows working across a doorway. PEARL lies in their cot, her kite snug on her shoulder, as JOHN sits on the edge of the cot in his pajamas. He stretches, and as his shadow stretches away, the shadow of PREACHER is seen, still. PEARL sits up and points at it, causing JOHN to notice her and see it. We pan JOHN to the doorway, where he peeks out and stands still before turning. We pan him back to cot while people clap from field and plane. We pan her into frame at UNCLE BIRDIE STEPTOE'S toy-like little paper-kite, which moves broadside, cutting to as the kite moves. BIRDIE'S hat peeks through a window, showing he is a wiry old mountain character, and the kite hums. As BIRDIE hums, we pan JOHN and the stranded raft into a two-shot before panning JOHN from the raft to pathway and Birdie's gate. JOHN enters and sits on a crate as BIRDIE, in a shabby hammock, pours tea and gives JOHN a mug."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "We observe, for a brief while longer, the two laughing statues and then discover ourselves in Toucan Pathway, a cloud-covered stone plaza of a bustling, multi-lane mountain city; an enchanting, late-18th-century fragment of the grand mountain existence, which societal decay has forgotten. They amble shod along the bustling stone plaza, eventually hearing the whispers; RUBY is reserved, but ALEX is welcoming. Several stretch their arms around the corner of the Bakery window, whispering at the BAKER KIDS while another sculpts something on the pavement below the window. Over these forms, we briefly shift to -- whispering and sculpting -- as the SCULPTOR finishes in clay a tiny intricate miniature of a cat climbing onto branches. As the chorus concludes, we observe them hearing the adults; ALEX pays them no heed, dropping RUBY'S scarf. We capture them through the glass of MIZ COLLINS' antique emporium, with the face of a clock silhouetted small in the background; ALEX'S ears immediately lock on it, while the bakers abandon their melody and scatter, laughing, into the bakery. A clock with a broken glass-hand clacks forward. Past a shop-buzzer, we sense RUBY hearing him; ALEX, the clock. She dashes off slowly as we zoom before them; she guides ALEX, who swings her kite, a few steps in sound until they reach the small arch of Spoon's Candy Shop. EMMA's hand is spotted inside; painting a picture, he stares at them and waves them here, but she sways him running. LEVI LADLE pops in, offering three cupcakes. A tall, illuminated, creature-like blimp exits the sky above the mountain ridge, roaring, and the roar carries over the earlier. A triangular, side-angle view presents mountain air above and murky sunlight below, highlighting a fog-horn by the path, a boulder, and pretty boulder-patterns shifting over a beam. RUBY sits in their chair, her kite snug in her grasp, as ALEX stands on the middle of the chair in his pajamas. He glances, and as his figure glides away, the outline of PREACHER is noticed, moving. RUBY stands down and gestures at it, causing ALEX to disregard her and hear it. We track ALEX to the wall, where he listens in and stands moving before pausing. We track him off to chair while creatures dance from hillside and jetty. We track him into vision at UNCLE EAGLE TALONS' creature-like vast gas-balloon, which floats sideways, cutting out as the balloon floats. EAGLE'S hand stretches through a door, showing he is a stocky new mountain creature, and the balloon squeals. As EAGLE poses, we track ALEX and the fractured raft into a trio-picture before tracking ALEX from the raft to jetty and Eagle's arch. ALEX exits and stands on a stool as EAGLE, in a tattered folding box, brews tea and hands ALEX a mug."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In a small 19th-century river town, siblings PEARL and JOHN, barefoot and contrastingly friendly and hostile, face schoolchildren's taunts. The children draw a chalk sketch of a hanging man, but JOHN, ignoring them, leads PEARL past Miz Cunningham's store, where he is drawn to a watch. At Spoon's Ice Cream Parlor, WILLA waves them away, yet WALT SPOON offers lollipops. As a toy train departs, gas-lamps and tree shadows create a serene scene. PEARL lies in bed with JOHN nearby, when PREACHER's shadow suddenly appears, startling them. Later, at UNCLE BIRDIE STEPTOE'S quaint wharf-boat, they meet BIRDIE, a wiry old river character. JOHN and BIRDIE share coffee, as they converse on the foundered skiff."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "rocking chair pours coffee and gives JOHN a cup JOHN enters and sits on a box as BIRDIE in a ramshackle As BIRDIE speaks we pan JOHN and the foundered skiff into a twoshot before panning JOHN from the skiff to wharf and Birdie's door BIRDIE'S head sticks through a porthole showing he is a wiry old river character and the boat whistles BIRDIE STEPTOE'S toylike little wharfboat which passes broadside cutting to as the boat passes We pan her into frame at UNCLE We pan him back to bed while people wave from shore and boat We pan JOHN to the window where he looks out and stands motionless before turning PEARL sits up and points at it causing JOHN to notice her and see it He moves and as his shadow moves away the shadow of PREACHER is seen motionless PEARL lies in their bed her doll snug on her shoulder as JOHN sits on the edge of the bed in his underwear a tree and pretty treeshadows working across a window A square headon shot features river water below and vibrant starlight above highlighting a gaslamp by the road A short lighted toylike train departs the town along the riverbank whistling and the whistle ties over the previous WALT SPOON comes out proffering two lollipops she sees them and waves them away but he keeps her strolling WILLA's face is seen within serving a customer he leads PEARL who hugs her doll a few paces in silence until they come to the big window of Spoon's Ice Cream Parlor He walks off fast as we dolly behind them JOHN the watch Over a shopdoorbell we hear PEARL watching her A watch with a moving sweephand ticks away while the schoolchildren finish their song and vanish giggling into the schoolhouse JOHN'S eyes instantly fix on it We shoot them through the window of MIZ CUNNINGHAM'S secondhand store with the back of a watch silhouetted large in the foreground JOHN pays them no attention taking PEARL'S hand As the verse ends we see them looking towards the children Over these lines we briefly cut to  chanting and drawing  as the ARTIST completes in chalk a large simple sketch of a man hanging from gallows Several stick their heads around the edge of the Schoolhouse door chanting at the HARPER CHILDREN while another draws something on the wall next to the door PEARL is friendly but JOHN is hostile They stroll barefoot down the empty dirt sidewalk eventually looking towards the voices We watch for a moment more the two sleeping faces and then find ourselves in Peacock Alley a treeshaded dirt street of a small onestreet river town a picturesque mid19thcentury remnant of the old river civilization which general progress has left behind"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "We pan her into frame at UNCLE As the verse ends we see them looking towards the children A watch with a moving sweephand ticks away WILLA's face is seen within serving a customer We pan him back to bed while people wave from shore and boat Over a shopdoorbell we hear PEARL watching her He moves and as his shadow moves away the shadow of PREACHER is seen motionless JOHN pays them no attention taking PEARL'S hand A square headon shot features river water below and vibrant starlight above highlighting a gaslamp by the road JOHN the watch she sees them and waves them away but he keeps her strolling while the schoolchildren finish their song and vanish giggling into the schoolhouse BIRDIE'S head sticks through a porthole showing he is a wiry old river character and the boat whistles he leads PEARL who hugs her doll a few paces in silence until they come to the big window of Spoon's Ice Cream Parlor We pan JOHN to the window where he looks out and stands motionless before turning a tree and pretty treeshadows working across a window JOHN enters and sits on a box as BIRDIE in a ramshackle They stroll barefoot down the empty dirt sidewalk eventually looking towards the voices He walks off fast as we dolly behind them A short lighted toylike train departs the town along the riverbank whistling and the whistle ties over the previous PEARL is friendly but JOHN is hostile WALT SPOON comes out proffering two lollipops PEARL lies in their bed her doll snug on her shoulder as JOHN sits on the edge of the bed in his underwear Several stick their heads around the edge of the Schoolhouse door chanting at the HARPER CHILDREN while another draws something on the wall next to the door As BIRDIE speaks we pan JOHN and the foundered skiff into a twoshot before panning JOHN from the skiff to wharf and Birdie's door Over these lines we briefly cut to  chanting and drawing  as the ARTIST completes in chalk a large simple sketch of a man hanging from gallows BIRDIE STEPTOE'S toylike little wharfboat which passes broadside cutting to as the boat passes rocking chair pours coffee and gives JOHN a cup JOHN'S eyes instantly fix on it PEARL sits up and points at it causing JOHN to notice her and see it We watch for a moment more the two sleeping faces and then find ourselves in Peacock Alley a treeshaded dirt street of a small onestreet river town a picturesque mid19thcentury remnant of the old river civilization which general progress has left behind We shoot them through the window of MIZ CUNNINGHAM'S secondhand store with the back of a watch silhouetted large in the foreground"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "she sees them and waves them away but he keeps her strolling WALT SPOON comes out proffering two lollipops A short lighted toylike train departs the town along the riverbank whistling and the whistle ties over the previous A square headon shot features river water below and vibrant starlight above highlighting a gaslamp by the road a tree and pretty treeshadows working across a window PEARL lies in their bed her doll snug on her shoulder as JOHN sits on the edge of the bed in his underwear He moves and as his shadow moves away the shadow of PREACHER is seen motionless PEARL sits up and points at it causing JOHN to notice her and see it We pan JOHN to the window where he looks out and stands motionless before turning We pan him back to bed while people wave from shore and boat We pan her into frame at UNCLE BIRDIE STEPTOE'S toylike little wharfboat which passes broadside cutting to as the boat passes BIRDIE'S head sticks through a porthole showing he is a wiry old river character and the boat whistles As BIRDIE speaks we pan JOHN and the foundered skiff into a twoshot before panning JOHN from the skiff to wharf and Birdie's door JOHN enters and sits on a box as BIRDIE in a ramshackle rocking chair pours coffee and gives JOHN a cup We watch for a moment more the two sleeping faces and then find ourselves in Peacock Alley a treeshaded dirt street of a small onestreet river town a picturesque mid19thcentury remnant of the old river civilization which general progress has left behind They stroll barefoot down the empty dirt sidewalk eventually looking towards the voices PEARL is friendly but JOHN is hostile Several stick their heads around the edge of the Schoolhouse door chanting at the HARPER CHILDREN while another draws something on the wall next to the door Over these lines we briefly cut to  chanting and drawing  as the ARTIST completes in chalk a large simple sketch of a man hanging from gallows As the verse ends we see them looking towards the children JOHN pays them no attention taking PEARL'S hand We shoot them through the window of MIZ CUNNINGHAM'S secondhand store with the back of a watch silhouetted large in the foreground JOHN'S eyes instantly fix on it while the schoolchildren finish their song and vanish giggling into the schoolhouse A watch with a moving sweephand ticks away Over a shopdoorbell we hear PEARL watching her JOHN the watch He walks off fast as we dolly behind them he leads PEARL who hugs her doll a few paces in silence until they come to the big window of Spoon's Ice Cream Parlor WILLA's face is seen within serving a customer"
        }
      ]
    }
  ]
}