{
  "ground_truth": "Rebecca notices a loose thread on her jacket and tears the sleeve. Alicia approaches Alette, while Rebecca, with her hair crimped, runs to a side table and tries to hide the tear using a canapé. As two women emerge from the powder room, Rebecca dives for the door, but her jacket catches on it, and beads tumble to the floor, causing her to fall into the arms of one of the women drinking champagne, who loses her balance. The jacket is pulled off Rebecca, who then assists the woman to her seat. Later, Rebecca is in the kitchen and, wearing a dress that resembles a waitress uniform, is pushed into the ballroom with a tray of food. Trying to return to the kitchen, a stern manager hisses at her, causing her to face Alette's table. She twirls around, bumps into a waiter, and sends fish flying. Luke stands up, takes Rebecca's trays, and Alicia purses her lips while Alette giggles. Later, on a romantically lit rooftop, Luke places his tuxedo around Rebecca's shoulders, gives her an enigmatic sideways glance, and they kiss. The next morning, Rebecca arrives at work in a red dress, with a fluffy orange shrug and swinging a matching orange bag, smiling softly as she rides the escalator. A man in a gray coat is on a lower escalator. She walks away coolly, bursts into a run, dives into a lift, and a black briefcase blocks the closing doors as Derek Smeath enters. Standing on the other side of the lift, she surreptitiously observes him: dark hair, pale complexion, glasses, gray raincoat. The lift stops at the Dantay-West Publications floor, a number of people exit, and Smeath glances at her, as more people board. She looks at his sturdy black briefcase, takes out her phone, and scrolls past Bergdorf, Bloomingdale's, and Chanel to Derek Smeath. She phones him, flashes a smile at a man entering the lift, but quickly cancels the call and puts the phone back in her bag. In horror, she rummages in her bag as the lift reaches Trout and Bass on the fifth floor, and she flees, glancing back as Smeath looks up and their eyes meet. He smiles slowly and smugly, and she dashes for the stairs, running through an office door as Smeath exits the lift. Rebecca freezes as Smeath is forcibly removed, and she watches him disappear, her tense smile relaxing. Finally, Alette's chauffeur-driven car arrives at a store.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Rebecca observes a loose strand on her coat and rips the sleeve. Alicia approaches Alette, while Rebecca, with her hair curled, dashes to a side table and attempts to conceal the rip using a canapé. As two women appear from the powder room, Rebecca lunges for the door, but her coat snags on it, and beads tumble to the ground, causing her to stumble into the arms of one of the women sipping champagne, who loses her equilibrium. The coat is pulled off Rebecca, who then aids the woman to her chair. Later, Rebecca is in the kitchen and, wearing a gown that resembles a waitress uniform, is nudged into the ballroom with a platter of food. Attempting to return to the kitchen, a stern manager hisses at her, causing her to face Alette's table. She spins around, collides with a waiter, and sends seafood soaring. Luke stands, takes Rebecca's platters, and Alicia compresses her lips while Alette chuckles. Later, on a romantically illuminated rooftop, Luke drapes his tuxedo around Rebecca's shoulders, gives her a mysterious sideways look, and they kiss. The next morning, Rebecca arrives at work in a crimson dress, with a fluffy orange wrap and swinging a corresponding orange bag, smiling softly as she rides the escalator. A man in a gray coat is on an inferior escalator. She walks away nonchalantly, bursts into a sprint, plunges into a lift, and a black briefcase obstructs the closing doors as Derek Smeath enters. Standing on the opposite side of the lift, she furtively observes him: dark hair, pale complexion, spectacles, gray raincoat. The lift halts at the Dantay-West Publications floor, a number of people depart, and Smeath glances at her, as more people board. She looks at his sturdy black briefcase, takes out her phone, and scrolls past Bergdorf, Bloomingdale's, and Chanel to Derek Smeath. She calls him, flashes a smile at a man entering the lift, but quickly cancels the call and puts the phone back in her bag. In horror, she rummages in her bag as the lift reaches Trout and Bass on the fifth floor, and she escapes, glancing back as Smeath looks up and their eyes meet. He smiles slowly and smugly, and she sprints for the stairs, running through an office door as Smeath exits the lift. Rebecca freezes as Smeath is forcibly removed, and she watches him vanish, her tense smile easing. Finally, Alette's chauffeur-driven car arrives at a shop."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Rebecca notices a loose thread on her jacket and the sleeve is torn by her. Alette is approached by Alicia, while Rebecca, with her hair crimped, runs to a side table and the tear is tried to be hidden by her using a canapé. As two women emerge from the powder room, the door is dived for by Rebecca, but her jacket catches on it, and beads tumble to the floor, causing her to fall into the arms of one of the women drinking champagne, who loses her balance. Rebecca is pulled off the jacket, who then assists the woman to her seat. Later, Rebecca is in the kitchen and, wearing a dress that resembles a waitress uniform, a stern manager pushes her into the ballroom with a tray of food. Trying to return to the kitchen, she is hissed at by the manager, causing her to face Alette's table. She twirls around, bumps into a waiter, and fish is sent flying by her. Luke stands up, the trays are taken from Rebecca by him, and Alicia purses her lips while Alette giggles. Later, on a romantically lit rooftop, a tuxedo is placed around Rebecca's shoulders by Luke, who gives her an enigmatic sideways glance, and they kiss. The next morning, Rebecca arrives at work in a red dress, with a fluffy orange shrug and swinging a matching orange bag, a soft smile on her face as she rides the escalator. A lower escalator is occupied by a man in a gray coat. She walks away coolly, bursts into a run, dives into a lift, and the closing doors are blocked by a black briefcase as Derek Smeath enters. Standing on the other side of the lift, she surreptitiously observes him: dark hair, pale complexion, glasses, gray raincoat. The Dantay-West Publications floor is reached by the lift, a number of people exit, and she is glanced at by Smeath, as more people board. A look is given to his sturdy black briefcase by her, she takes out her phone and scrolls past Bergdorf, Bloomingdale's, and Chanel to Derek Smeath. He is phoned by her, a smile is flashed at a man entering the lift, but the call is quickly canceled by her and the phone is put back in her bag. In horror, her bag is rummaged in by her as the lift reaches Trout and Bass on the fifth floor, and she flees, glancing back as Smeath looks up and their eyes meet. A slow and smug smile is given by him, and she dashes for the stairs, running through an office door as the lift is exited by Smeath. Rebecca freezes as Smeath is forcibly removed, and he is watched by her disappear, her tense smile relaxing. Finally, Alette's chauffeur-driven car arrives at a store."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Rebecca notices a loose thread on her jacket and tears the sleeve. Alicia approaches Alette, while Rebecca, with crimped hair, runs to a side table, trying to hide the tear with a canapé. As two women leave the powder room, Rebecca dives for the door, but her jacket catches, spilling beads and causing her to fall into a champagne-drinking woman's arms, who loses balance. The jacket is pulled off Rebecca, who then helps the woman to her seat. Later, Rebecca, in a waitress-like dress, is pushed into the ballroom with a food tray. Trying to return to the kitchen, a stern manager hisses at her, directing her to Alette's table. She twirls, bumps into a waiter, and sends fish flying. Luke stands, takes Rebecca's trays, and Alicia purses her lips while Alette giggles. On a romantically lit rooftop, Luke drapes his tuxedo over Rebecca's shoulders, gives her an enigmatic glance, and they kiss. The next morning, Rebecca arrives at work in a red dress, fluffy orange shrug, and matching bag, smiling softly on the escalator. A man in a gray coat is on a lower escalator. She walks away coolly, bursts into a run, dives into a lift, and a black briefcase blocks the closing doors as Derek Smeath enters. Standing on the other side, she observes him: dark hair, pale complexion, glasses, gray raincoat. The lift stops at Dantay-West Publications, people exit, and Smeath glances at her as more board. She looks at his black briefcase, takes out her phone, and scrolls past Bergdorf, Bloomingdale's, and Chanel to Derek Smeath. She calls him, smiles at a man entering the lift, but cancels the call and puts the phone back. In horror, she rummages in her bag as the lift reaches Trout and Bass on the fifth floor, and she flees, glancing back as Smeath looks up and their eyes meet. He smiles smugly, and she dashes for the stairs, running through an office door as Smeath exits the lift. Rebecca freezes as Smeath is forcibly removed, and she watches him disappear, her tense smile relaxing. Finally, Alette's chauffeur-driven car arrives at a store."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Rebecca notices a loose thread on her jacket, tearing the sleeve. Alicia approaches Alette, while Rebecca, with crimped hair, hides the tear with a canapé. As two women leave the powder room, Rebecca dives for the door, but her jacket catches, spilling beads and causing her to fall into a champagne-drinking woman, who loses balance. The jacket is pulled off Rebecca, who helps the woman to her seat. Later, Rebecca, in a waitress-like dress, is pushed into the ballroom with a food tray. A stern manager hisses at her, making her face Alette's table. She twirls, bumps a waiter, and sends fish flying. Luke stands, takes Rebecca's trays, and Alicia purses her lips while Alette giggles. On a romantically lit rooftop, Luke wraps his tuxedo around Rebecca, gives her an enigmatic glance, and they kiss. The next morning, Rebecca arrives at work in a red dress, fluffy orange shrug, and matching bag, smiling on the escalator. A man in a gray coat is on a lower escalator. She walks away, runs, dives into a lift, and a black briefcase blocks the doors as Derek Smeath enters. She observes him: dark hair, pale complexion, glasses, gray raincoat. The lift stops at Dantay-West Publications, people exit, and Smeath glances at her as more board. She looks at his briefcase, takes out her phone, scrolls past Bergdorf, Bloomingdale's, and Chanel to Derek Smeath. She calls him, smiles at a man entering, cancels the call, and puts the phone back. In horror, she rummages in her bag as the lift reaches Trout and Bass on the fifth floor, and she flees, glancing back as Smeath looks up and their eyes meet. He smiles smugly, and she dashes for the stairs, running through an office door as Smeath exits the lift. Rebecca freezes as Smeath is removed, watching him disappear, her tense smile relaxing. Finally, Alette's chauffeur-driven car arrives at a store."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Rebecca, while casually glancing down at her attire, notices a loose thread dangling from her jacket. In an attempt to fix it, she inadvertently tears the sleeve. Meanwhile, Alicia makes her way over to Alette, and Rebecca, with her hair styled in crimped waves, quickly dashes to a nearby side table. She attempts to cleverly conceal the tear by using a canapé. Just as two women emerge gracefully from the powder room, Rebecca makes a desperate dive for the door. Unfortunately, her jacket gets caught on it, causing a cascade of beads to scatter across the floor. This unexpected event leads her to stumble into the arms of one of the women who is sipping champagne, causing the woman to lose her balance. In the ensuing chaos, Rebecca's jacket is pulled off, and she promptly assists the woman back to her seat. \n\nLater on, Rebecca finds herself in the bustling kitchen, now dressed in an outfit that closely resembles a waitress uniform. She is unceremoniously pushed into the grand ballroom, balancing a tray of food. As she attempts to make her way back to the kitchen, a stern manager hisses at her, redirecting her attention toward Alette's table. In a flustered twirl, she accidentally collides with a waiter, sending a platter of fish flying through the air. Luke, observing the commotion, stands up and takes the trays from Rebecca, while Alicia purses her lips in disapproval and Alette giggles at the spectacle.\n\nLater, under the soft glow of romantic rooftop lighting, Luke gently drapes his tuxedo over Rebecca's shoulders. He gives her an enigmatic sideways glance, and they share a tender kiss. The following morning, Rebecca arrives at work, exuding confidence in a striking red dress, complemented by a fluffy orange shrug and a matching orange bag swinging at her side. She smiles softly as she ascends the escalator. A man in a gray coat rides the lower escalator. As she walks away with a cool demeanor, she suddenly bursts into a run, diving into a lift. Just as the doors begin to close, a black briefcase blocks them, and Derek Smeath enters. Standing on the opposite side of the lift, Rebecca surreptitiously observes him: his dark hair, pale complexion, glasses, and gray raincoat. \n\nThe lift halts at the Dantay-West Publications floor, and several people exit while Smeath glances in her direction as more people board. She notices his sturdy black briefcase, takes out her phone, and scrolls past Bergdorf, Bloomingdale's, and Chanel until she reaches Derek Smeath's contact. She dials his number, flashes a quick smile at a man entering the lift, but then hastily cancels the call, slipping the phone back into her bag. In a moment of horror, she rummages through her bag as the lift arrives at Trout and Bass on the fifth floor. She flees, casting a glance back as Smeath looks up, and their eyes meet. He smiles slowly and smugly, prompting her to dash for the stairs. She runs through an office door just as Smeath exits the lift. Rebecca freezes in place as Smeath is forcibly removed, and she watches him disappear, her tense smile gradually relaxing. Finally, Alette's chauffeur-driven car arrives at a store, marking the end of the eventful sequence."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Rebecca, while casually gazing down at her attire, becomes aware of a loose thread casually hanging from her jacket. In an attempt to address the minor wardrobe malfunction, she inadvertently rips the sleeve. Meanwhile, Alicia gracefully makes her way towards Alette, and Rebecca, with her hair styled in elegant crimped waves, quickly rushes over to a nearby side table. She attempts to cleverly mask the tear by covering it with a canapé. Just as two women emerge gracefully from the powder room, Rebecca makes a hasty and desperate dive for the door. Unfortunately, her jacket gets caught on it, causing a cascade of shimmering beads to scatter across the floor like a shower of tiny pearls. This unforeseen and unexpected event leads her to clumsily stumble into the arms of one of the women, who happens to be sipping champagne, causing the woman to teeter and lose her balance. Amid the ensuing chaos, Rebecca's jacket is inadvertently pulled off, and she promptly assists the woman back to her seat, offering apologies.\n\nLater on, Rebecca finds herself situated in the bustling, busy kitchen, now dressed in an outfit that closely resembles a waitress uniform. She is unceremoniously pushed through the door into the grand ballroom, precariously balancing a tray laden with delectable food. As she attempts to make her way back to the kitchen, a stern and sharply dressed manager hisses at her, redirecting her attention with urgency toward Alette's elegantly adorned table. In a flustered and hurried twirl, she accidentally collides with a waiter, sending a large platter of fish flying dramatically through the air. Luke, having observed the unfolding commotion, stands up decisively and takes the trays from Rebecca, while Alicia purses her lips in obvious disapproval and Alette giggles with amusement at the spectacle unfolding before her.\n\nLater in the evening, under the gentle, soft glow of romantic rooftop lighting, Luke tenderly drapes his sharp tuxedo over Rebecca's shoulders for warmth. He offers her an enigmatic sideways glance, and they share a tender, lingering kiss. The following morning, Rebecca arrives at work, exuding newfound confidence in a strikingly bold red dress, perfectly complemented by a fluffy orange shrug and a matching orange bag swinging elegantly at her side. She smiles softly as she gracefully ascends the escalator. A man in a gray coat rides the lower escalator, moving in the opposite direction. As she walks away with a composed and cool demeanor, she suddenly accelerates into a run, diving into a lift. Just as the doors begin to close, a black briefcase brusquely blocks them, and Derek Smeath enters purposefully. Standing on the opposite side of the lift, Rebecca surreptitiously observes him: his dark hair, pale complexion, glasses perched on his nose, and a gray raincoat worn over his suit.\n\nThe lift halts smoothly at the Dantay-West Publications floor, and several people exit while Smeath glances in her direction, as more individuals board. She notices his sturdy, sleek black briefcase, takes out her phone, and scrolls past the contacts for Bergdorf, Bloomingdale's, and Chanel until she reaches Derek Smeath's contact entry. She dials his number, flashes a quick smile at a man entering the lift, but then hastily cancels the call, slipping the phone discreetly back into her bag. In a moment of horror and panic, she rummages frantically through her bag as the lift arrives at Trout and Bass on the fifth floor. She flees the lift, casting a fleeting glance back as Smeath looks up, and their eyes meet. He smiles slowly and smugly, prompting her to dash quickly for the stairs. She runs swiftly through an office door just as Smeath exits the lift. Rebecca freezes momentarily in place as Smeath is forcibly removed from the scene, and she watches him disappear, her previously tense smile gradually relaxing into relief. Finally, Alette's luxurious chauffeur-driven car arrives at a store, marking the conclusion of the eventful and dramatic sequence."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Rebecca notices a loose thread dangling from her jacket and, in an attempt to fix it, inadvertently tears the sleeve. Meanwhile, Alicia makes her way toward Alette, and Rebecca, with her hair styled in crimped waves, quickly runs to a nearby side table. She attempts to conceal the tear by strategically placing a canapé over it. Just as two women emerge from the powder room, Rebecca makes a swift dive for the door, but her jacket snags on it, causing a cascade of beads to spill onto the floor. This unexpected event causes her to lose her balance and fall into the arms of one of the women who is sipping champagne, resulting in the woman also losing her balance. In the commotion, Rebecca's jacket is pulled off her, and she promptly assists the woman back to her seat. Later, Rebecca finds herself in the kitchen, now dressed in an outfit that resembles a waitress uniform. She is unceremoniously pushed into the ballroom, balancing a tray of food. As she attempts to make her way back to the kitchen, a stern manager hisses at her, redirecting her attention toward Alette's table. In a flustered attempt to regain her composure, she twirls around, accidentally colliding with a waiter, which sends a dish of fish flying through the air. Observing the chaos, Luke stands up and takes the trays from Rebecca, while Alicia purses her lips in disapproval and Alette giggles at the spectacle. Later, on a romantically lit rooftop, Luke gently drapes his tuxedo over Rebecca's shoulders, casting her an enigmatic sideways glance before they share a kiss. The following morning, Rebecca arrives at work, exuding confidence in a striking red dress, complemented by a fluffy orange shrug and a matching orange bag that swings by her side. She smiles softly as she ascends the escalator. On a lower escalator, a man in a gray coat catches her eye. She walks away with a cool demeanor, but suddenly bursts into a run, diving into a lift just as a black briefcase blocks the closing doors, allowing Derek Smeath to enter. Standing on the opposite side of the lift, she surreptitiously observes him, noting his dark hair, pale complexion, glasses, and gray raincoat. The lift halts at the Dantay-West Publications floor, and as several people exit, Smeath glances at her while more passengers board. She discreetly examines his sturdy black briefcase, then takes out her phone and scrolls through her contacts, passing Bergdorf, Bloomingdale's, and Chanel until she reaches Derek Smeath. She dials his number, flashes a quick smile at a man entering the lift, but hastily cancels the call and returns the phone to her bag. In a moment of horror, she rummages through her bag as the lift arrives at Trout and Bass on the fifth floor, prompting her to flee, casting a glance back as Smeath looks up and their eyes meet. He smiles slowly and smugly, prompting her to dash for the stairs, running through an office door just as Smeath exits the lift. Rebecca freezes in place as Smeath is forcibly removed from the premises, and she watches him disappear, her tense smile gradually relaxing. Finally, Alette's chauffeur-driven car arrives at a store, marking the end of the sequence."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Rebecca notices a loose thread on her jacket, which leads to a tear. As Alicia approaches Alette, Rebecca, with crimped hair, attempts to conceal the tear using a canapé. When two women emerge from the powder room, Rebecca's jacket catches on the door, causing beads to scatter and her to fall into a woman drinking champagne, who loses her balance. The jacket is pulled off, and Rebecca helps the woman to her seat. Later, Rebecca, now in a dress resembling a waitress uniform, is pushed into the ballroom with a tray of food. Attempting to return to the kitchen, a stern manager redirects her toward Alette's table. She spins around, collides with a waiter, and sends fish flying. Luke stands up, takes Rebecca's trays, while Alicia purses her lips and Alette giggles. On a romantically lit rooftop, Luke drapes his tuxedo over Rebecca's shoulders, gives her an enigmatic glance, and they kiss. The next morning, Rebecca arrives at work in a red dress with a fluffy orange shrug, swinging a matching bag and smiling softly on the escalator. A man in a gray coat is on a lower escalator. She walks away coolly, then runs to a lift, where Derek Smeath blocks the closing doors with his briefcase. Observing him discreetly, she notes his dark hair, pale complexion, glasses, and gray raincoat. The lift stops at the Dantay-West Publications floor, and as people exit, Smeath glances at her. She looks at his briefcase, takes out her phone, scrolls to Derek Smeath, and calls him, but quickly cancels and puts the phone away. In horror, she rummages in her bag as the lift reaches Trout and Bass on the fifth floor, and she flees, glancing back as Smeath looks up and their eyes meet. He smiles smugly, and she dashes for the stairs, running through an office door as Smeath exits the lift. Rebecca freezes as Smeath is forcibly removed, watching him disappear as her tense smile relaxes. Finally, Alette's chauffeur-driven car arrives at a store."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Rebecca notices a loose thread on her jacket, a designer piece she had saved up for, and tears the sleeve. Alicia, known for her keen fashion sense, approaches Alette, a prominent fashion editor. Meanwhile, Rebecca, with her hair crimped in the latest style inspired by 1980s fashion icons, runs to a side table and tries to hide the tear using a canapé, a small decorative appetizer. As two women, who had been freshening up their makeup, emerge from the powder room, Rebecca dives for the door, but her jacket catches on it, and beads, part of her intricate beadwork, tumble to the floor, causing her to fall into the arms of one of the women drinking champagne from a crystal flute, who loses her balance. The jacket is pulled off Rebecca, who then assists the woman to her seat, situated by a grand piano where soft music plays. Later, Rebecca is in the kitchen and, wearing a dress that resembles a waitress uniform like those used in upscale catering, is pushed into the ballroom with a tray of gourmet food. Trying to return to the kitchen, a stern manager, known for running a tight ship at high-profile events, hisses at her, causing her to face Alette's table, adorned with exquisite floral arrangements. She twirls around, bumps into a waiter, and sends fish flying onto an elaborate ice sculpture. Luke, who had been observing the scene with amusement, stands up, takes Rebecca's trays, and Alicia purses her lips while Alette giggles, amused by the chaos. Later, on a romantically lit rooftop overlooking the city skyline, Luke places his tuxedo, tailored to perfection, around Rebecca's shoulders, gives her an enigmatic sideways glance that hints at a shared secret, and they kiss. The next morning, Rebecca arrives at work in a red dress, a bold choice that catches the eye, with a fluffy orange shrug and swinging a matching orange bag, smiling softly as she rides the escalator in her office building. A man in a gray coat, who is often seen in the company of executives, is on a lower escalator. She walks away coolly, bursts into a run, dives into a lift, and a black briefcase blocks the closing doors as Derek Smeath, a well-known debt collector, enters. Standing on the other side of the lift, she surreptitiously observes him: dark hair, pale complexion, glasses, gray raincoat, all contributing to his intimidating presence. The lift stops at the Dantay-West Publications floor, home to various popular magazines, a number of people exit, and Smeath glances at her, as more people board. She looks at his sturdy black briefcase, takes out her phone, and scrolls past Bergdorf, Bloomingdale's, and Chanel, top shopping destinations, to Derek Smeath. She phones him, flashes a smile at a man entering the lift, but quickly cancels the call and puts the phone back in her bag. In horror, she rummages in her bag as the lift reaches Trout and Bass, known for their innovative marketing strategies, on the fifth floor, and she flees, glancing back as Smeath looks up and their eyes meet. He smiles slowly and smugly, aware of his intimidating reputation, and she dashes for the stairs, running through an office door as Smeath exits the lift. Rebecca freezes as Smeath is forcibly removed by security, and she watches him disappear, her tense smile relaxing. Finally, Alette's chauffeur-driven car, a symbol of her status, arrives at a high-end boutique store."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Rebecca notices a loose thread on her jacket and tears the sleeve. Alicia approaches Alette while Rebecca with her hair crimped runs to a side table and tries to hide the tear using a canapé. As two women emerge from the powder room Rebecca dives for the door but her jacket catches on it and beads tumble to the floor causing her to fall into the arms of one of the women drinking champagne who loses her balance. The jacket is pulled off Rebecca who then assists the woman to her seat. Later Rebecca is in the kitchen and wearing a dress that resembles a waitress uniform is pushed into the ballroom with a tray of food. Trying to return to the kitchen a stern manager hisses at her causing her to face Alette's table. She twirls around bumps into a waiter and sends fish flying. Luke stands up takes Rebecca's trays and Alicia purses her lips while Alette giggles. Later on a romantically lit rooftop Luke places his tuxedo around Rebecca's shoulders gives her an enigmatic sideways glance and they kiss. The next morning Rebecca arrives at work in a red dress with a fluffy orange shrug and swinging a matching orange bag smiling softly as she rides the escalator. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. A man in a gray coat is on a lower escalator. She walks away coolly bursts into a run dives into a lift and a black briefcase blocks the closing doors as Derek Smeath enters. Standing on the other side of the lift she surreptitiously observes him dark hair pale complexion glasses gray raincoat. The lift stops at the DantayWest Publications floor. a number of people exit and Smeath glances at her as more people board. She looks at his sturdy black briefcase takes out her phone and scrolls past Bergdorf Bloomingdale's and Chanel to Derek Smeath. She phones him flashes a smile at a man entering the lift but quickly cancels the call and puts the phone back in her bag. In horror she rummages in her bag as the lift reaches Trout and Bass on the fifth floor and she flees glancing back as Smeath looks up and their eyes meet. He smiles slowly and smugly and she dashes for the stairs running through an office door as Smeath exits the lift. Rebecca freezes as Smeath is forcibly removed and she watches him disappear her tense smile relaxing. Finally Alette's chauffeurdriven car arrives at a store."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Rebecca notices a loose thread on her jacket and tears the sleeve. Alicia approaches Alette while Rebecca with her hair crimped runs to a side table and tries to hide the tear using a canapé. As two women emerge from the powder room Rebecca dives for the door but her jacket catches on it and beads tumble to the floor causing her to fall into the arms of one of the women drinking champagne who loses her balance. The jacket is pulled off Rebecca who then assists the woman to her seat. Later Rebecca is in the kitchen and wearing a dress that resembles a waitress uniform is pushed into the ballroom with a tray of food. Trying to return to the kitchen a stern manager hisses at her causing her to face Alette's table. She twirls around bumps into a waiter and sends fish flying. Luke stands up takes Rebecca's trays and Alicia purses her lips while Alette giggles. Later on a romantically lit rooftop Luke places his tuxedo around Rebecca's shoulders gives her an enigmatic sideways glance and they kiss. The next morning Rebecca arrives at work in a red dress with a fluffy orange shrug and swinging a matching orange bag smiling softly as she rides the escalator. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. A man in a gray coat is on a lower escalator. She walks away coolly bursts into a run dives into a lift and a black briefcase blocks the closing doors as Derek Smeath enters. Standing on the other side of the lift she surreptitiously observes him dark hair pale complexion glasses gray raincoat. The lift stops at the DantayWest Publications floor. a number of people exit and Smeath glances at her as more people board. She looks at his sturdy black briefcase takes out her phone and scrolls past Bergdorf Bloomingdale's and Chanel to Derek Smeath. She phones him flashes a smile at a man entering the lift but quickly cancels the call and puts the phone back in her bag. In horror she rummages in her bag as the lift reaches Trout and Bass on the fifth floor and she flees glancing back as Smeath looks up and their eyes meet. He smiles slowly and smugly and she dashes for the stairs running through an office door as Smeath exits the lift. Rebecca freezes as Smeath is forcibly removed and she watches him disappear her tense smile relaxing. Finally Alette's chauffeurdriven car arrives at a store."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Rebecca notices a loose thread on her jacket and tears the sleeve. Alicia approaches Alette while Rebecca with her hair crimped runs to a side table and tries to hide the tear using a canapé. As two women emerge from the powder room Rebecca dives for the door but her jacket catches on it and beads tumble to the floor causing her to fall into the arms of one of the women drinking champagne who loses her balance. The jacket is pulled off Rebecca who then assists the woman to her seat. Later Rebecca is in the kitchen and wearing a dress that resembles a waitress uniform is pushed into the ballroom with a tray of food. She looks at his sturdy black briefcase takes out her phone and scrolls past Bergdorf Bloomingdale's and Chanel to Derek Smeath. She phones him flashes a smile at a man entering the lift but quickly cancels the call and puts the phone back in her bag. In horror she rummages in her bag as the lift reaches Trout and Bass on the fifth floor and she flees glancing back as Smeath looks up and their eyes meet. He smiles slowly and smugly and she dashes for the stairs running through an office door as Smeath exits the lift. Rebecca freezes as Smeath is forcibly removed and she watches him disappear her tense smile relaxing. Finally Alette's chauffeurdriven car arrives at a store."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Rebecca notices a loose thread on her jacket and tears the sleeve. Alicia approaches Alette while Rebecca with her hair crimped runs to a side table and tries to hide the tear using a canapé. He smiles slowly and smugly and she dashes for the stairs running through an office door as Smeath exits the lift. Rebecca freezes as Smeath is forcibly removed and she watches him disappear her tense smile relaxing. Finally Alette's chauffeurdriven car arrives at a store."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Julia spots a loose leaf on her sweater and rips the collar. Isabella approaches Fiona, while Julia, with her shoes polished, dashes to a bookshelf and attempts to conceal the rip using a muffin. As two gentlemen emerge from the cloakroom, Julia leaps for the window, but her sweater snags on it, and marbles scatter to the ground, causing her to tumble into the arms of one of the gentlemen sipping cider, who stumbles. The sweater is yanked off Julia, who then helps the gentleman to his chair. Later, Julia is in the pantry and, wearing an outfit that resembles a chef's apron, is nudged into the lounge with a platter of desserts. Attempting to return to the pantry, a stern supervisor shouts at her, prompting her to face Fiona's table. She spins around, collides with a busboy, and hurls cookies into the air. Simon rises, grabs Julia's platters, and Isabella raises an eyebrow while Fiona chuckles. Later, on a starlit veranda, Simon drapes his jacket around Julia's shoulders, gives her a mysterious sideways grin, and they embrace. The following morning, Julia arrives at the office in a blue skirt, with a fluffy purple scarf and swinging a matching purple purse, smiling gently as she descends the escalator. A woman in a beige coat stands on an upper escalator. She strides away confidently, bursts into a sprint, leaps into an elevator, and a brown suitcase halts the closing doors as Harold Banff enters. Standing across from her in the elevator, she slyly examines him: blonde hair, tanned skin, sunglasses, blue windbreaker. The elevator halts at the Eastman-Jones Publishing level, several people leave, and Banff glances at her, as additional people board. She eyes his sturdy brown suitcase, pulls out her tablet, and scrolls past Macy's, Saks, and Fendi to Harold Banff. She calls him, beams at a gentleman boarding the elevator, but immediately cancels the call and returns the tablet to her purse. In shock, she rummages in her purse as the elevator reaches Rainbow Carp on the twelfth floor, and she bolts, peering back as Banff looks up and their eyes connect. He grins slowly and smugly, and she rushes for the exit, sprinting through a conference room door as Banff exits the elevator. Julia pauses as Banff is escorted away, and she watches him vanish, her worried smile easing. Eventually, Fiona's limousine pulls up to a boutique."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Rebecca tears her jacket sleeve while trying to hide a loose thread and uses a canapé to cover it. Her jacket gets caught on a door, causing her to fall and lose it as beads scatter. Later in a waitress-like dress, she's pushed into a ballroom with food. A manager directs her to Alette's table, causing a collision with a waiter. Luke helps Rebecca by taking the trays, and Alette giggles at the scene. On a rooftop, Luke wraps his tuxedo around Rebecca, leading to a romantic kiss. The next day, Rebecca, dressed vibrantly, glimpses Derek Smeath as she rides an escalator at work. She hastily calls him but cancels, fleeing when their eyes meet. Smeath smiles smugly, and she dashes for the stairs. He is escorted away, easing Rebecca's tension. Alette's chauffeur-driven car arrives at a store, concluding the scene."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Finally Alette's chauffeurdriven car arrives at a store Rebecca freezes as Smeath is forcibly removed and she watches him disappear her tense smile relaxing  He smiles slowly and smugly and she dashes for the stairs running through an office door as Smeath exits the lift  In horror she rummages in her bag as the lift reaches Trout and Bass on the fifth floor and she flees glancing back as Smeath looks up and their eyes meet  She phones him flashes a smile at a man entering the lift but quickly cancels the call and puts the phone back in her bag  She looks at his sturdy black briefcase takes out her phone and scrolls past Bergdorf Bloomingdale's and Chanel to Derek Smeath  a number of people exit and Smeath glances at her as more people board  The lift stops at the DantayWest Publications floor  Standing on the other side of the lift she surreptitiously observes him dark hair pale complexion glasses gray raincoat  She walks away coolly bursts into a run dives into a lift and a black briefcase blocks the closing doors as Derek Smeath enters  A man in a gray coat is on a lower escalator  The next morning Rebecca arrives at work in a red dress with a fluffy orange shrug and swinging a matching orange bag smiling softly as she rides the escalator  Later on a romantically lit rooftop Luke places his tuxedo around Rebecca's shoulders gives her an enigmatic sideways glance and they kiss  Luke stands up takes Rebecca's trays and Alicia purses her lips while Alette giggles  She twirls around bumps into a waiter and sends fish flying  Trying to return to the kitchen a stern manager hisses at her causing her to face Alette's table  Later Rebecca is in the kitchen and wearing a dress that resembles a waitress uniform is pushed into the ballroom with a tray of food  The jacket is pulled off Rebecca who then assists the woman to her seat  As two women emerge from the powder room Rebecca dives for the door but her jacket catches on it and beads tumble to the floor causing her to fall into the arms of one of the women drinking champagne who loses her balance  Alicia approaches Alette while Rebecca with her hair crimped runs to a side table and tries to hide the tear using a canapé  Rebecca notices a loose thread on her jacket and tears the sleeve "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Alicia approaches Alette while Rebecca with her hair crimped runs to a side table and tries to hide the tear using a canapé Rebecca notices a loose thread on her jacket and tears the sleeve The jacket is pulled off Rebecca who then assists the woman to her seat As two women emerge from the powder room Rebecca dives for the door but her jacket catches on it and beads tumble to the floor causing her to fall into the arms of one of the women drinking champagne who loses her balance Trying to return to the kitchen a stern manager hisses at her causing her to face Alette's table Later Rebecca is in the kitchen and wearing a dress that resembles a waitress uniform is pushed into the ballroom with a tray of food Luke stands up takes Rebecca's trays and Alicia purses her lips while Alette giggles She twirls around bumps into a waiter and sends fish flying The next morning Rebecca arrives at work in a red dress with a fluffy orange shrug and swinging a matching orange bag smiling softly as she rides the escalator Later on a romantically lit rooftop Luke places his tuxedo around Rebecca's shoulders gives her an enigmatic sideways glance and they kiss She walks away coolly bursts into a run dives into a lift and a black briefcase blocks the closing doors as Derek Smeath enters A man in a gray coat is on a lower escalator The lift stops at the DantayWest Publications floor Standing on the other side of the lift she surreptitiously observes him dark hair pale complexion glasses gray raincoat She looks at his sturdy black briefcase takes out her phone and scrolls past Bergdorf Bloomingdale's and Chanel to Derek Smeath a number of people exit and Smeath glances at her as more people board In horror she rummages in her bag as the lift reaches Trout and Bass on the fifth floor and she flees glancing back as Smeath looks up and their eyes meet She phones him flashes a smile at a man entering the lift but quickly cancels the call and puts the phone back in her bag Rebecca freezes as Smeath is forcibly removed and she watches him disappear her tense smile relaxing He smiles slowly and smugly and she dashes for the stairs running through an office door as Smeath exits the lift Finally Alette's chauffeurdriven car arrives at a store"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She walks away coolly bursts into a run dives into a lift and a black briefcase blocks the closing doors as Derek Smeath enters  Standing on the other side of the lift she surreptitiously observes him dark hair pale complexion glasses gray raincoat  The lift stops at the DantayWest Publications floor  a number of people exit and Smeath glances at her as more people board  She looks at his sturdy black briefcase takes out her phone and scrolls past Bergdorf Bloomingdale's and Chanel to Derek Smeath  She phones him flashes a smile at a man entering the lift but quickly cancels the call and puts the phone back in her bag  In horror she rummages in her bag as the lift reaches Trout and Bass on the fifth floor and she flees glancing back as Smeath looks up and their eyes meet  He smiles slowly and smugly and she dashes for the stairs running through an office door as Smeath exits the lift  Rebecca freezes as Smeath is forcibly removed and she watches him disappear her tense smile relaxing  Finally Alette's chauffeurdriven car arrives at a store Rebecca notices a loose thread on her jacket and tears the sleeve  Alicia approaches Alette while Rebecca with her hair crimped runs to a side table and tries to hide the tear using a canapé  As two women emerge from the powder room Rebecca dives for the door but her jacket catches on it and beads tumble to the floor causing her to fall into the arms of one of the women drinking champagne who loses her balance  The jacket is pulled off Rebecca who then assists the woman to her seat  Later Rebecca is in the kitchen and wearing a dress that resembles a waitress uniform is pushed into the ballroom with a tray of food  Trying to return to the kitchen a stern manager hisses at her causing her to face Alette's table  She twirls around bumps into a waiter and sends fish flying  Luke stands up takes Rebecca's trays and Alicia purses her lips while Alette giggles  Later on a romantically lit rooftop Luke places his tuxedo around Rebecca's shoulders gives her an enigmatic sideways glance and they kiss  The next morning Rebecca arrives at work in a red dress with a fluffy orange shrug and swinging a matching orange bag smiling softly as she rides the escalator  A man in a gray coat is on a lower escalator "
        }
      ]
    }
  ]
}