{
  "ground_truth": "She slumps down and gazes miserably at a photograph of herself and black-haired Suze laughing together. In his office, Luke picks up the empty photo frame from his desk and looks at it with a sigh, adding it to the other personal things he's put in a cardboard box. Alicia appears at his door. Graham brings Alette a cup. Jane can't do tiny, and all eyes are on her as she cuts a millimeter slice. Alette's perfectly made-up eyes blink, and she gives a Gallic shrug. Luke is in a bank. At the shopaholic meeting, the door bursts open, and group members put up their hands. At Dantay-West, Allon, the receptionist, gets an email about a sale and auction by the girl in the green scarf. At her desk, Haley looks at her inbox, and her eyes widen as she's holding a piece of paper behind her back. Luke leans over and snatches it from her; it's the attachment Allon forwarded to all employees. He keeps the ad and looks at it with a sober expression while the shopaholics group are getting the auction items ready. With crazed eyes, Haley jumps out of a cab and dashes to join a queue of women standing outside the church building where the sale is taking place. Graham is on door duty, Allon is first in line, and Graham demonstrates a red ensemble. D. Freak is on hats, and Miss Korch produces the green scarf. Haley sends a text. Rebecca suddenly seems hesitant; she grabs back the scarf, walks towards the blonde purchaser, and places it in her outstretched hands, looking at her intriguingly. Jane and Graham look on proudly as the blonde, smiling coyly, waves the scarf at the applauding women. Rebecca looks distraught. Later, Graham counts the takings. Derek Smeath strides into his office, and the staff watches him pass with po-faced curiosity. He looks back at them through his old-fashioned, black-rimmed specs, and his pace slows. An employee, seeing him draw near, ducks into an unseen office. Smeath, scowling, wipes his mouth and turns to the door of his own office, where Rebecca is at his desk, and all the money is in jars of coins. It's the day of the wedding, and a photographer on the decorated front steps of the church snaps the maids of honor arranging Suze's wedding train. One of them wears blue, the other pale green, and the third is in red. A figure in pink hurries up as Suze turns around and looks coldly at Rebecca, who, wearing a pink tulle veil, looks imploringly at Suze. She turns towards the street, where the bag lady, standing with her trolley, twirls around in Rebecca's favorite pattern jacket. Suze's eyes mist over, and with a relieved smile, Rebecca whips off her spotted shrug.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She droops down and stares despondently at a photo of herself and dark-haired Suze chuckling together. In his workplace, Luke lifts the vacant picture frame from his desk and gazes at it with a groan, adding it to the other personal belongings he's placed in a cardboard container. Alicia emerges at his doorway. Graham brings Alette a mug. Jane can't do minuscule, and all eyes are on her as she slices a millimeter piece. Alette's impeccably adorned eyes flutter, and she offers a Gallic shrug. Luke is in a bank. At the shopaholic assembly, the door explodes open, and group members raise their hands. At Dantay-West, Allon, the secretary, gets an email about a deal and auction by the girl in the green scarf. At her desk, Haley glances at her inbox, and her eyes expand as she's holding a piece of paper behind her back. Luke leans over and grabs it from her; it's the attachment Allon forwarded to all staff. He retains the advertisement and gazes at it with a sober expression while the shopaholics group are getting the auction items prepared. With frenzied eyes, Haley leaps out of a taxi and rushes to join a line of women standing outside the church building where the sale is occurring. Graham is on door duty, Allon is first in the queue, and Graham exhibits a crimson ensemble. D. Freak is on headwear, and Miss Korch shows the green scarf. Haley sends a message. Rebecca suddenly appears hesitant; she snatches back the scarf, moves towards the fair-haired buyer, and places it in her extended hands, gazing at her intriguingly. Jane and Graham observe proudly as the blonde, smiling coyly, waves the scarf at the applauding women. Rebecca looks distressed. Later, Graham counts the earnings. Derek Smeath strides into his workspace, and the staff watches him pass with po-faced curiosity. He glances back at them through his old-fashioned, black-rimmed spectacles, and his pace decelerates. An employee, noticing him draw near, ducks into a hidden office. Smeath, scowling, wipes his mouth and turns to the doorway of his own office, where Rebecca is at his desk, and all the money is in jars of coins. It's the day of the nuptials, and a photographer on the decorated front steps of the church captures the maids of honor arranging Suze's bridal train. One of them wears blue, the other pale green, and the third is in red. A figure in pink hastens up as Suze turns around and looks coldly at Rebecca, who, wearing a pink tulle veil, gazes imploringly at Suze. She turns towards the street, where the bag lady, standing with her cart, twirls around in Rebecca's favorite pattern coat. Suze's eyes mist over, and with a relieved smile, Rebecca whips off her spotted shrug."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She slumps down and a photograph of herself and black-haired Suze laughing together is gazed at miserably by her. In his office, the empty photo frame is picked up by Luke from his desk, and it is looked at with a sigh as he adds it to the other personal things put by him in a cardboard box. Alicia appears at his door. A cup is brought to Alette by Graham. Tiny can't be done by Jane, and as a millimeter slice is cut by her, all eyes are on her. A Gallic shrug is given by Alette as her perfectly made-up eyes blink. A bank is where Luke is. At the shopaholic meeting, the door bursts open, and hands are put up by group members. At Dantay-West, an email about a sale and auction by the girl in the green scarf is got by Allon, the receptionist. At her desk, Haley looks at her inbox, and as she's holding a piece of paper behind her back, her eyes widen. It is snatched from her by Luke as he leans over; Allon forwarded the attachment to all employees. The ad is kept by him, and it is looked at with a sober expression while the auction items are getting ready by the shopaholics group. With crazed eyes, a cab is jumped out of by Haley, and she dashes to join a queue of women standing outside the church building where the sale is taking place. Door duty is done by Graham, Allon is the first in line, and a red ensemble is demonstrated by Graham. Hats are managed by D. Freak, and the green scarf is produced by Miss Korch. A text is sent by Haley. Rebecca suddenly seems hesitant; the scarf is grabbed back by her, she walks towards the blonde purchaser, and the scarf is placed in her outstretched hands as she looks at her intriguingly. Pride is felt by Jane and Graham as they look on while the blonde, smiling coyly, waves the scarf at the applauding women. Rebecca looks distraught. Later, the takings are counted by Graham. Derek Smeath strides into his office, and curiosity, po-faced, is shown by the staff as they watch him pass. Through his old-fashioned, black-rimmed specs, he looks back at them, and his pace is slowed. An unseen office is ducked into by an employee seeing him draw near. Scowling, Smeath wipes his mouth and turns to the door of his own office, where Rebecca is at his desk, and jars of coins contain all the money. The day of the wedding has arrived, and the maids of honor arranging Suze's wedding train are snapped by a photographer on the decorated front steps of the church. One of them wears blue, the other pale green, and the third is in red. A figure in pink hurries up as Rebecca wearing a pink tulle veil looks imploringly at Suze, who turns around and looks coldly at her. She turns towards the street, where her favorite pattern jacket is twirled around in by the bag lady with her trolley. Suze's eyes mist over, and a relieved smile is given by her as Rebecca whips off her spotted shrug."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She slumps and miserably stares at a photo of herself and Suze laughing. Luke, in his office, sighs at an empty photo frame and puts it in a cardboard box along with other personal items. Alicia appears at his door. Graham serves Alette a cup. Jane tries to cut a tiny slice as everyone watches. Alette blinks and shrugs. Luke is at a bank. At the shopaholic meeting, the door bursts open, and members raise their hands. At Dantay-West, receptionist Allon receives an email about a sale and auction by the girl in the green scarf. Haley's eyes widen at her inbox as she hides a paper, which Luke grabs; it's the attachment Allon forwarded to employees. He keeps the ad, looking sober while the shopaholics group prepares auction items. Haley, with wild eyes, exits a cab and joins a queue outside the church where the sale is held. Graham manages the door, Allon is first, and Graham demonstrates a red outfit. D. Freak is on hats, and Miss Korch shows the green scarf. Haley texts. Rebecca hesitantly retrieves the scarf, hands it to the blonde buyer, and watches her intriguingly. Jane and Graham proudly watch the blonde wave the scarf at applauding women. Rebecca looks upset. Graham later counts the takings. Derek Smeath enters his office, the staff observing him curiously. He slows, adjusts his black-rimmed glasses, and an employee ducks into another office. Smeath scowls, turns to his office where Rebecca is, and finds all the money in jars of coins. On the wedding day, a photographer captures maids of honor arranging Suze's train on the church steps. One maid wears blue, another pale green, and the third red. A figure in pink approaches, and Suze coldly looks at Rebecca, who, wearing a pink tulle veil, implores her. Rebecca notices the bag lady outside in her favorite pattern jacket. Suze's eyes mist over, and Rebecca, relieved, removes her spotted shrug."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She slumps and gazes at a photo of herself with black-haired Suze. In his office, Luke sighs at an empty frame and adds it to his box. Alicia appears at his door. Graham brings Alette a cup, and Jane draws attention as she cuts a tiny slice. Alette shrugs. Luke is in a bank. At the shopaholic meeting, the door bursts open, and members raise their hands. Allon at Dantay-West gets an email about a sale by the girl in the green scarf. Haley sees it and hides a paper, but Luke snatches it; it's Allon's attachment. He keeps it, looking sober while the group prepares auction items. Haley dashes to the church sale queue. Graham is on door duty, Allon first in line, and Graham shows a red ensemble. D. Freak has hats; Miss Korch the green scarf. Haley texts. Rebecca hesitates, grabs the scarf, and gives it to a blonde, who waves it at applauding women. Rebecca looks distraught. Graham counts takings. Derek Smeath enters his office with staff watching. An employee ducks away. Scowling, Smeath finds Rebecca at his desk with coins in jars. On Suze's wedding day, a photographer captures maids of honor in blue, green, and red. A figure in pink hurries as Suze looks coldly at Rebecca in a pink veil. Turning, Rebecca sees a bag lady in her favorite jacket. Suze smiles as Rebecca removes her shrug."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Feeling overwhelmed with emotion, she slumps down heavily onto the couch and stares intently and miserably at a cherished photograph. It captures a moment between herself and her black-haired friend, Suze, where they are joyfully laughing together. Meanwhile, in his office, Luke glances at an empty photo frame sitting on his desk. With a deep sigh, he picks it up and adds it thoughtfully to the growing collection of his personal belongings, which are now packed neatly in a cardboard box. At that moment, Alicia makes her presence known by appearing at his door. Elsewhere, Graham offers Alette a cup, perhaps of tea or coffee. Jane, unable to handle small details, is watched intently by everyone as she meticulously cuts a slice measuring just a millimeter. Alette's eyes, impeccable in makeup, blink expressively, and she shrugs in a distinctly Gallic manner. Luke finds himself standing in a bank. \n\nDuring the highly anticipated shopaholic meeting, the door dramatically bursts open, prompting the group members to raise their hands in a gesture that seems welcoming or orderly. Over at Dantay-West, Allon, who works as a receptionist, receives an email alerting him to a significant sale and auction organized by the girl in the green scarf. Meanwhile, at her own desk, Haley scans her inbox with growing excitement, her eyes widening as she discreetly holds a piece of paper hidden behind her back. At this moment, Luke leans over and deftly snatches the paper from her grip; it turns out to be an attachment that Allon has thoughtfully forwarded to all of the company's employees. He keeps the advertisement in his possession and examines it with a sober, thoughtful expression as, elsewhere, the shopaholics group busily prepares the auction items. With eyes filled with frenzy, Haley urgently leaps out of a taxi and rushes to join a long queue of eager women waiting outside the church building where the sale is about to take place. Graham, tasked with door duty, is present as Allon lines up first, demonstrating a vibrant red ensemble. Meanwhile, D. Freak is responsible for displaying hats, and Miss Korch presents the distinctive green scarf. Haley quickly sends a text message. \n\nAt this point, Rebecca suddenly appears hesitant; she reclaims the scarf and deliberately walks towards the blonde woman, who is the potential purchaser. Rebecca places it gently into her outstretched hands, regarding her with an intriguing expression. Jane and Graham watch the scene unfold with pride as the blonde woman, a coy smile on her lips, waves the scarf enthusiastically at the applauding women surrounding her. Rebecca, however, appears distraught. Later on, Graham carefully counts the proceeds. \n\nIn another location, Derek Smeath strides authoritatively into his office, as his staff observes him passing by with a mix of po-faced curiosity and silent contemplation. As he looks back at them through his old-fashioned, black-rimmed glasses, his pace noticeably slows. One employee, noticing his approach, discreetly ducks into an unseen office to avoid detection. Smeath, scowling slightly, wipes his mouth and turns toward the door of his own office, where he finds Rebecca at his desk with all the money organized into jars filled with coins. \n\nOn the day of the wedding, a photographer, stationed on the beautifully decorated front steps of the church, captures images of the maids of honor carefully arranging Suze's wedding train. Among them, one is dressed in blue, another in pale green, and the third in a striking shade of red. As a figure in pink hurries up, Suze turns around and casts a cold, indifferent look at Rebecca, who stands there wearing a pink tulle veil, looking imploringly at Suze. She then turns her attention toward the street, where she notices a bag lady standing with her trolley, twirling around in Rebecca's favorite patterned jacket. Suze's eyes begin to mist over with emotion, and with a relieved smile, Rebecca swiftly whips off her spotted shrug."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Feeling profoundly overwhelmed by a surge of emotion, she collapses heavily onto the inviting couch and fixes her gaze intently and miserably on a cherished photograph. This treasured image immortalizes a joyful moment shared between her and her black-haired friend, Suze, where both are captured in a state of genuine, shared laughter. Meanwhile, elsewhere, in his professionally styled office, Luke's eyes fall upon an empty photo frame resting on his neatly organized desk. With a deep, contemplative sigh, he thoughtfully picks it up and adds it to the steadily growing collection of his personal possessions now tucked neatly into a cardboard box. At just that moment, Alicia announces her presence by appearing at the entrance to his office. In a different setting, Graham extends a cup, perhaps filled with comforting tea or invigorating coffee, to Alette. Jane, overwhelmed by the minutiae, is intensely observed by everyone as she meticulously cuts a slice, measuring with precision, just a millimeter. Alette, with eyes perfectly adorned with makeup, blinks expressively and offers a shrug, which she executes in a distinctly Gallic fashion. Meanwhile, Luke is in a bank, contemplating his next move.\n\nDuring the much-anticipated shopaholic meeting, the door dramatically bursts open, prompting the group's members to raise their hands in an organized yet welcoming manner. Over at Dantay-West, Allon, serving as a receptionist, receives an email notifying him of a significant sale and auction orchestrated by the girl in the iconic green scarf. Meanwhile, at her own desk, Haley scans through her inbox with mounting excitement, her eyes widening as she discreetly holds a piece of paper concealed behind her back. At that very moment, Luke leans over and deftly snatches the paper from her grip; it turns out to be an attachment that Allon has thoughtfully forwarded to all employees within the company. He retains the advertisement in his possession, examining it with a sober, contemplative expression, while, elsewhere, the shopaholics group busily prepares the items for the upcoming auction. With eyes filled with a frenzy of anticipation, Haley urgently leaps from a taxi and rushes to join a long queue of eager women waiting outside the church building where the sale is about to commence. Graham, assigned to door duty, is vigilant as Allon lines up first, displaying a vibrant red ensemble. Meanwhile, D. Freak takes charge of showcasing hats, while Miss Korch presents the distinctive green scarf. Haley swiftly sends a text message.\n\nAt this point, Rebecca suddenly appears hesitant; she reclaims the coveted scarf and deliberately walks toward the blonde woman, who is the potential purchaser. Rebecca places it gently into her outstretched hands, regarding her with an intriguing expression that speaks volumes. Jane and Graham watch the unfolding scene with a sense of pride as the blonde woman, a coy smile on her lips, waves the scarf enthusiastically amid a sea of applauding women surrounding her. Rebecca, however, appears distraught by the event. Later, Graham meticulously counts the gathered proceeds.\n\nIn another location, Derek Smeath strides with authoritative confidence into his office, as his staff observes him passing by with a mixture of po-faced curiosity and silent contemplation. As he glances back at them through his old-fashioned, black-rimmed glasses, his pace noticeably slows. One observant employee, aware of his approach, discreetly ducks into an unseen office to avoid being noticed. Smeath, scowling slightly, wipes his mouth and turns toward the door of his own office, where he discovers Rebecca at his desk, having organized all the money into jars brimming with coins.\n\nOn the day of the wedding, a photographer, stationed on the beautifully decorated front steps of the church, captures striking images of the maids of honor as they carefully arrange Suze's splendid wedding train. Among them, one is gracefully dressed in blue, another in a gentle shade of pale green, and the third in a striking, vivid shade of red. As a figure clad in pink hurries up, Suze turns around and fixes a cold, indifferent look upon Rebecca, who stands wearing a pink tulle veil, looking imploringly at Suze. Rebecca then shifts her focus toward the street, where she notices a bag lady standing with her trolley, twirling with delight in Rebecca's favorite patterned jacket. Moved by a wave of emotion, Suze's eyes begin to mist over, and with a relieved smile spreading across her face, Rebecca swiftly whips off her spotted shrug."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She slumps down heavily onto a seat, allowing her shoulders to droop and her body to relax into a posture of dejection. Her eyes settle on a photograph showing a moment of shared joy, where she and Suze, her friend with distinctive black hair, are caught in a moment of laughter. In a separate scene, Luke settles into his office, where he reaches out to pick up an empty photo frame from his desk. He lifts it up, examining the void where a picture once was, and lets out a weary sigh, signaling an emotional resignation. He then places the frame into a cardboard box, which already contains other personal items, suggesting he's in the process of packing up. Just then, Alicia appears at the doorway, her presence adding a new layer of interaction. Meanwhile, Graham approaches Alette and hands her a cup, a gesture of offering or refreshment. In another setting, Jane struggles with precision as she attempts to cut a slice that's a mere millimeter thick, a task that draws the attention of everyone present, making her the center of focus. Alette's eyes, carefully adorned with makeup, blink at the scene, and she responds with a Gallic shrug, a nonchalant gesture conveying casual indifference. Elsewhere, Luke finds himself inside a bank, undertaking unspecified activities. At a shopaholic meeting, the door swings open with force, prompting group members to raise their hands, possibly as a gesture of acknowledgment or greeting. Over at Dantay-West, Allon, the receptionist, receives an email that alerts him to a sale and auction being organized by the girl known for wearing a green scarf. At her desk, Haley glances at her inbox; her eyes widen in surprise or realization as she discreetly holds a piece of paper behind her back. Luke, sensing the need for action, leans over and deftly snatches the paper from her grasp, revealing it to be the attachment Allon had forwarded to all employees. He retains the advertisement, examining it closely with a serious expression. Meanwhile, members of the shopaholics group energetically prepare items for the auction. Haley, her eyes filled with a frantic energy, leaps out of a taxi and rushes to join a queue of women waiting outside the church building where the sale will occur. Graham stands on door duty, overseeing the event, with Allon at the front of the line. Graham showcases a red ensemble to the attendees. D. Freak is tasked with organizing hats, while Miss Korch presents the much-desired green scarf. Haley sends off a quick text, while Rebecca suddenly hesitates, her demeanor shifting as she retrieves the scarf and approaches a blonde woman who is interested in purchasing it. She extends the scarf to the woman, studying her with a sense of intrigue. Jane and Graham watch the transaction unfold with pride, as the blonde woman, smiling shyly, waves the scarf in the air to the applause of the gathered women. Rebecca, however, seems stricken with distress. Later, Graham is counting the proceeds from the sale. In an office setting, Derek Smeath strides purposefully into his workplace, attracting the curious yet expressionless gazes of the staff who watch him pass by. His eyes, framed by old-fashioned black-rimmed glasses, glance back at the employees, and he momentarily reduces his pace. One employee, anticipating his approach, discreetly withdraws into an office out of sight. With a frown etched across his features, Smeath wipes his mouth and turns his attention to the door of his own office, where Rebecca is already present at his desk, surrounded by jars filled with coins, indicative of the auction earnings. The narrative shifts to the day of a wedding, where a photographer captures an image of the maids of honor arranging the wedding train of Suze, who is the bride. Each maid wears a distinct color: one in blue, another in pale green, and a third in red. As a figure dressed in pink makes a hurried entry, Suze turns to look at Rebecca with a cold gaze. Rebecca, donning a pink tulle veil, looks back at Suze with a pleading expression. She then diverts her gaze towards the street, where she sees a bag lady twirling in a jacket that bears Rebecca's favored pattern, triggering a wave of mixed emotions. Suze’s eyes grow misty, and as a smile of relief spreads across her face, Rebecca, experiencing a sense of liberation, swiftly removes her spotted shrug, suggesting a release from past burdens."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She slumps and gazes miserably at a photograph of herself and Suze laughing together. In his office, Luke sighs as he packs an empty photo frame into a cardboard box of personal items. Alicia appears at the door. Graham brings Alette a cup, and Jane hesitantly cuts a tiny slice while Alette shrugs with a blink of her perfectly made-up eyes. Luke visits a bank. At the shopaholic meeting, the door bursts open, prompting group members to raise their hands. At Dantay-West, receptionist Allon receives an email about a sale and auction by the girl in the green scarf. At her desk, Haley sees the email, and as she tries to conceal it, Luke snatches the attachment from her. He examines the ad with a serious expression while the shopaholics group prepares the auction items. Haley excitedly jumps out of a cab and joins a queue of women outside the church where the sale occurs. Graham manages the door, Allon leads the line, Graham showcases a red ensemble, D. Freak handles hats, and Miss Korch reveals the green scarf. Haley sends a text. Rebecca, appearing hesitant, retrieves the scarf and hands it to the blonde purchaser, who waves it happily, eliciting applause from the women, while Rebecca watches distraught. Later, Graham counts the earnings. Derek Smeath strides into his office, observed by curious staff. As he approaches, an employee slyly slips away. Smeath, scowling, turns to his office, finding Rebecca at his desk with the money in jars of coins. On Suze's wedding day, a photographer captures the maids of honor arranging her train on the church steps, dressed in blue, green, and red. As Rebecca, wearing a pink tulle veil, approaches, Suze turns coldly toward her. Rebecca then sees a bag lady on the street twirling in her favorite pattern jacket, and with misty eyes, Suze smiles in relief as Rebecca removes her spotted shrug."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She slumps down and gazes miserably at a photograph of herself and black-haired Suze laughing together during a summer vacation in the south of France, a favorite destination known for its beautiful landscapes and calming beaches. In his office, Luke picks up the empty photo frame from his desk and looks at it with a sigh, adding it to the other personal things he's put in a cardboard box as he prepares to leave his job after a controversial company merger. Alicia, known for her tenacity in corporate politics, appears at his door. Graham brings Alette a cup of herbal tea, a popular afternoon tradition in their office aimed at promoting wellness. Jane can't do tiny, and all eyes are on her as she cuts a millimeter slice of the extravagant cake, which is renowned for its intricate sugar work. Alette's perfectly made-up eyes, a testament to her former career as a makeup artist in Paris, blink, and she gives a Gallic shrug, a quintessentially French gesture of indifference. Luke is in a bank, discussing a mortgage for his dream house near Central Park, which is a prime piece of real estate in New York City. At the shopaholic meeting, the door bursts open, and group members, who gather weekly to support each other's efforts to curb excessive spending, put up their hands. At Dantay-West, a well-known fashion PR firm, Allon, the receptionist, gets an email about a sale and auction by the girl in the green scarf, an emerging fashion influencer famous for her unique style. At her desk, Haley looks at her inbox, and her eyes widen as she's holding a piece of paper behind her back detailing a confidential client list. Luke leans over and snatches it from her; it's the attachment Allon forwarded to all employees, announcing a major fashion event. He keeps the ad and looks at it with a sober expression while the shopaholics group are getting the auction items ready for the charity event that aims to support local artisans. With crazed eyes, Haley jumps out of a cab and dashes to join a queue of women standing outside the church building, a historic venue known for hosting community sales, where the sale is taking place. Graham is on door duty, Allon is first in line, and Graham demonstrates a red ensemble designed by a local designer who recently gained media attention. D. Freak is on hats, known for her avant-garde creations, and Miss Korch produces the green scarf, a signature piece that started the entire auction buzz. Haley sends a text to her friend, eager to share the news. Rebecca suddenly seems hesitant; she grabs back the scarf, walks towards the blonde purchaser, and places it in her outstretched hands, looking at her intriguingly, aware that the scarf symbolizes more than just fashion; it's a bond of friendship. Jane and Graham look on proudly as the blonde, smiling coyly, waves the scarf at the applauding women, acknowledging the unique story behind it. Rebecca looks distraught, having parted with the item that held sentimental value. Later, Graham counts the takings, which will fund a local charity's outreach program. Derek Smeath strides into his office, and the staff, aware of his reputation for being a no-nonsense manager, watches him pass with po-faced curiosity. He looks back at them through his old-fashioned, black-rimmed specs, often associated with his meticulous nature, and his pace slows. An employee, seeing him draw near, ducks into an unseen office to avoid an impromptu performance review. Smeath, scowling, wipes his mouth and turns to the door of his own office, where Rebecca is at his desk, and all the money is in jars of coins, a quirky method of saving he insists upon. It's the day of the wedding, and a photographer on the decorated front steps of the church, a popular venue known for its stunning architecture, snaps the maids of honor arranging Suze's wedding train. One of them wears blue, a nod to the family tradition symbolizing calmness, the other pale green for new beginnings, and the third is in red, representing love and passion. A figure in pink hurries up as Suze turns around and looks coldly at Rebecca, who, wearing a pink tulle veil that matches the wedding theme, looks imploringly at Suze, silently apologizing for past misunderstandings. She turns towards the street, where the bag lady, standing with her trolley filled with collected trinkets, twirls around in Rebecca's favorite pattern jacket, a gift from her late grandmother. Suze's eyes mist over at the shared memory, and with a relieved smile, Rebecca whips off her spotted shrug, a gesture of letting go and embracing the future."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She slumps down and gazes miserably at a photograph of herself and blackhaired Suze laughing together. In his office Luke picks up the empty photo frame from his desk and looks at it with a sigh adding it to the other personal things. he is put in a cardboard box. Alicia appears at his door. Graham brings Alette a cup. Jane cannot do tiny and all eyes are on her as she cuts a millimeter slice. Alette's perfectly madeup eyes blink and she gives a Gallic shrug. Luke is in a bank. At the shopaholic meeting the door bursts open and group members put up their hands. At DantayWest Allon the receptionist gets an email about a sale and auction by the girl in the green scarf. At her desk Haley looks at her inbox and her eyes widen as she is holding a piece of paper behind her back. Luke leans over and snatches it from her. it is the attachment Allon forwarded to all employees. He keeps the ad and looks at it with a sober expression. while the shopaholics group are getting the auction items ready. With crazed eyes Haley jumps out of a cab and dashes to join a queue of women standing outside the church building where the sale is taking place. Graham is on door duty. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Allon is first in line and Graham demonstrates a red ensemble. D Freak is on hats and Miss Korch produces the green scarf. Haley sends a text. Rebecca suddenly seems hesitant. she grabs back the scarf walks towards the blonde purchaser and places it in her outstretched hands looking at her intriguingly. Jane and Graham look on proudly as the blonde smiling coyly waves the scarf at the applauding women. Rebecca looks distraught. Later Graham counts the takings. Derek Smeath strides into his office and the staff watches him pass with pofaced curiosity. He looks back at them through his oldfashioned blackrimmed specs and his pace slows. An employee seeing him draw near ducks into an unseen office. Smeath scowling wipes his mouth and turns to the door of his own office where Rebecca is at his desk and all the money is in jars of coins. It is the day of the wedding and a photographer on the decorated front steps of the church snaps the maids of honor arranging Suze's wedding train. One of them wears blue the other pale green and the third is in red. A figure in pink hurries up as Suze turns around and looks coldly at Rebecca who wearing a pink tulle veil looks imploringly at Suze. She turns towards the street where the bag lady standing with her trolley twirls around in Rebecca's favorite pattern jacket. Suze's eyes mist over and with a relieved smile. Rebecca whips off her spotted shrug."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She slumps down and gazes miserably at a photograph of herself and blackhaired Suze laughing together. In his office Luke picks up the empty photo frame from his desk and looks at it with a sigh adding it to the other personal things. he is put in a cardboard box. Alicia appears at his door. Graham brings Alette a cup. Jane cannot do tiny and all eyes are on her as she cuts a millimeter slice. Alette's perfectly madeup eyes blink and she gives a Gallic shrug. Luke is in a bank. At the shopaholic meeting the door bursts open and group members put up their hands. At DantayWest Allon the receptionist gets an email about a sale and auction by the girl in the green scarf. At her desk Haley looks at her inbox and her eyes widen as she is holding a piece of paper behind her back. Luke leans over and snatches it from her. it is the attachment Allon forwarded to all employees. He keeps the ad and looks at it with a sober expression. while the shopaholics group are getting the auction items ready. With crazed eyes Haley jumps out of a cab and dashes to join a queue of women standing outside the church building where the sale is taking place. Graham is on door duty. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Allon is first in line and Graham demonstrates a red ensemble. D Freak is on hats and Miss Korch produces the green scarf. Haley sends a text. Rebecca suddenly seems hesitant. she grabs back the scarf walks towards the blonde purchaser and places it in her outstretched hands looking at her intriguingly. Jane and Graham look on proudly as the blonde smiling coyly waves the scarf at the applauding women. Rebecca looks distraught. Later Graham counts the takings. Derek Smeath strides into his office and the staff watches him pass with pofaced curiosity. He looks back at them through his oldfashioned blackrimmed specs and his pace slows. An employee seeing him draw near ducks into an unseen office. Smeath scowling wipes his mouth and turns to the door of his own office where Rebecca is at his desk and all the money is in jars of coins. It is the day of the wedding and a photographer on the decorated front steps of the church snaps the maids of honor arranging Suze's wedding train. One of them wears blue the other pale green and the third is in red. A figure in pink hurries up as Suze turns around and looks coldly at Rebecca who wearing a pink tulle veil looks imploringly at Suze. She turns towards the street where the bag lady standing with her trolley twirls around in Rebecca's favorite pattern jacket. Suze's eyes mist over and with a relieved smile. Rebecca whips off her spotted shrug."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She slumps down and gazes miserably at a photograph of herself and blackhaired Suze laughing together. In his office Luke picks up the empty photo frame from his desk and looks at it with a sigh adding it to the other personal things. he is put in a cardboard box. Alicia appears at his door. Graham brings Alette a cup. Jane cannot do tiny and all eyes are on her as she cuts a millimeter slice. Alette's perfectly madeup eyes blink and she gives a Gallic shrug. Luke is in a bank. At the shopaholic meeting the door bursts open and group members put up their hands. He looks back at them through his oldfashioned blackrimmed specs and his pace slows. An employee seeing him draw near ducks into an unseen office. Smeath scowling wipes his mouth and turns to the door of his own office where Rebecca is at his desk and all the money is in jars of coins. It is the day of the wedding and a photographer on the decorated front steps of the church snaps the maids of honor arranging Suze's wedding train. One of them wears blue the other pale green and the third is in red. A figure in pink hurries up as Suze turns around and looks coldly at Rebecca who wearing a pink tulle veil looks imploringly at Suze. She turns towards the street where the bag lady standing with her trolley twirls around in Rebecca's favorite pattern jacket. Suze's eyes mist over and with a relieved smile. Rebecca whips off her spotted shrug."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She slumps down and gazes miserably at a photograph of herself and blackhaired Suze laughing together. In his office Luke picks up the empty photo frame from his desk and looks at it with a sigh adding it to the other personal things. he is put in a cardboard box. A figure in pink hurries up as Suze turns around and looks coldly at Rebecca who wearing a pink tulle veil looks imploringly at Suze. She turns towards the street where the bag lady standing with her trolley twirls around in Rebecca's favorite pattern jacket. Suze's eyes mist over and with a relieved smile. Rebecca whips off her spotted shrug."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "He floats upwards and glances joyfully at a painting of a cat and orange-tailed Max barking together. In a cabin, Jason picks up the full trophy case from his shelf and stares at it with a laugh, tossing it to the other mundane creatures he's placed in a wooden crate. Dana materializes at his window. Harold hands Albert a hat. Lily can't sing loudly, and many ears are on her as she whispers a kilometer note. Albert's unevenly brushed teeth clatter, and he gives a sarcastic grin. Jason is at a bakery. At the ballroom dance event, the window swings closed, and team leaders lower their feet. At Silver-Woods, Raul, the lifeguard, receives a message about a concert and exhibition by the woman in the orange coat. At her chair, Nancy glances at her folder, and her fingers tremble as she's holding a rock beneath her chair. Jason jumps up and grips it from her; it's the postcard Raul mailed to all friends. He drops the menu and stares at it with a joyful grin while the dancers' group are hiding the performance costumes. With calm hands, Nancy jumps into a truck and strolls to join a cluster of men standing inside the museum hall where the concert is occurring. Harold is on guard duty, Raul is last in position, and Harold reveals a blue canoe. Mr. Calm is on shoes, and Mrs. Green creates the orange coat. Nancy reads a poem. Leonard suddenly feels confident; he tosses away the coat, runs from the tall seller, and throws it towards his bent elbows, glancing at him dismissively. Lily and Harold gaze down sadly as the tall man, giggling briefly, throws the coat into the booing crowd. Leonard feels excited. Earlier, Harold divides the losses. Tristan René tiptoes towards his cabin, and the guests ignore him walk with open-mouthed panic. He peers toward them under his futuristic, gold-tinted monocle, and his stance quickens. A stranger, noticing him approach, leaps into a sealed cabin. René, smirking, rubs his eyes and turns from the window of his own cabin, where Leonard is near his chair, and each bill is in bags of toys. It's the eve of the holiday, and a sculptor on the abandoned stone hallway of the museum collects the groomsmen jumping on Paul's wedding cake. One of them dresses in pink, another dark blue, and the last is in orange. A figure in yellow skips down as Paul spins around and gazes fondly at Leonard, who, wearing a yellow cotton sash, glances casually at Paul. He rotates away from the forest, where the balloon vendor, sitting with her cart, dances around in Leonard's disliked design trousers. Paul's feet freeze still, and with a nervous frown, Leonard tugs off his striped boots."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Rebecca feels despondent as she looks at a photo with Suze. Meanwhile, Luke gathers his belongings, including an empty photo frame, from his office. At a shopaholic meeting, chaos ensues as news of a sale circulates. Haley receives an alert about the sale featuring the girl in the green scarf, and Luke, seeing the ad, takes it somberly. At the sale, Haley rushes to join a queue of eager women. Graham manages the door, while others, including D. Freak and Miss Korch, help display items like the green scarf. Rebecca hesitates but eventually gives the scarf to a blonde buyer, who waves it proudly amid applause, leaving Rebecca upset. Afterward, Graham counts the proceeds. Derek Smeath, entering his office, finds Rebecca, surrounded by jars of coin money. On Suze's wedding day, maids of honor organize her train, and Rebecca, in a pink veil, seeks Suze's forgiveness. Suze, seeing a bag lady in Rebecca's prized jacket, softens. Rebecca, smiling, removes a spotted shrug, signifying reconciliation."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Rebecca whips off her spotted shrug Suze's eyes mist over and with a relieved smile She turns towards the street where the bag lady standing with her trolley twirls around in Rebecca's favorite pattern jacket A figure in pink hurries up as Suze turns around and looks coldly at Rebecca who wearing a pink tulle veil looks imploringly at Suze One of them wears blue the other pale green and the third is in red It is the day of the wedding and a photographer on the decorated front steps of the church snaps the maids of honor arranging Suze's wedding train Smeath scowling wipes his mouth and turns to the door of his own office where Rebecca is at his desk and all the money is in jars of coins An employee seeing him draw near ducks into an unseen office He looks back at them through his oldfashioned blackrimmed specs and his pace slows Derek Smeath strides into his office and the staff watches him pass with pofaced curiosity Later Graham counts the takings Rebecca looks distraught Jane and Graham look on proudly as the blonde smiling coyly waves the scarf at the applauding women she grabs back the scarf walks towards the blonde purchaser and places it in her outstretched hands looking at her intriguingly Rebecca suddenly seems hesitant Haley sends a text D Freak is on hats and Miss Korch produces the green scarf Allon is first in line and Graham demonstrates a red ensemble Graham is on door duty With crazed eyes Haley jumps out of a cab and dashes to join a queue of women standing outside the church building where the sale is taking place while the shopaholics group are getting the auction items ready He keeps the ad and looks at it with a sober expression it is the attachment Allon forwarded to all employees Luke leans over and snatches it from her At her desk Haley looks at her inbox and her eyes widen as she is holding a piece of paper behind her back At DantayWest Allon the receptionist gets an email about a sale and auction by the girl in the green scarf At the shopaholic meeting the door bursts open and group members put up their hands Luke is in a bank Alette's perfectly madeup eyes blink and she gives a Gallic shrug Jane cannot do tiny and all eyes are on her as she cuts a millimeter slice Graham brings Alette a cup Alicia appears at his door he is put in a cardboard box In his office Luke picks up the empty photo frame from his desk and looks at it with a sigh adding it to the other personal things She slumps down and gazes miserably at a photograph of herself and blackhaired Suze laughing together"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "In his office Luke picks up the empty photo frame from his desk and looks at it with a sigh adding it to the other personal things She slumps down and gazes miserably at a photograph of herself and blackhaired Suze laughing together Alicia appears at his door he is put in a cardboard box Jane cannot do tiny and all eyes are on her as she cuts a millimeter slice Graham brings Alette a cup Luke is in a bank Alette's perfectly madeup eyes blink and she gives a Gallic shrug At DantayWest Allon the receptionist gets an email about a sale and auction by the girl in the green scarf At the shopaholic meeting the door bursts open and group members put up their hands Luke leans over and snatches it from her At her desk Haley looks at her inbox and her eyes widen as she is holding a piece of paper behind her back He keeps the ad and looks at it with a sober expression it is the attachment Allon forwarded to all employees With crazed eyes Haley jumps out of a cab and dashes to join a queue of women standing outside the church building where the sale is taking place while the shopaholics group are getting the auction items ready Allon is first in line and Graham demonstrates a red ensemble Graham is on door duty Haley sends a text D Freak is on hats and Miss Korch produces the green scarf she grabs back the scarf walks towards the blonde purchaser and places it in her outstretched hands looking at her intriguingly Rebecca suddenly seems hesitant Rebecca looks distraught Jane and Graham look on proudly as the blonde smiling coyly waves the scarf at the applauding women Derek Smeath strides into his office and the staff watches him pass with pofaced curiosity Later Graham counts the takings An employee seeing him draw near ducks into an unseen office He looks back at them through his oldfashioned blackrimmed specs and his pace slows It is the day of the wedding and a photographer on the decorated front steps of the church snaps the maids of honor arranging Suze's wedding train Smeath scowling wipes his mouth and turns to the door of his own office where Rebecca is at his desk and all the money is in jars of coins A figure in pink hurries up as Suze turns around and looks coldly at Rebecca who wearing a pink tulle veil looks imploringly at Suze One of them wears blue the other pale green and the third is in red Suze's eyes mist over and with a relieved smile She turns towards the street where the bag lady standing with her trolley twirls around in Rebecca's favorite pattern jacket Rebecca whips off her spotted shrug"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "D Freak is on hats and Miss Korch produces the green scarf Haley sends a text Rebecca suddenly seems hesitant she grabs back the scarf walks towards the blonde purchaser and places it in her outstretched hands looking at her intriguingly Jane and Graham look on proudly as the blonde smiling coyly waves the scarf at the applauding women Rebecca looks distraught Later Graham counts the takings Derek Smeath strides into his office and the staff watches him pass with pofaced curiosity He looks back at them through his oldfashioned blackrimmed specs and his pace slows An employee seeing him draw near ducks into an unseen office Smeath scowling wipes his mouth and turns to the door of his own office where Rebecca is at his desk and all the money is in jars of coins It is the day of the wedding and a photographer on the decorated front steps of the church snaps the maids of honor arranging Suze's wedding train One of them wears blue the other pale green and the third is in red A figure in pink hurries up as Suze turns around and looks coldly at Rebecca who wearing a pink tulle veil looks imploringly at Suze She turns towards the street where the bag lady standing with her trolley twirls around in Rebecca's favorite pattern jacket Suze's eyes mist over and with a relieved smile Rebecca whips off her spotted shrug She slumps down and gazes miserably at a photograph of herself and blackhaired Suze laughing together In his office Luke picks up the empty photo frame from his desk and looks at it with a sigh adding it to the other personal things he is put in a cardboard box Alicia appears at his door Graham brings Alette a cup Jane cannot do tiny and all eyes are on her as she cuts a millimeter slice Alette's perfectly madeup eyes blink and she gives a Gallic shrug Luke is in a bank At the shopaholic meeting the door bursts open and group members put up their hands At DantayWest Allon the receptionist gets an email about a sale and auction by the girl in the green scarf At her desk Haley looks at her inbox and her eyes widen as she is holding a piece of paper behind her back Luke leans over and snatches it from her it is the attachment Allon forwarded to all employees He keeps the ad and looks at it with a sober expression while the shopaholics group are getting the auction items ready With crazed eyes Haley jumps out of a cab and dashes to join a queue of women standing outside the church building where the sale is taking place Graham is on door duty Allon is first in line and Graham demonstrates a red ensemble"
        }
      ]
    }
  ]
}