{
  "ground_truth": "Cal waves, and his friend knocks back the wine. The guy, Bernie, eyes him anxiously, then looks down and puts a Macy's bag on the bar, causing Cal to frown, bewildered. Bernie gets up, Cal shrugs and smiles, and Bernie heads out of the bar. Jacob is at the table with one woman, while Cal is woeful. Jacob is listening as Cal glances over at him, and Jacob beckons him. Cal looks over his shoulder for someone else, but Jacob beckons him again. Cal regards Jacob thoughtfully, picks up his drink and cologne, and heads over to Jacob's table just as the woman gets up to leave. Cal nods and sits back down, lowering his glass and staring as Jacob takes a swig of his drink and nods at Cal. Cal studies him, and Jacob cocks his head. Cal nods, and Jacob raises his glass and drinks, prompting Cal to follow suit without using his straw. Jacob beckons to the woman, and Cal looks around. Jacob points at Cal, then gets up and heads off with the pretty dark-haired woman, who smiles at Cal. Cal turns to watch them leave, then relaxes into his chair and sucks on his straw. Molly rushes in front of the TV and starts dancing as Cal and Robbie lean against the kitchen counter, with Robbie letting his head flop onto his hands. Jessica smiles at Robbie, who fidgets awkwardly and looks down. In the mall, Cal ascends on an escalator and strolls through the mall. Hannah and Liz are at a bar with a group, and they all raise their glasses. The guy, who is dark-haired and a bit gawky looking, kisses Hannah on the lips, and Hannah smiles excitedly. Hannah looks over at him and smiles as Liz heads off. Hannah regards her boyfriend, who is playing with his phone and sitting next to another guy doing the same thing. Hannah's smile fades, and her eyes dart as Jacob stands by a glass barrier on the roof terrace of the mall. He bites into a piece of folded-up pizza, dressed smartly in a dark suit, brown shoes, and sunglasses. He leans on the barrier and peers over, looking up and chewing slowly as Cal approaches, wearing a baggy striped polo shirt, blue jeans, and running trainers. Jacob checks his watch and shrugs, then throws Cal's trainers over the barrier, slaps him on the cheek, and marches off. Cal smiles with disbelief, then suddenly relents and takes out his wallet. Jacob looks down at the wallet dryly, then frowns incredulously at Cal. Cal tries on various shirts and ties with Jacob by racks of sunglasses, accumulating loads of shopping bags as his credit card is swiped in a store. In a beauty product store, Cal's credit card is swiped again.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Cal signals, and his companion downs the vino. The fellow, Bernie, observes him nervously, then glances downward and places a Macy's sack on the counter, causing Cal to scowl, puzzled. Bernie stands up, Cal shrugs and grins, and Bernie departs from the tavern. Jacob is at the booth with one lady, while Cal is sorrowful. Jacob is hearing as Cal looks over at him, and Jacob gestures him. Cal looks over his shoulder for someone else, but Jacob gestures him again. Cal regards Jacob pensively, lifts up his beverage and fragrance, and heads over to Jacob's booth just as the lady rises to depart. Cal nods and sits back down, lowering his glass and staring as Jacob takes a gulp of his beverage and nods at Cal. Cal studies him, and Jacob tilts his head. Cal nods, and Jacob raises his glass and drinks, prompting Cal to follow suit without using his straw. Jacob beckons to the lady, and Cal looks around. Jacob indicates at Cal, then stands up and departs with the attractive dark-haired lady, who smiles at Cal. Cal turns to watch them leave, then relaxes into his chair and sucks on his straw. Molly dashes in front of the TV and begins dancing as Cal and Robbie recline against the kitchen counter, with Robbie letting his head droop onto his hands. Jessica grins at Robbie, who squirms awkwardly and looks downward. In the shopping center, Cal ascends on an escalator and saunters through the mall. Hannah and Liz are at a bar with a group, and they all lift their glasses. The chap, who is dark-haired and a bit awkward looking, kisses Hannah on the lips, and Hannah smiles excitedly. Hannah looks over at him and grins as Liz departs. Hannah regards her beau, who is playing with his phone and sitting next to another guy doing the same thing. Hannah's grin fades, and her eyes dart as Jacob stands by a glass partition on the roof terrace of the mall. He bites into a piece of folded-up pizza, dressed smartly in a dark suit, brown shoes, and sunglasses. He leans on the partition and peers over, looking up and chewing slowly as Cal approaches, wearing a baggy striped polo shirt, blue jeans, and running sneakers. Jacob checks his watch and shrugs, then throws Cal's sneakers over the partition, slaps him on the cheek, and marches off. Cal grins with disbelief, then suddenly relents and pulls out his wallet. Jacob looks down at the wallet dryly, then scowls incredulously at Cal. Cal tries on various shirts and neckties with Jacob by racks of sunglasses, accumulating loads of shopping sacks as his credit card is swiped in a shop. In a beauty product shop, Cal's credit card is swiped again."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Waves are waved by Cal, and the wine is knocked back by his friend. Cal is eyed anxiously by the guy, Bernie, then Bernie looks down and places a Macy's bag on the bar, causing a frown, bewildered, to appear on Cal’s face. Cal is shrugged at and smiled at by Bernie, and the bar is left by Bernie. At the table, one woman accompanies Jacob, while woefulness accompanies Cal. Cal glances over at Jacob as Jacob listens, and Cal is beckoned by Jacob. For someone else, Cal looks over his shoulder, but Jacob beckons him again. Jacob is regarded thoughtfully by Cal, who picks up his drink and cologne and heads over to Jacob's table just as the woman gets up to leave. A nod is given by Cal, and he sits back down, lowering his glass and staring while a swig of his drink is taken by Jacob, who nods at Cal. Jacob is studied by Cal, and his head is cocked by Jacob. A nod is given by Cal, and his glass is raised by Jacob and drunk from, prompting Cal to follow suit without using his straw. To the woman, Jacob beckons, and around, Cal looks. At Cal, Jacob points, then he gets up and heads off with the pretty dark-haired woman, who smiles at Cal. To watch them leave, Cal turns, then his chair is relaxed into and his straw is sucked on. In front of the TV, Molly rushes and starts dancing as the kitchen counter is leaned against by Cal and Robbie, with Robbie letting his head flop onto his hands. At Robbie, a smile is given by Jessica, who finds him fidgeting awkwardly and looking down. In the mall, the escalator is ascended by Cal as he strolls through the mall. At a bar with a group, Hannah and Liz find themselves, and glasses are raised by all. On the lips, kisses are given to Hannah by the dark-haired, bit gawky-looking guy, and an excited smile is shown by Hannah. At him, Hannah looks and smiles as Liz heads off. Hannah regards her boyfriend, who plays with his phone and sits next to another guy doing the same thing. Her smile fades, and eyes are darted by Hannah as Jacob stands by a glass barrier on the roof terrace of the mall. Into a piece of folded-up pizza, a bite is taken by him, dressed smartly in a dark suit, brown shoes, and sunglasses. The barrier is leaned on by him, and over, he peers, looking up and chewing slowly as Cal approaches, wearing a baggy striped polo shirt, blue jeans, and running trainers. His watch is checked by Jacob, and a shrug is given, then Cal’s trainers are thrown over the barrier, his cheek is slapped, and Jacob marches off. With disbelief, a smile is given by Cal, then suddenly he relents and his wallet is taken out. At the wallet, Jacob looks dryly, then at Cal, he frowns incredulously. Various shirts and ties are tried on by Cal with Jacob by racks of sunglasses, loads of shopping bags are accumulated as a store swipes his credit card. In a beauty product store, another swipe is given to Cal's credit card."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Cal waves, and his friend drinks wine. Bernie, looking anxious, places a Macy's bag on the bar, confusing Cal. Bernie leaves, and Cal shrugs and smiles. Jacob sits with a woman while Cal is downcast. Jacob beckons Cal, who hesitates but eventually joins him as the woman leaves. They nod at each other, and Jacob drinks, prompting Cal to do the same without a straw. Jacob leaves with a smiling dark-haired woman, and Cal watches them go before relaxing. Molly dances in front of the TV as Cal and Robbie lean on the kitchen counter, with Robbie looking down awkwardly. At the mall, Cal rides an escalator. Hannah and Liz are at a bar with friends, and a gawky guy kisses Hannah, making her smile. Her smile fades as her boyfriend plays with his phone. Jacob, in a dark suit, eats pizza on the mall's roof terrace. Cal approaches in casual clothes. Jacob checks his watch, throws Cal's trainers over the barrier, slaps him, and leaves. Cal smiles in disbelief, then takes out his wallet. Jacob frowns at the wallet. Cal tries on shirts and ties with Jacob, accumulating shopping bags as his credit card is swiped in stores."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Cal waves as Bernie anxiously eyes him, places a Macy's bag on the bar, and leaves. Cal shrugs, smiles, and joins Jacob, who beckons him over. Cal sits as Jacob nods and drinks, prompting Cal to do the same. Jacob leaves with a woman, and Cal relaxes. Molly dances in front of the TV while Cal and Robbie lean on the kitchen counter. Jessica smiles at Robbie, who fidgets. At the mall, Cal rides the escalator. Hannah and Liz are at a bar; Hannah kisses a gawky guy and smiles. Her smile fades as Jacob, in a suit, eats pizza on the roof terrace. Cal approaches in casual attire. Jacob throws Cal's trainers over the barrier, slaps him, and leaves. Cal smiles, takes out his wallet, and shops with Jacob, trying on clothes and swiping his credit card in stores."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Cal gives a friendly wave, and his friend, without hesitation, knocks back the wine in one swift motion. The guy, whose name is Bernie, eyes Cal with a hint of anxiety, then shifts his gaze downward and places a Macy's shopping bag on the bar, which causes Cal to frown in a state of bewilderment. Bernie then rises from his seat, prompting Cal to shrug and offer a smile, as Bernie makes his way out of the bar. Meanwhile, Jacob is seated at a table with a woman, while Cal appears woeful and somewhat dejected. Jacob listens attentively as Cal glances over at him, and Jacob gestures for him to come over. Cal looks over his shoulder, seemingly searching for someone else, but Jacob beckons him once more. Cal regards Jacob thoughtfully, then picks up his drink and cologne, and heads over to Jacob's table just as the woman stands up to leave. Cal nods and sits back down, lowering his glass and staring intently as Jacob takes a swig of his drink and nods at Cal. Cal studies him closely, and Jacob cocks his head to the side. Cal nods in response, and Jacob raises his glass and drinks, prompting Cal to follow suit, this time without using his straw. Jacob beckons to the woman, and Cal looks around curiously. Jacob points at Cal, then gets up and heads off with the pretty dark-haired woman, who smiles warmly at Cal. Cal turns to watch them leave, then relaxes into his chair and sucks on his straw thoughtfully. Molly rushes in front of the TV and starts dancing energetically as Cal and Robbie lean against the kitchen counter, with Robbie letting his head flop onto his hands in a gesture of exasperation. Jessica smiles at Robbie, who fidgets awkwardly and looks down, seemingly embarrassed. In the bustling mall, Cal ascends on an escalator and strolls leisurely through the mall. Hannah and Liz are at a bar with a lively group, and they all raise their glasses in a toast. The guy, who is dark-haired and somewhat gawky looking, kisses Hannah on the lips, and Hannah smiles excitedly, clearly pleased. Hannah looks over at him and smiles as Liz heads off. Hannah regards her boyfriend, who is preoccupied with his phone and sitting next to another guy doing the same thing. Hannah's smile fades, and her eyes dart around as Jacob stands by a glass barrier on the roof terrace of the mall. He bites into a piece of folded-up pizza, dressed smartly in a dark suit, brown shoes, and sunglasses. He leans casually on the barrier and peers over, looking up and chewing slowly as Cal approaches, wearing a baggy striped polo shirt, blue jeans, and running trainers. Jacob checks his watch and shrugs nonchalantly, then unexpectedly throws Cal's trainers over the barrier, slaps him lightly on the cheek, and marches off. Cal smiles with disbelief, then suddenly relents and takes out his wallet. Jacob looks down at the wallet dryly, then frowns incredulously at Cal. Cal tries on various shirts and ties with Jacob by racks of sunglasses, accumulating loads of shopping bags as his credit card is swiped in a store. In a beauty product store, Cal's credit card is swiped once again."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Cal, with a friendly and welcoming wave of his hand, acknowledges his friend Bernie. Without any pause or hesitation, Bernie promptly drinks down the wine in one smooth and swift motion. The guy, who goes by the name of Bernie, casts a glance towards Cal, and there's a slight hint of anxiety in his eyes. He then diverts his gaze downward as he sets a Macy's shopping bag on the bar, which causes a frown of bewilderment to form on Cal's face. Rising from his seat, Bernie prompts a response from Cal, who simply shrugs and offers a smile, watching as Bernie makes his way out of the bar. Meanwhile, at a nearby table, Jacob is seated in the company of a woman, while Cal sits looking somewhat woeful and dejected. Jacob listens attentively, and when he notices Cal glancing over at him, he gestures for Cal to come over. Cal, appearing slightly uncertain, looks over his shoulder, perhaps searching for someone else, but Jacob beckons him with insistence. Cal regards Jacob with a thoughtful expression, then takes hold of his drink and cologne, and makes his way over to Jacob's table just as the woman stands up to leave. Cal nods politely before sitting back down, lowering his glass, and staring intently into it, as Jacob takes a swig of his drink and nods at Cal. Cal studies him closely, and Jacob cocks his head to the side in a curious gesture. Cal nods in response, and Jacob raises his glass, taking another drink, prompting Cal to do the same, this time choosing not to use his straw. Jacob calls out to the woman, and Cal looks around curiously. Jacob gestures towards Cal, then gets up and heads off with the attractive dark-haired woman, who offers Cal a warm smile. Cal turns to watch their departure, then relaxes into his chair and thoughtfully sucks on his straw. Meanwhile, Molly abruptly rushes in front of the TV and begins to dance energetically. Cal and Robbie, leaning against the kitchen counter, are clearly amused. Robbie lets his head flop down into his hands, a clear gesture of exasperation. Jessica, observing the scene, smiles at Robbie, who fidgets awkwardly, casting his eyes downward in a moment of embarrassment. In the bustling, vibrant mall, Cal ascends on an escalator and strolls leisurely through the lively mall atmosphere. Hannah and Liz, surrounded by a lively group at a bar, lift their glasses in a cheerful toast. A guy, dark-haired and possessing a somewhat gawky appearance, leans over and kisses Hannah on the lips, causing Hannah to smile with excitement and clear pleasure. She looks at him with a broad smile as Liz heads off. Hannah then turns her attention to her boyfriend, who is preoccupied and distracted by his phone, sitting next to another guy doing exactly the same thing. Her smile fades as her eyes begin to dart around the space. Jacob, meanwhile, is standing by a glass barrier on the rooftop terrace of the mall. He takes a bite of a piece of folded-up pizza, dressed sharply in a dark suit, brown shoes, and sunglasses, looking quite composed. He leans casually on the barrier, peering over, looking up, and chewing slowly as Cal approaches, wearing a baggy striped polo shirt, blue jeans, and running trainers. Jacob checks his watch, shrugging with a nonchalant air, then, quite unexpectedly, throws Cal's trainers over the barrier. He gives Cal a light slap on the cheek and then marches off. Cal smiles in disbelief at the unexpected turn of events, then suddenly relents, deciding to take out his wallet. Jacob, glancing down at the wallet with a dry expression, frowns incredulously at Cal. Together, they try on various shirts and ties, standing by racks of sunglasses, accumulating a growing collection of shopping bags as Cal's credit card is swiped in a store. In a beauty product store, the scene repeats as Cal's credit card is swiped once again."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Cal waves his hand in a friendly gesture, and his friend, Bernie, quickly drinks down the wine in his glass. Bernie, feeling a bit anxious, glances at Cal with a nervous expression before lowering his gaze to the bar. He places a Macy's bag on the bar counter, which causes Cal to frown in confusion, trying to understand the situation. Bernie then stands up from his seat, prompting Cal to give a nonchalant shrug and a smile, as Bernie makes his way out of the bar. Meanwhile, Jacob is seated at a table with a woman, and Cal, feeling a sense of melancholy, looks over at them. Jacob, noticing Cal's glance, gestures for him to come over. Cal, unsure if Jacob is signaling to someone else, looks over his shoulder to check, but Jacob repeats the gesture, confirming it's meant for him. Cal considers Jacob's invitation thoughtfully, then decides to pick up his drink and cologne, making his way over to Jacob's table just as the woman stands up to leave. Cal acknowledges her departure with a nod and sits down, placing his glass on the table and staring at Jacob. Jacob takes a sip of his drink and nods at Cal, who studies Jacob's expression. Jacob tilts his head slightly, prompting Cal to nod in response. Jacob raises his glass and drinks, encouraging Cal to do the same, this time without using his straw. Jacob then signals to the woman, and Cal glances around to see what's happening. Jacob points directly at Cal, then stands up and leaves with the attractive dark-haired woman, who gives Cal a smile as they depart. Cal turns his head to watch them leave, then settles back into his chair and begins to sip his drink through the straw. Later, Molly rushes in front of the TV and starts dancing energetically, while Cal and Robbie lean against the kitchen counter. Robbie lets his head drop onto his hands in a gesture of exasperation. Jessica, observing the scene, smiles at Robbie, who shifts uncomfortably and looks down, feeling awkward. In the mall, Cal steps onto an escalator and ascends, eventually strolling through the bustling shopping center. Meanwhile, Hannah and Liz are at a bar with a group of friends, and they all raise their glasses in a toast. A dark-haired, slightly awkward-looking guy leans in and kisses Hannah on the lips, causing her to smile with excitement. Hannah glances over at him with a smile as Liz walks away. She then turns her attention to her boyfriend, who is absorbed in his phone, sitting next to another guy who is similarly engaged. Hannah's smile fades, and her eyes shift around as she notices Jacob standing by a glass barrier on the mall's roof terrace. Jacob, dressed sharply in a dark suit, brown shoes, and sunglasses, bites into a piece of folded-up pizza. He leans casually on the barrier, peering over the edge and chewing slowly as Cal approaches, wearing a baggy striped polo shirt, blue jeans, and running trainers. Jacob checks the time on his watch, shrugs indifferently, and then, in a surprising move, throws Cal's trainers over the barrier. He gives Cal a light slap on the cheek and strides away. Cal, taken aback, smiles in disbelief at the unexpected turn of events, then suddenly gives in and pulls out his wallet. Jacob looks at the wallet with a dry expression, then frowns in disbelief at Cal's decision. Cal proceeds to try on various shirts and ties with Jacob by his side, standing near racks of sunglasses. As they accumulate a pile of shopping bags, Cal's credit card is swiped at the store's register. In a beauty product store, Cal's credit card is swiped once more, marking another purchase in their shopping spree."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Cal waves as his friend Bernie finishes his wine, places a Macy's bag on the bar, and leaves, leaving Cal puzzled. Meanwhile, Jacob is at a table with a woman, and after some back-and-forth gestures, Cal joins him just as the woman departs. They share a drink, and Jacob signals to another woman, who smiles at Cal before leaving with Jacob. Cal watches them go, then relaxes with his drink. Later, Molly dances in front of the TV while Cal and Robbie lean against the kitchen counter, with Robbie appearing awkward as Jessica smiles at him. At the mall, Cal rides the escalator and walks through the mall. At a bar, Hannah is kissed by her boyfriend, and she smiles before noticing him distracted by his phone. On the mall's roof terrace, Jacob, dressed sharply, eats pizza as Cal approaches in casual attire. Jacob checks his watch, throws Cal's trainers over the barrier, and leaves after a playful slap on Cal's cheek. Cal, amused, takes out his wallet, and they proceed to shop together, trying on clothes and accumulating shopping bags as Cal's credit card is swiped multiple times."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Cal waves, and his friend knocks back the wine in one swift motion, a habit developed during their frequent evenings at the local tavern known for its extensive wine selection. The guy, Bernie, who often shopped for his wife at this department store, eyes him anxiously, then looks down and puts a Macy's bag, filled with clothing for a gift, on the bar, causing Cal to frown, bewildered by Bernie's sudden change in demeanor. Bernie gets up, Cal shrugs and smiles, and Bernie heads out of the bar on his way to catch the last bus home. Jacob is at the table with one woman, while Cal is woeful, missing his family life. Jacob is listening as Cal glances over at him, and Jacob beckons him with a gesture they've had since college. Cal looks over his shoulder for someone else, but Jacob beckons him again, more insistently. Cal regards Jacob thoughtfully, picks up his drink and cologne, a gift from a recent birthday, and heads over to Jacob's table just as the woman gets up to leave, signaling her friends from across the room. Cal nods and sits back down, lowering his glass and staring as Jacob takes a swig of his drink, a favorite craft beer from the local brewery, and nods at Cal. Cal studies him, and Jacob cocks his head, a silent question in his eyes. Cal nods, and Jacob raises his glass and drinks, prompting Cal to follow suit without using his straw, following an unspoken rule of their drinking game. Jacob beckons to the woman, and Cal looks around to see if she's returning. Jacob points at Cal, then gets up and heads off with the pretty dark-haired woman, who smiles at Cal, leaving a faint trace of her floral perfume in the air. Cal turns to watch them leave, then relaxes into his chair and sucks on his straw contemplatively. Molly, Cal's energetic young daughter, rushes in front of the TV and starts dancing as Cal and Robbie lean against the kitchen counter, with Robbie letting his head flop onto his hands in a familiar gesture of exhaustion after a long day at work. Jessica, Cal's supportive neighbor, smiles at Robbie, who fidgets awkwardly and looks down, his shyness evident in social gatherings. In the mall, Cal ascends an escalator and strolls through the bustling mall, reflecting on his changing life. Hannah and Liz are at a bar with a group, and they all raise their glasses in a toast to friendship. The guy, who is dark-haired and a bit gawky looking, known as Hannah's college sweetheart, kisses Hannah on the lips, and Hannah smiles excitedly. Hannah looks over at him and smiles as Liz heads off to meet another friend. Hannah regards her boyfriend, who is playing with his phone, engrossed in a popular game, and sitting next to another guy doing the same thing. Hannah's smile fades, and her eyes dart as Jacob stands by a glass barrier on the roof terrace of the mall, an architectural feature allowing patrons to enjoy the city view. He bites into a piece of folded-up pizza, a quick snack from the food court, dressed smartly in a dark suit, brown shoes, and sunglasses, exuding his characteristic suave demeanor. He leans on the barrier and peers over, looking up and chewing slowly as Cal approaches, wearing a baggy striped polo shirt, blue jeans, and running trainers, contrasting Jacob's polished appearance. Jacob checks his watch and shrugs, an indication of his impatience, then throws Cal's trainers over the barrier in a spontaneous act, slaps him on the cheek, and marches off, leaving Cal to ponder his friend’s impulsive behavior. Cal smiles with disbelief, then suddenly relents and takes out his wallet, remembering his past mistakes. Jacob looks down at the wallet dryly, then frowns incredulously at Cal, questioning his spending habits. Cal tries on various shirts and ties with Jacob by racks of sunglasses, a shopping spree intended to update his wardrobe as his credit card is swiped in a store offering seasonal discounts. In a beauty product store, Cal's credit card is swiped again, a gesture of self-care newfound in his journey of personal reinvention."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Cal waves and his friend knocks back the wine. The guy Bernie eyes him anxiously then looks down and puts a Macy's bag on the bar causing Cal to frown bewildered. Bernie gets up. Cal shrugs and smiles and Bernie heads out of the bar. Jacob is at the table with one woman while Cal is woeful. Jacob is listening as Cal glances over at him and Jacob beckons him. Cal looks over his shoulder for someone else but Jacob beckons him again. Cal regards Jacob thoughtfully picks up his drink and cologne and heads over to Jacob's table just as the woman gets up to leave. Cal nods and sits back down lowering his glass and staring as Jacob takes a swig of his drink and nods at Cal. Cal studies him and Jacob cocks his head. Cal nods and Jacob raises his glass and drinks prompting Cal to follow suit without using his straw. Jacob beckons to the woman and Cal looks around. Jacob points at Cal then gets up and heads off with the pretty darkhaired woman who smiles at Cal. Cal turns to watch them leave then relaxes into his chair and sucks on his straw. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Molly rushes in front of the TV and starts dancing as Cal and Robbie lean against the kitchen counter with Robbie letting his head flop onto his hands. Jessica smiles at Robbie who fidgets awkwardly and looks down. In the mall Cal ascends on an escalator and strolls through the mall. Hannah and Liz are at a bar with a group and they all raise their glasses. The guy who is darkhaired and a bit gawky looking kisses Hannah on the lips and Hannah smiles excitedly. Hannah looks over at him and smiles as Liz heads off. Hannah regards her boyfriend who is playing with his phone and sitting next to another guy doing the same thing. Hannah's smile fades and her eyes dart as Jacob stands by a glass barrier on the roof terrace of the mall. He bites into a piece of foldedup pizza dressed smartly in a dark suit brown shoes and sunglasses. He leans on the barrier and peers over looking up and chewing slowly as Cal approaches wearing a baggy striped polo shirt blue jeans and running trainers. Jacob checks his watch and shrugs then throws Cal's trainers over the barrier slaps him on the cheek and marches off. Cal smiles with disbelief then suddenly relents and takes out his wallet. Jacob looks down at the wallet dryly then frowns incredulously at Cal. Cal tries on various shirts and ties with Jacob by racks of sunglasses accumulating loads of shopping bags as his credit card is swiped in a store. In a beauty product store Cal's credit card is swiped again."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Cal waves and his friend knocks back the wine. The guy Bernie eyes him anxiously then looks down and puts a Macy's bag on the bar causing Cal to frown bewildered. Bernie gets up. Cal shrugs and smiles and Bernie heads out of the bar. Jacob is at the table with one woman while Cal is woeful. Jacob is listening as Cal glances over at him and Jacob beckons him. Cal looks over his shoulder for someone else but Jacob beckons him again. Cal regards Jacob thoughtfully picks up his drink and cologne and heads over to Jacob's table just as the woman gets up to leave. Cal nods and sits back down lowering his glass and staring as Jacob takes a swig of his drink and nods at Cal. Cal studies him and Jacob cocks his head. Cal nods and Jacob raises his glass and drinks prompting Cal to follow suit without using his straw. Jacob beckons to the woman and Cal looks around. Jacob points at Cal then gets up and heads off with the pretty darkhaired woman who smiles at Cal. Cal turns to watch them leave then relaxes into his chair and sucks on his straw. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Molly rushes in front of the TV and starts dancing as Cal and Robbie lean against the kitchen counter with Robbie letting his head flop onto his hands. Jessica smiles at Robbie who fidgets awkwardly and looks down. In the mall Cal ascends on an escalator and strolls through the mall. Hannah and Liz are at a bar with a group and they all raise their glasses. The guy who is darkhaired and a bit gawky looking kisses Hannah on the lips and Hannah smiles excitedly. Hannah looks over at him and smiles as Liz heads off. Hannah regards her boyfriend who is playing with his phone and sitting next to another guy doing the same thing. Hannah's smile fades and her eyes dart as Jacob stands by a glass barrier on the roof terrace of the mall. He bites into a piece of foldedup pizza dressed smartly in a dark suit brown shoes and sunglasses. He leans on the barrier and peers over looking up and chewing slowly as Cal approaches wearing a baggy striped polo shirt blue jeans and running trainers. Jacob checks his watch and shrugs then throws Cal's trainers over the barrier slaps him on the cheek and marches off. Cal smiles with disbelief then suddenly relents and takes out his wallet. Jacob looks down at the wallet dryly then frowns incredulously at Cal. Cal tries on various shirts and ties with Jacob by racks of sunglasses accumulating loads of shopping bags as his credit card is swiped in a store. In a beauty product store Cal's credit card is swiped again."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Cal waves and his friend knocks back the wine. The guy Bernie eyes him anxiously then looks down and puts a Macy's bag on the bar causing Cal to frown bewildered. Bernie gets up. Cal shrugs and smiles and Bernie heads out of the bar. Jacob is at the table with one woman while Cal is woeful. Jacob is listening as Cal glances over at him and Jacob beckons him. Cal looks over his shoulder for someone else but Jacob beckons him again. Hannah's smile fades and her eyes dart as Jacob stands by a glass barrier on the roof terrace of the mall. He bites into a piece of foldedup pizza dressed smartly in a dark suit brown shoes and sunglasses. He leans on the barrier and peers over looking up and chewing slowly as Cal approaches wearing a baggy striped polo shirt blue jeans and running trainers. Jacob checks his watch and shrugs then throws Cal's trainers over the barrier slaps him on the cheek and marches off. Cal smiles with disbelief then suddenly relents and takes out his wallet. Jacob looks down at the wallet dryly then frowns incredulously at Cal. Cal tries on various shirts and ties with Jacob by racks of sunglasses accumulating loads of shopping bags as his credit card is swiped in a store. In a beauty product store Cal's credit card is swiped again."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Cal waves and his friend knocks back the wine. The guy Bernie eyes him anxiously then looks down and puts a Macy's bag on the bar causing Cal to frown bewildered. Bernie gets up. Jacob looks down at the wallet dryly then frowns incredulously at Cal. Cal tries on various shirts and ties with Jacob by racks of sunglasses accumulating loads of shopping bags as his credit card is swiped in a store. In a beauty product store Cal's credit card is swiped again."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Tim whistles, and his cousin chugs the soda. The cat, Max, scrutinizes him nervously, then glances up and places a Walmart box on the chair, prompting Tim to grin, confused. Max stands up, Tim shrugs and chuckles, and Max wanders out of the café. Oliver is at the booth with one penguin, while Tim is joyful. Oliver is humming as Tim peers over at him, and Oliver waves him over. Tim glances around the room for anybody else, but Oliver waves him over again. Tim considers Oliver intently, grabs his sandwich and perfume, and strolls over to Oliver's booth just as the penguin stands up to depart. Tim nods and settles down, setting his plate and staring as Oliver sips his milkshake and winks at Tim. Tim observes him, and Oliver tilts his chin. Tim nods, and Oliver lifts his mug and sips, encouraging Tim to mimic without using his fork. Oliver gestures to the penguin, and Tim scans the area. Oliver gestures at Tim, then stands up and strolls away with the lovely red-haired penguin, who waves at Tim. Tim spins to see them depart, then sinks into his recliner and munches on his fork. Lucy dashes in front of the lamp and starts singing as Tim and Eddie lean against the bathroom sink, with Eddie letting his hat drop onto his knees. Samantha giggles at Eddie, who squirms uneasily and stares upward. In the zoo, Tim descends on an elevator and skips through the zoo. Amelia and Joan are on a rooftop with a squad, and they all clink their mugs. The octopus, who is red-haired and a little clumsy looking, hugs Amelia on the cheek, and Amelia giggles brightly. Amelia glances at him and giggles as Joan wanders away. Amelia watches her donkey, who is doodling with his book and sitting next to another octopus doing the same thing. Amelia's giggle fades, and her nose twitches as Oliver stands next to a wooden podium on the garden patio of the zoo. He sips on a piece of crumpled-up taco, dressed casually in a light dress, pink sandals, and a hat. He leans on the podium and squints over, glancing down and chewing quickly as Tim approaches, wearing a tight plaid suit, red shorts, and hiking boots. Oliver checks his phone and grins, then tosses Tim's boots over the podium, pats him on the elbow, and skips away. Tim chuckles with awe, then suddenly concedes and pulls out his phone. Oliver stares down at the phone skeptically, then grins smugly at Tim. Tim tries on various pants and scarves with Oliver by shelves of hats, gathering heaps of gift boxes as his debit card is scanned in a market. In a gadget store, Tim's debit card is scanned again."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Cal waves at his friend Bernie, who looks anxious and leaves a Macy's bag on the bar, confusing Cal. Jacob is at a table with a woman, and Cal, feeling woeful, joins him after some hesitation. They have a drink together, and Jacob eventually leaves with the woman, leaving Cal alone. Molly dances in front of the TV while Cal and Robbie lean against the kitchen counter. At the mall, Cal rides an escalator. Meanwhile, Hannah enjoys herself at a bar with friends, but her smile fades as she observes her inattentive boyfriend. On a rooftop terrace, Jacob, dressed smartly, eats pizza as Cal, casually dressed, joins him. Jacob playfully throws Cal's trainers over the barrier and walks off, prompting Cal to laugh and take out his wallet. Cal then shops with Jacob, trying on various clothes and accumulating shopping bags as his credit card is swiped multiple times."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "In a beauty product store Cal's credit card is swiped again Cal tries on various shirts and ties with Jacob by racks of sunglasses accumulating loads of shopping bags as his credit card is swiped in a store  Jacob looks down at the wallet dryly then frowns incredulously at Cal  Cal smiles with disbelief then suddenly relents and takes out his wallet  Jacob checks his watch and shrugs then throws Cal's trainers over the barrier slaps him on the cheek and marches off  He leans on the barrier and peers over looking up and chewing slowly as Cal approaches wearing a baggy striped polo shirt blue jeans and running trainers  He bites into a piece of foldedup pizza dressed smartly in a dark suit brown shoes and sunglasses  Hannah's smile fades and her eyes dart as Jacob stands by a glass barrier on the roof terrace of the mall  Hannah regards her boyfriend who is playing with his phone and sitting next to another guy doing the same thing  Hannah looks over at him and smiles as Liz heads off  The guy who is darkhaired and a bit gawky looking kisses Hannah on the lips and Hannah smiles excitedly  Hannah and Liz are at a bar with a group and they all raise their glasses  In the mall Cal ascends on an escalator and strolls through the mall  Jessica smiles at Robbie who fidgets awkwardly and looks down  Molly rushes in front of the TV and starts dancing as Cal and Robbie lean against the kitchen counter with Robbie letting his head flop onto his hands  Cal turns to watch them leave then relaxes into his chair and sucks on his straw  Jacob points at Cal then gets up and heads off with the pretty darkhaired woman who smiles at Cal  Jacob beckons to the woman and Cal looks around  Cal nods and Jacob raises his glass and drinks prompting Cal to follow suit without using his straw  Cal studies him and Jacob cocks his head  Cal nods and sits back down lowering his glass and staring as Jacob takes a swig of his drink and nods at Cal  Cal regards Jacob thoughtfully picks up his drink and cologne and heads over to Jacob's table just as the woman gets up to leave  Cal looks over his shoulder for someone else but Jacob beckons him again  Jacob is listening as Cal glances over at him and Jacob beckons him  Jacob is at the table with one woman while Cal is woeful  Cal shrugs and smiles and Bernie heads out of the bar  Bernie gets up  The guy Bernie eyes him anxiously then looks down and puts a Macy's bag on the bar causing Cal to frown bewildered  Cal waves and his friend knocks back the wine "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The guy Bernie eyes him anxiously then looks down and puts a Macy's bag on the bar causing Cal to frown bewildered Cal waves and his friend knocks back the wine Cal shrugs and smiles and Bernie heads out of the bar Bernie gets up Jacob is listening as Cal glances over at him and Jacob beckons him Jacob is at the table with one woman while Cal is woeful Cal regards Jacob thoughtfully picks up his drink and cologne and heads over to Jacob's table just as the woman gets up to leave Cal looks over his shoulder for someone else but Jacob beckons him again Cal studies him and Jacob cocks his head Cal nods and sits back down lowering his glass and staring as Jacob takes a swig of his drink and nods at Cal Jacob beckons to the woman and Cal looks around Cal nods and Jacob raises his glass and drinks prompting Cal to follow suit without using his straw Cal turns to watch them leave then relaxes into his chair and sucks on his straw Jacob points at Cal then gets up and heads off with the pretty darkhaired woman who smiles at Cal Jessica smiles at Robbie who fidgets awkwardly and looks down Molly rushes in front of the TV and starts dancing as Cal and Robbie lean against the kitchen counter with Robbie letting his head flop onto his hands Hannah and Liz are at a bar with a group and they all raise their glasses In the mall Cal ascends on an escalator and strolls through the mall Hannah looks over at him and smiles as Liz heads off The guy who is darkhaired and a bit gawky looking kisses Hannah on the lips and Hannah smiles excitedly Hannah's smile fades and her eyes dart as Jacob stands by a glass barrier on the roof terrace of the mall Hannah regards her boyfriend who is playing with his phone and sitting next to another guy doing the same thing He leans on the barrier and peers over looking up and chewing slowly as Cal approaches wearing a baggy striped polo shirt blue jeans and running trainers He bites into a piece of foldedup pizza dressed smartly in a dark suit brown shoes and sunglasses Cal smiles with disbelief then suddenly relents and takes out his wallet Jacob checks his watch and shrugs then throws Cal's trainers over the barrier slaps him on the cheek and marches off Cal tries on various shirts and ties with Jacob by racks of sunglasses accumulating loads of shopping bags as his credit card is swiped in a store Jacob looks down at the wallet dryly then frowns incredulously at Cal In a beauty product store Cal's credit card is swiped again"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Jessica smiles at Robbie who fidgets awkwardly and looks down  In the mall Cal ascends on an escalator and strolls through the mall  Hannah and Liz are at a bar with a group and they all raise their glasses  The guy who is darkhaired and a bit gawky looking kisses Hannah on the lips and Hannah smiles excitedly  Hannah looks over at him and smiles as Liz heads off  Hannah regards her boyfriend who is playing with his phone and sitting next to another guy doing the same thing  Hannah's smile fades and her eyes dart as Jacob stands by a glass barrier on the roof terrace of the mall  He bites into a piece of foldedup pizza dressed smartly in a dark suit brown shoes and sunglasses  He leans on the barrier and peers over looking up and chewing slowly as Cal approaches wearing a baggy striped polo shirt blue jeans and running trainers  Jacob checks his watch and shrugs then throws Cal's trainers over the barrier slaps him on the cheek and marches off  Cal smiles with disbelief then suddenly relents and takes out his wallet  Jacob looks down at the wallet dryly then frowns incredulously at Cal  Cal tries on various shirts and ties with Jacob by racks of sunglasses accumulating loads of shopping bags as his credit card is swiped in a store  In a beauty product store Cal's credit card is swiped again Cal waves and his friend knocks back the wine  The guy Bernie eyes him anxiously then looks down and puts a Macy's bag on the bar causing Cal to frown bewildered  Bernie gets up  Cal shrugs and smiles and Bernie heads out of the bar  Jacob is at the table with one woman while Cal is woeful  Jacob is listening as Cal glances over at him and Jacob beckons him  Cal looks over his shoulder for someone else but Jacob beckons him again  Cal regards Jacob thoughtfully picks up his drink and cologne and heads over to Jacob's table just as the woman gets up to leave  Cal nods and sits back down lowering his glass and staring as Jacob takes a swig of his drink and nods at Cal  Cal studies him and Jacob cocks his head  Cal nods and Jacob raises his glass and drinks prompting Cal to follow suit without using his straw  Jacob beckons to the woman and Cal looks around  Jacob points at Cal then gets up and heads off with the pretty darkhaired woman who smiles at Cal  Cal turns to watch them leave then relaxes into his chair and sucks on his straw  Molly rushes in front of the TV and starts dancing as Cal and Robbie lean against the kitchen counter with Robbie letting his head flop onto his hands "
        }
      ]
    }
  ]
}