{
  "ground_truth": "The gentle golden glow of a street light shimmers on the rain-slick road as people with umbrellas hurry into a restaurant where Hannah, her boyfriend, other colleagues, and Liz sit around a table. Whilst her colleagues laugh, Liz signals to a waiter while Hannah looks disappointed. Liz gapes over at the couple with wide eyes and an anxious expression as Hannah eyes her boyfriend searchingly and steps in close to him. He raises a hand, and she grabs a guy's drink and gulps it before heading off, marching out and high-fiving Liz on the way. Hannah strides through the rain to a bar where Jacob is flirting with a blonde 20-something woman. Frowning, Jacob turns and smiles at Hannah curiously. Rain-drenched, she storms over to him, grabs his face in her hands, and kisses him hard. Slowly, Jacob reaches around her waist, pulls her to him, and lifts her gently off the ground, still locked in a passionate embrace. After some time, Hannah pulls away, looks him straight in the eye, and Jacob smiles happily. Hannah nods curtly and kisses him again before Jacob puts her back down, and she drags him out of the bar while the woman he was flirting with earlier stares at them incredulously as they leave. Hannah stands in the living room of Jacob's apartment, watching the rain through the tall glass windows, as Jacob pours liquor onto a sugar lump in a glass, crushes the lump with a pestle, pours in more liquor, and adds some ice cubes, grating some orange peel into the drink. A stylus lowers onto a record, and Jacob goes into the living room carrying two drinks to where Hannah stands in her knee-length black dress, fidgeting nervously. He hands her the glass, and she glugs down her drink at top speed, cringes, shakes her head, and grabs the other drink off Jacob, starting to gulp that down. She gags and hands back both empty glasses, as Jacob heads over to a coffee table to put them down. Hannah does a nervous twirl while Jacob takes off his jacket and sits down, squeezing his hands into fists. He points to himself, nods, and smiles before taking off his top to reveal a tanned, muscular torso with a six pack. Hannah scrutinizes him as he looks down at himself, and she touches and gawks at him. He smiles smugly, and she limbers up, runs at him, and he lifts her up. Her legs flop before she lifts them up, and slowly he spins around, then stops. She lowers her legs, and he lets her fall into his arms so she's pressed up against his body, sliding gently down until her feet touch the floor as he presses his forehead against hers.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The mild aureate light of a street lamp glimmers on the rain-wet thoroughfare as individuals with parasols rush into a bistro where Hannah, her beau, other associates, and Liz sit around a table. While her associates chuckle, Liz gestures to a server while Hannah appears crestfallen. Liz stares over at the pair with wide eyes and a worried countenance as Hannah gazes at her beau intensely and steps in near him. He raises a hand, and she snatches a fellow's beverage and swallows it before heading out, marching out and high-fiving Liz on the way. Hannah strides through the rain to a tavern where Jacob is flirting with a blonde twenty-something woman. Scowling, Jacob turns and grins at Hannah inquisitively. Rain-soaked, she storms over to him, grasps his visage in her hands, and kisses him firmly. Gradually, Jacob encircles her waist, pulls her to him, and lifts her softly off the ground, still locked in an ardent embrace. After some time, Hannah pulls away, looks him directly in the eye, and Jacob grins joyfully. Hannah nods tersely and kisses him once more before Jacob places her back down, and she drags him out of the tavern while the woman he was flirting with earlier gawks at them incredulously as they depart. Hannah stands in the living area of Jacob's flat, observing the rain through the tall glass panes, as Jacob pours spirits onto a sugar cube in a glass, crushes the cube with a pestle, pours in more spirits, and adds some ice cubes, grating some orange zest into the concoction. A stylus descends onto a record, and Jacob goes into the living area carrying two libations to where Hannah stands in her knee-length ebony dress, fidgeting anxiously. He hands her the glass, and she swigs down her libation at full speed, cringes, shakes her head, and grabs the other libation off Jacob, starting to gulp that down. She retches and hands back both empty glasses, as Jacob heads over to a coffee table to place them down. Hannah does a nervous pirouette while Jacob removes his jacket and sits down, clenching his hands into fists. He points to himself, nods, and grins before removing his top to reveal a bronzed, muscular torso with a six-pack. Hannah examines him as he looks down at himself, and she touches and gawks at him. He grins smugly, and she limbers up, runs at him, and he lifts her up. Her legs droop before she raises them up, and gradually he spins around, then halts. She lowers her legs, and he lets her fall into his arms so she's pressed up against his form, sliding softly down until her feet touch the floor as he presses his brow against hers."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The gentle golden glow of a street light is shimmered on the rain-slick road by it as a restaurant is hurried into by people with umbrellas where Hannah, her boyfriend, other colleagues, and Liz sit around a table. Whilst her colleagues laugh, a waiter is signaled to by Liz while disappointment is shown by Hannah. Liz gapes over at the couple with wide eyes and an anxious expression as her boyfriend is eyed searchingly by Hannah and is stepped in close to by her. A hand is raised by him, and a guy's drink is grabbed and gulped by her before she heads off, marching out and high-fiving Liz on the way. The rain is strode through by Hannah to a bar where a blonde 20-something woman is flirted with by Jacob. Frowning, he turns and smiles at Hannah curiously. Over to him, she storms, grabs his face in her hands, and kisses him hard. Slowly, her waist is reached around by Jacob, she is pulled to him by him, and she is lifted gently off the ground, still locked in a passionate embrace. After some time, away is pulled by Hannah, he is looked straight in the eye by her, and a happy smile is given by Jacob. A curt nod is given by Hannah, and she kisses him again before she is put back down by Jacob, and he is dragged out of the bar by her while they are stared at incredulously by the woman who was flirted with by him earlier as they leave. In the living room of Jacob's apartment, Hannah stands, watching the rain through the tall glass windows while liquor is poured onto a sugar lump in a glass and crushed with a pestle by Jacob, more liquor is poured in by him, some ice cubes are added, and orange peel is grated into the drink. A stylus is lowered onto a record, and into the living room goes Jacob, carrying two drinks to where Hannah stands in her knee-length black dress, fidgeting nervously. To her, he hands the glass, and at top speed, her drink is glugged down by her, a cringe is made, her head is shaken, and off Jacob, the other drink is grabbed by her, starting to gulp that down. She gags and hands back both empty glasses as over to a coffee table, Jacob heads to put them down. A nervous twirl is done by Hannah while his jacket is taken off and he sits down, squeezing his hands into fists. To himself, he points, nods, and smiles before his top is taken off to reveal a tanned, muscular torso with a six-pack. He is scrutinized by Hannah as he looks down at himself, and he is touched and gawked at by her. Smugly, he smiles, and at him, she limbers up, runs, and up she is lifted by him. Her legs flop before up they are lifted by her, and around is slowly spun by him, then he stops. Her legs are lowered by her, and into his arms, she is let fall by him so that against his body, she is pressed up, sliding gently down until the floor is touched by her feet as his forehead is pressed against hers by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The golden streetlight gleams on the rain-soaked road as people with umbrellas rush into a restaurant where Hannah, her boyfriend, colleagues, and Liz sit at a table. While her colleagues laugh, Liz signals a waiter as Hannah looks disappointed. Liz watches the couple, eyes wide and anxious, as Hannah approaches her boyfriend. He raises a hand, and she grabs a drink, gulps it, and leaves, high-fiving Liz. Hannah strides through the rain to a bar where Jacob flirts with a blonde woman. Frowning, Jacob smiles at Hannah, who, drenched, kisses him hard. Jacob embraces and lifts her off the ground. After a moment, Hannah pulls away, and Jacob smiles happily. She nods and kisses him again before dragging him out, as the woman stares incredulously. In Jacob's apartment, Hannah watches the rain while Jacob makes drinks. He hands her a glass, and she quickly finishes both. Hannah twirls nervously as Jacob removes his jacket and top, revealing his muscular torso. Hannah gawks and touches him. He smiles smugly, and she runs at him. He lifts her, spins slowly, and she slides down until her feet touch the floor as he presses his forehead against hers."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The golden glow of a streetlight shimmers on a rain-slick road as people hurry into a restaurant where Hannah, her boyfriend, colleagues, and Liz sit. Liz signals a waiter while Hannah looks disappointed. Liz anxiously eyes the couple as Hannah approaches her boyfriend. Hannah grabs and gulps a drink, high-fives Liz, and marches out to a bar where Jacob flirts with a blonde woman. Hannah storms in, kisses Jacob passionately, and he lifts her in a warm embrace. She nods curtly, kisses him again, and they leave, with the blonde watching in disbelief. Later, at Jacob's apartment, Hannah watches rain through the windows while Jacob mixes drinks. He hands her a drink, which she gulps down before grabbing and finishing another. She nervously twirls as Jacob removes his jacket and shirt, revealing his muscular torso. Hannah gawks, touches him, then runs at him. Jacob lifts her, spins her around, and she slides gently against him until her feet touch the floor."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The gentle, golden glow emanating from a solitary streetlight softly shimmers on the rain-slick road, creating a glistening pathway as people clutching umbrellas hurriedly rush into the cozy, bustling restaurant. Inside this warm haven, Hannah is seated with her boyfriend, alongside other colleagues and Liz, gathered around a table. Amidst the lively chatter and laughter of her colleagues, Liz discreetly signals to a waiter, while Hannah watches on with a noticeably disappointed expression. Liz looks over at the couple with wide, concerned eyes and an anxious demeanor, as Hannah scrutinizes her boyfriend intently before stepping in closer to him. He casually raises a hand in a gesture, and in response, she boldly grabs another guy's drink, quickly gulping it down before decisively marching out of the restaurant. As she exits, she high-fives Liz in passing.\n\nDeterminedly, Hannah strides through the relentless rain, making her way to a lively bar, where she finds Jacob engaged in flirtatious conversation with a blonde woman in her twenties. Jacob frowns momentarily but then turns to smile at Hannah with evident curiosity. Drenched from the rain, she storms over to him, grasping his face firmly within her hands before kissing him passionately. Slowly, Jacob responds by wrapping his arms around her waist, drawing her closer, and lifting her gently off the ground as they remain locked in this fervent embrace. After indulging in the moment for some time, Hannah finally pulls back, looking him directly in the eyes, and Jacob beams at her with a joyful smile. Hannah then nods curtly, kisses him once more, and as he sets her back down, she takes his hand to lead him out of the bar, leaving the blonde woman staring at them in disbelief as they head out together.\n\nLater, Hannah finds herself standing in the living room of Jacob's apartment, gazing out through the tall glass windows at the rain pouring down outside. Meanwhile, Jacob is busy in the kitchen, carefully preparing drinks. He pours a generous amount of liquor over a sugar lump in a glass, skillfully crushing the lump with a pestle before adding more liquor, dropping in a few ice cubes, and grating some fresh orange peel into the concoction. A stylus gently lowers onto a spinning record, filling the room with music, as Jacob enters the living room, carrying two freshly mixed drinks towards where Hannah stands in her elegant, knee-length black dress, visibly fidgeting with nervous anticipation. He offers her one of the glasses, and she swiftly downs her drink, cringing slightly as she does so. With a swift motion, she grabs the other drink from Jacob, beginning to gulp it down as well. The strong taste causes her to gag momentarily, and she returns both empty glasses to Jacob, who heads over to the coffee table to set them down.\n\nHannah, feeling antsy, does a quick twirl, while Jacob takes off his jacket and sits down, clenching his hands into fists as if to signal his determination. He points to himself, nods with a smile, and then removes his top, revealing a well-defined, tanned muscular torso and a chiseled six-pack. Hannah closely examines him as he looks down at his physique; she can't help but touch and gawk at him. Jacob grins smugly, clearly pleased with himself, and as Hannah limbers up, she runs toward him with enthusiasm. He catches her effortlessly, lifting her off the ground as her legs dangle in the air for a moment before she lifts them up. Slowly, he spins around, reveling in the moment, and then comes to a stop. She lowers her legs, and he allows her to gently fall into his arms so that she is pressed closely against his body, sliding down until her feet touch the floor. Their foreheads press together in an intimate gesture as they savor the closeness."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The gentle, golden illumination emanating from a solitary, well-positioned streetlight softly shimmers on the rain-slick road, creating a glistening pathway. This luminous path guides people who are clutching umbrellas, protecting themselves from the rain, as they hurriedly rush into the cozy, bustling restaurant. Inside this warm haven, Hannah is comfortably seated with her boyfriend, surrounded by other colleagues and Liz, all gathered around a large table. Amidst the lively chatter and infectious laughter of her cheerful colleagues, Liz discreetly signals to a nearby waiter, while Hannah watches on with a noticeably disappointed expression on her face. Liz looks over at the couple with wide, concerned eyes and an anxious demeanor, as Hannah scrutinizes her boyfriend intently before stepping in closer to him. He casually raises a hand in a gesture, and in response, she boldly grabs another guy's drink, quickly gulping it down before decisively marching out of the restaurant. As she makes her dramatic exit, she high-fives Liz in passing.\n\nDeterminedly, Hannah strides through the relentless downpour of rain, making her way to a lively bar. There, she finds Jacob already engaged in flirtatious conversation with a blonde woman, who appears to be in her twenties. Jacob frowns momentarily but quickly shifts to a smile directed at Hannah, filled with evident curiosity. Drenched from the rain, she storms over to him, firmly grasping his face within her hands before kissing him passionately. Slowly, Jacob responds by wrapping his arms around her waist, drawing her even closer, and gently lifting her off the ground as they remain locked in this fervent embrace. After indulging in the moment for some time, Hannah finally pulls back, looking him directly in the eyes, and Jacob beams at her with a joyful smile. Hannah then nods curtly, kisses him once more, and as he sets her back down, she takes his hand to lead him out of the bar, leaving the blonde woman staring at them in disbelief as they head out together.\n\nLater in the evening, Hannah finds herself standing in the living room of Jacob's apartment, gazing thoughtfully out through the tall, expansive glass windows at the rain pouring down outside. Meanwhile, in the kitchen, Jacob is busy preparing drinks with careful attention. He pours a generous amount of liquor over a sugar lump in a waiting glass, skillfully crushing the lump with a pestle before adding more liquor. He then drops in a few ice cubes and grates some fresh orange peel into the concoction. A stylus gently lowers onto a spinning record, filling the room with soothing music, as Jacob enters the living room. He carries two freshly mixed drinks towards where Hannah stands in her elegant, knee-length black dress, visibly fidgeting with nervous anticipation. He offers her one of the glasses, and she swiftly downs her drink, cringing slightly as she does so. With a swift and decisive motion, she grabs the other drink from Jacob, beginning to gulp it down as well. The strong taste causes her to gag momentarily, and she returns both empty glasses to Jacob, who heads over to the coffee table to set them down.\n\nFeeling antsy, Hannah does a quick twirl, exhibiting her restlessness, while Jacob takes off his jacket and sits down, clenching his hands into fists as if to signal his determination. He points to himself, nods with a confident smile, and then removes his top, revealing a well-defined, tanned muscular torso and a chiseled six-pack. Hannah closely examines him as he looks down at his own physique; she can't help but reach out to touch and gawk at him with awe. Jacob grins smugly, clearly pleased with himself and his appearance, and as Hannah limbers up, she runs toward him with enthusiastic energy. He catches her effortlessly, lifting her off the ground as her legs dangle in the air for a moment before she lifts them up. Slowly, he spins around, reveling in the moment, and then comes to a stop. She lowers her legs, and he allows her to gently fall into his arms so that she is pressed closely against his body, sliding down until her feet touch the floor. Their foreheads press together in an intimate gesture as they savor the closeness of the moment."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The gentle golden glow of a street light casts a shimmering reflection on the rain-slick road as pedestrians, clutching umbrellas, scurry quickly towards the entrance of a restaurant where Hannah sits with her boyfriend, other colleagues, and Liz gathered around a table. While laughter fills the air from her colleagues, Liz discreetly signals a waiter, and nearby, Hannah, with a look of disappointment, glances at her boyfriend with searching eyes. Liz, observing this interaction, stares at the couple with wide eyes and an anxious expression as Hannah moves in closer to her boyfriend, who raises a hand. In response, Hannah swiftly grabs a nearby guy's drink and takes a quick gulp before decisively turning to leave; she heads out, striding confidently past Liz and exchanges a brief high-five with her. Braving the rain, Hannah makes her way to a bar where she finds Jacob engaged in flirtatious conversation with a blonde woman in her twenties. As she approaches, Jacob, noticing her arrival, shifts his frown into a curious smile directed at Hannah. Soaked from the rain, she strides directly to Jacob, firmly taking his face in her hands and kissing him with intense passion. Gradually, Jacob wraps his arms around her waist, drawing her closer as he lifts her gently off her feet, maintaining their passionate embrace. After a while, Hannah pulls back, meeting Jacob's gaze directly, and he returns her look with a happy smile. With a brisk nod, Hannah leans in to kiss him again before Jacob gently lowers her to the floor, and they leave the bar together, while the woman Jacob was earlier flirting with watches them exit, stunned. Now standing in Jacob's apartment living room, Hannah gazes out through the tall glass windows at the continuing rain as Jacob prepares drinks by pouring liquor onto a sugar lump in a glass and crushing it with a pestle. He then pours in additional liquor, adds ice cubes, and finishes by grating orange peel into the mixture. A stylus descends onto a record, filling the room with music, while Jacob carries two drinks to Hannah, who stands in a knee-length black dress, nervously fidgeting. He presents her with a glass, which she immediately downs at rapid speed, wincing and shaking her head before grabbing the second drink from Jacob's hand, proceeding to gulp that down as well. She gags, handing back both glasses, now empty, to Jacob, who places them on a coffee table. Meanwhile, Hannah performs a nervous twirl as Jacob removes his jacket and sits down, clenching his fists. Gesturing to himself, he nods and smiles before taking off his shirt, revealing a tanned, muscular torso with pronounced abdominal muscles. Hannah examines him closely as he glances down at himself, and she reaches out to touch him, gawking at the sight. Amused, he smiles smugly, prompting Hannah to limber up and rush towards him; he catches her and lifts her into the air. Her legs initially dangle before she raises them, and he slowly spins in place before stopping, allowing her to lower her legs. Gently, he lets her descend back into his embrace so that her body presses up against his, sliding softly downward until her feet find the floor as he gently leans his forehead against hers."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The gentle golden glow of a street light shimmers on the rain-slick road as people with umbrellas hurry into a restaurant where Hannah, her boyfriend, colleagues, and Liz sit around a table. While her colleagues laugh, Liz signals to a waiter, and Hannah looks disappointed, eyeing her boyfriend and stepping closer to him. Grabbing a drink, she gulps it down before high-fiving Liz and marching out. Hannah strides through the rain to a bar where Jacob is flirting with a blonde woman. She storms over, grabs Jacob's face, and kisses him passionately. Slowly, he pulls her closer, lifting her off the ground as they remain locked in an embrace. After some time, Hannah pulls away, looks him in the eye, and nods curtly before kissing him again. Jacob sets her down, and they leave the bar as the woman watches in disbelief.\n\nIn Jacob's apartment, Hannah stands by the window, watching the rain, while Jacob prepares drinks by pouring liquor onto a sugar lump, crushing it, adding more liquor, ice cubes, and orange peel. After lowering the stylus onto a record, he joins Hannah, hands her a drink, and she quickly downs it before grabbing his drink to do the same, then gags and returns the empty glasses. As Jacob puts them down on the coffee table, Hannah does a nervous twirl. Jacob removes his jacket and shirt, revealing a tanned, muscular torso. Hannah scrutinizes and touches him, impressed by his physique. Smiling smugly, he lifts her up as she runs at him, spins her around, and lets her slide gently down, pressing his forehead against hers as her feet touch the floor."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The gentle golden glow of a Victorian-style street light, reminiscent of 19th-century design, shimmers on the rain-slick road as people with umbrellas hurry into a restaurant known for its exquisite French cuisine, where Hannah, her boyfriend, other colleagues, and Liz sit around a table. Whilst her colleagues laugh, Liz, who is known for her perceptive nature, signals to a waiter while Hannah looks disappointed. Liz gapes over at the couple with wide eyes and an anxious expression as Hannah eyes her boyfriend searchingly and steps in close to him. He raises a hand, and she grabs a guy's drink, a signature cocktail renowned for its potency in this trendy locale, and gulps it before heading off, marching out and high-fiving Liz on the way. Hannah strides through the rain to a bar that boasts a vibrant nightlife scene, where Jacob is flirting with a blonde 20-something woman who models for local fashion brands. Frowning, Jacob turns and smiles at Hannah curiously. Rain-drenched, she storms over to him, grabs his face in her hands, and kisses him hard. Slowly, Jacob reaches around her waist, pulls her to him, and lifts her gently off the ground, still locked in a passionate embrace. After some time, Hannah pulls away, looks him straight in the eye, and Jacob smiles happily. Hannah nods curtly and kisses him again before Jacob puts her back down, and she drags him out of the bar while the woman he was flirting with earlier stares at them incredulously as they leave. Hannah stands in the living room of Jacob's minimalist apartment, featuring modern decor and art from local artists, watching the rain through the tall glass windows, as Jacob pours a fine brandy onto a sugar lump in a glass, crushes the lump with a pestle, pours in more liquor, and adds some ice cubes, grating some orange peel into the drink, creating a classic Old Fashioned. A stylus lowers onto a vintage vinyl record, playing smooth jazz, and Jacob goes into the living room carrying two drinks to where Hannah stands in her knee-length black dress, fidgeting nervously. He hands her the glass, and she glugs down her drink at top speed, cringes, shakes her head, and grabs the other drink off Jacob, starting to gulp that down. She gags and hands back both empty glasses, as Jacob heads over to a coffee table, crafted from reclaimed wood, to put them down. Hannah does a nervous twirl while Jacob takes off his jacket and sits down, squeezing his hands into fists. He points to himself, nods, and smiles before taking off his top to reveal a tanned, muscular torso with a six-pack, honed by years of dedicated gym workouts. Hannah scrutinizes him as he looks down at himself, and she touches and gawks at him. He smiles smugly, and she limbers up, runs at him, and he lifts her up. Her legs flop before she lifts them up, and slowly he spins around, then stops. She lowers her legs, and he lets her fall into his arms so she's pressed up against his body, sliding gently down until her feet touch the floor as he presses his forehead against hers, an intimate gesture of affection."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The gentle golden glow of a street light shimmers on the rainslick road as people with umbrellas hurry into a restaurant where Hannah her boyfriend other colleagues and Liz sit around a table. Whilst her colleagues laugh Liz signals to a waiter while Hannah looks disappointed. Liz gapes over at the couple with wide eyes and an anxious expression as Hannah eyes her boyfriend searchingly and steps in close to him. He raises a hand and she grabs a guy's drink and gulps it before heading off marching out and highfiving Liz on the way. Hannah strides through the rain to a bar where Jacob is flirting with a blonde 20something woman. Frowning. Jacob turns and smiles at Hannah curiously. Raindrenched she storms over to him grabs his face in her hands and kisses him hard. Slowly Jacob reaches around her waist pulls her to him and lifts her gently off the ground still locked in a passionate embrace. After some time Hannah pulls away looks him straight in the eye and Jacob smiles happily. Hannah nods curtly and kisses him again before Jacob puts her back down and she drags him out of the bar while the woman he was flirting with earlier stares at them incredulously as they leave. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Hannah stands in the living room of Jacob's apartment watching the rain through the tall glass windows as Jacob pours liquor onto a sugar lump in a glass crushes the lump with a pestle pours in more liquor and adds some ice cubes grating some orange peel into the drink. A stylus lowers onto a record and Jacob goes into the living room carrying two drinks to where Hannah stands in her kneelength black dress fidgeting nervously. He hands her the glass and she glugs down her drink at top speed. cringes shakes her head and grabs the other drink off Jacob starting to gulp that down. She gags and hands back both empty glasses as Jacob heads over to a coffee table to put them down. Hannah does a nervous twirl while Jacob takes off his jacket and sits down squeezing his hands into fists. He points to himself nods and smiles before taking off his top to reveal a tanned muscular torso with a six pack. Hannah scrutinizes him as he looks down at himself and she touches and gawks at him. He smiles smugly and she limbers up runs at him and he lifts her up. Her legs flop before she lifts them up and slowly he spins around then stops. She lowers her legs and he let us her fall into his arms so she is pressed up against his body sliding gently down until her feet touch the floor as he presses his forehead against hers."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The gentle golden glow of a street light shimmers on the rainslick road as people with umbrellas hurry into a restaurant where Hannah her boyfriend other colleagues and Liz sit around a table. Whilst her colleagues laugh Liz signals to a waiter while Hannah looks disappointed. Liz gapes over at the couple with wide eyes and an anxious expression as Hannah eyes her boyfriend searchingly and steps in close to him. He raises a hand and she grabs a guy's drink and gulps it before heading off marching out and highfiving Liz on the way. Hannah strides through the rain to a bar where Jacob is flirting with a blonde 20something woman. Frowning. Jacob turns and smiles at Hannah curiously. Raindrenched she storms over to him grabs his face in her hands and kisses him hard. Slowly Jacob reaches around her waist pulls her to him and lifts her gently off the ground still locked in a passionate embrace. After some time Hannah pulls away looks him straight in the eye and Jacob smiles happily. Hannah nods curtly and kisses him again before Jacob puts her back down and she drags him out of the bar while the woman he was flirting with earlier stares at them incredulously as they leave. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Hannah stands in the living room of Jacob's apartment watching the rain through the tall glass windows as Jacob pours liquor onto a sugar lump in a glass crushes the lump with a pestle pours in more liquor and adds some ice cubes grating some orange peel into the drink. A stylus lowers onto a record and Jacob goes into the living room carrying two drinks to where Hannah stands in her kneelength black dress fidgeting nervously. He hands her the glass and she glugs down her drink at top speed. cringes shakes her head and grabs the other drink off Jacob starting to gulp that down. She gags and hands back both empty glasses as Jacob heads over to a coffee table to put them down. Hannah does a nervous twirl while Jacob takes off his jacket and sits down squeezing his hands into fists. He points to himself nods and smiles before taking off his top to reveal a tanned muscular torso with a six pack. Hannah scrutinizes him as he looks down at himself and she touches and gawks at him. He smiles smugly and she limbers up runs at him and he lifts her up. Her legs flop before she lifts them up and slowly he spins around then stops. She lowers her legs and he let us her fall into his arms so she is pressed up against his body sliding gently down until her feet touch the floor as he presses his forehead against hers."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The gentle golden glow of a street light shimmers on the rainslick road as people with umbrellas hurry into a restaurant where Hannah her boyfriend other colleagues and Liz sit around a table. Whilst her colleagues laugh Liz signals to a waiter while Hannah looks disappointed. Liz gapes over at the couple with wide eyes and an anxious expression as Hannah eyes her boyfriend searchingly and steps in close to him. He raises a hand and she grabs a guy's drink and gulps it before heading off marching out and highfiving Liz on the way. Hannah strides through the rain to a bar where Jacob is flirting with a blonde 20something woman. Frowning. He points to himself nods and smiles before taking off his top to reveal a tanned muscular torso with a six pack. Hannah scrutinizes him as he looks down at himself and she touches and gawks at him. He smiles smugly and she limbers up runs at him and he lifts her up. Her legs flop before she lifts them up and slowly he spins around then stops. She lowers her legs and he let us her fall into his arms so she is pressed up against his body sliding gently down until her feet touch the floor as he presses his forehead against hers."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The gentle golden glow of a street light shimmers on the rainslick road as people with umbrellas hurry into a restaurant where Hannah her boyfriend other colleagues and Liz sit around a table. Whilst her colleagues laugh Liz signals to a waiter while Hannah looks disappointed. Liz gapes over at the couple with wide eyes and an anxious expression as Hannah eyes her boyfriend searchingly and steps in close to him. Her legs flop before she lifts them up and slowly he spins around then stops. She lowers her legs and he let us her fall into his arms so she is pressed up against his body sliding gently down until her feet touch the floor as he presses his forehead against hers."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The bright crimson shimmer of a lighthouse flickers on the snow-dusted alley as cats with scarves stroll into a bakery where Oliver, his cousin, other chess players, and Kate perch around a hammock. Whilst the chess players sneeze, Kate gestures to a clown while Oliver looks joyous. Kate squints over at the relatives with tiny eyes and a cheerful expression as Oliver eyes his cousin suspiciously and leaps away from him. The cousin lowers a flag, and Oliver snatches a bird's sandwich and devours it before leaping up, flying out and low-fiving Kate on the way. Oliver dances through the snow to a zoo where Linda is whispering to a brunette teenage student. Grinning, Linda spins and frowns at Oliver excitedly. Snow-covered, he slides towards her, clasps her shoulders with his feet, and pushes her firmly. Gradually, Linda turns around his arm, tugs him towards her, and sets him softly into a throne, still engaged in a gentle conversation. After a while, Oliver moves back, stares her in the nose, and Linda frowns cautiously. Oliver shakes rapidly and tickles her again before Linda lets him down, and he drags her out of the zoo while the student she was whispering to earlier watches them thoughtfully as they disappear. Oliver skips in the basement of Linda's cottage, observing the snow through the wide curtain windows as Linda pours soda onto a cookie in a mug, crumbles the cookie with a ladle, pours in more soda, and tosses some lemons, slicing some kiwi into the potion. A feather rises off a cassette, and Linda wanders into the basement carrying two potions to where Oliver stands in his floor-length white robe, jumping confidently. She passes him the mug, and he swigs down his potion at a lazy pace, cheers, nods his head, and snatches the other potion from Linda, starting to sip that slowly. He coughs and leaves behind both full mugs, as Linda wanders over to a treasure chest to place them inside. Oliver performs an energetic flip while Linda puts on her boots and spirals around, unclenching her toes into mittens. She gestures at herself, winks, and frowns before putting on her scarf to reveal a rosy, hardy abdomen with a wheel barrel. Oliver analyzes him as she looks up at herself, and she taps and glances at herself. She frowns smugly, and he stretches up, dances to her, and she puts him down. His knees relax before he folds them down, and slowly she dodges around, then freezes. He raises his knees, and she releases him into a wreath so he's edged up against her figure, stirring smoothly upward until his toes float on the ground as she rests her ear against his."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In the rain-soaked streets illuminated by a street light, Hannah dines with her boyfriend, colleagues, and Liz. Liz signals a waiter, and as tension brews between Hannah and her boyfriend, she abruptly leaves, high-fiving Liz. Hannah heads to a bar, where she finds Jacob flirting. She approaches him, kisses him intensely, and he embraces her. They leave the bar together, ignoring the astonished gaze of the woman Jacob was with. At Jacob's apartment, he prepares drinks while Hannah watches the rain. Nervously, she chugs her drink and takes Jacob's before twirling anxiously. Jacob removes his jacket, revealing his muscular physique, and Hannah examines him. They engage playfully, with Jacob lifting and spinning her. He lowers her gently until their foreheads touch, signaling an intimate connection."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She lowers her legs and he let us her fall into his arms so she is pressed up against his body sliding gently down until her feet touch the floor as he presses his forehead against hers Her legs flop before she lifts them up and slowly he spins around then stops He smiles smugly and she limbers up runs at him and he lifts her up Hannah scrutinizes him as he looks down at himself and she touches and gawks at him He points to himself nods and smiles before taking off his top to reveal a tanned muscular torso with a six pack Hannah does a nervous twirl while Jacob takes off his jacket and sits down squeezing his hands into fists She gags and hands back both empty glasses as Jacob heads over to a coffee table to put them down cringes shakes her head and grabs the other drink off Jacob starting to gulp that down He hands her the glass and she glugs down her drink at top speed A stylus lowers onto a record and Jacob goes into the living room carrying two drinks to where Hannah stands in her kneelength black dress fidgeting nervously Hannah stands in the living room of Jacob's apartment watching the rain through the tall glass windows as Jacob pours liquor onto a sugar lump in a glass crushes the lump with a pestle pours in more liquor and adds some ice cubes grating some orange peel into the drink Hannah nods curtly and kisses him again before Jacob puts her back down and she drags him out of the bar while the woman he was flirting with earlier stares at them incredulously as they leave After some time Hannah pulls away looks him straight in the eye and Jacob smiles happily Slowly Jacob reaches around her waist pulls her to him and lifts her gently off the ground still locked in a passionate embrace Raindrenched she storms over to him grabs his face in her hands and kisses him hard Jacob turns and smiles at Hannah curiously Frowning Hannah strides through the rain to a bar where Jacob is flirting with a blonde 20something woman He raises a hand and she grabs a guy's drink and gulps it before heading off marching out and highfiving Liz on the way Liz gapes over at the couple with wide eyes and an anxious expression as Hannah eyes her boyfriend searchingly and steps in close to him Whilst her colleagues laugh Liz signals to a waiter while Hannah looks disappointed The gentle golden glow of a street light shimmers on the rainslick road as people with umbrellas hurry into a restaurant where Hannah her boyfriend other colleagues and Liz sit around a table"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Whilst her colleagues laugh Liz signals to a waiter while Hannah looks disappointed The gentle golden glow of a street light shimmers on the rainslick road as people with umbrellas hurry into a restaurant where Hannah her boyfriend other colleagues and Liz sit around a table He raises a hand and she grabs a guy's drink and gulps it before heading off marching out and highfiving Liz on the way Liz gapes over at the couple with wide eyes and an anxious expression as Hannah eyes her boyfriend searchingly and steps in close to him Frowning Hannah strides through the rain to a bar where Jacob is flirting with a blonde 20something woman Raindrenched she storms over to him grabs his face in her hands and kisses him hard Jacob turns and smiles at Hannah curiously After some time Hannah pulls away looks him straight in the eye and Jacob smiles happily Slowly Jacob reaches around her waist pulls her to him and lifts her gently off the ground still locked in a passionate embrace Hannah stands in the living room of Jacob's apartment watching the rain through the tall glass windows as Jacob pours liquor onto a sugar lump in a glass crushes the lump with a pestle pours in more liquor and adds some ice cubes grating some orange peel into the drink Hannah nods curtly and kisses him again before Jacob puts her back down and she drags him out of the bar while the woman he was flirting with earlier stares at them incredulously as they leave He hands her the glass and she glugs down her drink at top speed A stylus lowers onto a record and Jacob goes into the living room carrying two drinks to where Hannah stands in her kneelength black dress fidgeting nervously She gags and hands back both empty glasses as Jacob heads over to a coffee table to put them down cringes shakes her head and grabs the other drink off Jacob starting to gulp that down He points to himself nods and smiles before taking off his top to reveal a tanned muscular torso with a six pack Hannah does a nervous twirl while Jacob takes off his jacket and sits down squeezing his hands into fists He smiles smugly and she limbers up runs at him and he lifts her up Hannah scrutinizes him as he looks down at himself and she touches and gawks at him She lowers her legs and he let us her fall into his arms so she is pressed up against his body sliding gently down until her feet touch the floor as he presses his forehead against hers Her legs flop before she lifts them up and slowly he spins around then stops"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Hannah stands in the living room of Jacob's apartment watching the rain through the tall glass windows as Jacob pours liquor onto a sugar lump in a glass crushes the lump with a pestle pours in more liquor and adds some ice cubes grating some orange peel into the drink A stylus lowers onto a record and Jacob goes into the living room carrying two drinks to where Hannah stands in her kneelength black dress fidgeting nervously He hands her the glass and she glugs down her drink at top speed cringes shakes her head and grabs the other drink off Jacob starting to gulp that down She gags and hands back both empty glasses as Jacob heads over to a coffee table to put them down Hannah does a nervous twirl while Jacob takes off his jacket and sits down squeezing his hands into fists He points to himself nods and smiles before taking off his top to reveal a tanned muscular torso with a six pack Hannah scrutinizes him as he looks down at himself and she touches and gawks at him He smiles smugly and she limbers up runs at him and he lifts her up Her legs flop before she lifts them up and slowly he spins around then stops She lowers her legs and he let us her fall into his arms so she is pressed up against his body sliding gently down until her feet touch the floor as he presses his forehead against hers The gentle golden glow of a street light shimmers on the rainslick road as people with umbrellas hurry into a restaurant where Hannah her boyfriend other colleagues and Liz sit around a table Whilst her colleagues laugh Liz signals to a waiter while Hannah looks disappointed Liz gapes over at the couple with wide eyes and an anxious expression as Hannah eyes her boyfriend searchingly and steps in close to him He raises a hand and she grabs a guy's drink and gulps it before heading off marching out and highfiving Liz on the way Hannah strides through the rain to a bar where Jacob is flirting with a blonde 20something woman Frowning Jacob turns and smiles at Hannah curiously Raindrenched she storms over to him grabs his face in her hands and kisses him hard Slowly Jacob reaches around her waist pulls her to him and lifts her gently off the ground still locked in a passionate embrace After some time Hannah pulls away looks him straight in the eye and Jacob smiles happily Hannah nods curtly and kisses him again before Jacob puts her back down and she drags him out of the bar while the woman he was flirting with earlier stares at them incredulously as they leave"
        }
      ]
    }
  ]
}