{
  "ground_truth": "Cal hurries into the bar, clearly hypnotized by his move and his good looks, she forces herself to take a step back. He surveys it, studying the bar and various men and women chatting and flirting with one another. Wet from the rain, he steps further into the bar. In his bedroom, Jacob leans over Hannah, who lies back on the bed. He kisses her, kisses her again, and leans down to kiss her again. Still wearing his trousers, he lies between her open legs, then he pulls away from her and flops onto the bed. In the garage, Hannah sits in the massage chair, wrapped in a sheet. They lie on the bed laughing, and he smiles. Jacob licks his lips and nods. Jacob has fallen asleep with his glass in his hand. Hannah takes the glass, puts it on a chest of drawers, then pulls the sheet up over him. She gazes at him and smiles. She props herself up in bed, leans over, kisses him on the cheek, then lies back down resting her head on his shoulder, nuzzles into him, and closes her eyes. Cal's brow is knitted as he talks on the phone. Cal sits at the bar drinking on his own as the bartenders clean up. Cal looks over at a balding guy opposite him of a similar age, who sips his drink through a straw. The guy notices Cal eying him and raises his brows in acknowledgment. With a sad expression, Cal picks up his mobile. In a restaurant, Emily's phone rings, and she hangs up. Heading back to her house, David leans in and kisses her. The door opens, and they both nod awkwardly. David glances at Jessica and smiles, then heads off. Jessica has her arms folded and grins as Emily heads in. Jessica shrugs, shakes her head, and strides off. Emily goes in and shuts the door behind her, holding a clutch bag in one hand and a bunch of flowers in the other. She tosses the flowers on a chest of drawers in the hall, but she passes Robbie, who sits on the stairs watching her, without noticing it. Someone pedals furiously on a bike. At home, in her room, Jessica gets out a camera from her drawer, and he has the bunch of flowers with him. Studying her reflection in a mirror, she dons mascara. It's Robbie pedaling through the night. Jessica brushes out her long, dark hair and sweeps eyeshadow across her lids. She applies a peachy-colored lipstick to her lips, presses them together, then pouts in the mirror. She puts the camera on a shelf in her room. The light on it flashes as she stands a few feet away in her dressing gown.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Cal rushes into the tavern, evidently mesmerized by his maneuver and his attractive appearance, she compels herself to take a pace back. He examines it, observing the tavern and diverse men and women conversing and flirting with one another. Damp from the downpour, he steps further into the tavern. In his chamber, Jacob bends over Hannah, who reclines back on the mattress. He kisses her, kisses her again, and leans down to kiss her again. Still wearing his pants, he lies between her parted limbs, then he withdraws from her and flops onto the mattress. In the garage, Hannah sits in the massage chair, wrapped in a sheet. They lie on the mattress laughing, and he grins. Jacob licks his lips and nods. Jacob has fallen asleep with his goblet in his hand. Hannah takes the goblet, places it on a chest of drawers, then pulls the sheet up over him. She gazes at him and grins. She props herself up in bed, leans over, kisses him on the cheek, then lies back down resting her head on his shoulder, snuggles into him, and closes her eyes. Cal's brow is furrowed as he talks on the phone. Cal sits at the tavern drinking on his own as the bartenders tidy up. Cal looks over at a balding guy opposite him of a similar age, who sips his beverage through a straw. The guy notices Cal watching him and raises his brows in recognition. With a sorrowful expression, Cal picks up his mobile. In an eatery, Emily's phone rings, and she hangs up. Heading back to her house, David leans in and kisses her. The door opens, and they both nod awkwardly. David glances at Jessica and grins, then departs. Jessica has her arms folded and grins as Emily heads in. Jessica shrugs, shakes her head, and strides off. Emily goes in and shuts the door behind her, holding a clutch bag in one hand and a cluster of flowers in the other. She tosses the flowers on a chest of drawers in the hall, but she passes Robbie, who sits on the stairs observing her, without noticing it. Someone pedals furiously on a bicycle. At home, in her room, Jessica retrieves a camera from her drawer, and he has the cluster of flowers with him. Observing her reflection in a mirror, she applies mascara. It's Robbie pedaling through the night. Jessica brushes out her long, dark hair and sweeps eyeshadow across her lids. She applies a peachy-colored lipstick to her lips, presses them together, then pouts in the mirror. She places the camera on a shelf in her room. The light on it flashes as she stands a few feet away in her dressing gown."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Cal hurries into the bar. Clearly hypnotized by his move and his good looks, a step back is forced by her. The bar is surveyed by him, and various men and women chatting and flirting with one another are studied. Wet from the rain, he steps further into the bar. In his bedroom, Hannah is leaned over by Jacob, who lies back on the bed. She is kissed by him, kissed again, and is leaned down to kiss again. Still wearing his trousers, he lies between her open legs, then she is pulled away from and flopped onto the bed by him. In the garage, a sheet wraps around Hannah as she sits in the massage chair. The bed is laughed on by them, and a smile is given by him. Jacob licks his lips and nods. Jacob has fallen asleep with his glass in his hand. The glass is taken by Hannah, put on a chest of drawers, then the sheet is pulled up over him. He is gazed at by her, and a smile appears on her face. She props herself up in bed, leans over, kisses him on the cheek, then lies back down resting her head on his shoulder, nuzzles into him, and closes her eyes. Cal knits his brow while he talks on the phone. Cal sits at the bar drinking on his own as the bartenders clean up. A balding guy of similar age is looked over at by Cal, who sips his drink through a straw. Cal is noticed by the guy eying him, and his brows are raised in acknowledgment. With a sad expression, his mobile is picked up by Cal. In a restaurant, Emily's phone rings, and it is hung up by her. Heading back to her house, David leans in and kisses her. The door is opened, and awkward nods are exchanged by them both. David glances at Jessica and smiles, then heads off. Her arms are folded by Jessica, and she grins as Emily heads in. Jessica shrugs, shakes her head, and strides off. Emily goes in and shuts the door behind her, holding a clutch bag in one hand and a bunch of flowers in the other. She tosses the flowers on a chest of drawers in the hall, but Robbie is passed by her, who sits on the stairs watching her, without noticing it. Someone pedals furiously on a bike. At home, in her room, a camera is gotten out of her drawer by Jessica, and the bunch of flowers is with him. Her reflection is studied in a mirror, and mascara is donned by her. Robbie pedals through the night. Jessica brushes out her long, dark hair and sweeps eyeshadow across her lids. A peachy-colored lipstick is applied by her to her lips, presses them together, then a pout is given in the mirror. The camera is put on a shelf in her room by her. The light on it flashes as she stands a few feet away in her dressing gown."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Cal rushes into the bar, captivated by his moves and looks, forcing himself to pause. He observes the bar, noticing men and women chatting and flirting. Wet from rain, he ventures further inside. In his bedroom, Jacob leans over Hannah, kissing her repeatedly. Still in his trousers, he lies between her legs, then pulls away and collapses onto the bed. In the garage, Hannah sits in a massage chair, wrapped in a sheet. They laugh on the bed, and he smiles. Jacob falls asleep with a glass in hand. Hannah takes it, places it on a chest, pulls the sheet over him, kisses his cheek, and rests her head on his shoulder, nuzzling him before sleeping. Cal frowns while on the phone, sitting alone at the bar as bartenders clean. He notices a balding guy of similar age sipping his drink, who acknowledges Cal with raised brows. Sadly, Cal picks up his phone. In a restaurant, Emily's phone rings; she hangs up. David kisses her while leaving her house. The door opens; they nod awkwardly. David smiles at Jessica and leaves. Jessica folds her arms, grins as Emily enters, shrugs, and walks off. Emily shuts the door, holding a clutch and flowers. She tosses the flowers on a chest in the hall, passing Robbie on the stairs unnoticed. Someone pedals furiously on a bike. In her room, Jessica gets a camera from a drawer, with the flowers nearby. She applies makeup and pouts in the mirror, placing the camera on a shelf. Its light flashes as she stands a few feet away in her gown."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Cal hurries into the bar, captivated by his own charm, and pauses. He observes people mingling, drenched from the rain. In his bedroom, Jacob leans over Hannah on the bed, kisses her and lies between her legs, then pulls away, flopping beside her. Laughing, they lie together as Jacob falls asleep. Hannah removes his glass, covers him with a sheet, and smiles. She leans over, kisses his cheek, then snuggles into him and sleeps. Cal’s brow furrows as he talks on the phone and drinks alone at the bar. A similar-aged balding man acknowledges Cal’s gaze with raised brows. Cal, looking sad, picks up his phone. In a restaurant, Emily hangs up her ringing phone. Heading home, David kisses her. They nod awkwardly as David departs, grinning at Jessica. Jessica folds her arms, grins, and leaves. Emily enters, carrying a clutch and flowers, tossing the flowers aside without noticing Robbie on the stairs. Robbie rides a bike furiously. In her room, Jessica pulls out a camera, applies mascara, eyeshadow, and lipstick, then pouts in the mirror, placing the camera on a shelf. Its light flashes as she stands in her dressing gown."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Cal hurriedly makes his way into the bar, visibly mesmerized by his confident demeanor and strikingly good looks. Despite her admiration, she forces herself to mentally take a step back. He surveys the surroundings, taking in the sight of the bar filled with various men and women who are chatting and flirting with one another. Soaked from the rain outside, he steps further into the establishment. Meanwhile, in the intimate setting of his bedroom, Jacob leans affectionately over Hannah, who is lying back comfortably on the bed. He kisses her tenderly, once, then again, and leans down to kiss her a third time. Still wearing his trousers, he positions himself between her open legs, before pulling away and flopping onto the bed beside her in a relaxed manner. \n\nElsewhere, in the garage, Hannah sits securely in the massage chair, wrapped snugly in a sheet. They lie on the bed bursting with laughter, and he beams at her with a smile. Jacob licks his lips thoughtfully and nods in agreement. Jacob has dozed off with a glass still clutched in his hand. With care, Hannah gently takes the glass from him, places it on a chest of drawers, and then pulls the sheet up over him to keep him warm. She gazes at him with a tender smile. She props herself up in bed, leans over, plants a soft kiss on his cheek, then lies back down, resting her head lovingly on his shoulder, nuzzling into him, and closes her eyes peacefully.\n\nCal's brow is furrowed with concern as he talks on the phone, his mind busy. Alone at the bar, Cal sits sipping his drink while the bartenders busily clean up. Cal glances over at a balding man of similar age sitting opposite him, sipping his drink through a straw. The man notices Cal's gaze and raises his eyebrows in a gesture of acknowledgment. With a melancholy expression, Cal picks up his mobile phone. In a nearby restaurant, Emily's phone rings, and she decides to hang up. As they head back to her house, David leans in and kisses her. The door opens, and they both nod at each other awkwardly, breaking the moment. David glances at Jessica, smiling warmly, then makes his exit. Jessica stands with her arms folded, grinning as Emily walks in. Jessica shrugs her shoulders, shakes her head slightly, and strides off with purpose. \n\nEmily enters the house and shuts the door behind her, clutching a handbag in one hand and a bunch of flowers in the other. She casually tosses the flowers onto a chest of drawers in the hallway but unknowingly passes Robbie, who sits on the stairs observing her, without noticing his presence. In the quiet of the night, someone pedals furiously on a bicycle. Back at home in her room, Jessica retrieves a camera from her drawer and holds the bunch of flowers. Studying her reflection thoughtfully in the mirror, she applies mascara to her lashes. It's Robbie who is the one pedaling through the night. Jessica brushes out her long, dark hair, smoothing it before sweeping eyeshadow across her lids. She carefully applies a peachy-colored lipstick to her lips, presses them together thoughtfully, then pouts at her reflection in the mirror. After setting the camera on a shelf in her room, the light on it flashes as she positions herself a few feet away, standing in her dressing gown."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Cal, in a hurried manner, makes his entrance into the bustling bar, clearly captivated by his own confident demeanor and undeniably strikingly good looks. Despite her admiration for him, she forces herself to mentally take a step back from the situation. He surveys the surroundings around him, absorbing the lively scene of the bar that is filled with various men and women engaged in animated conversations, chatting and flirting with each other. Soaked from the persistent rain outside, he ventures further into the warm and inviting establishment. Meanwhile, in the much more intimate setting of his bedroom, Jacob leans affectionately over Hannah, who is lying back comfortably on the bed. He kisses her tenderly, once, then again, and then leans down to kiss her a third time. Still dressed in his trousers, he positions himself between her open legs, before pulling away and flopping onto the bed beside her in a relaxed, carefree manner.\n\nElsewhere, located in the garage, Hannah sits securely in the comforting massage chair, wrapped snugly in a cozy sheet. They lie on the bed together, bursting into shared laughter, and he beams at her with a genuine smile. Jacob thoughtfully licks his lips and nods in agreement. Jacob has dozed off, still holding a glass tightly clutched in his hand. With the utmost care, Hannah gently removes the glass from his grasp, places it on a chest of drawers nearby, and then pulls the sheet up over him to ensure he stays warm. She gazes at him with a tender and affectionate smile. She props herself up in bed, leans over to plant a soft kiss on his cheek, then lies back down, resting her head lovingly on his shoulder, nuzzling into him, and closes her eyes in peaceful contentment.\n\nCal's brow is furrowed with concern as he engages in a conversation over the phone, his mind preoccupied. Alone at the bar, Cal sits quietly, sipping his drink while the bartenders busily clean up around him. Cal glances over at a balding man of similar age sitting opposite him, sipping his drink through a straw. The man notices Cal's gaze and raises his eyebrows in a gesture of acknowledgment. With a melancholy expression on his face, Cal picks up his mobile phone. Meanwhile, in a nearby restaurant, Emily's phone rings, and she decides to hang up. As they head back to her house, David leans in and kisses her. The door opens, and they both nod at each other awkwardly, breaking the moment. David glances at Jessica, smiling warmly, then makes his exit. Jessica stands with her arms folded, grinning broadly as Emily walks in. Jessica shrugs her shoulders, shakes her head slightly, and strides off with purpose.\n\nEmily enters the house and shuts the door behind her, clutching a handbag in one hand and holding a bunch of flowers in the other. She casually tosses the flowers onto a chest of drawers in the hallway but unknowingly passes by Robbie, who sits perched on the stairs observing her, without noticing his silent presence. In the quiet of the night, someone can be seen pedaling furiously on a bicycle. Back at home in her room, Jessica retrieves a camera from her drawer and holds the bunch of flowers. Studying her own reflection thoughtfully in the mirror, she carefully applies mascara to her lashes. It's Robbie who is the one pedaling through the night with determination. Jessica brushes out her long, dark hair, smoothing it before sweeping eyeshadow across her lids. She carefully applies a peachy-colored lipstick to her lips, presses them together thoughtfully, and then pouts at her reflection in the mirror. After setting the camera on a shelf in her room, the light on it flashes as she positions herself a few feet away, standing in her dressing gown, ready for the capture."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Cal hurries into the bar with a sense of urgency, his mind seemingly entranced by his own actions and appearance. Upon entering, he forces himself to take a deliberate step back, pulling himself out of his reverie. He takes a moment to survey the bustling scene, his eyes scanning the various men and women engaged in casual chats and flirtatious exchanges. Still damp from the rain outside, he progresses further into the bar, allowing himself to become part of the lively environment. Meanwhile, in Jacob's bedroom, Jacob leans over Hannah, who is lying back on the bed, and plants a gentle kiss on her lips. He kisses her again, savoring the moment, and then leans down once more to deliver another tender kiss. Though he remains dressed in his trousers, he positions himself between her open legs, indicating a level of intimacy. After a moment, he pulls away from her and flops back onto the bed beside her. In another scene, in the comfort of a garage, Hannah is seated in a massage chair, wrapped snugly in a sheet. As she and Jacob lie on the bed together laughing, he flashes a smile, clearly enjoying their shared moment. Jacob then licks his lips and nods in satisfaction. As the scene progresses, Jacob has drifted off to sleep, still clutching a glass in his hand. Hannah gently retrieves the glass from his grasp, carefully places it on a nearby chest of drawers, and then tenderly pulls the sheet up over his resting form. She gazes at him with affection, her face breaking into a smile. She then props herself up in bed, leans over to give him a soft kiss on the cheek, and subsequently lies back down, resting her head on his shoulder. Nuzzling into him, she closes her eyes, content in their closeness. In a bar setting once more, Cal appears deep in thought, his brow furrowed as he engages in a phone conversation. He sits alone at the bar, sipping his drink while observing the bartenders as they commence their closing routine. Cal's gaze drifts to a balding man of similar age sitting opposite him, sipping on his own drink through a straw. The man, sensing Cal's gaze, raises his eyebrows in acknowledgment without breaking eye contact. Cal, wearing a sad expression, picks up his mobile phone, indicating a sense of longing or regret. Meanwhile, in a restaurant, Emily's phone begins to ring, prompting her to end the call abruptly. Soon after, as they prepare to leave, David leans in and plants a kiss on Emily. As the door opens, they share an awkward nod, both acknowledging the moment. David then glances towards Jessica, offering her a warm smile before he takes his leave. Jessica, with her arms folded across her chest, grins as Emily approaches. Watching Emily enter the house, Jessica gives a nonchalant shrug, shakes her head, and strides off, exuding a sense of nonchalance. Emily, now inside, closes the door behind her, carrying a clutch bag in one hand and a bouquet of flowers in the other. She casually tosses the flowers onto a hall chest of drawers without giving them much thought, even as she passes Robbie, who sits silently on the stairs observing her. He goes unnoticed, her focus elsewhere. Amidst this, someone is pedaling furiously on a bike, though their identity remains mysterious. At home, in her room, Jessica retrieves a camera from her drawer, now accompanied by the bunch of flowers. She takes a moment to study her reflection in the mirror before applying mascara with precision. As it turns out, it's Robbie pedaling through the night with determined energy. As Jessica continues her beauty routine, she brushes out her long, dark hair with care and sweeps eyeshadow across her lids, adding depth to her look. Next, she applies a peachy-colored lipstick, pressing her lips together to set the color before pouting at her reflection with satisfaction. After completing her makeup, she places the camera on a shelf within her room. The camera's light blinks to life as Jessica takes a few steps back, standing a short distance away in her dressing gown, ready to capture whatever moment she might wish to preserve."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Cal hurries into the bar, momentarily entranced by his own moves and looks, prompting him to survey the scene of chatting and flirting patrons. Wet from the rain, he steps further inside. Meanwhile, in his bedroom, Jacob shares intimate moments with Hannah, kissing her repeatedly before lying between her legs and then flopping onto the bed beside her. In the garage, wrapped in a sheet, Hannah relaxes in a massage chair, and later, they laugh together on the bed. Jacob falls asleep, and Hannah carefully takes the glass from his hand, places it on a chest of drawers, covers him with a sheet, and lovingly nestles against him.\n\nElsewhere, Cal, with a furrowed brow, talks on the phone and later sits alone at the bar, observing a balding man of similar age drinking through a straw. The man acknowledges Cal with raised brows as Cal, wearing a sad expression, picks up his phone. In a restaurant, Emily receives a call and promptly hangs up. As she returns home, David leans in to kiss her. Upon arriving, they nod awkwardly at each other; David smiles at Jessica before departing. With a grin, Jessica surveys Emily as she heads inside, then shrugs and walks off. Emily enters, holding a clutch bag and a bunch of flowers, which she tosses on a chest of drawers, oblivious to Robbie watching her from the stairs.\n\nSomeone pedals furiously on a bike. In her room, Jessica retrieves a camera from her drawer, quickly applying makeup as she checks her reflection. It's Robbie pedaling through the night. Jessica finishes her beauty routine, places the camera on a shelf, and steps away as its light flashes while she stands in her dressing gown."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Cal, fully aware of the allure he carries from years of social charm, hurries into the bar. Clearly hypnotized by his confident stride and his good looks, she forces herself to take a step back. The bar, a bustling establishment known for its craft cocktails and lively atmosphere, is filled with various men and women chatting and flirting with one another. Wet from the sudden downpour outside, he steps further into the bar. \n\nIn his bedroom, which overlooks the city skyline shimmering in the night, Jacob leans over Hannah, who lies back on the bed. He kisses her tenderly, kisses her again, and leans down to kiss her once more. Still wearing his tailored trousers from a long day at the office, he lies between her open legs, then he pulls away from her and flops onto the bed. In the garage, usually cluttered with tools and spare parts, Hannah sits in the massage chair, wrapped in a sheet. They lie on the bed laughing, and he smiles, a rare expression since taking on his demanding job. Jacob licks his lips, savoring the moment, and nods contentedly. Jacob has fallen asleep with his glass, the remnants of a fine Scotch, in his hand. Hannah gently takes the glass, places it on an antique chest of drawers, then pulls the sheet up over him. She gazes at him and smiles softly. She props herself up in bed, leans over, kisses him on the cheek, then lies back down resting her head on his shoulder, nuzzles into him, and closes her eyes, feeling the steady rise and fall of his chest.\n\nCal's brow is knitted in concern as he talks on the phone, discussing what seems to be urgent news from afar. Cal sits at the bar drinking on his own as the bartenders begin to clean up for the night. Cal looks over at a balding guy, a fellow regular who, like him, enjoys the solitude of a late-night drink, sitting opposite him, sipping his drink through a straw. The guy notices Cal eyeing him and raises his brows in acknowledgment, a silent camaraderie between them. With a sad expression, Cal picks up his mobile, perhaps contemplating a call he is unsure about. \n\nIn a cozy restaurant renowned for its intimate ambiance, Emily's phone rings, an all-too-familiar number flashing on the screen, and she hangs up. Heading back to her house, David leans in and kisses her softly. The door opens, and they both nod awkwardly, an unsaid understanding passing between them. David glances at Jessica and smiles warmly, then heads off, a solitary figure against the cool evening air. Jessica has her arms folded but grins knowingly as Emily heads in. Jessica shrugs off any lingering tension, shakes her head with a playful smile, and strides off confidently. Emily goes in and shuts the door behind her, juggling a clutch bag intricately embroidered with her initials in one hand and a bunch of vibrant flowers in the other. She tosses the flowers on a vintage chest of drawers in the hall, but she passes Robbie, who sits on the stairs watching her silent entrance, without noticing him.\n\nSomeone, a determined figure against the backdrop of the city night, pedals furiously on a bike. At home, in her room filled with mementos and dreams, Jessica gets out a camera from her drawer, a gift from her grandfather who was a photographer, and he has the bunch of flowers with him in a whimsical display. Studying her reflection in a mirror framed with postcards from her travels, she dons mascara, perfecting the look she has in mind. It's Robbie pedaling through the night, his energy a testament to youthful exuberance. Jessica brushes out her long, dark hair, admired by many for its natural sheen, and sweeps eyeshadow across her lids. She applies a peachy-colored lipstick to her lips, presses them together, then pouts in the mirror, satisfied with her reflection. She puts the camera on a shelf in her room. The light on it flashes, capturing a fleeting memory as she stands a few feet away in her cozy dressing gown, contemplating the stories she wishes to tell."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Cal hurries into the bar clearly hypnotized by his move and his good looks. she forces herself to take a step back. He surveys it studying the bar and various men and women chatting and flirting with one another. Wet from the rain he steps further into the bar. In his bedroom Jacob leans over Hannah who lies back on the bed. He kisses her kisses her again and leans down to kiss her again. Still wearing his trousers he lies between her open legs then he pulls away from her and flops onto the bed. In the garage Hannah sits in the massage chair wrapped in a sheet. They lie on the bed laughing and he smiles. Jacob licks his lips and nods. Jacob has fallen asleep with his glass in his hand. Hannah takes the glass puts it on a chest of drawers then pulls the sheet up over him. She gazes at him and smiles. She props herself up in bed leans over kisses him on the cheek then lies back down resting her head on his shoulder nuzzles into him and closes her eyes. Cal's brow is knitted as he talks on the phone. Cal sits at the bar drinking on his own. as the bartenders clean up. Cal looks over at a balding guy opposite him of a similar age who sips his drink through a straw. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. The guy notices Cal eying him and raises his brows in acknowledgment. With a sad expression Cal picks up his mobile. In a restaurant Emily's phone rings and she hangs up. Heading back to her house David leans in and kisses her. The door opens and they both nod awkwardly. David glances at Jessica and smiles then heads off. Jessica has her arms folded and grins as Emily heads in. Jessica shrugs shakes her head and strides off. Emily goes in and shuts the door behind her holding a clutch bag in one hand and a bunch of flowers in the other. She tosses the flowers on a chest of drawers in the hall but she passes. Robbie who sits on the stairs watching her without noticing it. Someone pedals furiously on a bike. At home in her room Jessica gets out a camera from her drawer and he has the bunch of flowers with him. Studying her reflection in a mirror she dons mascara. It is Robbie pedaling through the night. Jessica brushes out her long dark hair and sweeps eyeshadow across her lids. She applies a peachycolored lipstick to her lips presses them together then pouts in the mirror. She puts the camera on a shelf in her room. The light on it flashes as she stands a few feet away in her dressing gown."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Cal hurries into the bar clearly hypnotized by his move and his good looks. she forces herself to take a step back. He surveys it studying the bar and various men and women chatting and flirting with one another. Wet from the rain he steps further into the bar. In his bedroom Jacob leans over Hannah who lies back on the bed. He kisses her kisses her again and leans down to kiss her again. Still wearing his trousers he lies between her open legs then he pulls away from her and flops onto the bed. In the garage Hannah sits in the massage chair wrapped in a sheet. They lie on the bed laughing and he smiles. Jacob licks his lips and nods. Jacob has fallen asleep with his glass in his hand. Hannah takes the glass puts it on a chest of drawers then pulls the sheet up over him. She gazes at him and smiles. She props herself up in bed leans over kisses him on the cheek then lies back down resting her head on his shoulder nuzzles into him and closes her eyes. Cal's brow is knitted as he talks on the phone. Cal sits at the bar drinking on his own. as the bartenders clean up. Cal looks over at a balding guy opposite him of a similar age who sips his drink through a straw. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. The guy notices Cal eying him and raises his brows in acknowledgment. With a sad expression Cal picks up his mobile. In a restaurant Emily's phone rings and she hangs up. Heading back to her house David leans in and kisses her. The door opens and they both nod awkwardly. David glances at Jessica and smiles then heads off. Jessica has her arms folded and grins as Emily heads in. Jessica shrugs shakes her head and strides off. Emily goes in and shuts the door behind her holding a clutch bag in one hand and a bunch of flowers in the other. She tosses the flowers on a chest of drawers in the hall but she passes. Robbie who sits on the stairs watching her without noticing it. Someone pedals furiously on a bike. At home in her room Jessica gets out a camera from her drawer and he has the bunch of flowers with him. Studying her reflection in a mirror she dons mascara. It is Robbie pedaling through the night. Jessica brushes out her long dark hair and sweeps eyeshadow across her lids. She applies a peachycolored lipstick to her lips presses them together then pouts in the mirror. She puts the camera on a shelf in her room. The light on it flashes as she stands a few feet away in her dressing gown."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Cal hurries into the bar clearly hypnotized by his move and his good looks. she forces herself to take a step back. He surveys it studying the bar and various men and women chatting and flirting with one another. Wet from the rain he steps further into the bar. In his bedroom Jacob leans over Hannah who lies back on the bed. He kisses her kisses her again and leans down to kiss her again. Still wearing his trousers he lies between her open legs then he pulls away from her and flops onto the bed. In the garage Hannah sits in the massage chair wrapped in a sheet. They lie on the bed laughing and he smiles. She tosses the flowers on a chest of drawers in the hall but she passes. Robbie who sits on the stairs watching her without noticing it. Someone pedals furiously on a bike. At home in her room Jessica gets out a camera from her drawer and he has the bunch of flowers with him. Studying her reflection in a mirror she dons mascara. It is Robbie pedaling through the night. Jessica brushes out her long dark hair and sweeps eyeshadow across her lids. She applies a peachycolored lipstick to her lips presses them together then pouts in the mirror. She puts the camera on a shelf in her room. The light on it flashes as she stands a few feet away in her dressing gown."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Cal hurries into the bar clearly hypnotized by his move and his good looks. she forces herself to take a step back. He surveys it studying the bar and various men and women chatting and flirting with one another. Wet from the rain he steps further into the bar. Jessica brushes out her long dark hair and sweeps eyeshadow across her lids. She applies a peachycolored lipstick to her lips presses them together then pouts in the mirror. She puts the camera on a shelf in her room. The light on it flashes as she stands a few feet away in her dressing gown."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Doc ambles into the bakery, clearly dazzled by his dance and his striking charm; he compels himself to take a step forward. She examines it, scrutinizing the bakery and various cats and dogs napping and lounging with one another. Dry from the snow, she climbs deeper into the bakery. In his kitchen, Marcus leans over Lisa, who reclines back on the sofa. He tickles her, tickles her once more, and leans down to tickle her a third time. Still wearing his boots, he lounges between her crossed arms, then he pushes away from her and lounges onto the sofa. In the attic, Lisa reclines in the hammock, wrapped in a blanket. They rest on the sofa snickering, and he giggles. Marcus chomps his gum and shakes his head. Marcus has dozed off with his bottle in his grip. Lisa grabs the bottle, places it on a bookshelf, then drapes the blanket over him. She glances at him and giggles. She props herself up on the sofa, reaches over, tickles him on the foot, then lies back down resting her foot on his thigh, cuddles into him, and opens her mouth. Doc's fingers are crossed as she whispers on the radio. Doc lounges at the bakery sipping alone as the gardeners tidy up. Doc glances over at a gray-haired woman opposite her of a similar age, who munches her sandwich with a fork. The woman notices Doc watching her and lowers her shoulders in acknowledgment. With a cheerful expression, Doc puts down her newspaper. In a library, Michael's radio beeps, and he switches it off. Heading out of his kennel, Sarah lounges in and pokes him. The window closes, and they both wave energetically. Sarah peeks at Oliver and giggles, then strolls away. Oliver folds his arms and chuckles as Michael strolls in. Oliver waves, shakes his arms, and tiptoes away. Michael walks out and opens the window beside him, grasping a cane in one hand and a jar of cookies in the other. She drops the cookies on a couch in the attic, but he passes Leah, who naps on the porch observing him, without catching it. Someone swims slowly on a raft. At the zoo, in his shed, Oliver removes a sculpture from his trunk, and she has the jar of cookies with her. Observing his shadow on a screen, he applies paint. It's Leah swimming through the dusk. Oliver brushes his short, light hair and dabs chalk across his nose. He applies a violet-colored blush to his cheeks, rubs them together, then smiles in the screen. He places the sculpture on a rack in his shed. The bell on it rings as he stands a few feet near in his wetsuit."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Cal enters a bar, captivated by his own confidence. Despite being soaked from the rain, he observes the patrons' interactions. Meanwhile, Jacob and Hannah enjoy an intimate moment at home, laughing and cuddling before sleep. Cal, alone at the bar, drinks as he notices a man similar in age, acknowledging him with a sad look before reaching for his phone. Elsewhere, Emily receives a call in a restaurant, which she dismisses. Returning home, she's greeted by David's kiss and an awkward nod to Jessica, who soon departs. Emily enters, tossing flowers inside, unnoticed by her son Robbie. Robbie then pedals through the night. Jessica, in her room, applies makeup, preparing herself for a photo with the camera she places on a shelf. The camera flashes as she poses in her dressing gown."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The light on it flashes as she stands a few feet away in her dressing gown She puts the camera on a shelf in her room She applies a peachycolored lipstick to her lips presses them together then pouts in the mirror Jessica brushes out her long dark hair and sweeps eyeshadow across her lids It is Robbie pedaling through the night Studying her reflection in a mirror she dons mascara At home in her room Jessica gets out a camera from her drawer and he has the bunch of flowers with him Someone pedals furiously on a bike Robbie who sits on the stairs watching her without noticing it She tosses the flowers on a chest of drawers in the hall but she passes Emily goes in and shuts the door behind her holding a clutch bag in one hand and a bunch of flowers in the other Jessica shrugs shakes her head and strides off Jessica has her arms folded and grins as Emily heads in David glances at Jessica and smiles then heads off The door opens and they both nod awkwardly Heading back to her house David leans in and kisses her In a restaurant Emily's phone rings and she hangs up With a sad expression Cal picks up his mobile The guy notices Cal eying him and raises his brows in acknowledgment Cal looks over at a balding guy opposite him of a similar age who sips his drink through a straw as the bartenders clean up Cal sits at the bar drinking on his own Cal's brow is knitted as he talks on the phone She props herself up in bed leans over kisses him on the cheek then lies back down resting her head on his shoulder nuzzles into him and closes her eyes She gazes at him and smiles Hannah takes the glass puts it on a chest of drawers then pulls the sheet up over him Jacob has fallen asleep with his glass in his hand Jacob licks his lips and nods They lie on the bed laughing and he smiles In the garage Hannah sits in the massage chair wrapped in a sheet Still wearing his trousers he lies between her open legs then he pulls away from her and flops onto the bed He kisses her kisses her again and leans down to kiss her again In his bedroom Jacob leans over Hannah who lies back on the bed Wet from the rain he steps further into the bar He surveys it studying the bar and various men and women chatting and flirting with one another she forces herself to take a step back Cal hurries into the bar clearly hypnotized by his move and his good looks"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "she forces herself to take a step back Cal hurries into the bar clearly hypnotized by his move and his good looks Wet from the rain he steps further into the bar He surveys it studying the bar and various men and women chatting and flirting with one another He kisses her kisses her again and leans down to kiss her again In his bedroom Jacob leans over Hannah who lies back on the bed In the garage Hannah sits in the massage chair wrapped in a sheet Still wearing his trousers he lies between her open legs then he pulls away from her and flops onto the bed Jacob licks his lips and nods They lie on the bed laughing and he smiles Hannah takes the glass puts it on a chest of drawers then pulls the sheet up over him Jacob has fallen asleep with his glass in his hand She props herself up in bed leans over kisses him on the cheek then lies back down resting her head on his shoulder nuzzles into him and closes her eyes She gazes at him and smiles Cal sits at the bar drinking on his own Cal's brow is knitted as he talks on the phone Cal looks over at a balding guy opposite him of a similar age who sips his drink through a straw as the bartenders clean up With a sad expression Cal picks up his mobile The guy notices Cal eying him and raises his brows in acknowledgment Heading back to her house David leans in and kisses her In a restaurant Emily's phone rings and she hangs up David glances at Jessica and smiles then heads off The door opens and they both nod awkwardly Jessica shrugs shakes her head and strides off Jessica has her arms folded and grins as Emily heads in She tosses the flowers on a chest of drawers in the hall but she passes Emily goes in and shuts the door behind her holding a clutch bag in one hand and a bunch of flowers in the other Someone pedals furiously on a bike Robbie who sits on the stairs watching her without noticing it Studying her reflection in a mirror she dons mascara At home in her room Jessica gets out a camera from her drawer and he has the bunch of flowers with him Jessica brushes out her long dark hair and sweeps eyeshadow across her lids It is Robbie pedaling through the night She puts the camera on a shelf in her room She applies a peachycolored lipstick to her lips presses them together then pouts in the mirror The light on it flashes as she stands a few feet away in her dressing gown"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "With a sad expression Cal picks up his mobile In a restaurant Emily's phone rings and she hangs up Heading back to her house David leans in and kisses her The door opens and they both nod awkwardly David glances at Jessica and smiles then heads off Jessica has her arms folded and grins as Emily heads in Jessica shrugs shakes her head and strides off Emily goes in and shuts the door behind her holding a clutch bag in one hand and a bunch of flowers in the other She tosses the flowers on a chest of drawers in the hall but she passes Robbie who sits on the stairs watching her without noticing it Someone pedals furiously on a bike At home in her room Jessica gets out a camera from her drawer and he has the bunch of flowers with him Studying her reflection in a mirror she dons mascara It is Robbie pedaling through the night Jessica brushes out her long dark hair and sweeps eyeshadow across her lids She applies a peachycolored lipstick to her lips presses them together then pouts in the mirror She puts the camera on a shelf in her room The light on it flashes as she stands a few feet away in her dressing gown Cal hurries into the bar clearly hypnotized by his move and his good looks she forces herself to take a step back He surveys it studying the bar and various men and women chatting and flirting with one another Wet from the rain he steps further into the bar In his bedroom Jacob leans over Hannah who lies back on the bed He kisses her kisses her again and leans down to kiss her again Still wearing his trousers he lies between her open legs then he pulls away from her and flops onto the bed In the garage Hannah sits in the massage chair wrapped in a sheet They lie on the bed laughing and he smiles Jacob licks his lips and nods Jacob has fallen asleep with his glass in his hand Hannah takes the glass puts it on a chest of drawers then pulls the sheet up over him She gazes at him and smiles She props herself up in bed leans over kisses him on the cheek then lies back down resting her head on his shoulder nuzzles into him and closes her eyes Cal's brow is knitted as he talks on the phone Cal sits at the bar drinking on his own as the bartenders clean up Cal looks over at a balding guy opposite him of a similar age who sips his drink through a straw The guy notices Cal eying him and raises his brows in acknowledgment"
        }
      ]
    }
  ]
}