{
  "ground_truth": "Nick watches from his car as Bobby jumps around by the window in silk pajamas, flailing a pair of nunchucks, and after considering for a moment, Dale sneaks through Harken's house carrying a jar of peanuts. He puts a light on in the bedroom, goes to the door of the on-suite bathroom, opens it, and a cat leaps out at him. He falls against the shower, picks up a bottle of shampoo, and his eyes move between the shampoo and the peanuts. Nick sees Bobby's bedroom lights go out, heaves a sigh, looks at his box of Rat Attack, and answers his phone. Bobby answers the door to Harken, who hands him his phone and shoots him in the chest. Nick ducks down in his car as Harken flees the scene in his 4x4, yanks his seatbelt but it won't budge, and panicking, Dale tidies Harken's shower soaps and legs it with the peanuts. A speed camera snaps a picture of Nick as he hurtles through a red light, and the guys meet in a bar before getting in Nick's car, only to have a squad car block them in. A black officer strolls over, taps on Nick's window, and peers in, leading to them being in the back of the cop car at the precinct where Dale, Kurt, and the two detectives stare at Nick, who frowns while Kurt's face drops as he recalls scrubbing his backside with Bobby's toothbrush. The guys find Jones drinking in the bar, and after Jones cocks an eyebrow and shoots them a look, they huddle closer as Jones smirks and sips his drink. They then ride in Kurt's car to Harken's house, sneak in, and Kurt squats by Rhonda, who smiles at him before Harken enters and stomps out of the room. Kurt heads for Rhonda, and as Kurt emerges from the bathroom with Rhonda close behind, Nick and Dale are in the car with cops nearby. Kurt drives off, and Harken rams them in his SUV twice, causing them to weave around a car. Julia is naked in a bath and masturbates, while Kurt accelerates, swerves wildly through traffic, and hangs a sharp left into an empty street. Harken smashes into them in his 4x4, setting off the airbags, and taps on the window with his revolver, which Kurt lowers. They get out, Harken holds them at gunpoint and then shoots himself, sinking to the floor and clutching his leg, as Dale tosses the gun down. The guys high-five, and as Harken goes for Kurt, Nick smacks him hard in the face, knocking him to the ground. Luke smirks, pats her, and she pulls the patient's trousers down.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Nick observes from his vehicle as Bobby leaps about by the pane in satin sleepwear, thrashing a pair of nunchaku, and after pondering for a moment, Dale creeps through Harken's dwelling holding a container of nuts. He switches a lamp on in the chamber, proceeds to the entrance of the en-suite lavatory, opens it, and a feline springs out at him. He collapses against the stall, picks up a flask of cleanser, and his eyes shift between the cleanser and the nuts. Nick perceives Bobby's chamber lights extinguish, exhales a breath, looks at his carton of Rodent Assault, and picks up his handset. Bobby responds to the entrance for Harken, who hands him his handset and shoots him in the torso. Nick crouches down in his vehicle as Harken escapes the scene in his 4x4, tugs his seatbelt but it won't shift, and panicking, Dale arranges Harken's stall detergents and sprints with the nuts. A velocity camera captures a snapshot of Nick as he barrels through a crimson signal, and the guys convene in a tavern before entering Nick's vehicle, only to have a patrol car impede them in. A dark-toned officer ambles over, taps on Nick's pane, and peers in, leading to them being in the rear of the police car at the station where Dale, Kurt, and the two investigators gaze at Nick, who scowls while Kurt's visage falls as he remembers scrubbing his rear with Bobby's toothbrush. The guys locate Jones imbibing in the tavern, and after Jones raises an eyebrow and casts them a glance, they gather closer as Jones grins and sips his beverage. They then ride in Kurt's vehicle to Harken's dwelling, sneak in, and Kurt crouches by Rhonda, who grins at him before Harken enters and stomps out of the chamber. Kurt heads for Rhonda, and as Kurt emerges from the lavatory with Rhonda close behind, Nick and Dale are in the vehicle with law enforcement nearby. Kurt drives off, and Harken collides with them in his SUV twice, causing them to weave around a vehicle. Julia is bare in a tub and stimulates herself, while Kurt accelerates, veers erratically through traffic, and hangs a sharp left into a deserted alley. Harken crashes into them in his 4x4, deploying the airbags, and taps on the pane with his revolver, which Kurt lowers. They exit, Harken holds them at gunpoint and then shoots himself, sinking to the floor and clutching his limb, as Dale flings the firearm down. The guys high-five, and as Harken goes for Kurt, Nick strikes him forcefully in the visage, knocking him to the ground. Luke grins, pats her, and she pulls the patient's trousers down."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Nick watches from his car as Bobby is seen jumping around by the window in silk pajamas, flailing a pair of nunchucks, and after considering for a moment, a jar of peanuts is carried by Dale as he sneaks through Harken's house. A light is put on in the bedroom by him, the door of the on-suite bathroom is gone to, it is opened by him, and a cat is seen leaping out at him. He falls against the shower, a bottle of shampoo is picked up by him, and his eyes are moved between the shampoo and the peanuts. Bobby's bedroom lights are seen going out by Nick, a sigh is heaved by him, his box of Rat Attack is looked at, and his phone is answered by him. The door is answered by Bobby to Harken, who hands him his phone and shoots him in the chest. Nick ducks down in his car as the scene is fled by Harken in his 4x4, his seatbelt is yanked by him but it won't budge, and panicking, Harken's shower soaps are tidied by Dale and he legs it with the peanuts. Nick is snapped in a picture by a speed camera as a red light is hurtled through, and the guys are met by each other in a bar before Nick's car is gotten in by them, only for them to be blocked in by a squad car. Nick's window is tapped on by a black officer who strolls over and peers in, leading to them being stared at in the back of the cop car at the precinct by Dale, Kurt, and the two detectives, who are stared at by Nick, whose face is frowned while Kurt's face drops as Bobby's toothbrush is recalled to have been scrubbed by him against his backside. Jones is found by the guys drinking in the bar, and after an eyebrow is cocked by Jones and he shoots them a look, they huddle closer as Jones smirks and sips his drink. Kurt's car is then ridden in by them to Harken's house, it is sneaked into by them, and Rhonda is squatted by Kurt, who is smiled at by her before the room is stomped out of by Harken. Rhonda is headed for by Kurt, and as Kurt emerges from the bathroom with Rhonda close behind, the car is occupied by Nick and Dale with cops nearby. Kurt drives off, and they are rammed twice by Harken in his SUV, causing them to be woven around a car. Julia is naked in a bath and is seen masturbating, while traffic is wildly swerved through and a sharp left is hung into an empty street by Kurt, who accelerates. They are smashed into by Harken in his 4x4, the airbags are set off, and Kurt's window is tapped on with a revolver by him, which is lowered by Kurt. They get out, and Harken holds them at gunpoint. He then shoots himself, sinking to the floor and clutching his leg, as the gun is tossed down by Dale. The guys high-five, and as Kurt is gone for by Harken, Nick smacks him hard in the face, knocking him to the ground. Luke smirks, she is patted by him, and the patient's trousers are pulled down by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Nick watches from his car as Bobby jumps around in silk pajamas, flailing nunchucks. Dale sneaks into Harken's house with a jar of peanuts, turns on a light in the bedroom, and opens the bathroom door, where a cat leaps out. Falling against the shower, he grabs a shampoo bottle, eyeing it and the peanuts. Nick sees Bobby's lights go out, sighs, and answers his phone. Bobby opens the door to Harken, who shoots him in the chest. Nick ducks as Harken flees in his 4x4. Panicking, Dale tidies the soaps and flees with the peanuts. A speed camera snaps Nick running a red light, and the group meets at a bar before getting blocked by a squad car. An officer taps on Nick's window, leading to them being in the precinct. Dale, Kurt, and the detectives stare at Nick, who frowns as Kurt recalls scrubbing with Bobby's toothbrush. They find Jones at the bar, and after a brief exchange, head to Harken's house. Kurt squats by Rhonda, but Harken enters, prompting Kurt to leave with Rhonda. Nick and Dale wait in the car, cops nearby, as Kurt drives off. Harken rams them, causing a swerve. Julia bathes, while Kurt swerves through traffic. Harken crashes into them, sets off the airbags, and taps on the window with his gun. They exit, Harken holds them at gunpoint but shoots himself in the leg. Dale tosses the gun, and Nick knocks Harken down. Luke smirks and pats her as she pulls the patient's trousers down."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Nick watches from his car as Bobby, in silk pajamas, flails nunchucks by the window. Dale sneaks into Harken's house with a jar of peanuts, turns on a bedroom light, and a cat leaps at him from the bathroom. Falling against the shower, he picks up shampoo, eyeing both the shampoo and peanuts. Nick sees Bobby's lights go out, sighs, and looks at his Rat Attack box. Bobby opens the door to Harken, who shoots him in the chest. Nick ducks as Harken flees in his 4x4. Panicking, Dale tidies the soaps and runs with the peanuts. A speed camera captures Nick running a red light. They meet in a bar, get in Nick's car, and a squad car blocks them. An officer taps on Nick's window, leading to them in a cop car at the precinct. Dale, Kurt, and detectives stare at Nick, while Kurt remembers using Bobby's toothbrush. They find Jones drinking, who smirks as they huddle. They drive to Harken's house, where Kurt squats by Rhonda until Harken enters. Kurt emerges from the bathroom with Rhonda, and they leave with cops nearby. Harken rams them twice in his SUV, causing them to swerve. Julia is in the bath, while Kurt hangs a sharp left, and Harken crashes into them, setting off airbags. Harken taps on the window with his revolver, lowering it. Harken holds them at gunpoint, shoots himself, and clutches his leg as Dale tosses the gun down. They high-five, and as Harken goes for Kurt, Nick smacks him down. Luke smirks and pats her."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Nick sits in his car, intently watching the scene unfold before him as Bobby energetically hops around by the window, dressed in luxurious silk pajamas. He's wildly swinging a pair of nunchucks. After a moment of contemplation, Dale carefully sneaks into Harken's house, clutching a jar of peanuts. He switches on a bedroom light, then approaches the door of the en-suite bathroom. As soon as he opens it, a cat unexpectedly leaps out at him, causing him to stagger backward against the shower. He instinctively grabs a bottle of shampoo, his eyes darting back and forth between the shampoo and the peanuts. Meanwhile, Nick observes as the lights in Bobby's bedroom go out, sighs with a sense of relief, glances down at his box of \"Rat Attack,\" and answers his ringing phone. Bobby, on the other hand, answers the door to find Harken standing there. Harken hands Bobby his phone and, without warning, shoots him in the chest. Terrified, Nick quickly ducks lower in his car seat while Harken makes his escape from the scene, driving off in his 4x4. In a flustered state, Nick tugs at his seatbelt, but it stubbornly refuses to release. Simultaneously, Dale, in a panic, hurriedly tidies up Harken's shower soaps and then makes his escape with the jar of peanuts. A speed camera captures an image of Nick as he speeds through a red light, and the gang later reconvenes at a bar. However, as they get into Nick's car, a squad car suddenly blocks their exit. A black police officer leisurely approaches, taps on Nick's window, and peers inside, resulting in their eventual presence in the back of a cop car at the precinct. There, Dale, Kurt, and two detectives fix their stares on Nick. Nick frowns deeply, while Kurt's expression falls as he vividly recalls the uncomfortable memory of using Bobby's toothbrush on his backside. The trio then discovers Jones enjoying a drink in the bar. After Jones raises an eyebrow and gives them a knowing look, the guys gather closer, watching as Jones smirks and takes a sip from his drink. They subsequently ride in Kurt's car, heading to Harken's house. They sneak inside, and Kurt crouches by Rhonda, who greets him with a smile just before Harken enters and storms out of the room. Seizing the opportunity, Kurt makes his move towards Rhonda, and as he exits the bathroom with her closely following, Nick and Dale sit waiting in the car with police officers positioned nearby. Kurt drives away, but Harken soon catches up in his SUV and repeatedly rams them, causing their car to swerve erratically around another vehicle. Meanwhile, Julia is alone, naked in a bath, and caught in a moment of self-pleasure. As Kurt accelerates, he careens wildly through traffic, executing a sharp left turn into a deserted street. Harken's 4x4 crashes into them again, triggering the deployment of the airbags. He menacingly taps on the window with his revolver, prompting Kurt to lower it. The men exit the car, and Harken holds them at gunpoint before shockingly turning the gun on himself, shooting his own leg, and collapsing to the ground. Dale throws the gun down, and the friends exchange high-fives. When Harken makes a move for Kurt, Nick delivers a powerful smack to Harken's face, sending him sprawling to the ground. Nearby, Luke smiles smugly, pats her, and she pulls down the trousers of a patient."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Nick is seated comfortably in his car, his eyes fixed intently on the scene that is steadily unfolding before him. Bobby, full of energy and excitement, is hopping around with zeal by the window, attired in a luxurious set of silk pajamas. In his hands, he's swinging a pair of nunchucks with wild abandon. After taking a moment to ponder his next move, Dale decides to take action and cautiously sneaks into Harken's house, holding a jar of peanuts tightly. He switches on a light in the bedroom and then approaches the door leading to the en-suite bathroom. As soon as he opens it, to his surprise, a cat leaps out at him without warning, causing him to stagger backward and collide with the shower. Instinctively, he grabs a bottle of shampoo, his eyes darting nervously between the shampoo and the jar of peanuts. Meanwhile, Nick continues to observe as the lights in Bobby's bedroom are switched off. He lets out a sigh of relief, looking down at his box of \"Rat Attack,\" just as his phone begins to ring, and he answers the call. Bobby, meanwhile, answers the door and finds Harken standing there. Harken hands Bobby his phone and then, with no warning, shoots him in the chest. In a state of fear, Nick quickly ducks lower into his car seat while Harken makes his getaway, driving off in his 4x4 with urgency. Feeling flustered, Nick struggles with his seatbelt, but it remains stubbornly stuck. At the same time, Dale, in a fit of panic, hurriedly tidies up Harken's shower soaps and then rushes to make his escape, still holding the jar of peanuts. A speed camera takes a snapshot of Nick as he speeds through a red light, and later, the group gathers at a bar. However, as they get into Nick's car, a squad car suddenly blocks their path, preventing their exit. A black police officer leisurely approaches them, taps on Nick's window, and peers inside, which inevitably leads to their presence in the back of a police car at the precinct. There, Dale, Kurt, and two detectives fix their intense stares on Nick. Nick frowns deeply as he endures the scrutiny, while Kurt's expression falls as he vividly recalls the uncomfortable memory of having used Bobby's toothbrush on an inappropriate part of his body. The trio then spots Jones, who is enjoying a drink at the bar. Jones raises an eyebrow, giving them a knowing look, as the group gathers closer, observing as Jones smirks and takes a sip from his drink. They then find themselves in Kurt's car, heading towards Harken's house. They stealthily sneak inside, and Kurt crouches beside Rhonda, who greets him warmly with a smile just before Harken enters and storms out of the room in a burst of anger. Seizing the opportunity, Kurt makes his move towards Rhonda, and as he emerges from the bathroom with her closely in tow, Nick and Dale remain seated in the car, with police officers strategically positioned nearby. Kurt drives away quickly, but Harken soon catches up to them in his SUV and repeatedly rams their car, causing it to swerve wildly around another vehicle. Meanwhile, Julia finds herself alone and unclothed, soaking in a bath while caught in a private moment of self-pleasure. As Kurt accelerates, he careens through traffic, making a sharp left turn into a deserted street. Harken's 4x4 crashes into them once again, triggering the deployment of the airbags. Harken menacingly taps on the window with his revolver, and Kurt is compelled to lower it. The men exit the car, and Harken holds them at gunpoint before astonishingly turning the gun on himself, shooting his own leg, and collapsing to the ground in pain. Dale throws down his gun, and the friends exchange a series of high-fives, celebrating their survival. When Harken makes a move towards Kurt, Nick steps up and delivers a powerful smack to Harken's face, sending him sprawling to the ground. Nearby, Luke smiles smugly, offers a pat, and then she pulls down the trousers of a patient, effectively concluding the chaotic encounter."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Sitting in his car, Nick intently watches as Bobby energetically jumps around near the window, clad in silk pajamas, wildly swinging a pair of nunchucks. Meanwhile, Dale, after a brief moment of contemplation, decides to stealthily enter Harken's house, carefully carrying a jar of peanuts with him. Once inside, he proceeds to the bedroom, turns on a light, and makes his way towards the door of the en-suite bathroom. As he cautiously opens the door, a cat suddenly leaps out at him, causing him to stumble backward and fall against the shower. In his disoriented state, he picks up a bottle of shampoo, his gaze darting between the shampoo and the peanuts he's holding. At the same time, Nick notices the lights in Bobby's bedroom go out and lets out a deep sigh before glancing at his box of Rat Attack and answering his phone. Moments later, Bobby, having answered the door, is handed his phone by Harken, who then shoots him in the chest. Panicking, Nick ducks down inside his car as Harken makes a hasty escape in his 4x4. Meanwhile, Dale, still flustered, tidies up Harken's shower soaps in a panic, clutching the jar of peanuts as he makes a quick escape. As Nick speeds through a red light, a speed camera captures the moment. The trio later gathers in a bar before piling into Nick's car, only to be blocked by a squad car. A composed black officer approaches, raps on Nick's window, and peeks inside, leading to them being escorted to the precinct. Here, seated in the back of a cop car, Dale, Kurt, and two detectives focus their attention on Nick, who frowns, while Kurt's expression drops, recalling the moment he had scrubbed his backside with Bobby's toothbrush. Later, the group spots Jones drinking at the bar and, after Jones raises an eyebrow and shoots them a knowing look, they draw closer to him as Jones smirks and sips his drink. Subsequently, they pile into Kurt's car, heading to Harken's house, where they sneak inside. Kurt crouches beside Rhonda, who responds with a smile, just as Harken storms into and then out of the room. Taking his chance, Kurt approaches Rhonda, and as he emerges from the bathroom with Rhonda close behind, Nick and Dale sit waiting in the car, aware of the nearby police. Kurt drives off with urgency, and soon Harken, in his SUV, rams them twice, forcing them to swerve around a car. Meanwhile, Julia, naked in a bathtub, is in a private moment. As Kurt accelerates, skillfully weaving through the traffic and making a sharp left into an empty street, Harken crashes into them once more in his 4x4, deploying the airbags. Harken, now tapping on the window with his revolver, prompts Kurt to lower it. They exit the car, and Harken holds them at gunpoint before inexplicably shooting himself and collapsing to the ground, clutching his leg. Dale seizes the opportunity to toss the gun away, and the guys exchange high-fives. As Harken attempts to retaliate against Kurt, Nick decisively smacks him hard in the face, sending him sprawling to the ground. In the aftermath, Luke, with a smirk, pats her as she pulls the patient’s trousers down."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Nick observes from his car as Bobby energetically wields nunchucks by the window in silk pajamas, while Dale stealthily navigates Harken's house with a jar of peanuts. Inside, Dale turns on the bedroom light, opens the bathroom door, and is startled by a cat leaping out, causing him to fall and then glance between a bottle of shampoo and the peanuts. As Nick notices the lights in Bobby’s bedroom go out, he sighs, checks his box of Rat Attack, and answers his phone. Bobby greets Harken at the door, receives a phone, and is abruptly shot in the chest. Nick ducks in his car as Harken flees in his 4x4, while Dale quickly tidies up and escapes with the peanuts. Nick rushes through a red light, triggering a speed camera, and later meets the others at a bar. They get into Nick’s car but are blocked by a squad car. An officer approaches, leading to them being detained at the precinct where the group exchanges tense glances, and Kurt recalls a cringe-worthy moment with Bobby's toothbrush. They locate Jones at the bar, and after a brief exchange, they head to Harken's house. There, Kurt interacts with Rhonda before Harken enters and exits the room angrily. Kurt emerges with Rhonda as Nick and Dale keep watch from the car. As Kurt drives them away, Harken rams their car, forcing them to maneuver through traffic. Meanwhile, Julia is privately engaged in a bath. Kurt swerves into an empty street, only for Harken to crash into them again, triggering the airbags. Harken taps on the window with a revolver, which Kurt lowers before they exit the vehicle. Harken holds them at gunpoint then accidentally shoots himself. The guys celebrate with high-fives, but when Harken attacks Kurt, Nick knocks him out cold. Meanwhile, Luke smirks and interacts with a patient in a separate scene."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Nick watches from his car, a blue sedan he had borrowed from his brother, as Bobby, an amateur martial arts enthusiast known in his neighborhood for his quirky antics, jumps around by the window in silk pajamas, flailing a pair of nunchucks, a traditional Okinawan martial arts weapon. After considering for a moment, Dale, a seasoned prankster infamous for his knack for entering places unnoticed, sneaks through Harken's house carrying a jar of peanuts, a snack he is notorious for always having on hand. He puts a light on in the bedroom, goes to the door of the on-suite bathroom, opens it, and a cat, famously mischievous and belonging to Harken's grandmother, leaps out at him. He falls against the shower, picks up a bottle of shampoo, labeled with a popular celebrity endorsement, and his eyes move between the shampoo and the peanuts. Nick, known for his cautious demeanor, sees Bobby's bedroom lights go out, heaves a sigh, looks at his box of Rat Attack, a pest control product he recently purchased after his garage became overrun with rodents, and answers his phone. Bobby answers the door to Harken, who hands him his phone and shoots him in the chest using a gun purchased legally just a month ago. Nick ducks down in his car as Harken flees the scene in his rugged 4x4, a vehicle he'd recently acquired for off-road adventures, yanks his seatbelt but it won't budge due to the car's aging mechanism, and panicking, Dale tidies Harken's shower soaps, aligning them in a pattern only his friends might recognize, and legs it with the peanuts, his signature move in any escapade. A speed camera, installed just last week by city authorities after multiple traffic violations in the area, snaps a picture of Nick as he hurtles through a red light, and the guys meet in a bar, a local dive known for its dim lighting and cheap drinks, before getting in Nick's car, only to have a squad car block them in. A black officer, renowned for his no-nonsense approach and fair judgment, strolls over, taps on Nick's window, and peers in, leading to them being in the back of the cop car at the precinct where Dale, Kurt, and the two detectives, both veterans of the force with distinguished careers, stare at Nick, who frowns while Kurt's face drops as he recalls scrubbing his backside with Bobby's toothbrush, a prank gone wrong that had taken place months ago. The guys find Jones, a neighborhood legend for his storytelling and bar escapades, drinking in the bar, and after Jones cocks an eyebrow and shoots them a look, they huddle closer as Jones smirks, a signature gesture that often precedes his involvement in their schemes, and sips his dark whiskey. They then ride in Kurt's car, a sports model he proudly restored himself, to Harken's house, sneak in, and Kurt squats by Rhonda, the neighbor's amiable Labrador retriever, who smiles at him before Harken enters and stomps out of the room. Kurt heads for Rhonda, who had been lonely ever since her owner traveled abroad, and as Kurt emerges from the bathroom with Rhonda close behind, Nick and Dale, anxious about police presence as they await Kurt’s signal, are in the car with cops nearby. Kurt drives off, and Harken, driven by a mix of rage and paranoia, rams them in his SUV twice, instigating a dangerous chase that causes them to weave around a car. Julia, known for her provocative lifestyle and cavalier attitude towards societal norms, is naked in a bath and masturbates, undisturbed by the chaos outside, while Kurt accelerates, swerves wildly through traffic, and hangs a sharp left into an empty street, an alley he had memorized for such situations. Harken smashes into them in his 4x4, setting off the airbags, which had recently been recalled for safety reasons, and taps on the window with his revolver, a relic from his father's collection, which Kurt lowers. They get out, Harken holds them at gunpoint and then shoots himself, an act of desperation and misjudgment, sinking to the floor and clutching his leg, as Dale tosses the gun down, a calculated move to avoid further escalation. The guys high-five, a ritual of camaraderie solidified over years of friendship, and as Harken goes for Kurt, Nick smacks him hard in the face, a reflexive act fueled by adrenaline and desperation, knocking him to the ground. Luke, a friend of the group known for his quick wit and calm demeanor under pressure, smirks, pats her, a gesture reserved for close associates, and she pulls the patient's trousers down, following through with a plan they had hastily devised."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Nick watches from his car as Bobby jumps around by the window in silk pajamas flailing a pair of nunchucks and after considering for a moment Dale sneaks through Harken's house carrying a jar of peanuts. He puts a light on in the bedroom goes to the door of the onsuite bathroom opens it and a cat leaps out at him. He falls against the shower picks up a bottle of shampoo and his eyes move between the shampoo and the peanuts. Nick sees Bobby's bedroom lights go out heaves a sigh looks at his box of Rat Attack and answers his phone. Bobby answers the door to Harken who hands him his phone and shoots him in the chest. Nick ducks down in his car as Harken flees the scene in his 4x4 yanks his seatbelt but it will not budge and panicking. Dale tidies Harken's shower soaps and legs it with the peanuts. A speed camera snaps a picture of Nick as he hurtles through a red light and the guys meet in a bar before getting in Nick's car only to have a squad car block them in. A black officer strolls over taps on Nick's window and peers in leading to them being in the back of the cop car at the precinct where Dale Kurt and the two detectives stare at Nick who frowns while Kurt's face drops as he recalls scrubbing his backside with Bobby's toothbrush. The guys find Jones drinking in the bar and after Jones cocks an eyebrow and shoots them a look. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. they huddle closer as Jones smirks and sips his drink. They then ride in Kurt's car to Harken's house sneak in and Kurt squats by Rhonda who smiles at him before Harken enters and stomps out of the room. Kurt heads for Rhonda and as Kurt emerges from the bathroom with Rhonda close behind. Nick and Dale are in the car with cops nearby. Kurt drives off and Harken rams them in his SUV twice causing them to weave around a car. Julia is naked in a bath and masturbates while Kurt accelerates swerves wildly through traffic and hangs a sharp left into an empty street. Harken smashes into them in his 4x4 setting off the airbags and taps on the window with his revolver which Kurt lowers. They get out. Harken holds them at gunpoint and then shoots himself sinking to the floor and clutching his leg as Dale tosses the gun down. The guys highfive and as Harken goes for Kurt Nick smacks him hard in the face knocking him to the ground. Luke smirks pats her and she pulls the patient's trousers down."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Nick watches from his car as Bobby jumps around by the window in silk pajamas flailing a pair of nunchucks and after considering for a moment Dale sneaks through Harken's house carrying a jar of peanuts. He puts a light on in the bedroom goes to the door of the onsuite bathroom opens it and a cat leaps out at him. He falls against the shower picks up a bottle of shampoo and his eyes move between the shampoo and the peanuts. Nick sees Bobby's bedroom lights go out heaves a sigh looks at his box of Rat Attack and answers his phone. Bobby answers the door to Harken who hands him his phone and shoots him in the chest. Nick ducks down in his car as Harken flees the scene in his 4x4 yanks his seatbelt but it will not budge and panicking. Dale tidies Harken's shower soaps and legs it with the peanuts. A speed camera snaps a picture of Nick as he hurtles through a red light and the guys meet in a bar before getting in Nick's car only to have a squad car block them in. A black officer strolls over taps on Nick's window and peers in leading to them being in the back of the cop car at the precinct where Dale Kurt and the two detectives stare at Nick who frowns while Kurt's face drops as he recalls scrubbing his backside with Bobby's toothbrush. The guys find Jones drinking in the bar and after Jones cocks an eyebrow and shoots them a look. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. they huddle closer as Jones smirks and sips his drink. They then ride in Kurt's car to Harken's house sneak in and Kurt squats by Rhonda who smiles at him before Harken enters and stomps out of the room. Kurt heads for Rhonda and as Kurt emerges from the bathroom with Rhonda close behind. Nick and Dale are in the car with cops nearby. Kurt drives off and Harken rams them in his SUV twice causing them to weave around a car. Julia is naked in a bath and masturbates while Kurt accelerates swerves wildly through traffic and hangs a sharp left into an empty street. Harken smashes into them in his 4x4 setting off the airbags and taps on the window with his revolver which Kurt lowers. They get out. Harken holds them at gunpoint and then shoots himself sinking to the floor and clutching his leg as Dale tosses the gun down. The guys highfive and as Harken goes for Kurt Nick smacks him hard in the face knocking him to the ground. Luke smirks pats her and she pulls the patient's trousers down."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Nick watches from his car as Bobby jumps around by the window in silk pajamas flailing a pair of nunchucks and after considering for a moment Dale sneaks through Harken's house carrying a jar of peanuts. He puts a light on in the bedroom goes to the door of the onsuite bathroom opens it and a cat leaps out at him. He falls against the shower picks up a bottle of shampoo and his eyes move between the shampoo and the peanuts. Nick sees Bobby's bedroom lights go out heaves a sigh looks at his box of Rat Attack and answers his phone. Bobby answers the door to Harken who hands him his phone and shoots him in the chest. Julia is naked in a bath and masturbates while Kurt accelerates swerves wildly through traffic and hangs a sharp left into an empty street. Harken smashes into them in his 4x4 setting off the airbags and taps on the window with his revolver which Kurt lowers. They get out. Harken holds them at gunpoint and then shoots himself sinking to the floor and clutching his leg as Dale tosses the gun down. The guys highfive and as Harken goes for Kurt Nick smacks him hard in the face knocking him to the ground. Luke smirks pats her and she pulls the patient's trousers down."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Nick watches from his car as Bobby jumps around by the window in silk pajamas flailing a pair of nunchucks and after considering for a moment Dale sneaks through Harken's house carrying a jar of peanuts. He puts a light on in the bedroom goes to the door of the onsuite bathroom opens it and a cat leaps out at him. Harken holds them at gunpoint and then shoots himself sinking to the floor and clutching his leg as Dale tosses the gun down. The guys highfive and as Harken goes for Kurt Nick smacks him hard in the face knocking him to the ground. Luke smirks pats her and she pulls the patient's trousers down."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Rex observes from his drone as Sam dances near the fence in wool overalls, twirling a handful of marbles, and after contemplating for a second, Max slips into Morton's tent clutching a sack of walnuts. He flicks a flashlight on in the atelier, strides to the entrance of the walk-in pantry, pushes it open, and a rabbit bounces toward him. He stumbles against the sink, grasps a jar of jam, and his gaze darts between the jam and the walnuts. Rex notices Sam's study lamps dim, exhales deeply, glances at his crate of Cheese Blast, and reacts to his pager. Sam greets Morton at the gate, who passes him his pager and nudges him in the arm. Rex crouches beneath his drone as Morton departs the area in his truck, tugs his harness but it won't release, and flustered, Max arranges Morton's spice rack and dashes with the walnuts. A security sensor captures an image of Rex as he speeds past a yellow light, and the crew convenes at a café before piling into Rex's van, just to have a patrol van hem them in. An officer strides over, taps on Rex's drone, and scans it, leading to their relocation to the detention vehicle at the station where Max, Chris, and the investigators glower at Rex, who grimaces while Chris's expression drops as he remembers brushing his knuckles with Sam's comb. The crew discovers Lee sipping at the café, and after Lee arches an eyebrow and flashes them an expression, they squeeze together as Lee chuckles and gulps his drink. They next cruise in Chris's SUV to Morton's tent, tiptoe inside, and Chris crouches by Emma, who beams at him before Morton arrives and strides out of the space. Chris strides to Emma, and as Chris exits the pantry with Emma trailing him, Rex and Max linger in the van with patrols close. Chris maneuvers away, and Morton collides with them in his van thrice, prompting them to veer past a scooter. Clara is undressed in a hot tub and reads, while Chris accelerates, lurches wildly between cars, and veers sharply into a deserted alley. Morton slams into them in his truck, triggering the airbags, and raps on the windshield with his crowbar, which Chris lowers. They disembark, Morton holds them at crowbar’s edge and then strikes his own foot, collapsing to the tarmac and clutching his ankle, as Max hurls the crowbar away. The crew celebrates, and as Morton lunges at Chris, Rex thumps him firmly in the jaw, sending him to the gravel. Jake grins, strokes him, and she adjusts the attendant's belt."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Nick watches from his car as Bobby, in silk pajamas, wields nunchucks by the window. Dale sneaks into Harken's house, carrying peanuts, and encounters a cat. Meanwhile, Nick nervously observes from outside. Harken appears, shoots Bobby, and escapes in his 4x4, while a panicked Dale flees with the peanuts. Nick runs a red light, triggering a speed camera, and later, the guys meet at a bar. They're soon taken to the precinct, where Dale, Kurt, and two detectives question Nick. Afterward, they consult Jones at the bar and head to Harken's house. Kurt and Rhonda have a moment before Harken charges in. Kurt, Nick, and Dale escape in a car, pursued by Harken, who crashes into them. Amidst chaos, Kurt navigates through traffic and ends up in an empty street. Harken smashes into them again, waving his revolver. After the crash, Harken, gun in hand, ends up shooting himself in the leg. The guys celebrate, and Nick subdues Harken by punching him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Luke smirks pats her and she pulls the patient's trousers down The guys highfive and as Harken goes for Kurt Nick smacks him hard in the face knocking him to the ground Harken holds them at gunpoint and then shoots himself sinking to the floor and clutching his leg as Dale tosses the gun down They get out Harken smashes into them in his 4x4 setting off the airbags and taps on the window with his revolver which Kurt lowers Julia is naked in a bath and masturbates while Kurt accelerates swerves wildly through traffic and hangs a sharp left into an empty street Kurt drives off and Harken rams them in his SUV twice causing them to weave around a car Nick and Dale are in the car with cops nearby Kurt heads for Rhonda and as Kurt emerges from the bathroom with Rhonda close behind They then ride in Kurt's car to Harken's house sneak in and Kurt squats by Rhonda who smiles at him before Harken enters and stomps out of the room they huddle closer as Jones smirks and sips his drink The guys find Jones drinking in the bar and after Jones cocks an eyebrow and shoots them a look A black officer strolls over taps on Nick's window and peers in leading to them being in the back of the cop car at the precinct where Dale Kurt and the two detectives stare at Nick who frowns while Kurt's face drops as he recalls scrubbing his backside with Bobby's toothbrush A speed camera snaps a picture of Nick as he hurtles through a red light and the guys meet in a bar before getting in Nick's car only to have a squad car block them in Dale tidies Harken's shower soaps and legs it with the peanuts Nick ducks down in his car as Harken flees the scene in his 4x4 yanks his seatbelt but it will not budge and panicking Bobby answers the door to Harken who hands him his phone and shoots him in the chest Nick sees Bobby's bedroom lights go out heaves a sigh looks at his box of Rat Attack and answers his phone He falls against the shower picks up a bottle of shampoo and his eyes move between the shampoo and the peanuts He puts a light on in the bedroom goes to the door of the onsuite bathroom opens it and a cat leaps out at him Nick watches from his car as Bobby jumps around by the window in silk pajamas flailing a pair of nunchucks and after considering for a moment Dale sneaks through Harken's house carrying a jar of peanuts"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He puts a light on in the bedroom goes to the door of the onsuite bathroom opens it and a cat leaps out at him Nick watches from his car as Bobby jumps around by the window in silk pajamas flailing a pair of nunchucks and after considering for a moment Dale sneaks through Harken's house carrying a jar of peanuts Nick sees Bobby's bedroom lights go out heaves a sigh looks at his box of Rat Attack and answers his phone He falls against the shower picks up a bottle of shampoo and his eyes move between the shampoo and the peanuts Nick ducks down in his car as Harken flees the scene in his 4x4 yanks his seatbelt but it will not budge and panicking Bobby answers the door to Harken who hands him his phone and shoots him in the chest A speed camera snaps a picture of Nick as he hurtles through a red light and the guys meet in a bar before getting in Nick's car only to have a squad car block them in Dale tidies Harken's shower soaps and legs it with the peanuts The guys find Jones drinking in the bar and after Jones cocks an eyebrow and shoots them a look A black officer strolls over taps on Nick's window and peers in leading to them being in the back of the cop car at the precinct where Dale Kurt and the two detectives stare at Nick who frowns while Kurt's face drops as he recalls scrubbing his backside with Bobby's toothbrush They then ride in Kurt's car to Harken's house sneak in and Kurt squats by Rhonda who smiles at him before Harken enters and stomps out of the room they huddle closer as Jones smirks and sips his drink Nick and Dale are in the car with cops nearby Kurt heads for Rhonda and as Kurt emerges from the bathroom with Rhonda close behind Julia is naked in a bath and masturbates while Kurt accelerates swerves wildly through traffic and hangs a sharp left into an empty street Kurt drives off and Harken rams them in his SUV twice causing them to weave around a car They get out Harken smashes into them in his 4x4 setting off the airbags and taps on the window with his revolver which Kurt lowers The guys highfive and as Harken goes for Kurt Nick smacks him hard in the face knocking him to the ground Harken holds them at gunpoint and then shoots himself sinking to the floor and clutching his leg as Dale tosses the gun down Luke smirks pats her and she pulls the patient's trousers down"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They then ride in Kurt's car to Harken's house sneak in and Kurt squats by Rhonda who smiles at him before Harken enters and stomps out of the room Kurt heads for Rhonda and as Kurt emerges from the bathroom with Rhonda close behind Nick and Dale are in the car with cops nearby Kurt drives off and Harken rams them in his SUV twice causing them to weave around a car Julia is naked in a bath and masturbates while Kurt accelerates swerves wildly through traffic and hangs a sharp left into an empty street Harken smashes into them in his 4x4 setting off the airbags and taps on the window with his revolver which Kurt lowers They get out Harken holds them at gunpoint and then shoots himself sinking to the floor and clutching his leg as Dale tosses the gun down The guys highfive and as Harken goes for Kurt Nick smacks him hard in the face knocking him to the ground Luke smirks pats her and she pulls the patient's trousers down Nick watches from his car as Bobby jumps around by the window in silk pajamas flailing a pair of nunchucks and after considering for a moment Dale sneaks through Harken's house carrying a jar of peanuts He puts a light on in the bedroom goes to the door of the onsuite bathroom opens it and a cat leaps out at him He falls against the shower picks up a bottle of shampoo and his eyes move between the shampoo and the peanuts Nick sees Bobby's bedroom lights go out heaves a sigh looks at his box of Rat Attack and answers his phone Bobby answers the door to Harken who hands him his phone and shoots him in the chest Nick ducks down in his car as Harken flees the scene in his 4x4 yanks his seatbelt but it will not budge and panicking Dale tidies Harken's shower soaps and legs it with the peanuts A speed camera snaps a picture of Nick as he hurtles through a red light and the guys meet in a bar before getting in Nick's car only to have a squad car block them in A black officer strolls over taps on Nick's window and peers in leading to them being in the back of the cop car at the precinct where Dale Kurt and the two detectives stare at Nick who frowns while Kurt's face drops as he recalls scrubbing his backside with Bobby's toothbrush The guys find Jones drinking in the bar and after Jones cocks an eyebrow and shoots them a look they huddle closer as Jones smirks and sips his drink"
        }
      ]
    }
  ]
}