{
  "ground_truth": "Diana plugs a flash drive into the credit card burner. On the records computer, Sandy logs into the network and opens the folder. In his office area, Ken stares off with a furrowed brow before sitting at his computer and logging into company records. Diana enters Cornish's information into a card burner and inserts a blank card. On Ken's computer, he sees Cornish's actual photo and quickly stands. The burner finishes processing and prints out the card, which Diana hands to Sandy, who eyes it. Ken swiftly moves through the offices, approaches the records room doors, inputs the code, and they slide open. As he quickly enters, Ken finds the room vacant and steps toward the computer with wide eyes. Meanwhile, Sandy and Diana exit the building through an unmarked alley door. Diana grabs the card, and they enter an upscale hotel lobby, approaching reception. In their silver sedan, Julian and Marisol speed across a bridge into St. Louis. As Diana follows Sandy into the luxury suite, her mouth falls open, and she grabs a grape from a fruit platter. Loosening his tie, Sandy enters a room, removes his suit coat, tosses it onto a chair, and flops back on the bed. In a frothy bubble bath, Diana blows a handful of suds, finishes off a large bottle of champagne, and lowers the gushing shower head beneath the frothy surface while Sandy sleeps in the same outstretched position. She slaps the side of the tub, and her foot jolts out of the water. Meanwhile, Trish speaks on her phone as Diana enters in a robe. In a salon, Diana gently applies lavender eye makeup to her eyelids. Three stylists watch as she moves around the sampling table, grabs a can of hair spray, shakes it, sniffs it, and sprays her hair. Leaning back and forth, Diana douses her entire mop of hair, shakes it around, and faces the mirror, surrounding her head in a cloud of hairspray. Looking up, she spots the giggling stylists who abruptly stop and look away. Diana blinks rapidly, shifts in place, turns toward the checkout counter with an armful of products, strides forward, stops, lowers her gaze, slowly turns around, and approaches the stylists with her lips pressed together. A male stylist steps forward, and Diana sits down as he spins her toward the mirror. In the swanky hotel restaurant, Sandy slouches alone at the bar with a glass of water, sits up, glances around, and takes a sip. Wearing a chic black dress, Diana rounds the corner in slow motion, stepping forward with her auburn hair straightened and makeup beautifully applied.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Diana connects a thumb drive into the debit card engraver. On the archives computer, Sandy logs into the system and opens the directory. In his workspace, Ken gazes off with a wrinkled forehead before sitting at his computer and logging into corporate archives. Diana enters Cornish's data into a card engraver and inserts a blank card. On Ken's computer, he observes Cornish's genuine image and swiftly stands. The engraver completes processing and prints out the card, which Diana hands to Sandy, who scrutinizes it. Ken quickly moves through the offices, approaches the archives room doors, inputs the code, and they slide open. As he swiftly enters, Ken discovers the room empty and steps toward the computer with wide eyes. Meanwhile, Sandy and Diana exit the structure through an unmarked passage door. Diana grabs the card, and they enter an upscale hotel foyer, approaching reception. In their silver automobile, Julian and Marisol speed across a bridge into St. Louis. As Diana follows Sandy into the luxury suite, her mouth falls open, and she grabs a grape from a fruit platter. Loosening his necktie, Sandy enters a chamber, removes his suit jacket, tosses it onto a chair, and flops back on the bed. In a frothy bubble bath, Diana blows a handful of suds, finishes off a large bottle of champagne, and lowers the gushing shower head beneath the frothy surface while Sandy slumbers in the same outstretched position. She slaps the side of the tub, and her foot jolts out of the water. Meanwhile, Trish speaks on her phone as Diana enters in a robe. In a salon, Diana gently applies lavender eye makeup to her eyelids. Three stylists watch as she moves around the sampling table, grabs a can of hair spray, shakes it, sniffs it, and sprays her hair. Leaning back and forth, Diana drenches her entire mop of hair, shakes it around, and faces the mirror, surrounding her head in a cloud of hairspray. Looking up, she spots the giggling stylists who abruptly stop and look away. Diana blinks rapidly, shifts in place, turns toward the checkout counter with an armful of products, strides forward, stops, lowers her gaze, slowly turns around, and approaches the stylists with her lips pressed together. A male stylist steps forward, and Diana sits down as he spins her toward the mirror. In the swanky hotel restaurant, Sandy slouches alone at the bar with a glass of water, sits up, glances around, and takes a sip. Wearing a chic black dress, Diana rounds the corner in slow motion, stepping forward with her auburn hair straightened and makeup beautifully applied."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A flash drive is plugged into the credit card burner by Diana. On the records computer, the network is logged into by Sandy, who opens the folder. In his office area, with a furrowed brow, Ken stares off before the company records are logged into by him as he sits at his computer. Cornish's information is entered by Diana into a card burner, and a blank card is inserted by her. On Ken's computer, Cornish's actual photo appears and causes Ken to quickly stand. The card is printed out by the burner after processing finishes and is handed by Diana to Sandy, who eyes it. Through the offices, Ken swiftly moves, approaches the records room doors, inputs the code, and slides them open. As he enters quickly, the room is found vacant by Ken, who steps toward the computer with wide eyes. Meanwhile, the building is exited by Sandy and Diana through an unmarked alley door. The card is grabbed by Diana, and the upscale hotel lobby is entered by them, approaching reception. In their silver sedan, Julian and Marisol speed across a bridge into St. Louis. Sandy is followed by Diana into the luxury suite, and her mouth falls open as a grape is grabbed from a fruit platter by her. Loosening his tie, Sandy enters a room, removes his suit coat, tosses it onto a chair, and flops back on the bed. In a frothy bubble bath, a handful of suds is blown by Diana, a large bottle of champagne is finished off by her, and the gushing shower head is lowered beneath the frothy surface while Sandy sleeps in the same outstretched position. The side of the tub is slapped by her, and her foot jolts out of the water. Meanwhile, the phone is spoken on by Trish as Diana enters in a robe. In a salon, lavender eye makeup is gently applied by Diana to her eyelids. Three stylists watch as the sampling table is moved around by her, a can of hair spray is grabbed, shaken, sniffed, and her hair is sprayed. Leaning back and forth, her entire mop of hair is doused by Diana, shaken around, and facing the mirror, she surrounds her head in a cloud of hairspray. The giggling stylists are spotted by her, who abruptly stop and look away. Rapid blinking occurs as Diana shifts in place, turns toward the checkout counter with an armful of products, strides forward, stops, lowers her gaze, slowly turns around, and approaches the stylists with her lips pressed together. A male stylist steps forward, and she sits down as he spins her toward the mirror. In the swanky hotel restaurant, Sandy is slouched alone at the bar with a glass of water, sits up, glances around, and takes a sip. Wearing a chic black dress, the corner is rounded by Diana in slow motion, stepping forward with her auburn hair straightened and makeup beautifully applied."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Diana connects a flash drive to the credit card burner. Sandy logs into the network on the records computer and opens a folder. Ken, deep in thought in his office, logs into company records. Diana inputs Cornish's information into a card burner and inserts a blank card. Ken notices Cornish's photo on his computer and quickly stands. The burner finishes processing, and Diana hands the card to Sandy, who examines it. Ken rushes to the records room, inputs the code, and the doors open. Inside, he finds an empty room and approaches the computer, eyes wide. Sandy and Diana leave through an unmarked alley door, with Diana grabbing the card. They enter an upscale hotel lobby and approach reception. Meanwhile, Julian and Marisol drive a silver sedan into St. Louis. In the luxury suite, Diana, shocked, grabs a grape from a fruit platter. Sandy relaxes, removing his suit coat and lying back on the bed. In a bubble bath, Diana finishes champagne and lowers the shower head while Sandy sleeps. She splashes the water, causing a foot to jolt out. Trish is on the phone as Diana enters in a robe. At a salon, Diana applies lavender eye makeup. Observed by three stylists, she sprays her hair excessively, creating a hairspray cloud. Realizing the giggling stylists are watching, Diana faces the checkout counter, pauses, and approaches them with pursed lips. A stylist steps forward, and Diana sits as he spins her toward the mirror. In the hotel restaurant, Sandy sits alone at the bar with a glass of water. Diana, in a chic black dress, appears in slow motion, her straightened auburn hair perfectly styled."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Diana connects a flash drive to the credit card burner while Sandy logs into the network on the records computer. Ken sits at his computer, checking company records. Diana inputs Cornish's details into the burner, producing a card. Ken sees Cornish's photo and rushes to the records room, finding it empty. Sandy and Diana use an alley door to exit, then enter an upscale hotel. Julian and Marisol drive into St. Louis. In the luxury suite, Diana marvels, eats a grape, and relaxes while Sandy naps. Diana enjoys a bubble bath, then dons a robe, encountering Trish on the phone. At a salon, Diana applies makeup, sprays her hair, and confronts giggling stylists. A male stylist assists her, then at the hotel bar, Sandy drinks water. Diana, in a chic black dress, approaches with her hair styled and makeup flawless."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Diana methodically plugs the small flash drive into the credit card burner, ensuring that it is securely connected. Meanwhile, at the records computer, Sandy carefully logs into the network and proceeds to open the designated folder. Over in his office area, Ken gazes into the distance with a furrowed brow, displaying a sense of deep concentration, before finally settling into his chair and logging into the company records system. Focused and determined, Diana enters Cornish's pertinent information into the card burner and inserts a blank card with precision. On Ken's computer screen, the image of Cornish's actual photo suddenly appears, prompting him to stand up swiftly and decisively. As the burner completes its processing, it prints out the card, which Diana promptly hands over to Sandy, who examines it closely. Ken quickly navigates through the bustling offices, approaching the records room doors with urgency, inputs the access code, and watches as they slide open. Entering the room rapidly, Ken finds it surprisingly empty and steps towards the computer with eyes widened in disbelief. Meanwhile, Sandy and Diana make their exit from the building through a discreet, unmarked alley door. Holding the card securely, they enter the elegant lobby of an upscale hotel, making their way towards the reception desk. In their sleek, silver sedan, Julian and Marisol speed across a large bridge, heading into the vibrant city of St. Louis. As Diana follows Sandy into the luxurious suite, her mouth falls open in awe, and she grabs a juicy grape from the lavish fruit platter. Loosening his tie, Sandy enters a separate room, removes his suit coat with a casual toss onto a nearby chair, and then flops back onto the bed, exhausted. Enjoying a frothy bubble bath, Diana playfully blows a handful of suds, finishes off a sizeable bottle of champagne, and lowers the gushing shower head beneath the frothy surface, while Sandy remains asleep in the same relaxed position. She playfully slaps the side of the tub, causing her foot to jolt out of the water. At the same time, Trish is speaking on her phone as Diana enters, dressed comfortably in a plush robe. In a nearby salon, Diana gently applies a soft shade of lavender eye makeup to her eyelids. Three attentive stylists watch as she moves around the sampling table, grabs a can of hair spray, gives it a shake, sniffs it curiously, and sprays her hair confidently. Leaning back and forth, Diana douses her entire mop of hair with a generous amount, creates a cloud of hairspray around her head, and faces the mirror with satisfaction. Looking up, she notices the stylists giggling, who then abruptly stop and look away. Diana blinks rapidly, adjusts her stance, and turns toward the checkout counter with an armful of the stylist's recommended products. She strides forward, pauses, lowers her gaze in thought, slowly turns around, and approaches the stylists with her lips pressed together in determination. A male stylist steps forward, and Diana sits down as he spins her towards the mirror, ready for the finishing touches. In the swanky hotel restaurant, Sandy is slouched alone at the bar with just a glass of water in front of him; he sits up straighter, glances around the room, and takes a sip. Wearing a chic black dress, Diana gracefully rounds the corner in slow motion, stepping forward with her auburn hair perfectly straightened and her makeup beautifully and skillfully applied."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Diana, with deliberate care and precision, methodically plugs the small flash drive into the sleek credit card burner, ensuring that it is securely and properly connected. Meanwhile, over at the records computer, Sandy is carefully and attentively logging into the company's expansive network and proceeds to open the designated folder meant for their task. In a slightly distant office area, Ken finds himself gazing intently into the distance, his brow furrowed deeply, displaying a sense of profound concentration, before he eventually settles into his ergonomic chair and logs into the intricate company records system. With a focused and determined demeanor, Diana enters Cornish's pertinent information with utmost care into the card burner and inserts a blank card with precision. On Ken's computer screen, the image of Cornish's actual photo suddenly materializes, prompting him to stand up swiftly and with decisive urgency. As the burner completes its intricate processing, it efficiently prints out the card, which Diana promptly hands over to Sandy, who examines it closely and meticulously. Ken quickly navigates through the bustling, vibrant offices, approaching the records room doors with a palpable sense of urgency, inputs the secure access code, and watches as they slide open seamlessly. Entering the room with rapid steps, Ken finds it surprisingly empty and steps toward the computer, his eyes widened in disbelief at the unexpected sight. Meanwhile, Sandy and Diana make their discreet exit from the building, slipping through a discreet, unmarked alley door. Holding the card securely, they confidently enter the elegant and sophisticated lobby of an upscale hotel, making their way toward the reception desk with purpose. In their sleek, silver sedan, Julian and Marisol speed swiftly across a large and impressive bridge, heading toward the vibrant and bustling city of St. Louis. As Diana follows Sandy into the luxurious and opulent suite, her mouth falls open in sheer awe, and she eagerly grabs a juicy, succulent grape from the lavishly arranged fruit platter. Loosening his tie, Sandy enters a separate room, removes his suit coat with a casual toss onto a nearby chair, and then flops back onto the bed, thoroughly exhausted. Enjoying a frothy and luxurious bubble bath, Diana playfully blows a handful of suds, finishes off a sizeable bottle of exquisite champagne, and lowers the gushing shower head beneath the frothy surface, all while Sandy remains asleep in the same relaxed and peaceful position. She playfully slaps the side of the tub, causing her foot to jolt out of the water in surprise. At the same time, Trish is speaking on her phone as Diana enters, dressed comfortably in a plush and cozy robe. In a nearby chic salon, Diana gently applies a soft and delicate shade of lavender eye makeup to her eyelids. Three attentive stylists watch with interest as she moves around the sampling table, grabs a can of hair spray, gives it a shake, sniffs it curiously, and sprays her hair confidently. Leaning back and forth, Diana douses her entire mop of hair with a generous amount, creating a cloud of hairspray around her head, and she faces the mirror with satisfaction and pride. Looking up, she notices the stylists giggling among themselves, who then abruptly stop and look away in feigned innocence. Diana blinks rapidly, adjusts her stance, and turns toward the checkout counter with an armful of the stylist's recommended products. She strides forward with confidence, pauses thoughtfully, lowers her gaze in contemplation, slowly turns around, and approaches the stylists with her lips pressed together in determination. A male stylist steps forward with a professional demeanor, and Diana sits down as he gently spins her toward the mirror, ready to apply the finishing touches to her look. In the swanky and elegant hotel restaurant, Sandy is slouched alone at the bar with just a plain glass of water in front of him; he sits up straighter, glancing around the room with curiosity, and takes a sip to quench his thirst. Wearing a chic and sophisticated black dress, Diana gracefully rounds the corner in slow motion, stepping forward with her auburn hair perfectly straightened and her makeup beautifully and skillfully applied, exuding confidence and poise."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Diana carefully inserts a flash drive into the slot of the credit card burner, ensuring it is secure. Simultaneously, at the records computer, Sandy meticulously types in his credentials, successfully logs into the network, and navigates through the interface until he locates and opens the appropriate folder. Meanwhile, in his office space, Ken gazes into the distance with a furrowed brow, deep in thought, before breaking his trance, settling into his chair, and powering on his computer. He efficiently enters his login details to access the company records. With precision, Diana inputs Cornish's information into the card burner, takes a blank card, and inserts it into the machine. At the same moment, across the office, Ken's screen presents Cornish’s actual photograph, prompting him to abruptly stand in realization. The burner completes its process, efficiently printing out the finished card, which Diana promptly hands to Sandy for inspection. Sandy scrutinizes the card carefully. With urgency, Ken weaves through the office maze, reaches the records room doors, swiftly keys in the security code, and watches as they slide open. He enters quickly, finding the room starkly empty, and advances toward the computer, his eyes wide with anticipation. Concurrently, Sandy and Diana discreetly exit the building using an unmarked alley door. Diana deftly snatches the card as they make their way into an upscale hotel lobby, confidently approaching the reception with purposeful strides. Julian and Marisol, meanwhile, are in a silver sedan, speeding across a bridge into St. Louis. As Diana trails Sandy into the opulent luxury suite, she pauses, her jaw dropping in awe at the surroundings, and impulsively plucks a grape from a fruit platter. Sandy, feeling the weight of exhaustion, steps into a room, unknots his tie, removes his suit coat, carelessly draping it over a chair, and collapses backward onto the bed, completely relaxed. In the bathroom, surrounded by frothy bubbles, Diana playfully blows a handful of suds, takes the final sip from a large champagne bottle, and submerges the gushing shower head beneath the frothy surface. With Sandy still sprawled out, sound asleep, Diana gives the side of the tub a playful slap, causing her foot to jerk out of the water. Elsewhere, Trish engages in conversation on her phone when Diana enters in a plush robe. At a salon, Diana carefully applies lavender eye makeup to her eyelids, perfecting her look. As she moves around the sampling table, three stylists watch her intently. She deftly grabs a can of hair spray, shakes it, sniffs the fragrance, and proceeds to spray her hair thoroughly. Diana leans back and forth, ensuring her entire mop of hair is coated, shakes it around, and then admires her reflection while engulfed in a cloud of hairspray. Noticing the giggling stylists, she looks up, and they quickly avert their gaze. Diana blinks rapidly, adjusts her stance, turns toward the checkout counter with an armful of products, strides forward purposefully, pauses, lowers her gaze thoughtfully, and slowly pivots around. She approaches the stylists with a determined expression and pressed lips. One male stylist steps forward, inviting her to sit down, and he gently spins her toward the mirror for the finishing touches. In the swanky hotel restaurant, Sandy sits alone at the bar, slouched over a glass of water. He adjusts his posture, sits up, scans his surroundings with a casual glance, and takes a slow sip. Making a grand entrance, Diana, donning a chic black dress, rounds the corner in slow motion, her auburn hair impeccably straightened and makeup flawlessly applied, stepping forward with confidence and elegance."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Diana seamlessly integrates Cornish's information into a card burner, syncing her actions with Sandy's network login and file access on the records computer. Meanwhile, Ken, immersed in his own task, logs into company records and notices Cornish's photo, prompting him to rush to the records room. Diana completes the card-burning process and hands the finished card to Sandy as Ken discovers the empty records room. Sandy and Diana exit through an alley door, proceed to an upscale hotel, and confidently approach the reception desk. Simultaneously, Julian and Marisol speed toward St. Louis in a silver sedan. Upon entering the luxury suite, Diana is awestruck, indulging in a grape from a fruit platter as Sandy relaxes on the bed. Later, Diana enjoys a bubble bath, finishing a champagne bottle and playfully interacting with the frothy suds while Sandy sleeps. Post-bath, Diana appears in a robe as Trish speaks on the phone. In a salon, she applies lavender eye makeup and envelops her hair in a cloud of hairspray under the watchful eyes of giggling stylists. Facing the mirror, Diana notices them, collects herself, and approaches them decisively, receiving assistance from a stylist who spins her toward the mirror. Finally, in the hotel's stylish restaurant, Sandy sits at the bar, while Diana—wearing a chic black dress with perfectly styled hair and makeup—steps in gracefully, drawing attention."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Diana, whose technical skills make her a key player in their covert operations, plugs a flash drive into the credit card burner, a device used to encode information onto blank cards. On the records computer, Sandy, an experienced hacker known for his expertise in navigating complex networks, logs into the corporate system and opens the folder containing sensitive data. In his office area, Ken, visibly stressed due to recent security breaches, stares off with a furrowed brow before sitting at his computer and logging into the company records, ensuring all information aligns with protocol. Diana enters Cornish's information into a card burner, a process crucial for their plan, and inserts a blank card. On Ken's computer, he sees Cornish's actual photo from the secure employee database, and he quickly stands, recognizing the threat. The burner finishes processing and prints out the card, which Diana hands to Sandy, who eyes it with a critical gaze, assessing their handiwork. Ken, fueled by determination, swiftly moves through the offices, approaches the records room doors secured with an advanced electronic lock, inputs the code, and they slide open. As he quickly enters, Ken finds the room vacant, a rare occurrence, and steps toward the computer with wide eyes as he assesses the situation. Meanwhile, Sandy and Diana exit the building through an unmarked alley door, hidden from the main street view for discretion. Diana grabs the card, and they enter an upscale hotel lobby, part of a chain known for luxury and privacy, approaching reception. In their silver sedan, Julian and Marisol speed across the historic Eads Bridge into St. Louis, where their contact awaits. As Diana follows Sandy into the luxury suite, her mouth falls open at the opulence, and she grabs a grape from a fruit platter, a small indulgence in their otherwise tense operation. Loosening his tie, an indication of relief after executing a tense plan, Sandy enters a room, removes his suit coat, an expensive piece reflecting their need to blend in, tosses it onto a chair, and flops back on the bed. In a frothy bubble bath, Diana blows a handful of suds, finishes off a large bottle of champagne, savoring a moment of respite, and lowers the gushing shower head beneath the frothy surface while Sandy sleeps soundly in the same outstretched position. She playfully slaps the side of the tub, and her foot jolts out of the water, sending droplets everywhere. Meanwhile, Trish speaks on her phone, finalizing logistical details, as Diana enters in a robe, fresh from her indulgent bath. In a salon within the five-star hotel, Diana gently applies lavender eye makeup to her eyelids, calming her before their next rendezvous. Three stylists, accustomed to high-profile clients, watch as she moves around the sampling table, grabs a can of hair spray, shakes it, sniffs its floral scent, and sprays her hair. Leaning back and forth, Diana douses her entire mop of hair, shakes it around, and faces the mirror, surrounding her head in a theatrical cloud of hairspray. Looking up, she spots the giggling stylists who abruptly stop and look away, pretending to busy themselves. Diana blinks rapidly, shifts in place to maintain her composure, turns toward the checkout counter with an armful of luxury products, strides forward, stops, lowers her gaze, slowly turns around, and approaches the stylists with her lips pressed together, ready to confront them. A male stylist steps forward, offering a professional touch-up, and Diana sits down as he spins her toward the mirror to begin his work. In the swanky hotel restaurant known for its gourmet offerings, Sandy slouches alone at the bar with a glass of water, sits up, glances around to ensure their approach remains undetected, and takes a sip. Wearing a chic black dress tailored for sophistication, Diana rounds the corner in slow motion, stepping forward with her auburn hair straightened and makeup beautifully applied, ready to execute the next phase of their elaborate plan."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Diana plugs a flash drive into the credit card burner. On the records computer Sandy logs into the network and opens the folder. In his office area Ken stares off with a furrowed brow before sitting at his computer and logging into company records. Diana enters Cornish's information into a card burner and inserts a blank card. On Ken's computer he sees Cornish's actual photo and quickly stands. The burner finishes processing and prints out the card which Diana hands to Sandy who eyes it. Ken swiftly moves through the offices approaches the records room doors inputs the code and they slide open. As he quickly enters Ken finds the room vacant and steps toward the computer with wide eyes. Meanwhile Sandy and Diana exit the building through an unmarked alley door. Diana grabs the card and they enter an upscale hotel lobby approaching reception. In their silver sedan Julian and Marisol speed across a bridge into St Louis. As Diana follows Sandy into the luxury suite her mouth falls open and she grabs a grape from a fruit platter. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Loosening his tie Sandy enters a room removes his suit coat tosses it onto a chair and flops back on the bed. In a frothy bubble bath Diana blows a handful of suds finishes off a large bottle of champagne and lowers the gushing shower head beneath the frothy surface while Sandy sleeps in the same outstretched position. She slaps the side of the tub and her foot jolts out of the water. Meanwhile Trish speaks on her phone as Diana enters in a robe. In a salon Diana gently applies lavender eye makeup to her eyelids. Three stylists watch as she moves around the sampling table grabs a can of hair spray shakes it sniffs it and sprays her hair. Leaning back and forth Diana douses her entire mop of hair shakes it around and faces the mirror surrounding her head in a cloud of hairspray. Looking up she spots the giggling stylists who abruptly stop and look away. Diana blinks rapidly shifts in place turns toward the checkout counter with an armful of products strides forward stops lowers her gaze slowly turns around and approaches the stylists with her lips pressed together. A male stylist steps forward and Diana sits down as he spins her toward the mirror. In the swanky hotel restaurant Sandy slouches alone at the bar with a glass of water sits up glances around and takes a sip. Wearing a chic black dress Diana rounds the corner in slow motion stepping forward with her auburn hair straightened. and makeup beautifully applied."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Diana plugs a flash drive into the credit card burner. On the records computer Sandy logs into the network and opens the folder. In his office area Ken stares off with a furrowed brow before sitting at his computer and logging into company records. Diana enters Cornish's information into a card burner and inserts a blank card. On Ken's computer he sees Cornish's actual photo and quickly stands. The burner finishes processing and prints out the card which Diana hands to Sandy who eyes it. Ken swiftly moves through the offices approaches the records room doors inputs the code and they slide open. As he quickly enters Ken finds the room vacant and steps toward the computer with wide eyes. Meanwhile Sandy and Diana exit the building through an unmarked alley door. Diana grabs the card and they enter an upscale hotel lobby approaching reception. In their silver sedan Julian and Marisol speed across a bridge into St Louis. As Diana follows Sandy into the luxury suite her mouth falls open and she grabs a grape from a fruit platter. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Loosening his tie Sandy enters a room removes his suit coat tosses it onto a chair and flops back on the bed. In a frothy bubble bath Diana blows a handful of suds finishes off a large bottle of champagne and lowers the gushing shower head beneath the frothy surface while Sandy sleeps in the same outstretched position. She slaps the side of the tub and her foot jolts out of the water. Meanwhile Trish speaks on her phone as Diana enters in a robe. In a salon Diana gently applies lavender eye makeup to her eyelids. Three stylists watch as she moves around the sampling table grabs a can of hair spray shakes it sniffs it and sprays her hair. Leaning back and forth Diana douses her entire mop of hair shakes it around and faces the mirror surrounding her head in a cloud of hairspray. Looking up she spots the giggling stylists who abruptly stop and look away. Diana blinks rapidly shifts in place turns toward the checkout counter with an armful of products strides forward stops lowers her gaze slowly turns around and approaches the stylists with her lips pressed together. A male stylist steps forward and Diana sits down as he spins her toward the mirror. In the swanky hotel restaurant Sandy slouches alone at the bar with a glass of water sits up glances around and takes a sip. Wearing a chic black dress Diana rounds the corner in slow motion stepping forward with her auburn hair straightened. and makeup beautifully applied."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Diana plugs a flash drive into the credit card burner. On the records computer Sandy logs into the network and opens the folder. In his office area Ken stares off with a furrowed brow before sitting at his computer and logging into company records. Diana enters Cornish's information into a card burner and inserts a blank card. On Ken's computer he sees Cornish's actual photo and quickly stands. The burner finishes processing and prints out the card which Diana hands to Sandy who eyes it. Leaning back and forth Diana douses her entire mop of hair shakes it around and faces the mirror surrounding her head in a cloud of hairspray. Looking up she spots the giggling stylists who abruptly stop and look away. Diana blinks rapidly shifts in place turns toward the checkout counter with an armful of products strides forward stops lowers her gaze slowly turns around and approaches the stylists with her lips pressed together. A male stylist steps forward and Diana sits down as he spins her toward the mirror. In the swanky hotel restaurant Sandy slouches alone at the bar with a glass of water sits up glances around and takes a sip. Wearing a chic black dress Diana rounds the corner in slow motion stepping forward with her auburn hair straightened. and makeup beautifully applied."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Diana plugs a flash drive into the credit card burner. On the records computer Sandy logs into the network and opens the folder. In the swanky hotel restaurant Sandy slouches alone at the bar with a glass of water sits up glances around and takes a sip. Wearing a chic black dress Diana rounds the corner in slow motion stepping forward with her auburn hair straightened. and makeup beautifully applied."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Gordon shoves a paintbrush into the waffle iron. On the pottery kiln, Francis mounts on the tractor and closes the shack. In his basement, Mike dozes off with a wrinkled grin before lounging on his easel and mounting on kitchen blueprints. Gordon imprints Spencer’s signature onto a waffle iron and affixes a fluffy pancake. On Mike's easel, he notices Spencer’s random silhouette and abruptly stretches. The iron concludes baking and pops out the pancake, which Gordon tosses to Francis, who sniffs it. Mike slowly glides through the basements, reaches the blueprint vault curtains, taps the tune, and they swing wide. As he slowly exits, Mike finds the vault crowded and skips toward the easel with narrow eyes. Meanwhile, Francis and Gordon dodge the vehicle through an unmarked desert exit. Gordon swipes the pancake, and they skip into a rundown hostel courtyard, dodging security. In their golden pickup, Carlos and Rosa drift beneath a tunnel out of Seattle. As Gordon trails Francis into the penthouse garage, his eyes sparkle, and he snatches a banana from a snack basket. Tightening his necklace, Francis enters a closet, extracts his denim jacket, launches it onto a fireplace, and collapses forward on the couch. In a bubbly hot tub, Gordon flicks a pinch of bubbles, empties out a hefty jug of cider, and raises the drizzling garden hose above the fizzy layer while Francis snores in a similar twisted stance. He drums the rim of the tub, and his elbow twitches out of the liquid. Meanwhile, Nina whistles to her cat as Gordon skips in a tuxedo. In a bowling alley, Gordon briskly brushes turquoise blush onto his cheeks. Four gardeners observe as he jumps around the recycling bin, clutches a jar of molasses, swirls it, sniffs it, and coats his shoes. Twisting left and right, Gordon saturates his entire pair of boots, stomps them around, and faces the window, enclosing his feet in a mist of molasses. Glancing down, he notices the chuckling gardeners who instantly pause and peer away. Gordon blinks furiously, sways in pose, spins toward the loading dock with an armful of sponges, glides back, halts, raises his chin, gradually pivots around, and reaches the gardeners with his arms crossed. A female gardener steps forward, and Gordon stands up as she turns him toward the window. In the quaint cafe, Francis slouches alone on the patio with a mug of tea, leans back, scans the ground, and takes a gulp. Sporting a flowing green tunic, Gordon saunters right in fast motion, skipping backward with his golden boots polished and hair wildly styled."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Diana inserts a flash drive into a card burner while Sandy logs onto the network. Ken, distracted, eventually checks company records, spotting Cornish's photo and rushes to the records room, finding it empty. Diana completes the card burn, hands it to Sandy, and they leave through a side door, entering a fancy hotel. Julian and Marisol drive to St. Louis as Diana and Sandy settle into their suite. Diana relaxes in a bubble bath while Sandy sleeps. Later, Diana, in a robe, joins Trish on the phone. At a salon, Diana applies makeup, sprays her hair exuberantly, and catches the stylists’ amusement. She then approaches a stylist, who spins her toward the mirror. Meanwhile, Sandy drinks alone at the hotel bar. Diana arrives in a stylish dress, her hair straightened and makeup perfect."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "and makeup beautifully applied Wearing a chic black dress Diana rounds the corner in slow motion stepping forward with her auburn hair straightened In the swanky hotel restaurant Sandy slouches alone at the bar with a glass of water sits up glances around and takes a sip A male stylist steps forward and Diana sits down as he spins her toward the mirror Diana blinks rapidly shifts in place turns toward the checkout counter with an armful of products strides forward stops lowers her gaze slowly turns around and approaches the stylists with her lips pressed together Looking up she spots the giggling stylists who abruptly stop and look away Leaning back and forth Diana douses her entire mop of hair shakes it around and faces the mirror surrounding her head in a cloud of hairspray Three stylists watch as she moves around the sampling table grabs a can of hair spray shakes it sniffs it and sprays her hair In a salon Diana gently applies lavender eye makeup to her eyelids Meanwhile Trish speaks on her phone as Diana enters in a robe She slaps the side of the tub and her foot jolts out of the water In a frothy bubble bath Diana blows a handful of suds finishes off a large bottle of champagne and lowers the gushing shower head beneath the frothy surface while Sandy sleeps in the same outstretched position Loosening his tie Sandy enters a room removes his suit coat tosses it onto a chair and flops back on the bed As Diana follows Sandy into the luxury suite her mouth falls open and she grabs a grape from a fruit platter In their silver sedan Julian and Marisol speed across a bridge into St Louis Diana grabs the card and they enter an upscale hotel lobby approaching reception Meanwhile Sandy and Diana exit the building through an unmarked alley door As he quickly enters Ken finds the room vacant and steps toward the computer with wide eyes Ken swiftly moves through the offices approaches the records room doors inputs the code and they slide open The burner finishes processing and prints out the card which Diana hands to Sandy who eyes it On Ken's computer he sees Cornish's actual photo and quickly stands Diana enters Cornish's information into a card burner and inserts a blank card In his office area Ken stares off with a furrowed brow before sitting at his computer and logging into company records On the records computer Sandy logs into the network and opens the folder Diana plugs a flash drive into the credit card burner"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "On the records computer Sandy logs into the network and opens the folder Diana plugs a flash drive into the credit card burner Diana enters Cornish's information into a card burner and inserts a blank card In his office area Ken stares off with a furrowed brow before sitting at his computer and logging into company records The burner finishes processing and prints out the card which Diana hands to Sandy who eyes it On Ken's computer he sees Cornish's actual photo and quickly stands As he quickly enters Ken finds the room vacant and steps toward the computer with wide eyes Ken swiftly moves through the offices approaches the records room doors inputs the code and they slide open Diana grabs the card and they enter an upscale hotel lobby approaching reception Meanwhile Sandy and Diana exit the building through an unmarked alley door As Diana follows Sandy into the luxury suite her mouth falls open and she grabs a grape from a fruit platter In their silver sedan Julian and Marisol speed across a bridge into St Louis In a frothy bubble bath Diana blows a handful of suds finishes off a large bottle of champagne and lowers the gushing shower head beneath the frothy surface while Sandy sleeps in the same outstretched position Loosening his tie Sandy enters a room removes his suit coat tosses it onto a chair and flops back on the bed Meanwhile Trish speaks on her phone as Diana enters in a robe She slaps the side of the tub and her foot jolts out of the water Three stylists watch as she moves around the sampling table grabs a can of hair spray shakes it sniffs it and sprays her hair In a salon Diana gently applies lavender eye makeup to her eyelids Looking up she spots the giggling stylists who abruptly stop and look away Leaning back and forth Diana douses her entire mop of hair shakes it around and faces the mirror surrounding her head in a cloud of hairspray A male stylist steps forward and Diana sits down as he spins her toward the mirror Diana blinks rapidly shifts in place turns toward the checkout counter with an armful of products strides forward stops lowers her gaze slowly turns around and approaches the stylists with her lips pressed together Wearing a chic black dress Diana rounds the corner in slow motion stepping forward with her auburn hair straightened In the swanky hotel restaurant Sandy slouches alone at the bar with a glass of water sits up glances around and takes a sip and makeup beautifully applied"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "In a frothy bubble bath Diana blows a handful of suds finishes off a large bottle of champagne and lowers the gushing shower head beneath the frothy surface while Sandy sleeps in the same outstretched position She slaps the side of the tub and her foot jolts out of the water Meanwhile Trish speaks on her phone as Diana enters in a robe In a salon Diana gently applies lavender eye makeup to her eyelids Three stylists watch as she moves around the sampling table grabs a can of hair spray shakes it sniffs it and sprays her hair Leaning back and forth Diana douses her entire mop of hair shakes it around and faces the mirror surrounding her head in a cloud of hairspray Looking up she spots the giggling stylists who abruptly stop and look away Diana blinks rapidly shifts in place turns toward the checkout counter with an armful of products strides forward stops lowers her gaze slowly turns around and approaches the stylists with her lips pressed together A male stylist steps forward and Diana sits down as he spins her toward the mirror In the swanky hotel restaurant Sandy slouches alone at the bar with a glass of water sits up glances around and takes a sip Wearing a chic black dress Diana rounds the corner in slow motion stepping forward with her auburn hair straightened and makeup beautifully applied Diana plugs a flash drive into the credit card burner On the records computer Sandy logs into the network and opens the folder In his office area Ken stares off with a furrowed brow before sitting at his computer and logging into company records Diana enters Cornish's information into a card burner and inserts a blank card On Ken's computer he sees Cornish's actual photo and quickly stands The burner finishes processing and prints out the card which Diana hands to Sandy who eyes it Ken swiftly moves through the offices approaches the records room doors inputs the code and they slide open As he quickly enters Ken finds the room vacant and steps toward the computer with wide eyes Meanwhile Sandy and Diana exit the building through an unmarked alley door Diana grabs the card and they enter an upscale hotel lobby approaching reception In their silver sedan Julian and Marisol speed across a bridge into St Louis As Diana follows Sandy into the luxury suite her mouth falls open and she grabs a grape from a fruit platter Loosening his tie Sandy enters a room removes his suit coat tosses it onto a chair and flops back on the bed"
        }
      ]
    }
  ]
}