{
  "ground_truth": "The scene opens with the bottom of the stairs visible as John gasps, peering upward. Preacher looks at John, who sinks onto the edge of a chair as Preacher sits opposite. A bar of light from the door falls across Preacher's face, and John reacts with a questioning helplessness. John remains still, realizes his own folly, covers his mouth with his hand, and looks up at Preacher, then stiffens, relaxes, and chuckles softly. John starts for the stairs, which vibrate and move out of shot with the sound of a receding engine, disclosing Icey's skirts in the background. They appear spic-and-span, even wearing shoes, and wave bewilderedly after the car. She hustles out of the shot as his hand clamps over her mouth. She struggles and whimpers. His hand rises as she puts out her own, expecting a loving hand-clasp, but Preacher points to the window. Startled, then tender, she moves to adjust the shade, always looking toward the bed, smiling maternally. As the shot pulls back and pans into a full shot of the bed, she approaches, sits on the edge, and slips off her mules while Preacher turns, his back to her, with a sounding of bedsprings. His voice is quiet and cold as Willa puts her face down on the pillow and moans. Preacher snaps on a harsh bare bulb in the center of the room; she obeys. Willa hesitates, walks to the mirror, meets her image, her head dropping. In a head close-up, Willa is seen with the bulb hanging at the center, and Preacher, in his nightshirt, stands beyond it. Her mouth trembles, unable to speak, merely opening her mouth. He watches her for a moment, then snaps off the light and gets into bed. Willa, in darkness, remains motionless, folds her hands in prayer, and lifts her eyes. It lies face-down on the arbor bricks, back wide open, money spilling out as a little breeze toys with it, alongside the sound of snipping heard off-screen. The camera tilts upward to a view where she, at the end of the grape-arbor, finishes cutting a skirted paper doll out of a hundred-dollar bill and lays it beside a male hundred-dollar paper doll, which she pats. Pearl starts guiltily, looks toward him, scrambling the money together as John's footsteps are heard off-screen. As he stoops toward her, dumb with horror, she continues gathering the money. He stands at the far end of the arbor, where Preacher's watch-chain gleams. The shot slowly closes down on it until stillness as the paper dolls blow past him. John starts to laugh uncontrollably, experiencing a helpless reaction, and he holds his hands out to her. She comes to his lap, dropping her doll at his feet.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The vista initiates with the base of the staircase observable as John pants, scrutinizing skyward. Preacher regards John, who collapses onto the brim of a seat as Preacher perches across. A beam of illumination from the portal descends across Preacher's visage, and John responds with an inquisitive impotence. John stays motionless, perceives his own absurdity, conceals his lips with his palm, and glances up at Preacher, then tenses, loosens, and giggles quietly. John proceeds for the staircase, which tremble and shift out of view with the noise of a retreating motor, revealing Icey's garments in the background. They seem immaculate, even donning footwear, and salute perplexedly after the vehicle. She scurries out of the frame as his hand secures over her lips. She struggles and whines. His hand ascends as she extends her own, anticipating an affectionate grasp, but Preacher indicates to the pane. Surprised, then gentle, she moves to regulate the shade, always gazing toward the cot, grinning maternally. As the shot retracts and pans into a complete shot of the cot, she advances, perches on the brink, and removes her slippers while Preacher turns, his back to her, with a creaking of mattress. His voice is serene and frigid as Willa places her visage down on the cushion and groans. Preacher flicks on a severe naked bulb in the core of the chamber; she complies. Willa pauses, strides to the looking glass, encounters her reflection, her head drooping. In a head close-up, Willa is observed with the bulb suspended at the core, and Preacher, in his sleepwear, stands beyond it. Her lips quiver, unable to utter, merely opening her mouth. He observes her for a moment, then flicks off the illumination and gets into cot. Willa, in obscurity, remains immobile, folds her hands in supplication, and raises her gaze. It lies prone on the arbor stones, back widely open, currency spilling out as a slight breeze plays with it, alongside the noise of clipping heard off-screen. The camera inclines upward to a vista where she, at the terminus of the grape-arbor, concludes cutting a draped paper doll out of a hundred-dollar note and places it beside a male hundred-dollar paper doll, which she pats. Pearl begins guiltily, glances toward him, gathering the currency together as John's footsteps are heard off-screen. As he bends toward her, mute with dread, she persists in collecting the currency. He stands at the distant end of the arbor, where Preacher's watch-chain glistens. The shot gradually narrows down on it until stillness as the paper dolls flutter past him. John starts to chuckle uncontrollably, experiencing a powerless reaction, and he holds his hands out to her. She comes to his lap, dropping her doll at his feet."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The scene is opened with the bottom of the stairs visible as a gasp is let out by John, peering upward. John is looked at by Preacher, who is sunk onto the edge of a chair by John as opposite is where Preacher sits. A bar of light from the door is made to fall across Preacher's face, and a questioning helplessness is reacted with by John. Stillness is remained by John, his own folly is realized, and the mouth is covered with his hand by him, while Preacher is looked up at by John, then he is stiffened, relaxed, and soft chuckles are given. The stairs are started for by John, which are vibrated and moved out of shot by the sound of a receding engine, disclosing Icey's skirts in the background. She appears spic-and-span, even wearing shoes, and the car is waved after bewilderedly by her. The shot is hustled out of by her as her mouth is clamped over by his hand. She struggles and whimpers. The hand rises as her own hand is put out by her, expecting a loving hand-clasp, but the window is pointed to by Preacher. Startled, then tender, the shade is moved to adjust by her, always looking toward the bed, smiling maternally. As the shot is pulled back and panned into a full shot of the bed, the edge is approached by her, and her mules are slipped off while she sits on the edge, with a sounding of bedsprings as Preacher turns, his back to her. A quiet and cold voice is given by him as the face is put down on the pillow by Willa, who moans. A harsh bare bulb in the center of the room is snapped on by Preacher; she obeys. Hesitation is shown by Willa, the mirror is walked to by her, her image is met, and her head is dropped. In a head close-up, Willa is seen with the bulb hanging at the center, and beyond it, Preacher stands in his nightshirt. Her mouth trembles, words unspoken, and merely her mouth is opened. He watches her for a moment, then the light is snapped off by him, and bed is gotten into. Motionlessness is retained by Willa, in darkness, her hands are folded in prayer, and her eyes are lifted. It lies face-down on the arbor bricks, with back wide open and money spilling out as a little breeze toys with it, alongside the sound of snipping that is heard off-screen. The camera is tilted upward to a view where, at the end of the grape-arbor, a skirted paper doll is finished being cut out of a hundred-dollar bill by her, and it is laid beside a male hundred-dollar paper doll, which is patted by her. Pearl starts guiltily, toward him she looks, gathering the money together as off-screen John's footsteps are heard. As she is stooped toward by him, dumb with horror, the money is continued being gathered by her. At the far end of the arbor, he stands, where Preacher's watch-chain gleams. The shot is slowly closed down on it until stillness as the paper dolls blow past him. Uncontrollable laughter is started by John, experiencing a helpless reaction, and his hands are held out to her. His lap is come to by her, and her doll is dropped at his feet."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The scene begins with John at the foot of the stairs, gasping and looking up. Preacher sits opposite John, whose expression turns helpless under a bar of light from the door. Realizing his mistake, John covers his mouth, looks at Preacher, then stiffens, relaxes, and chuckles briefly. He moves towards vibrating stairs as an engine sound recedes, revealing Icey’s skirts in the background. Icey appears surprised, waves after the car, and exits hurriedly. Preacher points to the window as she struggles and whimpers, expecting a gentle touch. Startled, yet tender, she adjusts the shade while watching the bed, smiling maternally. The camera pans to her sitting on the bed's edge, removing her mules, while Preacher turns with the bedsprings creaking. His quiet, cold voice contrasts with Willa's moaning into her pillow. Preacher snaps on a harsh bulb; Willa obeys, hesitates at the mirror, seeing her image with the bulb centered above. Her mouth trembles in silence as Preacher observes, turning off the light before bed. In darkness, Willa prays, eyes uplifted. Money spills from an open case on the arbor bricks, a breeze playing with it, as snipping sounds are heard. The camera tilts up to show her finishing a paper doll from a hundred-dollar bill, placing it beside a male counterpart. Guilt-ridden, Pearl gathers money as John's off-screen footsteps approach. Dumb with horror, he watches her collect the money. Standing at the arbor's end, he spots Preacher’s gleaming watch-chain, as paper dolls drift past. John's uncontrollable laughter bursts forth, and he extends his hands to her. She approaches, dropping her doll at his feet."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The scene begins with John gasping at the stairs. Preacher sits across from John, whose face is lit by a bar of light, displaying John's helplessness over his folly. John covers his mouth, looks at Preacher, stiffens, relaxes, and chuckles softly. As John heads for the vibrating stairs, Icey's pristine skirts appear, waving after a departing car. Icey hustles away, silenced by a hand over her mouth. She struggles, expecting a loving gesture, but Preacher points to the window. Startled, then tender, she adjusts the shade while watching the bed with a maternal smile. As the shot widens to the bed, she sits, removes her mules, and Preacher turns away with creaking bedsprings. Willa moans quietly as Preacher's voice is cold. Willa hesitates, meets her reflection, drops her head. The light snaps off; Preacher gets into bed as Willa remains still, praying silently in the dark. Money spills from a fallen object on the bricks as a breeze toys with it, and snipping sounds off-screen. The camera reveals her cutting a paper doll from a hundred-dollar bill, laying it beside a male doll. Pearl gathers money, startled, as John's footsteps approach. John, horrified, watches her and gathers her into his lap as paper dolls blow past."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The scene begins with a captivating visual of the bottom of the stairs coming into view as John, breathless and wide-eyed, gazes upwards with anticipation. Preacher observes John intently, while John, overwhelmed by the moment, collapses onto the edge of a nearby chair, with Preacher settling into a seat directly across from him. A distinct bar of light, streaming in from the open door, illuminates Preacher's visage, prompting a reaction of questioning helplessness from John. He remains motionless for a moment, recognizing the folly of his own actions. He covers his mouth with his hand as if to silence his thoughts and then looks back up at Preacher. A range of emotions washes over him as he initially stiffens with tension, then relaxes, and finally lets out a soft, introspective chuckle.\n\nJohn makes his way toward the stairs, which begin to tremble slightly, vibrating with the sound of an engine fading into the distance, as they move out of the shot. This movement reveals Icey's skirts in the background, meticulously arranged and appearing immaculate. Even her shoes are immaculate, as they wave with confused gestures after the now-departing car. Icey quickly moves out of view just as his hand clasps firmly over her mouth. She reacts instinctively, struggling and emitting a soft whimper. Her hand rises in expectation, hoping for a gentle handclasp, but instead, Preacher gestures pointedly toward the window. Taken aback at first, she then becomes tender and moves to adjust the shade, her gaze constantly shifting towards the bed, her smile imbued with maternal warmth.\n\nAs the shot shifts and expands into a full view of the bed, she approaches with a gentle grace, sits delicately on the edge, and slides off her mules. Meanwhile, Preacher turns away, with the sound of bedsprings subtly echoing as he does. His voice, though soft, carries a coldness as Willa rests her face onto the pillow, emitting a low moan. Preacher abruptly switches on a stark, glaring bare bulb hanging from the center of the room, and she complies with its harsh illumination. Willa hesitates momentarily, then drifts over to the mirror, confronting her own reflection and allowing her head to drop in contemplation. In a close-up of her face, Willa is seen with the bulb suspended centrically, and Preacher, donned in his nightshirt, stands silently beyond. Her lips tremble, unable to form words, her mouth merely opening in an attempt. He observes her fleetingly, then turns off the light and slips silently into bed. Left in the consuming darkness, Willa remains still and serene, folding her hands in a prayerful gesture, lifting her eyes heavenward.\n\nOutside, the scene transitions to an object lying face-down on the path of arbor bricks, its back gaping open, with money spilling out and a delicate breeze playfully toying with the bills. Off-screen, the sound of snipping can be heard, adding to the atmosphere. The camera gradually tilts upward to an image where she, positioned at the grape-arbor's end, finishes cutting a skirted paper doll from a hundred-dollar bill, placing it gently next to a male counterpart fashioned from another hundred-dollar bill, which she pats with affection. Pearl, caught off guard and feeling guilty, glances toward him while hurriedly gathering the scattered money as John's footsteps echo off-screen. As he bends down toward her, stricken with horror, she continues to gather the money in a hurried manner. He stands poignantly at the distant end of the arbor, where the gleam of Preacher's watch-chain catches the light. Slowly, the camera closes in on this image until only the utter stillness remains, as the paper dolls flutter past him. Overcome with emotion, John begins to laugh uncontrollably, experiencing a reaction of helplessness, and he reaches his hands out toward her. She approaches, settling into his lap and letting her doll slip from her grasp, landing softly at his feet."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The scene unfolds with an enthralling visual, capturing the bottom of the stairway as John, filled with breathless anticipation and wide-eyed wonder, stares upwards. Preacher, with a focused gaze, watches John intently. Overcome by the weight of the moment, John collapses onto the edge of a nearby chair, while Preacher takes a seat directly opposite him. A noticeable bar of light, streaming in through the open doorway, casts an illuminating glow on Preacher's face, provoking a response of questioning helplessness from John. He remains immobile for a brief moment, acknowledging the folly of his own recent actions. As if to stifle his own thoughts, he covers his mouth with his hand and then lifts his eyes back to Preacher. A tide of emotions courses through him as he initially tenses with anxiety, then relaxes, ultimately leading to a soft, introspective chuckle that escapes him. \n\nJohn continues on his path toward the stairs, which begin to tremble and vibrate subtly, echoing with the fading sound of an engine as it disappears into the distance and moves out of view. This action brings Icey's skirts into the background, meticulously arranged and appearing pristine. Even her shoes maintain an immaculate appearance as they sway with confused gestures at the now-departing vehicle. Just as his hand clasps firmly over her mouth, Icey swiftly retreats from view. She instinctively struggles, emitting a muted whimper. Her hand rises in hopeful anticipation of a gentle handclasp but is instead met with Preacher's pointed gesture toward the window. Initially startled, she then softens and adjusts the shade, her gaze drifting to the bed, her maternal smile radiating warmth.\n\nAs the focus shifts and expands to encompass a full view of the bed, she approaches with gentle grace, seating herself delicately on the edge, and glides off her mules with ease. Meanwhile, Preacher averts his gaze, as the sound of bedsprings echoes subtly. His voice, though low and gentle, carries a hint of coldness as Willa lowers her face onto the pillow, releasing a quiet moan. Preacher suddenly switches on a stark, glaring bare bulb hanging from the room's center, bathing her in its harsh illumination. Willa hesitates briefly, then moves over to the mirror, confronting her own reflection and letting her head fall in deep contemplation. In a close-up view of her face, Willa is observed with the bulb suspended centrally, and Preacher, attired in his nightshirt, stands beyond in silence. Her lips tremble, unable to form words as her mouth opens in an attempt. He regards her briefly, switching off the light, and slips silently into bed. In the encompassing darkness, Willa remains still and serene, her hands folded in a prayerful gesture, eyes lifted toward the heavens.\n\nOutside, the scene transitions to an object lying face-down on the path of arbor bricks, its back opened wide, with money spilling forth while a gentle breeze toys playfully with the bills. Off-screen, a snipping sound adds to the atmosphere. The camera gradually tilts upward to reveal her at the grape-arbor's end, finishing the cutting of a skirted paper doll from a hundred-dollar bill and placing it next to a male counterpart crafted from another hundred-dollar bill, patting it with affection. Pearl, caught unawares and feeling guilty, glances towards him while hastily gathering the scattered money as John's footsteps sound off-screen. As he bends down toward her, filled with horror, she continues gathering the money in a hurried manner. He stands poignantly at the arbor's distant end, where the gleam of Preacher's watch-chain catches the light. Slowly, the camera draws closer to this image until only silence remains, as the paper dolls flutter past him. Overwhelmed by emotion, John begins to laugh uncontrollably, experiencing a reaction of helplessness, reaching his hands out toward her. She approaches, settling into his lap and allowing her doll to slip gently from her grasp, landing softly at his feet."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The scene begins as the camera focuses on the bottom of the stairs, where John stands gasping, directing his gaze upward. In response, Preacher fixes his eyes on John, who slowly lowers himself onto the edge of a chair, feeling the weight of the moment, while Preacher assumes a position opposite him. A sliver of light from the partially open door casts a strip across Preacher's face, prompting John to display a subtle expression of questioning helplessness. In this moment of stillness, John becomes acutely aware of his own foolishness, instinctively raises his hand to cover his mouth, and shifts his gaze back up to Preacher. He undergoes a series of emotions—first stiffening, then relaxing, and ultimately breaking into a soft chuckle. With a newfound resolve, John makes his way toward the stairs, which seem to quiver and then disappear from view as the sound of a departing engine fades, revealing Icey's skirts in the background, pristine and neatly adorned, even with shoes. Icey waves confusedly after the retreating car before swiftly exiting the frame as a hand clamps over her mouth, causing her to struggle and whimper. The hand then releases, allowing her to reach out, expecting a gentle hand-clasp, but instead, Preacher points her attention to the window. Initially startled, her expression shifts to one of tender affection as she moves to adjust the window shade, her eyes constantly darting toward the bed, where she smiles maternally. As the camera pulls back, capturing a full shot of the bed, she gracefully approaches, lowers herself onto the edge, and removes her mules while Preacher, with a creaking of bedsprings, turns his back to her. His voice is quiet, yet chilling, as Willa places her face down on the pillow, releasing a moan. Abruptly, Preacher flicks on a harsh, bare bulb hanging centrally in the room, causing Willa to hesitate. She rises and moves toward the mirror, confronting her reflection and allowing her head to fall in resignation. The camera captures a close-up of Willa's face, framed by the hanging bulb, with Preacher, in his nightshirt, standing in the background. Her mouth quivers, unable to form words, barely opening in silence. Preacher, after a brief, assessing gaze, extinguishes the light and slips into bed. Left in darkness, Willa remains motionless, folding her hands in prayer and lifting her eyes upward. Meanwhile, something lies face-down on the arbor bricks, its back agape, releasing money that flutters playfully in the breeze accompanied by the sound of off-screen snipping. The camera shifts upward, showing her at the arbor's end, completing the meticulous cutting of a skirted paper doll from a hundred-dollar bill, which she lays beside a male counterpart, affectionately patting it. Pearl, caught off guard, glances toward him, hastily gathering the scattered money as John's footsteps echo from off-screen. As John bends down, paralyzed with horror, Pearl persistently collects the money. Standing at the arbor's far end, John's eyes catch the gleam of Preacher's watch-chain. The frame tightens slowly on the chain, maintaining stillness while the paper dolls drift past. Overcome by a fit of uncontrollable laughter, John experiences a helpless reaction, extending his hands toward Pearl. She approaches and climbs onto his lap, releasing her paper doll, which falls to the ground at his feet."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The scene opens with John noticing the stairs and gasping as he looks upward. He and Preacher exchange glances before John sits down, visibly perplexed. As Preacher takes a seat, a beam of light from the door highlights his face, prompting a questioning reaction from John. Realizing his own mistake, John covers his mouth, looks at Preacher, and then chuckles softly after composing himself. Deciding to leave, John heads for the stairs, only to hear a car engine fading as Icey's skirts come into view in the background. Presentable and wearing shoes, she waves confusedly at the departing car before being silenced by someone clamping a hand over her mouth. As she struggles and whimpers, a hand gesture from Preacher directs her attention to the window. Startled but tender, she adjusts the shade, glancing toward the bed with a maternal smile. The camera widens to reveal her sitting on the bed, removing her mules, while Preacher turns away, triggering bedspring sounds. With a cold, quiet voice, Preacher addresses Willa, who buries her face in the pillow and moans. He turns on a harsh light, prompting Willa to hesitate and then walk to the mirror, confronting her reflection as her head drops. In close-up, Willa's trembling mouth is seen, unable to speak as Preacher stands beyond the hanging bulb. After watching her, he turns off the light and gets into bed, leaving Willa in darkness to fold her hands in prayer. Meanwhile, money spills onto the bricks of an arbor, a breeze playing with it as snipping is heard off-screen. The camera reveals Pearl cutting a skirted paper doll from a hundred-dollar bill and placing it beside a male counterpart. Alarmed by John's approaching footsteps, Pearl scrambles to gather the money. John's horror-stricken stance at the arbor's end, where Preacher's watch-chain gleams, captures a still moment. As paper dolls drift past him, John experiences uncontrollable laughter, holding his hands out to Pearl as she approaches, dropping her doll at his feet."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The scene opens with the bottom of the stairs visible as John gasps, peering upward. In this dimly lit setting reminiscent of classic film noir, Preacher, a figure known for his manipulative and authoritative presence, looks at John, who sinks onto the edge of a chair designed in the style popular in mid-20th-century American homes. Preacher sits opposite. A bar of light from the door, reminiscent of the stark lighting used in dramatic cinematography, falls across Preacher's face, and John reacts with a questioning helplessness. John remains still, realizes his own folly, an emotion often linked to tragic protagonists in literature, covers his mouth with his hand, and looks up at Preacher, then stiffens, relaxes, and chuckles softly, a sign of nervous release. John starts for the stairs, which vibrate and move out of shot with the sound of a receding engine, suggesting a departure or escape, disclosing Icey's skirts in the background. Icey, known for her traditional values and appearance, keeps her skirts spic-and-span, even wearing shoes that reflect her attention to detail, and wave bewilderedly after the car. She hustles out of the shot as his hand clamps over her mouth, an action indicating control and silence. She struggles and whimpers. His hand rises as she puts out her own, expecting a loving hand-clasp, a gesture of anticipated comfort, but Preacher points to the window. Startled, then tender, indicative of a shift from fear to tenderness, she moves to adjust the shade, always looking toward the bed, smiling maternally in the way a mother tends to a child. As the shot pulls back and pans into a full shot of the bed, a common symbol of intimacy and vulnerability, she approaches, sits on the edge, and slips off her mules, which are often chosen for their ease and comfort, while Preacher turns, his back to her, with a sounding of bedsprings. His voice is quiet and cold as Willa puts her face down on the pillow and moans, suggesting emotional or physical discomfort. Preacher snaps on a harsh bare bulb in the center of the room; this type of lighting often creates a stark, unforgiving atmosphere that she obeys. Willa hesitates, walks to the mirror, an object associated with self-reflection and truth, meets her image, her head dropping. In a head close-up, Willa is seen with the bulb hanging at the center, casting a shadow that emphasizes her emotional turmoil, and Preacher, in his nightshirt, stands beyond it. Her mouth trembles, unable to speak, merely opening her mouth. He watches her for a moment, then snaps off the light and gets into bed. Willa, in darkness, remains motionless, folds her hands in prayer, and lifts her eyes. The cash, lying face-down on the arbor bricks, which may symbolize the disarray in their lives, back wide open, money spilling out as a little breeze toys with it, alongside the sound of snipping heard off-screen, reflecting an act of defacement or rebellion. The camera tilts upward to a view where she, at the end of the grape-arbor, often associated with abundance and secrecy, finishes cutting a skirted paper doll out of a hundred-dollar bill and lays it beside a male hundred-dollar paper doll, which she pats, a symbolic act that belies innocence and guilt. Pearl starts guiltily, looks toward him, scrambling the money together as John's footsteps, indicating his arrival or looming presence, are heard off-screen. As he stoops toward her, dumb with horror, a common cinematic expression for disbelief, she continues gathering the money. He stands at the far end of the arbor, where Preacher's watch-chain gleams, its shine suggesting the passage of time and control. The shot slowly closes down on it until stillness as the paper dolls blow past him. John starts to laugh uncontrollably, experiencing a helpless reaction often linked to madness or relief, and he holds his hands out to her. She comes to his lap, dropping her doll at his feet, indicating a surrender or a return to innocence."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The scene opens with the bottom of the stairs visible as John gasps peering upward. Preacher looks at John who sinks onto the edge of a chair as Preacher sits opposite. A bar of light from the door falls across Preacher's face and John reacts with a questioning helplessness. John remains still realizes his own folly covers his mouth with his hand and looks up at Preacher then stiffens relaxes and chuckles softly. John starts for the stairs which vibrate and move out of shot with the sound of a receding engine disclosing Icey's skirts in the background. They appear spicandspan even wearing shoes and wave bewilderedly after the car. She hustles out of the shot as his hand clamps over her mouth. She struggles and whimpers. His hand rises as she puts out her own expecting a loving handclasp but Preacher points to the window. Startled then tender she moves to adjust the shade always looking toward the bed smiling maternally. As the shot pulls back and pans into a full shot of the bed she approaches sits on the edge and slips off her mules while Preacher turns his back to her with a sounding of bedsprings. His voice is quiet and cold as Willa puts her face down on the pillow and moans. Preacher snaps on a harsh bare bulb in the center of the room she obeys. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Willa hesitates walks to the mirror meets her image her head dropping. In a head closeup. Willa is seen with the bulb hanging at the center and Preacher in his nightshirt stands beyond it. Her mouth trembles unable to speak merely opening her mouth. He watches her for a moment then snaps off the light and gets into bed. Willa in darkness remains motionless folds her hands in prayer and lifts her eyes. It lies facedown on the arbor bricks back wide open money spilling out as a little breeze toys with it alongside the sound of snipping heard offscreen. The camera tilts upward to a view where she at the end of the grapearbor finishes cutting a skirted paper doll out of a hundreddollar bill and lays it beside a male hundreddollar paper doll which she pats. Pearl starts guiltily looks toward him scrambling the money together as John's footsteps are heard offscreen. As he stoops toward her dumb with horror she continues gathering the money. He stands at the far end of the arbor where Preacher's watchchain gleams. The shot slowly closes down on it until stillness as the paper dolls blow past him. John starts to laugh uncontrollably experiencing a helpless reaction and he holds his hands out to her. She comes to his lap dropping her doll at his feet."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The scene opens with the bottom of the stairs visible as John gasps peering upward. Preacher looks at John who sinks onto the edge of a chair as Preacher sits opposite. A bar of light from the door falls across Preacher's face and John reacts with a questioning helplessness. John remains still realizes his own folly covers his mouth with his hand and looks up at Preacher then stiffens relaxes and chuckles softly. John starts for the stairs which vibrate and move out of shot with the sound of a receding engine disclosing Icey's skirts in the background. They appear spicandspan even wearing shoes and wave bewilderedly after the car. She hustles out of the shot as his hand clamps over her mouth. She struggles and whimpers. His hand rises as she puts out her own expecting a loving handclasp but Preacher points to the window. Startled then tender she moves to adjust the shade always looking toward the bed smiling maternally. As the shot pulls back and pans into a full shot of the bed she approaches sits on the edge and slips off her mules while Preacher turns his back to her with a sounding of bedsprings. His voice is quiet and cold as Willa puts her face down on the pillow and moans. Preacher snaps on a harsh bare bulb in the center of the room she obeys. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Willa hesitates walks to the mirror meets her image her head dropping. In a head closeup. Willa is seen with the bulb hanging at the center and Preacher in his nightshirt stands beyond it. Her mouth trembles unable to speak merely opening her mouth. He watches her for a moment then snaps off the light and gets into bed. Willa in darkness remains motionless folds her hands in prayer and lifts her eyes. It lies facedown on the arbor bricks back wide open money spilling out as a little breeze toys with it alongside the sound of snipping heard offscreen. The camera tilts upward to a view where she at the end of the grapearbor finishes cutting a skirted paper doll out of a hundreddollar bill and lays it beside a male hundreddollar paper doll which she pats. Pearl starts guiltily looks toward him scrambling the money together as John's footsteps are heard offscreen. As he stoops toward her dumb with horror she continues gathering the money. He stands at the far end of the arbor where Preacher's watchchain gleams. The shot slowly closes down on it until stillness as the paper dolls blow past him. John starts to laugh uncontrollably experiencing a helpless reaction and he holds his hands out to her. She comes to his lap dropping her doll at his feet."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The scene opens with the bottom of the stairs visible as John gasps peering upward. Preacher looks at John who sinks onto the edge of a chair as Preacher sits opposite. A bar of light from the door falls across Preacher's face and John reacts with a questioning helplessness. John remains still realizes his own folly covers his mouth with his hand and looks up at Preacher then stiffens relaxes and chuckles softly. John starts for the stairs which vibrate and move out of shot with the sound of a receding engine disclosing Icey's skirts in the background. They appear spicandspan even wearing shoes and wave bewilderedly after the car. She hustles out of the shot as his hand clamps over her mouth. The camera tilts upward to a view where she at the end of the grapearbor finishes cutting a skirted paper doll out of a hundreddollar bill and lays it beside a male hundreddollar paper doll which she pats. Pearl starts guiltily looks toward him scrambling the money together as John's footsteps are heard offscreen. As he stoops toward her dumb with horror she continues gathering the money. He stands at the far end of the arbor where Preacher's watchchain gleams. The shot slowly closes down on it until stillness as the paper dolls blow past him. John starts to laugh uncontrollably experiencing a helpless reaction and he holds his hands out to her. She comes to his lap dropping her doll at his feet."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The scene opens with the bottom of the stairs visible as John gasps peering upward. Preacher looks at John who sinks onto the edge of a chair as Preacher sits opposite. A bar of light from the door falls across Preacher's face and John reacts with a questioning helplessness. The shot slowly closes down on it until stillness as the paper dolls blow past him. John starts to laugh uncontrollably experiencing a helpless reaction and he holds his hands out to her. She comes to his lap dropping her doll at his feet."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The sequence begins with the base of the escalator coming into view as Maria snorts, scanning downward. Librarian glances at Maria, who floats onto the top of a bench as Librarian stands adjacent. A flicker of shadow from the window dances across Librarian's forehead, and Maria responds with an inquisitive certainty. Maria stays motionless, grasps her own wisdom, covers her ears with her elbows, and gazes down at Librarian, then slumps, tenses, and yawns loudly. Maria dashes for the elevator, which shudders and glides out of focus with the noise of an approaching helicopter, revealing Leo's trousers in the foreground. They seem grimy, barefoot and all, and leap enthusiastically before the train. He trundles into the scene as her foot plants over his nose. He wrestles and howls. Her foot descends as he reaches out his arm, anticipating a gentle handshake, but Librarian gestures to the doorway. Alarmed, then joyful, he proceeds to fix the curtain, perpetually gazing away from the crib, grinning paternally. As the shot zooms forward and shifts into a full image of the sofa, he retreats, perches on the top, and slips on his boots while Librarian swivels, facing her, with a creaking of ropes. Her tone is loud and warm as Alex lifts his foot off the cushion and hums. Librarian flicks on a gentle shaded lamp in the corner of the space; he ignores it. Alex ponders, crawls to the closet, confronts his reflection, his eyes lifting. In a close-up of his face, Alex is revealed with the lamp hanging at the periphery, and Librarian, in her blazer, sits beneath it. His lips curl, whispering words, barely uttering a syllable. She observes him for a second, then extinguishes the lamp and exits the room. Alex, in light, stays active, spreads his fingers, and lowers his head. It sits face-up on the garden stones, front tightly closed, coins spilling in as a gentle wind plays with it, along with the sound of humming heard on-screen. The lens pans downward to a view where he, at the beginning of the apple-orchard, commences carving a patterned wooden horse from a ten-pound note and places it atop a female ten-pound wooden horse, which he pats. Ruby pauses deliberately, peers beyond her, dispersing the coins apart as Maria's whispers are heard on-screen. As she kneels away from him, frozen with delight, he persists in scattering the coins. She kneels at the near side of the orchard, where Librarian's hat-ribbon glimmers. The scene gently opens up to encompass it until motion as the wooden horses fly past her. Maria begins to sigh restrainedly, feeling a confident sensation, and she hides her head under his arm. He rushes to her arms, tossing his horse into her lap."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The scene begins with John at the bottom of the stairs, gasping as he looks upward. Preacher sits across from John, who, feeling foolish, chuckles softly and starts for the stairs, which vibrate with the sound of a departing engine. Icey, appearing well-dressed, waves after the car, but Preacher’s hand silences her. She hesitantly adjusts the shade, glancing tenderly towards the bed where Preacher turns with cold quietness as Willa moans into her pillow. Preacher snaps on a harsh light; Willa hesitates at the mirror, trembling. Preacher joins her in bed, leaving her in darkness, praying quietly. Outside, hundred-dollar bills lie scattered, with Pearl cutting paper dolls from them, startled by John's approach. As John reaches her, horrified, she hurriedly gathers the money. He stands, stunned, near Preacher's watch-chain, as paper dolls drift past him. John begins to laugh uncontrollably and reaches out to Pearl, who drops her doll and goes to him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She comes to his lap dropping her doll at his feet John starts to laugh uncontrollably experiencing a helpless reaction and he holds his hands out to her The shot slowly closes down on it until stillness as the paper dolls blow past him He stands at the far end of the arbor where Preacher's watchchain gleams As he stoops toward her dumb with horror she continues gathering the money Pearl starts guiltily looks toward him scrambling the money together as John's footsteps are heard offscreen The camera tilts upward to a view where she at the end of the grapearbor finishes cutting a skirted paper doll out of a hundreddollar bill and lays it beside a male hundreddollar paper doll which she pats It lies facedown on the arbor bricks back wide open money spilling out as a little breeze toys with it alongside the sound of snipping heard offscreen Willa in darkness remains motionless folds her hands in prayer and lifts her eyes He watches her for a moment then snaps off the light and gets into bed Her mouth trembles unable to speak merely opening her mouth Willa is seen with the bulb hanging at the center and Preacher in his nightshirt stands beyond it In a head closeup Willa hesitates walks to the mirror meets her image her head dropping Preacher snaps on a harsh bare bulb in the center of the room she obeys His voice is quiet and cold as Willa puts her face down on the pillow and moans As the shot pulls back and pans into a full shot of the bed she approaches sits on the edge and slips off her mules while Preacher turns his back to her with a sounding of bedsprings Startled then tender she moves to adjust the shade always looking toward the bed smiling maternally His hand rises as she puts out her own expecting a loving handclasp but Preacher points to the window She struggles and whimpers She hustles out of the shot as his hand clamps over her mouth They appear spicandspan even wearing shoes and wave bewilderedly after the car John starts for the stairs which vibrate and move out of shot with the sound of a receding engine disclosing Icey's skirts in the background John remains still realizes his own folly covers his mouth with his hand and looks up at Preacher then stiffens relaxes and chuckles softly A bar of light from the door falls across Preacher's face and John reacts with a questioning helplessness Preacher looks at John who sinks onto the edge of a chair as Preacher sits opposite The scene opens with the bottom of the stairs visible as John gasps peering upward"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Preacher looks at John who sinks onto the edge of a chair as Preacher sits opposite The scene opens with the bottom of the stairs visible as John gasps peering upward John remains still realizes his own folly covers his mouth with his hand and looks up at Preacher then stiffens relaxes and chuckles softly A bar of light from the door falls across Preacher's face and John reacts with a questioning helplessness They appear spicandspan even wearing shoes and wave bewilderedly after the car John starts for the stairs which vibrate and move out of shot with the sound of a receding engine disclosing Icey's skirts in the background She struggles and whimpers She hustles out of the shot as his hand clamps over her mouth Startled then tender she moves to adjust the shade always looking toward the bed smiling maternally His hand rises as she puts out her own expecting a loving handclasp but Preacher points to the window His voice is quiet and cold as Willa puts her face down on the pillow and moans As the shot pulls back and pans into a full shot of the bed she approaches sits on the edge and slips off her mules while Preacher turns his back to her with a sounding of bedsprings Willa hesitates walks to the mirror meets her image her head dropping Preacher snaps on a harsh bare bulb in the center of the room she obeys Willa is seen with the bulb hanging at the center and Preacher in his nightshirt stands beyond it In a head closeup He watches her for a moment then snaps off the light and gets into bed Her mouth trembles unable to speak merely opening her mouth It lies facedown on the arbor bricks back wide open money spilling out as a little breeze toys with it alongside the sound of snipping heard offscreen Willa in darkness remains motionless folds her hands in prayer and lifts her eyes Pearl starts guiltily looks toward him scrambling the money together as John's footsteps are heard offscreen The camera tilts upward to a view where she at the end of the grapearbor finishes cutting a skirted paper doll out of a hundreddollar bill and lays it beside a male hundreddollar paper doll which she pats He stands at the far end of the arbor where Preacher's watchchain gleams As he stoops toward her dumb with horror she continues gathering the money John starts to laugh uncontrollably experiencing a helpless reaction and he holds his hands out to her The shot slowly closes down on it until stillness as the paper dolls blow past him She comes to his lap dropping her doll at his feet"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "In a head closeup Willa is seen with the bulb hanging at the center and Preacher in his nightshirt stands beyond it Her mouth trembles unable to speak merely opening her mouth He watches her for a moment then snaps off the light and gets into bed Willa in darkness remains motionless folds her hands in prayer and lifts her eyes It lies facedown on the arbor bricks back wide open money spilling out as a little breeze toys with it alongside the sound of snipping heard offscreen The camera tilts upward to a view where she at the end of the grapearbor finishes cutting a skirted paper doll out of a hundreddollar bill and lays it beside a male hundreddollar paper doll which she pats Pearl starts guiltily looks toward him scrambling the money together as John's footsteps are heard offscreen As he stoops toward her dumb with horror she continues gathering the money He stands at the far end of the arbor where Preacher's watchchain gleams The shot slowly closes down on it until stillness as the paper dolls blow past him John starts to laugh uncontrollably experiencing a helpless reaction and he holds his hands out to her She comes to his lap dropping her doll at his feet The scene opens with the bottom of the stairs visible as John gasps peering upward Preacher looks at John who sinks onto the edge of a chair as Preacher sits opposite A bar of light from the door falls across Preacher's face and John reacts with a questioning helplessness John remains still realizes his own folly covers his mouth with his hand and looks up at Preacher then stiffens relaxes and chuckles softly John starts for the stairs which vibrate and move out of shot with the sound of a receding engine disclosing Icey's skirts in the background They appear spicandspan even wearing shoes and wave bewilderedly after the car She hustles out of the shot as his hand clamps over her mouth She struggles and whimpers His hand rises as she puts out her own expecting a loving handclasp but Preacher points to the window Startled then tender she moves to adjust the shade always looking toward the bed smiling maternally As the shot pulls back and pans into a full shot of the bed she approaches sits on the edge and slips off her mules while Preacher turns his back to her with a sounding of bedsprings His voice is quiet and cold as Willa puts her face down on the pillow and moans Preacher snaps on a harsh bare bulb in the center of the room she obeys Willa hesitates walks to the mirror meets her image her head dropping"
        }
      ]
    }
  ]
}