{
  "ground_truth": "He looks at his phone as his co-worker enters, and later, he approaches his co-worker in the garage. More co-workers step out and include Sandy in a circle, and wide-eyed, Sandy glances at his co-workers. Staring down, a smile creeps across Sandy's face as he considers, then he raises his gaze and nods. Now, Sandy's daughter kicks a soccer ball off a field, and her mother cheers from the sidelines. Sandy approaches his wife, who jumps back with surprise, and he speaks to her with his hands gently holding her face. Holding her hand over her mouth, she jumps with joy and gives Sandy a hug, then he smiles and lifts her off her feet. Now, the plump identity thief sips from a straw as she rides down an escalator; at a store, she tries on a ring, now in cosmetics, and two women laugh as they watch the cosmetics girl apply makeup to the redhead. At a cell phone kiosk, the man smiles. At the center of the mall, a mother and daughter sit on a jet ski, and the redhead buys it. At a Brookstone, she sleeps on a massage chair with her open mouth drooling, and an employee approaches, pokes her, then she sorts through a stack of Sandy's cards. Now, Sandy and his daughters brush their teeth, and in his car, Sandy smiles and bobs his head as he taps his thumbs on the steering wheel. He glances down at the dashboard, where the low-gas light blinks on, and his smile fades as he pulls into a gas station. At the pump, Sandy puts in his credit card, holds the card to his mouth, breathes on the strip, then wipes the card on his jacket and pushes the card in again. Inside, the attendant stands behind a clear protective glass, talking on an earpiece; the attendant swipes the card and talks into his earpiece, then points to his earpiece and slides Sandy the cut card. Now, in Sandy's car, a police car pulls up behind him, and officers emerge from the cruiser; Sandy peeks out the window as one of the officers approaches while the other officer stands back with his hand by his sidearm. The detective touches his phone, and now the detective returns with a file and hands Sandy the thief's haggard mug shot, leaving Sandy shaking his head. Now, the family man parks a Subaru, enters a modern office and passes a company logo, goes to a glass door, and pushes it open. He admires his new office as his former coworker, now new boss, approaches, and four cops stand at reception. Later, as men put lids on boxes, the lead detective approaches Sandy and his boss; Sandy faces his boss, who turns to the detective.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He observes at his mobile as his colleague arrives, and afterward, he contacts his colleague in the parking area. More colleagues emerge and involve Sandy in a loop, and wide-eyed, Sandy peeks at his colleagues. Gazing downward, a grin sneaks across Sandy's visage as he contemplates, then he elevates his glance and acknowledges. Now, Sandy's offspring kicks a soccer sphere off a field, and her parent cheers from the sidelines. Sandy approaches his spouse, who recoils with astonishment, and he converses with her with his hands tenderly cradling her visage. Covering her hand over her mouth, she leaps with delight and gives Sandy an embrace, then he grins and lifts her off her feet. Now, the chubby identity swindler sips from a straw as she travels down an escalator; at a boutique, she tries on a band, now in cosmetics, and two females chuckle as they observe the cosmetics girl use makeup on the redhead. At a mobile kiosk, the gentleman grins. At the center of the mall, a parent and offspring perch on a jet ski, and the redhead purchases it. At a Brookstone, she dozes on a massage chair with her open mouth drooling, and an attendant approaches, prods her, then she sorts through a stack of Sandy's cards. Now, Sandy and his daughters cleanse their teeth, and in his vehicle, Sandy grins and bobs his head as he taps his digits on the steering wheel. He peeks downward at the dashboard, where the low-gas indicator flashes on, and his grin diminishes as he pulls into a gas station. At the pump, Sandy places in his credit card, holds the card to his mouth, exhales on the strip, then wipes the card on his jacket and inserts the card in again. Inside, the operator stands behind a transparent protective glass, speaking on an earpiece; the operator swipes the card and speaks into his earpiece, then points to his earpiece and slides Sandy the cut card. Now, in Sandy's vehicle, a patrol car pulls up behind him, and officers emerge from the cruiser; Sandy peeks out the window as one of the officers approaches while the other officer remains back with his hand by his sidearm. The detective touches his mobile, and now the detective returns with a dossier and hands Sandy the swindler's worn mug shot, leaving Sandy shaking his head. Now, the family man parks a Subaru, enters a contemporary office and passes a corporation logo, goes to a glass door, and pushes it open. He admires his novel office as his former coworker, now new superior, approaches, and four officers stand at reception. Later, as men place lids on cartons, the lead detective approaches Sandy and his superior; Sandy faces his superior, who turns to the detective."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "His phone is looked at by him as his co-worker enters, and later, his co-worker is approached by him in the garage. Sandy is included in a circle by more co-workers, and wide-eyed, his co-workers are glanced at by Sandy. Staring down, a smile creeps across Sandy's face as he considers, then his gaze is raised by him and a nod is given. Now, a soccer ball is kicked off a field by Sandy's daughter, and cheers are given by her mother from the sidelines. Sandy's wife is approached by him, who jumps back with surprise, and her face is gently held by his hands as he speaks to her. Holding her hand over her mouth, joy makes her jump, and Sandy is given a hug, then a smile is shown by him as she is lifted off her feet. Now, a straw is sipped from by the plump identity thief as she rides down an escalator; a ring is tried on by her at a store, now in cosmetics, and laughter is shared by two women as they watch the cosmetics girl apply makeup to the redhead. At a cell phone kiosk, a smile is shown by the man. At the center of the mall, a mother and daughter sit on a jet ski, and it is bought by the redhead. At a Brookstone, a massage chair is slept on by her with her open mouth drooling, and she is approached by an employee, who pokes her, then she sorts through a stack of Sandy's cards. Now, teeth are brushed by Sandy and his daughters, and in his car, a smile is worn by Sandy as his head bobs and his thumbs tap on the steering wheel. He glances down at the dashboard, where the low-gas light blinks on, and a fade is noticed in his smile as a gas station is pulled into by him. At the pump, his credit card is put in by Sandy, who holds the card to his mouth, breathes on the strip, then the card is wiped on his jacket by him and the card is pushed in again. Inside, a clear protective glass is stood behind by the attendant, who talks on an earpiece; the card is swiped by the attendant and he talks into his earpiece, then the earpiece is pointed to by him and Sandy is slid the cut card. Now, in Sandy's car, a police car pulls up behind him, and the cruiser is exited by officers; out the window is peeked by Sandy as one of the officers approaches while his hand is kept by the other officer by his sidearm. His phone is touched by the detective, and now the detective returns with a file and hands Sandy the thief's haggard mug shot, leaving Sandy shaking his head. Now, a Subaru is parked by the family man, a modern office is entered, a company logo is passed, a glass door is approached, and it is pushed open. His new office is admired by him as his former coworker, now new boss, approaches, and four cops stand at reception. Later, as lids are put on boxes by men, the lead detective approaches Sandy and his boss; his boss is faced by Sandy, who turns to the detective."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He looks at his phone as his co-worker arrives, then approaches him in the garage. More colleagues gather around Sandy in a circle; surprised, he smiles, then nods. Sandy's daughter kicks a soccer ball, and her mother cheers. Sandy approaches his wife, surprising her, and gently holds her face as he speaks. She joyfully hugs Sandy, who lifts her. Meanwhile, an identity thief sips a drink on an escalator, tries on a ring, and applies cosmetics, entertained by two women. At a cell phone kiosk, the man smiles. At the mall's center, a mother and daughter sit on a jet ski, which the redhead buys. In Brookstone, she snoozes on a massage chair, drooling until an employee nudges her, prompting her to sort through Sandy's cards. Sandy brushes his teeth with his daughters, and in his car, taps his thumbs on the steering wheel. His smile fades when the low-gas light blinks, as he reaches a gas station. At the pump, Sandy swipes his card, breathes on the strip, wipes it, and tries again. Inside, the attendant communicates through an earpiece, swipes the card, and returns a cut card to Sandy. A police car pulls up behind Sandy, and officers exit; one approaches while the other stands ready. The detective checks his phone, later returning with a file and the thief's mug shot, leaving Sandy frustrated. Now, Sandy parks a Subaru, enters a modern office, and admires his new space as his former co-worker, now boss, arrives and four cops stand at reception. Later, as boxes are sealed, the lead detective approaches Sandy and his boss, who turns to face him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He looks at his phone as his co-worker enters, later approaching him in the garage. More co-workers include Sandy in a circle, and he glances at them. A smile creeps across Sandy's face, and he nods. Sandy's daughter kicks a soccer ball, and her mother cheers. Sandy surprises his wife, speaks to her gently. She jumps with joy, hugs him, and he lifts her. The identity thief sips through a straw on an escalator; tries on a ring, and two women laugh as the cosmetics girl applies makeup to the redhead. A man smiles at a cell phone kiosk. A mother and daughter sit on a jet ski, and the redhead buys it. She sleeps on a massage chair at Brookstone; an employee pokes her, then she sorts Sandy's cards. Sandy and his daughters brush their teeth. In his car, Sandy taps the steering wheel, but his smile fades at the low-gas light and he pulls into a gas station. At the pump, Sandy struggles with his credit card. Inside, the attendant behind protective glass swipes the card, talks on an earpiece, and returns the cut card. A police car pulls up, officers approach. The detective gives Sandy the thief's mug shot, leaving him shaking his head. The family man parks a Subaru, enters an office, and admires it. His former coworker, now boss, approaches, as four cops stand at reception. Later, the lead detective approaches Sandy and his boss as men put lids on boxes."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He takes a moment to glance at his phone as his co-worker makes an entrance. A little later, he moves toward his co-worker in the spacious garage. As more co-workers come out, they bring Sandy into their group, forming a circle around him. With wide eyes, Sandy looks around at his colleagues. As he looks down, a small smile slowly appears on Sandy's face while he considers the situation. Then, he lifts his gaze and gives a knowing nod. Meanwhile, Sandy’s daughter energetically kicks a soccer ball off the field, while her mother excitedly cheers from the sidelines. Sandy walks over to his wife, who reacts with pleasant surprise, and he speaks to her softly, gently cradling her face with his hands. Overwhelmed with happiness, she covers her mouth with her hand, jumps with joy, and wraps Sandy in a warm hug, prompting him to smile as he lifts her off her feet in delight.\n\nMeanwhile, a slightly plump identity thief leisurely sips through a straw while riding an escalator. At a nearby store, she tries on a sparkling ring, then moves to the cosmetics section, where two women share laughter as they watch a cosmetics girl meticulously apply makeup to the redhead. At a cell phone kiosk, a man stands with a cheerful smile on his face. In the mall's central area, a mother and daughter are seated on a flashy jet ski, which the redhead soon decides to purchase. Over at a Brookstone store, the redhead relaxes on a massage chair, her mouth agape and drooling, when an employee approaches, gives her a gentle nudge, and then she begins sorting through a stack of Sandy’s cards.\n\nNow, we see Sandy brushing his teeth alongside his daughters. Later, in his car, he smiles and bobs his head rhythmically, tapping his thumbs on the steering wheel to an imaginary beat. His gaze shifts to the dashboard, where the low-gas indicator begins blinking, causing his smile to fade as he drives into a gas station. At the pump, Sandy inserts his credit card, then holds it to his mouth, breathing on its strip, before wiping it clean on his jacket and trying the card once more. Inside the station, the attendant stands behind protective glass, engaged in conversation using an earpiece. The attendant swipes the card, speaks into his earpiece, and then gestures to it, returning the now cut card to Sandy. Sitting in Sandy’s car, a police car suddenly pulls up behind him, and officers step out; Sandy tentatively peeks out his window as one officer approaches while the other officer stays back, his hand hovering near his sidearm. The detective taps his phone, and then returns with a file, handing Sandy the thief's worn mug shot, leaving Sandy shaking his head in disbelief.\n\nLater on, the family man parks his Subaru, enters a sleek, modern office, and walks past the prominent company logo, heading toward a glass door that he pushes open. He takes a moment to admire his new office space as his former co-worker, who is now his new boss, approaches him, while four police officers stand near the reception desk. Eventually, as workers place lids on boxes, the lead detective makes his way over to Sandy and his boss; Sandy faces his boss, who then turns to engage with the detective."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He pauses for a brief moment, taking the time to glance at his phone screen as his co-worker makes a noticeable entrance. A short while later, he moves decisively toward his co-worker in the expansive and spacious garage area. As additional co-workers gradually emerge, they encircle Sandy, bringing him into their group, forming a close-knit circle around him. Sandy glances around at his colleagues with wide, curious eyes. As he lowers his gaze, a small, gentle smile slowly spreads across Sandy's face while he thoughtfully considers the situation unfolding before him. Then, he lifts his head and offers a knowing nod in acknowledgment. Meanwhile, Sandy’s lively daughter energetically kicks a soccer ball off the field, while her enthusiastic mother cheers from the sidelines with excitement. Sandy makes his way over to his wife, who reacts with pleasant surprise, and he speaks to her softly, all the while gently cradling her face with his hands. Overwhelmed with sheer happiness, she covers her mouth with her hand, jumps with joy, and embraces Sandy in a warm, heartfelt hug, causing him to smile broadly as he lifts her off her feet in delight.\n\nMeanwhile, an identity thief with a slightly plump appearance leisurely sips through a straw while riding an escalator with nonchalance. Nearby, at a store, she tries on a sparkling, eye-catching ring, then moves over to the cosmetics section, where two women share laughter as they observe a cosmetics girl meticulously applying makeup to the redhead. At a cell phone kiosk, a man stands with a cheerful smile on his face, radiating positivity. In the mall's central area, a mother and daughter are seated on a flashy, attention-grabbing jet ski, which the redhead soon decides to purchase with excitement. Over at a Brookstone store, the redhead relaxes on a massage chair with her mouth agape and drooling in contentment, when an employee approaches her, gives her a gentle nudge, and then she begins sorting through a stack of cards belonging to Sandy.\n\nWe then transition to Sandy, who we now see brushing his teeth alongside his daughters. Later, in his car, he smiles and rhythmically bobs his head, tapping his thumbs in tune on the steering wheel to an imaginary beat. His gaze shifts to the car's dashboard, where the low-gas indicator begins blinking, causing his smile to fade as he drives into a nearby gas station. At the gas pump, Sandy inserts his credit card, then breathes on its strip, wiping it clean on his jacket before attempting to use the card once more. Inside the station, the attendant stands behind protective glass, engaged in a conversation using an earpiece. The attendant swipes the card, speaks into the earpiece, and then gestures toward it, returning the now cut card to Sandy. Sitting quietly in his car, a police car suddenly pulls up behind Sandy; officers step out as Sandy tentatively peeks out his window. One officer approaches, while the other stays back, his hand hovering near his sidearm cautiously. The detective taps his phone, and then returns with a file, handing Sandy the thief's worn mug shot, leaving Sandy shaking his head in disbelief.\n\nLater on, the family-oriented man parks his trusted Subaru, enters a sleek, modern office environment, and walks past the prominent and bold company logo, heading decisively toward a glass door that he pushes open. He takes a contemplative moment to admire his new office space as his former co-worker, who now holds the position of his new boss, approaches him with a warm demeanor, while four police officers stand near the reception desk, creating a noticeable presence. Eventually, as workers diligently place lids on boxes, the lead detective proceeds to make his way over to Sandy and his boss; Sandy faces his boss, who then turns to engage in conversation with the detective."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As he stands quietly in the room, he glances down at his phone, absorbed for a moment, until the sound of the door opening draws his attention. His co-worker steps into the room, prompting him to look up and nod briefly in acknowledgment. Sometime later, he makes his way into the garage, where he purposefully approaches his co-worker, initiating a brief exchange before stepping aside. More co-workers emerge from different entrances, gradually forming a circle that naturally expands to include Sandy as part of their group. With wide eyes, Sandy casts a glance around at his gathered co-workers, taking in the supportive atmosphere. Gradually lowering his gaze, Sandy appears to be deep in thought, and as these contemplations unfold, a gentle smile begins to emerge on his face. Seemingly coming to a decision, he raises his eyes, nods with newfound resolve, and shifts his focus. Meanwhile, on a soccer field, Sandy's daughter energetically kicks a soccer ball, launching it off the field’s edge as her mother cheers enthusiastically from the sidelines. Sandy approaches his wife on the sidelines, and as she registers his presence, she jumps back slightly, taken by surprise. He leans in to speak to her, his hands gently cradling her face as he shares his excitement. Overwhelmed by joy, she places her hand over her mouth, her eyes lighting up as she jumps excitedly, then embraces Sandy with an effusive hug. He beams, lifts her off her feet with joy, and spins her around. Elsewhere, a plump identity thief leisurely sips from a straw while she descends an escalator, her eyes scanning the shops below. Arriving at a store, she tries on a ring, admiring the sparkle on her finger before moving to the cosmetics section. In this vibrant setting, two women stand amused, watching as the cosmetics girl expertly applies makeup to the redhead's face. Not far off, a man at a cell phone kiosk grins, seemingly entertained by the unfolding spectacle. In the bustling center of the mall, a mother and daughter perch atop a stationary jet ski, discussing their imaginary adventure, while the redhead, caught in the moment, decides to buy the jet ski. Inside a Brookstone, she dozes off on a massage chair, her mouth slightly open, and drool slipping out as she indulges in a moment of rest. An employee approaches, gently poking her shoulder to rouse her. As she awakens, she methodically sorts through a stack of Sandy’s cards, lost in thought. Meanwhile, Sandy stands at the bathroom sink with his daughters, each vigorously brushing their teeth in a synchronized nightly ritual. Transitioning to his car, he situates himself comfortably in the driver's seat, grinning as he idly bobs his head to a tune only he hears, his thumbs rhythmically tapping the steering wheel. A glance downwards at the dashboard reveals the low-gas light blinking insistently, and his smile fades into a look of mild concern as he maneuvers the vehicle into a gas station. Upon reaching the pump, Sandy carefully inserts his credit card, then, with a moment of hesitation, holds the card to his mouth, breathing a warm mist onto the magnetic strip. He rubs the card against his jacket for good measure and attempts to push it into the slot once more. Inside the station, the attendant stands behind a clear protective glass, fully engaged in conversation through an earpiece. As Sandy’s card is swiped, the attendant addresses the earpiece, his actions suggesting a problem. He gestures towards his earpiece, a silent indication of the communication issue, and slides Sandy a cut card, signaling disapproval. Resigned, Sandy returns to his car, where a police cruiser pulls up quietly behind him. Two officers step out, their movements synchronized, as one approaches Sandy's window and the other remains back, his hand resting tensely by his sidearm. As Sandy peeks through the window, the approaching officer maintains a professional demeanor. The detective then touches his phone, his expression shifting as he returns with a file in hand. He extends the file towards Sandy, who accepts it reluctantly, revealing a haggard mug shot of the thief and leaving Sandy shaking his head in disapproval. Eventually, Sandy parks his Subaru with a sense of relief, enters a modern office, and walks past a prominently displayed company logo. He heads towards a glass door, gently pushing it open to reveal his new office. He takes a moment to admire this space with appreciation, his reverie soon interrupted by the sight of his former co-worker, now his new boss, who approaches him with a nod. Meanwhile, in the building's reception area, four police officers stand alert, their presence a stark reminder of recent events. Later, as men systematically place lids on boxes, preparing for what seems to be a transition or closure, the lead detective approaches Sandy and his boss, initiating a conversation. Sandy turns to face his boss, who then redirects his attention to the detective, the weight of their ongoing situation hanging in the air between them."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Sandy checks his phone as his co-worker enters, later approaching him in the garage where more co-workers gather. Wide-eyed, Sandy looks at them, then smiles and nods after contemplating the situation. Meanwhile, Sandy's daughter kicks a soccer ball off the field while her mother cheers. Surprising his wife on the sidelines, Sandy gently holds her face as they talk. Overjoyed, she jumps, hugs him, and he lifts her off her feet with a smile. Elsewhere, an identity thief sips from a straw on an escalator, tries on a ring in a store, and amuses two women as a cosmetics girl applies makeup. A man grins at a cell phone kiosk, and a mother and daughter sit on a jet ski at the mall's center, which the redhead buys. At Brookstone, the redhead naps in a massage chair, drooling until an employee pokes her awake, prompting her to sort through Sandy's credit cards. Meanwhile, Sandy and his daughters brush their teeth, and as he drives, he smiles and taps along to music until noticing the low-gas light. At a gas station, he struggles with his credit card at the pump and fails at the register, receiving a cut card back. In his car, a police cruiser arrives, and officers approach; the detective interacts with his phone, and later returns with the thief's mug shot, leaving Sandy shaking his head. Sandy then parks a Subaru at a modern office, passes a company logo, and enters to admire his new office as his former co-worker, now boss, approaches while four cops stand at reception. Later, as boxes are sealed, the lead detective approaches Sandy and his boss, who turns to the detective as Sandy looks on."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He looks at his phone, a model popular for its long battery life and sleek design, as his co-worker enters, and later, he approaches his co-worker in the garage, a space reserved for employee vehicles. More co-workers step out, all wearing their company-issued badges, and include Sandy in a circle, and wide-eyed, Sandy glances at his co-workers. Staring down at the concrete floor, a smile creeps across Sandy's face as he considers the unexpected camaraderie, then he raises his gaze and nods. Now, Sandy's daughter, a member of the local under-10s soccer league, kicks a soccer ball off a field, and her mother, an avid supporter of the team, cheers from the sidelines. Sandy approaches his wife, who jumps back with surprise at his sudden appearance, and he speaks to her with his hands gently holding her face, conveying his affectionate reassurance. Holding her hand over her mouth, she jumps with joy and gives Sandy a hug, then he smiles and lifts her off her feet, sharing the moment of happiness. Now, the plump identity thief sips from a straw as she rides down an escalator in the bustling shopping mall; at a store, she tries on a ring, now in cosmetics, and two women laugh as they watch the cosmetics girl, known for her makeup tutorials on social media, apply makeup to the redhead. At a cell phone kiosk, the man smiles, knowing the discount he received will save him money. At the center of the mall, a mother and daughter sit on a jet ski, part of a promotional display, and the redhead buys it, taking advantage of the limited-time offer. At a Brookstone, known for its innovative gadgets, she sleeps on a massage chair with her open mouth drooling, and an employee, trained to assist customers with inquiries, approaches, pokes her, then she sorts through a stack of Sandy's cards, stolen in a recent breach. Now, Sandy and his daughters brush their teeth, using their favorite character-themed toothbrushes, and in his car, a reliable family sedan, Sandy smiles and bobs his head to the beat of his favorite song as he taps his thumbs on the steering wheel. He glances down at the dashboard, where the low-gas light blinks on, indicating he must refuel, and his smile fades as he pulls into a gas station. At the pump, Sandy puts in his credit card, holds the card to his mouth, an old trick he learned to warm it up for a better read, breathes on the strip, then wipes the card on his jacket and pushes the card in again. Inside, the attendant stands behind a clear protective glass, a standard safety measure in urban areas, talking on an earpiece; the attendant swipes the card and talks into his earpiece, then points to his earpiece and slides Sandy the cut card, evidence of tampering. Now, in Sandy's car, a police car pulls up behind him, and officers emerge from the cruiser; Sandy peeks out the window as one of the officers, trained to approach vehicles cautiously, approaches while the other officer stands back with his hand by his sidearm, ready for any situation. The detective touches his phone, a device equipped with the latest case management software, and now the detective returns with a file and hands Sandy the thief's haggard mug shot, leaving Sandy shaking his head at the shocking revelation. Now, the family man parks a Subaru, a car brand known for its safety features, enters a modern office and passes a company logo, renowned for its innovative technology solutions, goes to a glass door, and pushes it open. He admires his new office, with its spacious layout and ergonomic furniture, as his former coworker, now new boss after a recent promotion, approaches, and four cops stand at reception, likely discussing the recent case. Later, as men put lids on boxes, preparing for a move, the lead detective approaches Sandy and his boss; Sandy faces his boss, who turns to the detective, ready to address the situation with the team."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He looks at his phone as his coworker enters and later he approaches his coworker in the garage. More coworkers step out and include Sandy in a circle and wideeyed Sandy glances at his coworkers. Staring down a smile creeps across Sandy's face as he considers then he raises his gaze and nods. Now Sandy's daughter kicks a soccer ball off a field and her mother cheers from the sidelines. Sandy approaches his wife who jumps back with surprise and he speaks to her with his hands gently holding her face. Holding her hand over her mouth she jumps with joy and gives Sandy a hug. then he smiles and lifts her off her feet. Now the plump identity thief sips from a straw as she rides down an escalator. at a store she tries on a ring now in cosmetics and two women laugh as they watch the cosmetics girl apply makeup to the redhead. At a cell phone kiosk the man smiles. At the center of the mall a mother and daughter sit on a jet ski and the redhead buys it. At a Brookstone she sleeps on a massage chair with her open mouth drooling and an employee approaches pokes her. then she sorts through a stack of Sandy's cards. Now Sandy and his daughters brush their teeth and in his car. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Sandy smiles and bobs his head as he taps his thumbs on the steering wheel. He glances down at the dashboard where the lowgas light blinks on and his smile fades as he pulls into a gas station. At the pump Sandy puts in his credit card holds the card to his mouth breathes on the strip then wipes the card on his jacket and pushes the card in again. Inside the attendant stands behind a clear protective glass talking on an earpiece. the attendant swipes the card and talks into his earpiece then points to his earpiece and slides Sandy the cut card. Now in Sandy's car a police car pulls up behind him and officers emerge from the cruiser. Sandy peeks out the window as one of the officers approaches while the other officer stands back with his hand by his sidearm. The detective touches his phone and now the detective returns with a file and hands Sandy. the thief's haggard mug shot leaving Sandy shaking his head. Now the family man parks. a Subaru enters a modern office and passes a company logo goes to a glass door and pushes it open. He admires his new office as his former coworker now new boss approaches and four cops stand at reception. Later as men put lids on boxes the lead detective approaches Sandy and his boss. Sandy faces his boss who turns to the detective."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He looks at his phone as his coworker enters and later he approaches his coworker in the garage. More coworkers step out and include Sandy in a circle and wideeyed Sandy glances at his coworkers. Staring down a smile creeps across Sandy's face as he considers then he raises his gaze and nods. Now Sandy's daughter kicks a soccer ball off a field and her mother cheers from the sidelines. Sandy approaches his wife who jumps back with surprise and he speaks to her with his hands gently holding her face. Holding her hand over her mouth she jumps with joy and gives Sandy a hug. then he smiles and lifts her off her feet. Now the plump identity thief sips from a straw as she rides down an escalator. at a store she tries on a ring now in cosmetics and two women laugh as they watch the cosmetics girl apply makeup to the redhead. At a cell phone kiosk the man smiles. At the center of the mall a mother and daughter sit on a jet ski and the redhead buys it. At a Brookstone she sleeps on a massage chair with her open mouth drooling and an employee approaches pokes her. then she sorts through a stack of Sandy's cards. Now Sandy and his daughters brush their teeth and in his car. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Sandy smiles and bobs his head as he taps his thumbs on the steering wheel. He glances down at the dashboard where the lowgas light blinks on and his smile fades as he pulls into a gas station. At the pump Sandy puts in his credit card holds the card to his mouth breathes on the strip then wipes the card on his jacket and pushes the card in again. Inside the attendant stands behind a clear protective glass talking on an earpiece. the attendant swipes the card and talks into his earpiece then points to his earpiece and slides Sandy the cut card. Now in Sandy's car a police car pulls up behind him and officers emerge from the cruiser. Sandy peeks out the window as one of the officers approaches while the other officer stands back with his hand by his sidearm. The detective touches his phone and now the detective returns with a file and hands Sandy. the thief's haggard mug shot leaving Sandy shaking his head. Now the family man parks. a Subaru enters a modern office and passes a company logo goes to a glass door and pushes it open. He admires his new office as his former coworker now new boss approaches and four cops stand at reception. Later as men put lids on boxes the lead detective approaches Sandy and his boss. Sandy faces his boss who turns to the detective."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He looks at his phone as his coworker enters and later he approaches his coworker in the garage. More coworkers step out and include Sandy in a circle and wideeyed Sandy glances at his coworkers. Staring down a smile creeps across Sandy's face as he considers then he raises his gaze and nods. Now Sandy's daughter kicks a soccer ball off a field and her mother cheers from the sidelines. Sandy approaches his wife who jumps back with surprise and he speaks to her with his hands gently holding her face. Holding her hand over her mouth she jumps with joy and gives Sandy a hug. then he smiles and lifts her off her feet. The detective touches his phone and now the detective returns with a file and hands Sandy. the thief's haggard mug shot leaving Sandy shaking his head. Now the family man parks. a Subaru enters a modern office and passes a company logo goes to a glass door and pushes it open. He admires his new office as his former coworker now new boss approaches and four cops stand at reception. Later as men put lids on boxes the lead detective approaches Sandy and his boss. Sandy faces his boss who turns to the detective."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He looks at his phone as his coworker enters and later he approaches his coworker in the garage. More coworkers step out and include Sandy in a circle and wideeyed Sandy glances at his coworkers. Staring down a smile creeps across Sandy's face as he considers then he raises his gaze and nods. He admires his new office as his former coworker now new boss approaches and four cops stand at reception. Later as men put lids on boxes the lead detective approaches Sandy and his boss. Sandy faces his boss who turns to the detective."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The owl glances at its journal as its neighbor floats in, and after a while, it heads towards its neighbor in the attic. Other neighbors drift out and gather Lola in a web, and wide-eyed, Lola peers at its neighbors. Gazing up, a grin sneaks across Lola's beak as it ponders, then it lowers its gaze and blinks. Now, Lola's son tosses a basketball down a hill, and his father applauds from the bleachers. Lola heads towards his husband, who hops forward with astonishment, and it whispers to him with its wings softly touching his beak. Clasping his wing over his eyes, he hops with delight and offers Lola a handshake, then it beams and propels him onto a cloud. Now, the slim comedian gulps from a flute as he glides up an elevator; in a library, he dons a crown, now in fabrics, and two boys snicker as they observe the fabrics boy weave blankets for the brunette. At an earphone kiosk, the lady grins. At the heart of the plaza, a father and son recline on a bicycle, and the brunette acquires it. At a Pottery Barn, he dozes on a hammock with his shut eyes twitching, and a librarian nears, taps him, then he arranges a pile of Lola's notebooks. Now, Lola and his sons comb their hair, and in his boat, Lola grins and nods his beak as he drumming his fins on the rudder. It peers up at the compass, where the north-wind indicator flashes on, and its grin vanishes as it drifts into a mechanic. At the vent, Lola slides in his debit card, waves the card to his ear, sighs on the code, then scrubs the card on his scarf and presses the card in once more. Outside, the vendor reclines behind a wooden barricade, humming into a microphone; the vendor skims the card and hums into his microphone, then gestures to his microphone and flips Lola the discarded card. Now, in Lola's boat, a fire truck rumbles up behind it, and firefighters disembark from the chariot; Lola squints out the door as one of the firefighters nears while the other firefighter hovers back with his fin over his megaphone. The magician taps his watch, and soon the magician arrives with a bundle and gives Lola the comedian's ragged map, leaving Lola nodding its beak. Now, the craftsman docks a sailboat, strolls to an antique workshop and passes a guild emblem, heads to a velvet curtain, and pulls it apart. It admires its renovated workshop as its past apprentice, now current leader, nears, and four merchants loiter at the counter. Later, as figures fit lids on barrels, the main magician arrives at Lola and its leader; Lola faces its leader, who pivots to the magician."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Sandy checks his phone before interacting with his co-worker in the garage. Later, co-workers include Sandy in a circle, and he smiles and nods, pleased. Meanwhile, Sandy's daughter kicks a soccer ball, and her mother cheers. Surprising his wife, Sandy holds her face and they embrace joyfully. Concurrently, a plump identity thief indulges in shopping, trying on rings and makeup, and buys a jet ski. At Brookstone, she naps on a massage chair, drooling, then shuffles through Sandy's cards. Sandy, brushing teeth with his daughters, later drives, tapping the wheel to music but his mood drops when the gas light blinks. At a gas station, his card fails, and the attendant returns it. A police car approaches Sandy, and an officer shows him the thief's mug shot, leaving him dismayed. Finally, Sandy parks at a modern office, greeted by his new boss. As men pack boxes, the lead detective talks with Sandy and his boss, turning attention toward the unfolding situation."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Sandy faces his boss who turns to the detective Later as men put lids on boxes the lead detective approaches Sandy and his boss He admires his new office as his former coworker now new boss approaches and four cops stand at reception a Subaru enters a modern office and passes a company logo goes to a glass door and pushes it open Now the family man parks the thief's haggard mug shot leaving Sandy shaking his head The detective touches his phone and now the detective returns with a file and hands Sandy Sandy peeks out the window as one of the officers approaches while the other officer stands back with his hand by his sidearm Now in Sandy's car a police car pulls up behind him and officers emerge from the cruiser the attendant swipes the card and talks into his earpiece then points to his earpiece and slides Sandy the cut card Inside the attendant stands behind a clear protective glass talking on an earpiece At the pump Sandy puts in his credit card holds the card to his mouth breathes on the strip then wipes the card on his jacket and pushes the card in again He glances down at the dashboard where the lowgas light blinks on and his smile fades as he pulls into a gas station Sandy smiles and bobs his head as he taps his thumbs on the steering wheel Now Sandy and his daughters brush their teeth and in his car then she sorts through a stack of Sandy's cards At a Brookstone she sleeps on a massage chair with her open mouth drooling and an employee approaches pokes her At the center of the mall a mother and daughter sit on a jet ski and the redhead buys it At a cell phone kiosk the man smiles at a store she tries on a ring now in cosmetics and two women laugh as they watch the cosmetics girl apply makeup to the redhead Now the plump identity thief sips from a straw as she rides down an escalator then he smiles and lifts her off her feet Holding her hand over her mouth she jumps with joy and gives Sandy a hug Sandy approaches his wife who jumps back with surprise and he speaks to her with his hands gently holding her face Now Sandy's daughter kicks a soccer ball off a field and her mother cheers from the sidelines Staring down a smile creeps across Sandy's face as he considers then he raises his gaze and nods More coworkers step out and include Sandy in a circle and wideeyed Sandy glances at his coworkers He looks at his phone as his coworker enters and later he approaches his coworker in the garage"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "More coworkers step out and include Sandy in a circle and wideeyed Sandy glances at his coworkers He looks at his phone as his coworker enters and later he approaches his coworker in the garage Now Sandy's daughter kicks a soccer ball off a field and her mother cheers from the sidelines Staring down a smile creeps across Sandy's face as he considers then he raises his gaze and nods Holding her hand over her mouth she jumps with joy and gives Sandy a hug Sandy approaches his wife who jumps back with surprise and he speaks to her with his hands gently holding her face Now the plump identity thief sips from a straw as she rides down an escalator then he smiles and lifts her off her feet At a cell phone kiosk the man smiles at a store she tries on a ring now in cosmetics and two women laugh as they watch the cosmetics girl apply makeup to the redhead At a Brookstone she sleeps on a massage chair with her open mouth drooling and an employee approaches pokes her At the center of the mall a mother and daughter sit on a jet ski and the redhead buys it Now Sandy and his daughters brush their teeth and in his car then she sorts through a stack of Sandy's cards He glances down at the dashboard where the lowgas light blinks on and his smile fades as he pulls into a gas station Sandy smiles and bobs his head as he taps his thumbs on the steering wheel Inside the attendant stands behind a clear protective glass talking on an earpiece At the pump Sandy puts in his credit card holds the card to his mouth breathes on the strip then wipes the card on his jacket and pushes the card in again Now in Sandy's car a police car pulls up behind him and officers emerge from the cruiser the attendant swipes the card and talks into his earpiece then points to his earpiece and slides Sandy the cut card The detective touches his phone and now the detective returns with a file and hands Sandy Sandy peeks out the window as one of the officers approaches while the other officer stands back with his hand by his sidearm Now the family man parks the thief's haggard mug shot leaving Sandy shaking his head He admires his new office as his former coworker now new boss approaches and four cops stand at reception a Subaru enters a modern office and passes a company logo goes to a glass door and pushes it open Sandy faces his boss who turns to the detective Later as men put lids on boxes the lead detective approaches Sandy and his boss"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Sandy smiles and bobs his head as he taps his thumbs on the steering wheel He glances down at the dashboard where the lowgas light blinks on and his smile fades as he pulls into a gas station At the pump Sandy puts in his credit card holds the card to his mouth breathes on the strip then wipes the card on his jacket and pushes the card in again Inside the attendant stands behind a clear protective glass talking on an earpiece the attendant swipes the card and talks into his earpiece then points to his earpiece and slides Sandy the cut card Now in Sandy's car a police car pulls up behind him and officers emerge from the cruiser Sandy peeks out the window as one of the officers approaches while the other officer stands back with his hand by his sidearm The detective touches his phone and now the detective returns with a file and hands Sandy the thief's haggard mug shot leaving Sandy shaking his head Now the family man parks a Subaru enters a modern office and passes a company logo goes to a glass door and pushes it open He admires his new office as his former coworker now new boss approaches and four cops stand at reception Later as men put lids on boxes the lead detective approaches Sandy and his boss Sandy faces his boss who turns to the detective He looks at his phone as his coworker enters and later he approaches his coworker in the garage More coworkers step out and include Sandy in a circle and wideeyed Sandy glances at his coworkers Staring down a smile creeps across Sandy's face as he considers then he raises his gaze and nods Now Sandy's daughter kicks a soccer ball off a field and her mother cheers from the sidelines Sandy approaches his wife who jumps back with surprise and he speaks to her with his hands gently holding her face Holding her hand over her mouth she jumps with joy and gives Sandy a hug then he smiles and lifts her off her feet Now the plump identity thief sips from a straw as she rides down an escalator at a store she tries on a ring now in cosmetics and two women laugh as they watch the cosmetics girl apply makeup to the redhead At a cell phone kiosk the man smiles At the center of the mall a mother and daughter sit on a jet ski and the redhead buys it At a Brookstone she sleeps on a massage chair with her open mouth drooling and an employee approaches pokes her then she sorts through a stack of Sandy's cards Now Sandy and his daughters brush their teeth and in his car"
        }
      ]
    }
  ]
}