{
  "ground_truth": "The redhead grabs Sandy's suitcase and unzips it, discovering some clothes and a toiletry bag. Outside, a blue and yellow taxi arrives, and Sandy exits the back holding the pink slip. A huge sweat stain runs down the front of his shirt as he pays the driver and eyes the house before proceeding in a stealthy jog along the side, with an even larger sweat stain covering his back. Looking around, he cautiously enters the back gate and, through a window, spots the redhead rummaging through his toiletries, aggressively rubbing his deodorant onto her armpits as he creeps into the room. He pulls out handcuffs, and she complies, but then she punches his throat. He grabs her leg, knocking her down, and she grabs and slaps his face. Standing, she backs him into the counter and throws him over a chair. As she bolts, Sandy hurls a small appliance and whacks her with a guitar. A bunch of IDs are scattered as two thugs stand at the door and a gunshot blasts off the door knob. Sandy and Diana bolt as the woman bursts in with her male partner wielding a short gun. Diana pierces two of their tires with a knife and hurries into Sandy's car. Sandy reverses over her mailbox and into the neighbor's yard, knocking over a sign as he cuffs their hands together. The female thug rips the knife from the tire as Sandy speeds off. She picks the lock, frees herself, and reaches into her shirt as Sandy pulls over. She hitchhikes, and Diana glares and bolts, but Sandy easily catches up to the overweight woman. Diana snatches his keys and runs, slowly running and flashing her middle finger. Sandy jogs in front of her as Diana stumbles to a stop, and he rolls his eyes and crosses his fingers. Diana stares in his eyes, then limps toward the car as Sandy follows her. Sandy retrieves the keys from the middle of the highway and hurries back to the car. In an auto garage, a muscular tattooed mechanic works as the female thug watches him nearby and lifts her phone. Meanwhile, an aging man sits in a jail cell, and Julian furrows his brow as the prisoner pays the guard. In Sandy's car, Diana, with her lips pursed, faces him with wide eyes and dances in her seat, while Sandy changes the station and glares as she mimes playing instruments. They speed over a bridge spanning a small river. Elsewhere, a roughneck man with weathered skin and a gray goatee approaches a van. In his brand new van, the aging man arrives at the strip mall, stops outside the salon, and peers inside. Entering, he finds a young brunette stylist sweeping the floor, and the stylist nods and smiles as he eyes the salon.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The auburn-haired woman seizes Sandy's luggage and unfastens it, uncovering some garments and a toiletries pouch. Outdoors, a cerulean and amber taxi comes, and Sandy departs the rear grasping the pink notice. A massive perspiration mark runs down the front of his shirt as he compensates the chauffeur and observes the residence before continuing in a furtive trot along the flank, with an even larger perspiration mark blanketing his back. Glancing around, he warily enters the rear gateway and, through a pane, notices the auburn-haired woman rifling through his toiletries, vigorously applying his deodorant onto her underarms as he sneaks into the chamber. He extracts restraints, and she acquiesces, but then she strikes his neck. He seizes her limb, toppling her down, and she seizes and smacks his visage. Arising, she presses him into the counter and flings him over a seat. As she dashes, Sandy launches a diminutive device and strikes her with a guitar. A collection of identities are strewn as two hoodlums stand at the entrance and a gunshot shatters the door knob. Sandy and Diana dash as the lady bursts in with her male cohort brandishing a short firearm. Diana punctures two of their tires with a blade and hastens into Sandy's automobile. Sandy reverses over her mailbox and into the neighbor's yard, knocking over a placard as he cuffs their arms together. The female hoodlum tears the blade from the tire as Sandy accelerates away. She picks the lock, liberates herself, and reaches into her blouse as Sandy halts. She hitchhikes, and Diana glares and dashes, but Sandy effortlessly catches up to the corpulent woman. Diana snatches his keys and runs, leisurely running and flashing her middle finger. Sandy jogs ahead of her as Diana stumbles to a halt, and he rolls his eyes and crosses his fingers. Diana gazes in his eyes, then limps toward the vehicle as Sandy follows her. Sandy retrieves the keys from the middle of the highway and hurries back to the vehicle. In an auto repair shop, a brawny tattooed mechanic toils as the female hoodlum observes him close by and lifts her phone. Meanwhile, an elderly man sits in a prison cell, and Julian furrows his brow as the captive compensates the guard. In Sandy's automobile, Diana, with her lips pursed, faces him with wide eyes and dances in her seat, while Sandy alters the channel and glares as she mimes playing instruments. They accelerate over a bridge spanning a small river. Elsewhere, a roughneck man with weathered skin and a silver goatee approaches a van. In his brand-new van, the elderly man arrives at the strip mall, stops outside the salon, and peers inside. Entering, he finds a young brunette stylist sweeping the floor, and the stylist nods and smiles as he observes the salon."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Sandy's suitcase is grabbed by the redhead and unzipped, revealing some clothes and a toiletry bag. Outside, a blue and yellow taxi is arriving, and the pink slip is held by Sandy as he exits the back. The driver is paid by him while a huge sweat stain is observed running down the front of his shirt as the house is eyed by him before he proceeds in a stealthy jog along the side, with an even larger sweat stain covering his back. The redhead is spotted through a window rummaging through his toiletries, aggressively rubbing his deodorant onto her armpits as he cautiously enters the back gate and creeps into the room. Handcuffs are pulled out by him, and she complies, but then his throat is punched by her. Her leg is grabbed by him, knocking her down, and his face is grabbed and slapped by her. He is backed into the counter and thrown over a chair by her standing. Sandy hurls a small appliance and whacks her with a guitar as she bolts. Two thugs stand at the door as a bunch of IDs are scattered and the door knob is blasted off by a gunshot. As the woman bursts in with her male partner wielding a short gun, Sandy and Diana bolt. Diana pierces two of their tires with a knife and hurries into Sandy's car. The mailbox is reversed over by Sandy, and the neighbor's yard is entered, knocking over a sign as their hands are cuffed together by him. The knife is ripped from the tire by the female thug as Sandy speeds off. The lock is picked by her, freeing herself, and into her shirt she reaches as Sandy pulls over. She hitchhikes, and Diana glares and bolts, but the overweight woman is easily caught up to by Sandy. His keys are snatched by Diana, and she runs, slowly running and flashing her middle finger. Sandy jogs in front of her as Diana stumbles to a stop, and his eyes are rolled by him and his fingers crossed. Diana stares in his eyes, then toward the car she limps as he follows her. The keys are retrieved by Sandy from the middle of the highway and he hurries back to the car. In an auto garage, a muscular tattooed mechanic is watched nearby by the female thug as he works and lifts her phone. Meanwhile, an aging man sits in a jail cell, and the guard is paid by the prisoner while Julian furrows his brow. In Sandy's car, Diana, with her lips pursed, faces him with wide eyes and dances in her seat, while the station is changed by Sandy and she is glared at by him as she mimes playing instruments. A bridge spanning a small river is sped over by them. Elsewhere, a roughneck man with weathered skin and a gray goatee approaches a van. In a brand new van, the aging man arrives at the strip mall, stops outside the salon, and inside he peers. Entering, a young brunette stylist is found sweeping the floor by him, and he eyes the salon as the stylist nods and smiles."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The redhead unzips Sandy's suitcase, finding clothes and a toiletry bag. Outside, a blue and yellow taxi arrives, and Sandy exits holding the pink slip. Sweating heavily, he pays the driver and stealthily jogs along the house side, entering the back gate. Through a window, he sees the redhead using his deodorant. He enters, pulls out handcuffs, and she complies but punches his throat. He grabs her leg, knocking her down, and she slaps his face. Standing, she backs him into the counter and throws him over a chair. As she bolts, Sandy hurls a small appliance and hits her with a guitar. IDs scatter as two thugs stand at the door, and a gunshot blasts the doorknob. Sandy and Diana flee as the woman and her partner enter with a gun. Diana slashes two tires and rushes into Sandy's car. Sandy reverses over a mailbox, cuffs their hands, and speeds off. The female thug frees herself and hitchhikes. Diana glares and bolts, but Sandy catches up. Diana snatches his keys and runs, flashing her middle finger. Sandy jogs ahead, and Diana stops, then limps toward the car. Sandy retrieves the keys from the highway and returns to the car. In an auto garage, a tattooed mechanic works as the female thug watches and lifts her phone. Meanwhile, an aging man sits in jail, and Julian furrows his brow as the prisoner pays the guard. In Sandy's car, Diana dances while Sandy changes the station and glares. They speed over a bridge. Elsewhere, a roughneck man approaches a van. The aging man arrives at a strip mall, stops outside a salon, and peers inside. Entering, he finds a young brunette stylist sweeping, and she nods and smiles as he observes."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The redhead unzips Sandy's suitcase, finding clothes and a toiletry bag. Outside, a blue and yellow taxi arrives, and Sandy exits, holding a pink slip. Sweaty, he pays the driver and stealthily jogs to the house, entering through the back gate. He sees the redhead using his deodorant and sneaks in. He pulls out handcuffs, but she punches his throat. He knocks her down, she slaps him, and throws him over a chair. As she flees, Sandy hits her with a guitar. IDs scatter as two thugs arrive, shooting the door knob. Sandy and Diana escape; she punctures their tires and jumps into Sandy's car. He reverses into a yard, cuffs their hands, and speeds off. The female thug frees herself and hitchhikes. Diana glares and runs, but Sandy catches her. Diana takes his keys, runs, and flashes her middle finger. Sandy jogs ahead, and Diana stops. Sandy retrieves the keys and returns to the car. In a garage, a tattooed mechanic works as the female thug watches. An aging man in jail pays a guard. In Sandy's car, Diana dances while Sandy changes the station. They speed over a bridge. Elsewhere, a roughneck approaches a van. The aging man arrives at a strip mall, enters a salon, and a young stylist smiles as he looks around."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The redhead, with a swift and decisive motion, grabs hold of Sandy's suitcase and unzips it, revealing a collection of clothes and a toiletry bag nestled inside. Meanwhile, outside the house, a blue and yellow taxi pulls up to the curb, and Sandy steps out from the back seat, clutching the pink slip in his hand. A large, noticeable sweat stain runs down the front of his shirt as he pays the driver, casting a wary glance at the house before proceeding in a stealthy jog along the side, with an even larger sweat stain spreading across his back. He looks around cautiously, then enters through the back gate and, peering through a window, spots the redhead rummaging through his toiletries, aggressively rubbing his deodorant onto her armpits as he quietly creeps into the room. He pulls out a pair of handcuffs, and she initially complies, but then unexpectedly punches him in the throat. He quickly grabs her leg, causing her to fall, and she retaliates by grabbing and slapping his face. As she regains her footing, she backs him into the counter and throws him over a chair. As she makes a run for it, Sandy hurls a small appliance at her and then whacks her with a guitar. A bunch of IDs scatter across the floor as two thugs stand menacingly at the door, and a gunshot blasts off the door knob. Sandy and Diana make a quick escape as the woman bursts in with her male partner, who is wielding a short gun. Diana swiftly pierces two of their tires with a knife and hurries into Sandy's car. Sandy reverses over her mailbox and into the neighbor's yard, knocking over a sign as he cuffs their hands together. The female thug, undeterred, rips the knife from the tire as Sandy speeds off. She skillfully picks the lock, freeing herself, and reaches into her shirt as Sandy pulls over. She begins to hitchhike, and Diana glares at her and bolts, but Sandy easily catches up to the overweight woman. Diana snatches his keys and runs, moving slowly and flashing her middle finger. Sandy jogs in front of her as Diana stumbles to a stop, and he rolls his eyes and crosses his fingers in exasperation. Diana stares into his eyes, then limps toward the car as Sandy follows her closely. Sandy retrieves the keys from the middle of the highway and hurries back to the car. In an auto garage, a muscular tattooed mechanic works diligently as the female thug watches him nearby and lifts her phone. Meanwhile, an aging man sits in a jail cell, and Julian furrows his brow as the prisoner pays the guard. In Sandy's car, Diana, with her lips pursed, faces him with wide eyes and dances energetically in her seat, while Sandy changes the station and glares as she mimes playing instruments. They speed over a bridge that spans a small river. Elsewhere, a roughneck man with weathered skin and a gray goatee approaches a van. In his brand new van, the aging man arrives at the strip mall, stops outside the salon, and peers inside. Entering, he finds a young brunette stylist sweeping the floor, and the stylist nods and smiles as he surveys the salon."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The redhead, moving with a swift and decisive motion that left no room for hesitation, grabs hold of Sandy's suitcase and efficiently unzips it, revealing a variety of clothes and a neatly packed toiletry bag nestled inside. Meanwhile, outside the house, a blue and yellow taxi pulls up to the curb, and Sandy steps out from the back seat, clutching the pink slip firmly in his hand. A large and noticeable sweat stain runs conspicuously down the front of his shirt as he proceeds to pay the driver, casting a wary and apprehensive glance at the house before continuing with a stealthy jog along the side of the building, an even larger and more prominent sweat stain spreading across his back. He looks around cautiously and, entering through the back gate, peers through a window. He spots the redhead rummaging through his toiletries and aggressively rubbing his deodorant onto her armpits as he quietly creeps into the room. He pulls out a pair of handcuffs, and at first, she complies, but then she unexpectedly punches him in the throat. He quickly grabs her leg, causing her to fall, and she retaliates by grabbing his face and slapping it. As she regains her footing, she backs him into the counter and manages to throw him over a chair. As she attempts to make a run for it, Sandy hurls a small appliance at her and then whacks her with a guitar. A bunch of IDs scatter across the floor, and two thugs stand menacingly at the door as a gunshot blasts off the door knob. Sandy and Diana make a quick escape as the woman bursts in with her male partner, who is wielding a short gun. Diana swiftly pierces two of their tires with a knife and hurries to Sandy's car. Sandy reverses over her mailbox and into the neighbor's yard, knocking over a sign as he cuffs their hands together. The female thug, undeterred by the setback, rips the knife from the tire as Sandy speeds off. She skillfully picks the lock with practiced precision, freeing herself, and reaches into her shirt as Sandy pulls over. She begins to hitchhike, and Diana glares at her, bolting away, but Sandy easily catches up to the overweight woman. Diana snatches his keys and runs, although moving slowly, and flashes her middle finger. Sandy jogs in front of her as Diana stumbles to a stop, and he rolls his eyes, crossing his fingers in exasperation. Diana stares deep into his eyes, then limps her way toward the car as Sandy follows closely. Sandy retrieves the keys from the middle of the highway and hurries back to the car. In an auto garage, a muscular and tattooed mechanic works diligently as the female thug watches him nearby, lifting her phone. Meanwhile, an aging man sits in a jail cell, and Julian furrows his brow as the prisoner pays the guard. In Sandy's car, Diana, with her lips pursed, faces him with wide eyes and dances energetically in her seat, while Sandy changes the station and glares as she mimes playing instruments. They speed over a bridge that spans across a small river. Elsewhere, a roughneck man with weathered skin and a gray goatee approaches a van. In his brand-new van, the aging man arrives at the strip mall, stops outside the salon, and peers inside. Entering, he finds a young brunette stylist sweeping the floor, and the stylist nods and smiles as he surveys the salon."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The redhead swiftly reaches for Sandy's suitcase, her fingers deftly unzipping it to reveal a collection of clothes and a toiletry bag nestled inside. Meanwhile, outside, a blue and yellow taxi pulls up, and Sandy emerges from the back seat, clutching a pink slip in his hand. A large sweat stain is prominently visible on the front of his shirt as he hands over payment to the driver, his eyes scanning the house with intent. He then proceeds with a stealthy jog along the side of the house, a more substantial sweat stain now marking his back. Vigilantly surveying his surroundings, he cautiously makes his way through the back gate. Peering through a window, he spots the redhead rummaging through his toiletries, watching as she aggressively applies his deodorant to her armpits. As he quietly enters the room, he produces a pair of handcuffs, and she initially complies, but suddenly she strikes his throat with a punch. Reacting quickly, he grabs her leg, causing her to fall, and she retaliates by grabbing and slapping his face. Regaining her footing, she forces him back into the counter and then throws him over a chair. As she makes a run for it, Sandy hurls a small appliance at her and then strikes her with a guitar. IDs scatter across the floor as two thugs appear at the door, and a gunshot rings out, blasting off the door knob. Sandy and Diana make a hasty escape as the woman bursts in with her male partner, who is wielding a short gun. Diana swiftly pierces two of their tires with a knife and rushes into Sandy's car. Sandy reverses the car, inadvertently running over her mailbox and crashing into the neighbor's yard, toppling a sign as he cuffs their hands together. The female thug manages to rip the knife from the tire just as Sandy speeds away. She skillfully picks the lock, freeing herself, and reaches into her shirt as Sandy pulls over. She attempts to hitchhike, prompting Diana to glare and bolt, but Sandy easily catches up to the overweight woman. Diana seizes his keys and takes off, running slowly while defiantly flashing her middle finger. Sandy jogs ahead of her, and as Diana stumbles to a halt, he rolls his eyes and crosses his fingers in exasperation. Diana locks eyes with him, then limps toward the car with Sandy trailing behind. Sandy retrieves the keys from the middle of the highway and quickly returns to the car. In an auto garage, a muscular tattooed mechanic is hard at work while the female thug watches him closely, lifting her phone. Meanwhile, an aging man sits in a jail cell, and Julian furrows his brow as the prisoner hands payment to the guard. In Sandy's car, Diana, with her lips pursed and eyes wide, faces him and begins to dance in her seat, while Sandy changes the radio station and glares at her as she mimes playing instruments. They speed across a bridge that spans a small river. Elsewhere, a roughneck man with weathered skin and a gray goatee approaches a van. In his brand new van, the aging man arrives at the strip mall, parks outside the salon, and peers inside. Upon entering, he finds a young brunette stylist sweeping the floor, and she nods and smiles as he surveys the salon."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The redhead unzips Sandy's suitcase, revealing clothes and a toiletry bag. Meanwhile, Sandy arrives in a blue and yellow taxi, pays the driver, and stealthily jogs along the house's side, drenched in sweat. He cautiously enters through the back gate and sees the redhead using his deodorant through a window. As he enters the room, he attempts to handcuff her, but she resists, leading to a physical struggle. She punches his throat, and he retaliates by knocking her down. She counters by slapping his face, backing him into the counter, and throwing him over a chair. As she tries to escape, Sandy throws a small appliance and hits her with a guitar. IDs scatter as two thugs appear at the door, and a gunshot blasts the doorknob. Sandy and Diana flee as the woman and her partner, armed, pursue them. Diana punctures two of their tires with a knife and jumps into Sandy's car. Sandy reverses into the neighbor's yard, knocking over a sign, and cuffs their hands together. The female thug frees herself and hitchhikes as Sandy pulls over. Diana bolts with his keys, but Sandy catches up to her. She taunts him, but he retrieves the keys from the highway and returns to the car. In an auto garage, a muscular mechanic works while the female thug watches and uses her phone. Meanwhile, an aging man in a jail cell pays a guard, and Julian observes. In Sandy's car, Diana dances in her seat while Sandy changes the station, and they drive over a bridge. Elsewhere, a roughneck man approaches a van, and the aging man arrives at a strip mall, enters a salon, and exchanges nods and smiles with a young stylist."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The redhead, her vibrant hair catching the light, grabs Sandy's suitcase and unzips it, discovering some clothes and a toiletry bag filled with high-end grooming products. Outside, a blue and yellow taxi, recognizable as the local cab company known for its affordable fares, arrives, and Sandy exits the back holding the pink slip, the eviction notice from his landlord. A huge sweat stain runs down the front of his shirt, evidence of the relentless summer heat, as he pays the driver and eyes the house, a charming Victorian with peeling paint, before proceeding in a stealthy jog along the side, with an even larger sweat stain covering his back. Looking around, he cautiously enters the back gate, a creaky wrought iron relic, and, through a window, spots the redhead rummaging through his toiletries, aggressively rubbing his deodorant, a rare brand he imported, onto her armpits as he creeps into the room. He pulls out handcuffs, standard police issue, and she complies, but then she punches his throat with surprising accuracy. He grabs her leg, knocking her down, and she grabs and slaps his face with an open palm. Standing, she backs him into the counter, a retro 1950s kitchen fixture, and throws him over a chair, a flimsy IKEA model. As she bolts, Sandy hurls a small appliance, a toaster, and whacks her with a guitar, an acoustic model with a crack along the neck. A bunch of IDs, likely from her previous victims, are scattered as two thugs stand at the door and a gunshot, echoing loudly, blasts off the door knob. Sandy and Diana, his childhood friend known for her quick reflexes, bolt as the woman bursts in with her male partner wielding a short gun, a sawed-off shotgun. Diana pierces two of their tires with a knife, inherited from her survivalist uncle, and hurries into Sandy's car. Sandy reverses over her mailbox, painted in bright colors, and into the neighbor's yard, knocking over a sign that reads 'Beware of Dog' as he cuffs their hands together with seasoned ease. The female thug rips the knife from the tire as Sandy speeds off. She picks the lock with a practiced hand, frees herself, and reaches into her shirt for a backup weapon as Sandy pulls over. She hitchhikes, and Diana glares and bolts, but Sandy easily catches up to the overweight woman, whose loud breathing is audible. Diana snatches his keys and runs, slowly running and flashing her middle finger, a gesture learned from her rebellious teenage years. Sandy jogs in front of her as Diana stumbles to a stop, and he rolls his eyes, accustomed to her antics, and crosses his fingers, hoping for a peaceful resolution. Diana stares in his eyes, then limps toward the car as Sandy follows her, unsure of her next move. Sandy retrieves the keys from the middle of the highway, a busy route, and hurries back to the car. In an auto garage, a muscular tattooed mechanic with a reputation for fixing anything that moves works as the female thug watches him nearby and lifts her phone, sending a coded message. Meanwhile, an aging man, a former criminal with a lengthy rap sheet, sits in a jail cell, and Julian, a seasoned detective with a keen eye for detail, furrows his brow as the prisoner pays the guard discreetly. In Sandy's car, Diana, with her lips pursed in contemplation, faces him with wide eyes and dances in her seat, while Sandy changes the station to his favorite rock channel and glares as she mimes playing instruments, a habit from her days in a high school band. They speed over a bridge spanning a small river, known locally for its serene beauty. Elsewhere, a roughneck man with weathered skin and a gray goatee, a testament to his many years outdoors, approaches a van. In his brand new van, the aging man arrives at the strip mall, a gathering place for the town's residents, stops outside the salon, and peers inside. Entering, he finds a young brunette stylist sweeping the floor, and the stylist, eager to finish her shift, nods and smiles as he eyes the salon, still bustling with early evening clientele."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The redhead grabs Sandy's suitcase and unzips it discovering some clothes and a toiletry bag  Outside a blue and yellow taxi arrives and Sandy exits the back holding the pink slip  A huge sweat stain runs down the front of his shirt as he pays the driver and eyes the house before proceeding in a stealthy jog along the side with an even larger sweat stain covering his back  Diana pierces two of their tires with a knife and hurries into Sandy's car  Sandy reverses over her mailbox and into the neighbor's yard knocking over a sign as he cuffs their hands together  The female thug rips the knife from the tire as Sandy speeds off  She picks the lock frees herself and reaches into her shirt as Sandy pulls over  She hitchhikes and Diana glares and bolts but Sandy easily catches up to the overweight woman  Diana snatches his keys and runs slowly running and flashing her middle finger  Sandy jogs in front of her as Diana stumbles to a stop and he rolls his eyes and crosses his fingers  Diana stares in his eyes then limps toward the car as Sandy follows her  Sandy retrieves the keys from the middle of the highway and hurries back to the car  In an auto garage a muscular tattooed mechanic works as the female thug watches him nearby and lifts her phone  Meanwhile an aging man sits in a jail cell and Julian furrows his brow as the prisoner pays the guard  In Sandy's car Diana with her lips pursed faces him with wide eyes and dances in her seat while Sandy changes the station and glares as she mimes playing instruments  They speed over a bridge spanning a small river  Looking around he cautiously enters the back gate and through a window spots the redhead rummaging through his toiletries aggressively rubbing his deodorant onto her armpits as he creeps into the room  He pulls out handcuffs and she complies but then she punches his throat  He grabs her leg knocking her down and she grabs and slaps his face  Standing she backs him into the counter and throws him over a chair  As she bolts Sandy hurls a small appliance and whacks her with a guitar  A bunch of IDs are scattered as two thugs stand at the door and a gunshot blasts off the door knob  Sandy and Diana bolt as the woman bursts in with her male partner wielding a short gun  Diana pierces two of their tires with a knife and hurries into Sandy's car  Sandy reverses over her mailbox and into the neighbor's yard knocking over a sign as he cuffs their hands together  The female thug rips the knife from the tire as Sandy speeds off  She picks the lock frees herself and reaches into her shirt as Sandy pulls over  She hitchhikes and Diana glares and bolts but Sandy easily catches up to the overweight woman  Diana snatches his keys and runs slowly running and flashing her middle finger  Sandy jogs in front of her as Diana stumbles to a stop and he rolls his eyes and crosses his fingers  Diana stares in his eyes then limps toward the car as Sandy follows her  Sandy retrieves the keys from the middle of the highway and hurries back to the car  In an auto garage a muscular tattooed mechanic works as the female thug watches him nearby and lifts her phone  Meanwhile an aging man sits in a jail cell and Julian furrows his brow as the prisoner pays the guard  In Sandy's car Diana with her lips pursed faces him with wide eyes and dances in her seat while Sandy changes the station and glares as she mimes playing instruments  They speed over a bridge spanning a small river  Elsewhere a roughneck man with weathered skin and a gray goatee approaches a van  In his brand new van the aging man arrives at the strip mall stops outside the salon and peers inside  Entering he finds a young brunette stylist sweeping the floor and the stylist nods and smiles as he eyes the salon"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The redhead grabs Sandy's suitcase and unzips it discovering some clothes and a toiletry bag. Outside a blue and yellow taxi arrives and Sandy exits the back holding the pink slip. A huge sweat stain runs down the front of his shirt as he pays the driver and eyes the house before proceeding in a stealthy jog along the side with an even larger sweat stain covering his back. Looking around he cautiously enters the back gate and through a window spots the redhead rummaging through his toiletries aggressively rubbing his deodorant onto her armpits as he creeps into the room. He pulls out handcuffs and she complies but then she punches his throat. He grabs her leg knocking her down and she grabs and slaps his face. Standing she backs him into the counter and throws him over a chair. As she bolts Sandy hurls a small appliance and whacks her with a guitar. A bunch of IDs are scattered as two thugs stand at the door and a gunshot blasts off the door knob. Sandy and Diana bolt as the woman bursts in with her male partner wielding a short gun. Diana pierces two of their tires with a knife and hurries into Sandy's car. Sandy reverses over her mailbox and into the neighbor's yard knocking over a sign as he cuffs their hands together. The female thug rips the knife from the tire as Sandy speeds off. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. She picks the lock frees herself and reaches into her shirt as Sandy pulls over. She hitchhikes and Diana glares and bolts but Sandy easily catches up to the overweight woman. Diana snatches his keys and runs slowly running and flashing her middle finger. Sandy jogs in front of her as Diana stumbles to a stop and he rolls his eyes and crosses his fingers. Diana stares in his eyes then limps toward the car as Sandy follows her. Sandy retrieves the keys from the middle of the highway and hurries back to the car. In an auto garage a muscular tattooed mechanic works as the female thug watches him nearby and lifts her phone. Meanwhile an aging man sits in a jail cell and Julian furrows his brow as the prisoner pays the guard. In Sandy's car Diana with her lips pursed faces him with wide eyes and dances in her seat while Sandy changes the station and glares as she mimes playing instruments. They speed over a bridge spanning a small river. Elsewhere a roughneck man with weathered skin and a gray goatee approaches a van. In his brand new van the aging man arrives at the strip mall stops outside the salon and peers inside. Entering he finds a young brunette stylist sweeping the floor and the stylist nods and smiles as he eyes the salon."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The redhead grabs Sandy's suitcase and unzips it discovering some clothes and a toiletry bag. Outside a blue and yellow taxi arrives and Sandy exits the back holding the pink slip. A huge sweat stain runs down the front of his shirt as he pays the driver and eyes the house before proceeding in a stealthy jog along the side with an even larger sweat stain covering his back. Looking around he cautiously enters the back gate and through a window spots the redhead rummaging through his toiletries aggressively rubbing his deodorant onto her armpits as he creeps into the room. He pulls out handcuffs and she complies but then she punches his throat. He grabs her leg knocking her down and she grabs and slaps his face. Standing she backs him into the counter and throws him over a chair. As she bolts Sandy hurls a small appliance and whacks her with a guitar. A bunch of IDs are scattered as two thugs stand at the door and a gunshot blasts off the door knob. Sandy and Diana bolt as the woman bursts in with her male partner wielding a short gun. Diana pierces two of their tires with a knife and hurries into Sandy's car. Sandy reverses over her mailbox and into the neighbor's yard knocking over a sign as he cuffs their hands together. The female thug rips the knife from the tire as Sandy speeds off. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. She picks the lock frees herself and reaches into her shirt as Sandy pulls over. She hitchhikes and Diana glares and bolts but Sandy easily catches up to the overweight woman. Diana snatches his keys and runs slowly running and flashing her middle finger. Sandy jogs in front of her as Diana stumbles to a stop and he rolls his eyes and crosses his fingers. Diana stares in his eyes then limps toward the car as Sandy follows her. Sandy retrieves the keys from the middle of the highway and hurries back to the car. In an auto garage a muscular tattooed mechanic works as the female thug watches him nearby and lifts her phone. Meanwhile an aging man sits in a jail cell and Julian furrows his brow as the prisoner pays the guard. In Sandy's car Diana with her lips pursed faces him with wide eyes and dances in her seat while Sandy changes the station and glares as she mimes playing instruments. They speed over a bridge spanning a small river. Elsewhere a roughneck man with weathered skin and a gray goatee approaches a van. In his brand new van the aging man arrives at the strip mall stops outside the salon and peers inside. Entering he finds a young brunette stylist sweeping the floor and the stylist nods and smiles as he eyes the salon."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The redhead grabs Sandy's suitcase and unzips it discovering some clothes and a toiletry bag. Outside a blue and yellow taxi arrives and Sandy exits the back holding the pink slip. A huge sweat stain runs down the front of his shirt as he pays the driver and eyes the house before proceeding in a stealthy jog along the side with an even larger sweat stain covering his back. Looking around he cautiously enters the back gate and through a window spots the redhead rummaging through his toiletries aggressively rubbing his deodorant onto her armpits as he creeps into the room. He pulls out handcuffs and she complies but then she punches his throat. He grabs her leg knocking her down and she grabs and slaps his face. Standing she backs him into the counter and throws him over a chair. Meanwhile an aging man sits in a jail cell and Julian furrows his brow as the prisoner pays the guard. In Sandy's car Diana with her lips pursed faces him with wide eyes and dances in her seat while Sandy changes the station and glares as she mimes playing instruments. They speed over a bridge spanning a small river. Elsewhere a roughneck man with weathered skin and a gray goatee approaches a van. In his brand new van the aging man arrives at the strip mall stops outside the salon and peers inside. Entering he finds a young brunette stylist sweeping the floor and the stylist nods and smiles as he eyes the salon."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The redhead grabs Sandy's suitcase and unzips it discovering some clothes and a toiletry bag. Outside a blue and yellow taxi arrives and Sandy exits the back holding the pink slip. A huge sweat stain runs down the front of his shirt as he pays the driver and eyes the house before proceeding in a stealthy jog along the side with an even larger sweat stain covering his back. Elsewhere a roughneck man with weathered skin and a gray goatee approaches a van. In his brand new van the aging man arrives at the strip mall stops outside the salon and peers inside. Entering he finds a young brunette stylist sweeping the floor and the stylist nods and smiles as he eyes the salon."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The beagle grabs Sandy's suitcase and unzips it, discovering some clothes and a toiletry bag. Outside, a blue and yellow taxi arrives, and the parrot exits the back holding the pink slip. A huge sweat stain runs down the front of its shirt as it pays the driver and eyes the house before proceeding in a stealthy jog along the side, with an even larger sweat stain covering its back. Looking around, it cautiously enters the back gate and, through a window, spots the beagle rummaging through its toiletries, aggressively rubbing its deodorant onto her armpits as it creeps into the room. It pulls out handcuffs, and she complies, but then she punches its throat. It grabs her leg, knocking her down, and she grabs and slaps its face. Standing, she backs it into the counter and throws it over a chair. As she bolts, the parrot hurls a small appliance and whacks her with a guitar. A bunch of IDs are scattered as two penguins stand at the door and a gunshot blasts off the door knob. The parrot and the lion bolt as the woman bursts in with her male partner wielding a short gun. The lion pierces two of their tires with a knife and hurries into the parrot's car. The parrot reverses over her mailbox and into the neighbor's yard, knocking over a sign as it cuffs their hands together. The female penguin rips the knife from the tire as the parrot speeds off. She picks the lock, frees herself, and reaches into her shirt as the parrot pulls over. She hitchhikes, and the lion glares and bolts, but the parrot easily catches up to the overweight woman. The lion snatches its keys and runs, slowly running and flashing her middle finger. The parrot jogs in front of her as the lion stumbles to a stop, and it rolls its eyes and crosses its fingers. The lion stares in its eyes, then limps toward the car as the parrot follows her. The parrot retrieves the keys from the middle of the highway and hurries back to the car. In an auto garage, a muscular panda works as the female penguin watches him nearby and lifts her phone. Meanwhile, a leopard sits in a jail cell, and a gorilla furrows his brow as the prisoner pays the guard. In the parrot's car, the lion, with her lips pursed, faces it with wide eyes and dances in her seat, while the parrot changes the station and glares as she mimes playing instruments. They speed over a bridge spanning a small river. Elsewhere, a grizzly with weathered skin and a gray goatee approaches a van. In his brand new van, the leopard arrives at the strip mall, stops outside the salon, and peers inside. Entering, he finds a young cheetah sweeping the floor, and the cheetah nods and smiles as he eyes the salon."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The redhead grabs Sandy's backpack and unzips it, discovering some books and a toiletry kit. Outside, a green and orange motorcycle arrives, and Sandy exits the back holding the golden ticket. A large ink stain runs down the front of his suit as he pays the courier and eyes the barn before proceeding in a stealthy jog along the path, with an even larger ink stain covering his back. Looking around, he cautiously enters the back fence and, through a window, spots the redhead rummaging through his books, aggressively rubbing his lotion onto her hands as he creeps into the room. He pulls out zip ties, and she complies, but then she punches his arm. He grabs her hat, knocking her down, and she grabs and slaps his shoulder. Standing, she backs him into the bookshelf and throws him over a sofa. As she bolts, Sandy hurls a small lamp and whacks her with a trumpet. A bunch of passports are scattered as two guards stand at the door and a gunshot blasts off the doorknob. Sandy and Diana bolt as the woman bursts in with her male partner wielding a short bow. Diana pierces two of their tires with an ice pick and hurries into Sandy's van. Sandy backs over her trash can and into the neighbor's yard, knocking over a fountain as he cuffs their wrists together. The female thug rips the ice pick from the tire as Sandy speeds off. She picks the lock, frees herself, and reaches into her pocket as Sandy pulls over. She hitchhikes, and Diana glares and bolts, but Sandy easily catches up to the overweight woman. Diana snatches his wallet and runs, slowly running and flashing her middle finger. Sandy jogs in front of her as Diana stumbles to a halt, and he rolls his eyes and crosses his fingers. Diana stares in his eyes, then limps toward the van as Sandy follows her. Sandy retrieves the wallet from the side of the freeway and hurries back to the van. In a warehouse, a muscular tattooed mechanic works as the female thug watches him nearby and lifts her tablet. Meanwhile, an aging man sits in a café booth, and Julian furrows his brow as the customer pays the waiter. In Sandy's van, Diana, with her lips pursed, faces him with wide eyes and dances in her seat, while Sandy changes the track and glares as she mimes playing instruments. They speed over a bridge spanning a small pond. Elsewhere, a roughneck man with weathered skin and a gray beard approaches a wagon. In his brand new wagon, the aging man arrives at the plaza, stops outside the boutique, and peers inside. Entering, he finds a young brunette cashier sweeping the floor, and the cashier nods and smiles as he eyes the boutique."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The redhead lifts Sandy's suitcase and tapes it shut, revealing some clothes and a toiletry bag. Outside, a blue and yellow taxi departs, and Sandy jumps out the back holding the pink slip. A huge sweat stain blossoms on the front of his shirt as he shouts at the driver and scans the house before performing a lively dance along the side, with an even larger sweat stain decorating his back. Glancing around, he boldly knocks on the back gate and, through a window, sees the redhead admiring his toiletries, gently patting his deodorant onto her armpits as he saunters into the room. He waves handcuffs, and she giggles, but then she tickles his throat. He nudges her leg, lifting her up, and she clutches and tickles his face. Standing, she guides him into the counter and seats him on a chair. As she skips away, Sandy tosses a small appliance and plucks a guitar string toward her. A bunch of IDs are flipped as two thugs appear at the door and a balloon pops on the door knob. Sandy and Diana skip as the woman hops in with her male partner swinging a short rope. Diana slices two of their tires with a knife and tiptoes into Sandy's car. Sandy rolls over her mailbox and into the neighbor's yard, tapping a sign as he entwines their hands together. The female thug seizes the knife from the tire as Sandy drives away. She wiggles the lock, frees herself, and pats her shirt as Sandy pulls over. She skateboards, and Diana winks and skips, but Sandy leisurely catches up to the overweight woman. Diana jingles his keys and dances, prancing and waving her middle finger. Sandy strolls in front of her as Diana pauses to a stop, and he shrugs and crosses his fingers. Diana gazes into his eyes, then strolls toward the car as Sandy trails her. Sandy gathers the keys from the middle of the highway and strides back to the car. In an auto garage, a muscular tattooed mechanic whistles as the female thug observes him nearby and raises her phone. Meanwhile, an aging man reclines in a jail cell, and Julian scratches his chin as the prisoner nods to the guard. In Sandy's car, Diana, with her lips pursed, glances at him with wide eyes and hums in her seat, while Sandy changes the station and sighs as she mimics drumming. They cruise over a bridge spanning a small river. Elsewhere, a roughneck man with weathered skin and a gray goatee sidles up to a van. In his brand new van, the aging man pauses at the strip mall, parks outside the salon, and gazes inside. Entering, he notices a young brunette stylist inspecting the floor, and the stylist nods and grins as he admires the salon."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The gorilla grabs Charlie's refrigerator and unzips it, discovering some sneakers and an oven mitt. Outside, a green and red helicopter arrives, and Charlie exits the cockpit holding the blue hat. A huge chocolate stain runs down the front of his pants as he pays the farmer and eyes the skyscraper before proceeding in a stealthy dance along the side, with an even larger coffee stain covering his legs. Looking around, he cautiously enters the front fence and, through a chimney, spots the gorilla rummaging through his paintings, aggressively rubbing his toothpaste onto her elbows as he creeps into the palace. He pulls out shoelaces, and she complies, but then she punches his ankle. He grabs her camera, knocking her down, and she grabs and slaps his elbow. Standing, she backs him into the curtain and throws him over a sofa. As she bolts, Charlie hurls a small suitcase and whacks her with a cello. A bunch of umbrellas are scattered as two chickens stand at the pond and a spotlight blasts off the lamp shade. Charlie and Linda bolt as the unicorn bursts in with her female partner wielding a long sword. Linda pierces two of their balloons with a fork and hurries into Charlie's bus. Charlie reverses over her toaster and into the elephant's yard, knocking over a lantern as he cuffs their feet together. The male unicorn rips the fork from the balloon as Charlie speeds off. He picks the lock, frees himself, and reaches into his shoe as Charlie pulls over. He hitchhikes, and Linda glares and bolts, but Charlie easily catches up to the athletic giraffe. Linda snatches his scissors and runs, slowly running and flashing her wristwatch. Charlie jogs in front of her as Linda stumbles to a stop, and she rolls her eyes and crosses her legs. Linda stares in his ears, then limps toward the bicycle as Charlie follows her. Charlie retrieves the scissors from the middle of the playground and hurries back to the bicycle. In an art gallery, a muscular tattooed baker works as the male unicorn watches her nearby and lifts his laptop. Meanwhile, an aging woman sits in a bank vault, and Jessica furrows her brow as the banker pays the chef. In Charlie's bus, Linda, with her arms crossed, faces him with wide nostrils and dances in her seat, while Charlie changes the recipe and glares as she mimes playing flutes. They speed over a tunnel spanning a small pond. Elsewhere, a gentlewoman with weathered wrists and a gray bandana approaches a scooter. In her brand new scooter, the aging woman arrives at the recycling center, stops outside the clinic, and peers inside. Entering, she finds a young blonde architect sweeping the ceiling, and the architect nods and smiles as she eyes the clinic."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The giraffe lifts Olivia's briefcase and secures it, uncovering some shoes and a makeup pouch. Nearby, a green and orange limousine departs, and Olivia enters the front waving the blue envelope. A massive coffee stain spreads down the sleeve of her blouse as she tips the waiter and squints at the building before embarking on a quiet skip along the path, with an even larger coffee stain decorating her jacket. Observing the area, she boldly scales the front hedge and, through a fence, notices the giraffe sorting through her footwear, vigorously applying her lipstick onto his forehead as she glides into the patio. She retrieves a flashlight, and he abides, but then he taps her ankle. She kicks his hip, toppling him, and he nudges and tickles her hand. Standing, he nudges her into the bookshelf and rolls her under a table. As he escapes, Olivia hurls a small cushion and taps him with a broom. A pile of glasses are shuffled as two detectives lean against the window and a loudspeaker blares over the intercom. Olivia and Marcus slip away as the man rushes in with his female ally brandishing a long rope. Marcus deflates two of their balloons with a pencil and rushes into Olivia's truck. Olivia accelerates over her lamppost and into the neighbor's garden, toppling a sculpture as she shackles their ankles together. The male detective extracts the pencil from the balloon as Olivia drives away. He untangles the chain, unfastens himself, and reaches into his sock as Olivia stops briefly. He marches, and Marcus stares and escapes, but Olivia quickly races past the exhausted man. Marcus grabs her map and dashes, briskly skipping and waving his thumb. Olivia skips behind him as Marcus stumbles to a halt, and she raises her eyebrows and clenches her fists. Marcus gazes into her eyes, then hobbles toward the truck as Olivia trails him. Olivia retrieves the map from the side of the freeway and races back to the truck. In a repair shop, a lanky bearded welder stands as the male detective watches him nearby and raises his tablet. Meanwhile, a young woman relaxes in a log cabin, and Michelle narrows her eyes as the guest admires the ranger. In Olivia's truck, Marcus, with his cheeks puffed, watches her with wide eyes and bounces in his seat, while Olivia changes the setting and sighs as he pretends cooking. They cruise over a viaduct spanning a narrow stream. Elsewhere, a gentlewoman with fair skin and a golden braid approaches a sports car. In her vintage motorcycle, the young woman arrives at the plaza, pauses by the bakery, and glances inside. Entering, she notices an elderly gray-haired barber arranging the shelves, and the barber winks and waves as she surveys the bakery."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The redhead seizes Sandy's backpack and tears it open, unearthing some shoes and a spice rack. Outside, a green and orange motorcycle appears, and Sandy alights from the side carrying the yellow scarf. A massive paint smear runs down the front of his jacket as he applauds the rider and examines the garage before proceeding in a cautious skip along the hedge, with an even larger paint smear adorning his trousers. Scanning the area, he carefully slips through the front fence and, through a skylight, notices the redhead inspecting his spices, vigorously slathering his sunscreen onto her elbows as he glides into the chamber. He produces zip ties, and she acquiesces, but then she slaps his shin. He catches her wrist, toppling her, and she reaches and tickles his neck. Rising, she bumps him into the bookcase and spins him over a table. As she darts away, Sandy flings a small gadget and taps her with a broom. A cluster of passports are scattered as two bouncers hover at the threshold and a firecracker detonates off the door handle. Sandy and Diana sprint as the woman bursts in with her male associate wielding a garden hose. Diana punctures two of their hubcaps with a screwdriver and dashes into Sandy's van. Sandy rolls over her lamp and into the neighbor's flowerbed, knocking over a lantern as he binds their arms together. The female bouncer yanks the screwdriver from the hubcap as Sandy races away. She picks the knot, liberates herself, and reaches into her boot as Sandy pulls over. She flagships, and Diana grimaces and sprints, but Sandy smoothly overtakes the plump lady. Diana swipes his map and zips, slowly trotting and flashing a peace sign. Sandy strolls in front of her as Diana trips to a halt, and he smirks and crosses his arms. Diana gazes in his eyes, then shuffles toward the truck as Sandy trails her. Sandy collects the map from the side of the road and rushes back to the truck. In a bike shop, a burly tattooed clerk toils as the female bouncer spies on him nearby and brandishes her tablet. Meanwhile, an elderly gentleman sits in a waiting room, and Julian knits his eyebrows as the client tips the receptionist. In Sandy's van, Diana, with her eyebrows raised, peers at him with wide eyes and sways in her seat, while Sandy shifts the channel and frowns as she pretends to juggle. They cruise over a bridge spanning a narrow creek. Elsewhere, a rugged man with leathery skin and a silver beard approaches a camper. In his pristine camper, the elderly gentleman arrives at the plaza, halts outside the barber shop, and gazes inside. Entering, he discovers a young brunette hairdresser arranging the chairs, and the hairdresser beams and waves as he surveys the barber shop."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The bluebird seizes Marvin's backpack and unsnaps it, uncovering some magazines and a musical instrument. Nearby, a green and orange skateboard rolls in, and Marvin tumbles from the front clasping the yellow ticket. A tiny ink smudge darts up the sleeve of his jacket as he tips the barista and glances at the barn before advancing in an awkward hop around the corner, with an even larger ink stain wrapping his ankle. Peering around, he boldly bounds through the front door and, through a curtain, notices the bluebird sifting through his instruments, fiercely dabbing her makeup onto her elbows as he tiptoes into the hallway. He extracts scarves, and she agrees, but then she kicks his ankle. He clutches her elbow, tipping her sideways, and she slaps and tickles his knee. Standing, she nudges him into the sofa and flips him over a table. As she sprints, Marvin flings a tiny ornament and nudges her with a newspaper. A pile of buttons are scattered as two clowns hop at the garden and a firecracker explodes off the gate hinge. Marvin and Brenda sprint as the man storms in with his female accomplice holding a water pistol. Brenda slices two of their hats with a stitch remover and dashes into Marvin's van. Marvin backs over her scooter and into the farmer's field, bumping over a scarecrow as he stitches their elbows together. The male accomplice yanks the stitch remover from the hat as Marvin zooms away. He unlocks the chain, releases himself, and reaches into his shoe as Marvin pulls over. He dances, and Brenda scowls and bolts, but Marvin swiftly overtakes the slim accomplice. Brenda swipes his card and skips, quickly strolling and showing her pinky finger. Marvin strides behind her as Brenda staggers to a halt, and he shakes his head and crosses his toes. Brenda gazes at his hair, then saunters toward the van as Marvin trails her. Marvin retrieves the card from the middle of the park and rushes back to the van. In a bicycle shop, a slender piercing artist sketches as the male accomplice observes him from afar and tilts his hat. Meanwhile, a bedraggled woman dozes in a theater seat, and Cassandra blinks as the director tips the usher. In Marvin's van, Brenda, with her teeth clenched, regards him with narrow eyes and hums to herself, while Marvin shifts the dial and frowns as she pretends to paint landscapes. They cruise over a cliff spanning a shallow stream. Nearby, a gentle grandmother with delicate hands and a white bun approaches a motorcycle. On her rusted motorcycle, the bedraggled woman arrives at the sports complex, halts outside the diner, and peers inside. Entering, she finds an elderly blonde chef polishing the windows, and the chef tips their hat and nods as she surveys the diner."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The redhead unzips Sandy's suitcase, finding clothes and a toiletry bag. Sandy arrives in a sweaty state, proceeds stealthily along the house, and sees the redhead using his deodorant. He pulls out handcuffs, but she resists, leading to a physical struggle. Sandy ultimately subdues her, but two thugs arrive and fire a gun, forcing Sandy and Diana to flee. Diana punctures their tires, and they speed away in Sandy's car. The female thug frees herself and attempts to hitchhike, but Sandy catches Diana, who takes his keys and escapes slowly. He retrieves the keys, and they continue their journey. In an auto garage, the female thug observes a tattooed mechanic while an aging man in jail pays a guard. Sandy and Diana, in his car, argue over the radio as they drive over a bridge. A roughneck man approaches a van, and the aging man arrives at a strip mall, entering a salon where a young brunette stylist greets him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Entering he finds a young brunette stylist sweeping the floor and the stylist nods and smiles as he eyes the salon In his brand new van the aging man arrives at the strip mall stops outside the salon and peers inside  Elsewhere a roughneck man with weathered skin and a gray goatee approaches a van  They speed over a bridge spanning a small river  In Sandy's car Diana with her lips pursed faces him with wide eyes and dances in her seat while Sandy changes the station and glares as she mimes playing instruments  Meanwhile an aging man sits in a jail cell and Julian furrows his brow as the prisoner pays the guard  In an auto garage a muscular tattooed mechanic works as the female thug watches him nearby and lifts her phone  Sandy retrieves the keys from the middle of the highway and hurries back to the car  Diana stares in his eyes then limps toward the car as Sandy follows her  Sandy jogs in front of her as Diana stumbles to a stop and he rolls his eyes and crosses his fingers  Diana snatches his keys and runs slowly running and flashing her middle finger  She hitchhikes and Diana glares and bolts but Sandy easily catches up to the overweight woman  She picks the lock frees herself and reaches into her shirt as Sandy pulls over  The female thug rips the knife from the tire as Sandy speeds off  Sandy reverses over her mailbox and into the neighbor's yard knocking over a sign as he cuffs their hands together  Diana pierces two of their tires with a knife and hurries into Sandy's car  Sandy and Diana bolt as the woman bursts in with her male partner wielding a short gun  A bunch of IDs are scattered as two thugs stand at the door and a gunshot blasts off the door knob  As she bolts Sandy hurls a small appliance and whacks her with a guitar  Standing she backs him into the counter and throws him over a chair  He grabs her leg knocking her down and she grabs and slaps his face  He pulls out handcuffs and she complies but then she punches his throat  Looking around he cautiously enters the back gate and through a window spots the redhead rummaging through his toiletries aggressively rubbing his deodorant onto her armpits as he creeps into the room  A huge sweat stain runs down the front of his shirt as he pays the driver and eyes the house before proceeding in a stealthy jog along the side with an even larger sweat stain covering his back  Outside a blue and yellow taxi arrives and Sandy exits the back holding the pink slip  The redhead grabs Sandy's suitcase and unzips it discovering some clothes and a toiletry bag "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Sandy jogs in front of her as Diana stumbles to a stop and he rolls his eyes and crosses his fingers  Entering he finds a young brunette stylist sweeping the floor and the stylist nods and smiles as he eyes the salon Meanwhile an aging man sits in a jail cell and Julian furrows his brow as the prisoner pays the guard  Diana stares in his eyes then limps toward the car as Sandy follows her  In an auto garage a muscular tattooed mechanic works as the female thug watches him nearby and lifts her phone  Sandy reverses over her mailbox and into the neighbor's yard knocking over a sign as he cuffs their hands together  Diana snatches his keys and runs slowly running and flashing her middle finger  Outside a blue and yellow taxi arrives and Sandy exits the back holding the pink slip  As she bolts Sandy hurls a small appliance and whacks her with a guitar  The redhead grabs Sandy's suitcase and unzips it discovering some clothes and a toiletry bag  In Sandy's car Diana with her lips pursed faces him with wide eyes and dances in her seat while Sandy changes the station and glares as she mimes playing instruments  Sandy and Diana bolt as the woman bursts in with her male partner wielding a short gun  She hitchhikes and Diana glares and bolts but Sandy easily catches up to the overweight woman  In his brand new van the aging man arrives at the strip mall stops outside the salon and peers inside  He grabs her leg knocking her down and she grabs and slaps his face  Sandy retrieves the keys from the middle of the highway and hurries back to the car  The female thug rips the knife from the tire as Sandy speeds off  A huge sweat stain runs down the front of his shirt as he pays the driver and eyes the house before proceeding in a stealthy jog along the side with an even larger sweat stain covering his back  Looking around he cautiously enters the back gate and through a window spots the redhead rummaging through his toiletries aggressively rubbing his deodorant onto her armpits as he creeps into the room  Elsewhere a roughneck man with weathered skin and a gray goatee approaches a van  Standing she backs him into the counter and throws him over a chair  He pulls out handcuffs and she complies but then she punches his throat  A bunch of IDs are scattered as two thugs stand at the door and a gunshot blasts off the door knob  Diana pierces two of their tires with a knife and hurries into Sandy's car  She picks the lock frees herself and reaches into her shirt as Sandy pulls over  They speed over a bridge spanning a small river "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She picks the lock frees herself and reaches into her shirt as Sandy pulls over  She hitchhikes and Diana glares and bolts but Sandy easily catches up to the overweight woman  Diana snatches his keys and runs slowly running and flashing her middle finger  Sandy jogs in front of her as Diana stumbles to a stop and he rolls his eyes and crosses his fingers  Diana stares in his eyes then limps toward the car as Sandy follows her  Sandy retrieves the keys from the middle of the highway and hurries back to the car  In an auto garage a muscular tattooed mechanic works as the female thug watches him nearby and lifts her phone  Meanwhile an aging man sits in a jail cell and Julian furrows his brow as the prisoner pays the guard  In Sandy's car Diana with her lips pursed faces him with wide eyes and dances in her seat while Sandy changes the station and glares as she mimes playing instruments  They speed over a bridge spanning a small river  Elsewhere a roughneck man with weathered skin and a gray goatee approaches a van  In his brand new van the aging man arrives at the strip mall stops outside the salon and peers inside  Entering he finds a young brunette stylist sweeping the floor and the stylist nods and smiles as he eyes the salon The redhead grabs Sandy's suitcase and unzips it discovering some clothes and a toiletry bag  Outside a blue and yellow taxi arrives and Sandy exits the back holding the pink slip  A huge sweat stain runs down the front of his shirt as he pays the driver and eyes the house before proceeding in a stealthy jog along the side with an even larger sweat stain covering his back  Looking around he cautiously enters the back gate and through a window spots the redhead rummaging through his toiletries aggressively rubbing his deodorant onto her armpits as he creeps into the room  He pulls out handcuffs and she complies but then she punches his throat  He grabs her leg knocking her down and she grabs and slaps his face  Standing she backs him into the counter and throws him over a chair  As she bolts Sandy hurls a small appliance and whacks her with a guitar  A bunch of IDs are scattered as two thugs stand at the door and a gunshot blasts off the door knob  Sandy and Diana bolt as the woman bursts in with her male partner wielding a short gun  Diana pierces two of their tires with a knife and hurries into Sandy's car  Sandy reverses over her mailbox and into the neighbor's yard knocking over a sign as he cuffs their hands together  The female thug rips the knife from the tire as Sandy speeds off "
        }
      ]
    }
  ]
}