{
  "ground_truth": "He casually pours out the Barbicide disinfectant and drops the glass container on the floor, then flips open a Zippo lighter and strikes it on his leg. Her mouth hangs open, and she points to the desk. At night, in Sandy's car, Diana smiles as she applies makeup. He faces forward with a stern gaze and shakes his head. As they enter a restaurant, a young red-haired waitress greets them, then walks away smiling. He signals the waitress, and she turns, shocked to see Sandy. She glares at Sandy and leaves as he looks upward. The waitress returns with a mound of food, and she pulls her thumb from Sandy's soup. As the waitress leaves, Diana takes a large bite of ribs. In a motel, they approach the front desk, and she leaves. Diana enters The Foxhole, where a husky bearded man in a cowboy hat notices her and nods to himself as Diana sips her green beverage. He turns away, and she notices his Mercedes car key and thick gold ring on his pinky. The man smiles, sits beside her, removes his hat, and extends a hand, wearing a turquoise bolo. They toast and down their shots. They sit at a table with several empty shot glasses, and as they drink another shot, Diana slaps the table. Sandy enters and scans the room, smiling as he approaches their table. She points at Chuck and places a hand on his shoulder. Big Chuck nods, and she leads him to the dance floor. Diana and Big Chuck shimmy, and with her eyes on Sandy, Diana pinches Chuck's nipples through his shirt. Spinning around, Diana bends over, and Big Chuck twirls his cowboy hat behind her like riding a bronco. She stands and they continue dancing with her eyes on Sandy, who motions toward the door. Facing Chuck, Diana shimmies in place and suddenly drops into a split with her face by his crotch. Big Chuck points finger guns at Sandy as Diana dances on the floor. They enter a motel room where Sandy sets down his wallet. Chuck walks into Diana's arms, and Big Chuck whips off his belt, swinging it up from his crotch like an elephant's trunk and hitting Sandy in the face. Chuck gives him a final belt slap, then drops it. He aims a finger gun at his crotch and unbuttons his pants, dropping them. She spanks Big Chuck as he rapidly knocks his knees. Diana swipes the anxiety pills, and stumbling back, Chuck pulls up his pants. Big Chuck grabs her hips from behind, and they fall backwards onto the bed. Big Chuck spreads his legs in the air and sits up as Diana drops a pill into his cup, then pours two drinks as he twitches drunkenly.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He nonchalantly spills out the Barbicide antiseptic and lets the glass receptacle fall on the ground, then flicks open a Zippo lighter and strikes it on his leg. Her mouth stays ajar, and she gestures to the desk. At night, in Sandy's vehicle, Diana grins as she puts on cosmetics. He looks ahead with a stern stare and shakes his head. As they walk into a diner, a youthful crimson-haired server welcomes them, then strides away grinning. He signals the server, and she turns, astonished to see Sandy. She glowers at Sandy and departs as he gazes upward. The server returns with a heap of cuisine, and she removes her thumb from Sandy's broth. As the server departs, Diana takes a sizable bite of ribs. In a motel, they approach the front desk, and she departs. Diana enters The Foxhole, where a burly bearded man in a cowboy hat observes her and nods to himself as Diana sips her verdant beverage. He turns away, and she notices his Mercedes automobile key and thick golden band on his pinky. The man grins, sits beside her, removes his hat, and extends a hand, wearing a turquoise bolo. They toast and gulp their shots. They sit at a table with several vacant shot glasses, and as they drink another shot, Diana slaps the table. Sandy enters and scans the space, grinning as he approaches their table. She gestures at Chuck and places a hand on his shoulder. Big Chuck nods, and she leads him to the dance floor. Diana and Big Chuck shimmy, and with her eyes on Sandy, Diana pinches Chuck's nipples through his shirt. Spinning around, Diana bends over, and Big Chuck twirls his cowboy hat behind her like riding a bronco. She stands and they continue dancing with her eyes on Sandy, who motions toward the portal. Facing Chuck, Diana shimmies in place and suddenly drops into a split with her face by his crotch. Big Chuck points finger guns at Sandy as Diana dances on the floor. They enter a motel room where Sandy places down his billfold. Chuck walks into Diana's embrace, and Big Chuck whips off his belt, swinging it up from his crotch like an elephant's trunk and hitting Sandy in the face. Chuck gives him a final belt slap, then drops it. He aims a finger gun at his crotch and unbuttons his trousers, dropping them. She spanks Big Chuck as he rapidly knocks his knees. Diana swipes the anxiety tablets, and stumbling back, Chuck pulls up his trousers. Big Chuck grabs her hips from behind, and they fall backwards onto the bed. Big Chuck spreads his legs in the air and sits up as Diana drops a tablet into his cup, then pours two beverages as he twitches drunkenly."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He casually pours out the Barbicide disinfectant, the glass container is dropped on the floor by him, then a Zippo lighter is flipped open by him and struck on his leg. Her mouth is left hanging open, and the desk is pointed to by her. At night, in Sandy's car, Diana is smiled at by Sandy as makeup is applied by her. He is faced forward by himself with a stern gaze, and his head is shaken by him. As a restaurant is entered by them, a young red-haired waitress greets them, then a smile is given as she walks away. The waitress is signaled by him, and Sandy is shocked to be seen by her turning. Sandy is glared at by her, and he looks upward as she leaves. The waitress, with a mound of food, returns, and her thumb is pulled from Sandy's soup by her. A large bite of ribs is taken by Diana as the waitress leaves. In a motel, the front desk is approached by them, and she leaves. The Foxhole is entered by Diana, where she is noticed by a husky bearded man in a cowboy hat, and he nods to himself as a green beverage is sipped by Diana. He turns away, and his Mercedes car key and thick gold ring on his pinky are noticed by her. The man smiles, sits beside her, removes his hat, and extends a hand wearing a turquoise bolo. Shots are toasted and downed by them. A table with several empty shot glasses is sat at by them, and as another shot is drunk, the table is slapped by Diana. Sandy enters and the room is scanned by him, a smile on his face as their table is approached. She points at Chuck and places a hand on his shoulder. Big Chuck nods, and he is led to the dance floor by her. Diana and Big Chuck shimmy, and Chuck's nipples are pinched by Diana through his shirt, her eyes on Sandy. Spinning around, Diana bends over, and Big Chuck twirls his cowboy hat behind her like riding a bronco. She stands and dancing continues with her eyes on Sandy, who motions toward the door. Chuck is faced by Diana as she shimmies in place and suddenly drops into a split with her face by his crotch. Finger guns are pointed at Sandy by Big Chuck as Diana dances on the floor. A motel room is entered, and Sandy sets down his wallet. Chuck walks into Diana's arms, and Big Chuck whips off his belt, swinging it up from his crotch like an elephant's trunk and hits Sandy in the face. A final belt slap is given to him by Chuck, then it is dropped. Finger guns are aimed at his crotch by him, and his pants are unbuttoned and dropped. Big Chuck is spanked by her as his knees are knocked rapidly by him. The anxiety pills are swiped by Diana, and Chuck pulls up his pants as he stumbles back. Her hips are grabbed by Big Chuck from behind, and they fall backward onto the bed. Big Chuck spreads his legs in the air and sits up as a pill is dropped into his cup by Diana, then two drinks are poured as he drunkenly twitches."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He casually empties the Barbicide and drops the glass container, then flips open a Zippo and lights it on his leg. Her mouth agape, she gestures to the desk. At night in Sandy's car, Diana smiles, applying makeup. He stares ahead sternly, shaking his head. In a restaurant, a young red-haired waitress greets them and walks away smiling. He signals her, shocked to see Sandy. She glares at Sandy and leaves as he looks up. The waitress returns with food, pulling her thumb from Sandy's soup. She leaves, and Diana eats ribs. At a motel, Diana enters The Foxhole, noticed by a husky man in a cowboy hat who nods at her. She sees his Mercedes key and gold pinky ring. He smiles, sits, removes his hat, and offers a hand with a turquoise bolo. They toast, downing their shots. They sit with empty glasses, Diana slaps the table as they drink. Sandy arrives and smiles, approaching. She points at Chuck, touching his shoulder. Big Chuck nods, and she leads him to dance. Diana shimmies, pinching Chuck's nipples, eyes on Sandy. She bends over, and Chuck twirls his hat like riding a bronco. Diana continues dancing, eyes on Sandy, who motions to the door. Facing Chuck, Diana drops into a split by his crotch. Big Chuck points finger guns at Sandy as Diana dances. They enter a motel room; Sandy sets down his wallet. Chuck walks into Diana's arms, and Big Chuck removes his belt, swinging it like an elephant's trunk, hitting Sandy. He gives a final belt slap, then drops it. He gestures at his crotch, unbuttons, and drops his pants. She spanks Big Chuck as he knocks his knees. Diana swipes anxiety pills, and Chuck pulls up his pants. Big Chuck grabs her hips, and they fall onto the bed. He spreads his legs and sits up as Diana drops a pill into his cup, pouring two drinks as he twitches drunkenly."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He pours out Barbicide disinfectant, drops the glass container, flips open a Zippo lighter, and strikes it on his leg. Her mouth open, she points to the desk. At night in Sandy's car, Diana applies makeup and smiles. He looks forward sternly, shaking his head. At a restaurant, a young redhead waitress greets them, then leaves smiling. He signals her, and she turns, shocked to see Sandy. She glares and exits as he looks up. The waitress brings food, removing her thumb from Sandy's soup. As the waitress exits, Diana eats ribs. At a motel, they approach the desk, and she leaves. Diana enters The Foxhole; a bearded man in a cowboy hat notices and nods. Diana sips her green drink, noticing his Mercedes key and gold pinky ring. He smiles, sits beside her, removes his hat, showing a turquoise bolo. They toast and drink shots. At a table with empty shot glasses, they drink another shot, and Diana slaps the table. Sandy enters, approaches, and she points at Chuck, placing a hand on his shoulder. Big Chuck nods, and she leads him to dance. Diana and Chuck dance, with her eyes on Sandy, pinching Chuck's nipples. Diana bends over as Chuck twirls his hat. She stands, continues dancing, eyes on Sandy. Facing Chuck, she shimmies, drops into a split near his crotch. Chuck points finger guns at Sandy while Diana dances. They enter a motel room, Sandy sets down his wallet. Chuck walks to Diana, whips off his belt, and hits Sandy in the face. Chuck gives a final belt slap, drops it, aiming a finger gun at his crotch, and drops his pants. She spanks Chuck, who knocks his knees. Diana swipes pills, Chuck pulls up his pants, and falls onto the bed with her. Chuck sits up, Diana drops a pill in his cup, pours drinks, and he twitches drunkenly."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He nonchalantly pours the blue liquid of Barbicide disinfectant out of its container and lets the glass vessel fall to the floor with a clatter. Following this casual act, he flips open a metallic Zippo lighter and confidently strikes it against his leg, creating a small flame. Her mouth hangs wide open in shock, and she points across the room to the desk. Later that evening, inside the cozy confines of Sandy's car, Diana sits with a bright smile as she carefully applies her makeup using the mirror. He maintains a forward-facing position, his expression fixed in a stern gaze, and shakes his head slightly. As they make their way into a bustling restaurant, a young waitress with striking red hair warmly greets them before walking away with a pleasant smile on her face. He waves his hand to catch the waitress's attention, and she turns around, visibly startled to lay eyes upon Sandy. She casts a sharp, glaring look at Sandy and departs as his gaze shifts upward. The waitress makes her return, carrying a large mound of food, and she deftly removes her thumb from Sandy's soup with a discreet gesture. As the waitress retreats, Diana eagerly takes a large, satisfying bite of ribs. At a dimly lit motel, they approach the front desk, and she takes her leave. Diana crosses the threshold into The Foxhole, where a husky man with a thick beard, wearing a cowboy hat, notices her entrance. He nods slightly in acknowledgment as Diana leisurely sips her vibrantly green-colored beverage. The man turns his attention away, and she spots his luxurious Mercedes car key and the thick, opulent gold ring adorning his pinky finger. Smiling warmly, the man takes a seat beside her, removes his cowboy hat, and extends his hand, showcasing a striking turquoise bolo tie. They toast each other and swiftly down their shots of liquor. The two of them find a table and sit down, surrounded by several empty shot glasses. As they take another shot, in a sudden burst of energy, Diana slaps the table enthusiastically. Sandy enters the scene, scanning the room until he spots them, and approaches their table with a smile on his face. She gestures toward Chuck and places a comforting hand on his shoulder. Big Chuck nods in understanding, and she leads him confidently to the dance floor. Diana and Big Chuck begin to shimmy to the music, and, with her eyes intently focused on Sandy, Diana provocatively pinches Chuck's nipples through his shirt fabric. As they spin around, Diana bends over, and Big Chuck playfully twirls his cowboy hat behind her, mimicking the motion of riding a bronco. She stands upright, and they continue to dance with her gaze fixed on Sandy, who makes a motion toward the exit door. Now facing Chuck, Diana shimmies in place before suddenly dropping into a dramatic split, bringing her face startlingly close to his crotch. Big Chuck, playing along, points playful finger guns at Sandy as Diana continues to energetically dance on the floor. They proceed to enter a modest motel room where Sandy deposits his wallet on a nearby surface. Chuck steps into Diana's open arms, and Big Chuck swiftly removes his belt, swinging it upward from his crotch like an elephant's trunk and striking Sandy across the face. Chuck delivers a final slap with the belt before letting it fall to the ground. He then aims a mock finger gun at his crotch, unbuttons his pants, and lets them drop. She gives Big Chuck a spanking as he rapidly knocks his knees together. Diana seizes the opportunity to swipe the anxiety pills, and as Chuck stumbles backward, he hurriedly pulls up his pants. Big Chuck firmly grabs hold of her hips from behind, and they tumble backward onto the bed together. Big Chuck spreads his legs upward in the air and sits up while Diana discreetly drops a pill into his cup, then proceeds to pour two drinks as he twitches and sways drunkenly."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a casual air, he nonchalantly pours out the vibrant blue liquid of Barbicide disinfectant from its designated container, allowing the glass vessel to slip from his grasp and fall to the floor, creating a loud, echoing clatter. Following this seemingly unbothered act, he confidently flips open a metallic Zippo lighter and deftly strikes it against his leg, summoning a small, flickering flame. Her jaw drops wide open in utter shock, as she points a trembling finger across the room toward the desk. Later that same evening, nestled within the cozy and comfortable confines of Sandy's car, Diana sits radiating a bright smile as she meticulously applies her makeup, using the mirror to perfect her appearance. Meanwhile, he maintains a forward-facing position, his expression locked in a stern and unyielding gaze, as he shakes his head slightly.\n\nAs they proceed to make their entrance into a bustling, lively restaurant, they are warmly greeted by a young waitress with strikingly vivid red hair. She welcomes them with a pleasant smile on her face before she walks away, still carrying that radiant smile. Raising his hand to catch the waitress's attention, he beckons to her, and she turns around, visibly startled upon laying her eyes on Sandy. Casting a sharp, piercing glance at Sandy, she departs as his gaze shifts, momentarily upward. The waitress soon returns, expertly balancing a large mound of food, and with a discreet gesture, she deftly removes her thumb from the edge of Sandy's soup. As the waitress retreats from their table, Diana eagerly takes a large and satisfying bite of succulent ribs.\n\nAt a dimly lit and somewhat enigmatic motel, they approach the front desk together, but she takes her leave shortly after. Diana confidently crosses the threshold into The Foxhole, where a husky man, sporting a thick beard and a cowboy hat, takes notice of her entrance. He nods slightly in acknowledgment, and Diana leisurely sips from her vibrantly green-colored beverage. Though he turns his attention away, she spots his luxurious Mercedes car key, along with the thick, opulent gold ring that adorns his pinky finger. Smiling warmly, the man takes a seat beside her, removes his cowboy hat, and extends his hand, showcasing a striking turquoise bolo tie. They toast to each other and swiftly down their shots of strong liquor. The two of them find a table to sit at, surrounding themselves with several empty shot glasses. As they take another shot, Diana, in a sudden burst of energy, enthusiastically slaps the table. Sandy enters the scene, scanning the room with his eyes until he spots them, and approaches their table with a smile on his face. She gestures toward Chuck, placing a comforting hand on his shoulder. Big Chuck nods in understanding, and Diana leads him confidently to the dance floor.\n\nDiana and Big Chuck start to shimmy to the lively music, and with her eyes intently focused on Sandy, Diana provocatively pinches Chuck's nipples through the fabric of his shirt. As they spin around with energetic flair, Diana bends over, and Big Chuck playfully twirls his cowboy hat behind her, mimicking the motion of riding a wild bronco. She stands upright once more, and they continue to dance, her gaze fixed intently on Sandy, who makes a subtle motion toward the exit door. Now facing Chuck, Diana shimmies in place before suddenly dropping into a dramatic split, bringing her face startlingly close to his crotch. Playing along with the scene, Big Chuck points playful finger guns at Sandy as Diana continues to energetically dance on the floor.\n\nThey proceed together into a modest motel room where Sandy places his wallet on a nearby surface. Chuck steps into Diana's inviting open arms, and with swift motions, Big Chuck removes his belt, swinging it upward from his crotch like an elephant's trunk, striking Sandy across the face. Chuck delivers a final slap with the belt before letting it fall to the ground. He then aims a mock finger gun at his crotch, humorously unbuttons his pants, and lets them drop. Seizing the moment, she gives Big Chuck a playful spanking as he rapidly knocks his knees together. Diana takes advantage of the opportunity to swipe the anxiety pills, and as Chuck stumbles backward, he hurriedly pulls up his pants. With firm hands, Big Chuck grabs hold of her hips from behind, and they tumble backward onto the bed together. Big Chuck spreads his legs upward in the air and sits up while Diana discreetly drops a pill into his cup, then proceeds to pour two drinks as he twitches and sways, clearly under the influence."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He nonchalantly pours the Barbicide disinfectant out of the glass container and lets it fall to the floor with a deliberate drop. With a sense of ease, he reaches into his pocket, retrieves a Zippo lighter, and flips it open with a flick of his thumb. He promptly strikes the lighter against his leg, producing a flame. Her mouth hangs open in surprise, and she points towards the desk, indicating something of interest or concern. Later that night, Diana is seated in Sandy's car, her lips curling into a smile as she meticulously applies her makeup, each stroke adding to her confident look. Meanwhile, he faces forward with a stern expression, his eyes fixed on an invisible point, and slightly shakes his head, communicating disapproval or disbelief. As they step through the doors of a restaurant, a young red-haired waitress greets them with a welcoming smile and then turns away, maintaining her cheerful demeanor as she walks off. He catches the waitress's attention with a signal, prompting her to turn around, her face quickly registering shock upon recognizing Sandy. Her features harden into a glare directed at Sandy, and she departs hastily while he directs his gaze upwards, perhaps searching for an explanation or solace. The waitress later returns, balancing a mound of food, and casually pulls her thumb from Sandy's soup, an action brimming with nonchalance. As the waitress departs, Diana enthusiastically grabs a rib and takes a large, satisfying bite. In a motel, they walk up to the front desk together before she steps away. Diana then enters The Foxhole, a local bar, where her presence is noticed by a husky, bearded man wearing a cowboy hat. He acknowledges her arrival with a slight nod to himself as Diana delicately sips her green beverage, savoring the taste. The man turns his attention away momentarily, giving Diana the opportunity to observe the Mercedes car key and thick gold ring on his pinky, subtly flaunting his affluence. He flashes a charming smile, joins her by sitting down, removes his hat with a flourish, and extends a hand, showcasing a turquoise bolo. Together, they clink glasses and promptly down their shots, engaging in a silent camaraderie. They settle at a table surrounded by several empty shot glasses, and, as they consume yet another shot, Diana energetically slaps the tabletop, signaling her enjoyment. Sandy makes his entrance, scanning the room with a broad smile, and confidently approaches their table. She gestures towards Chuck, placing a reassuring hand on his shoulder. Big Chuck acknowledges her cue with a nod, and she guides him to the dance floor. Diana and Big Chuck engage in a lively shimmy, with Diana maintaining steady eye contact with Sandy. Seizing the moment, she cheekily pinches Chuck's nipples through his shirt, adding a playful twist to the dance. Diana spins around in a seamless motion, bends over gracefully, and Big Chuck, caught up in the moment, twirls his cowboy hat behind her as if riding a bronco. She regains her stance, continuing the dance with her gaze fixed on Sandy, who subtly motions towards the door. Facing Chuck, Diana shimmies on the spot, then surprises the crowd by dropping into a split, positioning her face close to his crotch. Big Chuck responds by playfully pointing finger guns at Sandy as Diana continues to dance dynamically on the floor. They eventually find themselves in a motel room where Sandy casually sets his wallet down. Chuck approaches Diana, wrapping himself in her embrace, while Big Chuck removes his belt with a quick motion, swinging it upwards from his crotch in a comical manner, like an elephant’s trunk, and delivering a playful slap to Sandy's face. Chuck adds a final, exaggerated belt slap before letting the belt fall to the ground. He mimics aiming a finger gun at his crotch and proceeds to unbutton his pants, allowing them to drop. With a playful attitude, she spanks Big Chuck, prompting him to quickly knock his knees together in a humorous display. Diana seizes the moment to swipe the anxiety pills, while Chuck, struggling to regain his composure, pulls up his pants. Big Chuck seizes her hips from behind in a playful embrace, leading them to tumble backward onto the bed with a shared sense of mischief. Big Chuck lies back, playfully raising his legs in the air, and as he sits up, Diana discreetly slips a pill into his cup. She then pours out two drinks, ready for consumption, while he twitches in a drunken stupor, completing the scene of spontaneous revelry."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He disposes of the Barbicide disinfectant and discards the container, then uses a Zippo lighter with a quick flick on his leg. She reacts with surprise, pointing toward the desk. At night in Sandy's car, Diana applies makeup with a smile. He maintains a stern expression and shakes his head. They enter a restaurant, greeted by a young red-haired waitress who exits smiling. He gestures to the waitress, startling her as she notices Sandy, prompting her to leave while Sandy looks upward. The waitress returns with food, her thumb in Sandy's soup, and departs as Diana takes a large bite of ribs. They approach a motel front desk, and Diana leaves. At The Foxhole, Diana sips her drink while a bearded man in a cowboy hat notices her, nodding. She observes his Mercedes key and gold pinky ring. The man joins her, introduces himself with a handshake, and they toast before downing their shots. Sitting at a table littered with empty shot glasses, Diana slaps the table during another round. Sandy enters, scanning the room, and approaches with a smile. She gestures to Chuck and places a hand on his shoulder, leading him to the dance floor. Diana and Big Chuck dance, with Diana playfully pinching his nipples through his shirt. She spins and bends over, while Big Chuck twirls his hat like a rodeo act. They continue dancing, eyes on Sandy, who motions to the door. Diana faces Chuck and suddenly drops into a split near him. Big Chuck acknowledges Sandy with finger guns as Diana dances. In the motel room, Sandy puts down his wallet, and Chuck joins Diana, playfully removing his belt and hitting Sandy with it. Chuck finishes with a belt slap, then drops it, and unbuttons his pants. Diana spanks Big Chuck as he taps his knees quickly. She swipes the anxiety pills, and Chuck, stumbling, pulls up his pants. Big Chuck grabs Diana's hips, falling onto the bed with her. He sits up, legs in the air, while Diana discreetly places a pill in his cup and pours two drinks as he twitches drunkenly."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He casually pours out the Barbicide disinfectant, a product commonly used by barbers to sanitize combs and scissors, and drops the glass container on the floor, then flips open a Zippo lighter—an iconic brand known for its distinct metal casing and reliable flint wheel—and strikes it on his leg. Her mouth hangs open, and she points to the desk, cluttered with papers and a flickering lamp. At night, in Sandy's car, known for its vintage appeal with leather seats and a retro radio, Diana smiles as she applies makeup. He faces forward with a stern gaze and shakes his head, reflecting the tension between them. As they enter a restaurant, a young red-haired waitress greets them, then walks away smiling, her uniform hinting at the establishment's casual dining style. He signals the waitress, and she turns, shocked to see Sandy, who is a regular known for leaving large tips. She glares at Sandy and leaves as he looks upward, noticing the dimly lit chandelier. The waitress returns with a mound of food, including a dripping burger and crispy fries, and she pulls her thumb from Sandy's soup, a creamy tomato bisque. As the waitress leaves, Diana takes a large bite of ribs that are smothered in a tangy barbecue sauce. In a motel, they approach the front desk, where a bowl of faded brochures sits, and she leaves. Diana enters The Foxhole, a local bar famous for its live country music, where a husky bearded man in a cowboy hat notices her and nods to himself as Diana sips her green beverage, a vivid apple martini. He turns away, and she notices his Mercedes car key, a symbol of affluence, and a thick gold ring on his pinky. The man smiles, sits beside her, removes his hat to reveal a head of untamed curls, and extends a hand, wearing a turquoise bolo, a traditional Southwestern accessory. They toast and down their shots, a smoky mezcal. They sit at a table with several empty shot glasses, evidence of their earlier rounds, and as they drink another shot, Diana slaps the table, prompting laughter from nearby patrons. Sandy enters and scans the room, smiling as he approaches their table, his casual demeanor a stark contrast to the intensity of the scene. She points at Chuck, a local with a reputation for his dance skills, and places a hand on his shoulder. Big Chuck nods, and she leads him to the dance floor, surrounded by patrons tapping their feet to the upbeat country music. Diana and Big Chuck shimmy, her movements fluid and rhythmic, and with her eyes on Sandy, Diana pinches Chuck's nipples through his shirt, eliciting a playful yelp. Spinning around, Diana bends over, and Big Chuck twirls his cowboy hat behind her like riding a bronco, mimicking a rodeo performance. She stands and they continue dancing with her eyes on Sandy, who motions toward the door, suggesting they leave. Facing Chuck, Diana shimmies in place and suddenly drops into a split with her face by his crotch, an impressive display of flexibility. Big Chuck points finger guns at Sandy as Diana dances on the floor, the crowd's cheers growing louder. They enter a motel room, a modest space with nondescript decor, where Sandy sets down his wallet, which has seen better days. Chuck walks into Diana's arms, and Big Chuck whips off his belt, swinging it up from his crotch like an elephant's trunk, a playful yet surprising gesture, and hitting Sandy in the face. Chuck gives him a final belt slap, then drops it with a flourish. He aims a finger gun at his crotch and unbuttons his pants, dropping them, revealing bright red boxers. She spanks Big Chuck as he rapidly knocks his knees, adding to the chaotic energy. Diana swipes the anxiety pills, small white tablets, and stumbling back, Chuck pulls up his pants. Big Chuck grabs her hips from behind, and they fall backwards onto the bed, the springs creaking with their weight. Big Chuck spreads his legs in the air and sits up as Diana drops a pill into his cup, then pours two drinks as he twitches drunkenly, the alcohol visibly taking its toll."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Diana and Big Chuck shimmy and with her eyes on Sandy He casually pours out the Barbicide disinfectant and drops the glass container on the floor then flips open a Zippo lighter and strikes it on his leg Big Chuck spreads his legs in the air and sits up as Diana drops a pill into his cup then pours two drinks as he twitches drunkenly Her mouth hangs open and she points to the desk At night in Sandy's car Diana smiles as she applies makeup He faces forward with a stern gaze and shakes his head As they enter a restaurant a young redhaired waitress greets them then walks away smiling He signals the waitress and she turns shocked to see Sandy She glares at Sandy and leaves as he looks upward The waitress returns with a mound of food and she pulls her thumb from Sandy's soup They toast and down their shots As the waitress leaves Diana takes a large bite of ribs In a motel they approach the front desk and she leaves Diana enters The Foxhole where a husky bearded man in a cowboy hat notices her and nods to himself as Diana sips her green beverage As they enter a restaurant a young redhaired waitress greets them then walks away smiling He turns away and she notices his Mercedes car key and thick gold ring on his pinky Diana bends over and Big Chuck twirls his cowboy hat behind her like riding a bronco The man smiles sits beside her removes his hat and extends a hand wearing a turquoise bolo The waitress returns with a mound of food and she pulls her thumb from Sandy's soup At night in Sandy's car Diana smiles as she applies makeup Her mouth hangs open and she points to the desk She stands and they continue dancing with her eyes on Sandy who motions toward the door They toast and down their shots They sit at a table with several empty shot glasses and as they drink another shot Diana slaps the table Sandy enters and scans the room smiling as he approaches their table She points at Chuck and places a hand on his shoulder Big Chuck nods and she leads him to the dance floor Diana and Big Chuck shimmy and with her eyes on Sandy He casually pours out the Barbicide disinfectant and drops the glass container on the floor then flips open a Zippo lighter and strikes it on his leg Diana pinches Chuck's nipples through his shirt Spinning around Diana bends over and Big Chuck twirls his cowboy hat behind her like riding a bronco He faces forward with a stern gaze and shakes his head Chuck gives him a final belt slap then drops it She stands and they continue dancing with her eyes on Sandy who motions toward the door Facing Chuck Diana shimmies in place and suddenly drops into a split with her face by his crotch Big Chuck points finger guns at Sandy as Diana dances on the floor They enter a motel room where Sandy sets down his wallet Chuck walks into Diana's arms and Big Chuck whips off his belt swinging it up from his crotch like an elephant's trunk and hitting Sandy in the face Chuck gives him a final belt slap then drops it He aims a finger gun at his crotch and unbuttons his pants dropping them She spanks Big Chuck as he rapidly knocks his knees Chuck pulls up his pants Facing Chuck Diana shimmies in place and suddenly drops into a split with her face by his crotch Big Chuck nods and she leads him to the dance floor Diana swipes the anxiety pills and stumbling back Big Chuck grabs her hips from behind and they fall backwards onto the bed Diana swipes the anxiety pills and stumbling back Chuck pulls up his pants Big Chuck grabs her hips from behind and they fall backwards onto the bed Big Chuck spreads his legs in the air and sits up as Diana drops a pill into his cup then pours two drinks as he twitches drunkenly"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He casually pours out the Barbicide disinfectant and drops the glass container on the floor then flips open a Zippo lighter and strikes it on his leg. Her mouth hangs open and she points to the desk. At night in Sandy's car Diana smiles as she applies makeup. He faces forward with a stern gaze and shakes his head. As they enter a restaurant a young redhaired waitress greets them then walks away smiling. He signals the waitress and she turns shocked to see Sandy. She glares at Sandy and leaves as he looks upward. The waitress returns with a mound of food and she pulls her thumb from Sandy's soup. As the waitress leaves Diana takes a large bite of ribs. In a motel they approach the front desk and she leaves. Diana enters The Foxhole where a husky bearded man in a cowboy hat notices her and nods to himself as Diana sips her green beverage. He turns away and she notices his Mercedes car key and thick gold ring on his pinky. The man smiles sits beside her removes his hat and extends a hand wearing a turquoise bolo. They toast and down their shots. They sit at a table with several empty shot glasses and as they drink another shot Diana slaps the table. Sandy enters and scans the room smiling as he approaches their table. She points at Chuck and places a hand on his shoulder. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Big Chuck nods and she leads him to the dance floor. Diana and Big Chuck shimmy and with her eyes on Sandy. Diana pinches Chuck's nipples through his shirt. Spinning around. Diana bends over and Big Chuck twirls his cowboy hat behind her like riding a bronco. She stands and they continue dancing with her eyes on Sandy who motions toward the door. Facing Chuck Diana shimmies in place and suddenly drops into a split with her face by his crotch. Big Chuck points finger guns at Sandy as Diana dances on the floor. They enter a motel room where Sandy sets down his wallet. Chuck walks into Diana's arms and Big Chuck whips off his belt swinging it up from his crotch like an elephant's trunk and hitting Sandy in the face. Chuck gives him a final belt slap then drops it. He aims a finger gun at his crotch and unbuttons his pants dropping them. She spanks Big Chuck as he rapidly knocks his knees. Diana swipes the anxiety pills and stumbling back. Chuck pulls up his pants. Big Chuck grabs her hips from behind and they fall backwards onto the bed. Big Chuck spreads his legs in the air and sits up as Diana drops a pill into his cup then pours two drinks as he twitches drunkenly."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He casually pours out the Barbicide disinfectant and drops the glass container on the floor then flips open a Zippo lighter and strikes it on his leg. Her mouth hangs open and she points to the desk. At night in Sandy's car Diana smiles as she applies makeup. He faces forward with a stern gaze and shakes his head. As they enter a restaurant a young redhaired waitress greets them then walks away smiling. He signals the waitress and she turns shocked to see Sandy. She glares at Sandy and leaves as he looks upward. The waitress returns with a mound of food and she pulls her thumb from Sandy's soup. As the waitress leaves Diana takes a large bite of ribs. In a motel they approach the front desk and she leaves. Diana enters The Foxhole where a husky bearded man in a cowboy hat notices her and nods to himself as Diana sips her green beverage. He turns away and she notices his Mercedes car key and thick gold ring on his pinky. The man smiles sits beside her removes his hat and extends a hand wearing a turquoise bolo. They toast and down their shots. They sit at a table with several empty shot glasses and as they drink another shot Diana slaps the table. Sandy enters and scans the room smiling as he approaches their table. She points at Chuck and places a hand on his shoulder. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Big Chuck nods and she leads him to the dance floor. Diana and Big Chuck shimmy and with her eyes on Sandy. Diana pinches Chuck's nipples through his shirt. Spinning around. Diana bends over and Big Chuck twirls his cowboy hat behind her like riding a bronco. She stands and they continue dancing with her eyes on Sandy who motions toward the door. Facing Chuck Diana shimmies in place and suddenly drops into a split with her face by his crotch. Big Chuck points finger guns at Sandy as Diana dances on the floor. They enter a motel room where Sandy sets down his wallet. Chuck walks into Diana's arms and Big Chuck whips off his belt swinging it up from his crotch like an elephant's trunk and hitting Sandy in the face. Chuck gives him a final belt slap then drops it. He aims a finger gun at his crotch and unbuttons his pants dropping them. She spanks Big Chuck as he rapidly knocks his knees. Diana swipes the anxiety pills and stumbling back. Chuck pulls up his pants. Big Chuck grabs her hips from behind and they fall backwards onto the bed. Big Chuck spreads his legs in the air and sits up as Diana drops a pill into his cup then pours two drinks as he twitches drunkenly."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He casually pours out the Barbicide disinfectant and drops the glass container on the floor then flips open a Zippo lighter and strikes it on his leg. Her mouth hangs open and she points to the desk. At night in Sandy's car Diana smiles as she applies makeup. He faces forward with a stern gaze and shakes his head. As they enter a restaurant a young redhaired waitress greets them then walks away smiling. He signals the waitress and she turns shocked to see Sandy. She glares at Sandy and leaves as he looks upward. The waitress returns with a mound of food and she pulls her thumb from Sandy's soup. As the waitress leaves Diana takes a large bite of ribs. Chuck walks into Diana's arms and Big Chuck whips off his belt swinging it up from his crotch like an elephant's trunk and hitting Sandy in the face. Chuck gives him a final belt slap then drops it. He aims a finger gun at his crotch and unbuttons his pants dropping them. She spanks Big Chuck as he rapidly knocks his knees. Diana swipes the anxiety pills and stumbling back. Chuck pulls up his pants. Big Chuck grabs her hips from behind and they fall backwards onto the bed. Big Chuck spreads his legs in the air and sits up as Diana drops a pill into his cup then pours two drinks as he twitches drunkenly."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He casually pours out the Barbicide disinfectant and drops the glass container on the floor then flips open a Zippo lighter and strikes it on his leg. Her mouth hangs open and she points to the desk. At night in Sandy's car Diana smiles as she applies makeup. He faces forward with a stern gaze and shakes his head. Chuck pulls up his pants. Big Chuck grabs her hips from behind and they fall backwards onto the bed. Big Chuck spreads his legs in the air and sits up as Diana drops a pill into his cup then pours two drinks as he twitches drunkenly."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The elephant casually pours out the Barbicide disinfectant and drops the glass container on the floor, then flips open a Zippo lighter and strikes it on his leg. Her mouth hangs open, and the rabbit points to the desk. At night, in Sandy's car, the penguin smiles as she applies makeup. The kangaroo faces forward with a stern gaze and shakes his head. As they enter a restaurant, a young red-haired waitress greets them, then walks away smiling. The giraffe signals the waitress, and she turns, shocked to see Sandy. She glares at Sandy and leaves as the turtle looks upward. The waitress returns with a mound of food, and she pulls her thumb from Sandy's soup. As the waitress leaves, the unicorn takes a large bite of ribs. In a motel, they approach the front desk, and the squirrel leaves. The wolf enters The Foxhole, where a husky bearded man in a cowboy hat notices her and nods to himself as the wolf sips her green beverage. The octopus turns away, and she notices his Mercedes car key and thick gold ring on his pinky. The man smiles, sits beside her, removes his hat, and extends a hand, wearing a turquoise bolo. They toast and down their shots. They sit at a table with several empty shot glasses, and as they drink another shot, the hedgehog slaps the table. Sandy enters and scans the room, smiling as he approaches their table. The panda points at Chuck and places a hand on his shoulder. Big Chuck nods, and the ladybug leads him to the dance floor. The fox and Big Chuck shimmy, and with her eyes on Sandy, the elephant pinches Chuck's nipples through his shirt. Spinning around, the rabbit bends over, and Big Chuck twirls his cowboy hat behind her like riding a bronco. The owl stands and they continue dancing with her eyes on Sandy, who motions toward the door. Facing Chuck, the dolphin shimmies in place and suddenly drops into a split with her face by his crotch. Big Chuck points finger guns at Sandy as the cheetah dances on the floor. They enter a motel room where Sandy sets down his wallet. The horse walks into the zebra's arms, and Big Chuck whips off his belt, swinging it up from his crotch like an elephant's trunk and hitting Sandy in the face. The octopus gives him a final belt slap, then drops it. The raccoon aims a finger gun at his crotch and unbuttons his pants, dropping them. The koala spanks Big Chuck as he rapidly knocks his knees. The lion swipes the anxiety pills, and stumbling back, the camel pulls up his pants. Big Chuck grabs the flamingo's hips from behind, and they fall backwards onto the bed. Big Chuck spreads his legs in the air and sits up as the parrot drops a pill into his cup, then pours two drinks as he twitches drunkenly."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He casually pours out the olive oil and drops the ceramic vase on the floor, then flips open a Swiss Army knife and flicks it on his leg. Her mouth hangs open, and she points to the bookshelf. At night, in Sandy's truck, Diana smiles as she applies lotion. He faces forward with a stern gaze and shakes his head. As they enter a bistro, a young red-haired hostess greets them, then walks away smiling. He signals the hostess, and she turns, shocked to see Sandy. She glares at Sandy and leaves as he looks upward. The hostess returns with a tower of sandwiches, and she pulls her finger from Sandy's stew. As the hostess leaves, Diana takes a large bite of wings. In a cabin, they approach the check-in counter, and she leaves. Diana enters The Hideout, where a lanky bearded man in a fedora notices her and nods to himself as Diana sips her blue drink. He turns away, and she notices his Tesla car key and thick silver bracelet on his wrist. The man smiles, sits beside her, removes his fedora, and extends a hand, wearing a leather wristband. They toast and down their martinis. They sit at a table with several empty martini glasses, and as they drink another martini, Diana slaps the table. Sandy enters and scans the room, smiling as he approaches their table. She points at Chuck and places a hand on his shoulder. Big Chuck nods, and she leads him to the dance floor. Diana and Big Chuck jitterbug, and with her eyes on Sandy, Diana pinches Chuck's cheek through his shirt. Spinning around, Diana bends over, and Big Chuck twirls his fedora behind her like swinging a lasso. She stands and they continue dancing with her eyes on Sandy, who motions toward the door. Facing Chuck, Diana shimmies in place and suddenly drops into a split with her face near his knees. Big Chuck points finger guns at Sandy as Diana dances on the floor. They enter a cabin room where Sandy sets down his briefcase. Chuck walks into Diana's arms, and Big Chuck whips off his scarf, swinging it up from his chest like a peacock's feather and hitting Sandy in the cheek. Chuck gives him a final scarf flick, then drops it. He aims a finger gun at his chest and unbuttons his shirt, dropping it. She spanks Big Chuck as he rapidly knocks his heels. Diana swipes the mints, and stumbling back, Chuck pulls up his shirt. Big Chuck grabs her shoulders from behind, and they fall backwards onto the couch. Big Chuck spreads his arms in the air and sits up as Diana drops a mint into his mug, then pours two drinks as he twitches drunkenly."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He casually spills the Barbicide disinfectant and tosses the glass container across the room, then flicks open a Zippo lighter and brushes it against his arm. Her mouth remains closed, and she gestures toward the window. At night, in Sandy's car, Diana laughs as she brushes her hair. He looks sideways with a playful grin and nods his head. As they exit a restaurant, a young red-haired waitress nods to them, then skips away giggling. He waves at the waitress, and she spins around, surprised to see Sandy. She frowns at Sandy and stays as he glances downward. The waitress arrives with a tray of food, and she flicks her finger at Sandy's soup. As the waitress stays, Diana takes a tiny nibble of ribs. In a motel, they leave the front desk, and she enters. Diana exits The Foxhole, where a husky bearded man in a cowboy hat spots her and winks to himself as Diana twirls her green beverage. He turns toward her, and she inspects his Mercedes car key and thick gold ring on his pinky. The man frowns, stands away from her, puts on his hat, and folds a hand, wearing a turquoise bolo. They clink and sip their shots. They stand by a table with several full shot glasses, and as they sip another shot, Diana taps the table. Sandy exits and surveys the room, frowning as he circles their table. She gestures at Chuck and removes a hand from his shoulder. Big Chuck shakes his head, and she stops him on the dance floor. Diana and Big Chuck waltz, and with her eyes on Sandy, Diana flicks Chuck's ears through his shirt. Twisting around, Diana leaps up, and Big Chuck drops his cowboy hat behind her like tossing a frisbee. She crouches and they halt dancing with her eyes on Sandy, who waves toward the window. Facing Chuck, Diana bobs in place and suddenly floats into a jump with her face by his chest. Big Chuck taps finger guns at Sandy as Diana kneels on the floor. They exit a motel room where Sandy picks up his wallet. Chuck slips out of Diana's arms, and Big Chuck slides off his belt, swaying it up from his knee like a snake’s head and slapping Sandy on the back. Chuck hands him a final belt toss, then grips it. He shakes a finger gun at his knee and ties his shoes, raising them. She hugs Big Chuck as he rapidly claps his hands. Diana grabs the anxiety pills, and stumbling forward, Chuck rolls up his sleeves. Big Chuck pats her back from behind, and they tumble forwards onto the bed. Big Chuck claps his hands in the air and lies down as Diana tosses a pill into his glass, then mixes two drinks as he sings drunkenly."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The toaster casually pours out the lemonade and drops the notebook on the rug, then flips open a smartphone and strikes it on its armchair. The refrigerator's door hangs open, and it points to the carpet. At night, in the bookshelf's train, the bicycle smiles as it applies glue. The toaster faces forward with a stern gaze and shakes its handle. As they enter a barn, a young blue-haired gardener greets them, then walks away smiling. The toaster signals the gardener, and it turns, shocked to see the bookshelf. It glares at the bookshelf and leaves as the toaster looks upward. The gardener returns with a mound of books, and it pulls its thumb from the bookshelf's magazine. As the gardener leaves, the bicycle takes a large bite of balloons. In a greenhouse, they approach the back wall, and it leaves. The bicycle enters The Toolbox, where a lanky bald man in a fedora notices it and nods to itself as the bicycle sips its purple ink. It turns away, and the bicycle notices its mansion doorbell and slim plastic card on its backpack. The man smiles, sits beside it, removes its beret, and extends a branch, wearing a silver choker. They toast and down their teas. They sit at a counter with several empty mugs, and as they sip another cup, the bicycle slaps the counter. The bookshelf enters and scans the room, smiling as it approaches their counter. It points at the Hammer and places a wheel on its elbow. Big Hammer nods, and it leads it to the racetrack. The bicycle and Big Hammer shimmy, and with its handle on the bookshelf, the bicycle pinches Hammer's shoelaces through its boot. Spinning around, the bicycle bends over, and Big Hammer twirls its scarf behind it like twirling a lasso. It stands and they continue moving with its handle on the bookshelf, which motions toward the passageway. Facing Hammer, the bicycle shimmies in place and suddenly drops into a split with its handle by its knee. Big Hammer points laser pointers at the bookshelf as the bicycle glides on the track. They enter a greenhouse where the bookshelf sets down its suitcase. Hammer walks into the bicycle's branches, and Big Hammer whips off its ribbon, swinging it up from its knee like a cat's tail and hitting the bookshelf in the face. Hammer gives it a final ribbon slap, then drops it. It aims a laser pointer at its knee and unbuttons its jacket, dropping it. The bicycle spanks Big Hammer as it rapidly knocks its toes. The bicycle swipes the confusion marbles, and stumbling back, Hammer pulls up its jacket. Big Hammer grabs its pedals from behind, and they fall backwards onto the carpet. Big Hammer spreads its branches in the air and sits up as the bicycle drops a marble into its saucer, then pours two juices as it twitches giddily."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He casually spills out the lemonade and tosses the glass container on the floor, then flicks open a pocketknife and slides it on his leg. Her eyes widen, and she gestures to the desk. At night, in Brian's car, Emma grins as she adjusts her scarf. He looks ahead with a calm gaze and nods. As they enter a bookstore, a young blonde barista welcomes them, then strolls away whistling. He waves to the barista, and she turns, surprised to see Brian. She frowns at Brian and departs as he glances upward. The barista returns with a stack of magazines, and she wipes her hand on Brian's book. As the barista leaves, Emma takes a big sip of coffee. In a diner, they approach the cashier, and she departs. Emma enters The Rabbit Hole, where a tall tattooed man in a leather jacket observes her and chuckles to himself as Emma sips her white wine. He looks away, and she notices his vintage watch and silver chain on his wrist. The man grins, sits beside her, removes his jacket, and offers a handshake, wearing a plaid shirt. They clink glasses and sip their drinks. They sit at a booth with several half-empty glasses, and as they order another drink, Emma knocks on the table. Brian enters and surveys the room, grinning as he makes his way to their booth. She gestures at Tim and places a hand on his back. Big Tim nods, and she guides him to the jukebox. Emma and Big Tim shuffle, and with her eyes on Brian, Emma tickles Tim's ribs through his shirt. Twisting around, Emma leans down, and Big Tim spins his bandana over her like a ringmaster. She stands and they keep dancing with her eyes on Brian, who motions toward the window. Facing Tim, Emma sways in place and suddenly drops to the floor with her face by his feet. Big Tim gives a thumbs-up to Brian as Emma rolls on the floor. They enter a cabin where Brian places his hat. Tim walks into Emma's arms, and Big Tim snaps off his suspenders, swinging them up from his waist like a lasso and catching Brian on the cheek. Tim gives him a final snap, then drops them. He mimics shooting at his waist and loosens his shirt, unbuttoning it. She pats Big Tim as he quickly taps his feet. Emma snags the candy bar, and stumbling forward, Tim buttons up his shirt. Big Tim holds her hands from behind, and they collapse backwards onto the couch. Big Tim kicks his feet in the air and sits up as Emma drops a mint into his glass, then fills two cups as he sways woozily."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He casually empties the cologne and tosses the clay jar on the ceiling, then snaps open a penknife and brushes it on his elbow. Her eyebrows lift, and she gestures to the sofa. At dawn, in Sandy's boat, Diana grins as she eats ice cream. He looks away with a gentle smile and nods his head. As they exit a library, a young blond-haired conductor welcomes them, then jogs away singing. He waves at the conductor, and she stops, surprised to see Sandy. She frowns at Sandy and departs as he glances sideways. The conductor returns with a crate of fruit, and she removes her index finger from Sandy's juice. As the conductor departs, Diana takes a big gulp of pasta. In a cabin, they head to the back porch, and she vanishes. Diana enters The Rabbit Hole, where a lanky-haired man in a bowler hat observes her and mutters to himself as Diana gulps her pink beverage. He turns aside, and she spots his Tesla car key and shiny silver necklace on his neck. The man laughs, sits beside her, removes his bowler, and offers a foot, wearing a leather sandal. They cheer and sip their smoothies. They sit on a bench with several empty soda cans, and as they finish another drink, Diana taps the bench. Sandy enters and surveys the area, grinning as he nears their bench. She gestures at Chuck and lays a foot on his lap. Big Chuck grins, and she steers him to the garden path. Diana and Big Chuck sway, and with her gaze on Sandy, Diana tickles Chuck's ribs through his jacket. Twisting around, Diana crouches, and Big Chuck tosses his fedora like flipping a pizza. She rises and they keep moving with her gaze on Sandy, who gestures toward the porch. Facing Chuck, Diana wiggles in place and suddenly leaps into a flip with her face by his belt. Big Chuck winks at Sandy as Diana rolls on the grass. They enter a camper where Sandy sets down his comb. Chuck steps into Diana's arms, and Big Chuck flings off his tie, waving it up from his neck like a snake charmer and brushing Sandy's cheek. Chuck gives him a final tie tap, then lets it fall. He mimics a boxing move at his chest and unzips his jacket, dropping it. She tickles Big Chuck as he quickly claps his hands. Diana snatches the headache balm, and tripping forward, Chuck lifts his jacket. Big Chuck holds her shoulders from the front, and they topple sideways onto the couch. Big Chuck stretches his arms in the air and leans back as Diana slips a balm into his bottle, then fills two cups as he hiccups joyfully."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "He leisurely sprays the insect repellent and tosses the clay jug onto the grass, then snaps open a matchbox and ignites it against his shoe. Her eyes widen, and she gestures toward the bookshelf. At dawn, in Michael's boat, Olivia grins as she fixes her hair. He stares ahead with a calm expression and nods his head. As they step into a museum, a young blonde usher greets them, then strolls away chuckling. He waves to the usher, and she spins around, surprised to spot Michael. She frowns at Michael and departs as he glances upward. The usher reappears carrying a platter of fruit, and she lifts her finger from Michael's salad. As the usher departs, Olivia takes a massive bite of bread. In a cabin, they approach the gift shop counter, and she departs. Olivia enters The Hideout, where a tall bearded gentleman in a bowler hat observes her and nods to himself as Olivia sips her orange drink. He glances away, and she notices his Jaguar car key and large silver bracelet on his wrist. The gentleman grins, sits next to her, removes his hat, and offers a handshake, wearing a leather wristband. They clink glasses and drink their shots. They gather at a booth with many empty shot glasses, and as they drink another shot, Olivia taps the booth. Michael enters and surveys the area, smiling as he reaches their booth. She gestures at Bob and places a hand on his elbow. Big Bob nods, and she guides him to the dance floor. Olivia and Big Bob shimmy, and with her gaze on Michael, Olivia pinches Bob's shoulders through his jacket. Twirling around, Olivia leans backward, and Big Bob swings his bowler hat beside her like riding a carousel. She stands and they keep dancing with her gaze on Michael, who gestures toward the exit. Facing Bob, Olivia shimmies on the spot and suddenly dives into a crouch with her face near his knee. Big Bob fires imaginary arrows at Michael as Olivia dances on the ground. They enter a suite where Michael drops his hat. Bob steps into Olivia's embrace, and Big Bob snaps off his scarf, waving it upward from his neck like a magician's wand and tapping Michael on the head. Bob lands a final scarf swipe, then drops it. He mimics holding a telescope and unzips his jacket, dropping it. She pats Big Bob on the back as he swiftly clicks his heels. Olivia snatches the energy tablets, and stumbling backward, Bob hoists his jacket. Big Bob grips her shoulders from behind, and they tumble backward onto the couch. Big Bob swings his arms in the air and sits up as Olivia slips a tablet into his glass, then fills two cups as he shivers sleepily."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "He empties the Barbicide and drops the container before lighting a Zippo. That night, Diana smiles while applying makeup in Sandy’s car. At a restaurant, they are served by a shocked waitress who reluctantly brings their food. Later, they check into a motel, and Diana enters The Foxhole. A bearded man, Big Chuck, notices her, and they share drinks, with him flaunting his wealth. Sandy joins them, and Diana leads Chuck to the dance floor, keeping an eye on Sandy. They dance provocatively until Sandy motions toward the door. In a motel room, Sandy sets down his wallet, and Big Chuck uses his belt to hit Sandy. Diana takes Sandy's anxiety pills and mixes one into Chuck's drink, who drinks before passing out."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Big Chuck spreads his legs in the air and sits up as Diana drops a pill into his cup then pours two drinks as he twitches drunkenly Big Chuck grabs her hips from behind and they fall backwards onto the bed Chuck pulls up his pants Diana swipes the anxiety pills and stumbling back She spanks Big Chuck as he rapidly knocks his knees He aims a finger gun at his crotch and unbuttons his pants dropping them Chuck gives him a final belt slap then drops it Chuck walks into Diana's arms and Big Chuck whips off his belt swinging it up from his crotch like an elephant's trunk and hitting Sandy in the face They enter a motel room where Sandy sets down his wallet Big Chuck points finger guns at Sandy as Diana dances on the floor Facing Chuck Diana shimmies in place and suddenly drops into a split with her face by his crotch She stands and they continue dancing with her eyes on Sandy who motions toward the door Diana bends over and Big Chuck twirls his cowboy hat behind her like riding a bronco Spinning around Diana pinches Chuck's nipples through his shirt Diana and Big Chuck shimmy and with her eyes on Sandy Big Chuck nods and she leads him to the dance floor She points at Chuck and places a hand on his shoulder Sandy enters and scans the room smiling as he approaches their table They sit at a table with several empty shot glasses and as they drink another shot Diana slaps the table They toast and down their shots The man smiles sits beside her removes his hat and extends a hand wearing a turquoise bolo He turns away and she notices his Mercedes car key and thick gold ring on his pinky Diana enters The Foxhole where a husky bearded man in a cowboy hat notices her and nods to himself as Diana sips her green beverage In a motel they approach the front desk and she leaves As the waitress leaves Diana takes a large bite of ribs The waitress returns with a mound of food and she pulls her thumb from Sandy's soup She glares at Sandy and leaves as he looks upward He signals the waitress and she turns shocked to see Sandy As they enter a restaurant a young redhaired waitress greets them then walks away smiling He faces forward with a stern gaze and shakes his head At night in Sandy's car Diana smiles as she applies makeup Her mouth hangs open and she points to the desk He casually pours out the Barbicide disinfectant and drops the glass container on the floor then flips open a Zippo lighter and strikes it on his leg"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "She points at Chuck and places a hand on his shoulder As the waitress leaves Diana takes a large bite of ribs Diana and Big Chuck shimmy and with her eyes on Sandy He aims a finger gun at his crotch and unbuttons his pants dropping them She stands and they continue dancing with her eyes on Sandy who motions toward the door Diana swipes the anxiety pills and stumbling back He faces forward with a stern gaze and shakes his head Spinning around Big Chuck nods and she leads him to the dance floor Chuck pulls up his pants Big Chuck spreads his legs in the air and sits up as Diana drops a pill into his cup then pours two drinks as he twitches drunkenly They sit at a table with several empty shot glasses and as they drink another shot Diana slaps the table Chuck gives him a final belt slap then drops it Diana enters The Foxhole where a husky bearded man in a cowboy hat notices her and nods to himself as Diana sips her green beverage As they enter a restaurant a young redhaired waitress greets them then walks away smiling He casually pours out the Barbicide disinfectant and drops the glass container on the floor then flips open a Zippo lighter and strikes it on his leg Big Chuck grabs her hips from behind and they fall backwards onto the bed The man smiles sits beside her removes his hat and extends a hand wearing a turquoise bolo Big Chuck points finger guns at Sandy as Diana dances on the floor He turns away and she notices his Mercedes car key and thick gold ring on his pinky Her mouth hangs open and she points to the desk Sandy enters and scans the room smiling as he approaches their table She glares at Sandy and leaves as he looks upward She spanks Big Chuck as he rapidly knocks his knees Diana pinches Chuck's nipples through his shirt He signals the waitress and she turns shocked to see Sandy Chuck walks into Diana's arms and Big Chuck whips off his belt swinging it up from his crotch like an elephant's trunk and hitting Sandy in the face They toast and down their shots Diana bends over and Big Chuck twirls his cowboy hat behind her like riding a bronco Facing Chuck Diana shimmies in place and suddenly drops into a split with her face by his crotch In a motel they approach the front desk and she leaves The waitress returns with a mound of food and she pulls her thumb from Sandy's soup At night in Sandy's car Diana smiles as she applies makeup They enter a motel room where Sandy sets down his wallet"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Big Chuck nods and she leads him to the dance floor Diana and Big Chuck shimmy and with her eyes on Sandy Diana pinches Chuck's nipples through his shirt Spinning around Diana bends over and Big Chuck twirls his cowboy hat behind her like riding a bronco She stands and they continue dancing with her eyes on Sandy who motions toward the door Facing Chuck Diana shimmies in place and suddenly drops into a split with her face by his crotch Big Chuck points finger guns at Sandy as Diana dances on the floor They enter a motel room where Sandy sets down his wallet Chuck walks into Diana's arms and Big Chuck whips off his belt swinging it up from his crotch like an elephant's trunk and hitting Sandy in the face Chuck gives him a final belt slap then drops it He aims a finger gun at his crotch and unbuttons his pants dropping them She spanks Big Chuck as he rapidly knocks his knees Diana swipes the anxiety pills and stumbling back Chuck pulls up his pants Big Chuck grabs her hips from behind and they fall backwards onto the bed Big Chuck spreads his legs in the air and sits up as Diana drops a pill into his cup then pours two drinks as he twitches drunkenly He casually pours out the Barbicide disinfectant and drops the glass container on the floor then flips open a Zippo lighter and strikes it on his leg Her mouth hangs open and she points to the desk At night in Sandy's car Diana smiles as she applies makeup He faces forward with a stern gaze and shakes his head As they enter a restaurant a young redhaired waitress greets them then walks away smiling He signals the waitress and she turns shocked to see Sandy She glares at Sandy and leaves as he looks upward The waitress returns with a mound of food and she pulls her thumb from Sandy's soup As the waitress leaves Diana takes a large bite of ribs In a motel they approach the front desk and she leaves Diana enters The Foxhole where a husky bearded man in a cowboy hat notices her and nods to himself as Diana sips her green beverage He turns away and she notices his Mercedes car key and thick gold ring on his pinky The man smiles sits beside her removes his hat and extends a hand wearing a turquoise bolo They toast and down their shots They sit at a table with several empty shot glasses and as they drink another shot Diana slaps the table Sandy enters and scans the room smiling as he approaches their table She points at Chuck and places a hand on his shoulder"
        }
      ]
    }
  ]
}