{
  "ground_truth": "She empties out a mini bottle and bites the top off another. Shaking his cup, she turns with a playful smile and sashays back and forth. Diana's smile quickly fades, and she sets down the drinks. Diana blinks her moist eyes. He points to her blue gingham blouse. Big Chuck tenses his face and nods. Diana glances off with a sweet smile as Chuck slowly removes his cowboy hat. He gazes into her eyes. She leaps on him. Sandy listens from the bathroom and rubs his face. Diana grips the bed as Chuck thrusts behind her. Sandy covers his ears. She falls onto her back. Sandy turns on the shower. Sandy ties a towel around his ears as Diana yanks on Chuck's neck with his belt. Now, she holds his legs from behind and bounces rapidly. Sandy buries his head in his hands. Lying on the floor, Sandy kicks the wall. Diana spots Big Chuck's wallet and car keys on a small table, and her smile fades. She finishes buttoning her shirt and glances back at the sleeping man. She notices Sandy's wallet and phone by the room key on the dresser. Stepping forward, she collects Sandy's things and grabs Big Chuck's belt off the floor. The plump criminal shifts in place. Sandy's eyes shoot open, and he pulls the towel off his head. Outside, she staggers away. Sandy yanks on the bathroom door handle. On the other side, Big Chuck's belt holds it closed. She crosses the quiet motel parking lot with a backpack in hand. Diana slings the bag over her shoulder, and it slides off as she arrives at Sandy's car. Sliding into the driver's seat, Diana tosses the bag into the next seat and places Sandy's phone in the center console. She leans forward and inserts the key into the ignition. Sitting back, Diana pulls a small amount of cash from Sandy's wallet and sifts through the bills. Grabbing Sandy's cell phone, she admires the photo of his smiling daughters. Diana holds the phone to her ear. Tensing her face, Diana fights back tears. The thief covers her eyes, then shifts her pained gaze around. Diana closes her eyes and places both hands on the wheel. Removing one, she rubs her forehead. Now, she enters the motel room and puts Sandy's belongings back on the dresser. Sandy crashes through the bathroom door. He quickly kneels. She moves across the room with the ice bucket and sets it on the bedside table. Taking off the backpack, Diana lies down next to Big Chuck. She takes all the blankets, revealing his naked rear end. Sandy stands up and eyes the room. The next morning, Sandy waits by the car as Diana approaches with sunglasses and disheveled hair.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She empties out a tiny bottle and bites the top off another. Shaking his cup, she turns with a playful grin and sashays back and forth. Diana's grin quickly fades, and she sets down the beverages. Diana blinks her damp eyes. He points to her blue gingham shirt. Big Chuck tenses his face and nods. Diana glances off with a sweet grin as Chuck slowly removes his cowboy hat. He gazes into her eyes. She leaps on him. Sandy listens from the lavatory and rubs his face. Diana grips the bed as Chuck thrusts behind her. Sandy covers his ears. She falls onto her back. Sandy turns on the shower. Sandy ties a towel around his ears as Diana yanks on Chuck's neck with his belt. Now, she holds his legs from behind and bounces rapidly. Sandy buries his head in his hands. Lying on the floor, Sandy kicks the wall. Diana spots Big Chuck's billfold and car keys on a small table, and her grin fades. She finishes buttoning her blouse and glances back at the sleeping man. She notices Sandy's billfold and phone by the room key on the dresser. Stepping forward, she collects Sandy's things and grabs Big Chuck's belt off the floor. The plump felon shifts in place. Sandy's eyes shoot open, and he pulls the towel off his head. Outside, she staggers away. Sandy yanks on the lavatory door handle. On the other side, Big Chuck's belt holds it closed. She crosses the quiet motel parking lot with a backpack in hand. Diana slings the bag over her shoulder, and it slides off as she arrives at Sandy's automobile. Sliding into the driver's seat, Diana tosses the bag into the next seat and places Sandy's phone in the center console. She leans forward and inserts the key into the ignition. Sitting back, Diana pulls a small amount of currency from Sandy's billfold and sifts through the bills. Grabbing Sandy's cell phone, she admires the photo of his smiling daughters. Diana holds the phone to her ear. Tensing her face, Diana fights back tears. The thief covers her eyes, then shifts her pained gaze around. Diana closes her eyes and places both hands on the wheel. Removing one, she rubs her forehead. Now, she enters the motel room and puts Sandy's belongings back on the dresser. Sandy crashes through the lavatory door. He quickly kneels. She moves across the room with the ice bucket and sets it on the bedside table. Taking off the backpack, Diana lies down next to Big Chuck. She takes all the blankets, revealing his naked rear end. Sandy stands up and eyes the room. The next morning, Sandy waits by the automobile as Diana approaches with shades and disheveled hair."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A mini bottle is emptied by her, and the top of another is bitten off by her. Shaking his cup, a playful smile is turned with by her as she sashays back and forth. The drinks are set down by Diana as her smile quickly fades. Her moist eyes are blinked by Diana. Her blue gingham blouse is pointed to by him. Big Chuck nods and tenses his face. A sweet smile is given off by Diana as Chuck slowly removes his cowboy hat. Her eyes are gazed into by him. He is leapt on by her. The bathroom is listened to by Sandy as he rubs his face. The bed is gripped by Diana as she is thrust behind by Chuck. His ears are covered by Sandy. Her back is fallen onto by her. The shower is turned on by Sandy. A towel is tied around his ears by Sandy as Chuck's neck is yanked on by Diana with his belt. Now, his legs are held by her from behind, and a rapid bounce is executed by her. His head is buried in his hands by Sandy. The wall is kicked by Sandy while lying on the floor. Big Chuck's wallet and car keys are spotted by Diana on a small table, and her smile fades. Her shirt is finished being buttoned by her, and she glances back at the sleeping man. Sandy's wallet and phone are noticed by her by the room key on the dresser. Sandy's things are collected by her, and Big Chuck's belt is grabbed off the floor. The plump criminal shifts in place. Sandy’s eyes shoot open, and the towel is pulled off his head by him. Outside, away she staggers. The bathroom door handle is yanked on by Sandy. On the other side, the bathroom door is held closed by Big Chuck's belt. The quiet motel parking lot is crossed by her with a backpack in hand. The bag is slung over her shoulder by Diana, and it slides off as Sandy's car is arrived at by her. Into the driver's seat, she slides, and the bag is tossed into the next seat while Sandy's phone is placed in the center console by her. The key is inserted into the ignition by her as she leans forward. Sitting back, a small amount of cash is pulled from Sandy's wallet by Diana, and the bills are sifted through by her. Sandy's cell phone is grabbed by her, and she admires the photo of his smiling daughters. The phone is held to her ear by Diana. Her face is tensed by her as tears are fought back. The thief covers her eyes, then her pained gaze is shifted around. Diana's eyes are closed by her, and both hands are placed on the wheel by her. One is removed, and her forehead is rubbed by her. Now, the motel room is entered by her, and Sandy's belongings are put back on the dresser by her. The bathroom door is crashed through by Sandy. He quickly kneels. The room is moved across by her with the ice bucket, and it is set on the bedside table by her. Taking off the backpack, Big Chuck is lied down next to by Diana. All the blankets are taken by her, revealing his naked rear end. Sandy stands up and the room is eyed by him. The next morning, by the car, Sandy waits as Diana, with sunglasses and disheveled hair, approaches."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She empties a mini bottle, bites another's top off, and shakes his cup with a playful smile, sashaying. Diana's smile fades as she sets down the drinks, blinking away tears. He points to her blue gingham blouse, and Big Chuck nods. Diana smiles sweetly, and Chuck removes his cowboy hat, gazing into her eyes. She jumps on him while Sandy listens, covering his ears. Chuck thrusts as Diana grips the bed, and Sandy kicks the wall, burying his head. Diana sees Big Chuck's wallet and keys; her smile fades. She buttons her shirt, collects Sandy's wallet and phone, and grabs Chuck's belt. Sandy wakes, removing the towel from his ears. Diana staggers outside as Sandy struggles with the bathroom door, held closed by Chuck's belt. Diana crosses the quiet motel lot, reaches Sandy's car, and slides into the driver's seat. She places Sandy's phone in the console, pulls cash from his wallet, and admires a photo of his daughters. Fighting tears, she covers her eyes, shifts her gaze, and places hands on the wheel. Diana returns Sandy's belongings, and he crashes through the bathroom door, kneeling. Diana moves across the room, places the ice bucket on the table, removes the backpack, and lies next to Chuck, taking the blankets. Sandy stands up and surveys the room. The next morning, Sandy waits by the car as Diana approaches with sunglasses and disheveled hair."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She empties a mini bottle, then bites another's top. Shaking his cup, she playfully sashays. Diana's smile fades; she sets down the drinks, blinking moist eyes. He points at her blue gingham blouse. Chuck nods tensely. Diana smiles sweetly as Chuck removes his cowboy hat and gazes at her. She leaps on him. Sandy listens from the bathroom, rubbing his face, then covers his ears as Diana grips the bed and Chuck thrusts. She falls back. Sandy turns on the shower, ties a towel around his ears as Diana yanks Chuck's neck with his belt, holding his legs and bouncing. Sandy buries his head, kicks the wall. Diana sees Big Chuck's wallet, car keys on a table, smile fading. She buttons her shirt, spots Sandy's wallet and phone, collects them, grabs Chuck's belt. Sandy's eyes open, towel off head. Outside, she staggers away. Sandy pulls the bathroom door, held by Chuck's belt. She crosses the motel lot, backpack in hand, slings it over her shoulder, reaching Sandy's car. In the driver's seat, she tosses the bag, places Sandy's phone in the console, inserts the key. Diana pulls cash from Sandy's wallet, sifts bills, admires a photo of his daughters, fights tears, then replaces Sandy's belongings in the room. Sandy crashes out, kneels. She sets the ice bucket on the bedside table, lies next to Chuck, taking the blankets, revealing him. Sandy stands, eyes the room. Next morning, Sandy waits by the car as Diana, in sunglasses and disheveled hair, approaches."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She drains the contents of a miniature bottle completely before biting off the top of another small bottle. With a playful glint in her eyes, she shakes his cup with a mischievous grin and starts to sashay back and forth in a teasing manner. Diana, however, soon loses her smile, setting the drinks down with a more serious demeanor. A sheen of moisture coats her eyes as she blinks rapidly. He gestures toward her blue gingham blouse, making a subtle point. In response, Big Chuck tenses the muscles in his face and nods with understanding. Diana then casts her gaze aside, offering a gentle and sweet smile, while Chuck gradually removes his cowboy hat, locking his eyes intently on hers. She suddenly leaps onto him with fervor. Meanwhile, from within the confines of the bathroom, Sandy listens intently, rubbing his face in distress. Diana grips the edge of the bed as Chuck thrusts behind her, prompting Sandy to cover his ears in an attempt to block out the sounds. Soon, she collapses onto her back, and Sandy proceeds to turn on the shower, the sound of running water filling the air. Desperate for silence, Sandy ties a towel snugly around his ears, as Diana tugs on Chuck's neck using his own belt. She then shifts to holding his legs from behind, bouncing quickly with vigor. Sandy buries his head in his hands as frustration overtakes him. Lying sprawled on the floor, Sandy kicks the wall in a fit of pent-up emotion. Diana's eyes fall upon Big Chuck's wallet and car keys resting on a small table, and this sight causes her smile to vanish. Concluded with buttoning her shirt, she glances once more at the man sleeping soundly. Her attention shifts to Sandy's wallet and phone, casually placed by the room key on the dresser. With deliberate steps, she moves forward, collecting Sandy's items and grabbing Big Chuck's belt from the floor. The noticeably plump criminal fidgets restlessly in place. Suddenly, Sandy's eyes snap open, and he removes the towel wrapped around his head. Outside, Diana staggers away from the room, moving with a sense of urgency. Sandy tugs at the bathroom door handle, finding it immovable. On the opposite side, Big Chuck's belt is looped around the handle, holding it firmly closed. Diana makes her way across the silent motel parking lot, a backpack gripped in her hand. Slipping the bag over her shoulder, she finds it sliding off as she approaches Sandy's car. She slides into the driver's seat, tossing the bag onto the passenger seat beside her, and places Sandy's phone in the car's center console. Leaning forward, she inserts the key into the ignition, bracing herself for the drive. Leaning back, Diana extracts a few bills from Sandy's wallet, sifting through them carefully. Holding Sandy's cell phone, she takes a moment to admire the photograph of his smiling daughters. With a heavy heart, Diana holds the phone to her ear, her expression tensing as she fights back a rising tide of tears. The thief covers her eyes with trembling hands, then shifts her anguished gaze around her surroundings. Closing her eyes momentarily, Diana places both hands firmly on the steering wheel. After a pause, she removes one hand to rub her forehead in thought. Making a pivotal decision, she re-enters the dimly lit motel room, placing Sandy's belongings back on the dresser where they originally were. Sandy, in a burst of sudden energy, crashes through the bathroom door, dropping to his knees in desperation. Diana then moves across the room gracefully, carrying the ice bucket, setting it on the bedside table. She slips off the backpack and lies down beside Big Chuck, taking all the blankets for herself, which inadvertently exposes his bare rear end. Sandy rises to his feet, casting a scrutinizing glance around the room. The following morning arrives, and Sandy waits by the car, his demeanor tense, as Diana approaches him wearing sunglasses and sporting disheveled hair, evidence of a long and chaotic night."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She completely drains the contents of a miniature bottle before proceeding to bite off the top of yet another small bottle. With a playful glint shimmering in her eyes, she gives his cup a tantalizing shake accompanied by a mischievous grin. She begins to sashay back and forth, teasing in her mannerisms. Diana's expression soon shifts, and she places the drinks aside with a more serious and somber demeanor. A sheen of moisture glosses over her eyes as she blinks rapidly to hold back tears. He gestures subtly toward her blue gingham blouse, making a silent but pointed remark. In reaction, Big Chuck tenses the muscles in his face, nodding in silent understanding. Diana then diverts her gaze, offering a gentle and sweet smile as Chuck gradually removes his cowboy hat, locking his eyes intently onto hers. Suddenly, with fervor and energy, she leaps onto him. Meanwhile, from within the bathroom's confines, Sandy listens carefully, rubbing his face in distress as the situation unfolds. Diana grips the edge of the bed with determination as Chuck thrusts behind her, leading Sandy to cover his ears, trying desperately to block out the sounds that reach him. Soon, with exhaustion, she collapses onto her back, prompting Sandy to turn on the shower, and the soothing sound of running water begins to fill the air. Desperate for silence, Sandy ties a towel snugly and securely around his ears in a vain attempt to drown out the noise as Diana tugs firmly on Chuck's neck using his own belt. She then shifts her position, opting to hold his legs from behind, bouncing energetically with vigor. Overwhelmed, Sandy buries his head deep in his hands as frustration completely overtakes him. Sprawled on the floor, Sandy kicks the wall repeatedly in a fit of pent-up emotion. Diana's eyes fall upon Big Chuck's wallet and car keys, both of which rest on a small table, and this sight causes her smile to disappear. After buttoning her shirt, she glances once more at the man who is now sleeping soundly. Her attention then shifts to Sandy's wallet and phone, which are casually placed alongside the room key on the dresser. With deliberate and purposeful steps, she moves forward, collecting Sandy's items and grabbing Big Chuck's belt from the floor. The noticeably plump criminal fidgets restlessly while remaining in place. Suddenly, Sandy's eyes snap open, and he unwinds the towel from around his head. Outside, Diana is staggering away from the room, moving with a clear sense of urgency. Sandy attempts to tug at the bathroom door handle, only to find it immovable. On the opposite side, Big Chuck's belt is ingeniously looped around the handle, holding it firmly shut. Diana makes her way across the eerily silent motel parking lot, gripping a backpack securely in her hand. She slips the bag over her shoulder, though it slides off as she nears Sandy's car. Once there, she slides into the driver's seat, tossing the bag onto the passenger seat beside her, then places Sandy's phone in the car's center console. Leaning forward with intent, she inserts the key into the ignition and braces herself for the drive ahead. Leaning back, Diana pulls a few bills from Sandy's wallet, sifting through them with care. Holding Sandy's cell phone, she takes a moment to admire the photograph of his smiling daughters, feeling a heavy weight on her heart. With emotions rising, Diana holds the phone to her ear, her expression tense as she fights back the tears threatening to spill. The thief covers her eyes with trembling hands, then shifts her anguished gaze around her immediate surroundings. Closing her eyes momentarily, Diana places both hands firmly on the steering wheel. After a moment's pause, she removes one hand to rub her forehead thoughtfully. Making a pivotal decision, she reenters the dimly lit motel room, carefully placing Sandy's belongings back onto the dresser where they originally were. Sandy, in a sudden burst of energy and determination, crashes through the bathroom door, dropping to his knees in sheer desperation. Diana moves gracefully across the room, carrying the ice bucket, and sets it down on the bedside table. Removing the backpack, she lies down beside Big Chuck, pulling all the blankets for herself, which inadvertently exposes his bare rear end. Sandy rises to his feet, casting a scrutinizing glance around the room. When morning finally arrives, Sandy waits by the car, his demeanor tense and anxious, as Diana approaches him, sunglasses perched on her nose and her hair in a disheveled state, evidence of the long and chaotic night they've endured."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She unscrews the cap of a mini bottle, tipping it up to her lips and draining its contents completely, before clamping her teeth around the cap of another bottle and carefully biting it off. With a gentle but deliberate motion, she starts shaking his cup and then turns around with a playful smile, moving her hips in a light, exaggerated sway as she sashays back and forth. Diana's smile quickly diminishes into a neutral expression as she carefully sets the drinks down on a surface. She blinks deliberately, her eyes glistening with moisture. He gestures towards her blue gingham blouse, drawing her attention to it with a pointed finger. Big Chuck's face tightens as he nods in agreement or acknowledgment. Diana momentarily diverts her gaze, her lips curling into a sweet smile, while Chuck slowly reaches up and removes his cowboy hat with a deliberate motion. He fixes his gaze deeply into her eyes, creating an intense connection. Without hesitation, she leaps onto him with enthusiasm and energy. From the bathroom, Sandy listens intently, placing his hand on his face contemplatively. Diana firmly grips the bed for support as Chuck thrusts behind her with deliberate force. Sandy reacts by pressing his hands against his ears to muffle the sounds. She lets herself fall back onto the mattress, settling into a new position. Sandy responds by turning on the shower, the sound of running water adding to the background noise. He takes a towel and wraps it securely around his ears, trying to block out the noise, as Diana pulls on Chuck's neck using his belt for leverage. She then shifts to hold his legs from behind, bouncing rapidly with determination. Sandy, overwhelmed, buries his face in his hands in distress. Lying on the floor, Sandy kicks the wall in frustration and despair. Diana's gaze lands on Big Chuck's wallet and car keys resting on a small table, and her smile fades into a more serious expression. She diligently buttons her shirt, one button at a time, and gives a quick backward glance at the man sleeping soundly. Her eyes catch sight of Sandy's wallet and phone lying next to the room key on the dresser. She steps forward, collects Sandy's belongings with a swift motion, and grabs Big Chuck's belt from the floor with a sense of purpose. The plump criminal shifts his weight uneasily, adjusting his stance. Meanwhile, Sandy's eyes snap open in sudden realization, and he hastily pulls the towel off his head. Outside, she staggers away from the building, her pace uneven and hurried. Sandy aggressively yanks on the bathroom door handle, trying to open it, but it remains firmly closed as Big Chuck's belt holds it in place. She makes her way across the quiet motel parking lot, a backpack gripped in her hand. Diana swings the bag over her shoulder, but it slips off slightly as she reaches Sandy's car. Sliding into the driver's seat, she quickly tosses the bag onto the seat next to her and places Sandy's phone into the center console with care. Leaning forward, she inserts the key into the ignition, preparing to start the car. As she sits back, Diana deftly removes a small amount of cash from Sandy's wallet, flicking through the bills with her fingers. Holding Sandy's cell phone, she pauses to admire the photo of his smiling daughters displayed on the screen, a moment of warmth crossing her face. Diana holds the phone to her ear, her facial muscles tensing as she struggles to suppress her tears. The thief presses her palm against her eyes, then allows her pained gaze to wander around the car interior. Closing her eyes for a brief moment, she places both hands firmly on the steering wheel, feeling the texture beneath her fingers. With a deep breath, she removes one hand, using it to rub her forehead in an attempt to soothe her thoughts. Suddenly resolved, she re-enters the motel room and carefully places Sandy's belongings back on the dresser, retracing her previous steps. Sandy, in a burst of energy, crashes through the bathroom door, quickly kneeling on the ground in a desperate motion. She moves deliberately across the room, an ice bucket in her grasp, and sets it on the bedside table with a quiet thud. She removes the backpack from her shoulders and lies down next to Big Chuck, positioning herself comfortably. She tugs all the blankets towards her, playfully revealing his naked rear end to the cool air. Sandy stands up, scanning the room with a keen eye to take in the scene. The next morning, Sandy is stationed by the car, waiting expectantly, as Diana approaches him with sunglasses perched on her nose and her hair slightly disheveled, reflecting the events of the night before."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Diana playfully teases by shaking his cup, but her smile fades as she sets down the drinks. Chuck points to her blouse, and after a shared glance, Diana leaps on him. While Sandy listens from the bathroom, Diana and Chuck engage intimately, prompting Sandy to turn on the shower and cover his ears with a towel. Diana notices Chuck's possessions on a table and, after finishing buttoning her shirt, collects Sandy's belongings and Chuck's belt. Sandy realizes the situation and pulls the towel off his head, finding the bathroom door held shut by the belt. Outside, Diana crosses the motel parking lot, carrying a backpack and Sandy's belongings, before entering his car and contemplating his family photo. Overwhelmed, she eventually returns Sandy's items and lies down next to Big Chuck, taking the blankets. Sandy emerges from the bathroom and assesses the room. The following morning, Sandy waits by the car for Diana, who arrives disheveled and wearing sunglasses."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She empties out a mini bottle, one of the small liquor containers often found in hotel minibars, and bites the top off another. Shaking his cup, filled with the bright red remnants of a rum and coke, she turns with a playful smile and sashays back and forth in the dimly lit motel room. Diana's smile quickly fades, and she sets down the drinks on the scratched bedside table. Diana blinks her moist eyes, hinting at the emotional toll of the evening. He points to her blue gingham blouse, reminiscent of rural Americana fashion. Big Chuck tenses his face, his rugged demeanor revealing years of bar brawls, and nods. Diana glances off with a sweet smile as Chuck slowly removes his cowboy hat, a weathered Stetson, symbolizing his affinity for Western culture. He gazes into her eyes with a look that suggests a mixture of longing and regret. She leaps on him with a mix of urgency and passion. Sandy, her accomplice and long-time partner in petty crimes, listens from the bathroom and rubs his face, worn from years of close calls. Diana grips the bed's frayed sheets as Chuck thrusts behind her. Sandy covers his ears, trying to silence the noises echoing in his mind. She falls onto her back, exhaling deeply. Sandy turns on the shower, the sound of water masking his silent frustrations. Sandy ties a towel around his ears to muffle the sounds further as Diana yanks on Chuck's neck with his belt, a trophy from one of his many rodeo wins. Now, she holds his legs from behind and bounces rapidly, a practiced move to pilfer his wallet. Sandy buries his head in his hands, the pressure of their life choices weighing heavily. Lying on the floor, Sandy kicks the wall in a bout of frustration. Diana spots Big Chuck's wallet and car keys on a small table, and her smile fades as she contemplates the moral implications. She finishes buttoning her shirt, avoiding the stained mirror, and glances back at the sleeping man. She notices Sandy's wallet and phone by the room key on the dresser, remnants of their last heist. Stepping forward, she collects Sandy's things and grabs Big Chuck's belt off the floor, a token for her collection of ill-gotten gains. The plump criminal shifts in place, consumed by their choices. Sandy's eyes shoot open, startled by the sudden silence, and he pulls the towel off his head. Outside, she staggers away, the weight of her decisions making her steps unsteady. Sandy yanks on the bathroom door handle, only to find on the other side, Big Chuck's belt holds it closed. She crosses the quiet motel parking lot, the lone neon sign buzzing above, with a backpack in hand. Diana slings the bag over her shoulder, and it slides off as she arrives at Sandy's car, an old sedan with rusted edges. Sliding into the driver's seat, Diana tosses the bag into the next seat and places Sandy's phone in the center console, the screen cracked from a previous scuffle. She leans forward and inserts the key into the ignition, feeling the familiar rumble of the engine. Sitting back, Diana pulls a small amount of cash from Sandy's wallet and sifts through the bills, calculating their next move. Grabbing Sandy's cell phone, she admires the photo of his smiling daughters, their innocent faces tugging at her heart. Diana holds the phone to her ear, her fingers trembling. Tensing her face, Diana fights back tears, the image of the girls burning in her memory. The thief covers her eyes, then shifts her pained gaze around the empty parking lot. Diana closes her eyes and places both hands on the wheel, contemplating the path that brought her here. Removing one, she rubs her forehead, trying to soothe the emotional ache. Now, she enters the motel room and puts Sandy's belongings back on the dresser, next to a framed advertisement of a nearby casino. Sandy crashes through the bathroom door, his face a mixture of relief and anger. He quickly kneels, searching for any sign of betrayal. She moves across the room with the ice bucket, a cheap plastic container from a bygone era, and sets it on the bedside table. Taking off the backpack, Diana lies down next to Big Chuck, the warmth of his body a temporary shield against her loneliness. She takes all the blankets, revealing his naked rear end, a scene both comical and tragic. Sandy stands up and eyes the room, assessing the chaos left behind. The next morning, Sandy waits by the car, the morning sun casting long shadows, as Diana approaches with sunglasses and disheveled hair, a facade to mask the turmoil within."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She empties out a mini bottle and bites the top off another. Shaking his cup she turns with a playful smile and sashays back and forth. Diana's smile quickly fades and she sets down the drinks. Diana blinks her moist eyes. He points to her blue gingham blouse. Big Chuck tenses his face and nods. Diana glances off with a sweet smile as Chuck slowly removes his cowboy hat. He gazes into her eyes. She leaps on him. Sandy listens from the bathroom and rubs his face. Diana grips the bed as Chuck thrusts behind her. Sandy covers his ears. She falls onto her back. Sandy turns on the shower. Sandy ties a towel around his ears as Diana yanks on Chuck's neck with his belt. Now she holds his legs from behind and bounces rapidly. Sandy buries his head in his hands. Lying on the floor Sandy kicks the wall. Diana spots Big Chuck's wallet and car keys on a small table and her smile fades. She finishes buttoning her shirt and glances back at the sleeping man. She notices Sandy's wallet and phone by the room key on the dresser. Stepping forward she collects Sandy's things and grabs Big Chuck's belt off the floor. The plump criminal shifts in place. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Sandy's eyes shoot open and he pulls the towel off his head. Outside she staggers away. Sandy yanks on the bathroom door handle. On the other side Big Chuck's belt holds it closed. She crosses the quiet motel parking lot with a backpack in hand. Diana slings the bag over her shoulder and it slides off as she arrives at Sandy's car. Sliding into the driver's seat. Diana tosses the bag into the next seat and places Sandy's phone in the center console. She leans forward and inserts the key into the ignition. Sitting back Diana pulls a small amount of cash from Sandy's wallet and sifts through the bills. Grabbing Sandy's cell phone she admires the photo of his smiling daughters. Diana holds the phone to her ear. Tensing her face Diana fights back tears. The thief covers her eyes then shifts her pained gaze around. Diana closes her eyes and places both hands on the wheel. Removing one she rubs her forehead. Now she enters the motel room and puts Sandy's belongings back on the dresser. Sandy crashes through the bathroom door. He quickly kneels. She moves across the room with the ice bucket and sets it on the bedside table. Taking off the backpack Diana lies down next to Big Chuck. She takes all the blankets revealing his naked rear end. Sandy stands up and eyes the room. The next morning Sandy waits by the car as Diana approaches with sunglasses and disheveled hair."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She empties out a mini bottle and bites the top off another. Shaking his cup she turns with a playful smile and sashays back and forth. Diana's smile quickly fades and she sets down the drinks. Diana blinks her moist eyes. He points to her blue gingham blouse. Big Chuck tenses his face and nods. Diana glances off with a sweet smile as Chuck slowly removes his cowboy hat. He gazes into her eyes. She leaps on him. Sandy listens from the bathroom and rubs his face. Diana grips the bed as Chuck thrusts behind her. Sandy covers his ears. She falls onto her back. Sandy turns on the shower. Sandy ties a towel around his ears as Diana yanks on Chuck's neck with his belt. Now she holds his legs from behind and bounces rapidly. Sandy buries his head in his hands. Lying on the floor Sandy kicks the wall. Diana spots Big Chuck's wallet and car keys on a small table and her smile fades. She finishes buttoning her shirt and glances back at the sleeping man. She notices Sandy's wallet and phone by the room key on the dresser. Stepping forward she collects Sandy's things and grabs Big Chuck's belt off the floor. The plump criminal shifts in place. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Sandy's eyes shoot open and he pulls the towel off his head. Outside she staggers away. Sandy yanks on the bathroom door handle. On the other side Big Chuck's belt holds it closed. She crosses the quiet motel parking lot with a backpack in hand. Diana slings the bag over her shoulder and it slides off as she arrives at Sandy's car. Sliding into the driver's seat. Diana tosses the bag into the next seat and places Sandy's phone in the center console. She leans forward and inserts the key into the ignition. Sitting back Diana pulls a small amount of cash from Sandy's wallet and sifts through the bills. Grabbing Sandy's cell phone she admires the photo of his smiling daughters. Diana holds the phone to her ear. Tensing her face Diana fights back tears. The thief covers her eyes then shifts her pained gaze around. Diana closes her eyes and places both hands on the wheel. Removing one she rubs her forehead. Now she enters the motel room and puts Sandy's belongings back on the dresser. Sandy crashes through the bathroom door. He quickly kneels. She moves across the room with the ice bucket and sets it on the bedside table. Taking off the backpack Diana lies down next to Big Chuck. She takes all the blankets revealing his naked rear end. Sandy stands up and eyes the room. The next morning Sandy waits by the car as Diana approaches with sunglasses and disheveled hair."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She empties out a mini bottle and bites the top off another. Shaking his cup she turns with a playful smile and sashays back and forth. Diana's smile quickly fades and she sets down the drinks. Diana blinks her moist eyes. He points to her blue gingham blouse. Big Chuck tenses his face and nods. Diana glances off with a sweet smile as Chuck slowly removes his cowboy hat. He gazes into her eyes. She leaps on him. Sandy listens from the bathroom and rubs his face. Diana grips the bed as Chuck thrusts behind her. Sandy covers his ears. Tensing her face Diana fights back tears. The thief covers her eyes then shifts her pained gaze around. Diana closes her eyes and places both hands on the wheel. Removing one she rubs her forehead. Now she enters the motel room and puts Sandy's belongings back on the dresser. Sandy crashes through the bathroom door. He quickly kneels. She moves across the room with the ice bucket and sets it on the bedside table. Taking off the backpack Diana lies down next to Big Chuck. She takes all the blankets revealing his naked rear end. Sandy stands up and eyes the room. The next morning Sandy waits by the car as Diana approaches with sunglasses and disheveled hair."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She empties out a mini bottle and bites the top off another. Shaking his cup she turns with a playful smile and sashays back and forth. Diana's smile quickly fades and she sets down the drinks. Diana blinks her moist eyes. He points to her blue gingham blouse. She moves across the room with the ice bucket and sets it on the bedside table. Taking off the backpack Diana lies down next to Big Chuck. She takes all the blankets revealing his naked rear end. Sandy stands up and eyes the room. The next morning Sandy waits by the car as Diana approaches with sunglasses and disheveled hair."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "She fills up a small jug and chews the lid off another. Waving his spoon, she turns with a mischievous grin and hops side to side. Lydia's grin quickly disappears, and she picks up the snacks. Lydia squints her dry eyes. He gestures to her red polka-dot scarf. Little Lou flexes his elbows and shakes his head. Lydia looks away with a bitter grin as Lou slowly puts on his chef's hat. He stares at her hands. She jumps on him. Alex eavesdrops from the kitchen and scratches his chin. Lydia clutches the couch as Lou prances in front of her. Alex plugs his nose. She rolls onto her stomach. Alex turns off the stove. Alex wraps a apron around his nose as Lydia tugs on Lou's arm with his ribbon. Now, she holds his shoulders from the front and hops slowly. Alex hides his head in his arms. Sitting on the chair, Alex punches the table. Lydia sees Little Lou's shoes and sunglasses on a low bookshelf, and her grin disappears. She finishes fastening her jacket and peeks back at the snoozing man. She notices Alex's hat and glasses by the cupboard key on the bookshelf. Stepping back, she takes Alex's items and snatches Little Lou's ribbon off the chair. The tall artist sways in place. Alex's eyebrows shoot up, and he unwraps the apron from his face. Outside, she strides away. Alex pulls on the kitchen window latch. On the outside, Little Lou's ribbon holds it fastened. She crosses the crowded office lobby with a briefcase in hand. Lydia throws the case over her head, and it slips off as she reaches Alex's truck. Rolling into the passenger's seat, Lydia tosses the case into the back seat and places Alex's glasses in the glove compartment. She leans back and turns on the radio. Sitting up, Lydia extracts a bundle of coins from Alex's hat and flips through the coins. Holding Alex's glasses, she examines the picture of his laughing pets. Lydia presses the glasses to her cheek. Contorting her mouth, Lydia stifles laughter. The artist covers her cheeks, then swings her joyful gaze around. Lydia opens her eyes and places both feet on the floor. Removing one, she scratches her ankle. Now, she enters the office space and puts Alex's items back on the shelf. Alex crashes through the window. He quickly climbs. She moves past the vase with the water bottle and places it on the kitchen table. Taking off the briefcase, Lydia sits next to Little Lou. She grabs all the pillows, revealing his covered feet. Alex stands and inspects the hallway. The next morning, Alex waits by the bike as Lydia approaches with a hat and messy shoes."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Diana empties a mini bottle and playfully interacts with Big Chuck, but her demeanor shifts as she sets down drinks. Chuck removes his hat, gazes at her, and they engage intimately, while Sandy listens from the bathroom, trying to drown out the sounds. Afterward, Diana notices Chuck's wallet and Sandy's belongings, taking them as she leaves. She locks Sandy in the bathroom using Chuck's belt and exits the motel. Diana attempts to steal Sandy's car but is struck by a photo of his daughters, leading her to return his belongings. Sandy breaks out of the bathroom, and the next morning finds Diana returning to him disheveled."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The next morning Sandy waits by the car as Diana approaches with sunglasses and disheveled hair Sandy stands up and eyes the room She takes all the blankets revealing his naked rear end Taking off the backpack Diana lies down next to Big Chuck She moves across the room with the ice bucket and sets it on the bedside table He quickly kneels Sandy crashes through the bathroom door Now she enters the motel room and puts Sandy's belongings back on the dresser Removing one she rubs her forehead Diana closes her eyes and places both hands on the wheel The thief covers her eyes then shifts her pained gaze around Tensing her face Diana fights back tears Diana holds the phone to her ear Grabbing Sandy's cell phone she admires the photo of his smiling daughters Sitting back Diana pulls a small amount of cash from Sandy's wallet and sifts through the bills She leans forward and inserts the key into the ignition Diana tosses the bag into the next seat and places Sandy's phone in the center console Sliding into the driver's seat Diana slings the bag over her shoulder and it slides off as she arrives at Sandy's car She crosses the quiet motel parking lot with a backpack in hand On the other side Big Chuck's belt holds it closed Sandy yanks on the bathroom door handle Outside she staggers away Sandy's eyes shoot open and he pulls the towel off his head The plump criminal shifts in place Stepping forward she collects Sandy's things and grabs Big Chuck's belt off the floor She notices Sandy's wallet and phone by the room key on the dresser She finishes buttoning her shirt and glances back at the sleeping man Diana spots Big Chuck's wallet and car keys on a small table and her smile fades Lying on the floor Sandy kicks the wall Sandy buries his head in his hands Now she holds his legs from behind and bounces rapidly Sandy ties a towel around his ears as Diana yanks on Chuck's neck with his belt Sandy turns on the shower She falls onto her back Sandy covers his ears Diana grips the bed as Chuck thrusts behind her Sandy listens from the bathroom and rubs his face She leaps on him He gazes into her eyes Diana glances off with a sweet smile as Chuck slowly removes his cowboy hat Big Chuck tenses his face and nods He points to her blue gingham blouse Diana blinks her moist eyes Diana's smile quickly fades and she sets down the drinks Shaking his cup she turns with a playful smile and sashays back and forth She empties out a mini bottle and bites the top off another"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Shaking his cup she turns with a playful smile and sashays back and forth She empties out a mini bottle and bites the top off another Diana blinks her moist eyes Diana's smile quickly fades and she sets down the drinks Big Chuck tenses his face and nods He points to her blue gingham blouse He gazes into her eyes Diana glances off with a sweet smile as Chuck slowly removes his cowboy hat Sandy listens from the bathroom and rubs his face She leaps on him Sandy covers his ears Diana grips the bed as Chuck thrusts behind her Sandy turns on the shower She falls onto her back Now she holds his legs from behind and bounces rapidly Sandy ties a towel around his ears as Diana yanks on Chuck's neck with his belt Lying on the floor Sandy kicks the wall Sandy buries his head in his hands She finishes buttoning her shirt and glances back at the sleeping man Diana spots Big Chuck's wallet and car keys on a small table and her smile fades Stepping forward she collects Sandy's things and grabs Big Chuck's belt off the floor She notices Sandy's wallet and phone by the room key on the dresser Sandy's eyes shoot open and he pulls the towel off his head The plump criminal shifts in place Sandy yanks on the bathroom door handle Outside she staggers away She crosses the quiet motel parking lot with a backpack in hand On the other side Big Chuck's belt holds it closed Sliding into the driver's seat Diana slings the bag over her shoulder and it slides off as she arrives at Sandy's car She leans forward and inserts the key into the ignition Diana tosses the bag into the next seat and places Sandy's phone in the center console Grabbing Sandy's cell phone she admires the photo of his smiling daughters Sitting back Diana pulls a small amount of cash from Sandy's wallet and sifts through the bills Tensing her face Diana fights back tears Diana holds the phone to her ear Diana closes her eyes and places both hands on the wheel The thief covers her eyes then shifts her pained gaze around Now she enters the motel room and puts Sandy's belongings back on the dresser Removing one she rubs her forehead He quickly kneels Sandy crashes through the bathroom door Taking off the backpack Diana lies down next to Big Chuck She moves across the room with the ice bucket and sets it on the bedside table Sandy stands up and eyes the room She takes all the blankets revealing his naked rear end The next morning Sandy waits by the car as Diana approaches with sunglasses and disheveled hair"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Outside she staggers away Sandy yanks on the bathroom door handle On the other side Big Chuck's belt holds it closed She crosses the quiet motel parking lot with a backpack in hand Diana slings the bag over her shoulder and it slides off as she arrives at Sandy's car Sliding into the driver's seat Diana tosses the bag into the next seat and places Sandy's phone in the center console She leans forward and inserts the key into the ignition Sitting back Diana pulls a small amount of cash from Sandy's wallet and sifts through the bills Grabbing Sandy's cell phone she admires the photo of his smiling daughters Diana holds the phone to her ear Tensing her face Diana fights back tears The thief covers her eyes then shifts her pained gaze around Diana closes her eyes and places both hands on the wheel Removing one she rubs her forehead Now she enters the motel room and puts Sandy's belongings back on the dresser Sandy crashes through the bathroom door He quickly kneels She moves across the room with the ice bucket and sets it on the bedside table Taking off the backpack Diana lies down next to Big Chuck She takes all the blankets revealing his naked rear end Sandy stands up and eyes the room The next morning Sandy waits by the car as Diana approaches with sunglasses and disheveled hair She empties out a mini bottle and bites the top off another Shaking his cup she turns with a playful smile and sashays back and forth Diana's smile quickly fades and she sets down the drinks Diana blinks her moist eyes He points to her blue gingham blouse Big Chuck tenses his face and nods Diana glances off with a sweet smile as Chuck slowly removes his cowboy hat He gazes into her eyes She leaps on him Sandy listens from the bathroom and rubs his face Diana grips the bed as Chuck thrusts behind her Sandy covers his ears She falls onto her back Sandy turns on the shower Sandy ties a towel around his ears as Diana yanks on Chuck's neck with his belt Now she holds his legs from behind and bounces rapidly Sandy buries his head in his hands Lying on the floor Sandy kicks the wall Diana spots Big Chuck's wallet and car keys on a small table and her smile fades She finishes buttoning her shirt and glances back at the sleeping man She notices Sandy's wallet and phone by the room key on the dresser Stepping forward she collects Sandy's things and grabs Big Chuck's belt off the floor The plump criminal shifts in place Sandy's eyes shoot open and he pulls the towel off his head"
        }
      ]
    }
  ]
}