{
  "ground_truth": "At the front desk, the attendant hands him a clipboard. Outside, Diana opens the car door as Sandy pours himself a cup of coffee and a brown utility van pulls into the motel parking lot. The skiptracer walks around and sees Diana sitting in the open passenger side. Inside, Sandy stirs his coffee while the skiptracer pulls Diana from the car, and he notices the abduction through the window. Sandy runs outside as the skiptracer pushes Diana into the van, locks the door, and hurries to the wheel. Sandy runs over and watches the van speed off, then he quickly shuts the passenger-side door and gets behind the wheel of his rental. Sandy backs out of his parking spot and speeds away from the motel. On a narrow country road, the skiptracer talks on his cell phone as Sandy comes up on the van. He moves into the oncoming lane and pulls up beside the van. Diana opens a window, and spotting an oncoming car, Sandy hits the brakes and swerves behind the van. Diana pushes against the gated partition while Sandy pulls up beside the van again. The van speeds toward an intersection's red light, cars whiz by as the van turns sharply, and Sandy follows, barely dodging the oncoming vehicles. His sedan skids up alongside another car and he peels away onto a two-lane highway. Sandy speeds up beside the skiptracer's van, but the skiptracer swerves at Sandy, sending him into a grassy median. Sandy recovers on the other side, facing oncoming traffic as speeding cars swerve out of his way. Guardrails lie on both sides of the road, trapping Sandy with the oncoming traffic. The skiptracer peers out of his window, watching the businessmen at their numerous vehicles. An 18-wheeler speeds towards Sandy and he swerves toward the median, launching the sedan off a mound of dirt so it soars through the air and lands on its tires in the grass as Sandy rejoins the van on the right side of the road. In the van, Diana pounds a cylinder against the partition lock and breaks through. The skiptracer elbows her stomach and holds her back, but Diana punches him in the throat and he falls limply against the steering wheel. Sandy slows down and lightly hits the back panel of the van, barely nudging it. Diana notices a merge up ahead, and Sandy eyes the runaway van, gripping the steering wheel as he takes a breath. He speeds into the side of the van, causing it to flip over. Sandy stares wide-eyed as the van continues to flip into the median, then stops the car and watches the van land right side up. Sandy unbuckles his seatbelt and slowly emerges from the car. In slow motion, he hurries toward the van with his mouth dropped open.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "At the front counter, the attendant hands him a notepad. Outside, Diana opens the automobile hatch as Sandy pours himself a mug of coffee and a brown utility vehicle pulls into the motel parking lot. The skiptracer strolls around and notices Diana perched in the open passenger position. Inside, Sandy stirs his coffee while the skiptracer pulls Diana from the automobile, and he observes the abduction through the window. Sandy dashes outside as the skiptracer pushes Diana into the vehicle, locks the hatch, and hurries to the wheel. Sandy rushes over and watches the vehicle speed away, then he quickly shuts the passenger-side hatch and gets behind the wheel of his rental. Sandy backs out of his parking spot and speeds away from the motel. On a narrow country lane, the skiptracer talks on his cell phone as Sandy comes up on the vehicle. He moves into the oncoming lane and pulls up alongside the vehicle. Diana opens a hatch, and spotting an approaching automobile, Sandy hits the brakes and swerves behind the vehicle. Diana pushes against the gated partition while Sandy pulls up adjacent to the vehicle again. The vehicle speeds toward an intersection's crimson signal, automobiles zoom by as the vehicle turns sharply, and Sandy follows, barely dodging the approaching cars. His sedan skids up alongside another automobile and he peels away onto a dual-lane motorway. Sandy speeds up alongside the skiptracer's vehicle, but the skiptracer swerves at Sandy, sending him into a grassy median. Sandy recovers on the other side, facing approaching traffic as speeding automobiles swerve out of his path. Guardrails lie on both sides of the lane, trapping Sandy with the oncoming traffic. The skiptracer peers out of his hatch, watching the businessmen at their numerous automobiles. An 18-wheeler speeds towards Sandy and he swerves toward the median, launching the sedan off a mound of earth so it soars through the air and lands on its tires in the grass as Sandy rejoins the vehicle on the right side of the lane. In the vehicle, Diana pounds a cylinder against the partition latch and breaks through. The skiptracer elbows her abdomen and holds her back, but Diana punches him in the neck and he falls limply against the steering wheel. Sandy slows down and lightly hits the rear panel of the vehicle, barely nudging it. Diana notices a merge up ahead, and Sandy eyes the runaway vehicle, gripping the steering wheel as he takes a breath. He accelerates into the side of the vehicle, causing it to flip over. Sandy stares wide-eyed as the vehicle continues to flip into the median, then stops the automobile and watches the vehicle land right side up. Sandy unbuckles his seatbelt and slowly emerges from the automobile. In slow motion, he hurries toward the vehicle with his mouth dropped open."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "At the front desk, a clipboard is handed to him by the attendant. Outside, the car door is opened by Diana as a cup of coffee is poured by Sandy and a brown utility van is pulled into the motel parking lot. The skiptracer walks around and sees Diana sitting in the open passenger side. Inside, his coffee is stirred by Sandy while Diana is pulled from the car by the skiptracer, and the abduction is noticed by him through the window. Sandy runs outside as Diana is pushed into the van by the skiptracer, the door is locked, and he hurries to the wheel. The van speeds off as Sandy runs over and watches, then quickly, the passenger-side door is shut by him, and he gets behind the wheel of his rental. His parking spot is backed out of by Sandy, and the motel is sped away from by him. On a narrow country road, a call is made on his cell phone by the skiptracer as the van is approached by Sandy. He moves into the oncoming lane and pulls up beside the van. A window is opened by Diana, and spotting an oncoming car, the brakes are hit by Sandy, and he swerves behind the van. The gated partition is pushed against by Diana while the van is pulled up beside again by Sandy. The van speeds toward a red light at an intersection, cars whiz by as a sharp turn is made by the van, and it is followed by Sandy, who barely dodges the oncoming vehicles. His sedan is skidded up alongside another car, and a two-lane highway is peeled onto by him. Sandy speeds up beside the skiptracer's van, but Sandy is swerved at by the skiptracer, sending him into a grassy median. The other side is recovered on by Sandy, facing oncoming traffic as speeding cars swerve out of his way. Guardrails lie on both sides of the road, trapping Sandy with the oncoming traffic. Businessmen at their numerous vehicles are watched by the skiptracer as he peers out of his window. An 18-wheeler speeds towards Sandy, and the median is swerved toward by him, launching the sedan off a mound of dirt so it soars through the air and lands on its tires in the grass as the van is rejoined by Sandy on the right side of the road. In the van, a cylinder is pounded against the partition lock by Diana, and it is broken through. Diana is elbowed in the stomach by the skiptracer, and she is held back by him, but the skiptracer is punched in the throat by Diana, and he falls limply against the steering wheel. The van's back panel is lightly hit by Sandy as he slows down, barely nudging it. A merge up ahead is noticed by Diana, and the runaway van is eyed by Sandy, gripping the steering wheel as a breath is taken by him. He speeds into the side of the van, causing it to flip over. Sandy stares wide-eyed as the van continues to flip into the median, then the car is stopped by him, and the van is watched as it lands right side up. Sandy unbuckles his seatbelt, and he slowly emerges from the car. In slow motion, the van is hurried toward by him with his mouth dropped open."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "At the front desk, the attendant gives him a clipboard. Outside, Diana opens the car door as Sandy pours coffee and a brown van enters the motel parking lot. The skiptracer sees Diana in the open passenger side. Inside, Sandy stirs his coffee while noticing the abduction through the window. Sandy rushes out as the skiptracer forces Diana into the van, locks the door, and speeds off. Sandy runs over, shuts the door, and drives his rental. On a narrow road, the skiptracer is on a call as Sandy catches up to the van. He moves into oncoming traffic and pulls up beside it. Diana opens a window, and seeing an approaching car, Sandy brakes and swerves behind the van. Diana pushes against the partition as Sandy pulls up again. The van turns sharply at a red light, Sandy follows, dodging vehicles. His sedan skids, then he peels onto a highway. Sandy speeds up beside the van, but the skiptracer swerves, sending Sandy into a median. Sandy recovers, facing oncoming traffic, trapped by guardrails. An 18-wheeler approaches, and Sandy swerves to the median, launching the sedan over a dirt mound, landing to rejoin the van. Inside the van, Diana breaks through the partition lock. The skiptracer elbows her, but she punches him in the throat, and he slumps against the wheel. Sandy lightly bumps the van's back panel. Diana sees a merge ahead, and Sandy focuses on the van. He speeds into its side, flipping it over. Sandy watches as the van flips into the median, then stops and sees it land upright. He unbuckles, exits, and hurries toward the van in slow motion, mouth agape."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "At the front desk, the attendant hands him a clipboard. Outside, Diana opens the car door, and Sandy pours coffee as a van arrives. The skiptracer sees Diana in the car, pulls her out, and Sandy notices through the window. He runs outside as Diana is pushed into the van, which speeds off. Sandy quickly gets into his rental and follows. On a narrow road, the skiptracer uses his phone while Sandy catches up. He pulls beside the van, Diana opens a window, and Sandy brakes to avoid a car. Diana pushes the partition, and Sandy pulls alongside again. At an intersection, the van turns sharply, and Sandy narrowly avoids traffic. His sedan skids and then merges onto a highway. He speeds beside the van but is swerved into a median. Sandy recovers amid oncoming traffic, avoiding cars. An 18-wheeler approaches, and Sandy swerves off a dirt mound, rejoining the van. Inside, Diana breaks the partition lock, gets attacked by the skiptracer, but punches him in the throat. Sandy lightly nudges the van's back panel. Seeing a merge ahead, he speeds into the van's side, flipping it over. Wide-eyed, he stops and watches the van land upright, unbuckles, and rushes to it with his mouth open."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "At the front desk of the bustling motel, the attentive attendant hands him a clipboard with a routine efficiency. Meanwhile, outside in the parking lot, Diana gracefully opens the car door as Sandy leisurely pours himself a steaming cup of coffee, all the while a brown utility van casually pulls into the expansive motel parking lot. The determined skiptracer makes his way around the area, noticing Diana seated comfortably in the open passenger side of the car. Inside the building, Sandy stirs his coffee thoughtfully, but his attention is soon caught as the skiptracer abruptly pulls Diana out of the car, a concerning sight that he observes with growing alarm through the window. Urgently, Sandy rushes outside just as the skiptracer forcefully pushes Diana into the van, locking the door hastily before hurrying over to the driver’s seat. With determination, Sandy runs over and witnesses the van accelerating away at speed before he swiftly shuts the passenger-side door of his own rental vehicle and climbs behind the wheel. In a flurry of motion, Sandy backs out of his parking spot and quickly speeds away from the motel premises.\n\nOn a narrow and winding country road that stretches out before him, the skiptracer is engrossed in a conversation on his cell phone when Sandy, with growing intent, catches up to the van. He maneuvers into the oncoming lane with precise timing and pulls up alongside the van, matching its speed. Then Diana, seizing an opportunity, opens a window. But, seeing an oncoming car racing toward him, Sandy instinctively hits the brakes and swerves with precision behind the van to avoid a collision. Inside the van, Diana pushes assertively against the gated partition separating the front, while Sandy, determined and strategic, pulls up beside the van once more. The van hurtles toward an intersection already ablaze with the red light, cars whizzing by as it turns sharply, and Sandy follows closely behind, deftly dodging the oncoming vehicles in a dangerous chase. His sedan skids alongside another car on the road before he peels away onto a broader, two-lane highway. Sandy accelerates up beside the skiptracer's van, but as he gets close, the skiptracer deftly swerves at him, sending Sandy's car careening into a grassy median. With skill, Sandy recovers on the opposite side of the road, now facing the flow of oncoming traffic as speeding vehicles swerve out of his way in a blur of motion. Guardrails line both sides of the road, creating a trap for Sandy amid the chaotic oncoming traffic. The skiptracer, ever watchful, peers out of his window, observing businessmen at their numerous vehicles as the chase continues. An imposing 18-wheeler speeds directly towards Sandy, who, in a quick maneuver, swerves toward the median. Launching the sedan off a dirt mound, it soars dramatically through the air and lands squarely on its tires in the grass, allowing Sandy to rejoin the van on the safer right side of the road.\n\nInside the van, Diana furiously pounds a determined fist against the partition lock with a cylinder, eventually breaking through. The skiptracer, in an attempt to regain control, elbows her in the stomach and tries to hold her back. However, Diana retaliates with a swift punch to his throat, causing him to fall limply against the steering wheel. Meanwhile, Sandy slows his car down and lightly taps the back panel of the van, barely nudging it as he assesses the situation. Diana notices a merge up ahead, while Sandy, with a firm grip on the steering wheel, eyes the runaway van and takes a calming breath. Gathering speed, he forcefully rams into the side of the van, causing it to flip over violently. Sandy watches with wide-eyed amazement as the van continues to roll into the median, then stops his car to observe as the van remarkably lands right side up. His heart pounding, Sandy unbuckles his seatbelt and slowly extracts himself from the car. In a dramatic slow motion, he hurries toward the van, his mouth agape with a mixture of shock and determination."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Positioned at the front desk of the bustling and lively motel, the attentive and efficient attendant hands him a clipboard with a practiced, routine efficiency. Meanwhile, outside in the expansive parking lot, Diana gracefully opens the car door with ease, and Sandy leisurely pours himself a steaming, aromatic cup of coffee. All the while, a brown utility van casually pulls into the wide motels parking lot. The determined skiptracer makes his way around the area, and he quickly notices Diana seated comfortably in the open passenger side of the car. Inside the building, Sandy stirs his coffee thoughtfully, but his attention is soon caught as the skiptracer abruptly pulls Diana out of the car, a concerning and alarming sight that he observes with growing urgency through the window. Reacting urgently, Sandy rushes outside just as the skiptracer forcefully shoves Diana into the van, hastily locking the door before hurrying over to the driver’s seat. With fierce determination, Sandy runs over and witnesses the van accelerating away at high speed before he swiftly shuts the passenger-side door of his own rental vehicle, climbing behind the wheel. In a flurry of rapid motion, Sandy backs out of his parking spot and quickly speeds away from the motel premises.\n\nOn a narrow and winding country road that stretches out in front of him, the skiptracer is engrossed in an important conversation on his cell phone when Sandy, with growing intent and determination, catches up to the speeding van. He maneuvers into the oncoming lane with precise timing and deftly pulls up alongside the van, matching its swift speed. Then, seizing an opportunity, Diana opens a window. However, spotting an oncoming car racing toward him, Sandy instinctively hits the brakes and swerves with precision behind the van to avoid a dangerous collision. Inside the van, Diana pushes assertively against the gated partition that separates the front, while Sandy, determined and strategic, pulls up beside the van once more. The van hurtles toward an intersection that is already ablaze with the red light, cars whizzing by as it turns sharply, and Sandy follows closely behind, deftly dodging the oncoming vehicles in a dangerous and tense chase. His sedan skids alongside another car on the busy road before he peels away onto a broader, two-lane highway. Sandy accelerates up beside the skiptracer's van, but as he gets close, the skiptracer deftly swerves at him, sending Sandy's car careening into the grassy median. With remarkable skill, Sandy recovers on the opposite side of the road, now facing the flow of oncoming traffic as speeding vehicles swerve out of his way in a blur of motion. Guardrails line both sides of the road, creating a trap for Sandy amid the chaotic oncoming traffic. The skiptracer, ever watchful and alert, peers out of his window, observing businessmen at their numerous vehicles as the chase continues. An imposing 18-wheeler speeds directly toward Sandy, who, in a quick and agile maneuver, swerves toward the median. Launching the sedan off a dirt mound, it soars dramatically through the air and lands squarely on its tires in the grass, allowing Sandy to rejoin the van on the safer right side of the road.\n\nInside the van, Diana furiously and determinedly pounds a fist against the partition lock with a cylinder, eventually breaking through. The skiptracer, in a desperate attempt to regain control, elbows her in the stomach and tries to hold her back. However, Diana retaliates with a swift punch to his throat, causing him to fall limply against the steering wheel. Meanwhile, Sandy slows his car down and lightly taps the back panel of the van, barely nudging it as he assesses the situation. Diana notices a merge up ahead, while Sandy, with a firm grip on the steering wheel, eyes the runaway van and takes a calming breath. Gathering speed, he forcefully rams into the side of the van, causing it to flip over violently. Sandy watches with wide-eyed amazement as the van continues to roll into the median, then stops his car to observe as the van remarkably lands right side up. His heart pounding with adrenaline, Sandy unbuckles his seatbelt and slowly extracts himself from the car. In a dramatic slow motion, he hurries toward the van, his mouth agape with a mixture of shock and determination."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As he approaches the front desk, the attendant extends her arm to hand him a clipboard, which he grasps with a brief nod. Simultaneously, outside the motel, Diana reaches for the car door handle, pulling it open with a gentle tug, while Sandy steadies himself beside a table, pouring a freshly brewed cup of coffee. The smooth arrival of a brown utility van is seen as it glides into the motel parking lot, coming to a gradual halt. The skiptracer, keenly observant, begins to pace around the vicinity and soon spots Diana, who is comfortably seated in the open passenger side of the car. Inside, with a rhythmic motion, Sandy stirs his coffee, creating a gentle whirlpool in the cup, while outside, the skiptracer takes decisive strides towards Diana, swiftly pulling her from the car just as Sandy glances out the window, witnessing the unfolding abduction. With urgency, Sandy dashes outside, seeing the skiptracer shoving Diana into the back of the van, skillfully locking the door before scrambling towards the driver's seat. Sandy arrives just in time to watch helplessly as the van accelerates away, prompting him to quickly shut the passenger-side door. In haste, he slides into the driver's seat of his rental car, engages the ignition, and backs out briskly from his parking spot, accelerating away from the motel in pursuit. As he navigates a narrow country road, the skiptracer can be seen talking animatedly on his cell phone. Meanwhile, Sandy, with determined focus, catches up to the van and boldly maneuvers into the oncoming lane, drawing alongside it. Alert to the danger, Diana rolls down a window, and as an oncoming car approaches, Sandy instinctively hits the brakes, deftly swerving to fall in line behind the van once more. Inside the van, Diana pushes with determination against a gated partition, while Sandy, intent on overtaking, pulls up beside the van again. As the van barrels toward a red light at an intersection, cars zip by, and it executes a sharp turn, with Sandy skillfully following suit, narrowly avoiding the oncoming vehicles. His sedan skids into position beside another car before peeling away onto the expansive two-lane highway. Sandy accelerates aggressively beside the skiptracer's van, but in a sudden feint, the skiptracer swerves towards Sandy, sending him careening into the grassy median. Recovering quickly, Sandy finds himself on the other side, confronting the peril of oncoming traffic as drivers swerve desperately to avoid his path. Hemmed in by guardrails on either side of the road, Sandy is momentarily trapped amidst the oncoming traffic. The skiptracer, undeterred, peers out his window, observing business commuters in their countless vehicles. Meanwhile, an 18-wheeler barrels down the road towards Sandy, who deftly swerves towards the median, propelling his sedan up a mound of dirt and launching it through the air. The car lands resiliently on its tires in the grass, allowing Sandy to rejoin the chase alongside the van on the road. Inside the van, Diana finds a cylinder and uses it to hammer relentlessly against the partition lock, finally breaking through with a satisfying snap. The skiptracer, caught off guard, responds by elbowing her stomach to hold her back, but Diana counters with a decisive punch to his throat, causing him to slump limply against the steering wheel. As Sandy approaches, he decelerates to lightly tap the back panel of the van, the vehicle barely stirring. Observing a merge up ahead, Diana signals to Sandy, who tightens his grip on the steering wheel, takes a deep breath, and accelerates decisively into the side of the van. The van flips over dramatically, and Sandy watches, wide-eyed, as it tumbles into the median before he comes to a halt, observing as the van lands upright. With deliberate care, Sandy unbuckles his seatbelt and cautiously steps out of the car. In a slowed perception of time, he rushes towards the van, mouth agape in shock and determination."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "At the front desk, the attendant hands him a clipboard. Outside, Diana opens the car door while Sandy pours himself a cup of coffee, noticing a brown utility van pulling into the motel parking lot. The skiptracer approaches and pulls Diana from the car, which Sandy observes through the window. He rushes outside as the skiptracer locks Diana in the van and speeds off, prompting Sandy to jump into his rental car and pursue. On a narrow country road, as the skiptracer talks on his phone, Sandy catches up and attempts to maneuver beside the van. Diana opens a window, but an oncoming car forces Sandy to brake and fall behind. After pulling up beside the van again, he follows it through a sharp turn at a red light, narrowly avoiding other vehicles and skidding onto a two-lane highway. As Sandy speeds alongside the van, the skiptracer swerves, pushing Sandy into a grassy median. Recovering, Sandy faces oncoming traffic, trapped by guardrails, until an 18-wheeler forces him to swerve into the median, launching his car back onto the road. Inside the van, Diana breaks through the partition lock, struggles with the skiptracer, and incapacitates him. Sandy lightly bumps the van, notices a merge ahead, and rams the van's side, causing it to flip. He stops his car, watches the van land upright, and then slowly approaches with a mix of urgency and shock."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "At the front desk of the roadside motel, known for its dated yet affordable accommodations, the attendant hands him a clipboard. Outside, Diana opens the car door of their rented sedan, a compact vehicle designed for fuel efficiency, as Sandy pours himself a cup of coffee from a thermos they bought at the last rest stop. A brown utility van, commonly used by tradespeople due to its versatility, pulls into the motel parking lot. The skiptracer, a professional hired to locate individuals who have skipped out on financial obligations, walks around and sees Diana sitting in the open passenger side of the vehicle. Inside the motel lobby, Sandy stirs his coffee, contemplating their next move, while the skiptracer pulls Diana from the car, and he notices the abduction through the window. Sandy, a former college track runner, sprints outside as the skiptracer pushes Diana into the van, locks the door, and scrambles to the driver's seat to make a quick escape.\n\nSandy runs over, watching in horror as the van speeds off, then he swiftly shuts the passenger-side door and gets behind the wheel of his rental, which he hopes will be fast enough for a pursuit. Sandy backs out of his parking spot and speeds away from the motel, tires screeching on the asphalt. On a narrow country road lined with dense trees, the skiptracer talks on his cell phone, likely reporting his progress, as Sandy rapidly approaches the van. He moves into the oncoming lane, heart pounding with adrenaline, and pulls up beside the van. Diana opens a window to shout for help, and spotting an oncoming car, Sandy instinctively hits the brakes and swerves behind the van to avoid a collision.\n\nDiana, determined to escape, pushes against the gated partition separating the cargo area from the driver's seat, while Sandy pulls up beside the van again, looking for an opportunity. The van speeds toward an intersection's red light, where impatient drivers are honking, cars whiz by as the van turns sharply, and Sandy skillfully follows, barely dodging the oncoming vehicles. His sedan skids up alongside another car and he peels away onto a two-lane highway, a stretch of road notoriously busy with weekend traffic. Sandy speeds up beside the skiptracer's van, but the skiptracer swerves aggressively at Sandy, sending him off-course into a grassy median, a tactic meant to deter any pursuers.\n\nSandy desperately recovers on the other side, facing oncoming traffic as drivers frantically swerve out of his way. Guardrails lie on both sides of the road, trapping Sandy with the oncoming traffic in a precarious situation. The skiptracer peers out of his window, watching the businessmen at their numerous vehicles stuck in traffic, oblivious to the chaos unfolding. An 18-wheeler speeds towards Sandy, a terrifying wall of metal and momentum, and he swerves toward the median, using a mound of dirt to his advantage, launching the sedan off so it soars through the air and lands on its tires in the grass, miraculously unharmed as Sandy rejoins the van on the right side of the road.\n\nIn the van, Diana pounds a cylinder, possibly a fire extinguisher used for emergencies, against the partition lock and breaks through. The skiptracer elbows her stomach, a ruthless attempt to regain control, but Diana, fueled by adrenaline and desperation, punches him in the throat and he falls limply against the steering wheel, momentarily incapacitated. Sandy slows down, calculating his next move, and lightly hits the back panel of the van, barely nudging it, a tactic to disorient the driver. Diana notices a merge up ahead, and Sandy eyes the runaway van, his heart racing as he grips the steering wheel and takes a breath. He speeds into the side of the van, causing it to flip over, a desperate but calculated risk. Sandy stares wide-eyed as the van continues to flip into the median, then stops the car and watches the van land right side up, a testament to its robust construction. Sandy unbuckles his seatbelt and slowly emerges from the car, disbelief washing over him. In slow motion, he hurries toward the van, urgency in his steps, with his mouth dropped open, a mixture of relief and shock etched on his face."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Outside Diana opens the car door as Sandy pours himself a cup of coffee and a brown utility van pulls into the motel parking lot At the front desk the attendant hands him a clipboard On a narrow country road the skiptracer talks on his cell phone as Sandy comes up on the van Outside Diana opens the car door as Sandy pours himself a cup of coffee and a brown utility van pulls into the motel parking lot An 18wheeler speeds towards Sandy and he swerves toward the median launching the sedan off a mound of dirt so it soars through the air and lands on its tires in the grass as Sandy rejoins the van on the right side of the road The skiptracer walks around and sees Diana sitting in the open passenger side Inside Sandy stirs his coffee while the skiptracer pulls Diana from the car and he notices the abduction through the window Sandy runs outside as the skiptracer pushes Diana into the van locks the door and hurries to the wheel Sandy runs over and watches the van speed off then he quickly shuts the passengerside door and gets behind the wheel of his rental Sandy unbuckles his seatbelt and slowly emerges from the car Sandy backs out of his parking spot and speeds away from the motel On a narrow country road the skiptracer talks on his cell phone as Sandy comes up on the van He moves into the oncoming lane and pulls up beside the van Diana notices a merge up ahead and Sandy eyes the runaway van gripping the steering wheel as he takes a breath Diana opens a window and spotting an oncoming car Sandy recovers on the other side facing oncoming traffic as speeding cars swerve out of his way Sandy hits the brakes and swerves behind the van Inside Sandy stirs his coffee while the skiptracer pulls Diana from the car and he notices the abduction through the window The van speeds toward an intersection's red light At the front desk the attendant hands him a clipboard Diana pushes against the gated partition while Sandy pulls up beside the van again The van speeds toward an intersection's red light cars whiz by as the van turns sharply and Sandy follows barely dodging the oncoming vehicles His sedan skids up alongside another car and he peels away onto a twolane highway Sandy speeds up beside the skiptracer's van but the skiptracer swerves at Sandy sending him into a grassy median Sandy recovers on the other side facing oncoming traffic as speeding cars swerve out of his way Guardrails lie on both sides of the road trapping Sandy with the oncoming traffic The skiptracer peers out of his window watching the businessmen at their numerous vehicles An 18wheeler speeds towards Sandy and he swerves toward the median launching the sedan off a mound of dirt so it soars through the air and lands on its tires in the grass as Sandy rejoins the van on the right side of the road In slow motion The skiptracer walks around and sees Diana sitting in the open passenger side In the van Diana pounds a cylinder against the partition lock and breaks through The skiptracer elbows her stomach and holds her back but Diana punches him in the throat and he falls limply against the steering wheel Sandy slows down and lightly hits the back panel of the van barely nudging it Diana notices a merge up ahead and Sandy eyes the runaway van gripping the steering wheel as he takes a breath He speeds into the side of the van causing it to flip over Sandy stares wideeyed as the van continues to flip into the median then stops the car and watches the van land right side up Sandy unbuckles his seatbelt and slowly emerges from the car In slow motion Guardrails lie on both sides of the road trapping Sandy with the oncoming traffic Sandy runs outside as the skiptracer pushes Diana into the van locks the door and hurries to the wheel Sandy slows down and lightly hits the back panel of the van barely nudging it he hurries toward the van with his mouth dropped open Sandy backs out of his parking spot and speeds away from the motel"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "At the front desk the attendant hands him a clipboard. Outside Diana opens the car door as Sandy pours himself a cup of coffee and a brown utility van pulls into the motel parking lot. The skiptracer walks around and sees Diana sitting in the open passenger side. Inside Sandy stirs his coffee while the skiptracer pulls Diana from the car and he notices the abduction through the window. Sandy runs outside as the skiptracer pushes Diana into the van locks the door and hurries to the wheel. Sandy runs over and watches the van speed off. then he quickly shuts the passengerside door and gets behind the wheel of his rental. Sandy backs out of his parking spot and speeds away from the motel. On a narrow country road the skiptracer talks on his cell phone as Sandy comes up on the van. He moves into the oncoming lane and pulls up beside the van. Diana opens a window and spotting an oncoming car. Sandy hits the brakes and swerves behind the van. Diana pushes against the gated partition while Sandy pulls up beside the van again. The van speeds toward an intersection's red light. cars whiz by as the van turns sharply and Sandy follows barely dodging the oncoming vehicles. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. His sedan skids up alongside another car and he peels away onto a twolane highway. Sandy speeds up beside the skiptracer's van but the skiptracer swerves at Sandy sending him into a grassy median. Sandy recovers on the other side facing oncoming traffic as speeding cars swerve out of his way. Guardrails lie on both sides of the road trapping Sandy with the oncoming traffic. The skiptracer peers out of his window watching the businessmen at their numerous vehicles. An 18wheeler speeds towards Sandy and he swerves toward the median launching the sedan off a mound of dirt so it soars through the air and lands on its tires in the grass as Sandy rejoins the van on the right side of the road. In the van Diana pounds a cylinder against the partition lock and breaks through. The skiptracer elbows her stomach and holds her back but Diana punches him in the throat and he falls limply against the steering wheel. Sandy slows down and lightly hits the back panel of the van barely nudging it. Diana notices a merge up ahead and Sandy eyes the runaway van gripping the steering wheel as he takes a breath. He speeds into the side of the van causing it to flip over. Sandy stares wideeyed as the van continues to flip into the median then stops the car and watches the van land right side up. Sandy unbuckles his seatbelt and slowly emerges from the car. In slow motion. he hurries toward the van with his mouth dropped open."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "At the front desk the attendant hands him a clipboard. Outside Diana opens the car door as Sandy pours himself a cup of coffee and a brown utility van pulls into the motel parking lot. The skiptracer walks around and sees Diana sitting in the open passenger side. Inside Sandy stirs his coffee while the skiptracer pulls Diana from the car and he notices the abduction through the window. Sandy runs outside as the skiptracer pushes Diana into the van locks the door and hurries to the wheel. Sandy runs over and watches the van speed off. then he quickly shuts the passengerside door and gets behind the wheel of his rental. Sandy backs out of his parking spot and speeds away from the motel. On a narrow country road the skiptracer talks on his cell phone as Sandy comes up on the van. He moves into the oncoming lane and pulls up beside the van. Diana opens a window and spotting an oncoming car. Sandy hits the brakes and swerves behind the van. Diana pushes against the gated partition while Sandy pulls up beside the van again. The van speeds toward an intersection's red light. cars whiz by as the van turns sharply and Sandy follows barely dodging the oncoming vehicles. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. His sedan skids up alongside another car and he peels away onto a twolane highway. Sandy speeds up beside the skiptracer's van but the skiptracer swerves at Sandy sending him into a grassy median. Sandy recovers on the other side facing oncoming traffic as speeding cars swerve out of his way. Guardrails lie on both sides of the road trapping Sandy with the oncoming traffic. The skiptracer peers out of his window watching the businessmen at their numerous vehicles. An 18wheeler speeds towards Sandy and he swerves toward the median launching the sedan off a mound of dirt so it soars through the air and lands on its tires in the grass as Sandy rejoins the van on the right side of the road. In the van Diana pounds a cylinder against the partition lock and breaks through. The skiptracer elbows her stomach and holds her back but Diana punches him in the throat and he falls limply against the steering wheel. Sandy slows down and lightly hits the back panel of the van barely nudging it. Diana notices a merge up ahead and Sandy eyes the runaway van gripping the steering wheel as he takes a breath. He speeds into the side of the van causing it to flip over. Sandy stares wideeyed as the van continues to flip into the median then stops the car and watches the van land right side up. Sandy unbuckles his seatbelt and slowly emerges from the car. In slow motion. he hurries toward the van with his mouth dropped open."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "At the front desk the attendant hands him a clipboard. Outside Diana opens the car door as Sandy pours himself a cup of coffee and a brown utility van pulls into the motel parking lot. The skiptracer walks around and sees Diana sitting in the open passenger side. Inside Sandy stirs his coffee while the skiptracer pulls Diana from the car and he notices the abduction through the window. Sandy runs outside as the skiptracer pushes Diana into the van locks the door and hurries to the wheel. Sandy runs over and watches the van speed off. then he quickly shuts the passengerside door and gets behind the wheel of his rental. Sandy backs out of his parking spot and speeds away from the motel. Sandy slows down and lightly hits the back panel of the van barely nudging it. Diana notices a merge up ahead and Sandy eyes the runaway van gripping the steering wheel as he takes a breath. He speeds into the side of the van causing it to flip over. Sandy stares wideeyed as the van continues to flip into the median then stops the car and watches the van land right side up. Sandy unbuckles his seatbelt and slowly emerges from the car. In slow motion. he hurries toward the van with his mouth dropped open."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "At the front desk the attendant hands him a clipboard. Outside Diana opens the car door as Sandy pours himself a cup of coffee and a brown utility van pulls into the motel parking lot. The skiptracer walks around and sees Diana sitting in the open passenger side. Sandy unbuckles his seatbelt and slowly emerges from the car. In slow motion. he hurries toward the van with his mouth dropped open."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "At the front desk, the bellhop hands the firefighter a clipboard. Outside, the detective opens the car door as the librarian pours himself a cup of coffee and a brown utility van pulls into the motel parking lot. The gardener walks around and sees the detective sitting in the open passenger side. Inside, the librarian stirs his coffee while the gardener pulls the detective from the car, and the firefighter notices the abduction through the window. The librarian runs outside as the gardener pushes the detective into the van, locks the door, and hurries to the wheel. The librarian runs over and watches the van speed off, then he quickly shuts the passenger-side door and gets behind the wheel of his rental. The librarian backs out of his parking spot and speeds away from the motel. On a narrow country road, the gardener talks on his cell phone as the librarian comes up on the van. He moves into the oncoming lane and pulls up beside the van. The detective opens a window, and spotting an oncoming car, the librarian hits the brakes and swerves behind the van. The detective pushes against the gated partition while the librarian pulls up beside the van again. The van speeds toward an intersection's red light, cars whiz by as the van turns sharply, and the librarian follows, barely dodging the oncoming vehicles. His sedan skids up alongside another car and he peels away onto a two-lane highway. The librarian speeds up beside the gardener's van, but the gardener swerves at the librarian, sending him into a grassy median. The librarian recovers on the other side, facing oncoming traffic as speeding cars swerve out of his way. Guardrails lie on both sides of the road, trapping the librarian with the oncoming traffic. The gardener peers out of his window, watching the chefs at their numerous vehicles. An 18-wheeler speeds towards the librarian and he swerves toward the median, launching the sedan off a mound of dirt so it soars through the air and lands on its tires in the grass as the librarian rejoins the van on the right side of the road. In the van, the detective pounds a cylinder against the partition lock and breaks through. The gardener elbows her stomach and holds her back, but the detective punches him in the throat and he falls limply against the steering wheel. The librarian slows down and lightly hits the back panel of the van, barely nudging it. The detective notices a merge up ahead, and the librarian eyes the runaway van, gripping the steering wheel as he takes a breath. He speeds into the side of the van, causing it to flip over. The librarian stares wide-eyed as the van continues to flip into the median, then stops the car and watches the van land right side up. The librarian unbuckles his seatbelt and slowly emerges from the car. In slow motion, he hurries toward the van with his mouth dropped open."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "At the reception counter, the attendant hands him a sketchpad. Outside, Diana opens the airplane door as Sandy pours himself a cup of lemonade and a blue delivery truck pulls into the hostel parking lot. The skiptracer walks around and sees Diana sitting in the open pilot's seat. Inside, Sandy stirs his lemonade while the skiptracer pulls Diana from the airplane, and he notices the abduction through the window. Sandy runs outside as the skiptracer pushes Diana into the truck, locks the door, and hurries to the helm. Sandy runs over and watches the truck speed off, then he quickly shuts the pilot's seat door and gets behind the wheel of his scooter. Sandy backs out of his parking spot and speeds away from the hostel. On a narrow dirt track, the skiptracer talks on his walkie-talkie as Sandy comes up on the truck. He moves into the opposite lane and pulls up beside the truck. Diana opens a skylight, and spotting an oncoming tractor, Sandy hits the brakes and swerves behind the truck. Diana pushes against the netted barrier while Sandy pulls up beside the truck again. The truck speeds toward a roundabout’s yellow light, tractors whiz by as the truck turns sharply, and Sandy follows, barely dodging the oncoming farm machinery. His moped skids up alongside another tractor and he peels away onto a one-lane track. Sandy speeds up beside the skiptracer's truck, but the skiptracer swerves at Sandy, sending him into a grassy embankment. Sandy recovers on the other side, facing oncoming machinery as speeding tractors swerve out of his way. Walls of corn lie on both sides of the track, trapping Sandy with the oncoming machinery. The skiptracer peers out of his window, watching the farmers at their numerous plows. A combine harvester speeds towards Sandy and he swerves toward the embankment, launching the moped off a pile of hay so it soars through the air and lands on its tires in the dirt as Sandy rejoins the truck on the right side of the track. In the truck, Diana pounds a plank against the barrier lock and breaks through. The skiptracer elbows her stomach and holds her back, but Diana punches him in the throat and he falls limply against the dashboard. Sandy slows down and lightly hits the back panel of the truck, barely nudging it. Diana notices a fork up ahead, and Sandy eyes the runaway truck, gripping the handlebar as he takes a breath. He speeds into the side of the truck, causing it to flip over. Sandy stares wide-eyed as the truck continues to flip into the embankment, then stops the moped and watches the truck land right side up. Sandy unbuckles his helmet and slowly emerges from the moped. In slow motion, he hurries toward the truck with his mouth dropped open."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "At the front desk, the attendant tosses him a clipboard. Outside, Diana kicks the car door as Sandy flips himself a cup of coffee and a brown utility van drifts into the motel parking lot. The skiptracer floats around and finds Diana dozing in the open passenger side. Inside, Sandy spills his coffee while the skiptracer plucks Diana from the car, and he registers the abduction through the window. Sandy skips outside as the skiptracer lifts Diana into the van, bolts the door, and jogs to the wheel. Sandy leaps over and observes the van glide off, then he sluggishly slams the passenger-side door and creeps behind the wheel of his rental. Sandy crawls out of his parking spot and drifts away from the motel. On a narrow country road, the skiptracer whispers on his cell phone as Sandy floats up on the van. He drifts into the oncoming lane and slides up beside the van. Diana cracks a window, and spotting an oncoming car, Sandy taps the brakes and twirls behind the van. Diana leans against the gated partition while Sandy glides up beside the van again. The van drifts toward an intersection's red light, cars buzz by as the van curves sharply, and Sandy trails, barely dodging the oncoming vehicles. His sedan glides up alongside another car and he edges away onto a two-lane highway. Sandy floats up beside the skiptracer's van, but the skiptracer drifts at Sandy, sending him into a grassy median. Sandy hovers on the other side, facing oncoming traffic as buzzing cars wiggle out of his way. Guardrails sit on both sides of the road, encasing Sandy with the oncoming traffic. The skiptracer peers out of his window, observing the businessmen at their various vehicles. An 18-wheeler drifts towards Sandy and he swerves toward the median, launching the sedan off a mound of dirt so it glides through the air and lands on its tires in the grass as Sandy rejoins the van on the right side of the road. In the van, Diana taps a cylinder against the partition lock and smashes through. The skiptracer elbows her side and nudges her back, but Diana taps him in the throat and he slips limply against the steering wheel. Sandy slows down and gently bumps the back panel of the van, softly nudging it. Diana spots a merge up ahead, and Sandy examines the drifting van, gripping the steering wheel as he holds a breath. He glides into the side of the van, causing it to glide over. Sandy gazes wide-eyed as the van continues to roll into the median, then halts the car and watches the van settle right side up. Sandy unbuckles his seatbelt and lazily emerges from the car. In slow motion, he ambles toward the van with his mouth slightly open."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "At the candy shop, the painter hands him a backpack. Outside, Monica opens the bookcase door as Charlie pours himself a mug of tea and a pink delivery bike pulls into the airport parking lot. The artist walks around and sees Monica sitting in the open driver's seat. Inside, Charlie stirs his tea while the artist pulls Monica from the bookcase, and he notices the abduction through the mirror. Charlie runs outside as the artist pushes Monica into the bike, locks the door, and hurries to the handlebars. Charlie runs over and watches the bike speed off, then he quickly shuts the driver-side door and gets behind the handlebars of his skateboard. Charlie backs out of his parking spot and speeds away from the airport. On a narrow city street, the artist talks on his laptop as Charlie comes up on the bike. He moves into the oncoming path and pulls up beside the bike. Monica opens a drawer, and spotting an oncoming bicycle, Charlie hits the brakes and swerves behind the bike. Monica pushes against the steel grate while Charlie pulls up beside the bike again. The bike speeds toward a roundabout's stop sign, bicycles whiz by as the bike turns sharply, and Charlie follows, barely dodging the oncoming bicycles. His skates skid up alongside another bicycle and he rolls away onto a footpath. Charlie speeds up beside the artist's bike, but the artist swerves at Charlie, sending him into a sandy ditch. Charlie recovers on the other side, facing oncoming pedestrians as speedy bicycles swerve out of his way. Benches lie on both sides of the path, trapping Charlie with the oncoming pedestrians. The artist peers out of his drawer, watching the chefs at their numerous umbrellas. A skateboard speeds towards Charlie and he swerves toward the ditch, launching the skates off a mound of leaves so they soar through the air and land on their wheels in the sand as Charlie rejoins the bike on the left side of the path. In the bike, Monica pounds a drum against the steel grate and breaks through. The artist elbows her shoulder and holds her back, but Monica punches him in the elbow and he falls limply against the crankshaft. Charlie slows down and lightly hits the back basket of the bike, barely nudging it. Monica notices a bend up ahead, and Charlie eyes the runaway bike, gripping the handlebars as he takes a breath. He speeds into the side of the bike, causing it to topple over. Charlie stares wide-eyed as the bike continues to topple into the ditch, then stops the skates and watches the bike land right side up. Charlie unbuckles his helmet and slowly emerges from the skates. In slow motion, he hurries toward the bike with his mouth dropped open."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "At the front desk, the gardener tosses him a sketchpad. Outside, Alex closes the truck door as Jamie brews herself a pot of tea and a red delivery bike glides into the motel parking lot. The detective meanders around and spots Alex reclining in the open driver side. Inside, Jamie sips her tea while the detective drags Alex from the truck, and she observes the scene through the window. Jamie jogs outside as the detective shoves Alex into the bike, secures the lock, and rushes to the pedals. Jamie dashes over and observes the bike zoom away, then she swiftly closes the driver-side door and climbs behind the handlebars of her motorbike. Jamie reverses out of her parking spot and cruises away from the motel. On a winding country track, the detective texts on his smartphone as Jamie catches up to the bike. She shifts into the opposing lane and glides alongside the bike. Alex rolls down a window, and glimpsing an approaching bus, Jamie slams the brakes and swerves behind the bike. Alex shoves against the gated barrier while Jamie glides alongside the bike once more. The bike accelerates toward a junction's stop sign, vehicles whisk by as the bike veers sharply, and Jamie trails behind, narrowly avoiding the rushing traffic. Her motorcycle skids alongside another bike and she zooms onto a dual carriageway. Jamie accelerates next to the detective's bike, but the detective veers into Jamie, sending her onto a grassy verge. Jamie regains control on the far side, facing oncoming traffic as rushing vehicles veer out of her path. Barriers line both sides of the track, trapping Jamie with the approaching traffic. The detective peers out of his doorway, observing the tourists at their various transports. An 18-wheeler barrels towards Jamie and she steers towards the verge, propelling the motorbike off a mound of earth so it sails through the air and lands on its wheels in the grass as Jamie rejoins the bike on the correct side of the track. In the bike, Alex strikes a rod against the barrier lock and smashes through. The detective knees him in the gut and restrains him back, but Alex elbows him in the chest and he collapses limply against the handlebars. Jamie decelerates and gently taps the rear panel of the bike, barely jostling it. Alex spots a junction coming up, and Jamie surveys the runaway bike, clutching the handlebars as she exhales. She veers into the side of the bike, causing it to topple over. Jamie gawks as the bike continues to tumble into the verge, then halts the motorbike and gazes at the bike landing upright. Jamie unstraps her helmet and cautiously dismounts from the motorbike. In slow motion, she rushes toward the bike with her lips parted in shock."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "At the entry kiosk, the attendant tosses him a notepad. Outside, Diana raises the train door as Sandy brews himself a cup of tea and a green delivery truck drifts into the campsite driveway. The investigator ambles around and observes Diana lounging in the open driver's seat. Inside, Sandy whisks his tea while the investigator lifts Diana from the train, and he glimpses the event through the curtain. Sandy dashes outside as the investigator shoves Diana into the truck, secures the latch, and skips to the controls. Sandy dashes over and observes the truck zoom away, then he swiftly closes the driver's-side door and slips behind the controls of his bicycle. Sandy rolls out of his parking spot and whizzes away from the campsite. On a winding forest trail, the investigator chats on his walkie-talkie as Sandy inches up on the truck. He shifts into the opposing lane and creeps up next to the truck. Diana cracks a skylight, and noticing an approaching tractor, Sandy slams the gas and swings behind the truck. Diana presses against the metal divider while Sandy edges up next to the truck again. The truck races toward a crosswalk's yellow signal, bicycles whiz by as the truck veers sharply, and Sandy tails, narrowly skirting the approaching cycles. His moped skids up alongside another scooter and he zips away onto a gravel path. Sandy accelerates beside the investigator's truck, but the investigator veers at Sandy, sending him into a muddy embankment. Sandy rebounds on the other side, confronting oncoming bicycles as swift cycles veer out of his path. Hedges frame both sides of the lane, entrapping Sandy with the approaching traffic. The investigator peers out his hatch, observing the athletes at their myriad scooters. A double-decker bus charges towards Sandy and he veers toward the embankment, launching the moped off a pile of rubble so it glides through the breeze and lands on its wheels in the grass as Sandy reunites with the truck on the left side of the path. In the truck, Diana pounds a bat against the divider lock and breaches through. The investigator knees her ribs and restrains her, but Diana elbows him in the throat and he collapses limply onto the handlebars. Sandy decelerates and gently taps the side panel of the truck, barely grazing it. Diana recognizes a merge up ahead, and Sandy eyes the runaway truck, clenching the handlebars as he takes a breath. He accelerates into the edge of the truck, causing it to topple over. Sandy gawks wide-eyed as the truck continues to tumble into the embankment, then halts the moped and observes the truck settle upright. Sandy unfastens his helmet and gradually crawls out of the moped. In drawn-out motion, he dashes toward the truck with his jaw agape."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "At the art gallery, the curator hands her a telescope. Nearby, Jenna opens the airplane door as Marcus pours himself a glass of orange juice and a bright red fire truck pulls into the stadium parking lot. The librarian strolls around and sees Jenna lounging on the open tailgate. Inside, Marcus shakes his lemonade while the librarian drags Jenna from the airplane, and she observes the departure through the porthole. Marcus dashes outside as the librarian shoves Jenna into the fire truck, bolts the hatch, and scurries to the joystick. Marcus sprints over and observes the fire truck zoom away, then he swiftly closes the tailgate and jumps onto the skateboard of his bicycle. Marcus reverses out of his berth and zips away from the stadium. On a congested urban avenue, the librarian chats on his walkie-talkie as Marcus approaches the fire truck. He veers into the biking lane and glides alongside the fire truck. Jenna unlatches a skylight, and spotting a looming ferry, Marcus slams the accelerator and zigzags behind the fire truck. Jenna presses against the locked gate while Marcus draws up next to the fire truck again. The fire truck dashes toward a skyscraper’s revolving door, pedestrians race by as the fire truck pivots abruptly, and Marcus tails it, narrowly evading the bustling masses. His motorcycle slides up alongside a trolley and he accelerates onto an escalator. Marcus zooms beside the librarian's fire truck, but the librarian zigzags at Marcus, steering him into a sandy beach. Marcus navigates around the other side, dodging a cascade of bicycles as zooming maps maneuver out of his path. Dunes stretch on both sides of the desert, enclosing Marcus with the swirling sands. The librarian glances out of his porthole, observing the engineers at their multiple aircraft. A hovercraft barrels towards Marcus and he zigzags toward the dunes, launching the motorcycle off a bump so it glides through the clouds and lands on its wheels in the sand as Marcus rejoins the fire truck on the correct side of the sky. In the fire truck, Jenna bangs a cube against the portal lock and smashes through. The librarian jabs her shoulder and restrains her, but Jenna kicks him in the nose and he collapses limply against the joystick. Marcus decelerates and lightly taps the rear panel of the fire truck, gently jostling it. Jenna notices a tunnel up ahead, and Marcus observes the rogue fire truck, clutching the joystick as he draws air. He accelerates into the flank of the fire truck, causing it to tumble over. Marcus gawks wide-eyed as the fire truck persists to tumble into the dunes, then halts the motorcycle and observes the fire truck land upright. Marcus unfastens his harness and leisurely steps from the motorcycle. In slow motion, he rushes toward the fire truck with his eyes widened."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "At the front desk, an attendant hands a clipboard to a man while outside, Diana sits in a car with Sandy, who notices a skiptracer abducting her into a van. Sandy races out as the skiptracer drives off, and he quickly pursues in his rental. They speed down a country road, where Sandy attempts to pull up beside the van. Diana opens a window, but Sandy swerves behind the van to avoid an oncoming car. As they approach a red light, the van turns sharply; Sandy follows, narrowly dodging traffic and skidding onto a highway. The skiptracer swerves at Sandy, pushing him into a grassy median. Sandy recovers among oncoming traffic, barely avoiding collisions, and rejoins the van. Diana breaks through the van's partition, fights off the skiptracer, and Sandy lightly hits the van's back, causing it to flip. Sandy watches wide-eyed as the van flips into the median, then stops, lands right side up, and slowly emerges from his car, hurrying toward the van."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "he hurries toward the van with his mouth dropped open In slow motion Sandy unbuckles his seatbelt and slowly emerges from the car Sandy stares wideeyed as the van continues to flip into the median then stops the car and watches the van land right side up He speeds into the side of the van causing it to flip over Diana notices a merge up ahead and Sandy eyes the runaway van gripping the steering wheel as he takes a breath Sandy slows down and lightly hits the back panel of the van barely nudging it The skiptracer elbows her stomach and holds her back but Diana punches him in the throat and he falls limply against the steering wheel In the van Diana pounds a cylinder against the partition lock and breaks through An 18wheeler speeds towards Sandy and he swerves toward the median launching the sedan off a mound of dirt so it soars through the air and lands on its tires in the grass as Sandy rejoins the van on the right side of the road The skiptracer peers out of his window watching the businessmen at their numerous vehicles Guardrails lie on both sides of the road trapping Sandy with the oncoming traffic Sandy recovers on the other side facing oncoming traffic as speeding cars swerve out of his way Sandy speeds up beside the skiptracer's van but the skiptracer swerves at Sandy sending him into a grassy median His sedan skids up alongside another car and he peels away onto a twolane highway cars whiz by as the van turns sharply and Sandy follows barely dodging the oncoming vehicles The van speeds toward an intersection's red light Diana pushes against the gated partition while Sandy pulls up beside the van again Sandy hits the brakes and swerves behind the van Diana opens a window and spotting an oncoming car He moves into the oncoming lane and pulls up beside the van On a narrow country road the skiptracer talks on his cell phone as Sandy comes up on the van Sandy backs out of his parking spot and speeds away from the motel then he quickly shuts the passengerside door and gets behind the wheel of his rental Sandy runs over and watches the van speed off Sandy runs outside as the skiptracer pushes Diana into the van locks the door and hurries to the wheel Inside Sandy stirs his coffee while the skiptracer pulls Diana from the car and he notices the abduction through the window The skiptracer walks around and sees Diana sitting in the open passenger side Outside Diana opens the car door as Sandy pours himself a cup of coffee and a brown utility van pulls into the motel parking lot At the front desk the attendant hands him a clipboard"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The skiptracer peers out of his window watching the businessmen at their numerous vehicles cars whiz by as the van turns sharply and Sandy follows barely dodging the oncoming vehicles Diana opens a window and spotting an oncoming car Sandy stares wideeyed as the van continues to flip into the median then stops the car and watches the van land right side up The skiptracer elbows her stomach and holds her back but Diana punches him in the throat and he falls limply against the steering wheel then he quickly shuts the passengerside door and gets behind the wheel of his rental Sandy runs over and watches the van speed off Diana pushes against the gated partition while Sandy pulls up beside the van again Sandy hits the brakes and swerves behind the van His sedan skids up alongside another car and he peels away onto a twolane highway He moves into the oncoming lane and pulls up beside the van He speeds into the side of the van causing it to flip over he hurries toward the van with his mouth dropped open In the van Diana pounds a cylinder against the partition lock and breaks through Sandy speeds up beside the skiptracer's van but the skiptracer swerves at Sandy sending him into a grassy median Sandy unbuckles his seatbelt and slowly emerges from the car Outside Diana opens the car door as Sandy pours himself a cup of coffee and a brown utility van pulls into the motel parking lot The van speeds toward an intersection's red light Guardrails lie on both sides of the road trapping Sandy with the oncoming traffic The skiptracer walks around and sees Diana sitting in the open passenger side Sandy recovers on the other side facing oncoming traffic as speeding cars swerve out of his way In slow motion Sandy runs outside as the skiptracer pushes Diana into the van locks the door and hurries to the wheel Diana notices a merge up ahead and Sandy eyes the runaway van gripping the steering wheel as he takes a breath Sandy backs out of his parking spot and speeds away from the motel On a narrow country road the skiptracer talks on his cell phone as Sandy comes up on the van Sandy slows down and lightly hits the back panel of the van barely nudging it At the front desk the attendant hands him a clipboard Inside Sandy stirs his coffee while the skiptracer pulls Diana from the car and he notices the abduction through the window An 18wheeler speeds towards Sandy and he swerves toward the median launching the sedan off a mound of dirt so it soars through the air and lands on its tires in the grass as Sandy rejoins the van on the right side of the road"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "His sedan skids up alongside another car and he peels away onto a twolane highway Sandy speeds up beside the skiptracer's van but the skiptracer swerves at Sandy sending him into a grassy median Sandy recovers on the other side facing oncoming traffic as speeding cars swerve out of his way Guardrails lie on both sides of the road trapping Sandy with the oncoming traffic The skiptracer peers out of his window watching the businessmen at their numerous vehicles An 18wheeler speeds towards Sandy and he swerves toward the median launching the sedan off a mound of dirt so it soars through the air and lands on its tires in the grass as Sandy rejoins the van on the right side of the road In the van Diana pounds a cylinder against the partition lock and breaks through The skiptracer elbows her stomach and holds her back but Diana punches him in the throat and he falls limply against the steering wheel Sandy slows down and lightly hits the back panel of the van barely nudging it Diana notices a merge up ahead and Sandy eyes the runaway van gripping the steering wheel as he takes a breath He speeds into the side of the van causing it to flip over Sandy stares wideeyed as the van continues to flip into the median then stops the car and watches the van land right side up Sandy unbuckles his seatbelt and slowly emerges from the car In slow motion he hurries toward the van with his mouth dropped open At the front desk the attendant hands him a clipboard Outside Diana opens the car door as Sandy pours himself a cup of coffee and a brown utility van pulls into the motel parking lot The skiptracer walks around and sees Diana sitting in the open passenger side Inside Sandy stirs his coffee while the skiptracer pulls Diana from the car and he notices the abduction through the window Sandy runs outside as the skiptracer pushes Diana into the van locks the door and hurries to the wheel Sandy runs over and watches the van speed off then he quickly shuts the passengerside door and gets behind the wheel of his rental Sandy backs out of his parking spot and speeds away from the motel On a narrow country road the skiptracer talks on his cell phone as Sandy comes up on the van He moves into the oncoming lane and pulls up beside the van Diana opens a window and spotting an oncoming car Sandy hits the brakes and swerves behind the van Diana pushes against the gated partition while Sandy pulls up beside the van again The van speeds toward an intersection's red light cars whiz by as the van turns sharply and Sandy follows barely dodging the oncoming vehicles"
        }
      ]
    }
  ]
}