{
  "ground_truth": "Sandy reaches into his pockets and comes up empty, then looks at Diana. He walks back to the bench, sighs, and shakes his head. Diana looks away somberly as Sandy gazes down at his pants. He sits beside her, kicks off the shoes, looks down, and pulls out a wad of cash. At the salvage yard, they pull out of the lot in an old, run-down Chevy Caprice. At the bus station, the skiptracer limps in and takes a sip from the juice pouch, tossing it on the ground as he walks over to the ticket booth. The attendant recoils from the skiptracer's bloody face. He looks around the empty station, then sees the attendant with the hand out, twisting his wrist, and writes down and hands the skiptracer a slip of paper as the skiptracer holds his gun up to the window. As he backs away, a bullet rips through his neck and shatters the glass. Paolo's thugs approach with silenced pistols. The skiptracer holds his neck wound as Julian takes the address. Maricol looks at the attendant and holds her finger up to her lips, and the booth window falls apart. Now, Sandy and Diana cruise down the highway toward a bridge. In the car, Sandy's hardened gaze fixes ahead as Diana sits on her side facing him. He swerves the car, smashing her head on the window, and swerves again. Later, they cruise over the Mississippi River into St. Louis, where the Gateway Arch stands tall over the city. At a gas station, Sandy fills up as Diana emerges from the car, and Sandy looks up thoughtfully. Diana falls in the lobby, and the security guard hurries over. As he rubs Diana's leg, a businessman enters the executive fitness center, and Sandy glances around, then slips inside the closing door. Sandy watches the man place his suit in a locker as the guard rubs Diana's butt. The businessman closes his locker with the code and leaves. Sandy quickly approaches, puts in a code, and opens the locker. He glances back with a smile. Now, in a dapper suit and red tie, he strolls through the offices with Diana. They spot a balding man behind a desk. Diana and Sandy exchange a look; she faces the man, shielding her mouth with her hand, as he lifts his phone and Diana backs away. He stares into Ken's eyes with his brow raised. On a security monitor, Sandy enters the code, and our view lowers inside the records room as a glass door and metal gate slide open. Sandy and Diana briskly enter, and pulling equipment from her bag, Diana hard-lines her credit card burner into the network as Sandy searches the shelves, finding Cornish's records in a box.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sandy delves into his pockets and ends up void, then glances at Diana. He strolls back to the seat, exhales, and quivers his head. Diana averts her gaze solemnly as Sandy peers down at his trousers. He perches beside her, flicks off the footwear, glances downward, and extracts a bundle of money. At the scrapyard, they pull out of the area in an aged, dilapidated Chevy Caprice. At the bus depot, the skiptracer hobbles in and takes a draught from the juice bag, flinging it on the earth as he strides toward the ticket counter. The clerk recoils from the skiptracer's gory visage. He glances around the vacant depot, then spots the clerk with the hand extended, rotating his wrist, and scribes down and hands the skiptracer a piece of paper as the skiptracer brandishes his firearm up to the pane. As he retreats, a projectile tears through his throat and shatters the glass. Paolo's henchmen approach with muffled handguns. The skiptracer clutches his throat injury as Julian takes the location. Maricol glances at the clerk and places her finger up to her lips, and the counter pane collapses. Now, Sandy and Diana glide down the roadway toward a span. In the vehicle, Sandy's steely gaze fixes forward as Diana sits on her side facing him. He veers the vehicle, striking her head on the pane, and veers again. Later, they glide over the Mississippi River into St. Louis, where the Gateway Arch towers over the metropolis. At a gas station, Sandy fills up as Diana emerges from the vehicle, and Sandy glances up pensively. Diana collapses in the foyer, and the security guard rushes over. As he kneads Diana's leg, a businessman enters the corporate fitness center, and Sandy glances around, then slips inside the closing portal. Sandy observes the man place his ensemble in a locker as the guard kneads Diana's rear. The businessman shuts his locker with the code and departs. Sandy swiftly approaches, inputs a code, and opens the locker. He glances back with a grin. Now, in a stylish ensemble and crimson necktie, he strolls through the offices with Diana. They spot a balding individual behind a desk. Diana and Sandy exchange a look; she faces the individual, shielding her mouth with her hand, as he raises his telephone and Diana retreats. He gazes into Ken's eyes with his brow elevated. On a security monitor, Sandy inputs the code, and our view descends inside the records room as a glass pane and metal barrier slide open. Sandy and Diana briskly enter, and extracting gear from her bag, Diana connects her credit card burner into the network as Sandy searches the racks, locating Cornish's records in a carton."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Sandy's pockets are reached into by him, and they are found empty, then Diana is looked at by him. The bench is walked back to, a sigh is given, and his head is shaken by him. Diana looks away somberly as his pants are gazed down at by Sandy. Beside her, he sits, the shoes are kicked off, he looks down, and a wad of cash is pulled out by him. At the salvage yard, the lot is pulled out of by them in an old, run-down Chevy Caprice. At the bus station, the skiptracer limps in and sips from the juice pouch, which is tossed on the ground by him as the ticket booth is walked over to. The attendant recoils from the skiptracer's bloody face. The empty station is looked around, then the skiptracer sees the attendant with the hand out, twisting his wrist, and writes down and hands the skiptracer a slip of paper as the window is held up to by him with his gun. As the skiptracer backs away, a bullet rips through his neck, shattering the glass. Paolo's thugs approach with silenced pistols. The skiptracer holds his neck wound as Julian takes the address. The attendant is looked at by Maricol and her finger is held up to her lips by her, and the booth window falls apart. Now, the highway toward a bridge is cruised down by Sandy and Diana. In the car, Sandy's hardened gaze is fixed ahead as Diana sits on her side facing him. The car is swerved by him, her head is smashed on the window, and he swerves again. Later, the Mississippi River is cruised over into St. Louis by them, where the Gateway Arch stands tall over the city. At a gas station, the tank is filled up by Sandy as Diana emerges from the car, and he looks up thoughtfully. Diana falls in the lobby, and the security guard hurries over. As Diana's leg is rubbed by him, the executive fitness center is entered by a businessman, and the surroundings are glanced around by Sandy, then he slips inside the closing door. The man is watched by Sandy as he places his suit in a locker and the guard rubs Diana's butt. The businessman closes his locker with the code and leaves. The locker is approached quickly by Sandy, a code is put in, and it is opened by him. A glance back is given with a smile. Now, a dapper suit and red tie are worn by him, as he strolls through the offices with Diana. A balding man is spotted by them behind a desk. A look is exchanged by Diana and Sandy; he is faced by her, as her mouth is shielded with her hand, and his phone is lifted as she backs away. Ken's eyes are stared into by him with his brow raised. On a security monitor, the code is entered by Sandy, and our view lowers inside the records room as a glass door and metal gate slide open. Sandy and Diana briskly enter, and pulling equipment from her bag, Diana hard-lines her credit card burner into the network as the shelves are searched by Sandy, finding Cornish's records in a box."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Sandy checks his empty pockets, then looks at Diana. He returns to the bench, sighs, and shakes his head. Diana glances away as Sandy sits beside her, removes his shoes, and reveals a wad of cash. They leave the salvage yard in a dilapidated Chevy Caprice. At the bus station, the skiptracer, limping and with a bloody face, drinks from a juice pouch and tosses it aside. He approaches the ticket booth, where the attendant, recoiling, writes a slip as the skiptracer threatens with a gun. A bullet shatters the glass and hits the skiptracer's neck. Paolo’s thugs arrive with silenced pistols; the skiptracer holds his wound as Julian takes the address. Maricol gestures for silence, and the booth window collapses. Sandy and Diana head towards a bridge, Sandy fixated ahead while Diana sits facing him. He swerves the car, causing her head to hit the window. Later, they cross the Mississippi River into St. Louis, past the towering Gateway Arch. At a gas station, Sandy fills up as Diana exits the car. In the lobby, Diana falls, and a guard rushes over. A businessman enters the fitness center, and Sandy slips inside. He observes the businessman use a locker and enter a code. After the businessman leaves, Sandy uses the same code to open the locker, smiling. Now dressed sharply, he strolls with Diana through offices. They spot a balding man at a desk; Diana covers her mouth, facing him, as Sandy lifts his phone. On a security monitor, Sandy’s code grants access, and the view descends to the records room. Sandy and Diana enter swiftly, Diana connects her credit card burner, and Sandy finds Cornish’s records."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Sandy empties his pockets, glances at Diana, then returns to the bench, sighing. Diana looks away as Sandy sits, removes his shoes, and finds cash. They leave the salvage yard in a run-down Chevy Caprice. At the bus station, a limping skiptracer drinks from a juice pouch, discarding it as the attendant recoils at his bloody face. The skiptracer, holding a gun, gets a note from the attendant, but a bullet shatters the glass, injuring him. Paolo's thugs approach, and Julian takes the address. Maricol signals silence as the window falls apart. Sandy and Diana head down the highway, Sandy's gaze fixed as Diana faces him. He swerves, causing Diana to hit the window, and they cross the Mississippi River into St. Louis. At a gas station, Sandy fills up as Diana exits the car. Diana falls inside, and a guard approaches as Sandy slips into an executive fitness center. He watches a businessman in a locker room, enters the code, and smiles, wearing a suit and red tie. Sandy and Diana spot a man behind a desk, exchange glances, and Diana discreetly communicates. On a security monitor, Sandy's code grants access to the records room. Diana uses her credit card burner while Sandy finds Cornish's records."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Sandy, feeling the familiar sensation of reaching into his pockets only to find them completely empty, turns his gaze toward Diana with a look of regret. He retraces his steps back to the worn-out bench, letting out a heavy sigh, and gently shaking his head in a gesture of resignation. Diana, unable to meet his eyes, looks away with a somber expression as Sandy's gaze falls to the fabric of his pants. He then sets himself down beside her, casually kicking off his shoes, and directs his attention downward, pulling out a large bundle of cash.\n\nAt the expansive, cluttered salvage yard, they manage to drive out of the dusty lot in an aged, dilapidated Chevy Caprice that appears to have seen better days. Meanwhile, at the bus station, the skiptracer arrives with a noticeable limp, taking a sip from a juice pouch before carelessly discarding it on the ground as he approaches the ticket booth. The booth attendant, visibly startled, draws back in horror at the sight of the skiptracer's bloodied face. Surveying the deserted station, the skiptracer's attention is drawn to the attendant's outstretched hand, the fingers twisting in a silent plea. The attendant, with a shaky resolve, scribbles something on a slip of paper, passing it to the skiptracer, who menacingly holds a gun to the glass window. As he starts to retreat, a sudden bullet pierces his neck, shattering the glass into shards. Paolo's thugs, armed with silenced pistols, approach stealthily. The skiptracer clutches his neck wound in pain as Julian quietly takes the address. Maricol, witnessing the scene, raises a finger to her lips in a gesture of silence, as the window of the booth collapses in disarray.\n\nNow, Sandy and Diana are seen cruising steadily down the open highway, heading toward an imposing bridge. Inside the car, Sandy's hardened and determined gaze is fixed intently ahead, while Diana sits on her side, facing him with a mixture of apprehension and curiosity. With a sudden movement, he swerves the vehicle sharply, causing Diana's head to collide with the window, only to swerve once again. Eventually, they drive smoothly over the expansive Mississippi River, entering St. Louis, where the iconic Gateway Arch stands proudly against the skyline. Later, at a bustling gas station, Sandy methodically fills up the tank while Diana steps out of the car, stretching her legs as Sandy gazes upward, lost in thoughtful contemplation.\n\nIn the lobby, Diana collapses unexpectedly, prompting a speedily reacting security guard to rush over out of concern. As he attempts to comfort her by rubbing her leg, a businessman makes his way into the exclusive executive fitness center. Sandy, seizing the opportunity, discreetly surveys his surroundings and slips inside just before the heavy door closes. Observing the businessman, Sandy watches as he carefully places his crisp suit into a locker, the security guard's hand moving to rub Diana's butt in a moment of distraction. With the businessman having securely shut the locker using a code, he leaves, and Sandy quickly acts, inputting the code and swinging the locker open with a sense of urgency. He glances backward, a triumphant smile playing on his lips.\n\nNow dressed in a smart, dapper suit and a striking red tie, he confidently strolls through the bustling offices alongside Diana. Together, they spot a balding man seated behind a large desk, his demeanor focused and intent. Diana and Sandy share a knowing look, a silent communication passing between them. She turns to face the man, discreetly shielding her mouth with her hand as he raises his phone, causing Diana to take a cautious step back. He locks his gaze into Ken's eyes, his brow raised with an air of subtle defiance. On a security monitor, Sandy enters a code, and from our perspective, we watch as the view descends inside the records room. A glass door and metal gate simultaneously slide open with precision. Swiftly, Sandy and Diana enter the room, Diana retrieving equipment from her bag and deftly connecting her credit card burner into the network. Meanwhile, Sandy diligently searches the shelves, ultimately locating Cornish's records stored safely within a sturdy box."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Sandy, experiencing the all-too-familiar sensation of reaching into his pockets only to discover them completely bereft of any contents, directs his gaze toward Diana, his features etched with a look of profound regret. He retraces his steps back to the old, worn-out bench, letting out a deep, heavy sigh, and gently shaking his head in a gesture that speaks of resignation and acceptance. Diana, unable to bring herself to meet his eyes, diverts her gaze with a somber expression as Sandy's eyes fall despondently to the fabric of his pants. He then positions himself beside her on the bench, casually kicking off his shoes, and directs his focus downward, where he surprises himself by pulling out an unexpectedly large bundle of cash.\n\nAt the expansive, sprawling salvage yard, they manage to drive out from amidst the chaotic and cluttered lot in an aged, battered Chevy Caprice that appears to have undoubtedly seen far better days in its past. Meanwhile, at the seemingly deserted bus station, the skiptracer arrives with a noticeable limp, taking a nonchalant sip from a juice pouch before carelessly tossing it to the ground as he approaches the ticket booth. The booth attendant, visibly startled by his appearance, recoils in horror at the sight of the skiptracer's bloodied face. As the skiptracer surveys the otherwise deserted station, his attention is drawn to the attendant's trembling, outstretched hand, with the fingers twisting in a silent, pleading gesture. Mustering shaky resolve, the attendant scribbles something quickly on a slip of paper, passing it under the glass to the skiptracer, who menacingly holds a gun to the window. As he begins to retreat, a sudden bullet pierces his neck, shattering the glass into countless shards. Paolo's thugs, armed with silenced pistols, approach in a stealthy manner. The skiptracer clutches his neck wound in excruciating pain as Julian quietly retrieves the address. Maricol, who has witnessed the entire scene unfold, raises a finger to her lips in a gesture that signals silence as the glass window of the booth collapses into chaotic disarray.\n\nNow, Sandy and Diana are seen cruising steadily down the open highway, making their way toward an imposing bridge. Inside the car, Sandy's hardened, determined gaze is fixed intently on the road ahead, while Diana sits on her side, facing him with a look that is a mixture of apprehension and curiosity. With a sudden, unexpected movement, Sandy swerves the vehicle sharply, causing Diana's head to collide with the window, only to suddenly swerve once again. Eventually, they drive smoothly over the expansive Mississippi River, making their way into St. Louis, where the iconic Gateway Arch stands proudly and prominently against the city's skyline. Later, at a bustling, busy gas station, Sandy methodically fills up the tank while Diana steps out of the car, stretching her legs as Sandy gazes upward, lost in deep, thoughtful contemplation.\n\nIn the lobby, Diana unexpectedly collapses, prompting a speedily reacting security guard to rush over, clearly concerned for her well-being. As he attempts to comfort her by rubbing her leg, a well-dressed businessman makes his way into the exclusive executive fitness center. Sandy, seizing the opportunity that presents itself, discreetly surveys his surroundings and slips inside just before the heavy door closes shut. Observing the businessman with a calculated eye, Sandy watches as he carefully places his crisp, neatly pressed suit into a locker, with the security guard's hand moving to rub Diana's butt in a moment of distraction. Once the businessman has securely shut the locker using a code, he leaves, and Sandy quickly and efficiently acts, inputting the code and swinging the locker open with a sense of urgency. He glances backward, a triumphant smile playing on his lips, satisfied with his success.\n\nNow dressed in a smart, dapper suit complete with a striking red tie, Sandy confidently strolls through the bustling offices alongside Diana. Together, they spot a balding man seated behind a large, imposing desk, his demeanor focused and intent on his work. Diana and Sandy share a knowing look, a silent communication passing seamlessly between them. She turns to face the man, discreetly shielding her mouth with her hand as he raises his phone, prompting Diana to take a cautious step back. Sandy locks his gaze into Ken's eyes, his brow raised with an air of subtle defiance. On a nearby security monitor, Sandy enters a code, and from our perspective, we watch as the view descends smoothly inside the records room. A glass door and metal gate subsequently slide open with precision and coordination. Swiftly, Sandy and Diana enter the room, with Diana retrieving essential equipment from her bag and deftly connecting her credit card burner into the network. Meanwhile, Sandy diligently searches the shelves, ultimately locating Cornish's records, which are stored safely and securely within a sturdy box."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Sandy reaches into the depths of his pockets, feeling around with the tips of his fingers, only to find them empty. Realizing this, he lifts his eyes to meet Diana's gaze, seeking some silent communication. Turning on his heel, he retraces his steps back to the bench, each footfall heavy with resignation. A deep sigh escapes him as he arrives at the bench, and with a slow shake of his head, he conveys his frustration and disappointment. Diana, sitting beside him, shifts her gaze, her demeanor clouded with a somberness that reflects the gravity of their situation. Sandy's eyes cast downward, fixating on his pants as he contemplates his next move. Carefully, he lowers himself to sit beside Diana, the creak of the bench exaggerating the silence between them. With a decisive motion, he kicks off his shoes, tilting his head to look down as he reaches into his shoes and retrieves a hidden wad of cash. Transitioning to the salvage yard, they maneuver their way out of the lot, revving up the engine of an old, run-down Chevy Caprice, its exterior reflecting its battered history. At the bus station, the skiptracer, moving with a noticeable limp, strides in just as he raises a juice pouch to his lips, sipping the last few drops before discarding it onto the ground in a casual, careless manner. He approaches the ticket booth, where the attendant, startled by the sight of the skiptracer's bloody face, instinctively recoils in fear. As the skiptracer's gaze sweeps across the empty station, he locks eyes with the attendant who, with a hand outstretched and a wrist twisting, writes down a slip of paper and, with shaky hands, passes it to the skiptracer just as the barrel of a gun is raised to the window in a threatening display. As he cautiously backs away, a bullet suddenly pierces his neck, sending shards of glass flying in every direction. Paolo's thugs advance, silent pistols in hand, as the skiptracer desperately clutches his neck wound, blood seeping through his fingers, while Julian deftly snatches the slip of paper containing the vital address. Maricol, standing nearby, brings a finger to her lips in a gesture urging silence, just as the booth window collapses into disarray beside her. Meanwhile, Sandy and Diana are now cruising down the highway, the scenery rushing past as they approach the bridge. Within the confines of the car, Sandy's gaze hardens, focused intently on the road ahead, while Diana positions herself sideways in her seat, watching him closely. In a sudden burst of motion, Sandy jerks the steering wheel, causing the car to swerve violently, and Diana's head collides against the window with a dull thud. He repeats the maneuver, the car lurching unpredictably once more. Time skips forward to find them gliding over the expansive Mississippi River, the iconic Gateway Arch looming majestically before them as they enter St. Louis. Stopping at a gas station, Sandy steps out to fill the tank, each click of the pump echoing in the still air, as Diana emerges wearily from the car. Sandy's attention drifts upward thoughtfully, his mind undoubtedly racing with plans. Inside the lobby, Diana collapses abruptly, drawing immediate attention from the security guard who rushes to her side, offering assistance by rubbing her leg in an attempt to provide comfort. Concurrently, a businessman strides into the executive fitness center, his presence going unnoticed by Sandy until the very last second. He seizes the opportunity and deftly maneuvers through the closing door. Sandy observes the businessman carefully, watching as he deposits his suit into a locker and secures it with a code before departing. Wasting no time, Sandy approaches the locker with quick, purposeful steps, enters the code, and swings the locker door open with a sense of triumph. With a swift look over his shoulder, his face breaking into a smile, Sandy emerges transformed, now clad in a dapper suit complete with a red tie, as he confidently strolls through the offices alongside Diana. Together, they spot a balding man seated behind a desk, exchanging knowing glances before Diana steps forward. Positioning herself, she shields her mouth with her hand as Sandy raises his phone, and she slowly backs away, maintaining a composed exterior. Sandy's eyes lock onto Ken's, his brow arching in a silent challenge. Meanwhile, on a security monitor, we see a replay of Sandy entering the code, and the view shifts to lower inside the records room, revealing a glass door and metal gate that slide open with a mechanical hum. Without hesitation, Sandy and Diana briskly enter the room, their pace deliberate and focused. Diana, pulling equipment from her bag, efficiently hard-lines her credit card burner into the network while Sandy scours the rows of shelves, methodically scanning for Cornish's records until he locates them tucked away inside a box."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Sandy checks his pockets, finds them empty, and exchanges a glance with Diana before retrieving cash from his shoe while seated beside her on a bench. At the salvage yard, they drive away in an old Chevy Caprice. Meanwhile, at the bus station, a skiptracer with a bloody face demands information at gunpoint from a recoiling attendant, only to be shot in the neck by Paolo's thugs. Julian takes the address while Maricol signals for silence as the booth window collapses.\n\nSandy and Diana drive down the highway, where Sandy's intense focus contrasts with Diana's position facing him. After aggressive swerving causes her to hit the window, they eventually cross the Mississippi River into St. Louis, with the Gateway Arch in view. At a gas station, as Sandy refuels, Diana enters the lobby and collapses, prompting a security guard's attention. Sandy surreptitiously slips into an executive fitness center, observes a businessman securing his locker, then quickly opens it using the code and changes into a dapper suit.\n\nNow well-dressed, Sandy and Diana navigate an office space, identifying a balding man behind a desk. Exchanging glances, Diana discreetly communicates with Sandy before withdrawing as he engages Ken with a raised eyebrow. On a security monitor, Sandy inputs a code to access the records room, where he and Diana enter. Diana connects her credit card burner to the network, and Sandy locates Cornish's records on the shelves."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Sandy reaches into his pockets and comes up empty, then looks at Diana, who is still holding the small map they picked up earlier. He walks back to the bench, located in the park where they first met, sighs, and shakes his head. Diana looks away somberly as Sandy gazes down at his pants, which are worn from years of use. He sits beside her, kicks off the shoes with holes in the soles, looks down, and pulls out a wad of cash he had cleverly hidden. At the salvage yard, a place known for its rows of rusting cars, they pull out of the lot in an old, run-down Chevy Caprice, a classic car model from the 1980s. At the bus station, a typically bustling hub now eerily quiet, the skiptracer limps in and takes a sip from the juice pouch, tossing it on the ground, a sign of his disregard for public spaces, as he walks over to the ticket booth. The attendant recoils from the skiptracer's bloody face, a result of the recent scuffle. He looks around the empty station, then sees the attendant with the hand out, twisting his wrist, and writes down and hands the skiptracer a slip of paper as the skiptracer holds his gun up to the window. As he backs away, a bullet rips through his neck and shatters the glass, causing chaos in the silent terminal. Paolo's thugs, known for their ruthless efficiency, approach with silenced pistols. The skiptracer holds his neck wound as Julian, who has been tracking them for weeks, takes the address. Maricol, known for her whispered commands, looks at the attendant and holds her finger up to her lips, and the booth window falls apart. Now, Sandy and Diana cruise down the highway toward a bridge, navigating the maze of roads leading out of town. In the car, Sandy's hardened gaze, a result of past betrayals, fixes ahead as Diana sits on her side facing him. He swerves the car, smashing her head on the window, and swerves again, a maneuver they practiced repeatedly. Later, they cruise over the Mississippi River into St. Louis, where the Gateway Arch, an iconic symbol of westward expansion, stands tall over the city. At a gas station, Sandy fills up as Diana emerges from the car, stretching her legs after the long drive, and Sandy looks up thoughtfully, contemplating their next move. Diana falls in the lobby, and the security guard hurries over, concerned for another incident in this upscale establishment. As he rubs Diana's leg, a businessman enters the executive fitness center, wearing the latest in tailored business attire, and Sandy glances around, then slips inside the closing door. Sandy watches the man place his suit in a locker with a digital lock, as the guard rubs Diana's butt. The businessman closes his locker with the code and leaves, unaware of the impending intrusion. Sandy quickly approaches, puts in a code, and opens the locker, a technique he mastered over years of petty crime. He glances back with a smile. Now, in a dapper suit and red tie, a sharp contrast to his earlier disheveled look, he strolls through the offices with Diana. They spot a balding man behind a desk, a key player in the criminal network. Diana and Sandy exchange a look; she faces the man, shielding her mouth with her hand, as he lifts his phone and Diana backs away. He stares into Ken's eyes with his brow raised, challenging him silently. On a security monitor, Sandy enters the code, and our view lowers inside the records room as a glass door and metal gate slide open, revealing the tightly guarded archive. Sandy and Diana briskly enter, and pulling equipment from her bag, Diana hard-lines her credit card burner into the network with practised efficiency, as Sandy searches the shelves, finding Cornish's records in a box filled with incriminating evidence."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Sandy reaches into his pockets and comes up empty then looks at Diana. He walks back to the bench sighs and shakes his head. Diana looks away somberly as Sandy gazes down at his pants. He sits beside her kicks off the shoes looks down and pulls out a wad of cash. At the salvage yard they pull out of the lot in an old rundown Chevy Caprice. At the bus station the skiptracer limps in and takes a sip from the juice pouch tossing it on the ground as he walks over to the ticket booth. The attendant recoils from the skiptracer's bloody face. He looks around the empty station then sees the attendant with the hand out twisting his wrist and writes down and hands the skiptracer a slip of paper as the skiptracer holds his gun up to the window. As he backs away a bullet rips through his neck and shatters the glass. Paolo's thugs approach with silenced pistols. The skiptracer holds his neck wound as Julian takes the address. Maricol looks at the attendant and holds her finger up to her lips and the booth window falls apart. Now Sandy and Diana cruise down the highway toward a bridge. In the car Sandy's hardened gaze fixes ahead as Diana sits on her side facing him. He swerves the car smashing her head on the window and swerves again. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Later they cruise over the Mississippi River into St Louis where the Gateway Arch stands tall over the city. At a gas station Sandy fills up as Diana emerges from the car and Sandy looks up thoughtfully. Diana falls in the lobby and the security guard hurries over. As he rubs Diana's leg a businessman enters the executive fitness center and Sandy glances around then slips inside the closing door. Sandy watches the man place his suit in a locker as the guard rubs Diana's butt. The businessman closes his locker with the code and leaves. Sandy quickly approaches puts in a code and opens the locker. He glances back with a smile. Now in a dapper suit and red tie he strolls through the offices with Diana. They spot a balding man behind a desk. Diana and Sandy exchange a look. she faces the man shielding her mouth with her hand as he lifts his phone and Diana backs away. He stares into Ken's eyes with his brow raised. On a security monitor Sandy enters the code and our view lowers inside the records room as a glass door and metal gate slide open. Sandy and Diana briskly enter and pulling equipment from her bag. Diana hardlines her credit card burner into the network as Sandy searches the shelves finding Cornish's records in a box."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Sandy reaches into his pockets and comes up empty then looks at Diana. He walks back to the bench sighs and shakes his head. Diana looks away somberly as Sandy gazes down at his pants. He sits beside her kicks off the shoes looks down and pulls out a wad of cash. At the salvage yard they pull out of the lot in an old rundown Chevy Caprice. At the bus station the skiptracer limps in and takes a sip from the juice pouch tossing it on the ground as he walks over to the ticket booth. The attendant recoils from the skiptracer's bloody face. He looks around the empty station then sees the attendant with the hand out twisting his wrist and writes down and hands the skiptracer a slip of paper as the skiptracer holds his gun up to the window. As he backs away a bullet rips through his neck and shatters the glass. Paolo's thugs approach with silenced pistols. The skiptracer holds his neck wound as Julian takes the address. Maricol looks at the attendant and holds her finger up to her lips and the booth window falls apart. Now Sandy and Diana cruise down the highway toward a bridge. In the car Sandy's hardened gaze fixes ahead as Diana sits on her side facing him. He swerves the car smashing her head on the window and swerves again. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Later they cruise over the Mississippi River into St Louis where the Gateway Arch stands tall over the city. At a gas station Sandy fills up as Diana emerges from the car and Sandy looks up thoughtfully. Diana falls in the lobby and the security guard hurries over. As he rubs Diana's leg a businessman enters the executive fitness center and Sandy glances around then slips inside the closing door. Sandy watches the man place his suit in a locker as the guard rubs Diana's butt. The businessman closes his locker with the code and leaves. Sandy quickly approaches puts in a code and opens the locker. He glances back with a smile. Now in a dapper suit and red tie he strolls through the offices with Diana. They spot a balding man behind a desk. Diana and Sandy exchange a look. she faces the man shielding her mouth with her hand as he lifts his phone and Diana backs away. He stares into Ken's eyes with his brow raised. On a security monitor Sandy enters the code and our view lowers inside the records room as a glass door and metal gate slide open. Sandy and Diana briskly enter and pulling equipment from her bag. Diana hardlines her credit card burner into the network as Sandy searches the shelves finding Cornish's records in a box."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Sandy reaches into his pockets and comes up empty then looks at Diana. He walks back to the bench sighs and shakes his head. Diana looks away somberly as Sandy gazes down at his pants. He sits beside her kicks off the shoes looks down and pulls out a wad of cash. At the salvage yard they pull out of the lot in an old rundown Chevy Caprice. At the bus station the skiptracer limps in and takes a sip from the juice pouch tossing it on the ground as he walks over to the ticket booth. The attendant recoils from the skiptracer's bloody face. He looks around the empty station then sees the attendant with the hand out twisting his wrist and writes down and hands the skiptracer a slip of paper as the skiptracer holds his gun up to the window. Now in a dapper suit and red tie he strolls through the offices with Diana. They spot a balding man behind a desk. Diana and Sandy exchange a look. she faces the man shielding her mouth with her hand as he lifts his phone and Diana backs away. He stares into Ken's eyes with his brow raised. On a security monitor Sandy enters the code and our view lowers inside the records room as a glass door and metal gate slide open. Sandy and Diana briskly enter and pulling equipment from her bag. Diana hardlines her credit card burner into the network as Sandy searches the shelves finding Cornish's records in a box."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Sandy reaches into his pockets and comes up empty then looks at Diana. He walks back to the bench sighs and shakes his head. Diana looks away somberly as Sandy gazes down at his pants. He stares into Ken's eyes with his brow raised. On a security monitor Sandy enters the code and our view lowers inside the records room as a glass door and metal gate slide open. Sandy and Diana briskly enter and pulling equipment from her bag. Diana hardlines her credit card burner into the network as Sandy searches the shelves finding Cornish's records in a box."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Milo digs into his backpack and finds nothing, then glances at Lucy. He stumbles back to the tree, breathes heavily, and nods his head. Lucy turns away joyfully as Milo peeks at his shirt. He plops beside her, flings off the sandals, glances down, and extracts a pile of coins. At the junkyard, they zoom out of the field in an ancient, pristine Pontiac Firebird. At the train terminal, the detective skips in and takes a bite from the apple, tossing it in the air as he dances over to the candy machine. The cashier leaps from the detective's painted mask. He scans the crowded terminal, then observes the cashier with the hand raised, spinning his hat, and scribbles down and hands the detective a card as the detective aims his flashlight at the door. As he trips away, a spark zips past his leg and splinters the wood. Leo's bouncers advance with loud megaphones. The detective covers his leg bruise as Carlos grabs the note. Lisa glances at the cashier and places her hat over her eyes, and the doorframe collapses. Now, Milo and Lucy glide down the tunnel toward a fence. In the vehicle, Milo's gentle stare locks forward as Lucy stands on her head opposite him. He veers the vehicle, tapping her nose on the windshield and veers again. Later, they sail over the Rhine River into Chicago, where the Willis Tower looms grand over the metropolis. At a market, Milo stocks up as Lucy emerges from the vehicle, and Milo peers down wistfully. Lucy trips in the corridor, and the janitor rushes over. As he pats Lucy's shoulder, an artist enters the communal library, and Milo peers around, then slips behind the rotating entrance. Milo observes the woman place her jacket in a cabinet as the janitor pats Lucy's arm. The artist shuts her cabinet with the pin and exits. Milo casually advances, keys in a pin, and pries open the cabinet. He peers forward with a grin. Now, in a sleek jacket and blue cap, he strides through the corridors with Lucy. They spot a young woman behind a counter. Lucy and Milo share a glance; she confronts the woman, covering her chin with her notes, as he lowers his camera and Lucy steps closer. He peers into Tom’s smile with his nose flared. On a hidden camera, Milo taps the pin, and our view rises inside the data chamber as a wooden door and plastic fence flip aside. Milo and Lucy swiftly dash, and retrieving gears from her pouch, Lucy plugs her radio into the system as Milo scans the drawers, locating Barton's files in a crate."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Sandy finds his pockets empty and looks at Diana before retrieving cash from his shoes. They leave a salvage yard in a rundown Chevy Caprice. At a bus station, a skiptracer intimidates an attendant for information but is shot by Paolo's thugs, who retrieve an address. Sandy and Diana head toward a bridge, where Sandy aggressively swerves the car. They cross the Mississippi River into St. Louis, passing the iconic Gateway Arch. At a gas station, Diana falls, attracting a security guard's attention. Sandy enters an executive fitness center, steals a businessman's suit, and infiltrates an office with Diana. They locate a balding man named Ken, and Sandy uses a security code to access a records room. Inside, Diana connects her credit card burner to the network while Sandy searches for Cornish's records."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Diana hardlines her credit card burner into the network as Sandy searches the shelves finding Cornish's records in a box Sandy and Diana briskly enter and pulling equipment from her bag On a security monitor Sandy enters the code and our view lowers inside the records room as a glass door and metal gate slide open He stares into Ken's eyes with his brow raised she faces the man shielding her mouth with her hand as he lifts his phone and Diana backs away Diana and Sandy exchange a look They spot a balding man behind a desk Now in a dapper suit and red tie he strolls through the offices with Diana He glances back with a smile Sandy quickly approaches puts in a code and opens the locker The businessman closes his locker with the code and leaves Sandy watches the man place his suit in a locker as the guard rubs Diana's butt As he rubs Diana's leg a businessman enters the executive fitness center and Sandy glances around then slips inside the closing door Diana falls in the lobby and the security guard hurries over At a gas station Sandy fills up as Diana emerges from the car and Sandy looks up thoughtfully Later they cruise over the Mississippi River into St Louis where the Gateway Arch stands tall over the city He swerves the car smashing her head on the window and swerves again In the car Sandy's hardened gaze fixes ahead as Diana sits on her side facing him Now Sandy and Diana cruise down the highway toward a bridge Maricol looks at the attendant and holds her finger up to her lips and the booth window falls apart The skiptracer holds his neck wound as Julian takes the address Paolo's thugs approach with silenced pistols As he backs away a bullet rips through his neck and shatters the glass He looks around the empty station then sees the attendant with the hand out twisting his wrist and writes down and hands the skiptracer a slip of paper as the skiptracer holds his gun up to the window The attendant recoils from the skiptracer's bloody face At the bus station the skiptracer limps in and takes a sip from the juice pouch tossing it on the ground as he walks over to the ticket booth At the salvage yard they pull out of the lot in an old rundown Chevy Caprice He sits beside her kicks off the shoes looks down and pulls out a wad of cash Diana looks away somberly as Sandy gazes down at his pants He walks back to the bench sighs and shakes his head Sandy reaches into his pockets and comes up empty then looks at Diana"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He walks back to the bench sighs and shakes his head Sandy reaches into his pockets and comes up empty then looks at Diana He sits beside her kicks off the shoes looks down and pulls out a wad of cash Diana looks away somberly as Sandy gazes down at his pants At the bus station the skiptracer limps in and takes a sip from the juice pouch tossing it on the ground as he walks over to the ticket booth At the salvage yard they pull out of the lot in an old rundown Chevy Caprice He looks around the empty station then sees the attendant with the hand out twisting his wrist and writes down and hands the skiptracer a slip of paper as the skiptracer holds his gun up to the window The attendant recoils from the skiptracer's bloody face Paolo's thugs approach with silenced pistols As he backs away a bullet rips through his neck and shatters the glass Maricol looks at the attendant and holds her finger up to her lips and the booth window falls apart The skiptracer holds his neck wound as Julian takes the address In the car Sandy's hardened gaze fixes ahead as Diana sits on her side facing him Now Sandy and Diana cruise down the highway toward a bridge Later they cruise over the Mississippi River into St Louis where the Gateway Arch stands tall over the city He swerves the car smashing her head on the window and swerves again Diana falls in the lobby and the security guard hurries over At a gas station Sandy fills up as Diana emerges from the car and Sandy looks up thoughtfully Sandy watches the man place his suit in a locker as the guard rubs Diana's butt As he rubs Diana's leg a businessman enters the executive fitness center and Sandy glances around then slips inside the closing door Sandy quickly approaches puts in a code and opens the locker The businessman closes his locker with the code and leaves Now in a dapper suit and red tie he strolls through the offices with Diana He glances back with a smile Diana and Sandy exchange a look They spot a balding man behind a desk He stares into Ken's eyes with his brow raised she faces the man shielding her mouth with her hand as he lifts his phone and Diana backs away Sandy and Diana briskly enter and pulling equipment from her bag On a security monitor Sandy enters the code and our view lowers inside the records room as a glass door and metal gate slide open Diana hardlines her credit card burner into the network as Sandy searches the shelves finding Cornish's records in a box"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "At a gas station Sandy fills up as Diana emerges from the car and Sandy looks up thoughtfully Diana falls in the lobby and the security guard hurries over As he rubs Diana's leg a businessman enters the executive fitness center and Sandy glances around then slips inside the closing door Sandy watches the man place his suit in a locker as the guard rubs Diana's butt The businessman closes his locker with the code and leaves Sandy quickly approaches puts in a code and opens the locker He glances back with a smile Now in a dapper suit and red tie he strolls through the offices with Diana They spot a balding man behind a desk Diana and Sandy exchange a look she faces the man shielding her mouth with her hand as he lifts his phone and Diana backs away He stares into Ken's eyes with his brow raised On a security monitor Sandy enters the code and our view lowers inside the records room as a glass door and metal gate slide open Sandy and Diana briskly enter and pulling equipment from her bag Diana hardlines her credit card burner into the network as Sandy searches the shelves finding Cornish's records in a box Sandy reaches into his pockets and comes up empty then looks at Diana He walks back to the bench sighs and shakes his head Diana looks away somberly as Sandy gazes down at his pants He sits beside her kicks off the shoes looks down and pulls out a wad of cash At the salvage yard they pull out of the lot in an old rundown Chevy Caprice At the bus station the skiptracer limps in and takes a sip from the juice pouch tossing it on the ground as he walks over to the ticket booth The attendant recoils from the skiptracer's bloody face He looks around the empty station then sees the attendant with the hand out twisting his wrist and writes down and hands the skiptracer a slip of paper as the skiptracer holds his gun up to the window As he backs away a bullet rips through his neck and shatters the glass Paolo's thugs approach with silenced pistols The skiptracer holds his neck wound as Julian takes the address Maricol looks at the attendant and holds her finger up to her lips and the booth window falls apart Now Sandy and Diana cruise down the highway toward a bridge In the car Sandy's hardened gaze fixes ahead as Diana sits on her side facing him He swerves the car smashing her head on the window and swerves again Later they cruise over the Mississippi River into St Louis where the Gateway Arch stands tall over the city"
        }
      ]
    }
  ]
}