{
  "ground_truth": "The possessed clamber and crawl over the van, scratching the windscreen with their fingernails. Charlie picks up a machine pistol, but Michael stops her, takes the machine pistol, and picks up an assault rifle. Bob and Jeep pull the planks away from the door and open it as Michael walks out, guns blazing, causing the possessed to drop dead. A couple run at Michael, and he batters them away, then pulls out two pistols and shoots more. He gives another one a kick, shoots him, and lays into a couple more by the van. Michael takes a nozzle from a fuel pump, sprays gas over the back of the van, and lights it, causing the possessed to flee as the van is engulfed in flames. Inside, Audrey cowers fearfully and moves over to the passenger seat as Michael smashes the driver's window, grabs her hand, yanks her out, and they run off before the van blows up, throwing them into the diner. Charlie fills a jug with water and turns to see the boy, causing her to drop the jug as he slashes the front of her shirt with a big kitchen knife. Charlie recoils and holds up a metal tray as the boy stabs at her, and the knife sticks in the tray. His hands slide down the blade, and the knife drops to the floor as the boy stares at his bloody hands. Charlie lowers the tray and kicks him over as Michael clambers in front of her and aims his gun, but the boy has disappeared. The lights go out, plunging the place into darkness, and Michael runs over to where the boy was. Bob and Jeep come over, shining a torch on the ground, revealing a trail of blood. Jeep aims his torch beam up, following a trail of bloody handprints across the ceiling until the trail stops dead. The boy appears behind Bob and tries to throttle him, but Michael grabs the boy and hurls him away, and Jeep shoots him. Charlie bends forward, grimacing, as Michael stares at him and holds Charlie's hands, with Audrey at them both. Bob steps out onto the roof to join Jeep as Michael keeps holding Charlie, her mouth gaping. The building shakes, and up on the roof, Bob and Jeep stare out into the darkness as bright light flashes all around, illuminating hundreds of possessed standing motionless, staring at the diner. Charlie's mouth gapes as Audrey gently lifts the baby, smiling incredulously, wrapping the bloody child in a towel, and offering it to Charlie. A tear rolls down Charlie's cheek as she faces away from the child. Audrey carries the baby over to Sandra, who stares at it, frowning, but then smiles and nods. Behind her back, Sandra twists her hands within the ropes bound around them as Audrey and Michael exchange a look, and he shakes his head. Sitting behind Charlie, Michael leans to her with a sincere expression.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The controlled scramble and creep over the vehicle, scraping the windshield with their nails. Charlie lifts a submachine gun, but Michael halts her, takes the submachine gun, and lifts an automatic rifle. Bob and Jeep tug the boards away from the entrance and open it as Michael strides out, weapons blazing, causing the controlled to drop lifeless. A pair charge at Michael, and he strikes them aside, then draws out two handguns and fires more. He delivers another one a kick, shoots him, and attacks a pair more by the vehicle. Michael grabs a nozzle from a fuel dispenser, sprays gasoline over the rear of the vehicle, and ignites it, causing the controlled to scatter as the vehicle is consumed in flames. Inside, Audrey crouches fearfully and slides over to the passenger seat as Michael shatters the driver's window, seizes her hand, pulls her out, and they dash off before the vehicle explodes, launching them into the eatery. Charlie fills a pitcher with liquid and turns to see the youngster, causing her to drop the pitcher as he slashes the front of her shirt with a large kitchen blade. Charlie recoils and raises a metal tray as the youngster lunges at her, and the blade embeds in the tray. His hands slide down the blade, and the knife falls to the floor as the youngster gazes at his bloody hands. Charlie lowers the tray and kicks him over as Michael scrambles in front of her and aims his firearm, but the youngster has vanished. The lights go out, immersing the place in blackness, and Michael runs over to where the youngster was. Bob and Jeep come over, illuminating a torch on the ground, revealing a trail of blood. Jeep directs his torch beam upward, tracking a trail of bloody handprints across the ceiling until the trail halts. The youngster appears behind Bob and attempts to strangle him, but Michael seizes the youngster and hurls him away, and Jeep fires at him. Charlie bends forward, grimacing, as Michael gazes at him and holds Charlie's hands, with Audrey at both. Bob steps out onto the roof to join Jeep as Michael continues holding Charlie, her mouth agape. The structure trembles, and up on the roof, Bob and Jeep gaze out into the darkness as bright light flashes all around, illuminating hundreds of controlled standing motionless, gazing at the eatery. Charlie's mouth gapes as Audrey gently lifts the infant, smiling incredulously, wrapping the bloody child in a cloth, and offering it to Charlie. A tear rolls down Charlie's cheek as she turns away from the child. Audrey carries the infant over to Sandra, who gazes at it, frowning, but then smiles and nods. Behind her back, Sandra twists her hands within the ropes bound around them as Audrey and Michael exchange a glance, and he shakes his head. Sitting behind Charlie, Michael leans to her with a genuine expression."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The van is clambered and crawled over by the possessed, with the windscreen being scratched by their fingernails. A machine pistol is picked up by Charlie, but she is stopped by Michael, who takes the machine pistol and picks up an assault rifle. The planks are pulled away from the door by Bob and Jeep as they open it, and Michael walks out, guns blazing, which causes the possessed to drop dead. Michael is run at by a couple, and they are battered away by him, then two pistols are pulled out and more are shot. Another one is given a kick by him, shot, and a couple more by the van are laid into. A nozzle from a fuel pump is taken by Michael, gas is sprayed over the back of the van, and it is lit, which causes the possessed to flee as flames engulf the van. Inside, Audrey cowers fearfully and moves over to the passenger seat as the driver's window is smashed by Michael, who grabs her hand, yanks her out, and they are run off by him before the van blows up, throwing them into the diner. A jug is filled with water by Charlie, and she turns to see the boy, causing the jug to be dropped by her as the front of her shirt is slashed by him with a big kitchen knife. The boy is recoiled from by Charlie, and a metal tray is held up by her as he stabs at her, and the tray is stuck with the knife. The blade is slid down by his hands, and the knife drops to the floor as his bloody hands are stared at by the boy. The tray is lowered by Charlie, and he is kicked over by her as Michael clambers in front of her and aims his gun, but the boy has disappeared. Darkness is plunged into by the lights going out, and where the boy was is run over to by Michael. The ground is shone on by Bob and Jeep with a torch, revealing a trail of blood. Jeep aims his torch beam up, following a trail of bloody handprints across the ceiling until the trail stops dead. Bob is appeared behind by the boy, and he tries to throttle him, but the boy is grabbed by Michael and hurled away, and Jeep shoots him. Charlie bends forward, grimacing, as her hands are held by Michael while he stares at him, with Audrey at them both. Onto the roof steps Bob to join Jeep as Charlie is kept held by Michael, her mouth gaping. The building is shaken, and up on the roof, out into the darkness is stared by Bob and Jeep as bright light flashes all around, illuminating hundreds of possessed, who stand motionless, staring at the diner. The baby is gently lifted by Audrey as Charlie's mouth gapes, smiling incredulously, wrapping the bloody child in a towel, and offering it to Charlie. A tear rolls down Charlie's cheek as the child is faced away from by her. Over to Sandra is carried the baby by Audrey, who stares at it, frowning, but then smiles and nods. Sandra twists her hands within the ropes bound around them behind her back as a look is exchanged by Audrey and Michael, and he shakes his head. Leaning to her with a sincere expression is Michael, who sits behind Charlie."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The possessed crawl over the van, scratching the windscreen. Charlie grabs a machine pistol, but Michael stops her, takes it, and opts for an assault rifle. Bob and Jeep remove the door planks as Michael emerges, shooting, killing the possessed. A couple charge at Michael; he fights them off, then draws pistols, shooting more. He kicks one, shoots him, and fights others by the van. Michael uses a fuel pump nozzle to douse the van in gas and ignites it, forcing the possessed to flee as it burns. Inside, Audrey moves to the passenger seat as Michael breaks the driver's window, pulls her out, and they escape before the van explodes, throwing them into the diner. Charlie fills a jug with water, drops it when a boy slashes her shirt with a knife. She defends herself with a metal tray, and the knife sticks in it. The boy stares at his bloody hands as Charlie kicks him, and Michael aims his gun, but the boy vanishes. The lights go out, and Michael rushes to the boy's location. Bob and Jeep arrive, shining a torch on a blood trail. Jeep follows bloody handprints on the ceiling until the trail stops. The boy attacks Bob but is flung away by Michael, and Jeep shoots him. Charlie grimaces, and Michael holds her hands. Bob steps onto the roof with Jeep. The building shakes, and outside, hundreds of possessed stand motionless, illuminated by flashing lights. Charlie looks away as Audrey wraps a bloody baby in a towel and offers it to her, a tear rolling down Charlie's cheek. Audrey presents the baby to Sandra, who eventually smiles. Sandra secretly frees herself from her ropes as Audrey and Michael exchange glances. Michael leans toward Charlie with sincerity."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The possessed swarm the van, scratching the windscreen. Charlie grabs a machine pistol, but Michael swaps it for an assault rifle. Bob and Jeep open the door as Michael fires, killing the possessed. He fights off a couple, uses pistols to shoot more, and kicks one before attacking others by the van. Michael sprays fuel over the van and ignites it, forcing the possessed to flee as it burns. Inside, Audrey cowers as Michael shatters the driver's window, pulls her out, and they escape before it explodes. Charlie fills a jug with water, but drops it when a boy slashes her shirt with a knife. She defends with a tray, and the knife falls when the boy injures himself. Charlie kicks him over as Michael aims, but the boy vanishes. Lights go out; Michael runs to where the boy was, Bob and Jeep illuminate a blood trail leading to the ceiling. The boy appears behind Bob, but Michael grabs him, and Jeep shoots. Michael holds Charlie's hands as she grimaces, with Audrey beside them both. Bob and Jeep watch from the roof as light illuminates hundreds of possessed around the diner. Audrey lifts the baby, wraps it in a towel, and offers it to Charlie, who turns away tearfully. Audrey gives the baby to Sandra, who initially frowns, then smiles. Sandra's hands twist within rope, while Audrey and Michael exchange looks, and he shakes his head. Michael leans towards Charlie with a sincere expression."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The possessed creatures clamber and crawl ominously over the van, their fingers frantically scratching and clawing at the windscreen with their sharp fingernails. Charlie instinctively reaches for a machine pistol, prepared to defend herself, but Michael intervenes. He stops her decisively, takes the machine pistol from her grasp, and opts instead for an assault rifle, demonstrating a strategic choice. Meanwhile, Bob and Jeep work together, hastily pulling the wooden planks away from the door and swinging it open. As Michael makes his move, he strides out, guns blazing mercilessly, causing the possessed to fall lifelessly to the ground. A couple of the possessed charge at Michael with a menacing intent, but he skilfully batters them away. He then pulls out two pistols, shooting more of the possessed with unwavering precision. He delivers a swift kick to another one, shooting him before turning his attention to a couple more by the van. Displaying quick thinking, Michael grabs a nozzle from a nearby fuel pump, dousing the back of the van with gasoline. He sets it ablaze, prompting the possessed to flee in fear as the van becomes engulfed in roaring flames. Inside the van, Audrey cowers in terror, fearfully shifting over to the passenger seat. At that moment, Michael smashes the driver's window, grabs her hand firmly, and pulls her out with urgency, making their escape as they run off just before the van explodes, propelling them into the nearby diner. Inside the diner, Charlie is busy filling a jug with water when she turns and spots the boy. Startled, she drops the jug as the boy slashes at the front of her shirt with a sizable kitchen knife. In shock, Charlie recoils, hastily holding up a metal tray as a makeshift shield. The boy stabs at her, only for the knife to stick into the tray. His hands slide down the sharp blade, leaving him staring at his own bloody hands as the knife falls to the floor. Seizing the moment, Charlie lowers the tray and kicks him over. Michael clambers in front of her, aiming his gun at where the boy had been, but he has mysteriously vanished. Suddenly, the lights go out, plunging the entire place into an eerie darkness. Michael urgently runs over to the spot where the boy was just moments before. Bob and Jeep join him, shining a torch beam onto the ground, revealing a sinister trail of blood. Jeep expertly directs his torch beam upwards, following the disturbing trail of bloody handprints smeared across the ceiling until the trail suddenly comes to an abrupt stop. The boy stealthily reappears behind Bob, attempting to throttle him. However, Michael quickly intervenes, grabbing the boy and forcefully hurling him away, allowing Jeep to shoot him. Charlie bends forward, grimacing in pain, as Michael looks at her with a concerned expression. He holds Charlie's hands gently, with Audrey watching the scene unfold. Bob steps cautiously out onto the roof to join Jeep as Michael continues to hold Charlie, her mouth agape in shock. The building begins to shake ominously, and up on the roof, Bob and Jeep stare out into the haunting darkness as bright flashes of light illuminate the scene all around them, revealing hundreds of possessed standing silently, motionless, and staring intently at the diner. Charlie's mouth remains agape, while Audrey gently lifts the newborn, smiling incredulously at the miracle child. She wraps the bloody child in a towel, offering it to Charlie with tenderness. A single tear rolls down Charlie's cheek as she turns her gaze away from the child. Audrey then carries the baby over to Sandra, who initially stares at it with a frown but then smiles warmly and nods. Behind her back, Sandra discreetly twists her hands, struggling against the ropes binding them. Audrey and Michael exchange a knowing look, and Michael shakes his head subtly. Sitting behind Charlie, Michael leans toward her with a sincere and compassionate expression, offering silent support."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The possessed creatures clamber ominously, crawling with an unsettling presence over the van, their fingers frenetically scratching and clawing at the windscreen, their sharp fingernails ominously scraping against the glass. Charlie, feeling the urgency of the situation, instinctively reaches for a nearby machine pistol, fully prepared to defend herself. However, Michael steps in, stopping her decisively with a commanding presence. He takes the machine pistol from her grasp calmly and opts, in a strategic display of tactical thinking, for an assault rifle instead. Meanwhile, Bob and Jeep work together with hurried determination, pulling the wooden planks away from the door and swinging it open with urgency. As Michael springs into action, he strides out into the chaos, guns blazing with relentless precision, causing the possessed to fall lifelessly to the ground. A couple of the possessed charge at Michael with menacing intent, but he skilfully bats them away. He then pulls out two pistols, firing with unwavering precision, taking down more of the possessed. He delivers a swift, forceful kick to another one, shooting him before he turns his attention to a couple more by the van. Displaying quick thinking and resourcefulness, Michael grabs a nozzle from a nearby fuel pump, dousing the back of the van with gasoline. He ignites it, causing the van to become engulfed in roaring flames, prompting the possessed to flee in fear. Inside the van, Audrey cowers in terror, instinctively shifting over to the passenger seat. At that critical moment, Michael smashes the driver’s window, grabbing her hand firmly with urgency, and pulls her out, making their escape as they run off just in time before the van explodes, propelling them toward the nearby diner. Inside the diner, Charlie is occupied, filling a jug with water, when her gaze lands on the boy. Startled, she drops the jug as the boy menacingly slashes at the front of her shirt with a sizable kitchen knife. In shock, Charlie recoils, hastily holding up a metal tray as a makeshift shield. The boy thrusts the knife at her, but it sticks into the tray. His hands slide down the sharp blade, and he stares, wide-eyed, at his own bloody hands as the knife falls to the floor. Seizing the moment, Charlie lowers the tray and kicks him over. Michael clambers in front of her, directing his gun at where the boy had been, but the boy has mysteriously vanished. Suddenly, the lights go out, plunging the entire place into an eerie and unsettling darkness. Michael urgently runs over to the spot where the boy was just moments before. Bob and Jeep join him, shining a torch beam onto the ground, revealing a sinister and ominous trail of blood. Jeep expertly directs his torch beam upwards, following the disturbing trail of bloody handprints that have been smeared across the ceiling until the trail suddenly comes to an abrupt stop. The boy stealthily reappears behind Bob, attempting to throttle him. However, Michael quickly intervenes, seizing the boy and forcefully hurling him away, allowing Jeep to shoot him. Charlie bends forward, grimacing in pain, as Michael looks at her with a concerned expression. He holds Charlie's hands gently, with Audrey watching the scene unfold intently. Bob steps cautiously out onto the roof to join Jeep as Michael continues to hold Charlie, her mouth agape in shock. The building starts to shake ominously, and up on the roof, Bob and Jeep gaze out into the haunting darkness that surrounds them, as bright flashes of light illuminate the scene all around, revealing hundreds of possessed standing silently, motionless, their eerie gaze fixed intently on the diner. Charlie's mouth remains agape, while Audrey gently lifts the newborn, smiling incredulously at the miracle child. She wraps the bloody child in a towel with care, offering it to Charlie with tenderness. A single tear rolls down Charlie's cheek as she turns her gaze away from the child. Audrey then carries the baby over to Sandra, who initially stares at it with a frown but then smiles warmly and nods. Behind her back, Sandra discreetly twists her hands, struggling against the ropes that bind them. Audrey and Michael exchange a knowing look, and Michael shakes his head subtly. Sitting behind Charlie, Michael leans toward her with a sincere and compassionate expression, offering silent support."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The possessed creatures relentlessly climb and maneuver over the surface of the van, their fingernails dragging harshly across the windscreen, creating a grating sound. In a tense moment, Charlie reaches for a machine pistol, her fingers wrapping around its handle with determination, but Michael intervenes, his hand gently yet firmly stopping her. He takes the machine pistol from her grasp and, with a quick decision, selects an assault rifle instead, preparing for what's to come. Meanwhile, Bob and Jeep work together to remove the wooden planks barring the door, each plank falling away as they exert effort, clearing the path to open it. Michael strides purposefully through the doorway, both hands gripping his firearms, and begins firing with precision. His shots echo loudly, causing the possessed to collapse lifelessly to the ground. Two of the possessed rush toward him with alarming speed, but he skillfully repels them, using his physical might to send them flying back. With a fluid motion, he draws two pistols, aims, and fires at more of the approaching threats, each shot finding its mark. One creature receives a powerful kick followed by a well-placed shot, and Michael continues to engage others near the van with relentless precision. He then seizes a fuel pump nozzle, directing a stream of gasoline across the back of the van, and swiftly ignites it. The resulting flames blaze fiercely, forcing the possessed to scatter in fear as the van becomes engulfed in a fiery inferno. Within this chaos, Audrey crouches in terror, sliding over to the passenger seat for cover as Michael breaks the driver’s window with a forceful swing of his arm. He reaches in, firmly grabbing her hand, and pulls her out of the van. Together, they sprint away, the urgency evident in every step, just before the van erupts in an explosion, the force of which propels them into the diner. At the same moment, Charlie is in the kitchen, filling a jug with water, when she turns her head and unexpectedly sees the boy. In shock, the jug slips from her fingers, shattering as it hits the floor, while the boy advances, assaulting her with a large kitchen knife that slices through the front of her shirt. Instinctively, Charlie recoils, her hands reaching up in defense, clutching a metal tray as the boy lunges and the knife embeds itself in the tray’s metal. His hands, now slick with blood, slide along the blade’s edge, causing the knife to fall to the ground as he stares transfixed at his injured hands. Seizing this moment, Charlie lowers the tray and delivers a swift kick, knocking him down, just as Michael arrives, positioning himself protectively in front of her, his weapon raised and ready. They both scan the area, but the boy has vanished, dissolved into the shadows. Suddenly, the lights flicker out, plunging the entire place into thick darkness, and Michael rushes to the boy’s last known location. Bob and Jeep appear beside him, shining a flashlight over the ground, its beam revealing a telling trail of blood. Jeep’s hand follows the trail with the flashlight, tracing bloody handprints that lead upward across the ceiling until the path vanishes abruptly. In a startling twist, the boy emerges silently behind Bob, attempting to choke him from behind, but Michael is quick to react, seizing the boy and forcefully hurling him away. Jeep seizes the moment, firing his gun, the shot echoing through the tense air. Meanwhile, Charlie bends forward, her face contorting with pain, as Michael’s eyes lock onto hers, offering silent support while holding her hands firmly, with Audrey present, her concern evident in her gaze directed at them both. Bob steps onto the roof and joins Jeep as they both peer into the enveloping darkness, their eyes widening at the sight of a brilliant light flashing, revealing a vast assembly of the possessed standing perfectly still, their eerie stares fixated intently on the diner. Back inside, Charlie’s mouth hangs open in an expression of awe as Audrey gingerly cradles the newborn, a small smile of disbelief forming on her lips while she carefully wraps the blood-streaked baby in a towel and extends it toward Charlie. A solitary tear traces down Charlie’s cheek as she turns slightly away from the infant, overwhelmed. Audrey then shifts her attention, carrying the baby to Sandra, who gazes at it with initial confusion, her brow furrowing, but then her face softens into a smile, and she nods in understanding. Out of sight, Sandra’s fingers work surreptitiously, twisting within the ropes securing her hands, while Audrey and Michael exchange a silent look, the weight of the situation conveyed through their eye contact, and Michael gently shakes his head. Finally, Michael situates himself behind Charlie, leaning closer with a genuine expression, offering comfort in the midst of the turmoil surrounding them."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The possessed swarm over the van, clawing at the windscreen. Charlie reaches for a machine pistol, but Michael intervenes, taking it and arming himself with an assault rifle. As Bob and Jeep clear the door, Michael charges out, taking down the possessed with precise gunfire. When a couple of the possessed attack, Michael repels them, switches to pistols, and continues the assault. He then douses the van with gasoline, ignites it, and the flames drive the possessed away. Inside, Audrey hesitates but shifts to the passenger seat as Michael smashes the window, pulls her to safety, and they escape just as the van explodes, propelling them into the diner. \n\nCharlie, filling a jug with water, is startled by a boy, dropping the jug as he slashes her shirt with a knife. She defends herself with a metal tray, causing the boy to drop the knife. Charlie then overcomes him as Michael intervenes, but the boy vanishes. When the lights fail, Michael rushes to the scene with Bob and Jeep, who illuminate a bloody trail. Jeep follows the trail to the ceiling, where it ends abruptly. The boy reappears, attacking Bob, but Michael throws him off, allowing Jeep to shoot him. \n\nAmidst the chaos, Charlie grimaces, gripping Michael's hands with Audrey by their side. Bob and Jeep ascend to the roof, observing a silent army of possessed illuminated by flashing lights. Inside, Audrey tenderly wraps the newborn in a towel, offering it to Charlie, who turns away, tearful. Audrey brings the baby to Sandra, who initially frowns but then smiles, while secretly working to free her bound hands. Audrey and Michael exchange a meaningful look before Michael comforts Charlie with empathy."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The possessed, driven by an unknown and malevolent force that grants them unnatural strength, clamber and crawl over the van, scratching the windscreen with their fingernails, which are as tough as glass cutters. Charlie picks up a Heckler & Koch MP5, a compact and reliable machine pistol often used by special forces, but Michael stops her, takes the MP5, and picks up an M4 carbine, a standard-issue assault rifle for military personnel. Bob and Jeep, who have fortified the diner using the wooden planks from nearby abandoned buildings, pull the planks away from the door and open it as Michael walks out, guns blazing, his precise military training evident, causing the possessed to drop dead. A couple run at Michael, and he, with the agility of a seasoned combatant, batters them away, then pulls out two Glock 17 pistols and shoots more. He gives another one a kick, demonstrating a martial artist's skill, shoots him, and lays into a couple more by the van. Michael takes a nozzle from a fuel pump, part of an old gas station that had served travelers for decades, sprays gas over the back of the van, and lights it with a lighter found in the diner's bar, causing the possessed to flee as the van is engulfed in flames. Inside, Audrey, whose fear stems from witnessing her hometown's downfall, cowers fearfully and moves over to the passenger seat as Michael smashes the driver's window, grabs her hand, yanks her out, and they run off before the van blows up, throwing them into the diner, a once lively place now turned fortress. Charlie fills a jug with water from a rusty tap, mindful of the dwindling resources, and turns to see the boy, causing her to drop the jug as he, possessed by an evil force, slashes the front of her shirt with a big kitchen knife, a tool not meant for such violence. Charlie recoils and holds up a metal tray as the boy stabs at her, and the knife sticks in the tray. His hands slide down the blade, and the knife drops to the floor as the boy stares at his bloody hands, momentarily breaking free from the possession's control. Charlie lowers the tray and kicks him over as Michael clambers in front of her with the speed of someone who has seen years of conflict and aims his gun, but the boy has disappeared. The lights go out, plunging the place into darkness, a common occurrence since the town's generator is failing, and Michael runs over to where the boy was. Bob and Jeep come over, shining a torch on the ground, revealing a trail of blood that looks black in the wavering light. Jeep aims his torch beam up, following a trail of bloody handprints across the ceiling until the trail stops dead. The boy appears behind Bob and tries to throttle him, but Michael grabs the boy and hurls him away, and Jeep shoots him with the precision of someone who trained for survival in this new world. Charlie bends forward, grimacing, as Michael stares at him with compassion and holds Charlie's hands, a gesture of solidarity, with Audrey at them both. Bob steps out onto the roof to join Jeep as Michael keeps holding Charlie, her mouth gaping with shock and exhaustion. The building shakes, reminiscent of the tremors that have become more frequent, and up on the roof, Bob and Jeep stare out into the darkness as bright light flashes all around, illuminating hundreds of possessed standing motionless, staring at the diner, their eyes void of humanity. Charlie's mouth gapes as Audrey gently lifts the baby, smiling incredulously at the miracle of new life amidst chaos, wrapping the bloody child in a towel, and offering it to Charlie. A tear rolls down Charlie's cheek as she faces away from the child, torn between hope and fear. Audrey carries the baby over to Sandra, who stares at it, frowning, but then smiles and nods, a rare display of warmth. Behind her back, Sandra twists her hands within the ropes bound around them, a precaution due to her earlier attempt to escape, as Audrey and Michael exchange a look, and he shakes his head, indicating the need for caution. Sitting behind Charlie, Michael leans to her with a sincere expression, offering silent support."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The possessed clamber and crawl over the van scratching the windscreen with their fingernails. Charlie picks up a machine pistol but Michael stops her takes the machine pistol and picks up an assault rifle. Bob and Jeep pull the planks away from the door and open it as Michael walks out guns blazing causing the possessed to drop dead. A couple run at Michael and he batters them away then pulls out two pistols and shoots more. He gives another one a kick shoots him and lays into a couple more by the van. Michael takes a nozzle from a fuel pump sprays gas over the back of the van and lights it causing the possessed to flee as the van is engulfed in flames. Inside. Audrey cowers fearfully and moves over to the passenger seat as Michael smashes the driver's window grabs her hand yanks her out and they run off before the van blows up throwing them into the diner. Charlie fills a jug with water and turns to see the boy causing her to drop the jug as he slashes the front of her shirt with a big kitchen knife. Charlie recoils and holds up a metal tray as the boy stabs at her and the knife sticks in the tray. His hands slide down the blade and the knife drops to the floor as the boy stares at his bloody hands. Charlie lowers the tray and kicks him over as Michael clambers in front of her and aims his gun but the boy has disappeared. The lights go out plunging the place into darkness and Michael runs over to where the boy was. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Bob and Jeep come over shining a torch on the ground revealing a trail of blood. Jeep aims his torch beam up following a trail of bloody handprints across the ceiling until the trail stops dead. The boy appears behind Bob and tries to throttle him but Michael grabs the boy and hurls him away and Jeep shoots him. Charlie bends forward grimacing as Michael stares at him and holds Charlie's hands with Audrey at them both. Bob steps out onto the roof to join Jeep as Michael keeps holding Charlie her mouth gaping. The building shakes and up on the roof. Bob and Jeep stare out into the darkness as bright light flashes all around illuminating hundreds of possessed standing motionless staring at the diner. Charlie's mouth gapes as Audrey gently lifts the baby smiling incredulously wrapping the bloody child in a towel and offering it to Charlie. A tear rolls down Charlie's cheek as she faces away from the child. Audrey carries the baby over to Sandra who stares at it frowning but then smiles and nods. Behind her back. Sandra twists her hands within the ropes bound around them as Audrey and Michael exchange a look and he shakes his head. Sitting behind Charlie. Michael leans to her with a sincere expression."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The possessed clamber and crawl over the van scratching the windscreen with their fingernails. Charlie picks up a machine pistol but Michael stops her takes the machine pistol and picks up an assault rifle. Bob and Jeep pull the planks away from the door and open it as Michael walks out guns blazing causing the possessed to drop dead. A couple run at Michael and he batters them away then pulls out two pistols and shoots more. He gives another one a kick shoots him and lays into a couple more by the van. Michael takes a nozzle from a fuel pump sprays gas over the back of the van and lights it causing the possessed to flee as the van is engulfed in flames. Inside. Audrey cowers fearfully and moves over to the passenger seat as Michael smashes the driver's window grabs her hand yanks her out and they run off before the van blows up throwing them into the diner. Charlie fills a jug with water and turns to see the boy causing her to drop the jug as he slashes the front of her shirt with a big kitchen knife. Charlie recoils and holds up a metal tray as the boy stabs at her and the knife sticks in the tray. His hands slide down the blade and the knife drops to the floor as the boy stares at his bloody hands. Charlie lowers the tray and kicks him over as Michael clambers in front of her and aims his gun but the boy has disappeared. The lights go out plunging the place into darkness and Michael runs over to where the boy was. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Bob and Jeep come over shining a torch on the ground revealing a trail of blood. Jeep aims his torch beam up following a trail of bloody handprints across the ceiling until the trail stops dead. The boy appears behind Bob and tries to throttle him but Michael grabs the boy and hurls him away and Jeep shoots him. Charlie bends forward grimacing as Michael stares at him and holds Charlie's hands with Audrey at them both. Bob steps out onto the roof to join Jeep as Michael keeps holding Charlie her mouth gaping. The building shakes and up on the roof. Bob and Jeep stare out into the darkness as bright light flashes all around illuminating hundreds of possessed standing motionless staring at the diner. Charlie's mouth gapes as Audrey gently lifts the baby smiling incredulously wrapping the bloody child in a towel and offering it to Charlie. A tear rolls down Charlie's cheek as she faces away from the child. Audrey carries the baby over to Sandra who stares at it frowning but then smiles and nods. Behind her back. Sandra twists her hands within the ropes bound around them as Audrey and Michael exchange a look and he shakes his head. Sitting behind Charlie. Michael leans to her with a sincere expression."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The possessed clamber and crawl over the van scratching the windscreen with their fingernails. Charlie picks up a machine pistol but Michael stops her takes the machine pistol and picks up an assault rifle. Bob and Jeep pull the planks away from the door and open it as Michael walks out guns blazing causing the possessed to drop dead. A couple run at Michael and he batters them away then pulls out two pistols and shoots more. He gives another one a kick shoots him and lays into a couple more by the van. Michael takes a nozzle from a fuel pump sprays gas over the back of the van and lights it causing the possessed to flee as the van is engulfed in flames. Inside. Charlie's mouth gapes as Audrey gently lifts the baby smiling incredulously wrapping the bloody child in a towel and offering it to Charlie. A tear rolls down Charlie's cheek as she faces away from the child. Audrey carries the baby over to Sandra who stares at it frowning but then smiles and nods. Behind her back. Sandra twists her hands within the ropes bound around them as Audrey and Michael exchange a look and he shakes his head. Sitting behind Charlie. Michael leans to her with a sincere expression."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The possessed clamber and crawl over the van scratching the windscreen with their fingernails. Charlie picks up a machine pistol but Michael stops her takes the machine pistol and picks up an assault rifle. Bob and Jeep pull the planks away from the door and open it as Michael walks out guns blazing causing the possessed to drop dead. Sandra twists her hands within the ropes bound around them as Audrey and Michael exchange a look and he shakes his head. Sitting behind Charlie. Michael leans to her with a sincere expression."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The enchanted squirrels leap and scuttle over the limousine, scribbling on the sunroof with their claws. Diana grabs a balloon animal, but Kevin halts her, snatches the balloon animal, and grabs a megaphone. Alex and Scooter remove the curtains from the window and slide it open as Kevin strolls outside, fireworks exploding, making the enchanted squirrels collapse. A pair dash towards Kevin, and he hurls them aside, then pulls out two water balloons and tosses more. He gives another one a shove, splashes him with water, and swings at a couple more by the limousine. Kevin grabs a hose from a water fountain, sprays soda over the front of the limousine, and ignites it, making the enchanted squirrels scamper as the limousine becomes engulfed in bubbles. Within, Marissa cringes anxiously and inches over to the pedal car as Kevin cracks the chauffeur's mirror, takes hold of her shoe, lifts her out, and they dash away before the limousine bursts, propelling them into the bakery. Diana fills a bucket with lemonade and turns to spot the kitten, causing her to drop the bucket as it rips the brim of her cap with a large garden rake. Diana jumps back and raises a frisbee as the kitten swipes at her, and the rake embeds in the frisbee. Its paws glide down the handle, and the rake clatters to the ground as the kitten gazes at its muddy paws. Diana lowers the frisbee and trips it over as Kevin scrambles before her and directs his water gun, but the kitten has vanished. The lamps go out, sinking the area into shadows, and Kevin dashes over to where the kitten was. Alex and Scooter arrive, shining a lantern on the floor, uncovering a path of paw prints. Scooter directs his lantern beam upward, following a trail of muddy prints across the rafters until the trail halts abruptly. The kitten emerges behind Alex and attempts to tickle him, but Kevin seizes the kitten and flings it, and Scooter sprays it. Diana bends over, wincing, as Kevin gazes at it and holds Diana's fingers, with Marissa looking on. Alex steps out onto the balcony to join Scooter as Kevin keeps clutching Diana, her eyes wide. The mansion trembles, and up on the balcony, Alex and Scooter gaze into the twilight as blinding light flickers all around, revealing hundreds of enchanted squirrels standing still, gazing at the bakery. Diana's eyes widen as Marissa gently lifts the puppy, grinning astonished, swaddling the muddied creature in a scarf, and presenting it to Diana. A droplet rolls down Diana's face as she turns away from the puppy. Marissa carries the puppy over to Karen, who gawks at it, frowning, but then grins and nods. Behind her back, Karen twists her ankles within the vines wrapped around them as Marissa and Kevin share a glance, and he shakes his head. Seated behind Diana, Kevin leans towards her with a sincere appearance."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The possessed swarm the van, scratching at it, but Michael takes charge, using various weapons to fight them off. He sets the van on fire, forcing the possessed to flee, and rescues Audrey. Inside, Charlie encounters a boy who attacks her with a knife. Michael intervenes as the boy disappears, and the lights go out. Bob and Jeep discover a trail of blood leading across the ceiling. The boy reappears, attacking Bob, but Michael and Jeep neutralize him. Despite the chaos, Charlie is consoled by Michael as the building shakes. Outside, Bob and Jeep see a mass of possessed figures staring at the diner. Audrey offers a baby she rescued to Charlie, who is emotional and hesitant, while Sandra, tied up, subtly attempts to free herself. Audrey and Michael exchange a significant look, and Michael comforts Charlie with sincerity."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Michael leans to her with a sincere expression Sitting behind Charlie Sandra twists her hands within the ropes bound around them as Audrey and Michael exchange a look and he shakes his head Behind her back Audrey carries the baby over to Sandra who stares at it frowning but then smiles and nods A tear rolls down Charlie's cheek as she faces away from the child Charlie's mouth gapes as Audrey gently lifts the baby smiling incredulously wrapping the bloody child in a towel and offering it to Charlie Bob and Jeep stare out into the darkness as bright light flashes all around illuminating hundreds of possessed standing motionless staring at the diner The building shakes and up on the roof Bob steps out onto the roof to join Jeep as Michael keeps holding Charlie her mouth gaping Charlie bends forward grimacing as Michael stares at him and holds Charlie's hands with Audrey at them both The boy appears behind Bob and tries to throttle him but Michael grabs the boy and hurls him away and Jeep shoots him Jeep aims his torch beam up following a trail of bloody handprints across the ceiling until the trail stops dead Bob and Jeep come over shining a torch on the ground revealing a trail of blood The lights go out plunging the place into darkness and Michael runs over to where the boy was Charlie lowers the tray and kicks him over as Michael clambers in front of her and aims his gun but the boy has disappeared His hands slide down the blade and the knife drops to the floor as the boy stares at his bloody hands Charlie recoils and holds up a metal tray as the boy stabs at her and the knife sticks in the tray Charlie fills a jug with water and turns to see the boy causing her to drop the jug as he slashes the front of her shirt with a big kitchen knife Audrey cowers fearfully and moves over to the passenger seat as Michael smashes the driver's window grabs her hand yanks her out and they run off before the van blows up throwing them into the diner Inside Michael takes a nozzle from a fuel pump sprays gas over the back of the van and lights it causing the possessed to flee as the van is engulfed in flames He gives another one a kick shoots him and lays into a couple more by the van A couple run at Michael and he batters them away then pulls out two pistols and shoots more Bob and Jeep pull the planks away from the door and open it as Michael walks out guns blazing causing the possessed to drop dead Charlie picks up a machine pistol but Michael stops her takes the machine pistol and picks up an assault rifle The possessed clamber and crawl over the van scratching the windscreen with their fingernails"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Charlie picks up a machine pistol but Michael stops her takes the machine pistol and picks up an assault rifle The possessed clamber and crawl over the van scratching the windscreen with their fingernails A couple run at Michael and he batters them away then pulls out two pistols and shoots more Bob and Jeep pull the planks away from the door and open it as Michael walks out guns blazing causing the possessed to drop dead Michael takes a nozzle from a fuel pump sprays gas over the back of the van and lights it causing the possessed to flee as the van is engulfed in flames He gives another one a kick shoots him and lays into a couple more by the van Audrey cowers fearfully and moves over to the passenger seat as Michael smashes the driver's window grabs her hand yanks her out and they run off before the van blows up throwing them into the diner Inside Charlie recoils and holds up a metal tray as the boy stabs at her and the knife sticks in the tray Charlie fills a jug with water and turns to see the boy causing her to drop the jug as he slashes the front of her shirt with a big kitchen knife Charlie lowers the tray and kicks him over as Michael clambers in front of her and aims his gun but the boy has disappeared His hands slide down the blade and the knife drops to the floor as the boy stares at his bloody hands Bob and Jeep come over shining a torch on the ground revealing a trail of blood The lights go out plunging the place into darkness and Michael runs over to where the boy was The boy appears behind Bob and tries to throttle him but Michael grabs the boy and hurls him away and Jeep shoots him Jeep aims his torch beam up following a trail of bloody handprints across the ceiling until the trail stops dead Bob steps out onto the roof to join Jeep as Michael keeps holding Charlie her mouth gaping Charlie bends forward grimacing as Michael stares at him and holds Charlie's hands with Audrey at them both Bob and Jeep stare out into the darkness as bright light flashes all around illuminating hundreds of possessed standing motionless staring at the diner The building shakes and up on the roof A tear rolls down Charlie's cheek as she faces away from the child Charlie's mouth gapes as Audrey gently lifts the baby smiling incredulously wrapping the bloody child in a towel and offering it to Charlie Behind her back Audrey carries the baby over to Sandra who stares at it frowning but then smiles and nods Sitting behind Charlie Sandra twists her hands within the ropes bound around them as Audrey and Michael exchange a look and he shakes his head Michael leans to her with a sincere expression"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Jeep aims his torch beam up following a trail of bloody handprints across the ceiling until the trail stops dead The boy appears behind Bob and tries to throttle him but Michael grabs the boy and hurls him away and Jeep shoots him Charlie bends forward grimacing as Michael stares at him and holds Charlie's hands with Audrey at them both Bob steps out onto the roof to join Jeep as Michael keeps holding Charlie her mouth gaping The building shakes and up on the roof Bob and Jeep stare out into the darkness as bright light flashes all around illuminating hundreds of possessed standing motionless staring at the diner Charlie's mouth gapes as Audrey gently lifts the baby smiling incredulously wrapping the bloody child in a towel and offering it to Charlie A tear rolls down Charlie's cheek as she faces away from the child Audrey carries the baby over to Sandra who stares at it frowning but then smiles and nods Behind her back Sandra twists her hands within the ropes bound around them as Audrey and Michael exchange a look and he shakes his head Sitting behind Charlie Michael leans to her with a sincere expression The possessed clamber and crawl over the van scratching the windscreen with their fingernails Charlie picks up a machine pistol but Michael stops her takes the machine pistol and picks up an assault rifle Bob and Jeep pull the planks away from the door and open it as Michael walks out guns blazing causing the possessed to drop dead A couple run at Michael and he batters them away then pulls out two pistols and shoots more He gives another one a kick shoots him and lays into a couple more by the van Michael takes a nozzle from a fuel pump sprays gas over the back of the van and lights it causing the possessed to flee as the van is engulfed in flames Inside Audrey cowers fearfully and moves over to the passenger seat as Michael smashes the driver's window grabs her hand yanks her out and they run off before the van blows up throwing them into the diner Charlie fills a jug with water and turns to see the boy causing her to drop the jug as he slashes the front of her shirt with a big kitchen knife Charlie recoils and holds up a metal tray as the boy stabs at her and the knife sticks in the tray His hands slide down the blade and the knife drops to the floor as the boy stares at his bloody hands Charlie lowers the tray and kicks him over as Michael clambers in front of her and aims his gun but the boy has disappeared The lights go out plunging the place into darkness and Michael runs over to where the boy was Bob and Jeep come over shining a torch on the ground revealing a trail of blood"
        }
      ]
    }
  ]
}