{
  "ground_truth": "John turns his back and looks out the window beside the bureau and then throws the hairbrush, striking Preacher's head, and he is sure now Pearl knows. Preacher's hand locks the door as Willa, in outdoor clothes and not dressed for work in the parlor, enters with her back to us and stops, smiling benignly. Willa keeps smiling and, still smiling, shakes her head in disbelief as she makes for the house while Pearl screams. In a narrow screen setup similar to an earlier corridor scene, Preacher and Willa's eyes meet, and he turns. Willa is calm and immobile with the ecstasy of a martyr as Preacher hits her across the mouth. Preacher then hears the voice and starts to move out of the close shot, moving over to the coat on the back of the chair. His hand goes into the pocket and brings the knife out, the same coat and pocket as in the wedding-night scene. He pulls down the blind and moves toward the bed as the knife clicks open in his hand, and he raises his arm to strike. Later, he is scrubbing out an ice cream container on the back porch, looks up, and moves towards her as Walt enters the shot with a pipe. They enter the kitchen, where Walt clucks his tongue and moves towards the kitchen cabinet, pours, and snaps it down in weak defiance, then looks towards off-screen. He sits at a table with his back towards us, mumbling over his Bible, closes it, and turns to them with weepy eyes and a brave little smile as Icey smiles sideways, happy to let her mouth fall open and let out a gasp. We pan with slowly streaming weeds and bring in Willa in close profile; the current coming from behind her drifts her long hair across her throat, and she is in profile as before. It descends, catches on the windshield, and the line tautens and tugs. We start to follow the line up, continue to follow the line, and bring in close the stern of Ben Harper's skiff as he sits back, tugging unconcernedly at the line. Then he leans over to see what's wrong, peers over the side, and we start moving before he does. With a low camera angle capturing his full figure, we tilt to frame him from the waist downward and follow close behind him as he leaves the tree and walks along the side of the house. We tilt downward and close in, following only his feet as he steps past a tiny cellar window and we pan and tighten in close on it, where their noses are flat against the glass, their cheeks touch, and their window isn't quite big enough to hold both their heads; it is on the ground, and we don't see their chins.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "John rotates his body and gazes out the aperture beside the dresser and then hurls the comb, hitting Preacher's cranium, and he is certain now Pearl comprehends. Preacher's hand secures the entryway as Willa, in exterior garments and not attired for duty in the lounge, enters with her back to us and halts, grinning kindly. Willa maintains grinning and, still grinning, shakes her cranium in skepticism as she heads for the residence while Pearl shrieks. In a narrow display arrangement akin to an earlier passage scene, Preacher and Willa's gazes connect, and he rotates. Willa is serene and motionless with the rapture of a martyr as Preacher strikes her across the lips. Preacher then detects the voice and commences to relocate out of the close-up, transitioning over to the jacket on the back of the seat. His hand delves into the pocket and extracts the blade, the identical jacket and pocket as in the matrimonial-night scene. He tugs down the shade and advances toward the bunk as the blade snaps open in his grasp, and he elevates his arm to hit. Later, he is scouring out an ice cream receptacle on the back veranda, glances up, and advances towards her as Walt enters the frame with a pipe. They enter the cookhouse, where Walt clicks his tongue and advances towards the cookhouse cupboard, pours, and snaps it down in frail resistance, then glances towards off-frame. He sits at a table with his back towards us, murmuring over his Scripture, closes it, and turns to them with teary eyes and a courageous little grin as Icey grins sideways, pleased to let her mouth fall open and let out a breath. We pan with slowly streaming weeds and bring in Willa in close profile; the current coming from behind her drifts her long hair across her neck, and she is in profile as before. It descends, catches on the windscreen, and the line tautens and pulls. We start to follow the line up, continue to follow the line, and bring in close the stern of Ben Harper's boat as he reclines back, pulling unconcernedly at the line. Then he leans over to see what's incorrect, peers over the side, and we start relocating before he does. With a low camera angle capturing his full figure, we tilt to frame him from the waist downward and follow close behind him as he departs the tree and strolls along the side of the abode. We tilt downward and close in, following only his feet as he steps past a tiny basement aperture and we pan and tighten in close on it, where their noses are flat against the glass, their cheeks touch, and their aperture isn't quite big enough to hold both their heads; it is on the ground, and we don't see their chins."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "John's back is turned by him, and the window beside the bureau is looked out as the hairbrush is thrown by him, striking Preacher's head, and he is sure now that Pearl knows. The door is locked by Preacher's hand as Willa, in outdoor clothes and not dressed for work in the parlor, enters with her back to us and stops, smiling benignly. The smile is kept by Willa, and still smiling, disbelief is expressed by her with a shake of her head as she makes for the house while Pearl screams. Preacher and Willa's eyes meet in a narrow screen setup similar to an earlier corridor scene, and a turn is made by him. Calmness and immobility with the ecstasy of a martyr are displayed by Willa as her mouth is hit by Preacher. The voice is heard by Preacher, and he begins to move out of the close shot, moving over to the coat on the back of the chair. The pocket is reached into by his hand, and the knife is brought out, the same coat and pocket as in the wedding-night scene. The blind is pulled down by him, and he moves toward the bed as the knife is clicked open in his hand, and his arm is raised to strike. Later, an ice cream container is scrubbed out by him on the back porch, and a look is given upward, and movement is made towards her as Walt enters the shot with a pipe. The kitchen is entered by them, where his tongue is clucked by Walt, movement is made towards the kitchen cabinet, pouring is done, and then it is snapped down in weak defiance, followed by a look towards off-screen. A seat is taken by him at a table with his back towards us, and mumbling is done over his Bible, which is closed, and a turn is made to them with weepy eyes and a brave little smile as sideways smiling is done by Icey, happy to let her mouth fall open and let out a gasp. Slowly streaming weeds are panned with by us, and Willa is brought in close profile; the current coming from behind her drifts her long hair across her throat, and she is in profile as before. It descends, catches on the windshield, and the line is tautened and tugged. The line is followed up by us, continued to follow, and a close is brought in on the stern of Ben Harper's skiff as sitting back is done by him, tugging unconcernedly at the line. Then he leans over to see what's wrong, peers over the side, and we start moving before he does. A low camera angle captures his full figure, and a tilt is made to frame him from the waist downward, following close behind him as the tree is left and walking is done along the side of the house. A tilt downward is made, and closing in is done, following only his feet as a tiny cellar window is stepped past, and we pan and tighten in close on it, where their noses are flat against the glass, their cheeks touch, and their window isn't quite big enough to hold both their heads; it is on the ground, and their chins aren't seen by us."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "John turns his back, looks out the window, and throws the hairbrush at Preacher's head, confirming Pearl's awareness. Preacher locks the door as Willa, dressed for outdoors, enters smiling. She shakes her head in disbelief and heads inside while Pearl screams. In a narrow setup reminiscent of an earlier scene, Preacher and Willa's eyes meet; he hits her as she remains calm, like a martyr. Preacher hears a voice, retrieves a knife from the coat pocket used on the wedding night, and approaches the bed. Later, scrubbing an ice cream container on the porch, Preacher notices Walt, who enters with a pipe. They move to the kitchen, where Walt clucks his tongue, pours a drink, and looks towards off-screen. He sits, mumbles over his Bible, and closes it with weepy eyes and a brave smile, while Icey smiles, gasping slightly. We pan with slowly moving weeds, revealing Willa in profile; the current drifts her hair across her throat. It catches, tightens on the windshield, and we follow the line to Ben Harper's skiff. He leans to see the issue, peers over the side, and we move before him. A low camera angle captures his full figure as he walks beside the house. We follow his feet past a cellar window, focusing on noses pressed against the glass, cheeks touching, unable to fit both their heads, with the window on the ground, obscuring their chins."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "John turns and throws the hairbrush, hitting Preacher's head, now certain Pearl knows. Preacher locks the door as Willa enters in outdoor clothes, smiling. Willa, still smiling, shakes her head in disbelief, heading to the house while Pearl screams. Preacher and Willa's eyes meet, and he hits her across the mouth. Preacher hears a voice, moves to the coat on the chair, retrieves the knife, closes the blind, and raises the knife. Later, scrubbing an ice cream container, Preacher sees Walt with a pipe. They enter the kitchen, Walt pours, snaps it down in defiance, and looks off-screen. He sits, mumbles over his Bible, closes it, and turns with weepy eyes. Icey gasps as weeds drift Willa's hair across her throat. The current catches and tugs the line on Ben Harper's skiff. He peers over the side, moving before us, and we tilt to follow him along the house. We focus on his feet past a tiny window, tightening on faces pressed against the glass, cheeks touching, but the window isn't big enough for both heads."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "John, in a moment of tense contemplation, turns his back to the room and shifts his gaze outward, peering through the window positioned beside the bureau. With a sudden and decisive motion, he hurls the hairbrush with precision, making contact with Preacher's head. At this point, he is completely certain that Pearl is aware of everything. Meanwhile, Preacher's hand, firm and resolute, secures the door. Willa, adorned in outdoor attire rather than her usual work clothes for the parlor, makes her entrance. Her back faces us as she halts her movement, a serene and somewhat enigmatic smile gracing her lips. Maintaining that gentle smile, Willa shakes her head slowly in disbelief and begins to head towards the house, even as Pearl's screams pierce the air. In a narrow, restricted screen setup reminiscent of an earlier scene in the corridor, the eyes of Preacher and Willa meet with intensity. As Preacher pivots, Willa's demeanor remains tranquil and still, imbued with the ecstatic calmness of a martyr. This is when Preacher strikes her across the mouth. \n\nPreacher's attention is then caught by a voice, prompting him to shift from his previous position in the close shot. He strides purposefully over to the coat draped on the chair's back. Reaching into its pocket, he retrieves a knife—the same coat and pocket from the infamous wedding-night scene. Lowering the blind deliberately, he advances toward the bed. With a metallic click, the knife snaps open in his grasp, and he raises his arm high, poised to strike. \n\nLater on, Preacher is seen meticulously scrubbing out an ice cream container on the back porch. Glancing upward, he notices her presence and moves in her direction. Walt then makes his entrance into the scene, casually holding a pipe. Together, they walk into the kitchen area, where Walt expresses mild disapproval by clucking his tongue. He heads to the kitchen cabinet, methodically pours a drink, and brings it down with a snap in an act of weak defiance. His gaze drifts toward something off-screen. He then takes a seat at the table, positioning himself with his back facing us, while mumbling and poring over his Bible. After closing it, filled with emotion, he tilts his face towards them, teary-eyed but forcing a small brave smile. Icey, positioned nearby, allows herself to smile sideways, her mouth opening in a delighted gasp.\n\nThe scene transitions with a gentle pan, capturing the slowly streaming weeds, and draws us into a close profile of Willa. Her long hair is carried by the current flowing from behind, cascading across her throat, her profile reminiscent of previous moments. The hair descends further, tangling and catching on the windshield. The line draws tight and pulls insistently. We then begin to trace the line upwards, staying with it as it guides us, bringing into view the stern of Ben Harper's skiff. He sits back comfortably, tugging nonchalantly at the line. Leaning over curiously, he peers over the edge, sensing something wrong. As soon as he decides to move, we capture his actions. The camera, positioned low, takes in his entire figure, then tilts to frame him from the waist downwards. We closely trail behind him as he steps away from the tree, walking alongside the house. Our gaze follows downward and zooms in, focusing only on his feet as he strides past a diminutive cellar window. We pan and zoom in tightly on this window, where two noses lay pressed flat against the glass, cheeks touching intimately. The window's limited size strains to contain both their heads within its frame, positioned at ground level, rendering their chins unseen."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In a moment filled with intense contemplation, John turns his back to the room, shifting his gaze away from its familiar comforts, focusing instead on the world outside. He peers intently through the window situated beside the old, worn bureau. Then, with a sudden and decisive motion, he hurls the hairbrush with uncanny precision, striking Preacher squarely on the head. At this critical juncture, he is completely certain that Pearl is now fully aware of everything that has transpired. Concurrently, Preacher's hand, firm and resolute, secures the door with a determined grip. Willa, adorned not in her typical work clothes suited for the parlor but rather in attire meant for the outdoors, makes her entrance. Her back is turned towards us as she comes to a halt, a serene and somewhat enigmatic smile playing upon her lips. Continuing to maintain that gentle smile, Willa shakes her head slowly in disbelief and begins to make her way toward the house, even as Pearl's sharp, piercing screams fill the air. In a narrow, restricted screen setup that vividly recalls an earlier scene in the corridor, the eyes of Preacher and Willa meet with palpable intensity. As Preacher pivots, Willa's demeanor remains tranquil and still, imbued with an ecstatic calmness akin to that of a martyr. This is the moment when Preacher strikes her sharply across the mouth. \n\nSoon after, Preacher is drawn away from his previous position by the sound of a voice, prompting him to shift. He strides purposefully over to the coat draped carelessly on the back of a nearby chair. Reaching into its pocket, he retrieves a knife—the very same coat and pocket from the infamous wedding-night scene. Deliberately lowering the blind, he advances in a menacing fashion toward the bed. A metallic click rings out as the knife snaps open in his grasp, and he raises his arm high, poised to strike with intent. \n\nLater on, we find Preacher meticulously scrubbing out an ice cream container on the back porch, each stroke methodical and precise. He glances upward, noticing her presence, and moves in her direction with determination. Walt then makes his entrance into the unfolding scene, casually holding a pipe as if it were an extension of his hand. Together, they walk into the kitchen area, where Walt expresses mild disapproval by clucking his tongue. He proceeds to the kitchen cabinet, methodically pours himself a drink, and brings it down with a decisive snap in an act of weak defiance. His gaze drifts toward something beyond the screen. He then takes a seat at the table, positioning himself with his back to us, mumbling under his breath while poring over the pages of his Bible. After ceremoniously closing it, filled with a range of emotions, he tilts his face towards them, teary-eyed yet managing to force a small, brave smile. Nearby, Icey allows herself to smile sideways, her mouth opening in a delighted gasp as she takes in the scene.\n\nThe scene transitions seamlessly with a gentle pan, capturing the slowly streaming weeds, drawing us into a close profile of Willa. Her long hair is swept along by the current flowing from behind, cascading gracefully across her throat, her profile reminiscent of earlier moments. The strands of hair descend further, tangling and catching on the windshield as if caught by time itself. The line draws tight, pulling insistently. We then begin to trace the line upwards, staying with it as it guides us, eventually bringing into view the stern of Ben Harper's skiff. He sits back comfortably, his demeanor relaxed, tugging nonchalantly at the line. Leaning over with curiosity, he peers over the edge, sensing something is amiss. As soon as he decides to take action, we capture his movements. The camera, positioned low to the ground, captures his entire figure, then tilts to frame him from the waist downwards. We closely trail behind him as he steps away deliberately from the tree, walking alongside the house with purpose. Our gaze follows downward and zooms in, focusing intently on his feet as he strides past a diminutive cellar window. We pan and zoom in tightly on this window, where two small noses are pressed flat against the glass, cheeks nestling intimately close together. The window's limited size strains to contain both their heads within its narrow frame, positioned at ground level, rendering their chins unseen."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "John, standing beside the bureau, turns his back to the room and gazes intently out the window. He grips a hairbrush in his hand, suddenly whirling around to hurl it with force; it soars through the air and makes contact with Preacher's head. In this instant, he becomes certain that Pearl has understood the gravity of the situation. Preacher responds by swiftly reaching out to lock the door, creating a barrier between them and the outside. Meanwhile, Willa, dressed in outdoor clothes rather than her typical work attire suitable for the parlor, enters the room with her back facing us and pauses, a benign smile gracing her lips. Despite the unfolding tension, she maintains her pleasant expression, shaking her head slowly in disbelief while heading back towards the house, her demeanor calm even as the sound of Pearl's scream fills the air. In a narrow screen setup reminiscent of a previous corridor scene, the gaze between Preacher and Willa locks momentarily before Preacher makes a decisive turn. Willa remains still and composed, exuding the calm ecstasy of a martyr, even as Preacher strikes her across the mouth. Immediately after, a voice catches Preacher's attention, prompting him to shift out of the close shot, moving purposefully towards a coat draped over the back of a chair. With calculated precision, his hand slides into a pocket, retrieving a knife identical to the one from the wedding-night scene. He lowers the blind with determination and approaches the bed, the knife in his hand clicking open ominously, and raises his arm in preparation to strike. In a later scene, Preacher stands on the back porch, vigorously scrubbing out an ice cream container, before pausing to look up and then moving towards Willa as Walt enters the frame, puffing on a pipe. Together, they enter the kitchen, where Walt, clucking his tongue in mild disapproval, strides towards the kitchen cabinet. He pours a drink, snaps the container down with an air of weak defiance, and looks off-screen contemplatively. As he takes a seat at the table, his back turned to us, he mumbles softly over his Bible before closing it, turning towards the others with teary eyes, and offering a brave, small smile. Icey, nearby, smiles sideways, allowing her mouth to drop open in surprise as a gasp escapes her lips. The camera pans to capture slowly streaming weeds, transitioning to Willa's close profile, her long hair gently drifting across her throat from the current behind her, creating a serene image similar to a past one. Her hair descends and catches on the windshield, causing the line to tighten and tug. We follow this line upward until our focus is drawn to the stern of Ben Harper's skiff, where he sits back, tugging at the line with an air of indifference. Suddenly curious, he leans over to investigate, peering over the side as we begin to move before he does. The camera, positioned low, captures his entire figure before tilting to frame him from the waist down, and follows closely as he departs from the tree and strides along the house's exterior. As we tilt downward, his feet become our focus, stepping past a tiny cellar window, leading us to pan and tighten the view on it. Inside, noses pressed flat against the glass and cheeks touching, the window proves too small to accommodate both their heads, situated low enough that their chins are hidden from view."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "John looks out the window before throwing a hairbrush at Preacher's head, realizing Pearl knows. As Preacher locks the door, Willa enters in outdoor clothes, smiling benignly despite Pearl's screams. In a tense moment reminiscent of an earlier scene, Preacher and Willa's eyes meet before he strikes her across the mouth. Preacher then retrieves a knife from his coat pocket and approaches the bed with intent. Later, he cleans an ice cream container on the back porch, acknowledges Walt's arrival, and moves indoors. In the kitchen, Walt defies Preacher weakly, pouring a drink before sitting at a table to mumble over his Bible, eventually closing it with a tearful but brave smile, while Icey gasps in shock. The scene transitions to Willa, her hair drifting across her throat in the current, revealing Ben Harper's skiff anchored nearby. As Ben inspects the line, we follow his movement away from the tree along the house. The camera lowers to capture only his feet passing a small cellar window, where two noses press against the glass, cheeks touching in a space too small for both their heads, with their chins unseen."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "John, turning his back with a sense of urgency, looks out the window beside the bureau, an heirloom piece with intricate carvings that once belonged to his grandmother, and then throws the hairbrush, a heavy antique made of ivory, striking Preacher's head, and he is sure now Pearl knows. Preacher's hand, calloused from years of hard labor, locks the door as Willa, in outdoor clothes indicating she returned from the bustling local market and not dressed for work in the parlor, enters with her back to us and stops, smiling benignly. Willa, whose smile conceals her inner turmoil, keeps smiling and, still smiling, shakes her head in disbelief as she makes for the house while Pearl screams. In a narrow screen setup reminiscent of old noir films and similar to an earlier corridor scene, Preacher and Willa's eyes meet, and he turns. Willa is calm and immobile with the ecstasy of a martyr, as if she draws strength from her faith, as Preacher hits her across the mouth. Preacher then hears the voice, a haunting echo from the past, and starts to move out of the close shot, moving over to the coat on the back of the chair, a faded jacket once worn in happier times. His hand goes into the pocket and brings the knife out, the same coat and pocket as in the wedding-night scene, creating an ominous parallel. He pulls down the blind, shutting out the intrusive sunlight, and moves toward the bed as the knife clicks open in his hand, and he raises his arm to strike. Later, he is scrubbing out an ice cream container on the back porch, a mundane task masking dark thoughts, looks up, and moves towards her as Walt enters the shot with a pipe, a relic from his Navy days. They enter the kitchen, where Walt clucks his tongue, an habitual expression of mild disapproval, and moves towards the kitchen cabinet, pours, and snaps it down in weak defiance, then looks towards off-screen. He sits at a table with his back towards us, mumbling over his Bible, the worn pages reflecting years of solace sought, closes it, and turns to them with weepy eyes and a brave little smile as Icey, known for her sharp intuition, smiles sideways, happy to let her mouth fall open and let out a gasp. We pan with slowly streaming weeds, reflecting the passage of time, and bring in Willa in close profile; the current coming from behind her drifts her long hair across her throat, and she is in profile as before. It descends, catches on the windshield, a crack running across its surface, and the line tautens and tugs. We start to follow the line up, continue to follow the line, and bring in close the stern of Ben Harper's skiff, a modest vessel once used for fishing trips, as he sits back, tugging unconcernedly at the line. Then he leans over to see what's wrong, peers over the side with a seasoned sailor's curiosity, and we start moving before he does. With a low camera angle capturing his full figure, we tilt to frame him from the waist downward and follow close behind him as he leaves the tree, an ancient oak with sprawling branches, and walks along the side of the house. We tilt downward and close in, following only his feet as he steps past a tiny cellar window, known to be a haven for spiders, and we pan and tighten in close on it, where their noses are flat against the glass, their cheeks touch, and their window isn't quite big enough to hold both their heads; it is on the ground, and we don't see their chins."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "John turns his back and looks out the window beside the bureau and then throws the hairbrush striking Preacher's head and he is sure now Pearl knows. Preacher's hand locks the door as Willa in outdoor clothes and not dressed for work in the parlor enters with her back to us and stops smiling benignly. Willa keeps smiling and still smiling shakes her head in disbelief as she makes for the house while Pearl screams. In a narrow screen setup similar to an earlier corridor scene Preacher and Willa's eyes meet and he turns. Willa is calm and immobile with the ecstasy of a martyr as Preacher hits her across the mouth. Preacher then hears the voice and starts to move out of the close shot moving over to the coat on the back of the chair. His hand goes into the pocket and brings the knife out. the same coat and pocket as in the weddingnight scene. He pulls down the blind and moves toward the bed as the knife clicks open in his hand and he raises his arm to strike. Later he is scrubbing out an ice cream container on the back porch looks up and moves towards her as Walt enters the shot with a pipe. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. They enter the kitchen where Walt clucks his tongue and moves towards the kitchen cabinet pours and snaps it down in weak defiance then looks towards offscreen. He sits at a table with his back towards us mumbling over his Bible closes it and turns to them with weepy eyes and a brave little smile as Icey smiles sideways happy to let her mouth fall open and let out a gasp. We pan with slowly streaming weeds and bring in Willa in close profile. the current coming from behind her drifts her long hair across her throat and she is in profile as before. It descends catches on the windshield and the line tautens and tugs. We start to follow the line up continue to follow the line and bring in close the stern of Ben Harper's skiff as he sits back tugging unconcernedly at the line. Then he leans over to see what is wrong. peers over the side and we start moving before he does. With a low camera angle capturing his full figure we tilt to frame him from the waist downward and follow close behind him as he leaves the tree and walks along the side of the house. We tilt downward and close in following only his feet as he steps past a tiny cellar window and we pan and tighten in close on it where their noses are flat against the glass their cheeks touch and their window is not quite big enough to hold both their heads. it is on the ground and we do not see their chins."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "John turns his back and looks out the window beside the bureau and then throws the hairbrush striking Preacher's head and he is sure now Pearl knows. Preacher's hand locks the door as Willa in outdoor clothes and not dressed for work in the parlor enters with her back to us and stops smiling benignly. Willa keeps smiling and still smiling shakes her head in disbelief as she makes for the house while Pearl screams. In a narrow screen setup similar to an earlier corridor scene Preacher and Willa's eyes meet and he turns. Willa is calm and immobile with the ecstasy of a martyr as Preacher hits her across the mouth. Preacher then hears the voice and starts to move out of the close shot moving over to the coat on the back of the chair. His hand goes into the pocket and brings the knife out. the same coat and pocket as in the weddingnight scene. He pulls down the blind and moves toward the bed as the knife clicks open in his hand and he raises his arm to strike. Later he is scrubbing out an ice cream container on the back porch looks up and moves towards her as Walt enters the shot with a pipe. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. They enter the kitchen where Walt clucks his tongue and moves towards the kitchen cabinet pours and snaps it down in weak defiance then looks towards offscreen. He sits at a table with his back towards us mumbling over his Bible closes it and turns to them with weepy eyes and a brave little smile as Icey smiles sideways happy to let her mouth fall open and let out a gasp. We pan with slowly streaming weeds and bring in Willa in close profile. the current coming from behind her drifts her long hair across her throat and she is in profile as before. It descends catches on the windshield and the line tautens and tugs. We start to follow the line up continue to follow the line and bring in close the stern of Ben Harper's skiff as he sits back tugging unconcernedly at the line. Then he leans over to see what is wrong. peers over the side and we start moving before he does. With a low camera angle capturing his full figure we tilt to frame him from the waist downward and follow close behind him as he leaves the tree and walks along the side of the house. We tilt downward and close in following only his feet as he steps past a tiny cellar window and we pan and tighten in close on it where their noses are flat against the glass their cheeks touch and their window is not quite big enough to hold both their heads. it is on the ground and we do not see their chins."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "John turns his back and looks out the window beside the bureau and then throws the hairbrush striking Preacher's head and he is sure now Pearl knows. Preacher's hand locks the door as Willa in outdoor clothes and not dressed for work in the parlor enters with her back to us and stops smiling benignly. Willa keeps smiling and still smiling shakes her head in disbelief as she makes for the house while Pearl screams. In a narrow screen setup similar to an earlier corridor scene Preacher and Willa's eyes meet and he turns. Willa is calm and immobile with the ecstasy of a martyr as Preacher hits her across the mouth. We start to follow the line up continue to follow the line and bring in close the stern of Ben Harper's skiff as he sits back tugging unconcernedly at the line. Then he leans over to see what is wrong. peers over the side and we start moving before he does. With a low camera angle capturing his full figure we tilt to frame him from the waist downward and follow close behind him as he leaves the tree and walks along the side of the house. We tilt downward and close in following only his feet as he steps past a tiny cellar window and we pan and tighten in close on it where their noses are flat against the glass their cheeks touch and their window is not quite big enough to hold both their heads. it is on the ground and we do not see their chins."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "John turns his back and looks out the window beside the bureau and then throws the hairbrush striking Preacher's head and he is sure now Pearl knows. Preacher's hand locks the door as Willa in outdoor clothes and not dressed for work in the parlor enters with her back to us and stops smiling benignly. With a low camera angle capturing his full figure we tilt to frame him from the waist downward and follow close behind him as he leaves the tree and walks along the side of the house. We tilt downward and close in following only his feet as he steps past a tiny cellar window and we pan and tighten in close on it where their noses are flat against the glass their cheeks touch and their window is not quite big enough to hold both their heads. it is on the ground and we do not see their chins."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Tim spins around and gazes toward the ceiling beside the wardrobe and then tosses the teacup, grazing Artist's shoulder, and he's certain now Daisy understands. Artist's elbow fastens the gate as Sophie, in swimming attire and not prepared for dining in the study, arrives with her side to us and halts, chuckling mischievously. Sophie continues chuckling and, still chuckling, nods her head in disbelief as she makes for the barn while Daisy hisses. In a narrow field setup similar to an earlier alleyway scene, Artist and Sophie's gazes connect, and he pivots. Sophie is serene and stationary with the bliss of a saint as Artist taps her across the jaw. Artist then detects the noise and begins to shuffle out of the tight frame, shuffling over to the scarf on the back of the sofa. His elbow dives into the sleeve and extracts the fork out, the same scarf and sleeve as in the holiday-night sequence. He pulls up the curtain and shuffles toward the couch as the fork snaps open in his elbow, and he elevates his knee to poke. Eventually, he is wiping out a cookie jar on the front patio, glances up, and shuffles towards her as Lucas enters the view with a flute. They shuffle into the ballroom, where Lucas nods his head and shuffles towards the ballroom armoire, spills, and shoves it upwards in strong defiance, then glances towards off-scene. He perches at a desk with his side towards us, humming over his dictionary, shuts it, and pivots to them with misty eyes and a timid little frown as Poppi frowns sideways, thrilled to let her nose stretch open and let out a sigh. We glide with slowly floating sticks and bring Sophie in close silhouette; the breeze coming from beside her wafts her short hat across her chin, and she is silhouetted as previously. It rises, latches on the mirror, and the cord tightens and tugs. We begin to trace the cord down, continue to trace the cord, and bring in close the bow of Carl Rogers' canoe as he leans forward, tugging nonchalantly on the cord. Then he leans back to find what's right, leans back over the edge, and we begin moving before he does. With a high camera angle capturing his full silhouette, we tilt to frame him from the chest upward and track close behind him as he approaches the bush and strolls along the front of the garage. We tilt upward and open in, tracking only his hands as he tiptoes past a large attic grate and we glide and loosen in wide on it, where their foreheads are flat against the wood, their lips touch, and their grate isn't entirely tall enough to contain both their shoulders; it is in the air, and we don't spot their feet."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "John looks out the window, throwing a hairbrush that hits Preacher, confirming to John that Pearl knows something. Preacher locks the door as Willa, dressed in outdoor attire, enters, smiling despite Pearl's screams. Willa’s calm demeanor remains even as Preacher hits her. Preacher retrieves a knife from the coat pocket, recalling their wedding night, and prepares to strike. Later, he cleans an ice cream container on the porch and moves indoors as Walt arrives. Walt displays weak defiance and sits, mumbling with his Bible. He closes it, smiling bravely at an approving Icey. We see Willa's profile drift in water, her hair caught on a windshield. Following a line, we shift to Ben Harper's skiff as he examines it, leading him along the house. The camera focuses on his feet, eventually narrowing in on a tiny cellar window where two faces are pressed, unable to fit entirely."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "it is on the ground and we do not see their chins We tilt downward and close in following only his feet as he steps past a tiny cellar window and we pan and tighten in close on it where their noses are flat against the glass their cheeks touch and their window is not quite big enough to hold both their heads With a low camera angle capturing his full figure we tilt to frame him from the waist downward and follow close behind him as he leaves the tree and walks along the side of the house peers over the side and we start moving before he does Then he leans over to see what is wrong We start to follow the line up continue to follow the line and bring in close the stern of Ben Harper's skiff as he sits back tugging unconcernedly at the line It descends catches on the windshield and the line tautens and tugs the current coming from behind her drifts her long hair across her throat and she is in profile as before We pan with slowly streaming weeds and bring in Willa in close profile He sits at a table with his back towards us mumbling over his Bible closes it and turns to them with weepy eyes and a brave little smile as Icey smiles sideways happy to let her mouth fall open and let out a gasp They enter the kitchen where Walt clucks his tongue and moves towards the kitchen cabinet pours and snaps it down in weak defiance then looks towards offscreen Later he is scrubbing out an ice cream container on the back porch looks up and moves towards her as Walt enters the shot with a pipe He pulls down the blind and moves toward the bed as the knife clicks open in his hand and he raises his arm to strike the same coat and pocket as in the weddingnight scene His hand goes into the pocket and brings the knife out Preacher then hears the voice and starts to move out of the close shot moving over to the coat on the back of the chair Willa is calm and immobile with the ecstasy of a martyr as Preacher hits her across the mouth In a narrow screen setup similar to an earlier corridor scene Preacher and Willa's eyes meet and he turns Willa keeps smiling and still smiling shakes her head in disbelief as she makes for the house while Pearl screams Preacher's hand locks the door as Willa in outdoor clothes and not dressed for work in the parlor enters with her back to us and stops smiling benignly John turns his back and looks out the window beside the bureau and then throws the hairbrush striking Preacher's head and he is sure now Pearl knows"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Preacher's hand locks the door as Willa in outdoor clothes and not dressed for work in the parlor enters with her back to us and stops smiling benignly John turns his back and looks out the window beside the bureau and then throws the hairbrush striking Preacher's head and he is sure now Pearl knows In a narrow screen setup similar to an earlier corridor scene Preacher and Willa's eyes meet and he turns Willa keeps smiling and still smiling shakes her head in disbelief as she makes for the house while Pearl screams Preacher then hears the voice and starts to move out of the close shot moving over to the coat on the back of the chair Willa is calm and immobile with the ecstasy of a martyr as Preacher hits her across the mouth the same coat and pocket as in the weddingnight scene His hand goes into the pocket and brings the knife out Later he is scrubbing out an ice cream container on the back porch looks up and moves towards her as Walt enters the shot with a pipe He pulls down the blind and moves toward the bed as the knife clicks open in his hand and he raises his arm to strike He sits at a table with his back towards us mumbling over his Bible closes it and turns to them with weepy eyes and a brave little smile as Icey smiles sideways happy to let her mouth fall open and let out a gasp They enter the kitchen where Walt clucks his tongue and moves towards the kitchen cabinet pours and snaps it down in weak defiance then looks towards offscreen the current coming from behind her drifts her long hair across her throat and she is in profile as before We pan with slowly streaming weeds and bring in Willa in close profile We start to follow the line up continue to follow the line and bring in close the stern of Ben Harper's skiff as he sits back tugging unconcernedly at the line It descends catches on the windshield and the line tautens and tugs peers over the side and we start moving before he does Then he leans over to see what is wrong We tilt downward and close in following only his feet as he steps past a tiny cellar window and we pan and tighten in close on it where their noses are flat against the glass their cheeks touch and their window is not quite big enough to hold both their heads With a low camera angle capturing his full figure we tilt to frame him from the waist downward and follow close behind him as he leaves the tree and walks along the side of the house it is on the ground and we do not see their chins"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He sits at a table with his back towards us mumbling over his Bible closes it and turns to them with weepy eyes and a brave little smile as Icey smiles sideways happy to let her mouth fall open and let out a gasp We pan with slowly streaming weeds and bring in Willa in close profile the current coming from behind her drifts her long hair across her throat and she is in profile as before It descends catches on the windshield and the line tautens and tugs We start to follow the line up continue to follow the line and bring in close the stern of Ben Harper's skiff as he sits back tugging unconcernedly at the line Then he leans over to see what is wrong peers over the side and we start moving before he does With a low camera angle capturing his full figure we tilt to frame him from the waist downward and follow close behind him as he leaves the tree and walks along the side of the house We tilt downward and close in following only his feet as he steps past a tiny cellar window and we pan and tighten in close on it where their noses are flat against the glass their cheeks touch and their window is not quite big enough to hold both their heads it is on the ground and we do not see their chins John turns his back and looks out the window beside the bureau and then throws the hairbrush striking Preacher's head and he is sure now Pearl knows Preacher's hand locks the door as Willa in outdoor clothes and not dressed for work in the parlor enters with her back to us and stops smiling benignly Willa keeps smiling and still smiling shakes her head in disbelief as she makes for the house while Pearl screams In a narrow screen setup similar to an earlier corridor scene Preacher and Willa's eyes meet and he turns Willa is calm and immobile with the ecstasy of a martyr as Preacher hits her across the mouth Preacher then hears the voice and starts to move out of the close shot moving over to the coat on the back of the chair His hand goes into the pocket and brings the knife out the same coat and pocket as in the weddingnight scene He pulls down the blind and moves toward the bed as the knife clicks open in his hand and he raises his arm to strike Later he is scrubbing out an ice cream container on the back porch looks up and moves towards her as Walt enters the shot with a pipe They enter the kitchen where Walt clucks his tongue and moves towards the kitchen cabinet pours and snaps it down in weak defiance then looks towards offscreen"
        }
      ]
    }
  ]
}