{
  "ground_truth": "They deflect off Gabriel's steel breastplate. Gabriel rises into the air and swings his mace, crashing it into furniture. Michael wallops. Gabriel leaps over his wing and gets swept with a machine pistol. Gabriel shoves the spike in the middle of his mace into the barrel of the gun. Michael shoots and is blown back against the wall. Gabriel attacks. Gabriel slams the mace against the wall. Michael clutches the shaft of the mace. Gabriel sets the spiked end spinning. He pushes it towards Michael's face. Michael shoves it away, and Gabriel punches him. Michael punches Gabriel, grabs the overhead TV, and hurls it at Gabriel. Gabriel punches Michael to the floor. Gabriel grabs Michael by the throat, lifts him up, and punches him. Michael wallops him back and twists his arm. He flings Gabriel over and kicks him in the face. Gabriel forces Michael over a worktop and pins him down. He wields a hammer. Michael dodges the blow. Gabriel spins and slashes Michael across the chest. Michael looks down at his ripped shirt. Gabriel punches him in the face. Gabriel lunges with the mace, but Michael blocks the blow. The mace flies out of Gabriel's hands. Michael punches and kicks Gabriel. He gets on Gabriel's back, with his arms around his neck. Gabriel flies upwards and batters Michael against the ceiling. Michael keeps his arms held tight around Gabriel's neck. Michael holds on tight. Gabriel reaches down and picks up the mace. Gabriel holds the mace to his side and twists it. A blade shoots out, stabbing Michael behind him. Michael flops back onto the floor, his mouth wide open. Michael lies with his arms outstretched, eyes wide open, twitching slightly, a bloody wound in his chest. Gabriel turns and stares down at Michael. Tears glisten in Gabriel's eyes. Michael's bloody lips twitch. His eyes close as he expires. A golden light spreads over him. A tear runs down Gabriel's cheek as he watches. The bright light engulfs Michael, then vanishes taking him with it. Gabriel turns to go. As Jeep drives through the light, Charlie turns and looks at him. Black lines and symbols spread up his arm. Gabriel slowly steps through the wrecked diner holding his mace. He goes behind the counter where Bob is laying amongst the wreckage. Bob holds his lighter out to a gas tap at the base of an oven. He looks up at Gabriel. He sparks up a flame, igniting the gas. Gabriel takes flight as flames engulf the diner and the possessed outside. Jeep drives along a desert highway. Charlie sits on the passenger seat, cradling her baby and smiling down at him. Jeep frowns at Charlie. Then they both look ahead.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "They deflect off Gabriel's metal breastplate. Gabriel ascends into the atmosphere and swings his club, smashing it into furniture. Michael strikes. Gabriel leaps over his pinion and gets swept with an automatic pistol. Gabriel thrusts the spike in the middle of his club into the barrel of the weapon. Michael fires and is blown back against the partition. Gabriel attacks. Gabriel slams the club against the partition. Michael grips the shaft of the club. Gabriel sets the spiked extremity spinning. He pushes it towards Michael's visage. Michael shoves it away, and Gabriel punches him. Michael punches Gabriel, grabs the overhead television, and hurls it at Gabriel. Gabriel punches Michael to the floor. Gabriel grabs Michael by the throat, lifts him up, and punches him. Michael strikes him back and twists his limb. He flings Gabriel over and kicks him in the visage. Gabriel forces Michael over a worktop and pins him down. He wields a mallet. Michael dodges the blow. Gabriel spins and slashes Michael across the torso. Michael looks down at his torn shirt. Gabriel punches him in the visage. Gabriel lunges with the club, but Michael blocks the blow. The club flies out of Gabriel's hands. Michael punches and kicks Gabriel. He gets on Gabriel's back, with his limbs around his neck. Gabriel flies upwards and batters Michael against the ceiling. Michael keeps his limbs held tight around Gabriel's neck. Michael holds on tight. Gabriel reaches down and picks up the club. Gabriel holds the club to his flank and twists it. A blade shoots out, stabbing Michael behind him. Michael flops back onto the floor, his mouth wide open. Michael lies with his limbs outstretched, eyes wide open, twitching slightly, a bloody wound in his torso. Gabriel turns and stares down at Michael. Tears glisten in Gabriel's eyes. Michael's bloody lips twitch. His eyes close as he expires. A golden light spreads over him. A tear runs down Gabriel's cheek as he watches. The bright light engulfs Michael, then vanishes taking him with it. Gabriel turns to go. As Jeep drives through the light, Charlie turns and looks at him. Black lines and symbols spread up his limb. Gabriel slowly steps through the wrecked diner holding his club. He goes behind the counter where Bob is laying amongst the wreckage. Bob holds his lighter out to a gas tap at the base of an oven. He looks up at Gabriel. He sparks up a flame, igniting the gas. Gabriel takes flight as flames engulf the diner and the possessed outside. Jeep drives along a desert highway. Charlie sits on the passenger seat, cradling her infant and smiling down at him. Jeep frowns at Charlie. Then they both look ahead."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Off Gabriel's steel breastplate, they are deflected. Into the air, Gabriel is risen, and his mace is swung, crashing it into furniture. A wallop is delivered by Michael. Over Michael's wing, Gabriel leaps and gets swept with a machine pistol. Into the barrel of the gun, the spike in the middle of his mace is shoved by Gabriel. Michael is shot and is blown back against the wall. An attack is launched by Gabriel. Against the wall, the mace is slammed by Gabriel. The shaft of the mace is clutched by Michael. The spiked end is set spinning by Gabriel. Towards Michael's face, it is pushed by him. It is shoved away by Michael, and Gabriel punches him. Gabriel is punched by Michael, the overhead TV is grabbed, and it is hurled at Gabriel. Michael is punched to the floor by Gabriel. By the throat, Michael is grabbed by Gabriel, he is lifted up, and punched. Gabriel is walloped back by Michael and his arm is twisted. Gabriel is flung over and kicked in the face by him. Over a worktop, Michael is forced and pinned down by Gabriel. A hammer is wielded by him. The blow is dodged by Michael. Gabriel spins and slashes across Michael's chest. His ripped shirt is looked down at by Michael. He is punched in the face by Gabriel. With the mace, a lunge is made by Gabriel, but the blow is blocked by Michael. Out of Gabriel's hands, the mace flies. Gabriel is punched and kicked by Michael. On Gabriel's back, he gets, with his arms around his neck. Upwards, Gabriel flies and Michael is battered against the ceiling. His arms are kept tight around Gabriel's neck by Michael. Tight, Michael holds on. The mace is reached down to and picked up by Gabriel. To his side, the mace is held and twisted by Gabriel. A blade shoots out, being stabbed into Michael behind him. Back onto the floor, Michael flops, with his mouth wide open. His arms are outstretched by Michael, eyes wide open, twitching slightly, a bloody wound in his chest. Down at Michael, Gabriel turns and stares. In Gabriel's eyes, tears glisten. Michael's bloody lips twitch. As he expires, his eyes close. Over him, a golden light is spread. Down Gabriel's cheek, a tear runs as he watches. Engulfing Michael, the bright light vanishes, taking him with it. To go, Gabriel is turned. Through the light, Jeep drives, and at him, Charlie turns and looks. Up his arm, black lines and symbols are spread. Through the wrecked diner, Gabriel slowly steps holding his mace. Amongst the wreckage, Bob is laid. His lighter is held out to a gas tap at the base of an oven by him. Up at Gabriel, he looks. A flame is sparked up, igniting the gas. Flames engulf the diner and the possessed outside as Gabriel takes flight. Along a desert highway, Jeep drives. On the passenger seat, Charlie sits, cradling her baby and smiling down at him. At Charlie, Jeep frowns. Then ahead, they both look."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Gabriel's steel breastplate deflects shots. He rises, swinging his mace into furniture. Michael strikes, but Gabriel leaps over him and is hit with a machine pistol. Gabriel jams his mace's spike into the gun barrel. Michael fires, hitting the wall. Gabriel attacks, slamming the mace. Michael grabs it, but Gabriel spins the spiked end toward his face. Michael shoves it away and punches, throwing a TV. Gabriel punches Michael down, grabs his throat, lifts, and punches him. Michael retaliates, twisting Gabriel's arm, flinging him, and kicking his face. Gabriel pins Michael over a worktop and swings a hammer, but Michael dodges. Gabriel spins, slashing Michael's chest. Gabriel lunges with the mace, Michael blocks, and it flies out of Gabriel's hands. Michael punches, kicks, then climbs onto Gabriel's back, choking him. Gabriel flies upward, slamming Michael into the ceiling. Michael holds tight until Gabriel grabs his mace, releasing a blade that stabs Michael. Michael falls, twitching with a chest wound, eventually dying as a golden light envelops him. Tears glisten in Gabriel's eyes as Michael vanishes in the light. Gabriel steps through the wreckage, holding his mace, and finds Bob lighting a gas tap. Flames engulf the diner as Gabriel takes flight. Jeep drives along a desert highway; Charlie sits cradling her baby, smiling at him. Jeep frowns, then they both look ahead."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gabriel's steel breastplate deflects attacks. He rises, swings his mace, and crashes it into furniture. Michael attacks. Gabriel leaps, but Michael's machine pistol catches him. Gabriel jams his mace spike into its barrel. Michael fires, is blown back, and Gabriel attacks, slams the mace, and spins it towards Michael's face. Michael deflects it, punches Gabriel, hurls a TV, and is punched to the floor. Gabriel lifts, punches, and is countered by Michael, who twists his arm, throws him, and kicks his face. Gabriel pins Michael over a worktop, wields a hammer, but Michael dodges. Gabriel spins, slashes Michael's chest, punches him, and misses with the mace. Michael disarms and attacks Gabriel, who flies up, slamming Michael against the ceiling. Gabriel retrieves his mace, twists it, and a blade stabs Michael. Michael falls, twitching with a chest wound. Gabriel tears up as Michael expires, engulfed in golden light. Gabriel watches, then leaves. As a Jeep drives through the light, Gabriel walks through the diner, Bob ignites gas, flames engulf the diner, and Gabriel escapes. Jeep drives on a desert highway, Charlie cradles her baby, smiling, as they both look ahead."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Gabriel, clad in his formidable steel breastplate, stands firm as the projectiles deflect harmlessly off him. With resolute determination, Gabriel ascends into the air, hefting his mighty mace. He swings it forcefully, causing it to crash destructively into the surrounding furniture. Meanwhile, Michael delivers a robust wallop. Demonstrating agility, Gabriel leaps over Michael’s wings, yet finds himself swept aside by the unrelenting fire of a machine pistol. Thinking swiftly, Gabriel thrusts the spiked middle of his mace directly into the barrel of the gun. As Michael fires, the unexpected impact sends him careening backward, colliding with the wall. \n\nGabriel seizes the opportunity to launch a direct attack. With great force, he slams his mace against the hard surface of the wall. Michael, in a desperate maneuver, grips the shaft of the mace tightly. Undeterred, Gabriel sets the spiked end of the mace spinning menacingly, edging it closer to Michael's face. In a reflexive move, Michael shoves it away just in time, but Gabriel counters with a solid punch. Not to be outdone, Michael retaliates with a punch of his own and swiftly grabs a nearby overhead television, hurling it towards Gabriel. Gabriel responds by delivering a punch that sends Michael sprawling to the floor. \n\nIn a show of strength, Gabriel seizes Michael by the throat, hoisting him up effortlessly before delivering another powerful punch. Michael fights back, walloping Gabriel and deftly twisting his arm. Seizing the momentum, he flings Gabriel over and delivers a swift kick to his face. But Gabriel responds with ferocity, forcing Michael over a countertop and pinning him down with determined strength. He raises a hammer high, ready to strike, but Michael dodges the imminent blow. Not missing a beat, Gabriel spins and lands a slash across Michael's chest, tearing through his shirt.\n\nMichael glances down at his damaged shirt and torn skin, but Gabriel follows up with a punch to his face. As Gabriel lunges forward with his mace, Michael blocks the incoming blow, causing the mace to fly out from Gabriel’s grip. Sensing an advantage, Michael punches and kicks Gabriel with fervor. Climbing onto Gabriel’s back, he locks his arms securely around Gabriel’s neck. Despite this, Gabriel, with a burst of strength, flies upwards, battering Michael against the unyielding ceiling. Yet Michael's resolve doesn't falter, clinging tightly around Gabriel's neck. As Michael maintains his hold, Gabriel reaches down, retrieving the mace deftly. With a twist of the mace, a blade shoots out, stabbing Michael from behind. Michael collapses heavily onto the floor, his mouth agape in shock.\n\nMichael's lifeless form lies with arms spread wide, eyes open, twitching slightly, a deep bloody wound evident in his chest. Gabriel turns to face him, his eyes filled with emotion, glistening with unshed tears. Michael’s lips, stained with blood, twitch briefly, and his eyes close gently as he takes his last breath. A radiant golden light envelops him, spreading across his form. A solitary tear escapes Gabriel’s eye, trickling down his cheek as he observes the poignant scene. The brilliant light consumes Michael completely, then vanishes, taking him away from this world. Gabriel turns to walk away. \n\nAs Jeep drives steadily through the light, Charlie glances back at Gabriel with recognition. Intricate black lines and symbols begin to crawl up his arm. Gabriel walks slowly and purposefully through the debris-strewn diner, his trusty mace in hand. He moves behind the counter, where Bob is sprawled amidst the shattered remains. Bob, clutching a lighter, holds it near a gas tap at the base of an oven. He looks up at Gabriel with a resigned expression. With a spark, he ignites a flame, setting off the gas. Gabriel takes flight just as flames rapidly engulf the diner and the possessed outside, incinerating everything in its path.\n\nMeanwhile, Jeep drives along a seemingly endless desert highway. Seated beside him in the passenger seat, Charlie cradles her baby tenderly, gazing down at him with a gentle, loving smile. Jeep, however, wears a frown as he glances at Charlie. After a moment, they both turn their attention back to the road ahead, their thoughts kept to themselves as the journey continues."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Gabriel, adorned in his imposing and formidable steel breastplate, stands unwavering and resolute as the projectiles harmlessly deflect and bounce off him. With a steely determination that is undeniable, Gabriel powerfully ascends into the air, hefting his massive and mighty mace with great strength. He swings it with forceful aggression, causing it to crash destructively into the surrounding furniture, sending debris flying in all directions. Meanwhile, Michael delivers a robust and substantial wallop. Demonstrating impressive agility and quickness, Gabriel leaps deftly over Michael’s expansive wings, yet ultimately finds himself being swept aside by the unrelenting and rapid fire of a machine pistol. Thinking swiftly and with great ingenuity, Gabriel thrusts the spiked middle of his formidable mace directly into the barrel of the gun. As Michael fires, the unexpected impact sends him careening backward, colliding forcefully with the hard wall.\n\nSeizing the opportune moment, Gabriel launches a direct and powerful attack. With tremendous force and intensity, he slams his mace against the unyielding surface of the wall. In a desperate maneuver, Michael grips the shaft of the mace tightly, determined to hold on. Undeterred and unwavering, Gabriel sets the spiked end of the mace spinning menacingly, edging it frighteningly closer to Michael's anxious face. In a reflexive and quick-witted move, Michael shoves it away just in time, but Gabriel counters swiftly with a solid and resounding punch. Not to be outdone or deterred, Michael retaliates with a punch of his own and quickly grabs a nearby overhead television, hurling it with force towards Gabriel. Gabriel responds deftly by delivering a punch that sends Michael sprawling to the floor with a heavy thud.\n\nIn an impressive display of strength and might, Gabriel seizes Michael by the throat, hoisting him up effortlessly before delivering yet another powerful and forceful punch. Michael fights back vigorously, walloping Gabriel and deftly twisting his arm in a skillful move. Seizing the momentum, he flings Gabriel over and delivers a swift, precise kick directly to his face. But Gabriel responds with intense ferocity, forcing Michael over a nearby countertop and pinning him down with determined strength and resolve. He raises a heavy hammer high, ready to strike with intent, but Michael dodges the imminent, threatening blow. Not missing a beat, Gabriel spins and lands a slash across Michael's chest, tearing through his shirt and drawing blood.\n\nMichael glances down at his damaged, torn shirt and the exposed, injured skin, but before he can react, Gabriel follows up with a direct punch to his face. As Gabriel lunges forward with his mace in an aggressive attack, Michael blocks the incoming blow skillfully, causing the mace to fly out from Gabriel’s grip. Sensing a newfound advantage, Michael punches and kicks Gabriel with fervent energy. Climbing onto Gabriel’s back, he locks his arms securely around Gabriel’s neck, holding on tightly. Despite this, Gabriel, with a powerful burst of strength and determination, flies upwards, battering Michael repeatedly against the unyielding ceiling. Yet Michael's resolve does not falter, he clings tightly around Gabriel's neck, refusing to let go. As Michael maintains his strong hold, Gabriel reaches down, retrieving the mace deftly and with precision. With a twist of the mace, a sharp blade unexpectedly shoots out, stabbing Michael from behind. Michael collapses heavily onto the floor, his mouth agape in shock and disbelief.\n\nMichael's lifeless form lies on the floor with arms spread wide, eyes open, twitching slightly, with a deep and bloody wound evident in his chest. Gabriel turns slowly to face him, his eyes filled with a mix of emotion, glistening with unshed tears. Michael’s lips, stained with blood, twitch briefly, and his eyes close gently as he takes his final, last breath. A radiant and golden light begins to envelop him, spreading slowly across his entire form. A solitary tear escapes from Gabriel’s eye, trickling slowly down his cheek as he observes the poignant and bittersweet scene unfolding before him. The brilliant, glowing light consumes Michael completely, then vanishes, taking him away from this world forever. Gabriel turns solemnly to walk away.\n\nAs the Jeep drives steadily through the glowing light, Charlie glances back at Gabriel with a look of recognition. Intricate black lines and symbols begin to creep up his arm, marking him. Gabriel walks slowly and with a purposeful stride through the debris-strewn and chaotic diner, his trusty mace firmly in hand. He moves behind the counter, where Bob is sprawled amidst the shattered remains and chaotic mess. Bob, clutching a lighter with steady hands, holds it near a gas tap located at the base of an oven. He looks up at Gabriel with a resigned and accepting expression. With a spark, he ignites a flame, setting off the gas in a fiery explosion. Gabriel takes flight just as flames rapidly engulf the entire diner and the possessed outside, incinerating everything and leaving destruction in its path.\n\nMeanwhile, the Jeep continues its journey along the seemingly endless and barren desert highway. Seated beside him in the passenger seat, Charlie cradles her baby tenderly, gazing down lovingly at him with a gentle and affectionate smile. Jeep, however, wears a frown as he glances cautiously at Charlie. After a brief moment of contemplation, they both turn their attention back to the open road ahead, their thoughts kept to themselves as the journey unfolds and continues."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The deflection of the projectiles off Gabriel's steel breastplate creates a sharp, metallic sound as they ricochet away. With a powerful beat of his wings, Gabriel elevates himself into the air, his eyes fixed on his target. Gripping his mace tightly, he swings it with force, sending it crashing into the surrounding furniture, splintering wood and scattering debris. Meanwhile, Michael, moving with swift precision, launches a forceful strike. In an acrobatic display, Gabriel leaps agilely over Michael's wing, but in doing so, finds himself caught off guard as he is swept by a burst from a machine pistol. Thinking quickly, Gabriel thrusts the spike protruding from the middle of his mace directly into the barrel of the firearm. In a reflexive squeeze of the trigger, Michael's weapon discharges, but the impact sends him reeling backward, slamming against the wall. Seizing the moment, Gabriel advances with intent, his mace striking against the wall with a resounding thud, causing fragments to rain down. Michael reaches out, desperately clutching the shaft of the mace in an attempt to wrest control. Not missing a beat, Gabriel sets the spiked end spinning, creating a dangerous whirring sound, and pushes it menacingly towards Michael's face. In a quick reaction, Michael shoves the deadly point away, only to be met with a swift punch from Gabriel, hitting him squarely. Responding in kind, Michael delivers a retaliatory punch to Gabriel, then grabs the overhead TV with both hands, hurling it in Gabriel's direction. Gabriel deftly counters with a punch, sending Michael sprawling to the floor. With a firm grip, Gabriel seizes Michael by the throat, lifting him off the ground effortlessly before landing another punch. Exhibiting fighting prowess, Michael retaliates with a powerful blow, twisting Gabriel’s arm skillfully and using the momentum to fling him over. Not stopping there, Michael executes a swift kick to Gabriel's face. Regaining control, Gabriel forces Michael onto a worktop, pinning him down as he brandishes a hammer with intent. Michael narrowly evades the incoming blow by dodging. Recovering quickly, Gabriel spins with the mace and slices across Michael's chest, ripping his shirt. Michael glances down at the tattered fabric, the reality of the situation sinking in, just before Gabriel delivers a punch to his face. With determination, Gabriel lunges forward with the mace; however, Michael intercepts the attack, blocking the blow effectively. The momentum causes the mace to slip from Gabriel’s grasp, flying out of his hands. Undeterred, Michael launches a series of punches and kicks, driving into Gabriel with relentless force. He ascends onto Gabriel's back, wrapping his arms tightly around Gabriel's neck in a vice-like grip. In a desperate maneuver, Gabriel flies upwards, attempting to shake Michael off, and ruthlessly batters him against the ceiling. Despite the relentless assault, Michael maintains his grip, holding on with unwavering tenacity. In a strategic move, Gabriel reaches down, retrieving the fallen mace, and holds it at his side. With a deft twist, a hidden blade projects from the weapon, stabbing Michael with precision. Michael falls back onto the floor, his mouth agape and eyes wide, the pain evident as he lies there, arms outstretched and eyes wide open, twitching slightly with a fresh, bloody wound in his chest. Gabriel stands over him, and a deep sadness washes over him as he gazes down at his fallen opponent. Tears form in Gabriel's eyes, sparkling with emotion. Michael’s lips, stained with blood, twitch as his eyes slowly close, marking the end of his struggle. A mystical golden light begins to spread over Michael, enveloping him in a gentle, radiant glow. Gabriel, overwhelmed by the moment, feels a tear escape down his cheek. The light grows brighter, consuming Michael entirely before disappearing, taking him with it in a final act of departure. With a heavy heart, Gabriel turns away, prepared to leave the scene. As the Jeep drives through the lingering light, Charlie turns, casting a glance at Gabriel. Mysterious black lines and symbols start to spread ominously up Charlie's arm. With deliberate steps, Gabriel walks slowly through the chaos of the wrecked diner, the remnants of his mace firmly in hand. He proceeds behind the counter, where Bob lies amidst the rubble and debris. Bob, with a determined look, extends his lighter towards a gas tap at the oven's base. As Gabriel approaches, Bob meets his gaze before igniting the lighter, the small spark setting the gas ablaze. In a split second, Gabriel takes flight, soaring upwards just as the flames engulf the diner, consuming everything inside and the possessed outside in a fiery inferno. Meanwhile, Jeep navigates along a desolate desert highway, the vast expanse stretching endlessly ahead. In the passenger seat, Charlie cradles her baby tenderly, smiling down with a mother's warmth as she strokes the child's small features. Jeep, seated beside her, casts a concerned glance in her direction, the weight of recent events heavy on his mind. In silent agreement, they both shift their gaze forward, facing the uncertain road that lies ahead."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gabriel's steel breastplate deflects the attacks as he rises into the air, wielding his mace to destroy furniture. During their intense battle, Gabriel and Michael exchange a series of physical blows, using both their surroundings and weapons. Gabriel attempts to overpower Michael by integrating his mace's spike with Michael's gun, causing Michael to be blown back. As the fight intensifies, they grapple fiercely, with Gabriel pinning Michael down and slashing his chest. Despite Michael's defensive maneuvers, Gabriel retrieves his mace, activates a hidden blade, and incapacitates Michael. Gabriel watches with tear-filled eyes as a golden light engulfs and vanishes with Michael, signaling the end of their conflict. Gabriel then moves through the wreckage of the diner, witnessing Bob light a gas flame, which engulfs the diner in flames. Gabriel takes flight just as the inferno consumes the surroundings. Meanwhile, Jeep drives along a desert highway; Charlie, sitting beside him and cradling her baby, exchanges a look with Jeep before they both focus ahead."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The deflected bullets off Gabriel's steel breastplate, crafted in an ancient forge known for imbuing armor with near-indestructible properties, mark the beginning of the struggle. Gabriel, with a determined gaze, rises into the air and swings his mace, a weapon weighted for maximum force, crashing it into furniture that once adorned the grand hall now reduced to chaos. Michael, known for his tactical prowess in battle, wallops back. Gabriel deftly leaps over his opponent's wing, but is swept by Michael wielding a machine pistol, a weapon common among modern soldiers for its rapid-fire ability. Gabriel shoves the spike in the middle of his mace, a relic said to pierce even the toughest defenses, into the barrel of the gun. Michael shoots, the recoil sending him against the wall with a forceful impact. Gabriel, relentless in his assault, attacks again, slamming the mace against the wall with enough force to leave a dent. Michael clutches the shaft of the ancient mace as Gabriel sets the spiked end spinning, a maneuver perfected over countless battles. He pushes it towards Michael's face, aiming for a decisive strike. Michael shoves it away, quickly countering as Gabriel punches him. In retaliation, Michael punches Gabriel and grabs the overhead TV, once a source of news and entertainment, hurling it at his adversary with substantial force. Gabriel punches Michael to the floor, demonstrating his superior strength. Gabriel grabs Michael by the throat, lifts him up effortlessly, and punches him again. Michael, not to be outdone, wallops him back, twisting Gabriel’s arm with a move often used in grappling art. He flings Gabriel over and kicks him in the face, using impressive martial skill. Gabriel forces Michael over a worktop once used for preparing meals and pins him down. He wields a hammer, an improvised weapon found in the chaotic environment. Michael dodges the blow with agility. Gabriel spins and slashes Michael across the chest with a motion honed for close-quarters combat. Michael looks down at his ripped shirt, now a testament to the fierce struggle. Gabriel punches him in the face, pressing his advantage. Gabriel lunges with the mace, a symbol of ancient power, but Michael blocks the blow expertly. The mace flies out of Gabriel's hands, clattering to the floor. Michael punches and kicks Gabriel, demonstrating his resilience. He gets on Gabriel's back, clutching his arms around his neck, trying to subdue the powerful figure. Gabriel, despite the weight, flies upwards and batters Michael against the ceiling, a skillful use of his supernatural abilities. Michael holds on tight, refusing to let go. Gabriel reaches down and picks up the mace again, its familiar weight reassuring in his grip. He holds the mace to his side and twists it, activating a hidden mechanism. A blade swiftly shoots out, stabbing Michael from behind with precision. Michael falls back onto the floor, his mouth wide open in shock. He lies with his arms outstretched, eyes wide open and twitching slightly, a grievous wound in his chest. Gabriel turns, a mix of triumph and sorrow in his eyes, and stares down at Michael. Tears glisten in Gabriel's eyes, reflecting the light of battle. Michael's bloody lips twitch as if attempting to speak, but his eyes close as he expires. A golden light spreads over Michael, believed to be a passage to the afterlife. A tear runs down Gabriel's cheek as he watches, a rare display of emotion for the warrior. The bright light engulfs Michael, then vanishes, taking him to a realm beyond, leaving only the memory of his existence. Gabriel turns to go, contemplating the weight of his actions. As Jeep drives through the light, a spectral realm separating worlds, Charlie turns and looks at him, a silent exchange taking place. Black lines and symbols, a mark of destiny, spread up his arm. Gabriel slowly steps through the wrecked diner, once a bustling focal point of the community, holding his mace. He goes behind the counter where Bob lies among the wreckage, a defiant figure amidst the ruins. Bob holds his lighter, a simple but effective tool of destruction, out to a gas tap at the base of an oven. He looks up at Gabriel, determination in his eyes. He sparks up a flame, igniting the gas with a final act of defiance. Gabriel takes flight as flames engulf the diner and the possessed outside, a cleansing fire leaving nothing but ash. Jeep drives along a desert highway, a long stretch of road symbolizing freedom and escape. Charlie sits in the passenger seat, cradling her baby, a symbol of hope and new beginnings, and smiling down at him with maternal affection. Jeep frowns at Charlie, his expression a mix of concern and determination. Then they both look ahead, ready to face whatever the future may hold."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "They deflect off Gabriel's steel breastplate. Gabriel rises into the air and swings his mace crashing it into furniture. Michael wallops. Gabriel leaps over his wing and gets swept with a machine pistol. Gabriel shoves the spike in the middle of his mace into the barrel of the gun. Michael shoots and is blown back against the wall. Gabriel attacks. Gabriel slams the mace against the wall. Michael clutches the shaft of the mace. Gabriel sets the spiked end spinning. He pushes it towards Michael's face. Michael shoves it away and Gabriel punches him. Michael punches. Gabriel grabs the overhead TV and hurls it at Gabriel. Gabriel punches Michael to the floor. Gabriel grabs Michael by the throat lifts him up and punches him. Michael wallops him back and twists his arm. He flings Gabriel over and kicks him in the face. Gabriel forces Michael over a worktop and pins him down. He wields a hammer. Michael dodges the blow. Gabriel spins and slashes Michael across the chest. Michael looks down at his ripped shirt. Gabriel punches him in the face. Gabriel lunges with the mace but Michael blocks the blow. The mace flies out of Gabriel's hands. Michael punches and kicks Gabriel. He gets on Gabriel's back with his arms around his neck. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Gabriel flies upwards and batters Michael against the ceiling. Michael keeps his arms held tight around Gabriel's neck. Michael holds on tight. Gabriel reaches down and picks up the mace. Gabriel holds the mace to his side and twists it. A blade shoots out stabbing Michael behind him. Michael flops back onto the floor his mouth wide open. Michael lies with his arms outstretched eyes wide open twitching slightly. a bloody wound in his chest. Gabriel turns and stares down at Michael. Tears glisten in Gabriel's eyes. Michael's bloody lips twitch. His eyes close as he expires. A golden light spreads over him. A tear runs down Gabriel's cheek as he watches. The bright light engulfs Michael then vanishes taking him with it. Gabriel turns to go. As Jeep drives through the light Charlie turns and looks at him. Black lines and symbols spread up his arm. Gabriel slowly steps through the wrecked diner holding his mace. He goes behind the counter where Bob is laying amongst the wreckage. Bob holds his lighter out to a gas tap at the base of an oven. He looks up at Gabriel. He sparks up a flame igniting the gas. Gabriel takes flight as flames engulf the diner and the possessed outside Jeep drives along a desert highway. Charlie sits on the passenger seat cradling her baby and smiling down at him. Jeep frowns at Charlie. Then they both look ahead."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "They deflect off Gabriel's steel breastplate. Gabriel rises into the air and swings his mace crashing it into furniture. Michael wallops. Gabriel leaps over his wing and gets swept with a machine pistol. Gabriel shoves the spike in the middle of his mace into the barrel of the gun. Michael shoots and is blown back against the wall. Gabriel attacks. Gabriel slams the mace against the wall. Michael clutches the shaft of the mace. Gabriel sets the spiked end spinning. He pushes it towards Michael's face. Michael shoves it away and Gabriel punches him. Michael punches. Gabriel grabs the overhead TV and hurls it at Gabriel. Gabriel punches Michael to the floor. Gabriel grabs Michael by the throat lifts him up and punches him. Michael wallops him back and twists his arm. He flings Gabriel over and kicks him in the face. Gabriel forces Michael over a worktop and pins him down. He wields a hammer. Michael dodges the blow. Gabriel spins and slashes Michael across the chest. Michael looks down at his ripped shirt. Gabriel punches him in the face. Gabriel lunges with the mace but Michael blocks the blow. The mace flies out of Gabriel's hands. Michael punches and kicks Gabriel. He gets on Gabriel's back with his arms around his neck. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Gabriel flies upwards and batters Michael against the ceiling. Michael keeps his arms held tight around Gabriel's neck. Michael holds on tight. Gabriel reaches down and picks up the mace. Gabriel holds the mace to his side and twists it. A blade shoots out stabbing Michael behind him. Michael flops back onto the floor his mouth wide open. Michael lies with his arms outstretched eyes wide open twitching slightly. a bloody wound in his chest. Gabriel turns and stares down at Michael. Tears glisten in Gabriel's eyes. Michael's bloody lips twitch. His eyes close as he expires. A golden light spreads over him. A tear runs down Gabriel's cheek as he watches. The bright light engulfs Michael then vanishes taking him with it. Gabriel turns to go. As Jeep drives through the light Charlie turns and looks at him. Black lines and symbols spread up his arm. Gabriel slowly steps through the wrecked diner holding his mace. He goes behind the counter where Bob is laying amongst the wreckage. Bob holds his lighter out to a gas tap at the base of an oven. He looks up at Gabriel. He sparks up a flame igniting the gas. Gabriel takes flight as flames engulf the diner and the possessed outside Jeep drives along a desert highway. Charlie sits on the passenger seat cradling her baby and smiling down at him. Jeep frowns at Charlie. Then they both look ahead."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "They deflect off Gabriel's steel breastplate. Gabriel rises into the air and swings his mace crashing it into furniture. Michael wallops. Gabriel leaps over his wing and gets swept with a machine pistol. Gabriel shoves the spike in the middle of his mace into the barrel of the gun. Michael shoots and is blown back against the wall. Gabriel attacks. Gabriel slams the mace against the wall. Michael clutches the shaft of the mace. Gabriel sets the spiked end spinning. He pushes it towards Michael's face. Michael shoves it away and Gabriel punches him. Michael punches. Gabriel grabs the overhead TV and hurls it at Gabriel. A tear runs down Gabriel's cheek as he watches. The bright light engulfs Michael then vanishes taking him with it. Gabriel turns to go. As Jeep drives through the light Charlie turns and looks at him. Black lines and symbols spread up his arm. Gabriel slowly steps through the wrecked diner holding his mace. He goes behind the counter where Bob is laying amongst the wreckage. Bob holds his lighter out to a gas tap at the base of an oven. He looks up at Gabriel. He sparks up a flame igniting the gas. Gabriel takes flight as flames engulf the diner and the possessed outside Jeep drives along a desert highway. Charlie sits on the passenger seat cradling her baby and smiling down at him. Jeep frowns at Charlie. Then they both look ahead."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "They deflect off Gabriel's steel breastplate. Gabriel rises into the air and swings his mace crashing it into furniture. Michael wallops. Gabriel leaps over his wing and gets swept with a machine pistol. Gabriel shoves the spike in the middle of his mace into the barrel of the gun. Michael shoots and is blown back against the wall. He looks up at Gabriel. He sparks up a flame igniting the gas. Gabriel takes flight as flames engulf the diner and the possessed outside Jeep drives along a desert highway. Charlie sits on the passenger seat cradling her baby and smiling down at him. Jeep frowns at Charlie. Then they both look ahead."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "They bounce off Fiona's wooden armor. Fiona descends into the ground and juggles her trumpet, smashing it into pillows. Edgar giggles. Fiona crawls under his armchair and gets tangled with a rubber band. Fiona wedges the button in the center of her trumpet into the cover of the notebook. Edgar scribbles and is tossed against the sofa. Fiona dances. Fiona tosses the trumpet against the window. Edgar hugs the handle of the trumpet. Fiona sets the buttoned end rotating. She rolls it towards Edgar's nose. Edgar flicks it aside, and Fiona tickles him. Edgar tickles Fiona, grabs the hanging lamp, and flings it at Fiona. Fiona tickles Edgar to the carpet. Fiona tugs Edgar by the elbow, props him up, and tickles him. Edgar giggles back and bends her wrist. He tosses Fiona over and taps her on the chin. Fiona nudges Edgar over a stool and holds him steady. She brandishes a spoon. Edgar dodges the swoosh. Fiona twirls and brushes Edgar across the sleeve. Edgar glances down at his wrinkled jacket. Fiona tickles him on the chin. Fiona dashes with the trumpet, but Edgar deflects the swoosh. The trumpet flips out of Fiona's grip. Edgar tickles and nudges Fiona. He climbs on Fiona's shoulders, with his hands around her collar. Fiona burrows downwards and squishes Edgar against the floor. Edgar keeps his hands clasped firmly around Fiona's collar. Edgar maintains his grip. Fiona reaches up and picks up the trumpet. Fiona holds the trumpet to her chest and twists it. A whistle pops out, nudging Edgar beside him. Edgar floats up onto the couch, his mouth wide shut. Edgar rests with his legs folded, eyes wide shut, twitching faintly, a colorful patch on his sleeve. Fiona turns and peers down at Edgar. Raindrops glisten in Fiona's eyes. Edgar's colorful smile stretches. His eyes close as he dreams. A silver light dances over him. A raindrop rolls down Fiona's cheek as she gazes. The soft light envelops Edgar, then disappears taking him along. Fiona turns to dance. As Bicycle rolls through the light, Alex turns and peers at her. Blue swirls and loops curl up her sleeve. Fiona gracefully skips through the bustling market clutching her trumpet. She circles behind the stall where Jim is lounging amongst the scraps. Jim extends his flashlight towards a paintbrush at the edge of a cushion. He glances up at Fiona. He flicks on a twinkle, dazzling the paintbrush. Fiona leaps as sparkles engulf the market and the onlookers nearby. Bicycle rolls along a mountain pathway. Alex reclines on the back seat, cradling her kitten and humming down at it. Bicycle frowns at Alex. Then they both gaze forward."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gabriel, wearing a steel breastplate, battles Michael in a fierce fight. Gabriel rises into the air, swinging his mace, while Michael counters with a machine pistol. Gabriel manages to disable Michael's gun and launches a series of attacks. Michael fights back, using an overhead TV and delivering punches and kicks. Gabriel lifts Michael and slams him down, attempting to strike with a hammer, but Michael dodges. The fight continues until Michael gets a hold of Gabriel, who then rams him into the ceiling. Gabriel retrieves his mace, activates a blade, and stabs Michael. Michael falls, wounded, and as a golden light engulfs him, Gabriel watches in tears. The light takes Michael away, and Gabriel leaves the scene. Meanwhile, Jeep and Charlie drive through the aftermath, with Charlie cradling her baby. Gabriel exits the diner just as flames, ignited by Bob, consume it. Jeep and Charlie continue their journey on a desert highway, looking ahead."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Then they both look ahead Jeep frowns at Charlie Charlie sits on the passenger seat cradling her baby and smiling down at him Gabriel takes flight as flames engulf the diner and the possessed outside Jeep drives along a desert highway He sparks up a flame igniting the gas He looks up at Gabriel Bob holds his lighter out to a gas tap at the base of an oven He goes behind the counter where Bob is laying amongst the wreckage Gabriel slowly steps through the wrecked diner holding his mace Black lines and symbols spread up his arm As Jeep drives through the light Charlie turns and looks at him Gabriel turns to go The bright light engulfs Michael then vanishes taking him with it A tear runs down Gabriel's cheek as he watches A golden light spreads over him His eyes close as he expires Michael's bloody lips twitch Tears glisten in Gabriel's eyes Gabriel turns and stares down at Michael a bloody wound in his chest Michael lies with his arms outstretched eyes wide open twitching slightly Michael flops back onto the floor his mouth wide open A blade shoots out stabbing Michael behind him Gabriel holds the mace to his side and twists it Gabriel reaches down and picks up the mace Michael holds on tight Michael keeps his arms held tight around Gabriel's neck Gabriel flies upwards and batters Michael against the ceiling He gets on Gabriel's back with his arms around his neck Michael punches and kicks Gabriel The mace flies out of Gabriel's hands Gabriel lunges with the mace but Michael blocks the blow Gabriel punches him in the face Michael looks down at his ripped shirt Gabriel spins and slashes Michael across the chest Michael dodges the blow He wields a hammer Gabriel forces Michael over a worktop and pins him down He flings Gabriel over and kicks him in the face Michael wallops him back and twists his arm Gabriel grabs Michael by the throat lifts him up and punches him Gabriel punches Michael to the floor Gabriel grabs the overhead TV and hurls it at Gabriel Michael punches Michael shoves it away and Gabriel punches him He pushes it towards Michael's face Gabriel sets the spiked end spinning Michael clutches the shaft of the mace Gabriel slams the mace against the wall Gabriel attacks Michael shoots and is blown back against the wall Gabriel shoves the spike in the middle of his mace into the barrel of the gun Gabriel leaps over his wing and gets swept with a machine pistol Michael wallops Gabriel rises into the air and swings his mace crashing it into furniture They deflect off Gabriel's steel breastplate"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Gabriel rises into the air and swings his mace crashing it into furniture They deflect off Gabriel's steel breastplate Gabriel leaps over his wing and gets swept with a machine pistol Michael wallops Michael shoots and is blown back against the wall Gabriel shoves the spike in the middle of his mace into the barrel of the gun Gabriel slams the mace against the wall Gabriel attacks Gabriel sets the spiked end spinning Michael clutches the shaft of the mace Michael shoves it away and Gabriel punches him He pushes it towards Michael's face Gabriel grabs the overhead TV and hurls it at Gabriel Michael punches Gabriel grabs Michael by the throat lifts him up and punches him Gabriel punches Michael to the floor He flings Gabriel over and kicks him in the face Michael wallops him back and twists his arm He wields a hammer Gabriel forces Michael over a worktop and pins him down Gabriel spins and slashes Michael across the chest Michael dodges the blow Gabriel punches him in the face Michael looks down at his ripped shirt The mace flies out of Gabriel's hands Gabriel lunges with the mace but Michael blocks the blow He gets on Gabriel's back with his arms around his neck Michael punches and kicks Gabriel Michael keeps his arms held tight around Gabriel's neck Gabriel flies upwards and batters Michael against the ceiling Gabriel reaches down and picks up the mace Michael holds on tight A blade shoots out stabbing Michael behind him Gabriel holds the mace to his side and twists it Michael lies with his arms outstretched eyes wide open twitching slightly Michael flops back onto the floor his mouth wide open Gabriel turns and stares down at Michael a bloody wound in his chest Michael's bloody lips twitch Tears glisten in Gabriel's eyes A golden light spreads over him His eyes close as he expires The bright light engulfs Michael then vanishes taking him with it A tear runs down Gabriel's cheek as he watches As Jeep drives through the light Charlie turns and looks at him Gabriel turns to go Gabriel slowly steps through the wrecked diner holding his mace Black lines and symbols spread up his arm Bob holds his lighter out to a gas tap at the base of an oven He goes behind the counter where Bob is laying amongst the wreckage He sparks up a flame igniting the gas He looks up at Gabriel Charlie sits on the passenger seat cradling her baby and smiling down at him Gabriel takes flight as flames engulf the diner and the possessed outside Jeep drives along a desert highway Then they both look ahead Jeep frowns at Charlie"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Gabriel flies upwards and batters Michael against the ceiling Michael keeps his arms held tight around Gabriel's neck Michael holds on tight Gabriel reaches down and picks up the mace Gabriel holds the mace to his side and twists it A blade shoots out stabbing Michael behind him Michael flops back onto the floor his mouth wide open Michael lies with his arms outstretched eyes wide open twitching slightly a bloody wound in his chest Gabriel turns and stares down at Michael Tears glisten in Gabriel's eyes Michael's bloody lips twitch His eyes close as he expires A golden light spreads over him A tear runs down Gabriel's cheek as he watches The bright light engulfs Michael then vanishes taking him with it Gabriel turns to go As Jeep drives through the light Charlie turns and looks at him Black lines and symbols spread up his arm Gabriel slowly steps through the wrecked diner holding his mace He goes behind the counter where Bob is laying amongst the wreckage Bob holds his lighter out to a gas tap at the base of an oven He looks up at Gabriel He sparks up a flame igniting the gas Gabriel takes flight as flames engulf the diner and the possessed outside Jeep drives along a desert highway Charlie sits on the passenger seat cradling her baby and smiling down at him Jeep frowns at Charlie Then they both look ahead They deflect off Gabriel's steel breastplate Gabriel rises into the air and swings his mace crashing it into furniture Michael wallops Gabriel leaps over his wing and gets swept with a machine pistol Gabriel shoves the spike in the middle of his mace into the barrel of the gun Michael shoots and is blown back against the wall Gabriel attacks Gabriel slams the mace against the wall Michael clutches the shaft of the mace Gabriel sets the spiked end spinning He pushes it towards Michael's face Michael shoves it away and Gabriel punches him Michael punches Gabriel grabs the overhead TV and hurls it at Gabriel Gabriel punches Michael to the floor Gabriel grabs Michael by the throat lifts him up and punches him Michael wallops him back and twists his arm He flings Gabriel over and kicks him in the face Gabriel forces Michael over a worktop and pins him down He wields a hammer Michael dodges the blow Gabriel spins and slashes Michael across the chest Michael looks down at his ripped shirt Gabriel punches him in the face Gabriel lunges with the mace but Michael blocks the blow The mace flies out of Gabriel's hands Michael punches and kicks Gabriel He gets on Gabriel's back with his arms around his neck"
        }
      ]
    }
  ]
}