{
  "ground_truth": "They pass a sign. The back window shatters as Gabriel lands on the roof, ripping the lights off and punching the roof with his fists. Jeep shoots up at it, and Gabriel falls but clings onto the back. Jeep shoots at Gabriel, and the car swerves, causing Gabriel to knock over his hand, making the flare go off in the car. Gabriel tries to hold himself in the back window, grabs Audrey's arm, and punches her. He grabs Jeep's gun arm, and Jeep tries to fight him off. Charlie keeps hold of her baby while Gabriel clamps his hand over Jeep's eyes. Jeep puts his foot down, and the car swerves all over the road. Audrey grabs Gabriel around the throat as the speedometer creeps past 90 and hits 110. Jeep slams on the brakes, and Gabriel hurtles out of the front window, tumbling onto the road. The car leaves the road, hits a hump, and rolls into a ditch, landing on its roof. Jeep is upside down in his seat with his head pressed against the roof while Charlie manages to get out. Jeep struggles to get out of the car and stands up next to Charlie, who shakes her head and supports him. Jeep and Charlie, holding the baby, climb up a steep hill, struggling for handholds as the gradient increases. Jeep looks up in the sky as Gabriel swoops down out of the light sky and lands just in front of Jeep, knocking him cold with a single punch. Charlie tries to run but finds herself on the edge of a cliff top as Gabriel turns to her and holds his hand out. She looks at the baby and shakes her head while Gabriel eyes her steadily. Jeep leaps on Gabriel's back and they fall over the cliff, landing on the ground below. Gabriel tosses Jeep aside and draws a knife as he advances on him. Jeep stares up at Gabriel, who towers over him with the knife ready. As Gabriel raises the knife to strike, Michael descends from the heavens in a dazzling ray of light. Gabriel looks down, then his face contorts in anger, and he lunges at Michael with the knife. Michael hacks him with his sword, causing Gabriel to drop the knife and fall to his knees as gouts of blood drip off Michael's sword. Jeep sits up as Michael steps over to Gabriel, placing the tip of his sword on Gabriel's chin. Michael stares at Gabriel but doesn't move, then shakes his head, lowers the sword, and steps away. Gabriel gets to his feet, looks down, spreads his wings, and takes off. Michael turns to Jeep, who gets up.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "They proceed a symbol. The rear pane shatters as Gabriel alights on the covering, tearing the lamps off and striking the covering with his hands. Jeep fires up at it, and Gabriel tumbles but grips onto the rear. Jeep fires at Gabriel, and the vehicle veers, causing Gabriel to knock over his hand, making the flare go off in the vehicle. Gabriel attempts to hold himself in the rear pane, seizes Audrey's limb, and strikes her. He seizes Jeep's firearm limb, and Jeep attempts to fight him off. Charlie grips her infant while Gabriel clamps his hand over Jeep's eyes. Jeep puts his foot down, and the vehicle veers all over the avenue. Audrey seizes Gabriel around the neck as the speedometer creeps past ninety and touches one hundred ten. Jeep slams on the brakes, and Gabriel hurtles out of the front pane, tumbling onto the avenue. The vehicle leaves the avenue, hits a bump, and rolls into a trench, landing on its covering. Jeep is upside down in his seat with his head pressed against the covering while Charlie manages to get out. Jeep struggles to get out of the vehicle and stands up next to Charlie, who shakes her head and supports him. Jeep and Charlie, holding the infant, climb up a steep incline, struggling for handholds as the gradient increases. Jeep looks up in the sky as Gabriel swoops down out of the bright sky and lands just in front of Jeep, knocking him unconscious with a single punch. Charlie attempts to flee but finds herself on the edge of a precipice as Gabriel turns to her and extends his hand out. She looks at the infant and shakes her head while Gabriel gazes her steadily. Jeep jumps on Gabriel's back and they fall over the precipice, landing on the ground below. Gabriel tosses Jeep aside and draws a dagger as he advances on him. Jeep stares up at Gabriel, who towers over him with the dagger ready. As Gabriel raises the blade to strike, Michael descends from the heavens in a brilliant ray of radiance. Gabriel looks down, then his face contorts in fury, and he lunges at Michael with the blade. Michael hacks him with his saber, causing Gabriel to drop the blade and fall to his knees as gouts of blood drip off Michael's saber. Jeep sits up as Michael steps over to Gabriel, placing the tip of his saber on Gabriel's chin. Michael stares at Gabriel but doesn't move, then shakes his head, lowers the saber, and steps away. Gabriel gets to his feet, looks down, spreads his wings, and takes off. Michael turns to Jeep, who gets up."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A sign is passed by them. The back window is shattered when Gabriel lands on the roof, ripping the lights off and punching the roof with his fists. A shot is fired by Jeep at it, and Gabriel falls but clings onto the back. Jeep shoots at Gabriel, causing the car to swerve, which makes Gabriel knock over his hand, setting off the flare in the car. Gabriel, trying to hold himself in the back window, grabs Audrey's arm and punches her. Jeep's gun arm is grabbed by him, and Jeep tries to fight him off. The baby is kept hold of by Charlie while Jeep's eyes are clamped over by Gabriel's hand. The car is swerved all over the road when Jeep puts his foot down. Gabriel is grabbed around the throat by Audrey as the speedometer creeps past 90 and hits 110. The brakes are slammed on by Jeep, and Gabriel is hurtled out of the front window, tumbling onto the road. The road is left by the car, which hits a hump and rolls into a ditch, landing on its roof. Upside down in his seat with his head pressed against the roof is Jeep while Charlie manages to get out. The car is struggled out of by Jeep, and he stands up next to Charlie, who shakes her head and supports him. A steep hill is climbed up by Jeep and Charlie, holding the baby, as they struggle for handholds while the gradient increases. The sky is looked up into by Jeep as Gabriel swoops down out of the light sky and lands just in front of Jeep, who is knocked cold with a single punch. Running is tried by Charlie, but she finds herself on the edge of a cliff top as Gabriel turns to her and holds his hand out. The baby is looked at by her, and she shakes her head while Gabriel eyes her steadily. Gabriel is leaped on by Jeep, and they fall over the cliff, landing on the ground below. Jeep is tossed aside by Gabriel, who draws a knife as he advances on him. Gabriel, towering over Jeep with the knife ready, is stared up at by Jeep. As the knife is raised by Gabriel to strike, Michael descends from the heavens in a dazzling ray of light. The look is taken down by Gabriel, then his face contorts in anger, and he lunges at Michael with the knife. Gabriel is hacked by Michael with his sword, causing Gabriel to drop the knife and fall to his knees as gouts of blood drip off Michael's sword. Jeep sits up as Michael steps over to Gabriel, placing the tip of his sword on Gabriel's chin. Gabriel is stared at by Michael, but he doesn't move, then he shakes his head, lowers the sword, and steps away. Gabriel, looking down, gets to his feet, spreads his wings, and takes off. Jeep is turned to by Michael, who gets up."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "They pass a sign, and the back window shatters as Gabriel lands on the roof, tearing off the lights and punching it. Jeep shoots at him, causing Gabriel to cling to the back. The car swerves, making Gabriel knock over his hand, igniting a flare inside. Gabriel grabs Audrey's arm and punches her, then seizes Jeep's gun arm. Charlie holds her baby while Gabriel covers Jeep's eyes. Jeep accelerates, causing the car to swerve. Audrey chokes Gabriel as the speedometer hits 110. Jeep brakes hard, sending Gabriel through the front window. The car veers off the road, rolls into a ditch, and lands upside down. Jeep is trapped, but Charlie escapes and helps him out. They climb a steep hill with the baby. Gabriel swoops down, knocks Jeep out, and confronts Charlie at a cliff's edge. Jeep tackles Gabriel, and they fall over the cliff. Gabriel throws Jeep aside and advances with a knife. As Gabriel prepares to strike, Michael descends in a ray of light. Gabriel lunges at Michael, who strikes him with a sword, causing Gabriel to drop the knife. Michael places his sword on Gabriel's chin, then steps away. Gabriel stands, spreads his wings, and flies off. Michael turns to Jeep, who rises."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "They pass a sign. Gabriel lands on the roof, shattering the back window, ripping off lights, and punching the roof. Jeep shoots at him, causing Gabriel to cling to the back. The car swerves, making Gabriel knock over his hand, igniting a flare. Gabriel grabs Audrey's arm, punches her, and seizes Jeep's gun arm. Charlie holds her baby as Gabriel covers Jeep's eyes. Jeep accelerates, swerving, while Audrey chokes Gabriel as the speedometer hits 110. Jeep brakes, sending Gabriel through the front window. The car rolls into a ditch, landing upside down. Jeep struggles out, supported by Charlie. They climb a steep hill, but Gabriel swoops down, knocking Jeep out. Charlie, at a cliff's edge, refuses Gabriel's hand. Jeep tackles Gabriel, and they fall. Gabriel draws a knife, but Michael descends in light, confronting Gabriel. Michael strikes, causing Gabriel to drop the knife. Michael places his sword on Gabriel's chin, then steps away. Gabriel rises, spreads his wings, and departs. Michael turns to Jeep, who stands up."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As they drive along, they pass by a sign, and suddenly, the back window of the vehicle shatters into pieces. Gabriel lands forcefully on the roof, tearing the lights off with a swift motion and pounding the roof with his fists. In response, Jeep fires shots upward at him, causing Gabriel to lose his balance and fall, but he manages to cling onto the back of the vehicle. Jeep continues to shoot at Gabriel, and the car swerves erratically, which causes Gabriel to lose his grip and accidentally knock over his hand, setting off a flare inside the car. Gabriel desperately tries to maintain his hold through the back window, reaching out to grab Audrey's arm and striking her. He then seizes Jeep's gun arm, and Jeep struggles to fend him off. Meanwhile, Charlie holds onto her baby tightly as Gabriel clamps his hand over Jeep's eyes, obstructing his vision. Jeep presses down hard on the accelerator, causing the car to swerve wildly across the road. Audrey, in a desperate move, wraps her arms around Gabriel's throat as the speedometer needle climbs past 90 and eventually reaches 110. Jeep suddenly slams on the brakes, sending Gabriel hurtling out through the front window, where he tumbles onto the road. The car veers off the road, hits a bump, and rolls into a ditch, coming to rest upside down. Inside, Jeep finds himself hanging upside down in his seat, his head pressed against the roof, while Charlie manages to extricate herself from the wreckage. Jeep struggles to free himself from the confines of the car and stands up next to Charlie, who shakes her head in disbelief and offers him support. Together, Jeep and Charlie, with the baby in tow, begin to climb up a steep hill, struggling to find handholds as the incline becomes steeper. Jeep glances upward at the sky just as Gabriel swoops down from the bright sky, landing directly in front of him and knocking him unconscious with a single, powerful punch. Charlie attempts to flee but finds herself trapped at the edge of a cliff. Gabriel turns to her, extending his hand. She looks down at the baby, shaking her head in refusal, while Gabriel gazes at her intently. Suddenly, Jeep leaps onto Gabriel's back, and they both tumble over the cliff, landing on the ground below. Gabriel quickly tosses Jeep aside and draws a knife, advancing menacingly toward him. Jeep looks up at Gabriel, who looms over him with the knife poised to strike. Just as Gabriel raises the knife, Michael descends from the heavens in a brilliant ray of light. Gabriel glances downward, his face twisting in anger, and he lunges at Michael with the knife. Michael counters with his sword, striking Gabriel and causing him to drop the knife and fall to his knees as blood drips from Michael's sword. Jeep sits up as Michael approaches Gabriel, placing the tip of his sword under Gabriel's chin. Michael gazes at Gabriel without moving, then shakes his head, lowers his sword, and steps back. Gabriel rises to his feet, looks downward, spreads his wings, and takes flight. Michael then turns his attention to Jeep, who slowly gets up."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As they continue their journey by car, they drive past a sign, and without any warning, the back window of the vehicle suddenly explodes into countless shards of glass. Gabriel lands with an intense force atop the roof, swiftly ripping off the lights in one rapid motion and aggressively pounding the roof with his fists. In response, Jeep fires shots upward at Gabriel, forcing him to lose his footing and fall, yet he manages to desperately cling to the back of the vehicle. Jeep maintains his gunfire directed at Gabriel, and the car swerves wildly, which makes Gabriel struggle to keep his grip and inadvertently hit his hand, igniting a flare inside the vehicle. Gabriel frantically tries to hold on through the shattered back window, reaching out in a frantic attempt to grab Audrey's arm, striking her in the process. He then seizes control of Jeep's gun arm, and Jeep struggles valiantly to fend off the attack. Meanwhile, Charlie clutches her baby protectively as Gabriel clamps his powerful hand over Jeep's eyes, completely obstructing his view. Jeep forcefully presses his foot on the accelerator, causing the car to swerve violently across the road. In a desperate move, Audrey encircles her arms around Gabriel’s throat as the speedometer needle climbs relentlessly past 90, eventually hitting 110. In a sudden maneuver, Jeep slams on the brakes, catapulting Gabriel out through the front window, where he rolls onto the asphalt. The car veers off the road, hitting a bump and tumbling into a ditch, coming to a halt upside down. Inside, Jeep finds himself suspended upside down in his seat, his head pressed awkwardly against the roof, while Charlie manages to wriggle out of the wreckage. Jeep struggles to free himself from the car's confines and stands up beside Charlie, who shakes her head in disbelief and offers him her support. Together, Jeep and Charlie, with the baby in tow, begin the arduous climb up a steep hill, grappling to find handholds as the hill's incline becomes even steeper. Jeep casts a glance upward toward the sky just as Gabriel soars down from the radiant sky, landing directly ahead of him and delivering a single, powerful punch that renders him unconscious. Charlie tries to run but finds herself trapped at the cliff's edge. Gabriel turns toward her, extending his hand. She looks down at the baby cradled in her arms, shaking her head in refusal as Gabriel gazes at her intently. Suddenly, Jeep leaps onto Gabriel's back, and the two tumble over the edge of the cliff, landing on the ground below. Gabriel quickly tosses Jeep aside and draws a menacing knife, advancing toward him with a threatening demeanor. Jeep looks up at Gabriel, who looms ominously over him with the knife poised for an attack. Just as Gabriel raises the knife, Michael descends from the heavens in a radiant beam of light. Gabriel glances downwards, his expression contorting with anger, and lunges at Michael with the knife. Michael counters with his sword, striking Gabriel and causing him to drop the knife and fall to his knees, blood trickling down from Michael's sword. Jeep sits up as Michael approaches Gabriel, positioning the sword's tip under Gabriel's chin. Michael looks intently at Gabriel without moving, then shakes his head, lowers his sword, and steps back. Gabriel gets to his feet, glances downward, spreads his wings, and takes flight. Michael then turns his attention to Jeep, who slowly rises to his feet."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As they move past a sign, the scene intensifies when the back window suddenly shatters, marking Gabriel's dramatic landing on the roof. With a forceful motion, he rips the lights off and begins pounding the roof with his fists. In response, Jeep aims upward and fires at Gabriel, causing him to lose his footing and fall, yet he manages to cling onto the back of the vehicle. Jeep continues to shoot at Gabriel, and the car swerves violently, leading to Gabriel's hand knocking over a flare, which ignites inside the car. Struggling to maintain his position, Gabriel attempts to hold himself steady in the back window, reaching out to grab Audrey's arm and delivering a punch to her. He then seizes Jeep's gun arm, prompting Jeep to fight back in an effort to fend him off. Meanwhile, Charlie clutches her baby tightly as Gabriel clamps his hand over Jeep's eyes, obstructing his vision. In a desperate maneuver, Jeep presses down on the accelerator, causing the car to swerve erratically across the road. As the speedometer needle climbs past 90 and approaches 110, Audrey wraps her arm around Gabriel's throat in an attempt to restrain him. Jeep suddenly slams on the brakes, sending Gabriel hurtling through the front window and tumbling onto the road. The car veers off the road, hits a hump, and rolls into a ditch, coming to rest upside down. Inside, Jeep finds himself inverted in his seat, his head pressed against the roof, while Charlie manages to extricate herself from the wreckage. Jeep struggles to free himself from the car and stands up beside Charlie, who shakes her head in disbelief and offers him support. Together, Jeep and Charlie, with the baby in tow, begin the arduous climb up a steep hill, grappling for handholds as the incline becomes more challenging. Jeep glances skyward just as Gabriel swoops down from the bright sky, landing directly in front of him and delivering a knockout punch that leaves Jeep unconscious. Charlie attempts to flee but finds herself precariously close to the edge of a cliff. Gabriel turns his attention to her, extending his hand, but she looks at her baby and shakes her head, meeting Gabriel's steady gaze. In a sudden burst of action, Jeep leaps onto Gabriel's back, and they both plummet over the cliff, landing on the ground below. Gabriel quickly recovers, tossing Jeep aside and drawing a knife as he advances menacingly. Jeep, now on the ground, stares up at Gabriel, who looms over him with the knife poised to strike. Just as Gabriel raises the knife, Michael descends from the heavens in a brilliant ray of light. Gabriel's expression shifts to anger as he lunges at Michael with the knife, but Michael counters with a swift hack of his sword, causing Gabriel to drop the knife and fall to his knees, blood dripping from Michael's blade. Jeep sits up as Michael approaches Gabriel, placing the tip of his sword under Gabriel's chin. Michael gazes at Gabriel without moving, then shakes his head, lowers the sword, and steps back. Gabriel rises to his feet, looks down, unfurls his wings, and takes flight. Michael then turns his attention to Jeep, who gets up, ready to face whatever comes next."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "They pass a sign as Gabriel lands on the roof, shattering the back window, ripping off the lights, and punching the roof. Jeep fires at him, causing Gabriel to fall but cling to the back. The car swerves, making Gabriel's hand knock over a flare, which ignites inside. Gabriel grabs Audrey's arm and punches her while trying to hold on, then seizes Jeep's gun arm as Jeep fights back. Charlie holds her baby tightly as Gabriel covers Jeep's eyes, causing the car to swerve erratically. Audrey grabs Gabriel's throat as the speedometer climbs past 90, reaching 110. Jeep slams the brakes, sending Gabriel through the front window onto the road. The car veers off, hits a hump, and rolls into a ditch, landing upside down. Jeep, upside down, struggles to get out while Charlie exits and supports him. Together, they climb a steep hill, struggling for handholds. Gabriel swoops down, knocks Jeep out with a punch, and confronts Charlie at a cliff's edge. As Gabriel reaches for her, Jeep leaps on his back, and they both fall over the cliff. Gabriel tosses Jeep aside and advances with a knife. As he prepares to strike, Michael descends in a ray of light. Gabriel lunges at Michael, who counters with his sword, causing Gabriel to drop the knife and fall to his knees. Michael places his sword on Gabriel's chin, then lowers it and steps away. Gabriel stands, spreads his wings, and departs. Michael turns to Jeep, who gets up."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "They pass a sign marking the state line between Arizona and California, an area known for its deserts and rugged terrain. The back window shatters as Gabriel, a celestial being known for his immense strength and speed, lands on the roof, ripping the lights off and punching the roof with his fists. Jeep, a mechanic turned protector of the group, shoots up at it, and Gabriel falls but clings onto the back. Jeep shoots at Gabriel, and the car swerves along the narrow mountain road, causing Gabriel to knock over his hand, making the emergency flare accidentally go off inside the car. Gabriel tries to hold himself in the back window, grabs Audrey's arm, and punches her. He grabs Jeep's gun arm, and Jeep, who learned self-defense from his father, tries to fight him off. Charlie, a waitress caught up in an apocalyptic prophecy involving her child, keeps hold of her baby while Gabriel clamps his hand over Jeep's eyes. Jeep puts his foot down, and the car swerves all over the road, barely avoiding the steep drop-offs. Audrey, a former army medic trained in combat, grabs Gabriel around the throat as the speedometer creeps past 90 and hits 110. Jeep slams on the brakes, and Gabriel hurtles out of the front window, tumbling onto the road. The car leaves the road, hits a hump perilously close to a precipice, and rolls into a ditch, landing on its roof. Jeep is upside down in his seat with his head pressed against the roof while Charlie manages to get out amidst a cloud of dust. Jeep struggles to get out of the car and stands up next to Charlie, who shakes her head, concerned about their next move, and supports him. Jeep and Charlie, holding the baby, climb up a steep hill, struggling for handholds on the loose gravel as the gradient increases sharply. Jeep looks up in the sky as Gabriel swoops down from the clouds out of the light sky, a stunning display of angelic power, and lands just in front of Jeep, knocking him cold with a single punch. Charlie tries to run but finds herself on the edge of a cliff top, a sheer drop into the canyon below, as Gabriel turns to her and holds his hand out. She looks at the baby, knowing his prophesied importance, and shakes her head while Gabriel eyes her steadily. Jeep, recovering his wits, leaps on Gabriel's back and they fall over the cliff, landing on the rocky ground below. Gabriel, undeterred and resilient, tosses Jeep aside and draws a celestial knife as he advances on him. Jeep stares up at Gabriel, who towers over him with the knife ready. As Gabriel raises the knife to strike, Michael, another powerful angel and Gabriel's counterpart, descends from the heavens in a dazzling ray of light. Gabriel looks down, then his face contorts in anger, and he lunges at Michael with the knife. Michael, wielding a divine sword crafted in the fires of creation, hacks him with his sword, causing Gabriel to drop the knife and fall to his knees as gouts of blood drip off Michael's sword. Jeep sits up as Michael steps over to Gabriel, placing the tip of his sword on Gabriel's chin. Michael stares at Gabriel but doesn't move, then shakes his head, lowers the sword, and steps away, showing restraint. Gabriel gets to his feet, looks down, spreads his wings with a powerful whoosh, and takes off into the sky. Michael turns to Jeep, who gets up, ready to continue their mission."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "They pass a sign  The back window shatters as Gabriel lands on the roof ripping the lights off and punching the roof with his fists  Jeep shoots up at it and Gabriel falls but clings onto the back  The car leaves the road hits a hump and rolls into a ditch landing on its roof  Jeep is upside down in his seat with his head pressed against the roof while Charlie manages to get out  Jeep struggles to get out of the car and stands up next to Charlie who shakes her head and supports him  Jeep and Charlie holding the baby climb up a steep hill struggling for handholds as the gradient increases  Jeep looks up in the sky as Gabriel swoops down out of the light sky and lands just in front of Jeep knocking him cold with a single punch  Charlie tries to run but finds herself on the edge of a cliff top as Gabriel turns to her and holds his hand out  She looks at the baby and shakes her head while Gabriel eyes her steadily  Jeep leaps on Gabriel's back and they fall over the cliff landing on the ground below  Gabriel tosses Jeep aside and draws a knife as he advances on him  Jeep stares up at Gabriel who towers over him with the knife ready  As Gabriel raises the knife to strike Michael descends from the heavens in a dazzling ray of light  Gabriel looks down then his face contorts in anger and he lunges at Michael with the knife  Michael hacks him with his sword causing Gabriel to drop the knife and fall to his knees as gouts of blood drip off Michael's sword  Jeep sits up as Michael steps over to Gabriel placing the tip of his sword on Gabriel's chin  Jeep shoots at Gabriel and the car swerves causing Gabriel to knock over his hand making the flare go off in the car  Gabriel tries to hold himself in the back window grabs Audrey's arm and punches her  He grabs Jeep's gun arm and Jeep tries to fight him off  Charlie keeps hold of her baby while Gabriel clamps his hand over Jeep's eyes  Jeep puts his foot down and the car swerves all over the road  Audrey grabs Gabriel around the throat as the speedometer creeps past 90 and hits 110  Jeep slams on the brakes and Gabriel hurtles out of the front window tumbling onto the road  The car leaves the road hits a hump and rolls into a ditch landing on its roof  Jeep is upside down in his seat with his head pressed against the roof while Charlie manages to get out  Jeep struggles to get out of the car and stands up next to Charlie who shakes her head and supports him  Jeep and Charlie holding the baby climb up a steep hill struggling for handholds as the gradient increases  Jeep looks up in the sky as Gabriel swoops down out of the light sky and lands just in front of Jeep knocking him cold with a single punch  Charlie tries to run but finds herself on the edge of a cliff top as Gabriel turns to her and holds his hand out  She looks at the baby and shakes her head while Gabriel eyes her steadily  Jeep leaps on Gabriel's back and they fall over the cliff landing on the ground below  Gabriel tosses Jeep aside and draws a knife as he advances on him  Jeep stares up at Gabriel who towers over him with the knife ready  As Gabriel raises the knife to strike Michael descends from the heavens in a dazzling ray of light  Gabriel looks down then his face contorts in anger and he lunges at Michael with the knife  Michael hacks him with his sword causing Gabriel to drop the knife and fall to his knees as gouts of blood drip off Michael's sword  Jeep sits up as Michael steps over to Gabriel placing the tip of his sword on Gabriel's chin  Michael stares at Gabriel but doesn't move then shakes his head lowers the sword and steps away  Gabriel gets to his feet looks down spreads his wings and takes off  Michael turns to Jeep who gets up"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "They pass a sign. The back window shatters as Gabriel lands on the roof ripping the lights off and punching the roof with his fists. Jeep shoots up at it and Gabriel falls but clings onto the back. Jeep shoots at Gabriel and the car swerves causing Gabriel to knock over his hand making the flare go off in the car. Gabriel tries to hold himself in the back window grabs Audrey's arm and punches her. He grabs Jeep's gun arm and Jeep tries to fight him off. Charlie keeps hold of her baby while Gabriel clamps his hand over Jeep's eyes. Jeep puts his foot down and the car swerves all over the road. Audrey grabs Gabriel around the throat as the speedometer creeps past 90 and hits 110. Jeep slams on the brakes and Gabriel hurtles out of the front window tumbling onto the road. The car leaves the road hits a hump and rolls into a ditch landing on its roof. Jeep is upside down in his seat with his head pressed against the roof while Charlie manages to get out. Jeep struggles to get out of the car and stands up next to Charlie who shakes her head and supports him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Jeep and Charlie holding the baby climb up a steep hill struggling for handholds as the gradient increases. Jeep looks up in the sky as Gabriel swoops down out of the light sky and lands just in front of Jeep knocking him cold with a single punch. Charlie tries to run but finds herself on the edge of a cliff top as Gabriel turns to her and holds his hand out. She looks at the baby and shakes her head while Gabriel eyes her steadily. Jeep leaps on Gabriel's back and they fall over the cliff landing on the ground below. Gabriel tosses Jeep aside and draws a knife as he advances on him. Jeep stares up at Gabriel who towers over him with the knife ready. As Gabriel raises the knife to strike Michael descends from the heavens in a dazzling ray of light. Gabriel looks down then his face contorts in anger and he lunges at Michael with the knife. Michael hacks him with his sword causing Gabriel to drop the knife and fall to his knees as gouts of blood drip off Michael's sword. Jeep sits up as Michael steps over to Gabriel placing the tip of his sword on Gabriel's chin. Michael stares at Gabriel but does not move then shakes his head lowers the sword and steps away. Gabriel gets to his feet looks down spreads his wings and takes off. Michael turns to Jeep who gets up."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "They pass a sign. The back window shatters as Gabriel lands on the roof ripping the lights off and punching the roof with his fists. Jeep shoots up at it and Gabriel falls but clings onto the back. Jeep shoots at Gabriel and the car swerves causing Gabriel to knock over his hand making the flare go off in the car. Gabriel tries to hold himself in the back window grabs Audrey's arm and punches her. He grabs Jeep's gun arm and Jeep tries to fight him off. Charlie keeps hold of her baby while Gabriel clamps his hand over Jeep's eyes. Jeep puts his foot down and the car swerves all over the road. Audrey grabs Gabriel around the throat as the speedometer creeps past 90 and hits 110. Jeep slams on the brakes and Gabriel hurtles out of the front window tumbling onto the road. The car leaves the road hits a hump and rolls into a ditch landing on its roof. Jeep is upside down in his seat with his head pressed against the roof while Charlie manages to get out. Jeep struggles to get out of the car and stands up next to Charlie who shakes her head and supports him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Jeep and Charlie holding the baby climb up a steep hill struggling for handholds as the gradient increases. Jeep looks up in the sky as Gabriel swoops down out of the light sky and lands just in front of Jeep knocking him cold with a single punch. Charlie tries to run but finds herself on the edge of a cliff top as Gabriel turns to her and holds his hand out. She looks at the baby and shakes her head while Gabriel eyes her steadily. Jeep leaps on Gabriel's back and they fall over the cliff landing on the ground below. Gabriel tosses Jeep aside and draws a knife as he advances on him. Jeep stares up at Gabriel who towers over him with the knife ready. As Gabriel raises the knife to strike Michael descends from the heavens in a dazzling ray of light. Gabriel looks down then his face contorts in anger and he lunges at Michael with the knife. Michael hacks him with his sword causing Gabriel to drop the knife and fall to his knees as gouts of blood drip off Michael's sword. Jeep sits up as Michael steps over to Gabriel placing the tip of his sword on Gabriel's chin. Michael stares at Gabriel but does not move then shakes his head lowers the sword and steps away. Gabriel gets to his feet looks down spreads his wings and takes off. Michael turns to Jeep who gets up."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "They pass a sign. The back window shatters as Gabriel lands on the roof ripping the lights off and punching the roof with his fists. Jeep shoots up at it and Gabriel falls but clings onto the back. Jeep shoots at Gabriel and the car swerves causing Gabriel to knock over his hand making the flare go off in the car. Gabriel tries to hold himself in the back window grabs Audrey's arm and punches her. He grabs Jeep's gun arm and Jeep tries to fight him off. Charlie keeps hold of her baby while Gabriel clamps his hand over Jeep's eyes. As Gabriel raises the knife to strike Michael descends from the heavens in a dazzling ray of light. Gabriel looks down then his face contorts in anger and he lunges at Michael with the knife. Michael hacks him with his sword causing Gabriel to drop the knife and fall to his knees as gouts of blood drip off Michael's sword. Jeep sits up as Michael steps over to Gabriel placing the tip of his sword on Gabriel's chin. Michael stares at Gabriel but does not move then shakes his head lowers the sword and steps away. Gabriel gets to his feet looks down spreads his wings and takes off. Michael turns to Jeep who gets up."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "They pass a sign. The back window shatters as Gabriel lands on the roof ripping the lights off and punching the roof with his fists. Jeep shoots up at it and Gabriel falls but clings onto the back. Michael stares at Gabriel but does not move then shakes his head lowers the sword and steps away. Gabriel gets to his feet looks down spreads his wings and takes off. Michael turns to Jeep who gets up."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The penguin passes a sign. The back window shatters as the raccoon lands on the roof, ripping the lights off and punching the roof with its fists. The giraffe shoots up at it, and the raccoon falls but clings onto the back. The giraffe shoots at the raccoon, and the car swerves, causing the raccoon to knock over its hand, making the flare go off in the car. The raccoon tries to hold itself in the back window, grabs the zebra's arm, and punches her. It grabs the giraffe's gun arm, and the giraffe tries to fight it off. The dolphin keeps hold of her baby while the raccoon clamps its hand over the giraffe's eyes. The giraffe puts its foot down, and the car swerves all over the road. The zebra grabs the raccoon around the throat as the speedometer creeps past 90 and hits 110. The giraffe slams on the brakes, and the raccoon hurtles out of the front window, tumbling onto the road. The car leaves the road, hits a hump, and rolls into a ditch, landing on its roof. The giraffe is upside down in its seat with its head pressed against the roof while the dolphin manages to get out. The giraffe struggles to get out of the car and stands up next to the dolphin, who shakes her head and supports it. The giraffe and the dolphin, holding the baby, climb up a steep hill, struggling for handholds as the gradient increases. The giraffe looks up in the sky as the owl swoops down out of the light sky and lands just in front of the giraffe, knocking it cold with a single punch. The dolphin tries to run but finds herself on the edge of a cliff top as the owl turns to her and holds its hand out. She looks at the baby and shakes her head while the owl eyes her steadily. The giraffe leaps on the owl's back and they fall over the cliff, landing on the ground below. The owl tosses the giraffe aside and draws a knife as it advances on it. The giraffe stares up at the owl, who towers over it with the knife ready. As the owl raises the knife to strike, the lion descends from the heavens in a dazzling ray of light. The owl looks down, then its face contorts in anger, and it lunges at the lion with the knife. The lion hacks it with its sword, causing the owl to drop the knife and fall to its knees as gouts of blood drip off the lion's sword. The giraffe sits up as the lion steps over to the owl, placing the tip of its sword on the owl's chin. The lion stares at the owl but doesn't move, then shakes its head, lowers the sword, and steps away. The owl gets to its feet, looks down, spreads its wings, and takes off. The lion turns to the giraffe, who gets up."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "They pass a billboard. The side mirror shatters as Gabriel lands on the hood, ripping the windshield wipers off and pounding the hood with his fists. Jeep shoots up at it, and Gabriel falls but clings onto the trunk. Jeep shoots at Gabriel, and the vehicle swerves, causing Gabriel to knock over his foot, making the horn blare in the vehicle. Gabriel tries to hold himself at the side mirror, grabs Audrey's leg, and punches her. He grabs Jeep's steering wheel arm, and Jeep tries to fight him off. Charlie keeps hold of her puppy while Gabriel clamps his hand over Jeep's mouth. Jeep puts his foot down, and the vehicle swerves all over the road. Audrey grabs Gabriel around the waist as the odometer creeps past 90 and hits 110. Jeep slams on the brakes, and Gabriel hurtles out of the side door, tumbling onto the ground. The vehicle leaves the street, hits a bump, and rolls into a culvert, landing on its hood. Jeep is upside down in his seat with his head pressed against the hood while Charlie manages to get out. Jeep struggles to get out of the vehicle and stands up next to Charlie, who shakes her head and supports him. Jeep and Charlie, holding the puppy, climb up a steep embankment, struggling for handholds as the slope increases. Jeep looks up in the sky as Gabriel swoops down out of the bright sky and lands just in front of Jeep, knocking him cold with a single punch. Charlie tries to run but finds herself on the edge of a canyon top as Gabriel turns to her and holds his hand out. She looks at the puppy and shakes her head while Gabriel eyes her steadily. Jeep leaps on Gabriel's back, and they fall over the canyon edge, landing on the shrubs below. Gabriel tosses Jeep aside and draws a machete as he advances on him. Jeep stares up at Gabriel, who towers over him with the machete ready. As Gabriel raises the machete to strike, Michael descends from the clouds in a dazzling beam of light. Gabriel looks down, then his face contorts in anger, and he lunges at Michael with the machete. Michael hacks him with his spear, causing Gabriel to drop the machete and fall to his knees as gouts of water drip off Michael's spear. Jeep sits up as Michael steps over to Gabriel, placing the tip of his spear on Gabriel's chin. Michael stares at Gabriel but doesn't move, then shakes his head, lowers the spear, and steps away. Gabriel gets to his feet, looks down, spreads his wings, and takes off. Michael turns to Jeep, who gets up."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "They admire a sign. The back window glows as Gabriel perches on the roof, tossing the lights aside and tapping the roof with his fingers. Jeep gestures up at it, and Gabriel slides but clings onto the back. Jeep glances at Gabriel, and the car drifts, causing Gabriel to wave at his hand, making the flare fizzle inside the car. Gabriel attempts to steady himself in the back window, nudges Audrey's arm, and brushes her. He touches Jeep's gun arm, and Jeep gestures to fend him off. Charlie cradles her baby while Gabriel shields his hand over Jeep's eyes. Jeep eases on the pedal, and the car drifts across the road. Audrey brushes Gabriel around the neck as the speedometer inches past 90 and nears 110. Jeep taps the brakes, and Gabriel sails out of the front window, gliding onto the road. The car veers off the road, nudges a bump, and tumbles into a ditch, settling on its roof. Jeep hangs upside down in his seat with his head nestled against the roof while Charlie manages to step out. Jeep scrambles to exit the car and stands up next to Charlie, who nods and steadies him. Jeep and Charlie, cradling the baby, hike up a steep hill, seeking footholds as the incline intensifies. Jeep peers up into the sky as Gabriel drifts down out of the bright sky and lands just ahead of Jeep, tapping him gently with a single touch. Charlie attempts to skip away but finds herself at the edge of a cliff top as Gabriel turns to her and extends his hand. She glances at the baby and nods while Gabriel observes her calmly. Jeep jumps on Gabriel's back and they glide over the cliff, settling on the ground below. Gabriel nudges Jeep aside and displays a feather as he approaches him. Jeep gazes up at Gabriel, who towers over him with the feather ready. As Gabriel lifts the feather to strike, Michael glides down from the heavens in a radiant beam of light. Gabriel looks upward, then his face twists in confusion, and he lunges at Michael with the feather. Michael sweeps him with his shield, causing Gabriel to drop the feather and lower to his knees as streams of color drip off Michael's shield. Jeep sits up as Michael steps over to Gabriel, placing the edge of his shield on Gabriel's shoulder. Michael gazes at Gabriel but doesn't react, then nods, lowers the shield, and steps back. Gabriel rises to his feet, gazes downward, spreads his wings, and glides away. Michael turns to Jeep, who stands up."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "They pass a billboard. The front door shatters as Lionel lands on the chimney, ripping the flowers off and punching the chimney with his fists. Tractor shoots up at it, and Lionel falls but clings onto the front. Tractor shoots at Lionel, and the wagon swerves, causing Lionel to knock over his elbow, making the lantern go off in the wagon. Lionel tries to hold himself in the front door, grabs Monica's leg, and punches her. He grabs Tractor's hammer arm, and Tractor tries to fight him off. Donna keeps hold of her sandwich while Lionel clamps his hand over Tractor's ears. Tractor puts his foot down, and the wagon swerves all over the field. Monica grabs Lionel around the waist as the thermometer creeps past 90 and hits 110. Tractor slams on the brakes, and Lionel hurtles out of the side window, tumbling onto the field. The wagon leaves the field, hits a bump, and rolls into a gully, landing on its chimney. Tractor is upside down in his seat with his hat pressed against the chimney while Donna manages to get out. Tractor struggles to get out of the wagon and stands up next to Donna, who shakes her hat and supports him. Tractor and Donna, holding the sandwich, climb up a steep mountain, struggling for branches as the slope increases. Tractor looks up in the clouds as Lionel swoops down out of the bright clouds and lands just in front of Tractor, knocking him cold with a single punch. Donna tries to run but finds herself on the edge of a riverbank as Lionel turns to her and holds his elbow out. She looks at the sandwich and shakes her hat while Lionel eyes her steadily. Tractor leaps on Lionel's back and they fall over the riverbank, landing on the sand below. Lionel tosses Tractor aside and draws a screwdriver as he advances on him. Tractor stares up at Lionel, who towers over him with the screwdriver ready. As Lionel raises the screwdriver to strike, Raphael descends from the hills in a dazzling ray of light. Lionel looks down, then his face contorts in anger, and he lunges at Raphael with the screwdriver. Raphael hacks him with his spoon, causing Lionel to drop the screwdriver and fall to his knees as gouts of ink drip off Raphael's spoon. Tractor sits up as Raphael steps over to Lionel, placing the tip of his spoon on Lionel's shoulder. Raphael stares at Lionel but doesn't move, then shakes his hat, lowers the spoon, and steps away. Lionel gets to his feet, looks down, spreads his sails, and takes off. Raphael turns to Tractor, who gets up."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "They approach a billboard. The rear windshield fractures as Samantha perches on the trunk, yanking the antenna off and slapping the hood with her palms. Kevin fires across it, and Samantha slips but hangs onto the bumper. Kevin fires at Samantha, and the vehicle veers, causing Samantha to tip her wrist, making the horn blare inside the car. Samantha attempts to steady herself through the rear window, seizes Alex's sleeve, and kicks him. She snatches Kevin’s elbow, and Kevin attempts to repel her. Jordan clutches her book while Samantha covers Kevin's face. Kevin accelerates, and the car zigzags down the street. Alex seizes Samantha by the waist as the odometer nudges past 90 and races to 110. Kevin stomps on the gas, and Samantha catapults out of the rear windshield, skidding across the ground. The vehicle leaves the pavement, hits a bump, and flips into a trench, coming to rest on its roof. Kevin is inverted in his seat with his shoulders pressed against the ceiling while Jordan manages to exit. Kevin wrestles to escape the vehicle and stands alongside Jordan, who shrugs and guides him. Kevin and Jordan, clutching the book, ascend a steep incline, grappling for support as the slope steepens. Kevin glances skyward as Samantha glides down out of the cloudy sky and lands directly in front of Kevin, rendering him unconscious with a swift kick. Jordan attempts to flee but finds herself at the brink of a precipice as Samantha turns to her and extends her arm. She gazes at the book and shakes her head while Samantha scrutinizes her intently. Kevin pounces onto Samantha's shoulders, and they tumble over the precipice, landing on the earth below. Samantha hurls Kevin aside and unsheathes a dagger as she advances on him. Kevin gazes up at Samantha, who looms over him with the dagger poised. As Samantha lifts the dagger to strike, Raphael descends from the sky in a brilliant beam of radiance. Samantha glances down, then her expression twists in fury, and she charges at Raphael with the dagger. Raphael strikes her with his spear, causing Samantha to release the dagger and collapse to her knees as streams of light trickle from Raphael's spear. Kevin rises as Raphael steps up to Samantha, placing the spear’s tip beneath Samantha's chin. Raphael gazes at Samantha but remains still, then nods, lowers the spear, and steps aside. Samantha rises to her feet, looks below, unfurls her wings, and soars away. Raphael turns to Kevin, who rises."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "They paint a billboard. The back panel dissolves as Gabriel bounces on the chimney, tearing the radios off and slapping the chimney with his palms. Jeep leaps up at it, and Gabriel slips but grabs onto the railing. Jeep tosses a stone at Gabriel, and the vessel zigzags, causing Gabriel to tilt his elbow, making the lantern light up in the vessel. Gabriel tries to balance himself in the back panel, seizes Audrey's leg, and shoves her. He catches Jeep's wrist, and Jeep attempts to pull him away. Charlie clutches her kitten while Gabriel covers Jeep's ears. Jeep presses his other foot down, and the vessel glides all over the ocean. Audrey clutches Gabriel around the waist as the speedometer crawls past 90 and ticks 110. Jeep slams on the pedal, and Gabriel flies out of the front panel, rolling onto the beach. The vessel leaves the ocean, hits a bump, and spins into a trench, landing on its chimney. Jeep is dangling in his seat with his head touching the chimney while Charlie manages to crawl out. Jeep struggles to climb out of the vessel and stands beside Charlie, who nods her head and steadies him. Jeep and Charlie, holding the kitten, crawl up a steep slope, struggling for footholds as the incline increases. Jeep gazes up into the clouds as Gabriel glides down out of the dark clouds and lands just in front of Jeep, sending him sprawling with a single shove. Charlie tries to dash but finds herself on the edge of a valley as Gabriel turns to her and extends his fist. She glances at the kitten and nods her head while Gabriel watches her intently. Jeep pounces on Gabriel's shoulders, and they tumble over the valley, landing on the sand below. Gabriel flips Jeep aside and draws a rope as he closes in on him. Jeep gawks up at Gabriel, who looms over him with the rope ready. As Gabriel lifts the rope to bind, Michael descends from the galaxies in a brilliant beam of darkness. Gabriel looks up, then his face twists in rage, and he charges at Michael with the rope. Michael slices him with his lance, causing Gabriel to release the rope and collapse to his knees as droplets of ink drip off Michael's lance. Jeep stands as Michael steps over to Gabriel, placing the tip of his lance on Gabriel's shoulder. Michael gazes at Gabriel but remains still, then nods his head, lowers the lance, and steps aside. Gabriel rises, looks up, unfurls his sails, and floats away. Michael turns to Jeep, who stands."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "They approach a billboard. The side door explodes as Marcus touches down on the chimney, tearing the shingles away and kicking the chimney with his boots. Tractor fires downward at it, and Marcus stumbles but hangs onto the bumper. Tractor fires at Marcus, and the wagon veers, causing Marcus to topple into his elbow, making the lantern ignite in the wagon. Marcus tries to steady himself in the side door, seizes Lily's shoulder, and slaps her. He catches Tractor's rifle arm, and Tractor attempts to push him off. Jenny holds onto her kitten while Marcus places his palm over Tractor's glasses. Tractor stomps the pedal, and the wagon zigzags across the lane. Lily clutches Marcus around the ankle as the odometer ticks past 70 and reaches 90. Tractor stamps on the brakes, and Marcus is catapulted out of the side window, tumbling onto the pavement. The wagon exits the path, hits a bump, and tumbles into a gulley, landing on its hood. Tractor is inverted in his seat with his nose pressed against the hood while Jenny manages to crawl out. Tractor struggles to free himself from the wagon and stands beside Jenny, who nods and steadies him. Tractor and Jenny, holding the kitten, ascend a slippery mound, grappling for footholds as the incline steepens. Tractor gazes upward at the sky as Marcus dives down out of the clear sky and lands right ahead of Tractor, knocking him unconscious with a single kick. Jenny tries to flee but finds herself on the brink of a precipice as Marcus turns to her and extends his palm. She glances at the kitten and nods while Marcus watches her intently. Tractor pounces on Marcus's back and they tumble over the precipice, landing on the terrain beneath. Marcus flings Tractor aside and unsheathes a spear as he moves toward him. Tractor peers up at Marcus, who looms over him with the spear poised. As Marcus elevates the spear to strike, Raphael descends from the stratosphere in a brilliant arc of luminescence. Marcus glances down, then his features twist in fury, and he charges at Raphael with the spear. Raphael slashes him with his dagger, causing Marcus to release the spear and collapse to his knees as streams of sap drip off Raphael's dagger. Tractor rises as Raphael steps over to Marcus, placing the blade's tip on Marcus's nose. Raphael gazes at Marcus but remains motionless, then nods, lowers the dagger, and steps back. Marcus stands, glances down, unfurls his cloak, and ascends. Raphael turns to Tractor, who rises."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "As a sign passes, Gabriel lands on the car roof, breaking the window and punching through. Jeep shoots at him, causing the car to swerve, setting off a flare. Gabriel grabs Jeep's gun arm while Charlie holds her baby. Despite blinding Jeep, the car swerves wildly with Audrey choking Gabriel. Jeep brakes hard, ejecting Gabriel through the window, and the car rolls into a ditch. Jeep and Charlie escape with the baby. Climbing a hill, Gabriel knocks Jeep out. Charlie, cornered at a cliff's edge, refuses Gabriel's offer. Jeep tackles Gabriel, and they fall, but Gabriel overpowers him, drawing a knife. As Gabriel advances, Michael descends in a light. Gabriel angrily attacks but is countered by Michael's sword, making him drop the knife. As Gabriel kneels, bleeding, Michael steps back, allowing Gabriel to rise and fly away. Michael addresses Jeep, who stands."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Michael turns to Jeep who gets up Gabriel gets to his feet looks down spreads his wings and takes off  Michael stares at Gabriel but doesn't move then shakes his head lowers the sword and steps away  Jeep sits up as Michael steps over to Gabriel placing the tip of his sword on Gabriel's chin  Michael hacks him with his sword causing Gabriel to drop the knife and fall to his knees as gouts of blood drip off Michael's sword  Gabriel looks down then his face contorts in anger and he lunges at Michael with the knife  As Gabriel raises the knife to strike Michael descends from the heavens in a dazzling ray of light  Jeep stares up at Gabriel who towers over him with the knife ready  Gabriel tosses Jeep aside and draws a knife as he advances on him  Jeep leaps on Gabriel's back and they fall over the cliff landing on the ground below  She looks at the baby and shakes her head while Gabriel eyes her steadily  Charlie tries to run but finds herself on the edge of a cliff top as Gabriel turns to her and holds his hand out  Jeep looks up in the sky as Gabriel swoops down out of the light sky and lands just in front of Jeep knocking him cold with a single punch  Jeep and Charlie holding the baby climb up a steep hill struggling for handholds as the gradient increases  Jeep struggles to get out of the car and stands up next to Charlie who shakes her head and supports him  Jeep is upside down in his seat with his head pressed against the roof while Charlie manages to get out  The car leaves the road hits a hump and rolls into a ditch landing on its roof  Jeep slams on the brakes and Gabriel hurtles out of the front window tumbling onto the road  Audrey grabs Gabriel around the throat as the speedometer creeps past 90 and hits 110  Jeep puts his foot down and the car swerves all over the road  Charlie keeps hold of her baby while Gabriel clamps his hand over Jeep's eyes  He grabs Jeep's gun arm and Jeep tries to fight him off  Gabriel tries to hold himself in the back window grabs Audrey's arm and punches her  Jeep shoots at Gabriel and the car swerves causing Gabriel to knock over his hand making the flare go off in the car  Jeep shoots up at it and Gabriel falls but clings onto the back  The back window shatters as Gabriel lands on the roof ripping the lights off and punching the roof with his fists  They pass a sign "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Jeep slams on the brakes and Gabriel hurtles out of the front window tumbling onto the road  They pass a sign  Jeep stares up at Gabriel who towers over him with the knife ready  Gabriel looks down then his face contorts in anger and he lunges at Michael with the knife  Jeep and Charlie holding the baby climb up a steep hill struggling for handholds as the gradient increases  He grabs Jeep's gun arm and Jeep tries to fight him off  Jeep sits up as Michael steps over to Gabriel placing the tip of his sword on Gabriel's chin  Gabriel gets to his feet looks down spreads his wings and takes off  As Gabriel raises the knife to strike Michael descends from the heavens in a dazzling ray of light  Jeep looks up in the sky as Gabriel swoops down out of the light sky and lands just in front of Jeep knocking him cold with a single punch  Michael stares at Gabriel but doesn't move then shakes his head lowers the sword and steps away  Charlie tries to run but finds herself on the edge of a cliff top as Gabriel turns to her and holds his hand out  She looks at the baby and shakes her head while Gabriel eyes her steadily  Jeep puts his foot down and the car swerves all over the road  Jeep leaps on Gabriel's back and they fall over the cliff landing on the ground below  The back window shatters as Gabriel lands on the roof ripping the lights off and punching the roof with his fists  Michael turns to Jeep who gets up Gabriel tosses Jeep aside and draws a knife as he advances on him  Jeep is upside down in his seat with his head pressed against the roof while Charlie manages to get out  Michael hacks him with his sword causing Gabriel to drop the knife and fall to his knees as gouts of blood drip off Michael's sword  Jeep struggles to get out of the car and stands up next to Charlie who shakes her head and supports him  Jeep shoots up at it and Gabriel falls but clings onto the back  Jeep shoots at Gabriel and the car swerves causing Gabriel to knock over his hand making the flare go off in the car  The car leaves the road hits a hump and rolls into a ditch landing on its roof  Charlie keeps hold of her baby while Gabriel clamps his hand over Jeep's eyes  Gabriel tries to hold himself in the back window grabs Audrey's arm and punches her  Audrey grabs Gabriel around the throat as the speedometer creeps past 90 and hits 110 "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Jeep looks up in the sky as Gabriel swoops down out of the light sky and lands just in front of Jeep knocking him cold with a single punch  Charlie tries to run but finds herself on the edge of a cliff top as Gabriel turns to her and holds his hand out  She looks at the baby and shakes her head while Gabriel eyes her steadily  Jeep leaps on Gabriel's back and they fall over the cliff landing on the ground below  Gabriel tosses Jeep aside and draws a knife as he advances on him  Jeep stares up at Gabriel who towers over him with the knife ready  As Gabriel raises the knife to strike Michael descends from the heavens in a dazzling ray of light  Gabriel looks down then his face contorts in anger and he lunges at Michael with the knife  Michael hacks him with his sword causing Gabriel to drop the knife and fall to his knees as gouts of blood drip off Michael's sword  Jeep sits up as Michael steps over to Gabriel placing the tip of his sword on Gabriel's chin  Michael stares at Gabriel but doesn't move then shakes his head lowers the sword and steps away  Gabriel gets to his feet looks down spreads his wings and takes off  Michael turns to Jeep who gets up They pass a sign  The back window shatters as Gabriel lands on the roof ripping the lights off and punching the roof with his fists  Jeep shoots up at it and Gabriel falls but clings onto the back  Jeep shoots at Gabriel and the car swerves causing Gabriel to knock over his hand making the flare go off in the car  Gabriel tries to hold himself in the back window grabs Audrey's arm and punches her  He grabs Jeep's gun arm and Jeep tries to fight him off  Charlie keeps hold of her baby while Gabriel clamps his hand over Jeep's eyes  Jeep puts his foot down and the car swerves all over the road  Audrey grabs Gabriel around the throat as the speedometer creeps past 90 and hits 110  Jeep slams on the brakes and Gabriel hurtles out of the front window tumbling onto the road  The car leaves the road hits a hump and rolls into a ditch landing on its roof  Jeep is upside down in his seat with his head pressed against the roof while Charlie manages to get out  Jeep struggles to get out of the car and stands up next to Charlie who shakes her head and supports him  Jeep and Charlie holding the baby climb up a steep hill struggling for handholds as the gradient increases "
        }
      ]
    }
  ]
}