{
  "ground_truth": "Charlie, wearing a name badge, saunters over as Sandra smiles through gritted teeth. The door opens, and Jeep walks in, heading to the kitchen, where a steak is covered with flies. Charlie's smile fades, and she glares as everyone turns to the dear, sweet old lady. Charlie slams down the bill and goes to the kitchen. Jeep looks across at the old lady and begins to walk towards her, noticing her rare steak is covered with flies as she cuts into it. Audrey grins as Gladys bites a chunk from Howard's neck, causing him to fall to the floor. Gladys tips her table, Percy grabs a frying pan, and throws it at Gladys, hitting her. She straightens up, a gash in her cheek, her eyes dark, and charges across the diner, leaping onto the window blinds and scuttling up them to the inverted V-shaped ceiling, which she scampers over. Bob fires a pump-action shotgun, but she leaps in front of him and swats him away; the shotgun falls to the floor in front of Jeep, who picks it up as Gladys approaches. Jeep closes his eyes, and Gladys slows to a halt at his feet without him firing. He looks up to see Kyle holding a smoking pistol as Howard lies in a puddle of blood on the floor, gasping for breath, and Sandra runs to him, her hands covered in his blood. Kyle puts the gun in his waistband and runs over, placing a napkin and his scarf over Howard's wound. Audrey, sitting on a bench seat, hugs her knees and shivers as blood drips from the ceiling onto her head, spotting two stains above her. Percy and Kyle haul Howard to the SUV, dragging his toes on the ground, and load him into the back with Sandra and Audrey. The SUV reverses, then goes back onto the road, heading for the dark cloud in the distance. Audrey spots the dark cloud on the road, which looks like smoke spreading upwards, as a fly comes in through a grill, and others splat into the windscreen. Flies storm in through the grill by the thousands. In the men's room at the diner, Jeep throws up in a cubicle as Bob stands by a nearby sink, drinking from a can. Bob sees Jeep's reflection in the mirror and pats Jeep's shoulder, then turns when he hears a car as the others return. He grabs Percy, looks up as Percy rushes inside, and sees a giant storm of flies looming overhead, darkening the sky above him. He retreats inside, where the gruesome face of old Gladys is uncovered from under a plastic sheet. Bob and Jeep, along with Kyle, carry Gladys out and watch the approaching police squad car as Kyle turns to Jeep, then Bob.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Charlie, sporting a name tag, ambles over as Sandra beams through clenched teeth. The portal swings, and Jeep ambles in, making for the galley, where a beefsteak is swarmed with insects. Charlie's grin diminishes, and she stares as everyone pivots to the dear, gentle elderly woman. Charlie bangs down the invoice and proceeds to the galley. Jeep glances across at the elderly woman and starts to move towards her, observing her rare beefsteak is swarmed with insects as she slices into it. Audrey beams as Gladys bites a piece from Howard's neck, causing him to collapse onto the ground. Gladys overturns her table, Percy snatches a skillet, and hurls it at Gladys, hitting her. She straightens up, a cut on her cheek, her eyes sinister, and dashes across the eatery, leaping onto the window shades and scuttling up them to the inverted V-shaped roof, which she scurries over. Bob discharges a pump-action firearm, but she leaps in front of him and slaps him aside; the firearm tumbles to the ground in front of Jeep, who seizes it as Gladys nears. Jeep shuts his eyes, and Gladys slows to a stop at his feet without him discharging. He gazes up to see Kyle grasping a smoking revolver as Howard lies in a pool of blood on the ground, struggling for air, and Sandra dashes to him, her hands smeared in his blood. Kyle places the revolver in his waistband and dashes over, placing a serviette and his muffler over Howard's injury. Audrey, seated on a bench seat, hugs her legs and trembles as blood drips from the roof onto her head, spotting two stains above her. Percy and Kyle hoist Howard to the SUV, dragging his feet on the surface, and load him into the back with Sandra and Audrey. The SUV recoils, then goes back onto the path, heading for the dark cloud in the expanse. Audrey notices the dark cloud on the path, which resembles smoke rising upwards, as an insect enters through a grille, and others splat into the windshield. Insects swarm in through the grille by the multitudes. In the men's chamber at the eatery, Jeep vomits in a stall as Bob stands by a nearby basin, sipping from a can. Bob observes Jeep's reflection in the mirror and pats Jeep's shoulder, then turns when he hears a car as the others return. He grabs Percy, looks up as Percy rushes inside, and sees a giant swarm of insects looming overhead, darkening the sky above him. He withdraws inside, where the grotesque visage of old Gladys is uncovered from under a plastic covering. Bob and Jeep, along with Kyle, bear Gladys out and watch the approaching constabulary squad car as Kyle turns to Jeep, then Bob."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Charlie, wearing a name badge, saunters over as Sandra smiles through gritted teeth. The door is opened, and Jeep walks in, heading to the kitchen, where flies cover a steak. Charlie's smile fades, and everyone turns to the dear, sweet old lady as she is glared at by Charlie. The bill is slammed down by Charlie, who goes to the kitchen. Jeep looks across at the old lady and begins to walk towards her, noticing that flies cover her rare steak as she cuts into it. Audrey grins as Howard's neck is bitten by Gladys, causing him to fall to the floor. The table is tipped by Gladys, Percy grabs a frying pan, and he throws it at Gladys, hitting her. She straightens up, a gash in her cheek, her eyes dark, and charges across the diner, leaping onto the window blinds and scuttling up them to the inverted V-shaped ceiling, which is scampered over by her. A pump-action shotgun is fired by Bob, but she leaps in front of him and swats him away; the shotgun falls to the floor in front of Jeep, who picks it up as Gladys approaches. Jeep closes his eyes, and without him firing, Gladys slows to a halt at his feet. He looks up to see Kyle holding a smoking pistol as Howard lies in a puddle of blood on the floor, gasping for breath, and Sandra runs to him, her hands covered in his blood. Kyle puts the gun in his waistband and runs over, placing a napkin and his scarf over Howard's wound. Audrey, sitting on a bench seat, hugs her knees and shivers as her head is dripped on by blood from the ceiling, spotting two stains above her. Percy and Kyle haul Howard to the SUV, dragging his toes on the ground, and they load him into the back with Sandra and Audrey. The SUV is reversed, then it heads back onto the road for the dark cloud in the distance. Audrey spots the dark cloud on the road, resembling smoke spreading upwards, as a fly comes in through a grill, and others are splatted into the windscreen. Flies storm in through the grill by the thousands. In the men's room at the diner, a cubicle is thrown up in by Jeep as Bob stands by a nearby sink, drinking from a can. Bob sees Jeep's reflection in the mirror and pats Jeep's shoulder, then he hears a car as the others return and turns. He grabs Percy, looks up as Percy rushes inside, and sees a giant storm of flies looming overhead, darkening the sky above him. He retreats inside, where the gruesome face of old Gladys is uncovered from under a plastic sheet. Bob and Jeep, along with Kyle, carry Gladys out and watch the police squad car approaching as Kyle turns to Jeep, then Bob."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Charlie, wearing a name badge, approaches as Sandra smiles tensely. The door opens, and Jeep enters the kitchen, noticing a steak covered with flies. Charlie's smile fades, and she glares as everyone turns to the sweet old lady. Charlie slams the bill down and heads to the kitchen. Jeep looks at the old lady, seeing her rare steak covered with flies as she cuts it. Audrey grins as Gladys bites Howard's neck, causing him to fall. Gladys tips her table, Percy throws a frying pan at her, hitting her. She straightens, a gash on her cheek, eyes dark, and charges across the diner, climbing the window blinds to the ceiling. Bob fires a shotgun, but she leaps and swats him away; the shotgun falls to Jeep, who picks it up as Gladys approaches. Jeep closes his eyes, and Gladys halts at his feet without him firing. He sees Kyle holding a smoking pistol as Howard lies in blood, gasping, and Sandra runs to him, hands bloody. Kyle places a napkin and scarf over Howard's wound. Audrey, on a bench, hugs her knees, shivering as blood drips from the ceiling, spotting stains above. Percy and Kyle drag Howard to the SUV, loading him with Sandra and Audrey. The SUV reverses, then heads for the dark cloud. Audrey sees the dark cloud, resembling smoke, as flies enter through the grill, splatting on the windscreen. Flies swarm through the grill by the thousands. In the diner's men's room, Jeep vomits in a cubicle as Bob drinks from a can. Bob sees Jeep's reflection and pats his shoulder, then hears a car as the others return. He grabs Percy, sees a storm of flies darkening the sky, and retreats inside, uncovering Gladys's gruesome face. Bob, Jeep, and Kyle carry Gladys out, watching the approaching police car as Kyle turns to Jeep, then Bob."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Charlie, wearing a name badge, approaches as Sandra smiles tensely. Jeep enters, heading to the kitchen, where a steak is fly-covered. Charlie's smile fades, glaring as everyone turns to the sweet old lady. Charlie slams the bill and goes to the kitchen. Jeep notices the lady's steak is fly-covered as she cuts it. Audrey grins as Gladys bites Howard's neck, causing him to fall. Gladys tips her table, Percy throws a frying pan, hitting her. She straightens, a cheek gash, eyes dark, and charges, leaping onto the window blinds, scuttling to the ceiling. Bob fires a shotgun, but she swats him away; the shotgun falls to Jeep, who picks it up as Gladys approaches. Jeep closes his eyes, and Gladys halts at his feet. Kyle holds a smoking pistol as Howard lies in blood, gasping, and Sandra runs to him, hands bloody. Kyle places a napkin and scarf on Howard's wound. Audrey, on a bench, shivers as blood drips on her, spotting stains above. Percy and Kyle haul Howard to the SUV, loading him with Sandra and Audrey. The SUV heads for a dark cloud. Audrey sees the cloud, resembling smoke, as flies enter through a grill, splatting on the windscreen. Flies storm in by thousands. In the diner's men's room, Jeep vomits as Bob drinks from a can. Bob pats Jeep's shoulder, hears a car as others return, and sees a fly storm darkening the sky. He retreats inside, uncovering Gladys's gruesome face. Bob, Jeep, and Kyle carry Gladys out, watching the police squad car approach."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Charlie, who is wearing a name badge prominently displayed on her chest, casually saunters over as Sandra forces a smile through her gritted teeth. Just then, the door swings open, and Jeep makes his entrance, heading directly to the kitchen, where a steak lies on the counter, disturbingly covered with flies. Charlie's cheerful smile quickly fades, and she glares as everyone in the room turns their attention to the dear, sweet old lady. With a sharp motion, Charlie slams down the bill and storms off to the kitchen. Jeep glances across at the old lady and begins to walk towards her, noticing with growing concern that her rare steak is swarming with flies as she nonchalantly cuts into it. Audrey grins mischievously as Gladys suddenly bites a chunk from Howard's neck, causing him to collapse to the floor. In the ensuing chaos, Gladys tips over her table, prompting Percy to grab a frying pan and hurl it at her, striking her squarely. She straightens up, revealing a gash on her cheek, her eyes dark and menacing, and charges across the diner. With surprising agility, she leaps onto the window blinds and scuttles up them to the inverted V-shaped ceiling, scampering across it. Bob, armed with a pump-action shotgun, fires at her, but she deftly leaps in front of him and swats him away; the shotgun clatters to the floor in front of Jeep, who picks it up as Gladys approaches menacingly. Jeep closes his eyes, and Gladys inexplicably slows to a halt at his feet without him having to fire a single shot. He looks up to see Kyle holding a smoking pistol, while Howard lies in a growing puddle of blood on the floor, gasping for breath. Sandra rushes to him, her hands quickly becoming covered in his blood. Kyle tucks the gun into his waistband and hurries over, placing a napkin and his scarf over Howard's wound in an attempt to staunch the bleeding. Audrey, sitting on a bench seat, hugs her knees tightly and shivers as blood drips from the ceiling onto her head, spotting two ominous stains above her. Percy and Kyle work together to haul Howard to the SUV, dragging his toes along the ground, and load him into the back with Sandra and Audrey. The SUV reverses, then heads back onto the road, making its way toward the ominous dark cloud looming in the distance. Audrey notices the dark cloud on the road, which eerily resembles smoke spreading upwards, as a fly buzzes in through a grill, and others splatter against the windscreen. Flies begin to storm in through the grill by the thousands, creating a chaotic scene. In the men's room at the diner, Jeep is overcome and throws up in a cubicle, while Bob stands by a nearby sink, drinking from a can. Bob catches sight of Jeep's reflection in the mirror and gives his shoulder a reassuring pat, then turns when he hears the sound of a car as the others return. He quickly grabs Percy, looks up as Percy rushes inside, and sees a massive storm of flies looming overhead, darkening the sky ominously above him. He retreats inside, where the gruesome face of old Gladys is uncovered from under a plastic sheet. Bob and Jeep, along with Kyle, carry Gladys out and watch the approaching police squad car as Kyle turns to look at Jeep, then Bob, with a sense of urgency."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Charlie, whose name badge is prominently displayed for all to see on her chest, casually saunters over to the scene as Sandra forces a strained smile, teeth clenched tightly in an attempt to mask her discomfort. Just at that moment, the door swings wide open, and Jeep strides in purposefully, making a beeline straight for the kitchen. There, a steak waits on the counter, disturbingly surrounded and covered by a swarm of flies. Charlie, her previously cheerful smile quickly fading away, glares intensely as every person in the room turns their focus to the dear, sweet old lady present. With a sharp, decisive motion, Charlie slams down the bill onto the table and storms off, heading toward the kitchen. Meanwhile, Jeep casts a glance across the room at the old lady and begins to walk toward her. He notices with mounting concern that her rare steak is swarming with flies, even as she nonchalantly continues to cut into it. Audrey, observing the scene, grins mischievously just as Gladys, in a sudden surprise move, bites a chunk from Howard's neck, causing him to collapse dramatically to the floor. In the ensuing chaotic fray, Gladys tips her table over, prompting Percy to reach for a frying pan and hurl it at her aggressively, striking her squarely. She straightens up, revealing a gash on her cheek, her eyes now dark and menacing, and charges forcefully across the diner. With surprising agility and speed, she leaps onto the window blinds and scuttles up them to the inverted V-shaped ceiling, scampering quickly across it. Bob, armed with a powerful pump-action shotgun, fires at her, but she nimbly leaps in front of him, swatting him aside as if he were nothing; the shotgun clatters noisily to the floor in front of Jeep, who picks it up as Gladys approaches with a menacing air. Jeep, closing his eyes in concentration, inexplicably witnesses Gladys slow to a halt at his feet, without him having to fire a single shot. He then looks up to see Kyle holding a smoking pistol, while Howard lies on the floor, gasping for breath in a growing puddle of his own blood. Sandra rushes over to him, her hands quickly becoming covered in his blood. Kyle tucks the gun into his waistband and hurries to the wounded man, placing a napkin and his scarf over Howard's wound in a desperate attempt to staunch the bleeding. Audrey, sitting curled up on a bench seat, hugs her knees tightly and shivers as drops of blood drip ominously from the ceiling onto her head, spotting two threatening stains above her. Working together with urgency, Percy and Kyle manage to haul Howard to the waiting SUV, dragging his toes along the ground, and load him carefully into the back alongside Sandra and Audrey. The SUV reverses carefully, then pulls back onto the road, making its way toward an ominous dark cloud looming threateningly in the distance. Audrey notices with growing anxiety the dark cloud on the road ahead, eerily resembling smoke as it spreads ominously upwards, while a fly buzzes in annoyingly through a grill, and others splatter against the windshield. Flies start to storm in through the grill by the thousands, creating a chaotic, overwhelming scene. Meanwhile, in the men's room at the diner, Jeep is overcome and throws up in a cubicle, while Bob stands by a nearby sink, drinking from a can to steady himself. Bob catches sight of Jeep's reflection in the mirror and gives his shoulder a reassuring pat, then turns quickly when he hears the unmistakable sound of a car as the others return. He quickly grabs Percy, looking up just in time to see Percy rush inside, and sees a massive storm of flies looming overhead, darkening the sky ominously above him. He retreats inside, where the gruesome face of old Gladys is suddenly uncovered from under a plastic sheet. Bob and Jeep, along with Kyle, carry Gladys out into the open and watch with apprehension as the approaching police squad car nears them. Kyle turns with a sense of urgency to look at Jeep, then Bob, sharing a moment of silent understanding."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Charlie, wearing a name badge that identifies her, casually saunters over to where Sandra is standing, who is smiling through gritted teeth, trying to maintain her composure. As the door swings open, Jeep enters the room and makes his way directly to the kitchen, where he is met with the unpleasant sight of a steak that is covered with flies. Observing this, Charlie's smile quickly fades, and she glares with frustration as the attention of everyone in the room shifts to the dear, sweet old lady present. In a moment of irritation, Charlie slams the bill down on the table and heads towards the kitchen. Meanwhile, Jeep glances across the room at the old lady and begins to walk towards her, noticing with some concern that her rare steak is also covered with flies as she nonchalantly cuts into it. Audrey, sitting nearby, grins as Gladys suddenly bites a chunk from Howard's neck, causing him to collapse to the floor. In the ensuing chaos, Gladys tips over her table, prompting Percy to grab a frying pan and hurl it at Gladys, striking her. Despite the impact, she straightens up, revealing a gash on her cheek, her eyes now dark and menacing, and charges across the diner. With surprising agility, she leaps onto the window blinds and scuttles up them to the inverted V-shaped ceiling, scampering over it with ease. Bob, reacting quickly, fires a pump-action shotgun, but Gladys deftly leaps in front of him and swats him away, causing the shotgun to fall to the floor in front of Jeep. Seizing the opportunity, Jeep picks up the shotgun as Gladys approaches him menacingly. In a moment of calm, Jeep closes his eyes, and Gladys inexplicably slows to a halt at his feet without him having to fire a shot. Opening his eyes, he looks up to see Kyle holding a smoking pistol, having just fired it, while Howard lies on the floor in a puddle of blood, gasping for breath. Sandra rushes to Howard's side, her hands becoming covered in his blood as she tries to help him. Kyle quickly tucks the gun into his waistband and runs over to assist, placing a napkin and his scarf over Howard's wound in an attempt to staunch the bleeding. Meanwhile, Audrey, sitting on a bench seat, hugs her knees tightly and shivers as blood drips from the ceiling onto her head, prompting her to look up and spot two stains above her. Percy and Kyle work together to haul Howard to the SUV, dragging his toes along the ground as they load him into the back with Sandra and Audrey. The SUV reverses out of its spot and then drives back onto the road, heading towards a dark cloud looming in the distance. As they drive, Audrey notices the dark cloud on the road, which resembles smoke spreading upwards, and watches as a fly enters through a grill, followed by others that splat against the windscreen. Suddenly, flies begin to storm in through the grill by the thousands, creating a chaotic scene. Back at the diner, in the men's room, Jeep is overcome with nausea and throws up in a cubicle while Bob stands by a nearby sink, drinking from a can. Bob catches sight of Jeep's reflection in the mirror and offers a reassuring pat on Jeep's shoulder. However, he is distracted by the sound of a car as the others return, prompting him to grab Percy and look up to see a giant storm of flies looming overhead, darkening the sky ominously. He quickly retreats inside, where the gruesome face of old Gladys is uncovered from under a plastic sheet. Bob, Jeep, and Kyle work together to carry Gladys out and watch as a police squad car approaches, with Kyle turning to exchange a glance with Jeep and then Bob, as they brace themselves for what comes next."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Charlie, wearing a name badge, approaches as Sandra forces a smile. Jeep enters and heads to the kitchen, noticing a steak covered with flies. Charlie's smile fades, and she glares at the sweet old lady, slamming down the bill before heading to the kitchen. Jeep observes the old lady cutting into her fly-covered steak. Audrey grins as Gladys bites Howard's neck, causing him to collapse. Gladys tips her table, and Percy throws a frying pan at her, hitting her. She straightens, a gash on her cheek, and charges across the diner, climbing the window blinds to the ceiling. Bob fires a shotgun, but Gladys swats him away, and the shotgun lands in front of Jeep. As Gladys approaches, Jeep closes his eyes, and she halts at his feet. He sees Kyle holding a smoking pistol as Howard lies bleeding, with Sandra rushing to him. Kyle places a napkin and scarf over Howard's wound. Audrey, sitting on a bench, shivers as blood drips from the ceiling, spotting stains above her. Percy and Kyle drag Howard to the SUV, loading him in with Sandra and Audrey. The SUV reverses and heads toward a dark cloud. Audrey notices the cloud, resembling smoke, as flies enter through the grill and splat on the windscreen. In the men's room, Jeep vomits while Bob drinks from a can, patting Jeep's shoulder. Hearing a car, Bob sees a storm of flies darkening the sky and retreats inside, uncovering Gladys's gruesome face. Bob, Jeep, and Kyle carry Gladys out, watching the approaching police squad car."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Charlie, identifiable by her name badge from a local community center where she volunteers, saunters over as Sandra smiles through gritted teeth, likely from the tension of the moment. The door opens, and Jeep, known for often driving an old military-style vehicle, walks in, heading to the kitchen, where a steak is covered with flies—a common problem in the area during the summer heat. Charlie's smile fades, and she glares as everyone turns to the dear, sweet old lady, a frequent visitor who is typically treated with respect. Charlie slams down the bill and goes to the kitchen. Jeep looks across at the old lady and begins to walk towards her, noticing her rare steak is covered with flies as she cuts into it, unfazed by the insects. Audrey, the waitress known for her quick wit, grins as Gladys, surprisingly aggressive for her age, bites a chunk from Howard's neck, causing him to fall to the floor. This shocking action creates chaos in the diner. Gladys tips her table, Percy, a former baseball player, grabs a frying pan, and throws it at Gladys, hitting her with surprising accuracy. She straightens up, a gash in her cheek, her eyes dark with anger, and charges across the diner, leaping onto the window blinds and scuttling up them to the inverted V-shaped ceiling, which she scampers over with an agility defying her years. Bob, a retired veteran, fires a pump-action shotgun, but she leaps in front of him and swats him away like a seasoned acrobat; the shotgun falls to the floor in front of Jeep, who picks it up as Gladys approaches. Jeep closes his eyes, possibly reflecting on his past experiences in conflict zones, and Gladys slows to a halt at his feet without him firing. He looks up to see Kyle, a security officer known for his fast reflexes, holding a smoking pistol as Howard lies in a puddle of blood on the floor, gasping for breath, and Sandra runs to him, her hands covered in his blood as she tries to staunch the flow. Kyle puts the gun in his waistband and runs over, placing a napkin and his scarf over Howard's wound, improvising first aid as best as he can. Audrey, sitting on a bench seat, hugs her knees and shivers as blood drips from the ceiling onto her head, spotting two stains above her that seem to grow larger by the second. Percy and Kyle haul Howard to the SUV, a sturdy vehicle suited for rough terrain, dragging his toes on the ground, and load him into the back with Sandra and Audrey. The SUV reverses, then goes back onto the road, heading for the dark cloud in the distance, which ominously resembles a brewing storm. Audrey spots the dark cloud on the road, which looks like smoke spreading upwards, as a fly comes in through a grill, and others splat into the windscreen, a testament to the growing infestation. Flies storm in through the grill by the thousands, a phenomenon not uncommon in the region during certain times of the year. In the men's room at the diner, Jeep throws up in a cubicle, possibly from stress or the chaotic scenes, as Bob stands by a nearby sink, drinking from a can of soda to steady his nerves. Bob sees Jeep's reflection in the mirror and pats Jeep's shoulder reassuringly, then turns when he hears a car as the others return. He grabs Percy, looks up as Percy rushes inside, and sees a giant storm of flies looming overhead, darkening the sky above him like an apocalyptic scene. He retreats inside, where the gruesome face of old Gladys, now lifeless, is uncovered from under a plastic sheet, revealing her true form. Bob and Jeep, along with Kyle, carry Gladys out with caution and watch the approaching police squad car as Kyle turns to Jeep, then Bob, indicating a shared concern about the unfolding events."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Charlie wearing a name badge saunters over as Sandra smiles through gritted teeth  The door opens and Jeep walks in heading to the kitchen where a steak is covered with flies  Charlie's smile fades and she glares as everyone turns to the dear sweet old lady  the shotgun falls to the floor in front of Jeep who picks it up as Gladys approaches  Jeep closes his eyes and Gladys slows to a halt at his feet without him firing  He looks up to see Kyle holding a smoking pistol as Howard lies in a puddle of blood on the floor gasping for breath and Sandra runs to him her hands covered in his blood  Kyle puts the gun in his waistband and runs over placing a napkin and his scarf over Howard's wound  Audrey sitting on a bench seat hugs her knees and shivers as blood drips from the ceiling onto her head spotting two stains above her  Percy and Kyle haul Howard to the SUV dragging his toes on the ground and load him into the back with Sandra and Audrey  The SUV reverses then goes back onto the road heading for the dark cloud in the distance  Audrey spots the dark cloud on the road which looks like smoke spreading upwards as a fly comes in through a grill and others splat into the windscreen  Flies storm in through the grill by the thousands  In the men's room at the diner Jeep throws up in a cubicle as Bob stands by a nearby sink drinking from a can  Bob sees Jeep's reflection in the mirror and pats Jeep's shoulder  then turns when he hears a car as the others return  He grabs  Percy looks up as Percy rushes inside and sees a giant storm of flies looming overhead darkening the sky above him  Charlie slams down the bill and goes to the kitchen  Jeep looks across at the old lady and begins to walk towards her noticing her rare steak is covered with flies as she cuts into it  Audrey grins as Gladys bites a chunk from Howard's neck causing him to fall to the floor  Gladys tips her table  Percy grabs a frying pan and throws it at Gladys hitting her  She straightens up a gash in her cheek her eyes dark and charges across the diner leaping onto the window blinds and scuttling up them to the inverted Vshaped ceiling which she scampers over  Bob fires a pumpaction shotgun but she leaps in front of him and swats him away  the shotgun falls to the floor in front of Jeep who picks it up as Gladys approaches  Jeep closes his eyes and Gladys slows to a halt at his feet without him firing  He looks up to see Kyle holding a smoking pistol as Howard lies in a puddle of blood on the floor gasping for breath and Sandra runs to him her hands covered in his blood  Kyle puts the gun in his waistband and runs over placing a napkin and his scarf over Howard's wound  Audrey sitting on a bench seat hugs her knees and shivers as blood drips from the ceiling onto her head spotting two stains above her  Percy and Kyle haul Howard to the SUV dragging his toes on the ground and load him into the back with Sandra and Audrey  The SUV reverses then goes back onto the road heading for the dark cloud in the distance  Audrey spots the dark cloud on the road which looks like smoke spreading upwards as a fly comes in through a grill and others splat into the windscreen  Flies storm in through the grill by the thousands  In the men's room at the diner Jeep throws up in a cubicle as Bob stands by a nearby sink drinking from a can  Bob sees Jeep's reflection in the mirror and pats Jeep's shoulder  then turns when he hears a car as the others return  He grabs  Percy looks up as Percy rushes inside and sees a giant storm of flies looming overhead darkening the sky above him  He retreats inside where the gruesome face of old Gladys is uncovered from under a plastic sheet  Bob and Jeep along with Kyle carry Gladys out and watch the approaching police squad car as Kyle turns to Jeep  then Bob"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Charlie wearing a name badge saunters over as Sandra smiles through gritted teeth. The door opens and Jeep walks in heading to the kitchen where a steak is covered with flies. Charlie's smile fades and she glares as everyone turns to the dear sweet old lady. Charlie slams down the bill and goes to the kitchen. Jeep looks across at the old lady and begins to walk towards her noticing her rare steak is covered with flies as she cuts into it. Audrey grins as Gladys bites a chunk from Howard's neck causing him to fall to the floor. Gladys tips her table. Percy grabs a frying pan and throws it at Gladys hitting her. She straightens up a gash in her cheek her eyes dark and charges across the diner leaping onto the window blinds and scuttling up them to the inverted Vshaped ceiling which she scampers over. Bob fires a pumpaction shotgun but she leaps in front of him and swats him away. the shotgun falls to the floor in front of Jeep who picks it up as Gladys approaches. Jeep closes his eyes and Gladys slows to a halt at his feet without him firing. He looks up to see Kyle holding a smoking pistol as Howard lies in a puddle of blood on the floor gasping for breath and Sandra runs to him her hands covered in his blood. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Kyle puts the gun in his waistband and runs over placing a napkin and his scarf over Howard's wound. Audrey sitting on a bench seat hugs her knees and shivers as blood drips from the ceiling onto her head spotting two stains above her. Percy and Kyle haul Howard to the SUV dragging his toes on the ground and load him into the back with Sandra and Audrey. The SUV reverses then goes back onto the road heading for the dark cloud in the distance. Audrey spots the dark cloud on the road which looks like smoke spreading upwards as a fly comes in through a grill and others splat into the windscreen. Flies storm in through the grill by the thousands. In the men's room at the diner Jeep throws up in a cubicle as Bob stands by a nearby sink drinking from a can. Bob sees Jeep's reflection in the mirror and pats Jeep's shoulder. then turns when he hears a car as the others return. He grabs. Percy looks up as Percy rushes inside and sees a giant storm of flies looming overhead darkening the sky above him. He retreats inside where the gruesome face of old Gladys is uncovered from under a plastic sheet. Bob and Jeep along with Kyle carry Gladys out and watch the approaching police squad car as Kyle turns to Jeep. then Bob."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Charlie wearing a name badge saunters over as Sandra smiles through gritted teeth. The door opens and Jeep walks in heading to the kitchen where a steak is covered with flies. Charlie's smile fades and she glares as everyone turns to the dear sweet old lady. Charlie slams down the bill and goes to the kitchen. Jeep looks across at the old lady and begins to walk towards her noticing her rare steak is covered with flies as she cuts into it. Audrey grins as Gladys bites a chunk from Howard's neck causing him to fall to the floor. Gladys tips her table. Percy grabs a frying pan and throws it at Gladys hitting her. She straightens up a gash in her cheek her eyes dark and charges across the diner leaping onto the window blinds and scuttling up them to the inverted Vshaped ceiling which she scampers over. Bob fires a pumpaction shotgun but she leaps in front of him and swats him away. the shotgun falls to the floor in front of Jeep who picks it up as Gladys approaches. Jeep closes his eyes and Gladys slows to a halt at his feet without him firing. He looks up to see Kyle holding a smoking pistol as Howard lies in a puddle of blood on the floor gasping for breath and Sandra runs to him her hands covered in his blood. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Kyle puts the gun in his waistband and runs over placing a napkin and his scarf over Howard's wound. Audrey sitting on a bench seat hugs her knees and shivers as blood drips from the ceiling onto her head spotting two stains above her. Percy and Kyle haul Howard to the SUV dragging his toes on the ground and load him into the back with Sandra and Audrey. The SUV reverses then goes back onto the road heading for the dark cloud in the distance. Audrey spots the dark cloud on the road which looks like smoke spreading upwards as a fly comes in through a grill and others splat into the windscreen. Flies storm in through the grill by the thousands. In the men's room at the diner Jeep throws up in a cubicle as Bob stands by a nearby sink drinking from a can. Bob sees Jeep's reflection in the mirror and pats Jeep's shoulder. then turns when he hears a car as the others return. He grabs. Percy looks up as Percy rushes inside and sees a giant storm of flies looming overhead darkening the sky above him. He retreats inside where the gruesome face of old Gladys is uncovered from under a plastic sheet. Bob and Jeep along with Kyle carry Gladys out and watch the approaching police squad car as Kyle turns to Jeep. then Bob."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Charlie wearing a name badge saunters over as Sandra smiles through gritted teeth. The door opens and Jeep walks in heading to the kitchen where a steak is covered with flies. Charlie's smile fades and she glares as everyone turns to the dear sweet old lady. Charlie slams down the bill and goes to the kitchen. Jeep looks across at the old lady and begins to walk towards her noticing her rare steak is covered with flies as she cuts into it. Audrey grins as Gladys bites a chunk from Howard's neck causing him to fall to the floor. Gladys tips her table. Bob sees Jeep's reflection in the mirror and pats Jeep's shoulder. then turns when he hears a car as the others return. He grabs. Percy looks up as Percy rushes inside and sees a giant storm of flies looming overhead darkening the sky above him. He retreats inside where the gruesome face of old Gladys is uncovered from under a plastic sheet. Bob and Jeep along with Kyle carry Gladys out and watch the approaching police squad car as Kyle turns to Jeep. then Bob."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Charlie wearing a name badge saunters over as Sandra smiles through gritted teeth. The door opens and Jeep walks in heading to the kitchen where a steak is covered with flies. Charlie's smile fades and she glares as everyone turns to the dear sweet old lady. He retreats inside where the gruesome face of old Gladys is uncovered from under a plastic sheet. Bob and Jeep along with Kyle carry Gladys out and watch the approaching police squad car as Kyle turns to Jeep. then Bob."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The elephant, wearing a name badge, saunters over as the giraffe smiles through gritted teeth. The door opens, and the penguin walks in, heading to the kitchen, where a steak is covered with flies. The elephant's smile fades, and the elephant glares as everyone turns to the dear, sweet old raccoon. The elephant slams down the bill and goes to the kitchen. The penguin looks across at the old raccoon and begins to walk towards her, noticing her rare steak is covered with flies as she cuts into it. The kangaroo grins as the hippo bites a chunk from the rabbit's neck, causing the rabbit to fall to the floor. The hippo tips her table, the fox grabs a frying pan, and throws it at the hippo, hitting her. The hippo straightens up, a gash in her cheek, her eyes dark, and charges across the diner, leaping onto the window blinds and scuttling up them to the inverted V-shaped ceiling, which she scampers over. The bear fires a pump-action shotgun, but the hippo leaps in front of him and swats him away; the shotgun falls to the floor in front of the penguin, who picks it up as the hippo approaches. The penguin closes his eyes, and the hippo slows to a halt at his feet without him firing. He looks up to see the alligator holding a smoking pistol as the rabbit lies in a puddle of blood on the floor, gasping for breath, and the giraffe runs to him, her hands covered in his blood. The alligator puts the gun in his waistband and runs over, placing a napkin and his scarf over the rabbit's wound. The kangaroo, sitting on a bench seat, hugs her knees and shivers as blood drips from the ceiling onto her head, spotting two stains above her. The fox and the alligator haul the rabbit to the SUV, dragging his toes on the ground, and load him into the back with the giraffe and the kangaroo. The SUV reverses, then goes back onto the road, heading for the dark cloud in the distance. The kangaroo spots the dark cloud on the road, which looks like smoke spreading upwards, as a fly comes in through a grill, and others splat into the windscreen. Flies storm in through the grill by the thousands. In the men's room at the diner, the penguin throws up in a cubicle as the bear stands by a nearby sink, drinking from a can. The bear sees the penguin's reflection in the mirror and pats the penguin's shoulder, then turns when he hears a car as the others return. He grabs the fox, looks up as the fox rushes inside, and sees a giant storm of flies looming overhead, darkening the sky above him. He retreats inside, where the gruesome face of old Gladys is uncovered from under a plastic sheet. The bear and the penguin, along with the alligator, carry Gladys out and watch the approaching police squad car as the alligator turns to the penguin, then the bear."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Charlie, wearing a name badge, saunters over as Sandra smiles through gritted teeth. The window opens, and Jeep walks in, heading to the attic, where a watermelon is covered with beetles. Charlie's smile fades, and she glares as everyone turns to the dear, sweet old lady. Charlie slams down the map and goes to the attic. Jeep looks across at the old lady and begins to walk towards her, noticing her rare watermelon is covered with beetles as she cuts into it. Audrey grins as Gladys bites a chunk from Howard's shoulder, causing him to fall to the floor. Gladys tips her stool, Percy grabs a rolling pin, and throws it at Gladys, hitting her. She straightens up, a gash in her forehead, her eyes dark, and charges across the cafe, leaping onto the curtain rods and scuttling up them to the vaulted-shaped ceiling, which she scampers over. Bob fires a crossbow, but she leaps in front of him and swats him away; the crossbow falls to the floor in front of Jeep, who picks it up as Gladys approaches. Jeep closes his eyes, and Gladys slows to a halt at his feet without him firing. He looks up to see Kyle holding a smoking flare gun as Howard lies in a puddle of juice on the floor, gasping for breath, and Sandra runs to him, her hands covered in his juice. Kyle puts the flare gun in his waistband and runs over, placing a doily and his bandana over Howard's wound. Audrey, sitting on a rocking chair, hugs her knees and shivers as juice drips from the roof onto her head, spotting two stains above her. Percy and Kyle haul Howard to the minivan, dragging his toes on the ground, and load him into the back with Sandra and Audrey. The minivan reverses, then goes back onto the road, heading for the dark mist in the distance. Audrey spots the dark mist on the road, which looks like soot spreading upwards, as an ant comes in through a gate, and others splat into the windscreen. Ants storm in through the gate by the thousands. In the women's room at the cafe, Jeep throws up in a cubicle as Bob stands by a nearby basin, drinking from a bottle. Bob sees Jeep's reflection in the mirror and pats Jeep's shoulder, then turns when he hears a motorcycle as the others return. He grabs Percy, looks up as Percy rushes inside, and sees a giant storm of ants looming overhead, darkening the sky above him. He retreats inside, where the gruesome face of old Gladys is uncovered from under a burlap sheet. Bob and Jeep, along with Kyle, carry Gladys out and watch the approaching fire truck as Kyle turns to Jeep, then Bob."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Charlie, wearing a name badge, hops over as Sandra smirks through gritted teeth. The door closes, and Jeep strolls in, singing to the kitchen, where a steak is glazed with syrup. Charlie's smile brightens, and she laughs as everyone gazes at the dear, sweet old lady. Charlie waves the bill and skips to the kitchen. Jeep stares across at the old lady and begins to dance towards her, admiring her rare steak glazed with syrup as she pokes it. Audrey grimaces as Gladys kisses a chunk from Howard's neck, prompting him to sit on the floor. Gladys polishes her table, Percy picks up a frying pan, and admires it at Gladys, tapping her. She stands up, a scratch on her cheek, her eyes bright, and skips across the diner, swinging onto the window blinds and sliding up them to the inverted V-shaped ceiling, which she dances over. Bob blows a pump-action shotgun, but she twirls in front of him and nudges him away; the shotgun slides to the floor in front of Jeep, who picks it up as Gladys arrives. Jeep closes his eyes, and Gladys dances to a stop at his feet without him playing. He looks up to see Kyle holding a steaming pistol as Howard reclines in a puddle of blood on the floor, catching his breath, and Sandra strolls to him, her hands marked in his blood. Kyle drops the gun in his waistband and jumps over, placing a napkin and his scarf over Howard's wound. Audrey, sitting on a bench seat, clutches her knees and trembles as paint drips from the ceiling onto her head, spotting two marks above her. Percy and Kyle dance Howard to the SUV, sliding his toes on the ground, and place him into the back with Sandra and Audrey. The SUV spins, then slides back onto the road, drifting toward the bright cloud in the distance. Audrey notices the bright cloud on the road, which resembles smoke swirling upwards, as a fly flutters in through a grill, and others tap into the windscreen. Flies soar in through the grill by the thousands. In the men's room at the diner, Jeep laughs in a cubicle as Bob stands by a nearby sink, sipping from a can. Bob sees Jeep's reflection in the mirror and nudges Jeep's shoulder, then spins when he hears a car as the others arrive. He hugs Percy, looks up as Percy strolls inside, and sees a giant storm of flies hovering overhead, lighting the sky above him. He advances inside, where the joyful face of old Gladys is revealed from under a plastic sheet. Bob and Jeep, along with Kyle, dance Gladys out and watch the coming police squad car as Kyle turns to Jeep, then Bob."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Teddy, wearing a cap, ambles over as Agatha grins through clenched jaws. The curtain opens, and Truck strolls in, heading to the pantry, where a carrot is swarmed with ants. Teddy's grin wanes, and he scowls as everyone turns to the dear, sweet ancient doll. Teddy slams down the receipt and goes to the pantry. Truck gazes across at the doll and begins to stroll towards it, noticing its rare carrot is swarmed with ants as it slices into it. Monica smirks as Greta gnaws a piece from Marvin's ear, causing him to collapse to the ground. Greta overturns her bookshelf, Norman grabs a spatula, and hurls it at Greta, striking her. She straightens up, a cut on her lip, her eyes shadowy, and rushes across the café, leaping onto the curtain rods and scrambling up them to the upside-down Y-shaped roof, which she scurries over. Hank blasts a water pistol, but she jumps in front of him and flicks him aside; the water pistol drops to the floor in front of Truck, who picks it up as Greta nears. Truck shuts his eyes, and Greta slows to a stop at his feet without him firing. He looks up to see Frank holding a steaming notebook as Marvin lies in a pool of milk on the ground, wheezing for air, and Agatha dashes to him, her fingers coated in his milk. Frank tucks the notebook in his sleeve and runs over, placing a napkin and his bandana over Marvin's cut. Monica, perched on a wooden stool, hugs her toes and trembles as milk drips from the roof onto her nose, spotting two blotches above her. Norman and Frank lift Marvin to the bicycle, dragging his fingers on the ground, and place him into the basket with Agatha and Monica. The bicycle reverses, then returns to the path, heading for the dark haze in the horizon. Monica notices the dark haze on the path, which resembles soot rising upward, as an ant enters through a mesh, and others splatter against the windshield. Ants swarm in through the mesh by the thousands. In the women's room at the café, Truck heaves in a stall as Hank stands by a nearby tub, sipping from a mug. Hank notices Truck's reflection in the window and taps Truck's shoulder, then turns when he hears a tractor as the others arrive. He seizes Norman, looks up as Norman rushes inside, and sees a colossal swarm of ants looming overhead, shadowing the sky above him. He retreats inside, where the ghastly visage of ancient Greta is uncovered from under a fabric tarp. Hank and Truck, along with Frank, carry Greta out and observe the approaching fire truck as Frank turns to Truck, then Hank."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Samantha, wearing a festival wristband, meanders over as Brian frowns through clenched jaws. The gate swings open, and Falcon prances in, heading to the garage, where a sandwich is swarming with ants. Samantha's grin vanishes, and she squints as everyone turns to the troublesome, loud young man. Samantha drops the invoice and rushes to the garage. Falcon gazes across at the young man and starts to stroll towards him, noticing his grilled sandwich is crawling with ants as he slices into it. Lucy chuckles as Agnes devours a piece from Harold's arm, causing him to slump to the ground. Agnes overturns her bench, Roger grips a spatula, and flings it at Agnes, striking her. She stands upright, a bruise on her forehead, her eyes fierce, and bolts across the restaurant, springing onto the curtain rods and scrambling up them to the sloped A-shaped roof, which she skitters over. Frank launches a paintball gun, but she leaps behind him and shoves him aside; the paintball gun drops to the floor in front of Falcon, who snatches it up as Agnes nears. Falcon closes his eyes, and Agnes halts at his feet without him shooting. He glances up to see Felix holding a steaming flare as Harold lies in a pool of red paint on the ground, panting heavily, and Brian rushes to him, his hands smeared in the red paint. Felix tucks the flare into his jacket and dashes over, placing a bandana and his handkerchief over Harold's wound. Lucy, sitting on a counter stool, curls up and trembles as paint drips from the roof onto her hair, noticing two splotches above her. Roger and Felix lift Harold to the minivan, dragging his shoes on the sidewalk, and load him into the back with Brian and Lucy. The minivan reverses, then heads back onto the highway, moving toward the looming shadow in the horizon. Lucy observes the shadow on the road, which resembles mist rising skyward, as a moth enters through a vent, and others smash into the windshield. Moths rush in through the vent by the hundreds. In the ladies' room at the restaurant, Falcon dry heaves in a stall as Frank leans on a nearby basin, sipping from a bottle. Frank catches Falcon's reflection in the mirror and nudges Falcon's arm, then swivels when he hears a vehicle as the rest return. He clutches Roger, glances up as Roger charges inside, and spots an enormous swarm of moths gathering overhead, dimming the heavens above him. He withdraws inside, where the grisly visage of young Agnes is revealed from beneath a canvas tarp. Frank and Falcon, alongside Felix, escort Agnes out and observe the oncoming emergency vehicle as Felix turns to Falcon, then Frank."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Charlie, sporting a name tag, strides over as Sandra beams with an uneasy smile. The hatch swings open, and Jeep strides in, making his way to the garage, where a bicycle is swarmed with bees. Charlie's grin vanishes, and she frowns as everyone pivots to the dear, sweet elderly man. Charlie tosses down the receipt and heads to the garage. Jeep glances at the elderly man and begins to shuffle towards him, noticing his uncooked pasta is infested with bees as he breaks it apart. Audrey chuckles as Gladys gnaws a bite from Howard's shoulder, leading him to topple. Gladys flips her chair, Percy grabs a saucepan, and hurls it at Gladys, striking her. She stands upright, a tear in her dress, her eyes dim, and dashes across the café, vaulting onto the curtain rods and skimming up them to the triangular roof, which she scrambles over. Bob shoots a water pistol, but she dodges in front of him and pats him aside; the water pistol clatters to the tile in front of Jeep, who snatches it up as Gladys nears. Jeep closes his eyes, and Gladys grinds to a stop at his feet without him spraying. He glances up to see Kyle wielding a steaming teapot as Howard lies in a pool of syrup on the floor, wheezing, and Sandra rushes to him, her hands smeared with syrup. Kyle tucks the teapot in his jacket and dashes over, placing a handkerchief and his hat over Howard's injury. Audrey, lounging on a booth seat, hugs her elbows and trembles as syrup drips from the ceiling onto her hair, noticing two smudges above her. Percy and Kyle transport Howard to the van, dragging his sneakers on the concrete, and load him into the rear with Sandra and Audrey. The van withdraws, then re-enters the highway, aiming for the looming fog on the horizon. Audrey glimpses the looming fog on the road, which resembles soot rising, as a bee buzzes in through a vent, and others splatter against the windshield. Bees pour in through the vent by the hundreds. In the men's room at the café, Jeep heaves in a stall as Bob lingers by a nearby basin, sipping from a bottle. Bob spots Jeep's outline in the glass and taps Jeep's elbow, then swivels when he hears a truck as the others return. He seizes Percy, looks up as Percy dashes inside, and observes an immense swarm of bees gathering overhead, shading the horizon above him. He backs inside, where the terrifying visage of old Gladys is revealed from beneath a cloth covering. Bob and Jeep, along with Kyle, escort Gladys out and gaze at the nearing patrol car as Kyle turns to Jeep, then Bob."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Walter, sporting a dog collar, glides over as Tiffany grins through clenched fists. The gate swings, and Falcon hops in, navigating towards the pantry, where a pie is swarmed with beetles. Walter's grin vanishes, and he frowns as everyone glances toward the grumpy, cheerful young man. Walter hurls down the menu and strolls to the pantry. Falcon peers across at the young man and starts to amble in his direction, observing his golden pie is swarmed with beetles as he slices into it. Felicity chuckles as Marvin chomps a slice from Oliver's hat, sending him tumbling to the carpet. Marvin tips her chair, Leo clutches a spatula, and flings it at Marvin, striking her. She steadies herself, a scratch on her elbow, eyes gleaming, and dashes across the café, springing onto the curtain rods and scampering up them to the triangular-shaped roof, which she scurries over. Greg discharges a slingshot, but she vaults in front of him and flicks him aside; the slingshot tumbles to the carpet in front of Falcon, who picks it up as Marvin advances. Falcon closes his eyes, and Marvin halts at his ankles without him launching. He glances up to find Tony brandishing a steaming breadstick as Oliver sprawls in a puddle of ink on the carpet, struggling for air, and Tiffany dashes to him, her feet stained in his ink. Tony tucks the breadstick in his waistband and sprints over, placing a leaflet and his bracelet over Oliver's scratch. Felicity, perched on a bench cushion, hugs her elbows and quivers as ink dribbles from the roof onto her shoes, noticing two streaks above her. Leo and Tony lug Oliver to the trolley, dragging his heels on the pavement, and tuck him into the rear with Tiffany and Felicity. The trolley retreats, then proceeds onto the avenue, aiming for the bright star in the horizon. Felicity spots the bright star on the avenue, which resembles steam ascending upwards, as a beetle enters through a latch, and others smack into the mirror. Beetles swarm in through the latch by the hundreds. In the women's lounge at the café, Falcon heaves in a booth as Greg stands by a nearby fountain, sipping from a glass. Greg glimpses Falcon's face in the reflection and taps Falcon's elbow, then pivots when he hears a vehicle as the others arrive. He clutches Leo, gazes up as Leo dashes inside, and sees a gigantic cyclone of beetles hovering overhead, darkening the heavens above him. He retreats inside, where the cheerful face of young Marvin is unveiled from beneath a wool blanket. Greg and Falcon, along with Tony, escort Marvin out and observe the arriving detective patrol vehicle as Tony turns to Falcon, then Greg."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Charlie, wearing a name badge, approaches as Sandra forces a smile. Jeep enters, noticing flies on a steak, causing tension. Gladys bites Howard's neck, prompting chaos in the diner. Percy throws a frying pan at Gladys, who scuttles across the ceiling. Bob fires a shotgun, but Gladys dodges. Jeep takes the gun as Gladys stops before him, revealed to be shot by Kyle. Howard gasps for breath, with Sandra by his side. Kyle aids Howard, and they load him into an SUV with Sandra and Audrey. As they drive toward a dark cloud, flies invade the vehicle. At the diner, Jeep is comforted by Bob after vomiting. They watch a fly storm and uncover Gladys's gruesome face. Bob, Jeep, and Kyle carry her out as a police car approaches."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "then Bob Bob and Jeep along with Kyle carry Gladys out and watch the approaching police squad car as Kyle turns to Jeep  He retreats inside where the gruesome face of old Gladys is uncovered from under a plastic sheet  Percy looks up as Percy rushes inside and sees a giant storm of flies looming overhead darkening the sky above him  He grabs  then turns when he hears a car as the others return  Bob sees Jeep's reflection in the mirror and pats Jeep's shoulder  In the men's room at the diner Jeep throws up in a cubicle as Bob stands by a nearby sink drinking from a can  Flies storm in through the grill by the thousands  Audrey spots the dark cloud on the road which looks like smoke spreading upwards as a fly comes in through a grill and others splat into the windscreen  The SUV reverses then goes back onto the road heading for the dark cloud in the distance  Percy and Kyle haul Howard to the SUV dragging his toes on the ground and load him into the back with Sandra and Audrey  Audrey sitting on a bench seat hugs her knees and shivers as blood drips from the ceiling onto her head spotting two stains above her  Kyle puts the gun in his waistband and runs over placing a napkin and his scarf over Howard's wound  He looks up to see Kyle holding a smoking pistol as Howard lies in a puddle of blood on the floor gasping for breath and Sandra runs to him her hands covered in his blood  Jeep closes his eyes and Gladys slows to a halt at his feet without him firing  the shotgun falls to the floor in front of Jeep who picks it up as Gladys approaches  Bob fires a pumpaction shotgun but she leaps in front of him and swats him away  She straightens up a gash in her cheek her eyes dark and charges across the diner leaping onto the window blinds and scuttling up them to the inverted Vshaped ceiling which she scampers over  Percy grabs a frying pan and throws it at Gladys hitting her  Gladys tips her table  Audrey grins as Gladys bites a chunk from Howard's neck causing him to fall to the floor  Jeep looks across at the old lady and begins to walk towards her noticing her rare steak is covered with flies as she cuts into it  Charlie slams down the bill and goes to the kitchen  Charlie's smile fades and she glares as everyone turns to the dear sweet old lady  The door opens and Jeep walks in heading to the kitchen where a steak is covered with flies  Charlie wearing a name badge saunters over as Sandra smiles through gritted teeth "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Bob fires a pumpaction shotgun but she leaps in front of him and swats him away  Charlie wearing a name badge saunters over as Sandra smiles through gritted teeth  In the men's room at the diner Jeep throws up in a cubicle as Bob stands by a nearby sink drinking from a can  then turns when he hears a car as the others return  Kyle puts the gun in his waistband and runs over placing a napkin and his scarf over Howard's wound  Audrey grins as Gladys bites a chunk from Howard's neck causing him to fall to the floor  Percy looks up as Percy rushes inside and sees a giant storm of flies looming overhead darkening the sky above him  Bob and Jeep along with Kyle carry Gladys out and watch the approaching police squad car as Kyle turns to Jeep  Bob sees Jeep's reflection in the mirror and pats Jeep's shoulder  Audrey sitting on a bench seat hugs her knees and shivers as blood drips from the ceiling onto her head spotting two stains above her  He retreats inside where the gruesome face of old Gladys is uncovered from under a plastic sheet  Percy and Kyle haul Howard to the SUV dragging his toes on the ground and load him into the back with Sandra and Audrey  The SUV reverses then goes back onto the road heading for the dark cloud in the distance  Percy grabs a frying pan and throws it at Gladys hitting her  Audrey spots the dark cloud on the road which looks like smoke spreading upwards as a fly comes in through a grill and others splat into the windscreen  The door opens and Jeep walks in heading to the kitchen where a steak is covered with flies  then Bob Flies storm in through the grill by the thousands  Jeep closes his eyes and Gladys slows to a halt at his feet without him firing  He grabs  He looks up to see Kyle holding a smoking pistol as Howard lies in a puddle of blood on the floor gasping for breath and Sandra runs to him her hands covered in his blood  Charlie's smile fades and she glares as everyone turns to the dear sweet old lady  Charlie slams down the bill and goes to the kitchen  the shotgun falls to the floor in front of Jeep who picks it up as Gladys approaches  Gladys tips her table  Jeep looks across at the old lady and begins to walk towards her noticing her rare steak is covered with flies as she cuts into it  She straightens up a gash in her cheek her eyes dark and charges across the diner leaping onto the window blinds and scuttling up them to the inverted Vshaped ceiling which she scampers over "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Audrey sitting on a bench seat hugs her knees and shivers as blood drips from the ceiling onto her head spotting two stains above her  Percy and Kyle haul Howard to the SUV dragging his toes on the ground and load him into the back with Sandra and Audrey  The SUV reverses then goes back onto the road heading for the dark cloud in the distance  Audrey spots the dark cloud on the road which looks like smoke spreading upwards as a fly comes in through a grill and others splat into the windscreen  Flies storm in through the grill by the thousands  In the men's room at the diner Jeep throws up in a cubicle as Bob stands by a nearby sink drinking from a can  Bob sees Jeep's reflection in the mirror and pats Jeep's shoulder  then turns when he hears a car as the others return  He grabs  Percy looks up as Percy rushes inside and sees a giant storm of flies looming overhead darkening the sky above him  He retreats inside where the gruesome face of old Gladys is uncovered from under a plastic sheet  Bob and Jeep along with Kyle carry Gladys out and watch the approaching police squad car as Kyle turns to Jeep  then Bob Charlie wearing a name badge saunters over as Sandra smiles through gritted teeth  The door opens and Jeep walks in heading to the kitchen where a steak is covered with flies  Charlie's smile fades and she glares as everyone turns to the dear sweet old lady  Charlie slams down the bill and goes to the kitchen  Jeep looks across at the old lady and begins to walk towards her noticing her rare steak is covered with flies as she cuts into it  Audrey grins as Gladys bites a chunk from Howard's neck causing him to fall to the floor  Gladys tips her table  Percy grabs a frying pan and throws it at Gladys hitting her  She straightens up a gash in her cheek her eyes dark and charges across the diner leaping onto the window blinds and scuttling up them to the inverted Vshaped ceiling which she scampers over  Bob fires a pumpaction shotgun but she leaps in front of him and swats him away  the shotgun falls to the floor in front of Jeep who picks it up as Gladys approaches  Jeep closes his eyes and Gladys slows to a halt at his feet without him firing  He looks up to see Kyle holding a smoking pistol as Howard lies in a puddle of blood on the floor gasping for breath and Sandra runs to him her hands covered in his blood  Kyle puts the gun in his waistband and runs over placing a napkin and his scarf over Howard's wound "
        }
      ]
    }
  ]
}