{
  "ground_truth": "On the roof, Kyle watches as the intruders slope off. They trudge away from the diner. Michael clutches on to Sandra, who sinks to her knees. Jeep helps Charlie up. She looks apprehensive as Michael approaches. Kyle leads in the others from the roof. Audrey tries to console her mother. Bob grimly strides forward. Michael stares at the others. He turns to Charlie. Her smile fades when she sees his somber face and steadfast gaze. Charlie closes her eyes. He loads an assault rifle, turns, and walks away from them. Outside, intermittent bright flashes illuminate the horizon. Kyle is on the roof with Percy. Kyle glances down at Percy, who is crouched low, leaning against a ledge. Percy looks around at Kyle. Percy turns away and leans a rifle over his arm. Kyle looks awkward. Percy watches as Kyle places the gun on the ledge. Kyle shakes his head. Percy blinks and glances down. Tears fall from his eyes. Kyle raises his head, then turns to stare at Percy beside him. Downstairs, Bob turned on the grill, then lights a cigarette with his lighter. He takes a deep drag, then breathes it out. He picks up a can and drinks from it. He looks across the room at Sandra, whose hair, which had been pulled tight, is now loose. He sets a beer down in front of her. Having wiped the top of the can, she gazes at it, then drinks. She sets it down on the table. Sandra buries her head in her hands. In the storeroom, Jeep looks at Michael curiously. Jeep takes a claw hammer off a hook. Michael hangs his head. He walks over to Jeep. Jeep stares frowning at Michael, who wears a benign expression. Michael leaves a thoughtful-looking Jeep. Bob stands on the roof, leaning against the wall. He drinks beer from a can and puffs on a cigarette. Wind whips through his hair. The sky is filled with dense, gray clouds. He flinches at the sound and looks out at a bank of gray mist. Michael stands on the roof, looking pensive. Michael stands on a roof, silhouetted against bright sunlight. He has wings. He's with an elder angel, Gabriel. An army of angels flies overhead. Michael slowly steps across the roof of the diner. The two children swings are blown back and forth by the wind. The strings of light bulbs shake. He drops his beer can. As gray mist rolls in, Bob is sitting by the wall dozing. Sandra is lying on the floor next to Audrey. She wakes and looks around anxiously. She sits up. Hearing the voice, she looks around. She slowly walks through the diner with her arms held stiffly away from her sides.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "On the rooftop, Kyle observes as the interlopers slant away. They plod away from the eatery. Michael grips onto Sandra, who sinks to her knees. Jeep assists Charlie up. She appears uneasy as Michael advances. Kyle leads in the others from the rooftop. Audrey attempts to soothe her mother. Bob somberly strides forward. Michael gazes at the others. He turns to Charlie. Her grin diminishes when she perceives his grave face and unwavering gaze. Charlie shuts her eyes. He loads an assault firearm, turns, and strides away from them. Outside, sporadic bright flashes illuminate the skyline. Kyle is on the rooftop with Percy. Kyle glances down at Percy, who is crouched low, leaning against a parapet. Percy looks around at Kyle. Percy turns away and leans a rifle over his arm. Kyle appears uneasy. Percy watches as Kyle places the weapon on the parapet. Kyle shakes his head. Percy blinks and glances down. Tears fall from his eyes. Kyle raises his head, then turns to gaze at Percy beside him. Downstairs, Bob turned on the grill, then lights a cigarette with his lighter. He takes a deep drag, then breathes it out. He picks up a can and drinks from it. He looks across the room at Sandra, whose hair, which had been pulled taut, is now loose. He sets a brew down in front of her. Having wiped the top of the can, she gazes at it, then drinks. She places it down on the table. Sandra buries her head in her hands. In the storage room, Jeep looks at Michael inquisitively. Jeep takes a claw hammer off a hook. Michael bows his head. He walks over to Jeep. Jeep stares frowning at Michael, who wears a harmless expression. Michael leaves a contemplative-looking Jeep. Bob stands on the rooftop, leaning against the wall. He drinks beer from a can and puffs on a cigarette. Wind whips through his hair. The sky is filled with thick, gray clouds. He flinches at the sound and looks out at a bank of gray fog. Michael stands on the rooftop, looking thoughtful. Michael stands on a rooftop, silhouetted against bright sunlight. He has wings. He's with an elder angel, Gabriel. An army of angels soars overhead. Michael slowly steps across the rooftop of the eatery. The two children swings are blown back and forth by the wind. The strings of light bulbs quiver. He drops his beer can. As gray fog rolls in, Bob is sitting by the wall dozing. Sandra is lying on the floor next to Audrey. She wakes and looks around anxiously. She sits up. Hearing the voice, she looks around. She slowly walks through the eatery with her arms held stiffly away from her sides."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "On the roof, the intruders are watched by Kyle as they slope off. The diner is trudged away from by them. Sandra is clutched by Michael, who sinks to her knees. Charlie is helped up by Jeep. An apprehensive look is seen on her face as Michael approaches. The others are led in from the roof by Kyle. Her mother is consoled by Audrey. Bob strides forward grimly. The others are stared at by Michael. He turns to Charlie. When she sees his somber face and steadfast gaze, her smile fades. Her eyes are closed by Charlie. An assault rifle is loaded by him, and he turns and walks away from them. Outside, the horizon is illuminated by intermittent bright flashes. Percy is on the roof with Kyle. Percy is glanced down at by Kyle, who is crouched low, leaning against a ledge. Kyle is looked around at by Percy. A rifle is turned away from and leaned over his arm by Percy. Kyle is looked at awkwardly. Kyle places the gun on the ledge while Percy watches. His head is shaken by Kyle. Percy blinks and glances down. Tears fall from his eyes. His head is raised by Kyle, then he turns to stare at Percy beside him. Downstairs, the grill was turned on by Bob, then a cigarette is lit with his lighter. A deep drag is taken by him, then it is breathed out. A can is picked up and drunk from by him. Sandra, whose hair is now loose, is looked across the room at by him. A beer is set down in front of her by him. The top of the can is wiped by her, then gazed at, then she drinks. It is set down on the table by her. Her head is buried in her hands by Sandra. In the storeroom, Michael is looked at curiously by Jeep. A claw hammer is taken off a hook by Jeep. His head is hung by Michael. He walks over to Jeep. Michael is stared at frowning by Jeep, who wears a benign expression. Jeep, looking thoughtful, is left by Michael. On the roof, Bob stands, leaning against the wall. Beer is drunk from a can by him and a cigarette is puffed on. Wind whips through his hair. Dense, gray clouds fill the sky. At the sound, he flinches and looks out at a bank of gray mist. Michael stands on the roof, looking pensive. Michael is silhouetted against bright sunlight on a roof. He has wings. An elder angel, Gabriel, is with him. Overhead, an army of angels flies. Michael slowly steps across the roof of the diner. The wind blows the two children's swings back and forth. The strings of light bulbs are shaken. His beer can is dropped. As gray mist rolls in, Bob sits by the wall dozing. Audrey lies on the floor next to Sandra. She wakes and looks around anxiously. She sits up. A voice is heard, and she looks around. She slowly walks through the diner with her arms held stiffly away from her sides."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "On the roof, Kyle watches as the intruders leave the diner. Michael supports Sandra, who kneels, while Jeep helps Charlie, who looks wary as Michael approaches. Kyle leads the others down, Audrey comforts her mother, and Bob strides forward. Michael’s stern expression makes Charlie's smile fade. He loads an assault rifle and walks away. Outside, the horizon lights up intermittently. Kyle, with Percy on the roof, looks awkward as Percy leans a rifle on his arm. Percy blinks, tears falling, while Kyle watches silently. \n\nDownstairs, Bob lights a cigarette, drinks from a can, and hands Sandra a beer. Her hair, once tight, is now loose as she takes a sip, then buries her head in her hands. In the storeroom, Jeep grabs a claw hammer, curiously observing Michael, who approaches and leaves Jeep thoughtful. On the roof, Bob drinks beer, smokes, and watches the mist roll in. Michael, on another roof with Gabriel, stands silhouetted by the sun, wings visible as angels fly overhead. Michael crosses the diner's roof slowly as wind moves the swings and light bulbs. Bob, dozing by the wall, drops his beer can. Sandra, waking beside Audrey, anxiously looks around, then walks stiffly through the diner."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "On the roof, Kyle watches the intruders depart. They trudge from the diner. Michael holds Sandra, who kneels. Jeep helps Charlie up, looking wary as Michael nears. Kyle leads others from the roof. Audrey comforts her mother as Bob strides forward. Michael turns to Charlie, her smile fading at his somber gaze. Charlie closes her eyes as he loads an assault rifle and departs. Outside, bright flashes light the horizon. Kyle, on the roof with Percy, glances at him as Percy turns with a rifle, tears falling. Kyle awkwardly places his gun on the ledge and stares at Percy. Downstairs, Bob lights a cigarette, drinks from a can, and looks at Sandra, her hair loose. He offers her a beer. She wipes the can, drinks, and puts her head in her hands. In the storeroom, Jeep observes Michael, takes a hammer, and frowns at Michael's benign expression. Michael leaves, deep in thought. Bob, on the roof, drinks and smokes, flinching at sounds as gray mist looms. Michael, with wings and Gabriel, stands silhouetted against sunlight as angels fly overhead. Crossing the diner roof, he drops his beer as wind moves swings and string lights. Gray mist rolls in as Bob dozes by a wall. Sandra lies next to Audrey, wakes, and anxiously looks around. She rises, hears a voice, and walks stiffly through the diner."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "On the rooftop, Kyle intently observes as the intruders gradually make their way off, departing from the vicinity of the diner. They move away with heavy steps, trudging into the distance. Michael closely holds onto Sandra, who collapses to her knees, overwhelmed. Meanwhile, Jeep offers assistance to Charlie, helping her back onto her feet. She appears apprehensive, her concern evident as Michael approaches them. Kyle takes the lead, guiding the others along as they descend from the rooftop. Audrey makes an effort to console her mother, offering comfort in the tense situation. Bob strides forward with a grim determination present in his steps. Michael's gaze sweeps over the group, observing them carefully. His eyes then fix on Charlie, whose smile gradually fades away as she notices the seriousness in his expression and the steadfastness in his gaze. Charlie closes her eyes, processing the moment. Michael proceeds to load an assault rifle with purpose, turns on his heels, and walks away from the group. Outside, the horizon intermittently bursts with bright flashes, casting an eerie glow. \n\nKyle remains on the roof, accompanied by Percy. He glances down at Percy, who is crouched low and leaning securely against a ledge. Percy shifts his gaze around to look at Kyle, then turns away, resting a rifle securely over his arm. Kyle appears awkward, unsure of how to proceed. Percy silently observes as Kyle places his gun on the ledge beside him. A gesture of resignation, Kyle shakes his head. Percy blinks slowly, a few tears trickling from his eyes as he glances downward. Kyle raises his head, turning to fix his stare on Percy, who sits beside him. \n\nDownstairs, Bob ignites the grill, the familiar flames flickering to life. He lights a cigarette using his trusty lighter, inhaling deeply before exhaling clouds of smoke. He lifts a can to his lips, taking a drink from it, then surveys the room, his gaze landing on Sandra. Her once tightly pulled hair is now cascading loosely around her shoulders. He places a beer down in front of her. Sandra wipes the top of the can clean before she gazes at it, contemplating. After taking a drink, she sets the can down on the table and buries her head in her hands, overwhelmed by emotion. \n\nIn the storeroom, Jeep regards Michael curiously, an expression of curiosity etched on his face. He reaches up, taking a claw hammer off a hook. Michael, his head hung low, walks over to where Jeep stands. Jeep frowns, staring at Michael, who meets his gaze with a benign expression. Michael turns to leave, leaving behind a Jeep who appears thoughtful, lost in contemplation. Bob finds himself once again on the roof, leaning casually against the wall. He sips on his beer from a can, the cigarette still nestled between his fingers. The wind whips through his hair, sending small strands dancing in the air. Above, the sky is blanketed with dense gray clouds, gathering ominously. At an unexpected sound, Bob flinches and looks out towards the thick bank of gray mist forming. \n\nMichael stands on the roof, appearing pensive, lost in his thoughts. Against the backdrop of bright sunlight, he stands silhouetted, wings extending majestically. Beside him is Gabriel, an elder angel. Overhead, a vast army of angels soars, their presence filling the sky. Michael moves slowly across the roof of the diner, his steps deliberate and measured. Below, two children's swings sway back and forth, propelled by the relentless wind. Strings of light bulbs quiver and shake. Michael drops his beer can, the clatter lost amid the rolling gray mist. Bob, sitting by the wall, dozes off, the world around him fading away. Nearby, Sandra lies on the floor next to Audrey. As she wakes, her eyes open wide, she looks around anxiously, taking in her surroundings. Sitting up, she hears a voice and, with concern etched on her face, looks around again. She rises slowly and walks through the diner, her arms held stiffly away from her sides, bracing herself for what comes next."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "On the rooftop, Kyle intently observes as the intruders gradually make their way off, finally departing from the immediate vicinity of the diner below. They move away with heavy, deliberate steps, trudging slowly into the distance. Michael closely holds onto Sandra, who collapses onto her knees, completely overwhelmed and unable to stand. Meanwhile, Jeep offers his assistance to Charlie, gently helping her back onto her feet. She appears apprehensive, her concern evident and unmistakable as Michael approaches them with urgency. Kyle takes the lead, guiding the others carefully along as they make their way down from the rooftop. Audrey makes an earnest effort to console her mother, offering words of comfort in the tense and emotionally charged situation. Bob strides forward with a grim determination present in every step he takes. Michael's gaze sweeps over the group, observing each of them carefully and with intention. His eyes then fix on Charlie, whose smile gradually fades away as she notices the seriousness in his expression and the steadfastness in his unwavering gaze. Charlie closes her eyes, taking a moment to process the gravity of the situation. Michael proceeds to load an assault rifle with purpose, turns on his heels, and decisively walks away from the group. Outside, the horizon intermittently bursts with bright flashes, casting an eerie and unsettling glow.\n\nKyle remains on the roof, accompanied by Percy, who sits beside him. He glances down at Percy, who is crouched low and leaning securely against a nearby ledge. Percy shifts his gaze around to look at Kyle, then turns away, resting a rifle securely over his arm. Kyle appears awkward, unsure of how to proceed in the silence. Percy silently observes as Kyle places his gun on the ledge beside him, a gesture of resignation. Kyle shakes his head, a look of frustration evident on his face. Percy blinks slowly, a few tears trickling from his eyes as he glances downward. Kyle raises his head, turning to fix his stare on Percy, who continues to sit quietly beside him.\n\nDownstairs, Bob ignites the grill, the familiar flames flickering to life once more. He lights a cigarette using his trusty lighter, inhaling deeply before exhaling clouds of smoke that linger in the air. He lifts a can to his lips, taking a drink from it, then surveys the room, his gaze eventually landing on Sandra. Her once tightly pulled hair is now cascading loosely around her shoulders. He places a beer down in front of her, offering it to her silently. Sandra wipes the top of the can clean before she gazes at it, contemplating deeply. After taking a drink, she sets the can down on the table and buries her head in her hands, overwhelmed by emotion.\n\nIn the storeroom, Jeep regards Michael curiously, an expression of curiosity etched on his face as he watches him. He reaches up, taking a claw hammer off a hook on the wall. Michael, his head hung low in thought, walks over to where Jeep stands watching him. Jeep frowns, staring at Michael, who meets his gaze with a benign and calm expression. Michael turns to leave, walking away and leaving behind a Jeep who appears thoughtful, lost in contemplation about what just transpired. Bob finds himself once again on the roof, leaning casually against the wall. He sips on his beer from a can, the cigarette still nestled between his fingers, its smoke trailing upward. The wind whips through his hair, sending small strands dancing in the air. Above, the sky is blanketed with dense gray clouds, gathering ominously. At an unexpected sound, Bob flinches and looks out towards the thick bank of gray mist forming with intent.\n\nMichael stands on the roof, appearing pensive and lost in his thoughts. Against the backdrop of bright sunlight, he stands silhouetted, wings extending majestically behind him. Beside him is Gabriel, an elder angel of considerable presence. Overhead, a vast and awe-inspiring army of angels soars, their presence filling the expansive sky. Michael moves slowly across the roof of the diner, his steps deliberate and measured with purpose. Below, two children's swings sway back and forth, propelled by the relentless wind. Strings of light bulbs quiver and shake in the breeze. Michael drops his beer can, the clatter lost amid the rolling gray mist that surrounds him. Bob, sitting by the wall, dozes off, the world around him gradually fading away into a distant blur. Nearby, Sandra lies on the floor next to Audrey. As she wakes, her eyes open wide in surprise, she looks around anxiously, taking in her surroundings with caution. Sitting up, she hears a voice and, with concern etched on her face, looks around again for the source. She rises slowly and walks through the diner, her arms held stiffly away from her sides, preparing herself for what might come next."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "On the roof, Kyle intently observes as the intruders gradually slope off, their figures becoming smaller in the distance as they trudge away from the diner. Nearby, Michael holds onto Sandra tightly as she collapses to her knees, overwhelmed. Within moments, Jeep extends a helping hand to Charlie, assisting her to stand, though her expression remains filled with apprehension as she notices Michael drawing nearer. Kyle, ensuring everyone's safety, guides the others down from the roof, where Audrey is already making an effort to console her distraught mother. Meanwhile, Bob strides forward with a grim determination, and Michael's gaze sweeps over the group before settling on Charlie. Her initial smile fades when met with his somber face and unwavering gaze, causing her to close her eyes in silent acknowledgment. With a steely resolve, Michael proceeds to load an assault rifle, decisively turns away from them, and walks off with purpose. Outside, the horizon is intermittently illuminated by bright flashes, casting fleeting glows across the scene. Meanwhile, Kyle remains on the roof beside Percy, who is crouched low and leaning against a ledge for support. Percy, feeling Kyle's glance, turns his head to look at him before averting his gaze to lean a rifle over his own arm. An awkward tension hangs between them as Kyle places his gun on the ledge. Shaking his head, Kyle communicates his unease, prompting Percy to blink and shift his gaze downward, tears quietly trailing down his cheeks. Raising his head with a resolute air, Kyle turns to continue staring at Percy, who is standing beside him. Downstairs, Bob methodically lights the grill before igniting a cigarette with his lighter. Inhaling deeply, he savors the drag before exhaling a cloud of smoke into the air. Picking up a can, he takes a drink, then looks across the room toward Sandra, noticing her hair, which was once tightly pulled back, now cascading loosely around her shoulders. In a considerate gesture, he places a beer in front of her. After thoughtfully wiping the top of the can, Sandra focuses on it, then takes a drink before setting it back down on the table. Overwhelmed, she buries her head in her hands as emotion overtakes her. In the storeroom, Jeep regards Michael with a curious expression, his eyes following Michael's every move as he takes a claw hammer off a hook. Michael, who hangs his head, approaches Jeep, and they share a moment of silent communication before Jeep's frown deepens. Despite the benign expression that Michael wears, his departure leaves Jeep in a thoughtful state. On the roof, Bob leans against the wall, nursing a beer from a can and taking drags from his cigarette while the wind stirs through his hair. As his eyes scan the sky, filled with dense gray clouds, he reflexively flinches at an unfamiliar sound, and his gaze moves toward a bank of encroaching gray mist. Nearby, Michael also stands on the roof, his posture pensive and contemplative. Against the backdrop of bright sunlight, Michael is silhouetted, revealing his wings, as he stands with an elder angel, Gabriel. Above, an army of angels soars overhead, creating a surreal scene on the roof of the diner. Michael takes slow, deliberate steps across the roof, while below, the children's swings are caught by the wind and sway back and forth alongside the shaking strings of light bulbs. In a moment of carelessness or distraction, Bob drops his beer can, and as the gray mist rolls in, he finds himself sitting by the wall, dozing off. Downstairs, Sandra is lying on the floor next to Audrey, but she soon stirs awake, her eyes darting around anxiously as awareness floods back. Quickly sitting up, she hears a voice and continues to look around, the anxiety apparent in her stiff posture as she slowly walks through the diner, arms held purposefully away from her sides."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "On the roof, Kyle observes as the intruders leave the diner, while Michael supports a kneeling Sandra. Jeep helps an apprehensive Charlie as Michael approaches. Kyle guides the others down from the roof, with Audrey trying to comfort her mother. Bob advances grimly, and Michael exchanges a somber look with Charlie, whose smile fades. Michael loads an assault rifle, walks away, and outside, bright flashes light up the horizon. \n\nKyle remains on the roof with Percy, who crouches low, leaning against a ledge. They exchange glances before Kyle uneasily places a gun on the ledge. Percy, overwhelmed with emotion, sheds tears as Kyle looks at him. Downstairs, Bob lights a cigarette and drinks from a can, setting one in front of Sandra, who, after wiping the top, drinks and then buries her head in her hands.\n\nIn the storeroom, Jeep curiously watches Michael, taking a claw hammer off a hook while Michael, with a benign expression, leaves Jeep looking thoughtful. Back on the roof, Bob drinks beer and smokes as wind tousles his hair against a sky filled with dense, gray clouds. Michael stands pensively, silhouetted with wings beside Gabriel as an army of angels flies overhead. He steps across the diner's roof amid swaying children’s swings and shaking light bulb strings. As mist rolls in, Bob dozes by the wall, and Sandra, lying next to Audrey, wakes anxiously, sits up, and walks stiffly through the diner on hearing a voice."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "On the roof of the building, which has become a vantage point for many during tumultuous events, Kyle watches as the intruders, likely having caused chaos inside the diner, slope off into the night. They trudge away from the diner known for its late-night patrons and comfort food. Michael, a figure who seems to bear a burden, clutches onto Sandra, who sinks to her knees as if the weight of the world is upon her. Jeep, a young man known for his resourcefulness, helps Charlie up. She looks apprehensive as Michael, often seen as the stoic leader, approaches. Kyle leads in the others from the roof, a strategic point they've used for surveillance. Audrey, a teenager caught in the midst of these events, tries to console her mother, who has struggled with the stress of the situation. Bob grimly strides forward, his demeanor suggesting he's seen too much already. Michael stares at the others, each of them relying on him for guidance. He turns to Charlie, whose smile fades when she sees his somber face and steadfast gaze that often signals impending action. Charlie, feeling overwhelmed, closes her eyes. Michael, a figure of authority who bears the hope of many, loads an assault rifle, a weapon they found in the storeroom, turns, and walks away from them with a determined stride. Outside, intermittent bright flashes, possibly from distant lightning strikes or other disruptions, illuminate the horizon. Kyle is on the roof with Percy, a loyal friend whose presence is a source of comfort. Kyle glances down at Percy, who is crouched low, leaning against a ledge that has seen many moments of silent contemplation. Percy looks around at Kyle, seeking assurance. Percy turns away and leans a rifle, a tool of survival in these desperate times, over his arm. Kyle looks awkward, caught between his protective instincts and the harsh reality. Percy watches as Kyle places the gun on the ledge, a symbolic gesture of conflict with violence. Kyle shakes his head, feeling the weight of leadership. Percy blinks and glances down, emotions overwhelming him as tears fall from his eyes. Kyle raises his head, then turns to stare at Percy beside him, their shared understanding deepening their bond. Downstairs in the diner, Bob turned on the grill, a familiar ritual in a time of uncertainty, then lights a cigarette with his lighter, a moment of personal solace amidst chaos. He takes a deep drag, then breathes it out, savoring the fleeting calm. He picks up a can and drinks from it, needing the temporary reprieve. He looks across the room at Sandra, whose hair, which had been pulled tight, is now loose, a sign of her frayed state. He sets a beer down in front of her, a gesture of camaraderie. Having wiped the top of the can, she gazes at it, then drinks, trying to find solace in the mundane. She sets it down on the table, the weight of the moment pressing on her. Sandra buries her head in her hands, overwhelmed by the night's events. In the storeroom, Jeep looks at Michael curiously, sensing the depth of his unspoken thoughts. Jeep takes a claw hammer off a hook, readying himself for any task at hand. Michael hangs his head, feeling the burden alone. He walks over to Jeep, seeking solidarity. Jeep stares frowning at Michael, who wears a benign expression, masking deeper thoughts. Michael leaves a thoughtful-looking Jeep, whose youthful resilience is being tested. Bob stands on the roof, leaning against the wall, a familiar stance as he surveys the scene. He drinks beer from a can and puffs on a cigarette, seeking a moment's peace. Wind whips through his hair, a reminder of the forces beyond control. The sky is filled with dense, gray clouds, ominous and foreboding. He flinches at the sound and looks out at a bank of gray mist, which has rolled in like an unwelcome guest. Michael stands on the roof, looking pensive about choices and consequences. Michael stands silhouetted against bright sunlight, an angelic figure with wings, revealing his true celestial nature. He's with an elder angel, Gabriel, often depicted as a messenger, guiding Michael with wisdom. An army of angels flies overhead, a powerful and awe-inspiring sight. Michael slowly steps across the roof of the diner, a place that has become a battleground of destinies. The two children's swings, a stark contrast to the night's tension, are blown back and forth by the wind. The strings of light bulbs shake, a fragile illumination in the darkness. He drops his beer can, perhaps realizing the triviality of earthly comforts. As gray mist rolls in, enshrouding the world in uncertainty, Bob is sitting by the wall dozing, exhausted by the events. Sandra, lying on the floor next to Audrey, wakes and looks around anxiously, her maternal instincts heightened. She sits up, hearing the voice, she looks around, seeking reassurance. She slowly walks through the diner with her arms held stiffly away from her sides, her posture expressing her apprehension."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "They trudge away from the diner On the roof Kyle watches as the intruders slope off They trudge away from the diner Michael clutches on to Sandra who sinks to her knees Jeep helps Charlie up He has wings She looks apprehensive as Michael approaches Kyle leads in the others from the roof Audrey tries to console her mother Bob grimly strides forward He walks over to Jeep Michael stares at the others He turns to Charlie Michael hangs his head Michael leaves a thoughtfullooking Jeep Her smile fades when she sees his somber face and steadfast gaze In the storeroom Jeep looks at Michael curiously Charlie closes her eyes The strings of light bulbs shake He loads an assault rifle turns and walks away from them Outside intermittent bright flashes illuminate the horizon Kyle is on the roof with Percy Kyle glances down at Percy who is crouched low leaning against a ledge Percy looks around at Kyle Percy turns away and leans a rifle over his arm She wakes and looks around anxiously Kyle looks awkward Percy turns away and leans a rifle over his arm Percy watches as Kyle places the gun on the ledge Kyle shakes his head Percy blinks and glances down Tears fall from his eyes Kyle raises his head then turns to stare at Percy beside him Audrey tries to console her mother Downstairs Bob turned on the grill then lights a cigarette with his lighter He takes a deep drag then breathes it out She sits up He picks up a can and drinks from it He picks up a can and drinks from it He looks across the room at Sandra whose hair which had been pulled tight is now loose He sets a beer down in front of her Having wiped the top of the can she gazes at it then drinks She sets it down on the table Sandra buries her head in her hands In the storeroom Jeep looks at Michael curiously Michael stares at the others Kyle looks awkward Jeep takes a claw hammer off a hook Michael hangs his head He walks over to Jeep Michael clutches on to Sandra who sinks to her knees The sky is filled with dense gray clouds Jeep stares frowning at Michael who wears a benign expression He looks across the room at Sandra whose hair which had been pulled tight is now loose Michael leaves a thoughtfullooking Jeep Michael stands on the roof looking pensive Bob stands on the roof leaning against the wall He drinks beer from a can and puffs on a cigarette Kyle leads in the others from the roof Wind whips through his hair Kyle is on the roof with Percy The sky is filled with dense gray clouds He flinches at the sound and looks out at a bank of gray mist Outside intermittent bright flashes illuminate the horizon Michael stands on the roof looking pensive Michael stands on a roof silhouetted against bright sunlight He has wings He is with an elder angel Gabriel An army of angels flies overhead An army of angels flies overhead Michael slowly steps across the roof of the diner The two children swings are blown back and forth by the wind He loads an assault rifle turns and walks away from them He drops his beer can The strings of light bulbs shake As gray mist rolls in Kyle glances down at Percy who is crouched low leaning against a ledge Wind whips through his hair He drops his beer can As gray mist rolls in Bob is sitting by the wall dozing He sets a beer down in front of her Bob grimly strides forward Bob stands on the roof leaning against the wall Sandra is lying on the floor next to Audrey She wakes and looks around anxiously She sits up Hearing the voice she looks around She slowly walks through the diner with her arms held stiffly away from her sides"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "On the roof Kyle watches as the intruders slope off. They trudge away from the diner. Michael clutches on to Sandra who sinks to her knees. Jeep helps Charlie up. She looks apprehensive as Michael approaches. Kyle leads in the others from the roof. Audrey tries to console her mother. Bob grimly strides forward. Michael stares at the others. He turns to Charlie. Her smile fades when she sees his somber face and steadfast gaze. Charlie closes her eyes. He loads an assault rifle turns and walks away from them. Outside intermittent bright flashes illuminate the horizon. Kyle is on the roof with Percy. Kyle glances down at Percy who is crouched low leaning against a ledge. Percy looks around at Kyle. Percy turns away and leans a rifle over his arm. Kyle looks awkward. Percy watches as Kyle places the gun on the ledge. Kyle shakes his head. Percy blinks and glances down. Tears fall from his eyes. Kyle raises his head then turns to stare at Percy beside him. Downstairs Bob turned on the grill then lights a cigarette with his lighter. He takes a deep drag then breathes it out. He picks up a can and drinks from it. He looks across the room at Sandra whose hair which had been pulled tight is now loose. He sets a beer down in front of her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Having wiped the top of the can she gazes at it then drinks. She sets it down on the table. Sandra buries her head in her hands. In the storeroom Jeep looks at Michael curiously. Jeep takes a claw hammer off a hook. Michael hangs his head. He walks over to Jeep. Jeep stares frowning at Michael who wears a benign expression. Michael leaves a thoughtfullooking Jeep. Bob stands on the roof leaning against the wall. He drinks beer from a can and puffs on a cigarette. Wind whips through his hair. The sky is filled with dense gray clouds. He flinches at the sound and looks out at a bank of gray mist. Michael stands on the roof looking pensive. Michael stands on a roof silhouetted against bright sunlight. He has wings. He is with an elder angel Gabriel. An army of angels flies overhead. Michael slowly steps across the roof of the diner. The two children swings are blown back and forth by the wind. The strings of light bulbs shake. He drops his beer can. As gray mist rolls in. Bob is sitting by the wall dozing. Sandra is lying on the floor next to Audrey. She wakes and looks around anxiously. She sits up. Hearing the voice she looks around. She slowly walks through the diner with her arms held stiffly away from her sides."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "On the roof Kyle watches as the intruders slope off. They trudge away from the diner. Michael clutches on to Sandra who sinks to her knees. Jeep helps Charlie up. She looks apprehensive as Michael approaches. Kyle leads in the others from the roof. Audrey tries to console her mother. Bob grimly strides forward. Michael stares at the others. He turns to Charlie. Her smile fades when she sees his somber face and steadfast gaze. Charlie closes her eyes. He loads an assault rifle turns and walks away from them. Outside intermittent bright flashes illuminate the horizon. Kyle is on the roof with Percy. Kyle glances down at Percy who is crouched low leaning against a ledge. Percy looks around at Kyle. Percy turns away and leans a rifle over his arm. Kyle looks awkward. Percy watches as Kyle places the gun on the ledge. Kyle shakes his head. Percy blinks and glances down. Tears fall from his eyes. Kyle raises his head then turns to stare at Percy beside him. Downstairs Bob turned on the grill then lights a cigarette with his lighter. He takes a deep drag then breathes it out. He picks up a can and drinks from it. He looks across the room at Sandra whose hair which had been pulled tight is now loose. He sets a beer down in front of her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Having wiped the top of the can she gazes at it then drinks. She sets it down on the table. Sandra buries her head in her hands. In the storeroom Jeep looks at Michael curiously. Jeep takes a claw hammer off a hook. Michael hangs his head. He walks over to Jeep. Jeep stares frowning at Michael who wears a benign expression. Michael leaves a thoughtfullooking Jeep. Bob stands on the roof leaning against the wall. He drinks beer from a can and puffs on a cigarette. Wind whips through his hair. The sky is filled with dense gray clouds. He flinches at the sound and looks out at a bank of gray mist. Michael stands on the roof looking pensive. Michael stands on a roof silhouetted against bright sunlight. He has wings. He is with an elder angel Gabriel. An army of angels flies overhead. Michael slowly steps across the roof of the diner. The two children swings are blown back and forth by the wind. The strings of light bulbs shake. He drops his beer can. As gray mist rolls in. Bob is sitting by the wall dozing. Sandra is lying on the floor next to Audrey. She wakes and looks around anxiously. She sits up. Hearing the voice she looks around. She slowly walks through the diner with her arms held stiffly away from her sides."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "On the roof Kyle watches as the intruders slope off. They trudge away from the diner. Michael clutches on to Sandra who sinks to her knees. Jeep helps Charlie up. She looks apprehensive as Michael approaches. Kyle leads in the others from the roof. Audrey tries to console her mother. Bob grimly strides forward. Michael stares at the others. He turns to Charlie. Her smile fades when she sees his somber face and steadfast gaze. Charlie closes her eyes. He loads an assault rifle turns and walks away from them. Outside intermittent bright flashes illuminate the horizon. Kyle is on the roof with Percy. Michael stands on a roof silhouetted against bright sunlight. He has wings. He is with an elder angel Gabriel. An army of angels flies overhead. Michael slowly steps across the roof of the diner. The two children swings are blown back and forth by the wind. The strings of light bulbs shake. He drops his beer can. As gray mist rolls in. Bob is sitting by the wall dozing. Sandra is lying on the floor next to Audrey. She wakes and looks around anxiously. She sits up. Hearing the voice she looks around. She slowly walks through the diner with her arms held stiffly away from her sides."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "On the roof Kyle watches as the intruders slope off. They trudge away from the diner. Michael clutches on to Sandra who sinks to her knees. Jeep helps Charlie up. She looks apprehensive as Michael approaches. Kyle leads in the others from the roof. Bob is sitting by the wall dozing. Sandra is lying on the floor next to Audrey. She wakes and looks around anxiously. She sits up. Hearing the voice she looks around. She slowly walks through the diner with her arms held stiffly away from her sides."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "On the roof, the cat watches as the raccoons slope off. They trudge away from the diner. The dog clutches on to the rabbit, who sinks to her knees. The squirrel helps the fox up. She looks apprehensive as the dog approaches. The cat leads in the others from the roof. The parrot tries to console her mother. The owl grimly strides forward. The dog stares at the others. He turns to the fox. Her smile fades when she sees his somber face and steadfast gaze. The fox closes her eyes. He loads an assault rifle, turns, and walks away from them. Outside, intermittent bright flashes illuminate the horizon. The cat is on the roof with the raccoon. The cat glances down at the raccoon, who is crouched low, leaning against a ledge. The raccoon looks around at the cat. The raccoon turns away and leans a rifle over his arm. The cat looks awkward. The raccoon watches as the cat places the gun on the ledge. The cat shakes his head. The raccoon blinks and glances down. Tears fall from his eyes. The cat raises his head, then turns to stare at the raccoon beside him. Downstairs, the owl turned on the grill, then lights a cigarette with his lighter. He takes a deep drag, then breathes it out. He picks up a can and drinks from it. He looks across the room at the rabbit, whose hair, which had been pulled tight, is now loose. He sets a beer down in front of her. Having wiped the top of the can, she gazes at it, then drinks. She sets it down on the table. The rabbit buries her head in her hands. In the storeroom, the squirrel looks at the dog curiously. The squirrel takes a claw hammer off a hook. The dog hangs his head. He walks over to the squirrel. The squirrel stares frowning at the dog, who wears a benign expression. The dog leaves a thoughtful-looking squirrel. The owl stands on the roof, leaning against the wall. He drinks beer from a can and puffs on a cigarette. Wind whips through his hair. The sky is filled with dense, gray clouds. He flinches at the sound and looks out at a bank of gray mist. The dog stands on the roof, looking pensive. The dog stands on a roof, silhouetted against bright sunlight. He has wings. He's with an elder angel, Raphael. An army of angels flies overhead. The dog slowly steps across the roof of the diner. The two frogs on swings are blown back and forth by the wind. The strings of light bulbs shake. He drops his beer can. As gray mist rolls in, the owl is sitting by the wall dozing. The rabbit is lying on the floor next to the parrot. She wakes and looks around anxiously. She sits up. Hearing the voice, she looks around. She slowly walks through the diner with her arms held stiffly away from her sides."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "On the balcony, Kyle watches as the intruders slope off. They trudge away from the warehouse. Michael clutches on to Sandra, who sinks to her knees. Jeep helps Charlie up. She looks apprehensive as Michael approaches. Kyle leads in the others from the balcony. Audrey tries to console her mother. Bob grimly strides forward. Michael stares at the others. He turns to Charlie. Her smile fades when she sees his somber face and steadfast gaze. Charlie closes her eyes. He loads a crossbow, turns, and walks away from them. Outside, intermittent bright flashes illuminate the skyline. Kyle is on the balcony with Percy. Kyle glances down at Percy, who is crouched low, leaning against a railing. Percy looks around at Kyle. Percy turns away and leans a bow over his arm. Kyle looks awkward. Percy watches as Kyle places the weapon on the railing. Kyle shakes his head. Percy blinks and glances down. Tears fall from his eyes. Kyle raises his head, then turns to stare at Percy beside him. Downstairs, Bob turned on the stove, then lights a candle with his match. He takes a deep sniff, then breathes it out. He picks up a bottle and drinks from it. He looks across the room at Sandra, whose hair, which had been pulled tight, is now loose. He sets a mug down in front of her. Having wiped the top of the bottle, she gazes at it, then drinks. She sets it down on the table. Sandra buries her head in her hands. In the storeroom, Jeep looks at Michael curiously. Jeep takes a paintbrush off a hook. Michael hangs his head. He walks over to Jeep. Jeep stares frowning at Michael, who wears a benign expression. Michael leaves a thoughtful-looking Jeep. Bob stands on the balcony, leaning against the railing. He drinks soda from a mug and puffs on a straw. Wind whips through his hair. The sky is filled with dense, gray clouds. He flinches at the sound and looks out at a bank of gray fog. Michael stands on the balcony, looking pensive. Michael stands on a balcony, silhouetted against bright moonlight. He has wings. He's with an elder angel, Gabriel. An army of angels flies overhead. Michael slowly steps across the balcony of the warehouse. The two children's kites are blown back and forth by the wind. The strings of lanterns shake. He drops his soda bottle. As gray fog rolls in, Bob is sitting by the railing dozing. Sandra is lying on the floor next to Audrey. She wakes and looks around anxiously. She sits up. Hearing the voice, she looks around. She slowly walks through the warehouse with her arms held stiffly away from her sides."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "On the roof, Kyle observes as the intruders meander off. They drift away from the diner. Michael holds on to Sandra, who collapses to her knees. Jeep pulls Charlie up. She appears anxious as Michael advances. Kyle guides in the others from the roof. Audrey attempts to cheer up her mother. Bob wearily shuffles forward. Michael gazes at the others. He pivots to Charlie. Her grin diminishes when she notices his serious face and unwavering gaze. Charlie briefly closes her eyes. He hoists an assault rifle, spins around, and strides away from them. Outside, sporadic bright glimmers brighten the horizon. Kyle is on the roof with Percy. Kyle peers down at Percy, who is hunched low, resting against a ledge. Percy scans around at Kyle. Percy diverts his gaze and balances a rifle over his arm. Kyle appears uneasy. Percy observes as Kyle places the gun on the ledge. Kyle nods his head. Percy blinks and looks down. Tears trickle from his eyes. Kyle lowers his head, then turns to glance at Percy beside him. Downstairs, Bob switches on the grill, then ignites a cigarette with his lighter. He takes a heavy puff, then exhales it. He grabs a can and sips from it. He glances across the room at Sandra, whose hair, which had been neatly tied, is now unfastened. He places a beer in front of her. Having brushed the top of the can, she stares at it, then sips. She places it on the table. Sandra hides her face in her hands. In the storeroom, Jeep gazes at Michael inquisitively. Jeep removes a claw hammer from a hook. Michael bows his head. He strolls over to Jeep. Jeep scrutinizes Michael, who bears a gentle expression. Michael departs from a contemplative-looking Jeep. Bob stands on the roof, reclining against the wall. He sips beer from a can and inhales on a cigarette. Wind lashes through his hair. The sky is filled with thick, gray clouds. He winces at the noise and gazes out at a bank of gray mist. Michael stands on the roof, appearing reflective. Michael stands on a roof, silhouetted against bright sunlight. He has wings. He's with an elder angel, Gabriel. An army of angels glides overhead. Michael cautiously steps across the roof of the diner. The two children's swings sway back and forth in the wind. The strings of light bulbs tremble. He drops his beer can. As gray mist rolls in, Bob is sitting by the wall napping. Sandra is lying on the floor next to Audrey. She awakens and looks around nervously. She rises. Hearing the voice, she glances around. She slowly moves through the diner with her arms held rigidly away from her sides."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "On the chimney, Serena observes as the tourists glide off. They shuffle away from the aviary. Ethan clings on to Megan, who sinks to her ankles. Bicycle assists Laura up. She appears nervous as Ethan nears. Serena guides in the creatures from the chimney. Tiffany attempts to soothe her sister. Greg briskly marches forward. Ethan gazes at the creatures. He turns to Laura. Her grin dissipates when she notices his grave demeanor and unwavering stare. Laura shuts her eyes. He loads a paintball gun, pivots, and strolls away from them. Outdoors, sporadic bright beams brighten the skyline. Serena is on the chimney with Oliver. Serena peeks down at Oliver, who is hunched low, pressing against a railing. Oliver glances around at Serena. Oliver turns aside and rests a telescope over his shoulder. Serena feels uneasy. Oliver watches as Serena places the bow on the railing. Serena shakes her head. Oliver blinks and looks down. Raindrops fall from his cheeks. Serena lifts her gaze, then turns to look at Oliver beside him. Upstairs, Greg switched on the oven, then ignites an incense with his match. He inhales deeply, then exhales. He picks up a jug and sips from it. He glances across the area at Megan, whose scarf, which had been tied tight, is now loose. He places a sandwich down in front of her. Having wiped the rim of the jug, she peeks at it, then sips. She places it down on the counter. Megan buries her face in her palms. In the attic, Bicycle observes Ethan inquisitively. Bicycle takes a crowbar off a shelf. Ethan bows his head. He walks over to Bicycle. Bicycle stares scowling at Ethan, who wears a gentle expression. Ethan leaves a pondering-looking Bicycle. Greg stands on the chimney, reclining against the fence. He drinks wine from a jug and inhales on an incense. Breeze tousles his hat. The ocean is filled with dense, gray fog. He recoils at the noise and peers out at a stretch of gray haze. Ethan stands on the chimney, appearing thoughtful. Ethan stands on a chimney, outlined against bright moonlight. He has vines. He's with a senior sprite, Raphael. A flock of butterflies flutters overhead. Ethan leisurely steps across the rooftop of the aviary. The three cats are tossed back and forth by the breeze. The garlands of bells tremble. He drops his wine jug. As gray haze drifts in, Greg is lounging by the fence snoozing. Megan is lying on the mat next to Tiffany. She rouses and scans around nervously. She rises. Hearing the murmur, she peers around. She gingerly strides through the aviary with her elbows held rigidly away from her torso."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "On the roof, a cat observes as the tourists slump off. They shuffle away from the library. Robert grasps on to Linda, who collapses to her knees. A dolphin supports Alex up. She seems uneasy as Robert nears. The cat guides in the squirrels from the roof. Elaine attempts to reassure her aunt. Max confidently marches forward. Robert peers at the group. He pivots to Alex. Her grin disappears when she notices his serious expression and unwavering look. Alex shuts her eyes. He loads a water pistol, pivots, and strolls away from them. Outside, sporadic bright patterns illuminate the horizon. The cat is on the roof with a penguin. The cat glimpses down at the penguin, who is hunched low, leaning against a rail. The penguin glances around at the cat. The penguin turns away and perches a telescope over his arm. The cat seems uneasy. The penguin watches as the cat sets the binoculars on the rail. The cat shakes its head. The penguin blinks and gazes downward. Raindrops fall from its eyes. The cat lifts its head, then turns to gaze at the penguin beside it. Downstairs, Max flicked on the fan, then lights a candle with his match. He takes a deep breath, then exhales it. He picks up a mug and sips from it. He looks across the hallway at Linda, whose hat, which had been worn tight, is now loose. He places a soda down in front of her. Having polished the rim of the mug, she stares at it, then sips. She places it down on the counter. Linda buries her head in her arms. In the storeroom, a dolphin gazes at Robert curiously. The dolphin grabs a wrench off a shelf. Robert lowers his head. He walks over to the dolphin. The dolphin squints suspiciously at Robert, who wears a calm demeanor. Robert leaves a puzzled-looking dolphin. Max stands on the balcony, leaning against the rail. He drinks juice from a cup and inhales on a lollipop. Breezes rustle through his coat. The sky is filled with dense, blue clouds. He cringes at the noise and looks out at a cluster of blue fog. Robert stands on the balcony, looking contemplative. Robert stands on a balcony, silhouetted against bright moonlight. He has sprouted feathers. He's with an elder phoenix, Raphael. A flock of phoenixes glides overhead. Robert slowly climbs across the roof of the library. The two child-sized bicycles are blown back and forth by the gust. The strings of flags ripple. He drops his juice cup. As blue fog rolls in, Max is resting by the rail snoozing. Linda is reclining on the sofa next to Elaine. She wakes and looks around nervously. She rises up. Hearing the voice, she glances around. She slowly ambles through the library with her arms held rigidly away from her sides."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "On the chimney, Kyle observes as the visitors slide off. They skip away from the café. Michael holds on to Sandra, who rises to her feet. Jeep pulls Charlie down. She appears relaxed as Michael retreats. Kyle guides in the others from the chimney. Audrey attempts to distract her mother. Bob cheerfully marches backward. Michael glances at the others. He rotates toward Charlie. Her grin enlarges when she notices his cheerful face and wide eyes. Charlie opens her eyes. He unloads a water gun, spins, and jogs toward them. Inside, constant dim shadows obscure the skyline. Kyle is on the chimney with Percy. Kyle peers up at Percy, who is stretched tall, balancing against a railing. Percy peeks sideways at Kyle. Percy spins around and grips a trumpet under his arm. Kyle looks confident. Percy observes as Kyle places the trumpet on the railing. Kyle nods affirmatively. Percy smirks and looks up. Laughter spills from his lips. Kyle lowers his gaze, then pivots to smile at Percy beside him. Upstairs, Bob switched off the fan, then lights a candle with his match. He inhales deeply, then exhales it out. He grabs a brush and paints with it. He gazes across the room at Sandra, whose hair, which had been flowing loose, is now braided. He places a soda in front of her. Having polished the base of the can, she stares at it, then paints. She places it back on the chair. Sandra raises her head in victory. In the library, Jeep observes Michael amusingly. Jeep picks a feather duster off a shelf. Michael raises his chin. He strolls away from Jeep. Jeep grins joyfully at Michael, who displays a serious expression. Michael leaves a confused-looking Jeep. Bob sits in the garden, standing against a tree. He sips lemonade from a bottle and chomps on a cookie. Sunshine dances through his hair. The ground is filled with white, fluffy snow. He smiles at the sound and gazes out at a bank of green leaves. Michael stands in the garden, looking thoughtful. Michael stands in the garden, silhouetted against gentle moonlight. He has scales. He's with a junior elf, Gabriel. A flock of birds glides overhead. Michael swiftly dances across the garden of the café. The two cats prance forward and backward by the breeze. The strands of tinsel twist. He picks up his lemonade bottle. As white leaves swirl in, Bob is lying by the tree dreaming. Sandra is reclining on the couch next to Audrey. She dozes and glances around calmly. She reclines back. Hearing a tune, she gazes upward. She swiftly dances through the café with her arms waving flamboyantly by her sides."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "On the balcony, Brenda observes as the strangers drift away. They shuffle away from the bakery. Julian grips onto Lisa, who collapses to her ankles. Oliver assists Diana up. She appears nervous as Julian nears. Brenda guides in the rest from the balcony. Megan attempts to comfort her aunt. Frank solemnly marches ahead. Julian glares at the rest. He pivots to Diana. Her grin diminishes when she notices his gloomy expression and steadfast stare. Diana shuts her eyes. He prepares a crossbow, pivots, and marches away from them. Outdoors, sporadic luminous flares brighten the skyline. Brenda is on the balcony with Marvin. Brenda peers over at Marvin, who is bent low, resting against a barrier. Marvin glances at Brenda. Marvin turns away and rests a slingshot over his elbow. Brenda appears uneasy. Marvin observes as Brenda places the slingshot on the barrier. Brenda shakes her noggin. Marvin blinks and squints downward. Raindrops drip from his cheeks. Brenda lifts her chin, then pivots to gaze at Marvin beside her. Upstairs, Frank powers on the oven, then kindles a cigar with his match. He inhales deeply, then exhales. He snatches a jug and sips from it. He peers across the den at Lisa, whose bun, which had been tightly coiled, is now flowing. He places a juice in front of her. Having brushed the rim of the jug, she peers at it, then sips. She places it back on the shelf. Lisa hides her face in her palms. In the pantry, Oliver peers at Julian inquisitively. Oliver grabs a screwdriver from a peg. Julian lowers his chin. He steps over to Oliver. Oliver gazes, scowling at Julian, who wears a gentle demeanor. Julian departs from a contemplating Oliver. Frank is perched on the balcony, resting against the fence. He consumes ale from a jug and blows on a cigar. Wind tousles his locks. The atmosphere is filled with thick, dark fog. He winces at the noise and gazes out at a wall of dark haze. Julian is perched on the balcony, appearing contemplative. Julian stands on a balcony, outlined against dazzling daylight. He possesses antlers. He's with an ancient sprite, Samuel. A brigade of sprites soars overhead. Julian gradually strolls across the bakery's balcony. The duo of chairs is swung back and forth by the breeze. The strands of festive lanterns tremble. He discards his ale jug. As dark haze billows in, Frank is propped by the fence snoozing. Lisa is sprawled on the tiles next to Megan. She stirs and glances about worriedly. She rises. Hearing the murmur, she glances around. She gingerly strolls through the bakery with her limbs held rigidly away from her sides."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Kyle observes as intruders leave the diner, while Michael supports Sandra, and Jeep helps Charlie up. Charlie looks uneasy when Michael, somber and determined, approaches. He loads a rifle and leaves. Outside, bright flashes illuminate the horizon. On the roof, Kyle and Percy share a tense moment; Percy, emotional, watches Kyle place his gun on the ledge. Downstairs, Bob lights a cigarette, drinks beer, and offers some to Sandra, who drinks and then buries her head in her hands. In the storeroom, Jeep curiously observes Michael, who looks resigned before departing. Bob, on the roof, drinks and smokes amid brewing clouds, flinching at the gray mist. Michael joins him, looking pensive with wings, accompanied by Gabriel, as an army of angels flies above. Michael walks across the diner roof while the scene exhibits brewing tension with wind and shaking lights. Bob dozes by the wall, and Sandra wakes anxiously, checking her surroundings before moving through the diner."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She slowly walks through the diner with her arms held stiffly away from her sides Hearing the voice she looks around She sits up She wakes and looks around anxiously Sandra is lying on the floor next to Audrey Bob is sitting by the wall dozing As gray mist rolls in He drops his beer can The strings of light bulbs shake The two children swings are blown back and forth by the wind Michael slowly steps across the roof of the diner An army of angels flies overhead He is with an elder angel Gabriel He has wings Michael stands on a roof silhouetted against bright sunlight Michael stands on the roof looking pensive He flinches at the sound and looks out at a bank of gray mist The sky is filled with dense gray clouds Wind whips through his hair He drinks beer from a can and puffs on a cigarette Bob stands on the roof leaning against the wall Michael leaves a thoughtfullooking Jeep Jeep stares frowning at Michael who wears a benign expression He walks over to Jeep Michael hangs his head Jeep takes a claw hammer off a hook In the storeroom Jeep looks at Michael curiously Sandra buries her head in her hands She sets it down on the table Having wiped the top of the can she gazes at it then drinks He sets a beer down in front of her He looks across the room at Sandra whose hair which had been pulled tight is now loose He picks up a can and drinks from it He takes a deep drag then breathes it out Downstairs Bob turned on the grill then lights a cigarette with his lighter Kyle raises his head then turns to stare at Percy beside him Tears fall from his eyes Percy blinks and glances down Kyle shakes his head Percy watches as Kyle places the gun on the ledge Kyle looks awkward Percy turns away and leans a rifle over his arm Percy looks around at Kyle Kyle glances down at Percy who is crouched low leaning against a ledge Kyle is on the roof with Percy Outside intermittent bright flashes illuminate the horizon He loads an assault rifle turns and walks away from them Charlie closes her eyes Her smile fades when she sees his somber face and steadfast gaze He turns to Charlie Michael stares at the others Bob grimly strides forward Audrey tries to console her mother Kyle leads in the others from the roof She looks apprehensive as Michael approaches Jeep helps Charlie up Michael clutches on to Sandra who sinks to her knees They trudge away from the diner On the roof Kyle watches as the intruders slope off"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Michael stands on a roof silhouetted against bright sunlight Kyle raises his head then turns to stare at Percy beside him Bob is sitting by the wall dozing Charlie closes her eyes Percy looks around at Kyle Kyle shakes his head Sandra is lying on the floor next to Audrey Hearing the voice she looks around Jeep takes a claw hammer off a hook Percy watches as Kyle places the gun on the ledge He turns to Charlie He is with an elder angel Gabriel Sandra buries her head in her hands Jeep stares frowning at Michael who wears a benign expression She sets it down on the table He flinches at the sound and looks out at a bank of gray mist Jeep helps Charlie up Percy blinks and glances down The two children swings are blown back and forth by the wind She looks apprehensive as Michael approaches Having wiped the top of the can she gazes at it then drinks Her smile fades when she sees his somber face and steadfast gaze He drinks beer from a can and puffs on a cigarette Tears fall from his eyes She slowly walks through the diner with her arms held stiffly away from her sides Downstairs Bob turned on the grill then lights a cigarette with his lighter On the roof Kyle watches as the intruders slope off Michael slowly steps across the roof of the diner He takes a deep drag then breathes it out He drops his beer can Kyle looks awkward He sets a beer down in front of her Bob stands on the roof leaning against the wall He picks up a can and drinks from it He loads an assault rifle turns and walks away from them He walks over to Jeep The sky is filled with dense gray clouds In the storeroom Jeep looks at Michael curiously As gray mist rolls in Outside intermittent bright flashes illuminate the horizon He has wings She sits up Michael clutches on to Sandra who sinks to her knees He looks across the room at Sandra whose hair which had been pulled tight is now loose Michael leaves a thoughtfullooking Jeep Kyle leads in the others from the roof Michael hangs his head The strings of light bulbs shake Michael stands on the roof looking pensive Audrey tries to console her mother She wakes and looks around anxiously Michael stares at the others Kyle is on the roof with Percy Kyle glances down at Percy who is crouched low leaning against a ledge Percy turns away and leans a rifle over his arm An army of angels flies overhead They trudge away from the diner Bob grimly strides forward Wind whips through his hair"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She sets it down on the table Sandra buries her head in her hands In the storeroom Jeep looks at Michael curiously Jeep takes a claw hammer off a hook Michael hangs his head He walks over to Jeep Jeep stares frowning at Michael who wears a benign expression Michael leaves a thoughtfullooking Jeep Bob stands on the roof leaning against the wall He drinks beer from a can and puffs on a cigarette Wind whips through his hair The sky is filled with dense gray clouds He flinches at the sound and looks out at a bank of gray mist Michael stands on the roof looking pensive Michael stands on a roof silhouetted against bright sunlight He has wings He is with an elder angel Gabriel An army of angels flies overhead Michael slowly steps across the roof of the diner The two children swings are blown back and forth by the wind The strings of light bulbs shake He drops his beer can As gray mist rolls in Bob is sitting by the wall dozing Sandra is lying on the floor next to Audrey She wakes and looks around anxiously She sits up Hearing the voice she looks around She slowly walks through the diner with her arms held stiffly away from her sides On the roof Kyle watches as the intruders slope off They trudge away from the diner Michael clutches on to Sandra who sinks to her knees Jeep helps Charlie up She looks apprehensive as Michael approaches Kyle leads in the others from the roof Audrey tries to console her mother Bob grimly strides forward Michael stares at the others He turns to Charlie Her smile fades when she sees his somber face and steadfast gaze Charlie closes her eyes He loads an assault rifle turns and walks away from them Outside intermittent bright flashes illuminate the horizon Kyle is on the roof with Percy Kyle glances down at Percy who is crouched low leaning against a ledge Percy looks around at Kyle Percy turns away and leans a rifle over his arm Kyle looks awkward Percy watches as Kyle places the gun on the ledge Kyle shakes his head Percy blinks and glances down Tears fall from his eyes Kyle raises his head then turns to stare at Percy beside him Downstairs Bob turned on the grill then lights a cigarette with his lighter He takes a deep drag then breathes it out He picks up a can and drinks from it He looks across the room at Sandra whose hair which had been pulled tight is now loose He sets a beer down in front of her Having wiped the top of the can she gazes at it then drinks"
        }
      ]
    }
  ]
}