{
  "ground_truth": "They look towards the departed PREACHER as JOHN has taken charge. He speaks very quietly, but calmly and cheerfully, as to an invalid. He starts down the rustling coal-heap, helping PEARL down, and they achieve the cellar floor. Meanwhile, PREACHER looks under the bed, and o.s., PREACHER'S footsteps come down stairs; JOHN leads PEARL carefully past a rake, a hoe, and a shelf-prop, and they crouch down beside an apple barrel. PREACHER'S footsteps cross kitchen o.s. Both look sharp towards the cellar door o.s. The door opens; PREACHER'S head, carrying a candle in holder, illuminates a white-washed wall and stairs, and he clop-clops nearly to the bottom of the stairs. ICEY's voice cuts cheerfully across his descent as she appears at the head of the stairs, her voice crackling with authority. After a short pause, the children, covered with coal-dust, emerge into the light and climb the stairs, with JOHN's head hung in defeat. As they enter the kitchen, we PULL BACK. JOHN looks to PEARL and we PAN HER IN as PREACHER'S hand named LOVE moves through her locks. We PAN with PREACHER and ICEY as they move towards the door, and he watches ICEY leave, o.s., as she goes away along the path outside. PREACHER, his back to us, watches her a moment, then turns, wondering what to do next. We begin with a HEAD CLOSE-UP of BIRDIE as he rocks, and PULL BACK; he is rocking and drunk. A bottle stands beside the picture, and he turns and speaks to the picture. His hands grip the edge of the chest on either side of the picture, which we now see. BIRDIE picks up the bottle, his hand and the liquor tremble, and the bottle falls from his hand onto its side on the edge of the chest. The reverse angle of the opening shot shows BIRDIE rocking heavily as liquor gurgles from the bottle to the floor. PREACHER sits at the head of the table with JOHN standing to his right, around the corner of the table, expressionless and immobile until he speaks. The table is loaded with good food as PREACHER, well-fed and at leisure, dabs his mouth delicately with his napkin, folds it, puts it in a ring, and folds his hands, waiting. PEARL frowns and puts her finger in her mouth, remembering he twisted her arm. PREACHER slaps the table; his eyes crackle and PEARL starts to snivel. He brings out the knife, and PEARL shakes her head for no. He touches the spring; the blade flicks open, and he lays the open knife on the table. PEARL thinks the knife is a toy and crosses behind JOHN to pick it up, her mouth quivering as a large tear brims in her eyes. She sniffles and wipes her eyes with her free fist.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here's the transformed text with synonyms applied to non-stop-words:\n\nThey gaze toward the departed MINISTER as JOHN has assumed control. He articulates very softly, but serenely and joyfully, as to a convalescent. He initiates down the rustling coal-pile, assisting PEARL down, and they reach the cellar ground. Meanwhile, MINISTER peers beneath the bed, and o.s., MINISTER'S footsteps descend stairs; JOHN guides PEARL cautiously past a rake, a hoe, and a shelf-support, and they huddle down beside an apple cask. MINISTER'S footsteps traverse kitchen o.s. Both observe keenly toward the cellar entrance o.s. The entrance opens; MINISTER'S head, bearing a candle in holder, brightens a white-washed barrier and stairs, and he clop-clops nearly to the base of the stairs. ICEY's voice slices cheerfully across his descent as she emerges at the head of the stairs, her voice crackling with authority. After a brief pause, the youngsters, covered with coal-dust, arise into the light and mount the stairs, with JOHN's head hung in defeat. As they enter the kitchen, we PULL BACK. JOHN glances to PEARL and we PAN HER IN as MINISTER'S hand labeled LOVE moves through her hair. We PAN with MINISTER and ICEY as they move toward the exit, and he watches ICEY depart, o.s., as she proceeds along the path outside. MINISTER, his back to us, watches her a moment, then turns, pondering what to do next. We initiate with a HEAD CLOSE-UP of BIRDIE as he rocks, and PULL BACK; he is rocking and intoxicated. A bottle stands beside the portrait, and he turns and speaks to the portrait. His hands clutch the edge of the chest on either side of the portrait, which we now observe. BIRDIE picks up the bottle, his hand and the alcohol tremble, and the bottle tumbles from his hand onto its side on the edge of the chest. The reverse perspective of the opening shot shows BIRDIE rocking heavily as alcohol gurgles from the bottle to the floor. MINISTER sits at the head of the table with JOHN standing to his right, around the corner of the table, expressionless and immobile until he speaks. The table is laden with good cuisine as MINISTER, well-fed and at leisure, dabs his mouth delicately with his napkin, folds it, places it in a ring, and folds his hands, waiting. PEARL frowns and puts her digit in her mouth, recollecting he twisted her arm. MINISTER slaps the table; his eyes crackle and PEARL begins to whimper. He produces the knife, and PEARL shakes her head for no. He touches the spring; the blade flicks open, and he lays the open knife on the table. PEARL considers the knife a plaything and crosses behind JOHN to pick it up, her mouth quivering as a large tear forms in her eyes. She sniffles and wipes her eyes with her free fist."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The departed PREACHER is looked towards by them as charge has been taken by JOHN. Very quietly, but calmly and cheerfully, he is spoken to by him, as if to an invalid. Down the rustling coal-heap is started by him, with PEARL being helped down, and the cellar floor is achieved by them. Meanwhile, under the bed is looked by PREACHER, and o.s., down the stairs come PREACHER'S footsteps; PEARL is led carefully past a rake, a hoe, and a shelf-prop by JOHN, and beside an apple barrel, they crouch down. The cellar door o.s. is looked towards sharply by both. The door is opened; by the candle in holder carried by PREACHER'S head, a white-washed wall and stairs are illuminated, and nearly to the bottom of the stairs, he clop-clops. Across his descent, ICEY's voice is cut cheerfully as she appears at the head of the stairs, with her voice crackling with authority. After a short pause, into the light, the children, covered with coal-dust, emerge and the stairs are climbed by them, with JOHN's head hanging in defeat. As the kitchen is entered by them, we PULL BACK. PEARL is looked at by JOHN and we PAN HER IN as the hand named LOVE of PREACHER moves through her locks. We PAN with PREACHER and ICEY as the door is moved towards by them, and as she goes away along the path outside, ICEY is watched by him, o.s. With his back to us, ICEY is watched for a moment by PREACHER, then, what to do next is wondered by him. With a HEAD CLOSE-UP of BIRDIE, we begin as he rocks, and PULL BACK; he is rocking and drunk. Beside the picture stands a bottle, and to the picture, he turns and speaks. The edge of the chest on either side of the picture is gripped by his hands, which is now seen by us. The bottle is picked up by BIRDIE, with his hand and the liquor trembling, and from his hand onto its side on the edge of the chest, the bottle falls. The reverse angle of the opening shot shows BIRDIE rocking heavily as from the bottle to the floor, liquor gurgles. At the head of the table, PREACHER sits with JOHN standing to his right, around the corner of the table, expressionless and immobile until he speaks. With good food, the table is loaded as delicately with his napkin, PREACHER, well-fed and at leisure, dabs his mouth, folds it, puts it in a ring, and his hands are folded by him, waiting. Into her mouth, PEARL frowns and puts her finger, remembering when her arm was twisted by him. The table is slapped by PREACHER; his eyes crackle and to snivel, PEARL starts. The knife is brought out by him, and for no, her head is shaken by PEARL. The spring is touched by him; the blade flicks open, and on the table, the open knife is laid by him. The knife is thought to be a toy by PEARL and behind JOHN to pick it up, she crosses, with her mouth quivering as a large tear brims in her eyes. Her eyes with her free fist are sniffled and wiped by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "They watch the departing PREACHER as JOHN calmly and cheerfully takes charge. Speaking softly as to an invalid, he helps PEARL down the coal-heap to the cellar floor. Meanwhile, PREACHER looks under the bed, and his footsteps are heard on the stairs. JOHN leads PEARL carefully past obstacles to crouch by an apple barrel. PREACHER's candlelit head appears at the door, illuminating the wall and stairs as he descends. ICEY's authoritative voice interrupts him at the top of the stairs. Covered in coal dust, the children emerge into the light, JOHN's head hung in defeat. As they enter the kitchen, JOHN looks to PEARL while PREACHER's hand named LOVE touches her hair. PREACHER and ICEY move to the door, and he watches her leave along the path, then turns, pondering his next move. A close-up of BIRDIE reveals him rocking and drunk beside a bottle. He grips the chest's edge near a picture, then drops the bottle, spilling liquor. In reverse, BIRDIE rocks heavily as the liquor pools. PREACHER sits at the table with JOHN silent beside him. The table is laden with food as PREACHER, content, folds his napkin. PEARL frowns, remembering her twisted arm. PREACHER slaps the table, startling PEARL. He displays a knife, and PEARL, thinking it a toy, picks it up, tearful and sniffling."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "They look to the departed PREACHER as JOHN takes charge, speaking quietly and cheerfully, like to an invalid. He helps PEARL down the coal-heap, reaching the cellar floor. Meanwhile, PREACHER checks under the bed, and his footsteps are heard as JOHN leads PEARL past tools to crouch beside an apple barrel. PREACHER's footsteps cross the kitchen. They watch the cellar door, which opens; PREACHER's candlelit head illuminates the stairs. ICEY's authoritative voice interrupts as she appears, and the children, coal-dust-covered, climb the stairs, JOHN's head lowered in defeat. In the kitchen, we pull back as JOHN looks to PEARL, and PREACHER's \"LOVE\" hand moves through her hair. We pan with PREACHER and ICEY as they move to the door, and he watches ICEY leave outside. PREACHER, back turned, ponders his next move. We see BIRDIE, rocking drunkenly, speaking to a picture, gripping the chest's edge. BIRDIE picks up a trembling bottle, which falls, spilling liquor. The opening shot's reverse shows BIRDIE rocking, liquor pooling. PREACHER sits at the table's head; JOHN stands expressionless until speaking. The table is filled with food; PREACHER, well-fed, dabs his mouth, folds his napkin, and waits. PEARL frowns, remembering her twisted arm. PREACHER slaps the table, eyes crackling, and PEARL sniffles. He shows the knife; PEARL shakes her head no. He flicks it open and lays it on the table. Thinking it's a toy, PEARL crosses to pick it up, eyes brimming with tears, sniffing, and wiping her eyes."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "They direct their gaze towards the departed PREACHER, observing as JOHN has now taken charge of the unfolding situation. He speaks in a voice that is very quiet, yet manages to maintain a calm and cheerful tone, akin to someone addressing an unwell patient. Slowly and carefully, he begins to make his way down the coal-heap that rustles beneath their feet, assisting PEARL in her descent, and together they successfully reach the solid cellar floor. Meanwhile, the PREACHER is seen looking thoughtfully under the bed, and off-screen, the sound of the PREACHER'S footsteps can be heard descending the stairs. JOHN, with great caution, leads PEARL past various obstacles such as a rake, a hoe, and a shelf-prop, ensuring their safety as they crouch down beside a barrel filled with apples. The sound of the PREACHER'S footsteps reverberates through the off-screen kitchen. Alert and vigilant, both of them focus intently towards the cellar door off-screen. As the door opens, the PREACHER'S head, illuminated by the flickering light of a candle held in its holder, casts light on the white-washed wall and along the stairs, as he clop-clops nearly all the way to the bottom of those stairs. ICEY's voice, bright and authoritative, cheerfully cuts across his descent as she makes her presence known at the top of the stairs, her voice crackling with command. After a brief pause, the children, now covered in coal-dust, emerge into the light and begin their climb up the stairs, with JOHN's head hung low in an expression of defeat. As they step into the kitchen, we gradually PULL BACK. JOHN turns his gaze towards PEARL, and we PAN HER IN as the PREACHER'S hand, inscribed with the word LOVE, moves gently through her hair. We PAN with the PREACHER and ICEY as they make their way towards the door, and he watches ICEY leave, off-screen, as she walks away along the path outside. With his back turned towards us, PREACHER watches her for a brief moment, then turns around, pondering what action to take next. We begin with a CLOSE-UP of BIRDIE's head as he rocks back and forth, and we PULL BACK; he is seen rocking in a heavily intoxicated state. A bottle stands next to a picture, and he turns to address it. His hands grip the edges of the chest on either side of the picture that is now in view. BIRDIE picks up the bottle with trembling hands, his grip unstable, causing the bottle to slip from his grasp and fall on its side at the chest's edge. The reverse angle of the opening shot reveals BIRDIE rocking heavily as the liquor spills from the bottle, gurgling onto the floor. PREACHER sits at the head of the table with JOHN positioned to his right, standing around the corner of the table, maintaining an expressionless and motionless demeanor until he finally speaks. The table is laden with an abundance of delicious food as PREACHER, appearing well-fed and leisurely, delicately dabs his mouth with a napkin, methodically folds it, places it into a napkin ring, and then folds his hands, waiting patiently. PEARL frowns, placing her finger in her mouth, recalling the moment he cruelly twisted her arm. PREACHER slaps the table with authority; his eyes spark with intensity, causing PEARL to begin to snivel. He unveils a knife, and PEARL shakes her head to indicate no. He activates the spring; the blade flicks open, and he sets the open knife on the table. Mistaking the knife for a toy, PEARL crosses behind JOHN to pick it up, her mouth quivering as a large tear wells in her eyes. She sniffs and wipes her eyes with her free hand, attempting to compose herself."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "They direct their attentive gazes towards the recently departed PREACHER, keenly observing the scene as JOHN steps forward to assume control of the unfolding situation. He begins to speak in a voice that is notably quiet and gentle, yet somehow manages to convey a calm and cheerful tone, reminiscent of someone addressing a patient who is unwell. With slow and deliberate movements, he carefully starts to make his way down the coal-heap, which rustles softly beneath their feet, all while assisting PEARL in her cautious descent. Together, they successfully reach the solid firmness of the cellar floor. In the meantime, the PREACHER is seen thoughtfully peering under the bed, while off-screen, the echoing sound of the PREACHER'S footsteps can be distinctly heard descending the stairs. With utmost caution and care, JOHN guides PEARL past numerous potential obstacles such as a rake, a hoe, and a shelf-prop, ensuring their safety as they crouch down beside a barrel brimming with apples. The sound of the PREACHER'S footsteps echoes through the off-screen kitchen, resonating with each step. Both JOHN and PEARL, remaining alert and vigilant, focus intently towards the invisible cellar door. As the door gradually creaks open, the PREACHER'S head, bathed in the flickering light of a candle held within its holder, casts a glow on the white-washed wall and along the stairway, as he clop-clops nearly the entire way down to the bottom of those stairs. Suddenly, ICEY's voice—bright, authoritative, and cheerful—slices through the descent, announcing her presence at the very top of the stairs with a voice crackling with command. After a brief pause, the children, now covered in a fine layer of coal-dust, emerge into the light and begin their climb up the stairs, with JOHN’s head hung low in a manner that suggests defeat. As they step into the kitchen, the camera gradually PULLS BACK. JOHN turns his gaze towards PEARL, and the camera PANS IN on her as the PREACHER'S hand, marked with the word LOVE, gently moves through her hair. We then PAN with the PREACHER and ICEY as they make their way towards the door, and he watches ICEY leave, off-screen, observing her as she walks away along the path outside. With his back turned towards us, the PREACHER watches her for a brief moment before he turns around, pondering thoughtfully about what action to take next. The scene begins with a CLOSE-UP of BIRDIE's head, which rocks rhythmically back and forth, and we PULL BACK; he is seen rocking in a state of heavy intoxication. A bottle stands prominently next to a picture, and he turns to address it. His hands, trembling slightly, grip the edges of the chest on either side of the now-visible picture. BIRDIE picks up the bottle with hands that betray his instability, causing it to slip from his grasp and fall onto its side at the edge of the chest. The reverse angle of the opening shot reveals BIRDIE rocking heavily as the liquor spills from the bottle, creating a gurgling puddle on the floor below. PREACHER sits at the head of the table with JOHN positioned directly to his right, standing stoically at the corner of the table, maintaining an expressionless and motionless demeanor until, at last, he speaks. The table before them is laden generously with an abundance of delicious food, as PREACHER, appearing content and leisurely, delicately dabs his mouth with a napkin before methodically folding it, placing it into a napkin ring, and then folding his hands with patience. Meanwhile, PEARL frowns, bringing her finger to her mouth as she recalls the moment he cruelly twisted her arm. PREACHER abruptly slaps the table with authority, his eyes sparking with intensity, causing PEARL to start sniveling. He unveils a knife with a flourish, and PEARL shakes her head to indicate her refusal. He activates the spring mechanism; the blade flicks open smoothly, and he sets the open knife conspicuously on the table. Mistaking the knife for a mere toy, PEARL moves to cross behind JOHN in an attempt to pick it up, her mouth quivering as a large, shimmering tear wells up in her eyes. She sniffs softly and uses her free hand to wipe her eyes, making an effort to compose herself."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The group collectively shifts their attention to the spot where the PREACHER had recently been before turning their focus to JOHN, who has now assumed leadership. Speaking in a voice that is both soft and reassuring, as if addressing someone convalescing, he maintains a calm demeanor while exuding an air of cheerfulness. With deliberate care, he begins descending the rustling coal-heap, ensuring PEARL's safety by assisting her in the descent until they both successfully reach the solid ground of the cellar floor. Simultaneously, PREACHER investigates the area under the bed and, off-screen, his footsteps can be heard descending the stairs. During this time, JOHN guides PEARL with caution past potential hazards such as a rake, a hoe, and a shelf-prop until they find a spot to hide beside an apple barrel. Alert and observant, both of them attentively monitor the cellar door off-screen. Upon hearing the door open, they see PREACHER’s head appear, illuminated by the candle he carries in a holder, casting light onto the white-washed wall and stairs as he makes his way down, his footsteps producing a distinct clop-clop rhythm. However, ICEY’s voice, filled with authority and cheer, interrupts his descent as she appears at the top of the stairs, her voice cutting through the scene. After a brief pause, the children, now covered in coal dust, move from their hiding spot into the light and begin to ascend the stairs, with JOHN’s head lowering in a gesture of defeat. As they enter the kitchen, the camera pulls back, capturing JOHN’s glance towards PEARL while the camera pans to focus on her, during which PREACHER’s hand, marked with the word LOVE, gently brushes through her hair. The camera then follows PREACHER and ICEY as they head toward the door, with PREACHER watching as ICEY departs off-screen along the path outside. Once alone, PREACHER stands with his back to the viewer, momentarily watching her leave before turning, contemplating his next course of action. The scene shifts to a close-up of BIRDIE’s head as it rocks back and forth, and the camera pulls back to reveal him inebriated while rocking continuously. A bottle stands beside a framed picture, and he turns to address the photograph, gripping the edges of the chest on either side of it. As he picks up the bottle, his trembling hand and the unsteady liquid within result in the bottle slipping from his grip, tumbling onto its side at the chest’s edge. The reverse angle shot from the opening sequence reveals BIRDIE rocking heavily as the liquor spills from the bottle, creating a gurgling sound as it pools on the floor. Meanwhile, PREACHER sits composed at the head of the table, with JOHN standing motionless and expressionless at his right, around the table's corner, until he eventually speaks. The table is laden with an abundance of delicious food, and PREACHER, appearing well-fed and relaxed, gently dabs his mouth with a napkin, which he then folds and places in a ring before clasping his hands together in a waiting posture. Observing this, PEARL frowns and instinctively puts her finger in her mouth, recalling the time he twisted her arm. In a sudden outburst, PREACHER slaps the table, his eyes full of intensity, causing PEARL to start sniveling. As he produces a knife, PEARL instinctively shakes her head in dissent. PREACHER activates the spring, causing the blade to flick open, and places the open knife on the table. Mistaking the knife for a toy, PEARL moves behind JOHN to retrieve it, her mouth quivering with emotion as a large tear gathers in her eyes. She sniffles quietly, wiping her eyes with her free hand balled into a fist."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "John assumes leadership quietly and cheerfully, guiding Pearl down a rustling coal-heap to the cellar floor. They navigate past obstacles like a rake and a hoe, eventually hiding beside an apple barrel as Preacher searches under the bed and then approaches the cellar with a candle. Icey interrupts from the stairs, exuding authority. Disheartened and dust-covered, the children emerge into the light and ascend the stairs to the kitchen. John looks at Pearl as Preacher tenderly runs his hand through her hair. Preacher and Icey move towards the exit, and Preacher momentarily ponders as Icey departs. Meanwhile, Birdie, drunk and rocking, converses with a picture, loses grip on a bottle, and spills liquor. Preacher sits comfortably at a table laden with food, while John remains expressionless beside him. Pearl recalls Preacher's past cruelty and frowns, leading to Preacher slapping the table, startling her. He displays a knife, which Pearl mistakenly thinks is a toy. She reaches for it, tears brimming, and wipes her eyes with her free hand."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "They look towards the departed PREACHER, a man known in the community for his fervent and often intense sermons, as JOHN, the older sibling who had to unexpectedly step up to a leadership role, has taken charge. He speaks very quietly, but calmly and cheerfully, as if addressing an invalid, perhaps recalling the comforting tone he used with their ailing grandmother. He starts down the rustling coal-heap, the leftover remnants from the household's winter heating, helping PEARL down with the care of a protective older brother, and they achieve the cellar floor used to store essentials like root vegetables. Meanwhile, PREACHER, known for his keen eye and methodical nature, looks under the bed, and o.s., PREACHER'S footsteps echo as they come down stairs, hinting at his purposeful approach; JOHN leads PEARL carefully past a rake, a hoe, and a shelf-prop, gardening tools their father once used, and they crouch down beside an apple barrel, which was part of last season's harvest. PREACHER'S footsteps cross kitchen o.s., providing a tense soundtrack to their hiding. Both look sharp towards the cellar door o.s. The door opens; PREACHER'S head, carrying a candle in holder, a relic from a time when electricity was scarce, illuminates a white-washed wall and stairs, and he clop-clops nearly to the bottom of the stairs. ICEY's voice, the family’s no-nonsense neighbor known for maintaining order, cuts cheerfully across his descent as she appears at the head of the stairs, her voice crackling with authority. After a short pause, the children, covered with coal-dust like little miners, emerge into the light and climb the stairs, with JOHN's head hung in defeat, showing the weight of responsibility on his young shoulders. As they enter the kitchen, we PULL BACK to reveal the meagerly decorated room indicative of their modest lifestyle. JOHN looks to PEARL, who is only five years old and already burdened with too much, and we PAN HER IN as PREACHER'S hand named LOVE, a peculiar tattoo he uses to manipulate and deceive, moves through her locks. We PAN with PREACHER and ICEY as they move towards the door, and he watches ICEY leave, o.s., as she goes away along the path outside, her silhouette a reminder of her powerful presence. PREACHER, his back to us, watches her a moment, then turns, wondering what to do next in his ongoing scheme. We begin with a HEAD CLOSE-UP of BIRDIE, the town drunk known for his tragic downfall after losing his family, as he rocks, and PULL BACK; he is rocking and drunk, perhaps lost in memories. A bottle stands beside the picture, likely a snapshot of happier times, and he turns and speaks to the picture, his voice thick with alcohol and regret. His hands grip the edge of the chest on either side of the picture, which we now see holds a forgotten past. BIRDIE picks up the bottle, his hand and the liquor tremble, a sign of his deteriorating state, and the bottle falls from his hand onto its side on the edge of the chest. The reverse angle of the opening shot shows BIRDIE rocking heavily as liquor gurgles from the bottle to the floor, an all-too-familiar scene in his life. PREACHER sits at the head of the table, assuming a position of authority with JOHN standing to his right, around the corner of the table, expressionless and immobile until he speaks, following his mother's advice to remain quiet in dangerous situations. The table is loaded with good food, a rare bounty suggesting a special occasion, as PREACHER, well-fed and at leisure, dabs his mouth delicately with his napkin, folds it, puts it in a ring, a habit of his from dining in finer places, and folds his hands, waiting. PEARL frowns and puts her finger in her mouth, remembering he twisted her arm, a painful memory she can't forget. PREACHER slaps the table; his eyes crackle with a self-righteous fire and PEARL starts to snivel, the beginning of tears that seem all too frequent for her. He brings out the knife, a sinister object he brandishes all too often, and PEARL shakes her head for no, knowing its threat. He touches the spring; the blade flicks open with a menacing click, and he lays the open knife on the table. PEARL thinks the knife is a toy, a testament to her innocence, and crosses behind JOHN to pick it up, her mouth quivering as a large tear brims in her eyes, evidence of the fear she feels. She sniffles and wipes her eyes with her free fist, a small act of defiance in the face of her terror."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "They look towards the departed PREACHER as JOHN has taken charge. He speaks very quietly but calmly and cheerfully as to an invalid. He starts down the rustling coalheap helping PEARL down and they achieve the cellar floor. Meanwhile PREACHER looks under the bed and os. PREACHER'S footsteps come down stairs. JOHN leads PEARL carefully past a rake a hoe and a shelfprop and they crouch down beside an apple barrel. PREACHER'S footsteps cross kitchen os. Both look sharp towards the cellar door. os. The door opens. PREACHER'S head carrying a candle in holder illuminates a whitewashed wall and stairs and he clopclops nearly to the bottom of the stairs. ICEY's voice cuts cheerfully across his descent as she appears at the head of the stairs her voice crackling with authority. After a short pause the children covered with coaldust emerge into the light and climb the stairs with JOHN's head hung in defeat. As they enter the kitchen we PULL BACK. JOHN looks to PEARL and we PAN HER IN as PREACHER'S hand named LOVE moves through her locks. We PAN with PREACHER and ICEY as they move towards the door and he watches. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. ICEY leave os as she goes away along the path outside. PREACHER his back to us watches her a moment then turns wondering what to do next. We begin with a HEAD CLOSEUP of BIRDIE as he rocks and PULL BACK. he is rocking and drunk. A bottle stands beside the picture and he turns and speaks to the picture. His hands grip the edge of the chest on either side of the picture which we now see. BIRDIE picks up the bottle his hand and the liquor tremble and the bottle falls from his hand onto its side on the edge of the chest. The reverse angle of the opening shot shows BIRDIE rocking heavily as liquor gurgles from the bottle to the floor. PREACHER sits at the head of the table with JOHN standing to his right around the corner of the table expressionless and immobile until he speaks. The table is loaded with good food as PREACHER wellfed and at leisure dabs his mouth delicately with his napkin folds it puts it in a ring and folds his hands waiting. PEARL frowns and puts her finger in her mouth remembering he twisted her arm. PREACHER slaps the table his eyes crackle and PEARL starts to snivel. He brings out the knife and PEARL shakes her head for no. He touches the spring. the blade flicks open and he lays the open knife on the table. PEARL thinks the knife is a toy and crosses behind JOHN to pick it up her mouth quivering as a large tear brims in her eyes. She sniffles and wipes her eyes with her free fist."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "They look towards the departed PREACHER as JOHN has taken charge. He speaks very quietly but calmly and cheerfully as to an invalid. He starts down the rustling coalheap helping PEARL down and they achieve the cellar floor. Meanwhile PREACHER looks under the bed and os. PREACHER'S footsteps come down stairs. JOHN leads PEARL carefully past a rake a hoe and a shelfprop and they crouch down beside an apple barrel. PREACHER'S footsteps cross kitchen os. Both look sharp towards the cellar door. os. The door opens. PREACHER'S head carrying a candle in holder illuminates a whitewashed wall and stairs and he clopclops nearly to the bottom of the stairs. ICEY's voice cuts cheerfully across his descent as she appears at the head of the stairs her voice crackling with authority. After a short pause the children covered with coaldust emerge into the light and climb the stairs with JOHN's head hung in defeat. As they enter the kitchen we PULL BACK. JOHN looks to PEARL and we PAN HER IN as PREACHER'S hand named LOVE moves through her locks. We PAN with PREACHER and ICEY as they move towards the door and he watches. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. ICEY leave os as she goes away along the path outside. PREACHER his back to us watches her a moment then turns wondering what to do next. We begin with a HEAD CLOSEUP of BIRDIE as he rocks and PULL BACK. he is rocking and drunk. A bottle stands beside the picture and he turns and speaks to the picture. His hands grip the edge of the chest on either side of the picture which we now see. BIRDIE picks up the bottle his hand and the liquor tremble and the bottle falls from his hand onto its side on the edge of the chest. The reverse angle of the opening shot shows BIRDIE rocking heavily as liquor gurgles from the bottle to the floor. PREACHER sits at the head of the table with JOHN standing to his right around the corner of the table expressionless and immobile until he speaks. The table is loaded with good food as PREACHER wellfed and at leisure dabs his mouth delicately with his napkin folds it puts it in a ring and folds his hands waiting. PEARL frowns and puts her finger in her mouth remembering he twisted her arm. PREACHER slaps the table his eyes crackle and PEARL starts to snivel. He brings out the knife and PEARL shakes her head for no. He touches the spring. the blade flicks open and he lays the open knife on the table. PEARL thinks the knife is a toy and crosses behind JOHN to pick it up her mouth quivering as a large tear brims in her eyes. She sniffles and wipes her eyes with her free fist."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "They look towards the departed PREACHER as JOHN has taken charge. He speaks very quietly but calmly and cheerfully as to an invalid. He starts down the rustling coalheap helping PEARL down and they achieve the cellar floor. Meanwhile PREACHER looks under the bed and os. PREACHER'S footsteps come down stairs. JOHN leads PEARL carefully past a rake a hoe and a shelfprop and they crouch down beside an apple barrel. PREACHER'S footsteps cross kitchen os. Both look sharp towards the cellar door. PREACHER sits at the head of the table with JOHN standing to his right around the corner of the table expressionless and immobile until he speaks. The table is loaded with good food as PREACHER wellfed and at leisure dabs his mouth delicately with his napkin folds it puts it in a ring and folds his hands waiting. PEARL frowns and puts her finger in her mouth remembering he twisted her arm. PREACHER slaps the table his eyes crackle and PEARL starts to snivel. He brings out the knife and PEARL shakes her head for no. He touches the spring. the blade flicks open and he lays the open knife on the table. PEARL thinks the knife is a toy and crosses behind JOHN to pick it up her mouth quivering as a large tear brims in her eyes. She sniffles and wipes her eyes with her free fist."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "They look towards the departed PREACHER as JOHN has taken charge. He speaks very quietly but calmly and cheerfully as to an invalid. He starts down the rustling coalheap helping PEARL down and they achieve the cellar floor. He touches the spring. the blade flicks open and he lays the open knife on the table. PEARL thinks the knife is a toy and crosses behind JOHN to pick it up her mouth quivering as a large tear brims in her eyes. She sniffles and wipes her eyes with her free fist."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "They gaze toward the absent PAINTER as MIKE has assumed control. He murmurs softly, yet firmly and joyfully, as to a bystander. He proceeds up the whispering sand-dune, guiding RUBY up, and they conquer the attic ceiling. Meanwhile, PAINTER peers behind the curtain, and o.s., PAINTER'S shuffles ascend ladders; MIKE navigates RUBY cautiously past a broom, a spade, and a vase-holder, and they huddle beside a tomato bin. PAINTER'S shuffles traverse garden o.s. Both glance keenly toward the attic hatch o.s. The hatch opens; PAINTER'S head, balancing a lantern in grip, brightens a brick-lined archway and ladders, and he tap-taps nearly to the summit of the ladders. LUCY's voice pierces joyfully across his climb as she materializes at the foot of the ladders, her voice snapping with dominance. After a brief intermission, the animals, masked with soot, surface into the illumination and descend the ladders, with MIKE's head drooping in surrender. As they step into the garden, we RETRACT. MIKE glances to RUBY and we TRACK HER IN as PAINTER'S hand dubbed JOY moves through her curls. We TRACK with PAINTER and LUCY as they advance toward the hatch, and he observes LUCY depart, o.s., as she meanders away down the trail inside. PAINTER, his front to us, observes her a moment, then rotates, pondering what to try next. We commence with a FACE ZOOM of CHARLIE as he drifts, and RETRACT; he is drifting and sleepy. A teacup rests beside the photograph, and he rotates and whispers to the photograph. His fingers clutch the brink of the box on either flank of the photograph, which we now discern. CHARLIE snatches the teacup, his fingers and the brew quiver, and the teacup topples from his grasp onto its rim on the brink of the box. The flipped perspective of the starting shot displays CHARLIE drifting profoundly as brew bubbles from the teacup to the ceiling. PAINTER reclines at the foot of the bench with MIKE parked to his left, across the bend of the bench, emotionless and static until he murmurs. The bench is strewn with bad fruit as PAINTER, well-satisfied and at ease, pats his lips gently with his kerchief, coils it, places it in a hoop, and clasps his fingers, waiting. RUBY scowls and places her thumb in her cheek, recalling he bent her finger. PAINTER taps the bench; his pupils sparkle and RUBY commences to whimper. He produces the spoon, and RUBY nods her brow for yes. He presses the latch; the blade snaps shut, and he places the shut knife on the bench. RUBY imagines the knife is a puzzle and slides before MIKE to grasp it, her lip twitching as a tiny sob wells in her ears. She gasps and rubs her ears with her loose palm."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "As JOHN assumes leadership, he calmly assists PEARL down a coal-heap, reaching the cellar floor. They navigate past obstacles, hiding near an apple barrel as PREACHER searches with a candle. ICEY interrupts, prompting the coal-dusted children to emerge, defeated, into the kitchen. JOHN looks desolate but reassures PEARL. PREACHER watches ICEY exit before pondering his next move. A drunken BIRDIE is seen, gripping a picture, and accidentally spills liquor from a bottle. At the dining table, PREACHER sits comfortably, taunting PEARL by displaying a knife. She initially thinks it's a toy, approaches it tearfully, and wipes her eyes, aware of the underlying threat."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She sniffles and wipes her eyes with her free fist PEARL thinks the knife is a toy and crosses behind JOHN to pick it up her mouth quivering as a large tear brims in her eyes the blade flicks open and he lays the open knife on the table He touches the spring He brings out the knife and PEARL shakes her head for no PREACHER slaps the table his eyes crackle and PEARL starts to snivel PEARL frowns and puts her finger in her mouth remembering he twisted her arm The table is loaded with good food as PREACHER wellfed and at leisure dabs his mouth delicately with his napkin folds it puts it in a ring and folds his hands waiting PREACHER sits at the head of the table with JOHN standing to his right around the corner of the table expressionless and immobile until he speaks The reverse angle of the opening shot shows BIRDIE rocking heavily as liquor gurgles from the bottle to the floor BIRDIE picks up the bottle his hand and the liquor tremble and the bottle falls from his hand onto its side on the edge of the chest His hands grip the edge of the chest on either side of the picture which we now see A bottle stands beside the picture and he turns and speaks to the picture he is rocking and drunk We begin with a HEAD CLOSEUP of BIRDIE as he rocks and PULL BACK PREACHER his back to us watches her a moment then turns wondering what to do next ICEY leave os as she goes away along the path outside We PAN with PREACHER and ICEY as they move towards the door and he watches JOHN looks to PEARL and we PAN HER IN as PREACHER'S hand named LOVE moves through her locks As they enter the kitchen we PULL BACK After a short pause the children covered with coaldust emerge into the light and climb the stairs with JOHN's head hung in defeat ICEY's voice cuts cheerfully across his descent as she appears at the head of the stairs her voice crackling with authority PREACHER'S head carrying a candle in holder illuminates a whitewashed wall and stairs and he clopclops nearly to the bottom of the stairs The door opens os Both look sharp towards the cellar door PREACHER'S footsteps cross kitchen os JOHN leads PEARL carefully past a rake a hoe and a shelfprop and they crouch down beside an apple barrel PREACHER'S footsteps come down stairs Meanwhile PREACHER looks under the bed and os He starts down the rustling coalheap helping PEARL down and they achieve the cellar floor He speaks very quietly but calmly and cheerfully as to an invalid They look towards the departed PREACHER as JOHN has taken charge"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He speaks very quietly but calmly and cheerfully as to an invalid They look towards the departed PREACHER as JOHN has taken charge Meanwhile PREACHER looks under the bed and os He starts down the rustling coalheap helping PEARL down and they achieve the cellar floor JOHN leads PEARL carefully past a rake a hoe and a shelfprop and they crouch down beside an apple barrel PREACHER'S footsteps come down stairs Both look sharp towards the cellar door PREACHER'S footsteps cross kitchen os The door opens os ICEY's voice cuts cheerfully across his descent as she appears at the head of the stairs her voice crackling with authority PREACHER'S head carrying a candle in holder illuminates a whitewashed wall and stairs and he clopclops nearly to the bottom of the stairs As they enter the kitchen we PULL BACK After a short pause the children covered with coaldust emerge into the light and climb the stairs with JOHN's head hung in defeat We PAN with PREACHER and ICEY as they move towards the door and he watches JOHN looks to PEARL and we PAN HER IN as PREACHER'S hand named LOVE moves through her locks PREACHER his back to us watches her a moment then turns wondering what to do next ICEY leave os as she goes away along the path outside he is rocking and drunk We begin with a HEAD CLOSEUP of BIRDIE as he rocks and PULL BACK His hands grip the edge of the chest on either side of the picture which we now see A bottle stands beside the picture and he turns and speaks to the picture The reverse angle of the opening shot shows BIRDIE rocking heavily as liquor gurgles from the bottle to the floor BIRDIE picks up the bottle his hand and the liquor tremble and the bottle falls from his hand onto its side on the edge of the chest The table is loaded with good food as PREACHER wellfed and at leisure dabs his mouth delicately with his napkin folds it puts it in a ring and folds his hands waiting PREACHER sits at the head of the table with JOHN standing to his right around the corner of the table expressionless and immobile until he speaks PREACHER slaps the table his eyes crackle and PEARL starts to snivel PEARL frowns and puts her finger in her mouth remembering he twisted her arm He touches the spring He brings out the knife and PEARL shakes her head for no PEARL thinks the knife is a toy and crosses behind JOHN to pick it up her mouth quivering as a large tear brims in her eyes the blade flicks open and he lays the open knife on the table She sniffles and wipes her eyes with her free fist"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "PREACHER his back to us watches her a moment then turns wondering what to do next We begin with a HEAD CLOSEUP of BIRDIE as he rocks and PULL BACK he is rocking and drunk A bottle stands beside the picture and he turns and speaks to the picture His hands grip the edge of the chest on either side of the picture which we now see BIRDIE picks up the bottle his hand and the liquor tremble and the bottle falls from his hand onto its side on the edge of the chest The reverse angle of the opening shot shows BIRDIE rocking heavily as liquor gurgles from the bottle to the floor PREACHER sits at the head of the table with JOHN standing to his right around the corner of the table expressionless and immobile until he speaks The table is loaded with good food as PREACHER wellfed and at leisure dabs his mouth delicately with his napkin folds it puts it in a ring and folds his hands waiting PEARL frowns and puts her finger in her mouth remembering he twisted her arm PREACHER slaps the table his eyes crackle and PEARL starts to snivel He brings out the knife and PEARL shakes her head for no He touches the spring the blade flicks open and he lays the open knife on the table PEARL thinks the knife is a toy and crosses behind JOHN to pick it up her mouth quivering as a large tear brims in her eyes She sniffles and wipes her eyes with her free fist They look towards the departed PREACHER as JOHN has taken charge He speaks very quietly but calmly and cheerfully as to an invalid He starts down the rustling coalheap helping PEARL down and they achieve the cellar floor Meanwhile PREACHER looks under the bed and os PREACHER'S footsteps come down stairs JOHN leads PEARL carefully past a rake a hoe and a shelfprop and they crouch down beside an apple barrel PREACHER'S footsteps cross kitchen os Both look sharp towards the cellar door os The door opens PREACHER'S head carrying a candle in holder illuminates a whitewashed wall and stairs and he clopclops nearly to the bottom of the stairs ICEY's voice cuts cheerfully across his descent as she appears at the head of the stairs her voice crackling with authority After a short pause the children covered with coaldust emerge into the light and climb the stairs with JOHN's head hung in defeat As they enter the kitchen we PULL BACK JOHN looks to PEARL and we PAN HER IN as PREACHER'S hand named LOVE moves through her locks We PAN with PREACHER and ICEY as they move towards the door and he watches ICEY leave os as she goes away along the path outside"
        }
      ]
    }
  ]
}