{
  "ground_truth": "In a series of events, a man drops a tray and quickly picks it up as he runs from a church. Valjean is then brought back to the church, where the bishop, noticing this, hands him two candlesticks and places his hand on Valjean's head. A tomb with carvings of two Christified figures is nearby as Valjean kneels at the altar with papers in his hand, and blood stains his temple where he was hit. Having walked away from the altar, he returns to it, sinking to his knees before striding out of the church, ripping his papers to shreds as he goes to the far corner of the churchyard, throwing the pieces into the air. The church, located in a walled village on a hill, witnesses a piece of paper flying high into the air towards the sun. Meanwhile, Javert, in uniform, rides in the rain ahead of four other horsemen as they enter the city. In a dark cobbled slum, a woman takes the wrapped body of a child from a weeping mother, while in a factory, a worker snatches a note from Fantine, who tries to retrieve it. Valjean, now clean-shaven with dark neatly trimmed hair and smartly dressed to look like a gentleman, glances up to see Javert gazing down at the factory floor, which unnerves Valjean, causing him to walk away from the women. The foreman throws Fantine onto the street, flinging coins at her. In a courtyard, Valjean sees another uniformed horseman accompanying Javert, who paces inside an office. Valjean slowly makes his way up the stairs, and the two men bow to one another. Javert removes his hat and hands a paper to Valjean, who in turn gives Javert a rosary, prompting Javert to lower his gaze. They rush out onto the cobbled street where a man is trapped under a cart, and Valjean crouches beside him as Javert watches. Valjean grimaces but manages to lift the cart off the trapped man, which makes Javert's eyes narrow. After dropping the shaft, Javert hesitates, then bows his head and turns away. Later, Fantine walks quickly along the streets, passing people standing in the darkness, while tightly wrapping a shawl around her. She stops and stares forlornly before passing a man smoking a long pipe and seated women, then approaches a scruffy man. Fantine's sleek, long dark hair is cut, and she is held down as a tooth extractor is pushed into her mouth. A silver-haired man appears, and Fantine drinks from a small bottle, placing her hand in a man's who is wearing a captain's hat. The captain then pushes her down, turns her over, and slowly raises the hem of her dress.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here is the transformed text with synonyms:\n\nIn a sequence of occurrences, a gentleman drops a platter and swiftly picks it up as he rushes from a chapel. Valjean is then brought back to the chapel, where the bishop, observing this, hands him two candlesticks and places his hand on Valjean's head. A tomb with engravings of two Christified figures is nearby as Valjean kneels at the altar with documents in his hand, and blood stains his temple where he was struck. Having walked away from the altar, he returns to it, sinking to his knees before striding out of the chapel, tearing his documents to shreds as he goes to the far corner of the churchyard, throwing the fragments into the air. The chapel, situated in a walled village on a hill, witnesses a piece of paper soaring high into the air towards the sun. Meanwhile, Javert, in uniform, rides in the rain ahead of four other horsemen as they enter the metropolis. In a dark cobbled slum, a woman takes the wrapped body of a child from a weeping mother, while in a factory, a worker seizes a note from Fantine, who endeavors to retrieve it. Valjean, now clean-shaven with dark neatly trimmed hair and smartly dressed to resemble a gentleman, glances up to see Javert gazing down at the factory floor, which unnerves Valjean, causing him to walk away from the women. The foreman throws Fantine onto the street, flinging coins at her. In a courtyard, Valjean sees another uniformed horseman accompanying Javert, who paces inside an office. Valjean slowly makes his way up the stairs, and the two men bow to one another. Javert removes his hat and hands a document to Valjean, who in turn gives Javert a rosary, prompting Javert to lower his gaze. They rush out onto the cobbled street where a man is trapped under a cart, and Valjean crouches beside him as Javert watches. Valjean grimaces but manages to lift the cart off the trapped man, which makes Javert's eyes narrow. After dropping the shaft, Javert hesitates, then inclines his head and turns away. Later, Fantine walks quickly along the streets, passing people standing in the gloom, while tightly wrapping a shawl around her. She stops and gazes forlornly before passing a man smoking a long pipe and seated women, then approaches a scruffy man. Fantine's sleek, long dark hair is cut, and she is held down as a tooth extractor is pushed into her mouth. A silver-haired man appears, and Fantine drinks from a small flask, placing her hand in a man's who is wearing a captain's hat. The captain then pushes her down, turns her over, and slowly raises the hem of her dress."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "In a series of events, a tray is dropped by a man and is quickly picked up by him as the church is run from by him. Valjean is then brought back to the church, where the bishop notices this, hands him two candlesticks, and places his hand on Valjean's head. A tomb with carvings of two Christified figures is nearby as the altar is knelt at by Valjean with papers in his hand, and his temple is stained with blood where he was hit. Having walked away from the altar, the altar is returned to by him, and he sinks to his knees before he strides out of the church, ripping his papers to shreds as the far corner of the churchyard is gone to by him, and he throws the pieces into the air. The church, located in a walled village on a hill, witnesses a piece of paper flying high into the air towards the sun. Meanwhile, Javert, in uniform, rides in the rain ahead of four other horsemen as the city is entered by them. In a dark cobbled slum, the wrapped body of a child is taken from a weeping mother by a woman, while in a factory, a note is snatched from Fantine by a worker, who tries to retrieve it. Valjean, now clean-shaven with dark neatly trimmed hair and smartly dressed to look like a gentleman, glances up to see Javert gazing down at the factory floor, which unnerves Valjean, causing the women to be walked away from by him. Fantine is thrown onto the street by the foreman, and coins are flung at her by him. In a courtyard, another uniformed horseman accompanying Javert is seen by Valjean, who paces inside an office. Valjean slowly makes his way up the stairs, and the two men bow to one another. Javert removes his hat and hands a paper to Valjean, who in turn gives a rosary to Javert, prompting Javert to lower his gaze. They rush out onto the cobbled street where a man is trapped under a cart, and the cart is crouched by Valjean beside him as he is watched by Javert. Valjean grimaces but manages to lift the cart off the man, which causes Javert's eyes to narrow. After the shaft is dropped, Javert hesitates, then his head is bowed and he turns away. Later, Fantine walks quickly along the streets, passing people standing in the darkness, while a shawl is tightly wrapped around her by her. She stops and stares forlornly before a man smoking a long pipe and seated women are passed, then she approaches a scruffy man. Fantine's sleek, long dark hair is cut, and she is held down as a tooth extractor is pushed into her mouth. A silver-haired man appears, and Fantine drinks from a small bottle, placing her hand in the hand of a man who is wearing a captain's hat. The captain then pushes her down, turns her over, and slowly the hem of her dress is raised by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In a series of events, a man drops a tray, quickly picking it up as he rushes from a church. Valjean is brought back, and the bishop hands him two candlesticks, placing his hand on Valjean's head. Nearby, a tomb with carvings of Christified figures stands as Valjean kneels at the altar, papers in hand, blood on his temple. He returns to the altar, kneels, then strides out, shredding his papers and tossing them into the air in the churchyard. In a walled village, a paper flies toward the sun. Meanwhile, Javert, in uniform, rides through rain with four horsemen entering the city. In a dark slum, a woman takes a wrapped child from a weeping mother; in a factory, a worker grabs a note from Fantine. Valjean, now clean-shaven and well-dressed, is unnerved by Javert's gaze from above, causing him to leave. The foreman throws Fantine onto the street, flinging coins at her. In a courtyard, Valjean sees Javert with another horseman. Valjean ascends the stairs; they bow to each other. Javert hands Valjean a paper, receiving a rosary in return, prompting him to lower his gaze. They rush to a cobbled street where Valjean lifts a cart off a trapped man as Javert watches, narrowing his eyes. Javert hesitates, bows, then turns away. Later, Fantine walks quickly, wrapping a shawl tightly, pausing before passing a smoking man and seated women, then approaches a scruffy man. Her long dark hair is cut, and she is held as a tooth extractor is used. A silver-haired man appears; Fantine drinks from a small bottle, placing her hand in that of a man in a captain's hat. The captain pushes her down, raises her dress hem."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "In a series of events, a man drops a tray and quickly retrieves it while running from a church. Valjean is returned to the church, where the bishop gives him two candlesticks and places a hand on his head. Near a tomb with carvings, Valjean kneels at the altar with papers and a blood-stained temple. He walks away, returns, kneels, and then shreds his papers, tossing them into the air outside the church in a walled village on a hill. Meanwhile, Javert, in uniform, rides in the rain with four horsemen entering the city. In a dark slum, a woman takes a child's body from a weeping mother, and in a factory, a worker snatches a note from Fantine. Valjean, clean-shaven and well-dressed, sees Javert looking down from the factory floor, unnerving him. The foreman throws Fantine out, tossing coins at her. In a courtyard, Valjean sees another horseman with Javert, who paces in an office. Valjean ascends stairs, and they bow to each other. Javert gives Valjean a paper, and Valjean hands him a rosary, causing Javert to avert his eyes. They rush to help a man trapped under a cart; Valjean lifts it while Javert watches, impressed but narrowing his eyes. Later, Fantine, with sleek dark hair, walks the streets, passing strangers. Her hair is cut, and she is held as a tooth extractor is used. A silver-haired man appears, and Fantine drinks from a bottle, placing her hand in a captain's, who then pushes her down, turns her over, and raises her dress."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In a series of interconnected events unfolding with dramatic tension, a man finds himself inadvertently dropping a tray and hastily retrieving it as he makes his way out in a hurried manner from the confines of a church. Subsequently, Valjean is escorted back to the same church, where the bishop, observing the situation, generously presents him with two valuable candlesticks and gently places his comforting hand upon Valjean's head in a gesture of compassion. Nearby, a solemn tomb, intricately carved with the likenesses of two figures reminiscent of Christ, stands as Valjean kneels in a state of introspection at the altar, holding papers in his hand while blood marks his temple from a previous blow. After distancing himself from the altar, he finds himself drawn back to it, sinking to his knees in a moment of revelation before purposefully striding out of the sacred space. As he heads towards the remote corner of the churchyard, he dramatically tears his papers to shreds, releasing them into the wind. The church, situated within the protective walls of a village perched on a hill, becomes a witness to one lone piece of paper, caught by the wind, soaring skyward in the direction of the sun. \n\nAt the same time, Javert, donned in his authoritative uniform, leads a procession in the pouring rain, riding ahead of four other horsemen as they make their way into the bustling city. Amidst the stark, shadowy slum streets paved with ancient cobblestones, a distraught mother bids farewell to the wrapped body of her child, handed over to another woman, while within the confines of a factory, a worker roughly snatches a note from Fantine, who desperately attempts to retrieve it. Meanwhile, Valjean, having undergone a transformation to appear clean-shaven with dark hair neatly trimmed and dressed in attire befitting a gentleman, looks up to find Javert surveying the factory floor with an intense gaze, unsettling Valjean and prompting him to distance himself from the women present. In a cruel move, the foreman dismisses Fantine onto the street, throwing coins at her with disdain.\n\nIn a courtyard setting, Valjean observes another horseman, similarly uniformed, standing alongside Javert, who is engaged in pacing inside an office space. Valjean carefully ascends the staircase, and the two men respectfully bow to one another in acknowledgment. Javert ceremoniously removes his hat, presenting a paper to Valjean, who reciprocates by handing Javert a rosary, compelling Javert to lower his eyes in contemplation. Together, they rush out onto a street paved with cobblestones, where a man is trapped beneath a heavy cart. Valjean courageously crouches beside him, while Javert observes with penetrating eyes. Valjean, despite grimacing with exertion, manages to lift the cart, freeing the trapped individual, a feat that causes Javert's eyes to narrow in suspicion. After setting the shaft down, Javert hesitates momentarily before bowing his head and turning away in a gesture of respect.\n\nLater, Fantine walks swiftly along the streets, navigating through a crowd of people standing in the enveloping darkness, wrapping her shawl tightly around her for warmth and protection. She pauses, staring forlornly into the distance before passing by a man smoking a long pipe and women seated nearby. She then approaches a disheveled, scruffy man. Tragically, Fantine's sleek and long dark hair is shorn, and she is forcibly held down as a tooth extractor is cruelly inserted into her mouth. A dignified, silver-haired man appears, and Fantine drinks from a small bottle, reaching out to place her hand into that of a man wearing an authoritative captain's hat. This captain then proceeds to roughly push her down, turns her over with deliberate intent, and slowly raises the hem of her dress, marking a moment of deep despair."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In a compelling and intricate sequence of events that unfold with building dramatic tension, a man unexpectedly finds himself in the midst of dropping a tray. In a flurry, he hastily retrieves it as he swiftly makes his way out from the confines of a church, his actions filled with urgency. Following this, Valjean is brought back to the very same church, escorted by others. There, the bishop, taking note of the unfolding situation, acts with deep generosity, offering Valjean two valuable candlesticks. He gently places a comforting and compassionate hand upon Valjean's head, a gesture full of kindness. Close by, a solemn tomb stands, intricately and beautifully carved with figures that remind one of Christ. Valjean kneels in a deep state of introspection at the altar, holding papers tightly in his grasp, while a mark of blood on his temple from an earlier blow remains visible. After moving away from the altar, he feels an irresistible pull drawing him back to it once again, causing him to sink to his knees in a profound moment of revelation. Then, he purposefully strides out of the sacred space with renewed determination. Making his way toward the remote corner of the churchyard, he dramatically tears his papers into shreds, allowing them to be taken by the wind. The church, nestled securely within the protective walls of a village perched atop a hill, silently witnesses as one solitary piece of paper, carried by the wind, ascends skyward, aiming toward the sun.\n\nSimultaneously, Javert, donned in his distinctive and authoritative uniform, leads a procession through the relentless pouring rain, riding at the forefront of four other horsemen as they make their entrance into the bustling city. In the stark, shadowy streets of the slums, lined with ancient cobblestones, a distraught mother bids a tearful farewell to the wrapped body of her child, which is handed over to another woman. Meanwhile, inside a factory's confines, a worker harshly snatches a note from Fantine, who desperately attempts to retrieve it, only to be thwarted. Elsewhere, Valjean, having undergone a significant transformation to appear as a clean-shaven gentleman, his dark hair neatly trimmed and his attire befitting one of stature, looks up to see Javert casting an intense, scrutinizing gaze across the factory floor. This unsettling sight prompts Valjean to wisely distance himself from the women present. In a particularly cruel maneuver, the foreman dismisses Fantine onto the street, disdainfully throwing coins at her as a final insult.\n\nIn the setting of a courtyard, Valjean takes note of another horseman, similarly uniformed, positioned next to Javert, who is immersed in pacing within an office space. Valjean cautiously makes his way up the staircase, and the two men meet each other's gaze with mutual respect, bowing to one another in acknowledgment. Javert ceremoniously removes his hat, presenting a paper to Valjean, who responds by handing Javert a rosary, prompting Javert to lower his eyes in contemplative reflection. Together, they rush out onto a street paved with ancient cobblestones, where they find a man trapped beneath a heavy cart. Valjean bravely crouches down beside the unfortunate man, while Javert closely observes with a penetrating and discerning gaze. Despite grimacing with great exertion, Valjean successfully lifts the oppressive weight of the cart, freeing the trapped individual, a feat that causes Javert's eyes to narrow in suspicion. Once he carefully sets the cart's shaft down, Javert hesitates momentarily, then bows his head and turns away with an expression of reluctant respect.\n\nLater, Fantine moves swiftly along the streets, navigating her way through a throng of people standing in the enveloping darkness. She wraps her shawl tightly around her for warmth and protection against the night’s chill. She pauses momentarily, staring forlornly into the distant unknown before continuing past a man smoking a long-stemmed pipe and women seated nearby. She gradually approaches a disheveled, scruffy man, and tragically, her once sleek and long dark hair is shorn. As she is forcibly held down, a tooth extractor is cruelly inserted into her mouth. A dignified man with silver hair appears, and Fantine drinks from a small bottle, reaching out to place her hand into that of a man adorned with an authoritative captain’s hat. This captain then proceeds to harshly push her down, turning her over with deliberate intent, and slowly raises the hem of her dress, marking a moment of profound despair and degradation."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the scene unfolds, a man hurriedly drops a tray, momentarily scattering its contents, and swiftly leans down to collect it, his movements quick and purposeful, even as he breaks into a run from the church. Soon after, Valjean is escorted back into the church, and the bishop, keenly observing the situation, offers a gesture of kindness by handing him two candlesticks, tenderly placing his hand on Valjean's head in a reassuring manner. Nearby, a tomb adorned with carvings of two Christified figures stands as a solemn backdrop while Valjean kneels reverently at the altar, clutching papers in his hand, with blood marking the spot on his temple where he was struck. Rising from the altar, he initially walks away but soon returns, once again collapsing to his knees in a moment of inner turmoil, before resolutely striding out of the church. As he exits, he tears his papers methodically into shreds, his emotions evident in his actions, and as he reaches the far corner of the churchyard, he dramatically throws the pieces into the air. The paper fragments catch the wind, and one particularly catches the eye as it ascends high into the sky, heading towards the sun. Meanwhile, in parallel, Javert, clad in his uniform, rides determinedly in the rain, leading four horsemen as they make their entrance into the city. In a dimly lit cobbled slum, the narrative shifts to a poignant moment where a woman gently takes the wrapped body of a child from a grieving mother. Simultaneously, within the confines of a factory, a worker rudely snatches a note from Fantine's grasp, and she desperately tries to retrieve it. Valjean, transformed and clean-shaven with dark, neatly trimmed hair, now presents himself as a sophisticated gentleman, momentarily looks up to find Javert's penetrating gaze fixed on him from above, a sight that unsettles Valjean, making him turn away from the women and distance himself. Outside, the foreman callously ejects Fantine onto the street, throwing coins at her in a gesture of disdain. In a courtyard, Valjean observes another horseman in uniform alongside Javert, who paces thoughtfully inside an office. Valjean ascends the stairs with deliberate steps, and upon reaching Javert, the two men exchange a formal bow. Javert removes his hat respectfully and hands Valjean a paper, to which Valjean reciprocates by offering a rosary, a gesture that causes Javert to lower his gaze contemplatively. In a rush, they emerge onto the cobbled street where an urgent situation unfolds, a man trapped under a cart. Valjean crouches beside him, his face contorted in effort, and despite the strain, he manages to lift the cart, liberating the man, while Javert watches with a narrowing of his eyes, his suspicions heightened. As Valjean releases the cart shaft, Javert hesitates for a moment, then bows his head in acknowledgment and turns on his heel, leaving. Later, Fantine moves briskly along darkened streets, weaving through the crowd as she tightly wraps a shawl around her shoulders, her pace quick and determined. She halts momentarily, a look of despair on her face, before continuing on past a man leisurely smoking a long pipe and across from seated women, eventually making her way to a scruffy man who awaits. In a subsequent scene, Fantine's long, sleek dark hair is harshly cut, and she is held down forcefully as a tooth extractor is thrust into her mouth, the brutality of the act evident. A silver-haired man steps forward, and Fantine, in her desperation, takes a drink from a small bottle, then reaches out to place her hand trustingly in that of a man who is wearing a captain's hat. The captain, with a calculated push, forces her down, rolls her over, and begins to slowly raise the hem of her dress, a moment laden with implication."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "In a series of events, a man hurriedly retrieves a dropped tray and rushes from a church. Valjean is returned to the church, where the bishop gives him two candlesticks and blesses him. Kneeling at the altar near a carved tomb, Valjean, with blood on his temple from an earlier injury, holds papers, then departs, tearing the papers and scattering them in the churchyard. In a walled hilltop village, a piece of paper ascends toward the sun. Meanwhile, Javert and four horsemen enter the city in the rain. In a slum, a woman takes a child’s wrapped body from a grieving mother, while in a factory, Fantine struggles to retrieve a note from a worker. Valjean, now well-groomed and dressed as a gentleman, is troubled by Javert’s watchful gaze from above and distances himself from the women. Outside, the foreman throws Fantine onto the street, hurling coins at her. In a courtyard, Valjean observes another uniformed horseman with Javert, who is in an office. Ascending the stairs, Valjean exchanges bows with Javert, who hands him a paper in return for a rosary. They rush to aid a man trapped under a cart, with Valjean lifting the cart as Javert observes, leading Javert to bow and turn away. Later, Fantine traverses dimly lit streets, clutching a shawl. She pauses pensively before passing by various people, then confronts a scruffy man. Fantine endures having her long hair cut and a tooth extracted. A silver-haired man appears, and as Fantine drinks from a bottle, she is coerced by a captain into a degrading situation."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In a series of events set in 19th-century France, a man drops a tray and quickly picks it up as he runs from a church known for its historical architecture and community charity. Valjean is then brought back to the church, where the bishop, known for his benevolence and compassion towards the poor, noticing this, hands him two candlesticks as a symbol of forgiveness and places his hand on Valjean's head. A tomb with carvings of two Christified figures, representing the eternal struggle between good and evil, is nearby as Valjean kneels at the altar with parole papers in his hand, and blood stains his temple where he was hit during a previous altercation with law enforcement. Having walked away from the altar, he returns to it, sinking to his knees in a moment of profound realization before striding out of the church, ripping his papers to shreds as he goes to the far corner of the churchyard, throwing the pieces into the air. The church, located in a walled village on a hill known for its panoramic views, witnesses a piece of paper flying high into the air towards the sun, symbolizing hope and freedom. Meanwhile, Javert, a dedicated inspector with a strong sense of duty, in uniform, rides in the rain ahead of four other horsemen as they enter the city known for its bustling markets and narrow streets. In a dark cobbled slum where poverty and desperation are rampant, a woman takes the wrapped body of a child from a weeping mother, while in a factory, a worker snatches a note from Fantine, a struggling single mother, who tries to retrieve it. Valjean, now clean-shaven with dark neatly trimmed hair and smartly dressed to look like a gentleman in order to blend in with societal norms, glances up to see Javert gazing down at the factory floor, which unnerves Valjean, causing him to walk away from the women. The foreman, driven by merciless economic demands, throws Fantine onto the street, flinging coins at her, signifying a cruel transaction. In a courtyard, Valjean sees another uniformed horseman accompanying Javert, who paces inside an office that symbolizes official authority and control. Valjean slowly makes his way up the stairs, and the two men bow to one another in a cautious acknowledgment of their intertwined fates. Javert removes his hat and hands a paper to Valjean, who in turn gives Javert a rosary, a symbol of faith and redemption, prompting Javert to lower his gaze. They rush out onto the cobbled street where a man is trapped under a cart, and Valjean crouches beside him, demonstrating his extraordinary strength as Javert watches. Valjean grimaces but manages to lift the cart off the trapped man, an act that makes Javert's eyes narrow, contemplating Valjean's true nature. After dropping the shaft, Javert hesitates, then bows his head and turns away, reconsidering his rigid views of justice. Later, Fantine walks quickly along the streets, passing people standing in the darkness of the early industrial age, while tightly wrapping a shawl around her to brace against the evening chill. She stops and stares forlornly before passing a man smoking a long pipe, a common sight in such neighborhoods, and seated women, then approaches a scruffy man indicative of the underground economy. Fantine's sleek, long dark hair, once her pride, is cut as a sacrifice for money, and she is held down as a tooth extractor is pushed into her mouth, a painful reminder of her desperation. A silver-haired man, a symbol of the oppressive societal norms of the time, appears, and Fantine drinks from a small bottle, likely containing laudanum for courage, placing her hand in a man's who is wearing a captain's hat, representing authority and manipulation. The captain then pushes her down, turns her over, and slowly raises the hem of her dress, highlighting the brutal realities she faces."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "while in a factory a worker snatches a note from Fantine who tries to retrieve it She stops and stares forlornly before passing a man smoking a long pipe and seated women then approaches a scruffy man In a series of events a man drops a tray and quickly picks it up as he runs from a church Later Fantine walks quickly along the streets passing people standing in the darkness while tightly wrapping a shawl around her Valjean now cleanshaven with dark neatly trimmed hair and smartly dressed to look like a gentleman glances up to see Javert gazing down at the factory floor which unnerves Valjean causing him to walk away from the women Valjean is then brought back to the church where the bishop noticing this hands him two candlesticks and places his hand on Valjean's head The captain then pushes her down turns her over and slowly raises the hem of her dress A tomb with carvings of two Christified figures is nearby as Valjean kneels at the altar with papers in his hand and blood stains his temple where he was hit Valjean slowly makes his way up the stairs and the two men bow to one another A tomb with carvings of two Christified figures is nearby as Valjean kneels at the altar with papers in his hand and blood stains his temple where he was hit Having walked away from the altar he returns to it sinking to his knees before striding out of the church ripping his papers to shreds as he goes to the far corner of the churchyard throwing the pieces into the air The church located in a walled village on a hill witnesses a piece of paper flying high into the air towards the sun Meanwhile Javert in uniform rides in the rain ahead of four other horsemen as they enter the city In a dark cobbled slum a woman takes the wrapped body of a child from a weeping mother while in a factory a worker snatches a note from Fantine who tries to retrieve it Valjean now cleanshaven with dark neatly trimmed hair and smartly dressed to look like a gentleman glances up to see Javert gazing down at the factory floor which unnerves Valjean causing him to walk away from the women The foreman throws Fantine onto the street flinging coins at her Valjean is then brought back to the church where the bishop noticing this hands him two candlesticks and places his hand on Valjean's head In a courtyard Valjean sees another uniformed horseman accompanying Javert who paces inside an office Valjean slowly makes his way up the stairs and the two men bow to one another In a courtyard Valjean sees another uniformed horseman accompanying Javert who paces inside an office In a series of events a man drops a tray and quickly picks it up as he runs from a church Javert removes his hat and hands a paper to Valjean who in turn gives Javert a rosary prompting Javert to lower his gaze They rush out onto the cobbled street where a man is trapped under a cart and Valjean crouches beside him as Javert watches Valjean grimaces but manages to lift the cart off the trapped man which makes Javert's eyes narrow After dropping the shaft Javert hesitates then bows his head and turns away Later Fantine walks quickly along the streets passing people standing in the darkness while tightly wrapping a shawl around her Having walked away from the altar he returns to it sinking to his knees before striding out of the church ripping his papers to shreds as he goes to the far corner of the churchyard throwing the pieces into the air She stops and stares forlornly before passing a man smoking a long pipe and seated women then approaches a scruffy man Fantine's sleek long dark hair is cut and she is held down as a tooth extractor is pushed into her mouth A silverhaired man appears and Fantine drinks from a small bottle placing her hand in a man's who is wearing a captain's hat The captain then pushes her down turns her over and slowly raises the hem of her dress"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "In a series of events a man drops a tray and quickly picks it up as he runs from a church. Valjean is then brought back to the church where the bishop noticing this hands him two candlesticks and places his hand on Valjean's head. A tomb with carvings of two Christified figures is nearby as Valjean kneels at the altar with papers in his hand and blood stains his temple where he was hit. Having walked away from the altar he returns to it sinking to his knees before striding out of the church ripping his papers to shreds as he goes to the far corner of the churchyard throwing the pieces into the air. The church located in a walled village on a hill witnesses a piece of paper flying high into the air towards the sun. Meanwhile Javert in uniform rides in the rain ahead of four other horsemen as they enter the city. In a dark cobbled slum a woman takes the wrapped body of a child from a weeping mother. while in a factory a worker snatches a note from Fantine who tries to retrieve it. Valjean now cleanshaven with dark neatly trimmed hair and smartly dressed to look like a gentleman glances up to see Javert gazing down at the factory floor which unnerves Valjean causing him to walk away from the women. The foreman throws Fantine onto the street flinging coins at her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In a courtyard Valjean sees another uniformed horseman accompanying Javert who paces inside an office. Valjean slowly makes his way up the stairs and the two men bow to one another. Javert removes his hat and hands a paper to Valjean who in turn gives Javert a rosary prompting Javert to lower his gaze. They rush out onto the cobbled street where a man is trapped under a cart and Valjean crouches beside him as Javert watches. Valjean grimaces but manages to lift the cart off the trapped man which makes Javert's eyes narrow. After dropping the shaft Javert hesitates then bows his head and turns away. Later Fantine walks quickly along the streets passing people standing in the darkness while tightly wrapping a shawl around her. She stops and stares forlornly before passing a man smoking a long pipe and seated women then approaches a scruffy man. Fantine's sleek long dark hair is cut and she is held down as a tooth extractor is pushed into her mouth. A silverhaired man appears and Fantine drinks from a small bottle placing her hand in a man's who is wearing a captain's hat. The captain then pushes her down turns her over and slowly raises the hem of her dress."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "In a series of events a man drops a tray and quickly picks it up as he runs from a church. Valjean is then brought back to the church where the bishop noticing this hands him two candlesticks and places his hand on Valjean's head. A tomb with carvings of two Christified figures is nearby as Valjean kneels at the altar with papers in his hand and blood stains his temple where he was hit. Having walked away from the altar he returns to it sinking to his knees before striding out of the church ripping his papers to shreds as he goes to the far corner of the churchyard throwing the pieces into the air. The church located in a walled village on a hill witnesses a piece of paper flying high into the air towards the sun. Meanwhile Javert in uniform rides in the rain ahead of four other horsemen as they enter the city. In a dark cobbled slum a woman takes the wrapped body of a child from a weeping mother. while in a factory a worker snatches a note from Fantine who tries to retrieve it. Valjean now cleanshaven with dark neatly trimmed hair and smartly dressed to look like a gentleman glances up to see Javert gazing down at the factory floor which unnerves Valjean causing him to walk away from the women. The foreman throws Fantine onto the street flinging coins at her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. In a courtyard Valjean sees another uniformed horseman accompanying Javert who paces inside an office. Valjean slowly makes his way up the stairs and the two men bow to one another. Javert removes his hat and hands a paper to Valjean who in turn gives Javert a rosary prompting Javert to lower his gaze. They rush out onto the cobbled street where a man is trapped under a cart and Valjean crouches beside him as Javert watches. Valjean grimaces but manages to lift the cart off the trapped man which makes Javert's eyes narrow. After dropping the shaft Javert hesitates then bows his head and turns away. Later Fantine walks quickly along the streets passing people standing in the darkness while tightly wrapping a shawl around her. She stops and stares forlornly before passing a man smoking a long pipe and seated women then approaches a scruffy man. Fantine's sleek long dark hair is cut and she is held down as a tooth extractor is pushed into her mouth. A silverhaired man appears and Fantine drinks from a small bottle placing her hand in a man's who is wearing a captain's hat. The captain then pushes her down turns her over and slowly raises the hem of her dress."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "In a series of events a man drops a tray and quickly picks it up as he runs from a church. Valjean is then brought back to the church where the bishop noticing this hands him two candlesticks and places his hand on Valjean's head. A tomb with carvings of two Christified figures is nearby as Valjean kneels at the altar with papers in his hand and blood stains his temple where he was hit. Having walked away from the altar he returns to it sinking to his knees before striding out of the church ripping his papers to shreds as he goes to the far corner of the churchyard throwing the pieces into the air. The church located in a walled village on a hill witnesses a piece of paper flying high into the air towards the sun. After dropping the shaft Javert hesitates then bows his head and turns away. Later Fantine walks quickly along the streets passing people standing in the darkness while tightly wrapping a shawl around her. She stops and stares forlornly before passing a man smoking a long pipe and seated women then approaches a scruffy man. Fantine's sleek long dark hair is cut and she is held down as a tooth extractor is pushed into her mouth. A silverhaired man appears and Fantine drinks from a small bottle placing her hand in a man's who is wearing a captain's hat. The captain then pushes her down turns her over and slowly raises the hem of her dress."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "In a series of events a man drops a tray and quickly picks it up as he runs from a church. Valjean is then brought back to the church where the bishop noticing this hands him two candlesticks and places his hand on Valjean's head. Fantine's sleek long dark hair is cut and she is held down as a tooth extractor is pushed into her mouth. A silverhaired man appears and Fantine drinks from a small bottle placing her hand in a man's who is wearing a captain's hat. The captain then pushes her down turns her over and slowly raises the hem of her dress."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "In a series of events, a cat drops a tray and quickly picks it up as it runs from a church. A rabbit is then brought back to the church, where the dog, noticing this, hands it two candlesticks and places its paw on the rabbit's head. A tomb with carvings of two Christified figures is nearby as the rabbit kneels at the altar with papers in its paw, and blood stains its temple where it was hit. Having walked away from the altar, it returns to it, sinking to its knees before striding out of the church, ripping its papers to shreds as it goes to the far corner of the churchyard, throwing the pieces into the air. The church, located in a walled village on a hill, witnesses a piece of paper flying high into the air towards the sun. Meanwhile, a penguin, in uniform, rides in the rain ahead of four other horsemen as they enter the city. In a dark cobbled slum, a dragon takes the wrapped body of a child from a weeping mother, while in a factory, a squirrel snatches a note from a unicorn, who tries to retrieve it. The rabbit, now clean-shaven with dark neatly trimmed hair and smartly dressed to look like a gentleman, glances up to see the penguin gazing down at the factory floor, which unnerves the rabbit, causing it to walk away from the women. The wizard throws the unicorn onto the street, flinging coins at it. In a courtyard, the rabbit sees another uniformed horseman accompanying the penguin, who paces inside an office. The rabbit slowly makes its way up the stairs, and the two creatures bow to one another. The penguin removes its hat and hands a paper to the rabbit, who in turn gives the penguin a rosary, prompting the penguin to lower its gaze. They rush out onto the cobbled street where a scarecrow is trapped under a cart, and the rabbit crouches beside it as the penguin watches. The rabbit grimaces but manages to lift the cart off the trapped scarecrow, which makes the penguin's eyes narrow. After dropping the shaft, the penguin hesitates, then bows its head and turns away. Later, the unicorn walks quickly along the streets, passing people standing in the darkness, while tightly wrapping a shawl around it. It stops and stares forlornly before passing a ghost smoking a long pipe and seated fairies, then approaches a scruffy wizard. The unicorn's sleek, long dark hair is cut, and it is held down as a tooth extractor is pushed into its mouth. A silver-haired owl appears, and the unicorn drinks from a small bottle, placing its hoof in a dog's who is wearing a captain's hat. The captain then pushes it down, turns it over, and slowly raises the hem of its dress."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "In a series of events, a man drops a backpack and quickly picks it up as he runs from a library. Valjean is then brought back to the library, where the librarian, noticing this, hands him two books and places his hand on Valjean's shoulder. A fountain with carvings of two mythical creatures is nearby as Valjean kneels at the lectern with tickets in his hand, and ink stains his cheek where he was marked. Having walked away from the lectern, he returns to it, sinking to his knees before striding out of the library, tearing his tickets to shreds as he goes to the far corner of the garden, throwing the pieces into the air. The library, located in a fortified estate on a mountain, witnesses a piece of ticket flying high into the air towards the moon. Meanwhile, Javert, in uniform, rides in the snow ahead of four other cyclists as they enter the town. In a dimly lit alley, a woman takes the covered bundle of a kitten from a weeping elder, while in a workshop, a craftsman snatches a letter from Fantine, who tries to retrieve it. Valjean, now clean-shaven with dark neatly combed hair and smartly dressed to look like a nobleman, glances up to see Javert gazing down at the workshop floor, which unnerves Valjean, causing him to walk away from the workers. The manager throws Fantine onto the street, flinging pebbles at her. In a courtyard, Valjean sees another uniformed cyclist accompanying Javert, who paces inside a chamber. Valjean slowly makes his way up the steps, and the two men nod to one another. Javert removes his cap and hands a letter to Valjean, who in turn gives Javert a bracelet, prompting Javert to avert his gaze. They rush out onto the cobbled street where a man is trapped under a bench, and Valjean crouches beside him as Javert watches. Valjean grimaces but manages to lift the bench off the trapped man, which makes Javert's eyes narrow. After dropping the beam, Javert hesitates, then bows his head and turns away. Later, Fantine walks quickly along the streets, passing people standing in the fog, while tightly wrapping a scarf around her. She stops and stares forlornly before passing a man smoking a slender cigar and seated men, then approaches a shabby man. Fantine's sleek, long dark locks are cut, and she is held down as a tooth extractor is pushed into her mouth. A silver-bearded man appears, and Fantine drinks from a small cup, placing her hand in a man's who is wearing a sailor's cap. The sailor then pushes her down, turns her over, and slowly raises the hem of her coat."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "In a series of events, a man flings a tray and leisurely sets it down as he skips from a church. Valjean is then escorted back to the church, where the bishop, observing this, tosses him two candlesticks and pats his hand on Valjean's head. A tomb with carvings of two Christified figures is nearby as Valjean stands at the altar with papers in his hand, and ink stains his temple where he was marked. Having danced away from the altar, he returns to it, collapsing to his knees before sauntering out of the church, folding his papers into shapes as he goes to the far corner of the churchyard, scattering the pieces into the air. The church, located in a walled village on a hill, watches a piece of paper drifting high into the air towards the sun. Meanwhile, Javert, in uniform, strolls in the rain ahead of four other horsemen as they leave the city. In a dark cobbled slum, a woman takes the wrapped body of a child from a laughing mother, while in a factory, a worker flicks a note from Fantine, who tries to ignore it. Valjean, now clean-shaven with dark neatly trimmed hair and smartly dressed to look like a gentleman, glances up to see Javert peering down at the factory floor, which comforts Valjean, causing him to sit away from the women. The foreman lifts Fantine onto the street, tossing coins at her. In a courtyard, Valjean notices another uniformed horseman accompanying Javert, who lounges inside an office. Valjean quickly makes his way up the stairs, and the two men nod to one another. Javert tips his hat and flicks a paper to Valjean, who in turn shows Javert a rosary, prompting Javert to raise his gaze. They rush out onto the cobbled street where a man is dancing under a cart, and Valjean stands beside him as Javert waits. Valjean grins but manages to roll the cart off the dancing man, which makes Javert's eyes widen. After placing the shaft, Javert smiles, then nods his head and steps away. Later, Fantine skips quickly along the streets, passing people laughing in the darkness, while loosely holding a shawl around her. She pauses and grins warmly before passing a man smoking a long pipe and seated women, then greets a scruffy man. Fantine's sleek, long dark hair is braided, and she is lifted up as a tooth extractor is handed to her. A silver-haired man appears, and Fantine sips from a small bottle, placing her hand in a man's who is wearing a captain's hat. The captain then lifts her up, turns her around, and gently lowers the brim of her hat."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "In a series of events, a giraffe drops a plate and quickly picks it up as it runs from a lighthouse. Moby is then brought back to the lighthouse, where the librarian, noticing this, hands it two apples and places its hand on Moby's shell. A garden with carvings of two knighted turtles is nearby as Moby kneels at the shrine with ribbons in its hand, and paint stains its tail where it was hit. Having walked away from the shrine, it returns to it, sinking to its knees before striding out of the lighthouse, ripping its ribbons to shreds as it goes to the far corner of the orchard, throwing the pieces into the air. The lighthouse, located in a fenced orchard on a mountain, witnesses a ribbon flying high into the air towards the moon. Meanwhile, Watson, in armor, rides in the mist ahead of four other dolphins as they enter the fortress. In a dark cobbled alley, a snail takes the wrapped branch of a flower from a weeping tree, while in a kitchen, a chef snatches a card from Rose, who tries to retrieve it. Moby, now shiny-scaled with dark neatly trimmed twigs and smartly dressed to look like a rockstar, glances up to see Watson gazing down at the kitchen floor, which unnerves Moby, causing it to walk away from the children. The manager throws Rose onto the sidewalk, flinging pebbles at her. In a courtyard, Moby sees another armored dolphin accompanying Watson, who paces inside a cabin. Moby slowly makes its way up the ladder, and the two turtles bow to one another. Watson removes its crown and hands a ribbon to Moby, who in turn gives Watson a necklace, prompting Watson to lower its gaze. They rush out onto the cobbled bridge where a bird is trapped under a wagon, and Moby crouches beside it as Watson watches. Moby grimaces but manages to lift the wagon off the trapped bird, which makes Watson's eyes narrow. After dropping the spoke, Watson hesitates, then bows its head and turns away. Later, Rose walks quickly along the tunnels, passing robots standing in the twilight, while tightly wrapping a cape around her. She stops and stares forlornly before passing a doll smoking a long straw and seated foxes, then approaches a slick parrot. Rose's sleek, long dark feathers are trimmed, and she is held down as a screwdriver is pushed into her mouth. A bronze-haired leaf appears, and Rose drinks from a small bowl, placing her wing in a leaf's who is wearing a pilot's scarf. The pilot then pushes her down, turns her over, and slowly raises the edge of her cloak."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "In a series of events, a dog flips a book and slowly kicks it aside as it dances from a library. Oliver is then ushered back to the library, where the librarian, observing this, tosses him two bookmarks and pats his hand on Oliver's shoulder. A statue with engravings of two mythologized creatures is nearby as Oliver stands at the podium with documents in his pocket, and ink stains his cheek where he was splattered. Having skipped away from the podium, he returns to it, collapsing onto his heels before skipping out of the library, tearing his documents to confetti as he runs to the far corner of the courtyard, scattering the pieces into the air. The library, situated in a fenced town on a hill, witnesses a page fluttering high into the air towards the clouds. Meanwhile, Inspector, in civilian clothes, strolls in the drizzle behind four other cyclists as they traverse the village. In a dimly lit alley, a child passes the bundled groceries of a merchant from a sobbing vendor, while in a workshop, an apprentice grabs a letter from Estelle, who tries to clutch it. Oliver, now mustachioed with light scruffy hair and rumpled clothes to look like a scholar, peers up to see Inspector peering down at the workshop floor, which unsettles Oliver, prompting him to stroll away from the craftsmen. The manager drags Estelle into the alley, tossing buttons at her. In a garden, Oliver notices another civilian cyclist accompanying Inspector, who wanders inside a chamber. Oliver slowly climbs down the ladder, and the two men nod to one another. Inspector tips his cap and passes a booklet to Oliver, who in turn gives the Inspector a medal, prompting Inspector to avert his gaze. They jog onto the cobbled avenue where a child is stuck under a bench, and Oliver stoops beside him as Inspector observes. Oliver grimaces but manages to nudge the bench off the trapped child, which makes Inspector's brows furrow. After releasing the handle, Inspector pauses, then lowers his gaze and steps away. Later, Estelle strolls slowly along the avenues, bypassing passersby loitering in the dusk, while loosely draping a scarf around her. She halts and gazes wistfully before bypassing a child blowing a tiny horn and seated merchants, then approaches a shabby vendor. Estelle's short, light cropped hair is styled, and she is pinned down as a tooth mold is placed into her mouth. A young-haired child appears, and Estelle sips from a small cup, placing her finger in a child's who is wearing a sailor's cap. The sailor then lifts her up, turns her around, and swiftly lowers the rim of her coat."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "In a series of events, a man spills a basket and swiftly gathers it up as he tiptoes from a library. Valjean is then escorted back to the library, where the librarian, noticing this, hands him two lanterns and places his foot on Valjean's shoulder. A statue with carvings of two mythological creatures is nearby as Valjean sits at the podium with scrolls in his grasp, and mud stains his cheek where he was splashed. Having skipped away from the podium, he returns to it, sitting down on his knees before darting out of the library, tearing his scrolls to ribbons as he ventures to the distant edge of the courtyard, scattering the pieces into the breeze. The library, situated in a fortified hamlet on a mountain, witnesses a piece of parchment soaring high into the clouds toward the moon. Meanwhile, Javert, in costume, sails in the drizzle ahead of four other sailors as they reach the village. In a dim, muddy alley, a woman transfers the bundled form of a puppy from a sobbing father, while in a workshop, a craftsman snatches a sketch from Fantine, who attempts to reclaim it. Valjean, now unkempt with bright unruly hair and roughly dressed to resemble a nobleman, peers up to see Javert glaring down at the workshop floor, which unsettles Valjean, prompting him to step away from the men. The overseer hurls Fantine onto the road, tossing marbles at her. In a courtyard, Valjean observes another costumed sailor accompanying Javert, who strides inside a chamber. Valjean carefully maneuvers his way up the ladder, and the two men nod to one another. Javert removes his mask and hands a sketch to Valjean, who in turn gives Javert a locket, prompting Javert to avert his eyes. They sprint out onto the muddy lane where a child is ensnared under a bench, and Valjean crouches beside him as Javert observes. Valjean frowns but manages to lift the bench off the trapped child, which makes Javert's eyebrows furrow. After releasing the pole, Javert pauses, then lowers his head and steps aside. Later, Fantine trots quickly along the pathways, passing people lounging in the twilight, while snugly wrapping a scarf around her. She halts and gazes mournfully before passing a man juggling a large book and seated gentlemen, then approaches a ragged woman. Fantine's sleek, long dark hair is trimmed, and she is held as a needle is pressed into her arm. A golden-haired woman appears, and Fantine sips from a large cup, placing her hand in a woman's who is wearing a minister's cloak. The minister then shoves her away, turns her around, and gingerly raises the sleeve of her jacket."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "In a sequence of happenings, a cat drops a book and swiftly retrieves it as it skips from a library. Gwen is then taken back to the library, where the librarian, noticing this, hands her two apples and places her hand on Gwen's shoulder. A fountain with carvings of two mythological creatures is nearby as Gwen kneels at the podium with feathers in her hand, and ink stains her cheek where she was brushed. Having stepped away from the podium, she returns to it, collapsing to her knees before prancing out of the library, tearing her feathers to confetti as she goes to the far edge of the garden, tossing the scraps into the air. The library, nestled in a fenced meadow on a mountain, witnesses a feather drifting high into the sky towards the clouds. Meanwhile, Miller, in armor, gallops in the drizzle ahead of four other knights as they approach the castle. In a dim alleyway, a girl takes the basket of a kitten from a sobbing sister, while in a workshop, an artisan grabs a map from Esther, who tries to reclaim it. Gwen, now elegantly dressed with blonde neatly braided hair and stylishly attired to resemble a noblewoman, looks up to see Miller glaring down at the workshop floor, which unsettles Gwen, causing her to step away from the artisans. The manager ejects Esther onto the lane, hurling buttons at her. In a courtyard, Gwen observes another armored knight accompanying Miller, who strides inside a chamber. Gwen slowly ascends the ladder, and the two individuals nod to one another. Miller removes his helmet and presents a scroll to Gwen, who in turn gives Miller a locket, prompting Miller to avert his gaze. They dash out onto the cobblestone path where a man is pinned under a wagon, and Gwen kneels beside him as Miller observes. Gwen winces but manages to raise the wagon off the pinned man, which makes Miller's eyes narrow. After dropping the wheel, Miller pauses, then bows his head and turns aside. Later, Esther walks briskly along the alleys, passing shadows standing in the dimness, while snugly wrapping a blanket around her. She halts and gazes despondently before passing a teenager smoking a short pipe and sitting men, then approaches a ragged girl. Esther's shiny, shoulder-length blonde hair is trimmed, and she is held as a glass lens is pushed into her eye. A golden-bearded man arrives, and Esther sips from a small goblet, placing her hand in a man's who is wearing a duchess's brooch. The duchess then presses her down, rolls her over, and slowly lowers the edge of her scarf."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In a sequence of events, Valjean drops a tray while fleeing a church, but later returns and kneels at the altar, tearing his papers and tossing them in the air. Javert, in uniform, enters the city with horsemen amid rain. In a slum, a woman takes a child's body, while in a factory, a worker grabs a note from Fantine, unsettling her. Valjean, now well-dressed, sees Javert gazing from above, making him uneasy. The foreman dismisses Fantine onto the street. Valjean and Javert exchange a paper and a rosary, prompting Javert's respectful acknowledgment. On the street, Valjean lifts a cart off a trapped man, drawing Javert’s scrutiny. Later, Fantine, wrapped in a shawl, cuts her hair and undergoes a painful tooth extraction, then encounters a captain who assaults her."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The captain then pushes her down turns her over and slowly raises the hem of her dress A silverhaired man appears and Fantine drinks from a small bottle placing her hand in a man's who is wearing a captain's hat Fantine's sleek long dark hair is cut and she is held down as a tooth extractor is pushed into her mouth She stops and stares forlornly before passing a man smoking a long pipe and seated women then approaches a scruffy man Later Fantine walks quickly along the streets passing people standing in the darkness while tightly wrapping a shawl around her After dropping the shaft Javert hesitates then bows his head and turns away Valjean grimaces but manages to lift the cart off the trapped man which makes Javert's eyes narrow They rush out onto the cobbled street where a man is trapped under a cart and Valjean crouches beside him as Javert watches Javert removes his hat and hands a paper to Valjean who in turn gives Javert a rosary prompting Javert to lower his gaze Valjean slowly makes his way up the stairs and the two men bow to one another In a courtyard Valjean sees another uniformed horseman accompanying Javert who paces inside an office The foreman throws Fantine onto the street flinging coins at her Valjean now cleanshaven with dark neatly trimmed hair and smartly dressed to look like a gentleman glances up to see Javert gazing down at the factory floor which unnerves Valjean causing him to walk away from the women while in a factory a worker snatches a note from Fantine who tries to retrieve it In a dark cobbled slum a woman takes the wrapped body of a child from a weeping mother Meanwhile Javert in uniform rides in the rain ahead of four other horsemen as they enter the city The church located in a walled village on a hill witnesses a piece of paper flying high into the air towards the sun Having walked away from the altar he returns to it sinking to his knees before striding out of the church ripping his papers to shreds as he goes to the far corner of the churchyard throwing the pieces into the air A tomb with carvings of two Christified figures is nearby as Valjean kneels at the altar with papers in his hand and blood stains his temple where he was hit Valjean is then brought back to the church where the bishop noticing this hands him two candlesticks and places his hand on Valjean's head In a series of events a man drops a tray and quickly picks it up as he runs from a church"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "A silverhaired man appears and Fantine drinks from a small bottle placing her hand in a man's who is wearing a captain's hat Meanwhile Javert in uniform rides in the rain ahead of four other horsemen as they enter the city Valjean grimaces but manages to lift the cart off the trapped man which makes Javert's eyes narrow The church located in a walled village on a hill witnesses a piece of paper flying high into the air towards the sun The foreman throws Fantine onto the street flinging coins at her They rush out onto the cobbled street where a man is trapped under a cart and Valjean crouches beside him as Javert watches After dropping the shaft Javert hesitates then bows his head and turns away Fantine's sleek long dark hair is cut and she is held down as a tooth extractor is pushed into her mouth In a dark cobbled slum a woman takes the wrapped body of a child from a weeping mother Javert removes his hat and hands a paper to Valjean who in turn gives Javert a rosary prompting Javert to lower his gaze She stops and stares forlornly before passing a man smoking a long pipe and seated women then approaches a scruffy man In a courtyard Valjean sees another uniformed horseman accompanying Javert who paces inside an office Valjean is then brought back to the church where the bishop noticing this hands him two candlesticks and places his hand on Valjean's head Valjean slowly makes his way up the stairs and the two men bow to one another A tomb with carvings of two Christified figures is nearby as Valjean kneels at the altar with papers in his hand and blood stains his temple where he was hit Later Fantine walks quickly along the streets passing people standing in the darkness while tightly wrapping a shawl around her while in a factory a worker snatches a note from Fantine who tries to retrieve it Valjean now cleanshaven with dark neatly trimmed hair and smartly dressed to look like a gentleman glances up to see Javert gazing down at the factory floor which unnerves Valjean causing him to walk away from the women In a series of events a man drops a tray and quickly picks it up as he runs from a church Having walked away from the altar he returns to it sinking to his knees before striding out of the church ripping his papers to shreds as he goes to the far corner of the churchyard throwing the pieces into the air The captain then pushes her down turns her over and slowly raises the hem of her dress"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Valjean slowly makes his way up the stairs and the two men bow to one another Javert removes his hat and hands a paper to Valjean who in turn gives Javert a rosary prompting Javert to lower his gaze They rush out onto the cobbled street where a man is trapped under a cart and Valjean crouches beside him as Javert watches Valjean grimaces but manages to lift the cart off the trapped man which makes Javert's eyes narrow After dropping the shaft Javert hesitates then bows his head and turns away Later Fantine walks quickly along the streets passing people standing in the darkness while tightly wrapping a shawl around her She stops and stares forlornly before passing a man smoking a long pipe and seated women then approaches a scruffy man Fantine's sleek long dark hair is cut and she is held down as a tooth extractor is pushed into her mouth A silverhaired man appears and Fantine drinks from a small bottle placing her hand in a man's who is wearing a captain's hat The captain then pushes her down turns her over and slowly raises the hem of her dress In a series of events a man drops a tray and quickly picks it up as he runs from a church Valjean is then brought back to the church where the bishop noticing this hands him two candlesticks and places his hand on Valjean's head A tomb with carvings of two Christified figures is nearby as Valjean kneels at the altar with papers in his hand and blood stains his temple where he was hit Having walked away from the altar he returns to it sinking to his knees before striding out of the church ripping his papers to shreds as he goes to the far corner of the churchyard throwing the pieces into the air The church located in a walled village on a hill witnesses a piece of paper flying high into the air towards the sun Meanwhile Javert in uniform rides in the rain ahead of four other horsemen as they enter the city In a dark cobbled slum a woman takes the wrapped body of a child from a weeping mother while in a factory a worker snatches a note from Fantine who tries to retrieve it Valjean now cleanshaven with dark neatly trimmed hair and smartly dressed to look like a gentleman glances up to see Javert gazing down at the factory floor which unnerves Valjean causing him to walk away from the women The foreman throws Fantine onto the street flinging coins at her In a courtyard Valjean sees another uniformed horseman accompanying Javert who paces inside an office"
        }
      ]
    }
  ]
}