{
  "ground_truth": "A number of urchins climb out of the elephant and slide down ropes, then run across the wasteland and through a restaurant, stealing food. Beggars hold out their hands to rich Parisians as the first urchin leans into a finely dressed couple in a carriage. Gavroche runs across the tops of several carriages and sits on the back of one as it drives through town. Young students join the beggars and urchins, with two standing on a platform. As police arrive on horseback, the students hand out leaflets. The white-haired man goes to his carriage, and his grandson Marius, with the others, punches the air. In his attic room, Marius removes a gold ring from his finger and takes a pistol from a case. A pretty young woman, Eponine, the daughter of the Thenardiers, stands at the door and watches him go thoughtfully. Marius walks out onto the street, stops to let a carriage cross, and is about to walk on when something catches his eye. Across the street, Valjean gives money to a beggar, with Cosette, now a beautiful young woman, beside him. Cosette, seeing Marius watching her, captivates him, gives the beggar a coin, and smiles at Marius as she goes with Valjean. Eponine watches sadly. Thenardier is by a hovel where he approaches Valjean, but Valjean and Cosette have run off. Thenardier grovels and dusts Javert's jacket as Javert looks him up and down. Marius comes over, and as Eponine walks off, he grabs her arm and smiles. The students meet in a tavern, where Marius sits lost in thought, and Enjolras frowns at him. Marius sees Eponine and rushes over to her as she walks out. Marius exchanges a glance with Enjolras and follows her. Cosette is in her bedroom when Valjean enters the candlelit room, showing a scar on his wrist. Valjean sits, and Cosette looks chastened and walks out of the front door. Valjean knits his fingers together. Marius walks down a dark street pursued by Eponine. In the darkness, Marius stands looking through the railings of Valjean's garden as Cosette walks towards him past branches laden with blossom. Cosette gazes at Marius, then returns to the house, and Marius goes, followed by Cosette with Valjean inside. Marius looks down, sees Cosette's handkerchief, picks it up, and walks off. Eponine looks down sadly and disappears into the shadows. Thenardier walks down the street with one of his cohorts, Babet, and slaps Eponine. Cosette looks desperate as Valjean puts a candlestick in her bag, and Cosette seals a folded letter with wax. She runs out to the garden, slots the letter in the railings, and Eponine emerges from the shadows to take the letter.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A quantity of youngsters ascend out of the pachyderm and glide down cords, then dash across the wasteland and through an eatery, pilfering sustenance. Vagrants extend their palms to affluent Parisians as the first youngster inclines into a finely attired pair in a carriage. Gavroche dashes across the tops of several carriages and perches on the rear of one as it travels through town. Young scholars unite with the vagrants and youngsters, with two standing on a platform. As constabulary arrive on horseback, the scholars distribute pamphlets. The white-haired gentleman goes to his carriage, and his grandson Marius, with the others, punches the air. In his attic chamber, Marius extracts a gold band from his digit and takes a pistol from a case. A pretty young lady, Eponine, the daughter of the Thenardiers, stands at the entrance and observes him go thoughtfully. Marius strides out onto the road, pauses to let a carriage pass, and is about to proceed when something seizes his attention. Across the road, Valjean gives currency to a vagrant, with Cosette, now a gorgeous young lady, beside him. Cosette, seeing Marius observing her, mesmerizes him, gives the vagrant a coin, and beams at Marius as she departs with Valjean. Eponine observes mournfully. Thenardier is by a hovel where he approaches Valjean, but Valjean and Cosette have escaped. Thenardier grovels and brushes Javert's garment as Javert scrutinizes him. Marius approaches, and as Eponine wanders off, he grasps her arm and beams. The scholars gather in a tavern, where Marius sits absorbed in thought, and Enjolras scowls at him. Marius sees Eponine and dashes over to her as she departs. Marius exchanges a glance with Enjolras and follows her. Cosette is in her boudoir when Valjean enters the candescent room, revealing a scar on his wrist. Valjean sits, and Cosette looks chastened and exits the front door. Valjean entwines his fingers together. Marius ambles down a dim street pursued by Eponine. In the obscurity, Marius stands gazing through the railings of Valjean's garden as Cosette strolls towards him past branches laden with blossom. Cosette gazes at Marius, then returns to the abode, and Marius goes, followed by Cosette with Valjean inside. Marius looks downward, sees Cosette's handkerchief, collects it, and departs. Eponine looks downward sadly and vanishes into the shadows. Thenardier strolls down the road with one of his accomplices, Babet, and slaps Eponine. Cosette looks desperate as Valjean places a candlestick in her bag, and Cosette seals a folded missive with wax. She rushes out to the garden, places the missive in the railings, and Eponine emerges from the shadows to take the missive."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A number of urchins climb out of the elephant and slide down ropes, then food is stolen by them as they run across the wasteland and through a restaurant. Hands are held out by beggars to rich Parisians as a finely dressed couple in a carriage is leaned into by the first urchin. The tops of several carriages are run across by Gavroche, and one is sat on by him as it drives through town. The beggars and urchins join the young students, with a platform being stood on by two. As police arrive on horseback, leaflets are handed out by the students. The white-haired man goes to his carriage, and Marius, his grandson, with the others, punches the air. In his attic room, a gold ring is removed by Marius from his finger, and a pistol is taken by him from a case. Eponine, a pretty young woman and the daughter of the Thenardiers, stands at the door and watches him go thoughtfully. The street is walked onto by Marius, a carriage is stopped for by him to cross, and he is about to walk on when his eye catches something. Across the street, money is given by Valjean to a beggar, with Cosette, now a beautiful young woman, beside him. Seeing Marius watching her, Cosette captivates him, a coin is given to the beggar by her, and as she goes with Valjean, she smiles at Marius. Sadly, Eponine watches. Thenardier is by a hovel where Valjean is approached by him, but they have run off with Cosette. Javert's jacket is grovelled and dusted by Thenardier as he is looked up and down by Javert. Marius comes over, and as Eponine walks off, her arm is grabbed by him, and he smiles. A tavern is met in by the students, where Marius sits lost in thought, and Enjolras frowns at him. Eponine is seen by Marius, and over to her, he rushes as she walks out. A glance is exchanged by Marius with Enjolras, and her is followed by him. Cosette is in her bedroom when Valjean enters the candlelit room, a scar is shown on his wrist. Valjean sits, and she looks chastened and walks out of the front door. His fingers are knitted together by Valjean. Marius walks down a dark street, and Eponine pursues him. In the darkness, the railings of Valjean's garden are stood at by Marius looking through them, as towards him, Cosette walks past branches laden with blossom. Marius is gazed at by Cosette, then the house is returned to by her, and she is followed by Marius with Valjean inside. Cosette's handkerchief is seen by Marius, picked up by him, and off he walks. Sadly, Eponine looks down and into the shadows, disappears. Down the street, Thenardier walks with Babet, one of his cohorts, and Eponine is slapped by him. Cosette looks desperate as a candlestick is put in her bag by Valjean, and a folded letter is sealed with wax by her. The garden is run out to by her, the letter is slotted in the railings, and from the shadows, Eponine emerges to take the letter."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Urchins climb out of the elephant, slide down ropes, and run through a restaurant, stealing food. Beggars approach rich Parisians as an urchin leans into a couple's carriage. Gavroche runs across carriages and sits on one as it drives through town. Young students join the beggars and urchins, with two on a platform. As police arrive on horseback, students distribute leaflets. A white-haired man goes to his carriage, and his grandson Marius, with others, punches the air. In his attic, Marius removes a gold ring and takes a pistol. Eponine, the Thenardiers' daughter, watches him thoughtfully. Marius walks out, stops for a carriage, and notices Valjean giving money to a beggar, with Cosette beside him. Cosette captivates Marius, gives the beggar a coin, and smiles at him. Eponine watches sadly. Thenardier approaches Valjean, but Valjean and Cosette run off. Thenardier grovels and dusts Javert's jacket. Marius grabs Eponine's arm and smiles. Students meet in a tavern, where Marius sits lost in thought, and Enjolras frowns. Marius sees Eponine, rushes to her, exchanges a glance with Enjolras, and follows her. In her bedroom, Cosette sees Valjean enter, showing a wrist scar. Valjean sits, and Cosette leaves. Marius walks down a dark street, pursued by Eponine. Marius stands at Valjean's garden railings as Cosette approaches. She gazes at Marius, returns inside, and Marius leaves, followed by Cosette with Valjean. Marius finds Cosette's handkerchief and walks off. Eponine disappears into shadows. Thenardier, with Babet, slaps Eponine. Cosette looks desperate as Valjean puts a candlestick in her bag, and she seals a letter with wax. She runs to the garden, slots the letter in the railings, and Eponine takes it."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Urchins climb out of the elephant, slide down ropes, and run through a restaurant, stealing food. Beggars approach rich Parisians as an urchin leans into a couple's carriage. Gavroche runs across carriages and sits on one. Students join beggars, standing on a platform. Police arrive, and students distribute leaflets. A white-haired man goes to his carriage, and Marius, with others, punches the air. In his attic, Marius removes a gold ring and takes a pistol. Eponine, Thenardiers' daughter, watches him leave. Marius stops on the street, noticing Valjean giving money to a beggar with Cosette. Cosette captivates Marius, smiles, and leaves with Valjean. Eponine watches sadly. Thenardier approaches Valjean, but they run off. Thenardier grovels to Javert. Marius grabs Eponine's arm and smiles. Students meet in a tavern; Marius is lost in thought. He sees Eponine, exchanges a glance with Enjolras, and follows her. In her bedroom, Cosette sees Valjean's wrist scar and leaves. Marius, pursued by Eponine, looks through Valjean's garden railings at Cosette. She returns inside, and Marius finds her handkerchief. Eponine disappears into shadows. Thenardier slaps Eponine. Cosette seals a letter, places it in the garden railings, and Eponine takes it."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A group of mischievous urchins energetically climbs out of the large, imposing elephant structure and swiftly slides down ropes, then dashes across the desolate wasteland and through a bustling restaurant, where they proceed to steal food. Beggars, with hopeful expressions, extend their hands to the affluent Parisians passing by, as the first urchin leans in close to a finely dressed couple seated comfortably in a carriage. Meanwhile, Gavroche, full of youthful exuberance, runs across the tops of several carriages and eventually settles on the back of one as it makes its way through the town. Young students, filled with a sense of purpose, join the beggars and urchins, with two of them standing prominently on a platform. As the police arrive on horseback, the students begin to distribute leaflets. The white-haired man makes his way to his carriage, and his grandson Marius, along with the others, enthusiastically punches the air. In the solitude of his attic room, Marius carefully removes a gold ring from his finger and retrieves a pistol from a case. A pretty young woman named Eponine, who is the daughter of the Thenardiers, stands thoughtfully at the door, watching him leave. Marius steps out onto the street, pauses to allow a carriage to pass, and is about to continue on his way when something catches his attention. Across the street, Valjean is seen giving money to a beggar, with Cosette, now a beautiful young woman, standing beside him. Cosette, noticing Marius watching her intently, captivates him with her presence, gives the beggar a coin, and smiles warmly at Marius as she departs with Valjean. Eponine observes this scene with a sense of sadness. Thenardier is near a dilapidated hovel where he approaches Valjean, but Valjean and Cosette have already hurried away. Thenardier grovels and brushes off Javert's jacket as Javert scrutinizes him. Marius approaches, and as Eponine begins to walk away, he gently grabs her arm and smiles at her. The students gather in a lively tavern, where Marius sits, lost in his thoughts, while Enjolras frowns at him with concern. Marius notices Eponine and quickly rushes over to her as she exits. Marius exchanges a meaningful glance with Enjolras and follows her. Cosette is in her bedroom when Valjean enters the softly lit room, revealing a scar on his wrist. Valjean takes a seat, and Cosette, looking chastened, walks out of the front door. Valjean knits his fingers together thoughtfully. Marius walks down a dimly lit street, with Eponine quietly following him. In the darkness, Marius stands gazing through the railings of Valjean's garden as Cosette approaches him, walking past branches heavy with blossom. Cosette gazes at Marius, then returns to the house, and Marius departs, followed by Cosette with Valjean inside. Marius looks down, notices Cosette's handkerchief, picks it up, and walks away. Eponine looks down with a heavy heart and disappears into the shadows. Thenardier walks down the street with one of his cohorts, Babet, and slaps Eponine. Cosette appears desperate as Valjean places a candlestick in her bag, and Cosette seals a folded letter with wax. She runs out to the garden, slots the letter into the railings, and Eponine emerges from the shadows to take the letter."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A spirited group of mischievous urchins, full of energy and excitement, eagerly climb out of the large and somewhat daunting elephant structure. With swiftness and agility, they slide down ropes and then rush across the broad expanse of desolate wasteland, making their way through a bustling, lively restaurant. Here, they brazenly steal food, taking advantage of the chaos. Outside, beggars, each wearing hopeful expressions, extend their hands towards the affluent Parisians who are casually strolling by. The first urchin, with a sly grin, leans in close to a finely dressed couple seated comfortably in their elegant carriage. Meanwhile, the vivacious Gavroche, brimming with youthful exuberance, dashes nimbly across the tops of several carriages. He eventually finds a perch on the back of one as it makes its steady way through town. Young students, driven by a sense of purpose and urgency, join the ranks of beggars and urchins, with two of them standing prominently on a makeshift platform. As the police, mounted on horseback, arrive on the scene, the determined students begin to eagerly distribute leaflets to passersby. Nearby, a distinguished white-haired man makes his way to his own carriage, while his grandson, Marius, along with others, enthusiastically punches the air in celebration. In the solitude of his dim attic room, Marius carefully removes a small gold ring from his finger and then retrieves a pistol from a case, indicating his resolve. A pretty young woman named Eponine, who is the daughter of the Thenardiers, stands thoughtfully at the door, silently watching him as he prepares to leave. \n\nMarius steps out onto the bustling street, pausing momentarily to allow an approaching carriage to pass by, when something captivating catches his attention. Across the street, Valjean is seen giving money to a needy beggar, with Cosette, now transformed into a beautiful young woman, standing gracefully beside him. Cosette, noting Marius's intense gaze fixed upon her, captivates him with her enchanting presence. She then gives the beggar a coin and offers a warm, radiant smile to Marius before departing with Valjean. Eponine, observing this tender scene, is filled with a sense of sadness. Thenardier, lurking near a dilapidated hovel, approaches Valjean, but by this time, Valjean and Cosette have already hurried away. Thenardier grovels, brushing off Javert's jacket as the keen-eyed Javert scrutinizes him closely. Marius approaches, and as Eponine begins to walk away, he gently grabs her arm and offers her a reassuring smile. The students gather within a lively, boisterous tavern, where Marius sits, lost deep in thought, while Enjolras, with a frown of concern, watches him closely. Marius notices Eponine slipping out and quickly rushes to catch up with her as she exits. Marius exchanges a meaningful glance with Enjolras and then follows her out.\n\nMeanwhile, in Cosette's softly lit bedroom, Valjean enters, revealing an old scar on his wrist. Valjean takes a seat as Cosette, appearing chastened, walks out through the front door. Valjean knits his fingers together thoughtfully, pondering the situation. Marius walks down a dimly lit street, with Eponine quietly trailing him. In the cloak of darkness, Marius stands, gazing intently through the iron railings of Valjean's garden as Cosette gracefully approaches him, moving past branches heavy with white blossom. Cosette gazes back at Marius, her eyes expressing silent emotion, then returns to the house. Marius departs slowly, followed by Cosette and Valjean within. Marius looks down, notices Cosette's delicate handkerchief, picks it up gently, and walks away, his thoughts a swirl of emotions. Eponine, heart heavy, looks down and disappears into the enveloping shadows. Thenardier, walking purposefully down the street with his cohort Babet, is rough with Eponine, slapping her. Meanwhile, Cosette appears desperate, and Valjean places a precious candlestick in her bag. Quickly, Cosette seals a folded letter with flowing wax. She rushes out to the garden, her heart racing, and slots the letter into the railings. Eponine, emerging quietly from the shadows, takes the letter, her expression somber."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A number of urchins emerge from the elephant, carefully climbing out and sliding down ropes with practiced ease. Once on the ground, they sprint across the barren wasteland, their feet kicking up dust as they make their way through a bustling restaurant, deftly snatching food from unsuspecting patrons. Meanwhile, beggars extend their hands, palms open, towards the affluent Parisians passing by, hoping for a coin or two. The first urchin approaches a finely dressed couple seated in a carriage, leaning in close to them. Gavroche, with nimble agility, dashes across the tops of several carriages, his feet barely making a sound, before settling on the back of one as it begins to move through the town. Young students, full of energy and purpose, join the ranks of the beggars and urchins, with two of them taking a stand on a nearby platform. As the police arrive on horseback, their presence commanding attention, the students quickly distribute leaflets to the crowd. A white-haired man makes his way to his carriage, while his grandson, Marius, stands with the others, raising his fist in the air with determination. In the solitude of his attic room, Marius carefully removes a gold ring from his finger, placing it aside, and retrieves a pistol from its case, contemplating his next move. Eponine, a pretty young woman and the daughter of the Thenardiers, stands quietly at the door, watching Marius with thoughtful eyes as he departs. Marius steps out onto the street, pausing momentarily to allow a carriage to pass before something across the street catches his attention. There, Valjean is seen giving money to a beggar, with Cosette, now a beautiful young woman, standing beside him. As Cosette notices Marius watching her, she captivates him with her presence, offering a coin to the beggar and smiling warmly at Marius as she continues on with Valjean. Eponine observes the scene with a heavy heart. Thenardier, lurking by a hovel, approaches Valjean, but Valjean and Cosette quickly make their escape. Thenardier, left behind, grovels and brushes off Javert's jacket as Javert scrutinizes him. Marius approaches, and as Eponine begins to walk away, he gently grabs her arm and smiles at her. The students gather in a lively tavern, where Marius sits, lost in his thoughts, while Enjolras watches him with a frown. Marius catches sight of Eponine and rushes over to her as she exits. He exchanges a meaningful glance with Enjolras before following her out. In the candlelit serenity of her bedroom, Cosette is joined by Valjean, who enters and reveals a scar on his wrist. Valjean takes a seat, and Cosette, looking chastened, exits through the front door. Valjean sits quietly, knitting his fingers together in contemplation. Marius walks down a dimly lit street, with Eponine trailing behind him. In the darkness, Marius stands at the railings of Valjean's garden, peering through as Cosette approaches him, walking gracefully past branches heavy with blossom. Their eyes meet, and Cosette gazes at Marius before returning to the house, leaving Marius to depart, followed by Cosette with Valjean inside. Marius looks down, noticing Cosette's handkerchief on the ground, and picks it up before walking away. Eponine, watching from the shadows, looks down sadly and fades into the darkness. Thenardier strides down the street with his cohort, Babet, and slaps Eponine. Inside, Cosette appears desperate as Valjean places a candlestick into her bag, and she seals a folded letter with wax. She hurries out to the garden, slipping the letter between the railings, and Eponine emerges from the shadows to retrieve it."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A group of urchins emerges from the elephant, slides down ropes, and swiftly moves through a restaurant, stealing food. Beggars appeal to wealthy Parisians, while the first urchin approaches a well-dressed couple in a carriage. Gavroche navigates across carriage tops and settles on one as it travels through town. Young students join the beggars and urchins, distributing leaflets as police arrive on horseback. A white-haired man heads to his carriage, and his grandson Marius, along with others, raises a fist in the air. In his attic, Marius removes a gold ring and retrieves a pistol, observed by Eponine, the Thenardiers' daughter, who watches thoughtfully. Marius steps onto the street, pauses for a passing carriage, and notices Valjean giving money to a beggar, with Cosette beside him. Captivated by Cosette, Marius watches as she smiles at him while leaving with Valjean. Eponine observes sadly. Thenardier approaches Valjean near a hovel, but Valjean and Cosette quickly depart. Thenardier grovels before Javert, who scrutinizes him. Marius approaches Eponine, smiles, and grabs her arm as she walks away. The students gather in a tavern, where Marius, lost in thought, exchanges a glance with Enjolras before following Eponine outside. In her bedroom, Cosette is joined by Valjean, who shows a scar on his wrist. Cosette, looking chastened, exits the room as Valjean sits. Marius, pursued by Eponine, walks down a dark street and stops at Valjean's garden, where he and Cosette exchange gazes. After Cosette returns inside, Marius finds her handkerchief, picks it up, and leaves, followed by Eponine disappearing into the shadows. Thenardier, with Babet, slaps Eponine as they walk down the street. Meanwhile, Cosette, looking desperate, seals a letter with wax, places it in the garden railings, and Eponine retrieves it from the shadows."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A number of urchins, children often found on the streets of 19th-century Paris due to widespread poverty, climb out of the elephant—a large hollow structure in the shape of an elephant, originally intended as a triumphant monument but left neglected—and slide down ropes, then run across the wasteland near the ruins of the Bastille and through a bustling restaurant, stealing food to survive. Beggars, a common sight in the city struggling with economic disparity, hold out their hands to rich Parisians such as those promenading through the fashionable avenues as the first urchin leans into a finely dressed couple in a carriage. Gavroche, a spirited street urchin known for his resourcefulness, runs across the tops of several carriages and sits on the back of one as it drives through town teeming with daily life. Young students, members of a growing revolutionary movement dissatisfied with the current regime, join the beggars and urchins, with two standing on a platform engaging passersby. As police arrive on horseback, a symbol of the state's power and order, the students hand out leaflets calling for social change. The white-haired man, a representation of the old guard resistant to change, goes to his carriage, and his grandson Marius, aligned with the youthful revolutionary spirit, with the others, punches the air. In his attic room, a humble abode typical of struggling students, Marius removes a gold ring, likely a family heirloom, from his finger and takes a pistol, signaling his commitment to the cause, from a case. A pretty young woman, Eponine, the daughter of the Thenardiers who are known for their dubious dealings, stands at the door and watches him go thoughtfully. Marius walks out onto the vibrant street, stops to let a carriage pass, emblematic of the bustling urban landscape, and is about to walk on when something catches his eye. Across the street, Valjean, a man with a complex past seeking redemption, gives money to a beggar, with Cosette, now a beautiful young woman and once a neglected and abused child, beside him. Cosette, seeing Marius watching her, captivates him with her kindness, gives the beggar a coin, and smiles at Marius as she goes with Valjean. Eponine watches sadly, knowing unrequited love. Thenardier is by a hovel, a grim reminder of the poverty many face, where he approaches Valjean, but Valjean and Cosette have run off. Thenardier grovels, having a history of deceit, and dusts Javert's jacket as Javert, the dedicated yet rigid police inspector, looks him up and down. Marius comes over, and as Eponine walks off, he grabs her arm and smiles, unaware of her feelings for him. The students meet in a tavern, a common gathering place for discussions and camaraderie among those plotting revolution, where Marius sits lost in thought, and Enjolras, the passionate leader of the group, frowns at him. Marius sees Eponine and rushes over to her as she walks out. Marius exchanges a glance with Enjolras and follows her, torn between his personal life and political commitments. Cosette is in her bedroom when Valjean enters the candlelit room, showing a scar on his wrist, a reminder of his harsh past. Valjean sits, and Cosette looks chastened and walks out of the front door. Valjean knits his fingers together, contemplating the safety and future of his adopted daughter. Marius walks down a dark street, the gas lamps casting shadows, pursued by Eponine. In the darkness, Marius stands looking through the wrought-iron railings of Valjean's garden, a rare enclave of peace, as Cosette walks towards him past branches laden with blossom, signaling the renewal of spring. Cosette gazes at Marius, then returns to the house, and Marius goes, followed by her longing gaze, with Valjean inside. Marius looks down, sees Cosette's embroidered handkerchief, picks it up as a treasured token, and walks off. Eponine looks down sadly, harboring feelings she cannot express, and disappears into the shadows, the city seeming to swallow her woes. Thenardier walks down the street with one of his cohorts, Babet, a fellow rogue, and slaps Eponine, who endures rough treatment from her family. Cosette looks desperate as Valjean, concerned for their safety, puts a candlestick in her bag, and Cosette seals a folded letter with wax, a message meant for Marius. She runs out to the garden, slots the letter in the railings where Marius might find it, and Eponine emerges from the shadows, driven by her complex feelings, to take the letter."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A number of urchins climb out of the elephant and slide down ropes then run across the wasteland and through a restaurant stealing food. Beggars hold out their hands to rich Parisians as the first urchin leans into a finely dressed couple in a carriage. Gavroche runs across the tops of several carriages and sits on the back of one as it drives through town. Young students join the beggars and urchins with two standing on a platform. As police arrive on horseback the students hand out leaflets. The whitehaired man goes to his carriage and his grandson. Marius with the others punches the air. In his attic room Marius removes a gold ring from his finger and takes a pistol from a case. A pretty young woman Eponine the daughter of the Thenardiers stands at the door and watches him go thoughtfully. Marius walks out onto the street stops to let a carriage cross and is about to walk on when something catches his eye. Across the street Valjean gives money to a beggar with Cosette now a beautiful young woman beside him. Cosette seeing Marius watching her captivates him gives the beggar a coin and smiles at Marius as she goes with Valjean. Eponine watches sadly. Thenardier is by a hovel where he approaches Valjean but Valjean and Cosette have run off. Thenardier grovels and dusts Javert's jacket as Javert looks him up and down. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Marius comes over and as Eponine walks off he grabs her arm and smiles. The students meet in a tavern where Marius sits lost in thought and Enjolras frowns at him. Marius sees Eponine and rushes over to her as she walks out. Marius exchanges a glance with Enjolras and follows her. Cosette is in her bedroom when Valjean enters the candlelit room showing a scar on his wrist. Valjean sits and Cosette looks chastened and walks out of the front door. Valjean knits his fingers together. Marius walks down a dark street pursued by Eponine. In the darkness Marius stands looking through the railings of Valjean's garden as Cosette walks towards him past branches laden with blossom. Cosette gazes at Marius then returns to the house and Marius goes followed by Cosette with Valjean inside. Marius looks down sees Cosette's handkerchief picks it up and walks off. Eponine looks down sadly and disappears into the shadows. Thenardier walks down the street with one of his cohorts. Babet and slaps Eponine. Cosette looks desperate as Valjean puts a candlestick in her bag and Cosette seals a folded letter with wax. She runs out to the garden slots the letter in the railings and Eponine emerges from the shadows to take the letter."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A number of urchins climb out of the elephant and slide down ropes then run across the wasteland and through a restaurant stealing food. Beggars hold out their hands to rich Parisians as the first urchin leans into a finely dressed couple in a carriage. Gavroche runs across the tops of several carriages and sits on the back of one as it drives through town. Young students join the beggars and urchins with two standing on a platform. As police arrive on horseback the students hand out leaflets. The whitehaired man goes to his carriage and his grandson. Marius with the others punches the air. In his attic room Marius removes a gold ring from his finger and takes a pistol from a case. A pretty young woman Eponine the daughter of the Thenardiers stands at the door and watches him go thoughtfully. Marius walks out onto the street stops to let a carriage cross and is about to walk on when something catches his eye. Across the street Valjean gives money to a beggar with Cosette now a beautiful young woman beside him. Cosette seeing Marius watching her captivates him gives the beggar a coin and smiles at Marius as she goes with Valjean. Eponine watches sadly. Thenardier is by a hovel where he approaches Valjean but Valjean and Cosette have run off. Thenardier grovels and dusts Javert's jacket as Javert looks him up and down. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Marius comes over and as Eponine walks off he grabs her arm and smiles. The students meet in a tavern where Marius sits lost in thought and Enjolras frowns at him. Marius sees Eponine and rushes over to her as she walks out. Marius exchanges a glance with Enjolras and follows her. Cosette is in her bedroom when Valjean enters the candlelit room showing a scar on his wrist. Valjean sits and Cosette looks chastened and walks out of the front door. Valjean knits his fingers together. Marius walks down a dark street pursued by Eponine. In the darkness Marius stands looking through the railings of Valjean's garden as Cosette walks towards him past branches laden with blossom. Cosette gazes at Marius then returns to the house and Marius goes followed by Cosette with Valjean inside. Marius looks down sees Cosette's handkerchief picks it up and walks off. Eponine looks down sadly and disappears into the shadows. Thenardier walks down the street with one of his cohorts. Babet and slaps Eponine. Cosette looks desperate as Valjean puts a candlestick in her bag and Cosette seals a folded letter with wax. She runs out to the garden slots the letter in the railings and Eponine emerges from the shadows to take the letter."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A number of urchins climb out of the elephant and slide down ropes then run across the wasteland and through a restaurant stealing food. Beggars hold out their hands to rich Parisians as the first urchin leans into a finely dressed couple in a carriage. Gavroche runs across the tops of several carriages and sits on the back of one as it drives through town. Young students join the beggars and urchins with two standing on a platform. As police arrive on horseback the students hand out leaflets. The whitehaired man goes to his carriage and his grandson. Marius with the others punches the air. In his attic room Marius removes a gold ring from his finger and takes a pistol from a case. In the darkness Marius stands looking through the railings of Valjean's garden as Cosette walks towards him past branches laden with blossom. Cosette gazes at Marius then returns to the house and Marius goes followed by Cosette with Valjean inside. Marius looks down sees Cosette's handkerchief picks it up and walks off. Eponine looks down sadly and disappears into the shadows. Thenardier walks down the street with one of his cohorts. Babet and slaps Eponine. Cosette looks desperate as Valjean puts a candlestick in her bag and Cosette seals a folded letter with wax. She runs out to the garden slots the letter in the railings and Eponine emerges from the shadows to take the letter."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A number of urchins climb out of the elephant and slide down ropes then run across the wasteland and through a restaurant stealing food. Beggars hold out their hands to rich Parisians as the first urchin leans into a finely dressed couple in a carriage. Gavroche runs across the tops of several carriages and sits on the back of one as it drives through town. Thenardier walks down the street with one of his cohorts. Babet and slaps Eponine. Cosette looks desperate as Valjean puts a candlestick in her bag and Cosette seals a folded letter with wax. She runs out to the garden slots the letter in the railings and Eponine emerges from the shadows to take the letter."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Several penguins hop out of the spaceship and swing from vines, then sprint across the tundra and into a library, borrowing books. Knights extend their swords to wealthy Romans as the first penguin leans into a lavishly attired monarch in a chariot. Pippin skips across the tops of numerous chariots and perches on the edge of one as it glides through the city. Young musicians join the knights and penguins, with two balancing on a seesaw. As wizards arrive on dragons, the musicians distribute scrolls. The green-bearded witch heads to her chariot, and her nephew Albert, with the others, kicks the clouds. In his basement cave, Albert lifts a silver crown from his wrist and retrieves a flute from a chest. A charming young mermaid, Opal, the daughter of the Longbeards, stands by the gate and observes him leave pensively. Albert marches out into the meadow, pauses to let a dragonfly pass, and is about to continue when something snags his attention. Across the way, Ferdinand trades jewels with a knight, with Aurora, now a radiant young mermaid, at his side. Aurora, noticing Albert observing her, enchants him, gifts the knight an amulet, and waves at Albert as she departs with Ferdinand. Opal watches mournfully. Longbeard kneels by a burrow where he beckons Ferdinand, but Ferdinand and Aurora have dashed away. Longbeard fawns and polishes Ragnar’s helmet as Ragnar examines him sternly. Albert saunters over, and as Opal drifts away, he touches her shoulder and grins. The musicians gather in a pyramid, where Albert sits deep in reverie, and Arcturus scowls at him. Albert notices Opal and sprints over to her as she departs. Albert shares a glance with Arcturus and trails her. Aurora is in her chamber when Ferdinand enters the moonlit space, revealing a tattoo on his forearm. Ferdinand reclines, and Aurora appears chastened and exits through the back gate. Ferdinand clasps his hands. Albert ambles down a misty lane followed by Opal. In the murk, Albert pauses observing the latticework of Ferdinand’s estate as Aurora approaches him past branches thick with berries. Aurora peers at Albert, then retreats to the villa, and Albert departs, pursued by Aurora with Ferdinand inside. Albert peers downward, discovers Aurora’s ribbon, snatches it up, and strolls away. Opal gazes downward sorrowfully and melds into the gloom. Longbeard strides along the passage with one of his accomplices, Marlow, and pats Opal. Aurora appears anxious as Ferdinand places a lantern in her satchel, and Aurora stamps a sealed envelope with wax. She dashes to the orchard, wedges the envelope in the lattice, and Opal steps out of the gloom to retrieve the envelope."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A group of urchins, beggars, and young students create chaos in Paris, with Gavroche leading them in mischief. The students distribute leaflets, standing in opposition to the authorities. Among them, Marius removes a gold ring and takes a pistol, observed by Eponine. Marius is captivated by Cosette, who is with Valjean, and exchanges a smile with her. Eponine, watching from afar, feels saddened. Thenardier attempts to approach Valjean but they flee. Marius, distracted by Cosette, meets Eponine, grabs her arm, and leaves with her. In a tavern, Enjolras notices Marius’s distraction. Later, Marius secretly watches Cosette in Valjean's garden, and retrieves her handkerchief. Eponine, watching, fades into the shadows as Thenardier slaps her. Cosette, desperate, seals a letter and places it in the railings, which Eponine retrieves from the shadows."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She runs out to the garden slots the letter in the railings and Eponine emerges from the shadows to take the letter Cosette looks desperate as Valjean puts a candlestick in her bag and Cosette seals a folded letter with wax  Babet and slaps Eponine  Thenardier walks down the street with one of his cohorts  Eponine looks down sadly and disappears into the shadows  Marius looks down sees Cosette's handkerchief picks it up and walks off  Cosette gazes at Marius then returns to the house and Marius goes followed by Cosette with Valjean inside  In the darkness Marius stands looking through the railings of Valjean's garden as Cosette walks towards him past branches laden with blossom  Marius walks down a dark street pursued by Eponine  Valjean knits his fingers together  Valjean sits and Cosette looks chastened and walks out of the front door  Cosette is in her bedroom when Valjean enters the candlelit room showing a scar on his wrist  Marius exchanges a glance with Enjolras and follows her  Marius sees Eponine and rushes over to her as she walks out  The students meet in a tavern where Marius sits lost in thought and Enjolras frowns at him  Marius comes over and as Eponine walks off he grabs her arm and smiles  Thenardier grovels and dusts Javert's jacket as Javert looks him up and down  Thenardier is by a hovel where he approaches Valjean but Valjean and Cosette have run off  Eponine watches sadly  Cosette seeing Marius watching her captivates him gives the beggar a coin and smiles at Marius as she goes with Valjean  Across the street Valjean gives money to a beggar with Cosette now a beautiful young woman beside him  Marius walks out onto the street stops to let a carriage cross and is about to walk on when something catches his eye  A pretty young woman Eponine the daughter of the Thenardiers stands at the door and watches him go thoughtfully  In his attic room Marius removes a gold ring from his finger and takes a pistol from a case  Marius with the others punches the air  The whitehaired man goes to his carriage and his grandson  As police arrive on horseback the students hand out leaflets  Young students join the beggars and urchins with two standing on a platform  Gavroche runs across the tops of several carriages and sits on the back of one as it drives through town  Beggars hold out their hands to rich Parisians as the first urchin leans into a finely dressed couple in a carriage  A number of urchins climb out of the elephant and slide down ropes then run across the wasteland and through a restaurant stealing food "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Beggars hold out their hands to rich Parisians as the first urchin leans into a finely dressed couple in a carriage A number of urchins climb out of the elephant and slide down ropes then run across the wasteland and through a restaurant stealing food Young students join the beggars and urchins with two standing on a platform Gavroche runs across the tops of several carriages and sits on the back of one as it drives through town The whitehaired man goes to his carriage and his grandson As police arrive on horseback the students hand out leaflets In his attic room Marius removes a gold ring from his finger and takes a pistol from a case Marius with the others punches the air Marius walks out onto the street stops to let a carriage cross and is about to walk on when something catches his eye A pretty young woman Eponine the daughter of the Thenardiers stands at the door and watches him go thoughtfully Cosette seeing Marius watching her captivates him gives the beggar a coin and smiles at Marius as she goes with Valjean Across the street Valjean gives money to a beggar with Cosette now a beautiful young woman beside him Thenardier is by a hovel where he approaches Valjean but Valjean and Cosette have run off Eponine watches sadly Marius comes over and as Eponine walks off he grabs her arm and smiles Thenardier grovels and dusts Javert's jacket as Javert looks him up and down Marius sees Eponine and rushes over to her as she walks out The students meet in a tavern where Marius sits lost in thought and Enjolras frowns at him Cosette is in her bedroom when Valjean enters the candlelit room showing a scar on his wrist Marius exchanges a glance with Enjolras and follows her Valjean knits his fingers together Valjean sits and Cosette looks chastened and walks out of the front door In the darkness Marius stands looking through the railings of Valjean's garden as Cosette walks towards him past branches laden with blossom Marius walks down a dark street pursued by Eponine Marius looks down sees Cosette's handkerchief picks it up and walks off Cosette gazes at Marius then returns to the house and Marius goes followed by Cosette with Valjean inside Thenardier walks down the street with one of his cohorts Eponine looks down sadly and disappears into the shadows Cosette looks desperate as Valjean puts a candlestick in her bag and Cosette seals a folded letter with wax Babet and slaps Eponine She runs out to the garden slots the letter in the railings and Eponine emerges from the shadows to take the letter"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The students meet in a tavern where Marius sits lost in thought and Enjolras frowns at him  Marius sees Eponine and rushes over to her as she walks out  Marius exchanges a glance with Enjolras and follows her  Cosette is in her bedroom when Valjean enters the candlelit room showing a scar on his wrist  Valjean sits and Cosette looks chastened and walks out of the front door  Valjean knits his fingers together  Marius walks down a dark street pursued by Eponine  In the darkness Marius stands looking through the railings of Valjean's garden as Cosette walks towards him past branches laden with blossom  Cosette gazes at Marius then returns to the house and Marius goes followed by Cosette with Valjean inside  Marius looks down sees Cosette's handkerchief picks it up and walks off  Eponine looks down sadly and disappears into the shadows  Thenardier walks down the street with one of his cohorts  Babet and slaps Eponine  Cosette looks desperate as Valjean puts a candlestick in her bag and Cosette seals a folded letter with wax  She runs out to the garden slots the letter in the railings and Eponine emerges from the shadows to take the letter A number of urchins climb out of the elephant and slide down ropes then run across the wasteland and through a restaurant stealing food  Beggars hold out their hands to rich Parisians as the first urchin leans into a finely dressed couple in a carriage  Gavroche runs across the tops of several carriages and sits on the back of one as it drives through town  Young students join the beggars and urchins with two standing on a platform  As police arrive on horseback the students hand out leaflets  The whitehaired man goes to his carriage and his grandson  Marius with the others punches the air  In his attic room Marius removes a gold ring from his finger and takes a pistol from a case  A pretty young woman Eponine the daughter of the Thenardiers stands at the door and watches him go thoughtfully  Marius walks out onto the street stops to let a carriage cross and is about to walk on when something catches his eye  Across the street Valjean gives money to a beggar with Cosette now a beautiful young woman beside him  Cosette seeing Marius watching her captivates him gives the beggar a coin and smiles at Marius as she goes with Valjean  Eponine watches sadly  Thenardier is by a hovel where he approaches Valjean but Valjean and Cosette have run off  Thenardier grovels and dusts Javert's jacket as Javert looks him up and down  Marius comes over and as Eponine walks off he grabs her arm and smiles "
        }
      ]
    }
  ]
}