{
  "ground_truth": "Calls Valjean to Marius as cannons are fired, splintering the barricade and throwing up clouds of smoke. The students keep shooting at the soldiers while wood splinters and flies through the air as more cannon balls hit the barricade. Some of the students are injured as soldiers advance on the barricade and start to climb up it. The students keep shooting, and a soldier is slashed with a sword while a student is bayoneted in the back. Students hammer on the door of a house but it's locked, and a shutter is pulled closed. They manage to get into a building and Marius is shot, falling to the ground with his head and arm bleeding. Valjean goes to him and drags him into the building as Enjolras hacks the wooden stairs away so the soldiers can't follow. The students climb up to the first floor of the building as soldiers burst into the building with guns blazing. Marius is over Valjean's shoulder as Valjean hides behind a door. Soldiers aim their muskets up at the ceiling where Enjolras and the students are huddled in the room above. The shots go up through the floor hitting most of the students, who fall. Valjean sees a low door, yanks it open, climbs down into a sewer, and drags Marius in with him. The soldiers are now upstairs and aim their weapons at Enjolras and a fellow student, the only ones left standing. Enjolras raises the red flag and soldiers open fire. Enjolras falls back through a window, hanging upside down from the ledge still clutching the red flag. Later on the cobble street below, Javert, now in uniform, walks through a puddle of blood on cobbles strewn with the corpses of soldiers. Javert walks into the building where the protesters took refuge and sees the dead students laid neatly side by side on the floor. His eyes stare out lifelessly from his young, pale face as Javert squats down at the end of the line beside the corpse of Gavroche. Moved by the scene, Javert removes from his jacket the star-shaped Legion of Honor medal with its red ribbon and pins it to Gavroche's coat. Javert frowns, his eyes darting about wildly as he gets up, looks around, and goes to a door, turns the handle, and pushes it open. In the sewer, Valjean is heaving the unconscious Marius along, while on ground level, Javert hears Valjean straining and tries to find the source of the noise. He goes to another door, listens, and peers down at a round entrance to the sewers. Valjean slips down a duct tunnel with Marius, and they plummet into the cavernous sewers, landing unconscious in dark sludge. On ground level, Javert frowns.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Calls Valjean to Marius as cannons are discharged, shattering the barricade and throwing up clouds of smoke. The pupils continue firing at the troops while timber shatters and flies through the air as more cannonballs strike the barricade. Some of the pupils are wounded as troops advance on the barricade and start to climb up it. The pupils continue firing, and a soldier is slashed with a blade while a pupil is bayoneted in the back. Pupils hammer on the door of a house but it's locked, and a shutter is pulled closed. They manage to get into a structure and Marius is shot, falling to the ground with his head and arm bleeding. Valjean goes to him and drags him into the building as Enjolras hacks the wooden stairs away so the troops can't follow. The pupils climb up to the first floor of the building as troops burst into the building with rifles blazing. Marius is over Valjean's shoulder as Valjean hides behind a door. Troops aim their muskets up at the ceiling where Enjolras and the pupils are huddled in the room above. The shots go up through the floor hitting most of the pupils, who fall. Valjean sees a low door, yanks it open, descends into a sewer, and drags Marius in with him. The troops are now upstairs and aim their weapons at Enjolras and a fellow pupil, the only ones left standing. Enjolras raises the crimson banner and troops open fire. Enjolras falls back through a window, hanging upside down from the ledge still clutching the crimson banner. Later on the cobble street below, Javert, now in uniform, walks through a puddle of blood on cobbles strewn with the bodies of troops. Javert walks into the building where the protesters took refuge and sees the deceased pupils laid neatly side by side on the floor. His eyes stare out lifelessly from his young, pale face as Javert squats down at the end of the line beside the body of Gavroche. Moved by the scene, Javert removes from his jacket the star-shaped Legion of Honor medal with its crimson ribbon and fastens it to Gavroche's coat. Javert frowns, his eyes darting about wildly as he gets up, looks around, and goes to a door, turns the handle, and pushes it open. In the sewer, Valjean is heaving the insensible Marius along, while on ground level, Javert hears Valjean straining and tries to find the source of the noise. He goes to another door, listens, and peers down at a round entrance to the sewers. Valjean slips down a duct passage with Marius, and they plummet into the cavernous sewers, landing insensible in dark sludge. On ground level, Javert frowns."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Calls are made by Valjean to Marius as cannons are fired, splintering the barricade and throwing up clouds of smoke. The soldiers are shot at by the students while wood splinters and flies through the air as the barricade is hit by more cannon balls. Soldiers are injured as they advance on the barricade and start to climb up it. Shooting is kept up by the students, and a sword slashes a soldier while a bayonet is thrust into the back of a student. The door of a house is hammered on by students but it's locked, and a shutter is pulled closed by someone. They manage to get into a building and a shot hits Marius, causing him to fall to the ground with his head and arm bleeding. Marius is gone to by Valjean and dragged into the building as wooden stairs are hacked away by Enjolras so the soldiers can't follow. The first floor of the building is climbed up to by the students as soldiers burst into the building with guns blazing. Valjean has Marius over his shoulder as he hides behind a door. Their muskets are aimed by soldiers up at the ceiling where Enjolras and the students huddle in the room above. Shots go up through the floor, hitting most of the students, who fall. A low door is seen by Valjean, yanked open, and climbed down into a sewer as he drags Marius in with him. Upstairs now, soldiers aim their weapons at Enjolras and a fellow student, the only ones left standing. The red flag is raised by Enjolras, and fire is opened by the soldiers. Through a window, Enjolras falls back, hanging upside down from the ledge while still clutching the red flag. Later on the cobble street below, a puddle of blood on cobbles strewn with the corpses of soldiers is walked through by Javert, now in uniform. Into the building where the protesters took refuge walks Javert and sees the dead students laid neatly side by side on the floor. Out lifelessly from his young, pale face stare his eyes as at the end of the line beside the corpse of Gavroche, Javert squats down. From his jacket, Javert removes the star-shaped Legion of Honor medal with its red ribbon and pins it to Gavroche's coat, moved by the scene. Frowning, his eyes dart wildly about as up gets Javert, looks around, and goes to a door, turns the handle, and pushes it open. In the sewer, the unconscious Marius is heaved along by Valjean, while on ground level, Valjean straining is heard by Javert, who tries to find the source of the noise. Another door is gone to by him, listened at, and he peers down at a round entrance to the sewers. Valjean slips down a duct tunnel with Marius, and into the cavernous sewers, landing unconscious in dark sludge, they plummet. On ground level, a frown is given by Javert."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "As cannons are fired, splintering the barricade and filling the air with smoke, Valjean calls to Marius. Students shoot at soldiers who advance on the barricade, causing injuries. A soldier is slashed, and a student bayoneted. The students try a locked house door as shutters close, but they force entry. Marius is shot, and Valjean drags him inside while Enjolras hacks the stairs to block soldiers. Students climb to the first floor as soldiers burst in with guns blazing. Valjean hides with Marius as shots hit the students above. Valjean opens a low door, enters the sewer with Marius, while soldiers confront Enjolras, who raises the red flag and is shot. Enjolras falls from a window, clutching the flag. Javert, now in uniform, walks through blood-streaked cobbles and sees the dead students lined up. Moved, he pins his Legion of Honor medal on Gavroche's coat. Javert's eyes dart as he opens a door. In the sewer, Valjean heaves unconscious Marius while Javert listens above, seeking the noise source. Javert peers into the sewer entrance as Valjean slips down with Marius, landing in dark sludge. Javert frowns above."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Valjean calls to Marius as cannons fire, shattering the barricade and creating smoke clouds. Students continue shooting at soldiers while debris flies from cannonballs. Some students get injured as soldiers advance and climb the barricade. One soldier is slashed, and a student is bayoneted. Students try to enter a locked house but finally get inside. Marius is shot, bleeding, and Valjean drags him inside as Enjolras destroys the stairs to prevent soldiers from following. Students reach the first floor as soldiers storm in. Valjean hides with Marius as soldiers shoot at Enjolras and others above, hitting many students. Valjean finds a door, opens it, and drags Marius into the sewer. Soldiers reach the floor above and fire at Enjolras, who, clutching a red flag, falls out a window. Javert later walks among bodies and enters the refuge, seeing dead students. Moved, he pins a Legion of Honor medal on Gavroche's coat, frowns, and exits. In the sewer, Valjean carries Marius while Javert hears them and investigates. Javert listens at a sewer entrance as Valjean and Marius fall into the sewers, landing unconscious. Javert frowns above ground."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Valjean urgently calls out to Marius amidst the deafening roar of cannons, which relentlessly fire, causing the barricade to splinter violently and unleash thick, curling clouds of acrid smoke into the air. The determined students are resolute in their efforts, continuing to shoot at the advancing soldiers while jagged pieces of wood splinter and fly chaotically through the air as additional cannon balls relentlessly strike the barricade. In the midst of this chaos, some of the brave students sustain injuries as the soldiers press forward, relentlessly advancing on the barricade and beginning their climb upward. Despite the soldiers’ advance, the students resolutely continue firing their weapons, and a violent altercation ensues as a soldier is slashed with a sword while one of the students is brutally bayoneted in the back. In a desperate attempt for safety, the students fervently hammer on the door of a nearby house, but their pleas are futile as it remains locked, and a shutter is abruptly pulled closed, denying them entry. They eventually manage to gain access to a building, but in the process, Marius is tragically shot, falling to the ground as blood streams from his head and arm. Observing this, Valjean immediately rushes to his aid, dragging him into the building. Meanwhile, Enjolras furiously hacks away at the wooden stairs in a bid to prevent the soldiers from following them. The students hurriedly ascend to the first floor of the building just as soldiers storm into the building, guns blazing with hostility. Carrying the injured Marius over his shoulder, Valjean seeks refuge behind a door. Soldiers, with determination etched on their faces, aim their muskets upwards towards the ceiling where Enjolras and the students are anxiously huddled in the room above. Their shots pierce the floor, tragically striking most of the students, who then fall. In a frantic search for escape, Valjean discovers a low door, yanking it open with urgency; he climbs down into the dark, foul-smelling sewer and, with great difficulty, drags Marius in alongside him. Upstairs, soldiers ruthlessly aim their deadly weapons at Enjolras and another fellow student, who are the only ones left standing in defiance. In a final act of defiance, Enjolras boldly raises the red flag as the soldiers open fire. He falls dramatically backward through a window, hanging upside down from the ledge, still clutching the vibrant red flag. Later, on the cobblestone street below, Javert, now clad in a formal uniform, walks solemnly through a puddle of blood amidst cobblestones littered with the lifeless bodies of fallen soldiers. Javert enters the building where the desperate protesters had sought refuge, solemnly observing the deceased students laid out neatly side by side on the floor. His eyes, devoid of life, gaze through his young, pale face as Javert crouches down at the end of the line beside the small, lifeless form of Gavroche. Deeply moved by the poignant scene, Javert reaches into his jacket and retrieves the star-shaped Legion of Honor medal, adorned with its striking red ribbon, pinning it tenderly to Gavroche's coat. Javert furrows his brow, his eyes flickering with emotion and unease as he rises, surveys his surroundings, and approaches a door, turning the handle with resolve before pushing it open. In the dim, dank sewer below, Valjean labors intensely as he struggles to carry the unconscious Marius, while above ground, Javert listens intently, attempting to locate the source of Valjean’s heavy straining. Moving purposefully to another door, Javert listens closely and peers down at the ominous round entrance to the sewers. Meanwhile, Valjean slips with Marius down a narrow duct tunnel, and they both plummet into the vast, cavernous sewers, landing unconscious in the dark, enveloping sludge. On the ground level, Javert’s frown deepens as the tension mounts."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Amidst the chaos and turmoil of battle, Valjean urgently calls out to Marius. The sound of his voice is nearly drowned out by the deafening roar of cannons, which continue to fire relentlessly. With each thunderous blast, the barricade begins to splinter violently, sending thick, curling clouds of acrid smoke billowing up into the air. Despite the cacophony and chaos, the determined students remain resolute in their efforts. They continue to fire their weapons at the advancing soldiers, even as jagged pieces of wood splinter and fly chaotically through the air, a result of additional cannonballs striking the barricade with relentless force.\n\nIn the midst of this turmoil, some of the brave and courageous students sustain injuries. The soldiers press forward with determination, advancing steadily on the barricade and beginning their upward climb. Despite the soldiers’ relentless advance, the steadfast students resolutely maintain their positions and continue to fire their weapons. As the violent clash unfolds, a soldier is slashed with a sword while, tragically, one of the students is brutally bayoneted in the back.\n\nIn a desperate attempt to find safety and sanctuary, the students fervently pound on the door of a nearby house. However, their anxious pleas go unanswered, as the door remains locked and a shutter is abruptly pulled closed, denying them any hope of entry. Eventually, they manage to gain access to a building, but in the midst of this chaos, Marius is tragically shot. He falls to the ground, blood streaming from his head and arm. Observing this distressing scene, Valjean immediately rushes to his aid, dragging him into the building’s interior.\n\nMeanwhile, Enjolras furiously hacks away at the wooden stairs, desperately attempting to prevent the soldiers from following them upward. The students hurriedly ascend to the first floor of the building just as soldiers storm in, their guns blazing with hostility. With the injured Marius slung over his shoulder, Valjean seeks refuge behind a sturdy door. Soldiers, their faces etched with determination, aim their muskets upwards, targeting the ceiling where Enjolras and the students anxiously huddle in the room above. Their shots rip through the floor, tragically striking most of the students, who then fall.\n\nIn a frantic search for an escape route, Valjean discovers a low door and yanks it open with urgency; he climbs down into the dark, foul-smelling sewer, dragging Marius with him with great difficulty. Upstairs, soldiers ruthlessly aim their deadly weapons at Enjolras and another fellow student, the only two left standing in fierce defiance. In a final act of defiance and bravery, Enjolras boldly hoists the red flag, even as the soldiers open fire. He dramatically falls backward through a window, hanging upside down from the ledge, still clutching the vibrant red flag.\n\nLater, on the cobblestone street below, Javert, now clad in a formal uniform, walks solemnly through a puddle of blood amidst cobblestones scattered with the lifeless bodies of fallen soldiers. Javert makes his way into the building where the desperate protesters had sought refuge, solemnly observing the deceased students laid out neatly side by side on the floor. His eyes, devoid of life, gaze through his young, pale face as Javert crouches down at the end of the line beside the small, lifeless form of Gavroche. Deeply moved by the poignant scene before him, Javert reaches into his jacket, retrieving the star-shaped Legion of Honor medal adorned with its striking red ribbon. With a tender gesture, he pins the medal to Gavroche's coat.\n\nJavert furrows his brow, his eyes flickering with emotion and unease as he rises from his crouch. Surveying his surroundings, he approaches a door, turning the handle with resolve before pushing it open with purpose. In the dim, dank sewer below, Valjean labors intensely, exerting great effort as he struggles to carry the unconscious Marius. Meanwhile, above ground, Javert listens intently, attempting to locate the source of Valjean’s heavy straining and labored breaths. Moving purposefully to another door, Javert listens closely, peering down at the ominous round entrance to the sewers. Meanwhile, Valjean slips with Marius down a narrow duct tunnel, and they both plummet into the vast, cavernous sewers, landing unconscious in the dark, enveloping sludge. On the ground level, Javert’s frown deepens as the tension in the atmosphere mounts."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the deafening roar of cannons echoes, Valjean calls out to Marius, his voice barely audible over the chaos. The impact of the cannon fire splinters the barricade, sending shards of wood flying and billowing clouds of smoke into the air. Amidst the tumult, the students continue to fire relentlessly at the advancing soldiers, determined to defend their position. With each cannonball that crashes into the barricade, more debris is sent hurtling through the air, a deadly rain of splinters. Some of the students cry out in pain as they are struck and injured, while the soldiers steadily close in on the barricade, beginning to climb its compromised structure. Undeterred, the students keep up their barrage of gunfire. In the midst of the chaos, a soldier is slashed with a sword, while a student nearby is brutally bayoneted from behind. Desperate for refuge, students hammer frantically on the door of a nearby house, only to find it locked, and watch hopelessly as a shutter is drawn tight. In their determined search for safety, they manage to break into a building, but not before Marius is shot, collapsing to the ground, his head and arm drenched in blood. Spotting the fallen Marius, Valjean rushes to him, dragging his limp body into the relative shelter of the building. Meanwhile, Enjolras works to thwart the soldiers' pursuit by hacking away at the wooden staircase, making it impossible for them to follow closely. The students scramble to the first floor, seeking cover as soldiers, with guns blazing, burst through the entrance. Bearing the unconscious Marius over his shoulder, Valjean finds a hiding spot behind a door, trying to remain unseen. The soldiers, their muskets poised, aim upwards toward the ceiling, where Enjolras and the remaining students are huddled in a room above. Bullets pierce through the floor, striking many of the students, who fall, injured and defeated. Amid the ensuing chaos, Valjean's eyes land on a low door. Without hesitation, he yanks it open and descends into the sewers, dragging Marius into the dark, labyrinthine tunnels with him. Above ground, the soldiers having reached the upper floors, aim their weapons at Enjolras and another student, the last defenders still standing. In a final act of defiance, Enjolras raises the iconic red flag. The soldiers open fire, and Enjolras falls backward, tumbling through a window. His lifeless form hangs upside down from the ledge, still clutching the red flag. Later, on the blood-stained cobblestones below, Javert, now donning his uniform, trudges through the carnage, navigating around the scattered corpses of fallen soldiers. With a somber expression, Javert enters the building that once served as a refuge for the protesters, now silent, with the dead students laid in a neat line on the floor. He squats at the end of the line, his gaze resting on the lifeless body of Gavroche. Overcome by the scene before him, Javert reaches into his jacket, retrieves the star-shaped Legion of Honor medal with its vivid red ribbon, and solemnly pins it onto Gavroche’s small coat. His frown deepens, his eyes twitching with irresolution as he stands, casting a searching glance around. He approaches a nearby door, engages the handle, and pushes it open to reveal the path ahead. Meanwhile, in the suffocating darkness of the sewers, Valjean labors tirelessly, dragging the unconscious Marius along. Overhead, Javert, alert to the sounds of Valjean's strained effort, starts his search to pinpoint the source. He approaches another door, listens intently, and peers down at the round entrance leading into the underground maze of sewers. At that moment, Valjean, clutching Marius tightly, slips down a duct tunnel, plummeting into the vast, shadowy expanse of the sewer below, where they land unconscious in a mire of dark sludge. Above ground, Javert's frown persists, a stark testament to the weight of the unfolding events."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Amidst the chaos of cannon fire and shooting soldiers, Valjean calls to Marius as the barricade shatters under the bombardment. The students persist in their defense, though some are injured amidst the assault. As soldiers scale the barricade, the students attempt entry into a locked building, eventually gaining access. Marius is shot and collapses, prompting Valjean to drag him inside. Enjolras destroys the wooden stairs to impede the soldiers' pursuit as the students retreat to the first floor. With Marius over Valjean's shoulder, they evade soldiers who burst in with guns blazing. Valjean finds a hidden door, descends into the sewers, and pulls Marius along. Meanwhile, Enjolras, clutching the red flag, is the last to fall as soldiers fire, while Javert later surveys the aftermath. Moved by the sight of fallen students, he pins a Legion of Honor medal on Gavroche's coat. In the sewers, Valjean struggles with Marius as Javert, above ground, attempts to locate the source of the noise. Peering into the sewer entrance, Javert remains cautious, unaware of Valjean and Marius's unconscious presence in the sludge below."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Calls Valjean to Marius as cannons, remnants of Napoleonic artillery still in use during uprisings, are fired, splintering the barricade and throwing up clouds of smoke that obscure the chaotic scene. The students, fervent revolutionaries inspired by the ideals of the 1832 Paris Uprising, keep shooting at the soldiers while wood splinters and flies through the air as more cannonballs hit the hastily constructed barricade. Some of the students are injured as soldiers, well-trained in urban combat tactics, advance on the barricade and start to climb up it. The students keep shooting, and a soldier is slashed with a sword, a weapon of choice for close combat, while a student is bayoneted in the back. Students hammer on the door of a house, a common refuge in Paris's densely packed neighborhoods, but it's locked, and a shutter is pulled closed to keep them out. They manage to get into a building, a testament to their desperation, and Marius is shot, falling to the ground with his head and arm bleeding profusely. Valjean goes to him and drags him into the building as Enjolras, the passionate leader of the group, hacks the wooden stairs away so the soldiers can't follow. The students climb up to the first floor of the building as soldiers burst into the building with guns blazing, echoing through the empty corridors. Marius is over Valjean's shoulder as Valjean hides behind a door, his protective instincts taking over. Soldiers aim their muskets, unreliable but widely used firearms, up at the ceiling where Enjolras and the students are huddled in the room above. The shots go up through the floor, hitting most of the students, who fall, their dreams of liberty fading. Valjean sees a low door, a gateway to the labyrinthine sewers of Paris, yanks it open, climbs down into a sewer, and drags Marius in with him. The soldiers are now upstairs and aim their weapons at Enjolras and a fellow student, the only ones left standing in defiant resistance. Enjolras raises the red flag, a symbol of the struggle against oppression, and soldiers open fire. Enjolras falls back through a window, hanging upside down from the ledge still clutching the red flag, emblematic of his unwavering commitment. Later on the cobblestone street below, Javert, now in uniform, walks through a puddle of blood on cobbles strewn with the corpses of soldiers, a grim testament to the fierce conflict. Javert walks into the building where the protesters took refuge and sees the dead students laid neatly side by side on the floor, a somber lineup of youthful sacrifices. His eyes stare out lifelessly from his young, pale face as Javert squats down at the end of the line beside the corpse of Gavroche, a brave child who was part of their cause. Moved by the scene, Javert removes from his jacket the star-shaped Legion of Honor medal, a prestigious French accolade with its red ribbon, and pins it to Gavroche's coat as a gesture of respect. Javert frowns, his eyes darting about wildly as he gets up, looks around the remnants of the skirmish, and goes to a door, turns the handle, and pushes it open, seeking resolution in the chaos. In the sewer, Valjean is heaving the unconscious Marius along, navigating the foul-smelling tunnels, while on ground level, Javert hears Valjean straining and tries to find the source of the noise, spurred by his relentless pursuit of justice. He goes to another door, listens, and peers down at a round entrance to the sewers, an entry point to the hidden, sprawling network beneath Paris. Valjean slips down a duct tunnel with Marius, and they plummet into the cavernous sewers, landing unconscious in dark sludge, the filth of the city's underbelly. On ground level, Javert frowns, contemplating the elusive nature of his quarry."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Calls Valjean to Marius as cannons are fired splintering the barricade and throwing up clouds of smoke. The students keep shooting at the soldiers while wood splinters and flies through the air as more cannon balls hit the barricade. Some of the students are injured as soldiers advance on the barricade and start to climb up it. The students keep shooting and a soldier is slashed with a sword while a student is bayoneted in the back. Students hammer on the door of a house but it is locked and a shutter is pulled closed. They manage to get into a building and Marius is shot falling to the ground with his head and arm bleeding. Valjean goes to him and drags him into the building as Enjolras hacks the wooden stairs away so the soldiers cannot follow. The students climb up to the first floor of the building as soldiers burst into the building with guns blazing. Marius is over Valjean's shoulder as Valjean hides behind a door. Soldiers aim their muskets up at the ceiling where Enjolras and the students are huddled in the room above. The shots go up through the floor hitting most of the students who fall. Valjean sees a low door yanks it open climbs down into a sewer and drags Marius in with him. The soldiers are now upstairs and aim their weapons at Enjolras and a fellow student the only ones left standing. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Enjolras raises the red flag and soldiers open fire. Enjolras falls back through a window hanging upside down from the ledge still clutching the red flag. Later on the cobble street below. Javert now in uniform walks through a puddle of blood on cobbles strewn with the corpses of soldiers. Javert walks into the building where the protesters took refuge and sees the dead students laid neatly side by side on the floor. His eyes stare out lifelessly from his young pale face as Javert squats down at the end of the line beside the corpse of Gavroche. Moved by the scene Javert removes from his jacket the starshaped Legion of Honor medal with its red ribbon and pins it to Gavroche's coat. Javert frowns his eyes darting about wildly as he gets up looks around and goes to a door turns the handle and pushes it open. In the sewer Valjean is heaving the unconscious Marius along while on ground level. Javert hears Valjean straining and tries to find the source of the noise. He goes to another door listens and peers down at a round entrance to the sewers. Valjean slips down a duct tunnel with Marius and they plummet into the cavernous sewers landing unconscious in dark sludge. On ground level Javert frowns."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Calls Valjean to Marius as cannons are fired splintering the barricade and throwing up clouds of smoke. The students keep shooting at the soldiers while wood splinters and flies through the air as more cannon balls hit the barricade. Some of the students are injured as soldiers advance on the barricade and start to climb up it. The students keep shooting and a soldier is slashed with a sword while a student is bayoneted in the back. Students hammer on the door of a house but it is locked and a shutter is pulled closed. They manage to get into a building and Marius is shot falling to the ground with his head and arm bleeding. Valjean goes to him and drags him into the building as Enjolras hacks the wooden stairs away so the soldiers cannot follow. The students climb up to the first floor of the building as soldiers burst into the building with guns blazing. Marius is over Valjean's shoulder as Valjean hides behind a door. Soldiers aim their muskets up at the ceiling where Enjolras and the students are huddled in the room above. The shots go up through the floor hitting most of the students who fall. Valjean sees a low door yanks it open climbs down into a sewer and drags Marius in with him. The soldiers are now upstairs and aim their weapons at Enjolras and a fellow student the only ones left standing. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Enjolras raises the red flag and soldiers open fire. Enjolras falls back through a window hanging upside down from the ledge still clutching the red flag. Later on the cobble street below. Javert now in uniform walks through a puddle of blood on cobbles strewn with the corpses of soldiers. Javert walks into the building where the protesters took refuge and sees the dead students laid neatly side by side on the floor. His eyes stare out lifelessly from his young pale face as Javert squats down at the end of the line beside the corpse of Gavroche. Moved by the scene Javert removes from his jacket the starshaped Legion of Honor medal with its red ribbon and pins it to Gavroche's coat. Javert frowns his eyes darting about wildly as he gets up looks around and goes to a door turns the handle and pushes it open. In the sewer Valjean is heaving the unconscious Marius along while on ground level. Javert hears Valjean straining and tries to find the source of the noise. He goes to another door listens and peers down at a round entrance to the sewers. Valjean slips down a duct tunnel with Marius and they plummet into the cavernous sewers landing unconscious in dark sludge. On ground level Javert frowns."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Calls Valjean to Marius as cannons are fired splintering the barricade and throwing up clouds of smoke. The students keep shooting at the soldiers while wood splinters and flies through the air as more cannon balls hit the barricade. Some of the students are injured as soldiers advance on the barricade and start to climb up it. The students keep shooting and a soldier is slashed with a sword while a student is bayoneted in the back. Students hammer on the door of a house but it is locked and a shutter is pulled closed. They manage to get into a building and Marius is shot falling to the ground with his head and arm bleeding. Valjean goes to him and drags him into the building as Enjolras hacks the wooden stairs away so the soldiers cannot follow. Javert frowns his eyes darting about wildly as he gets up looks around and goes to a door turns the handle and pushes it open. In the sewer Valjean is heaving the unconscious Marius along while on ground level. Javert hears Valjean straining and tries to find the source of the noise. He goes to another door listens and peers down at a round entrance to the sewers. Valjean slips down a duct tunnel with Marius and they plummet into the cavernous sewers landing unconscious in dark sludge. On ground level Javert frowns."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Calls Valjean to Marius as cannons are fired splintering the barricade and throwing up clouds of smoke. The students keep shooting at the soldiers while wood splinters and flies through the air as more cannon balls hit the barricade. Some of the students are injured as soldiers advance on the barricade and start to climb up it. He goes to another door listens and peers down at a round entrance to the sewers. Valjean slips down a duct tunnel with Marius and they plummet into the cavernous sewers landing unconscious in dark sludge. On ground level Javert frowns."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Chirps the owl to the ferret as fireworks are launched, scattering the veranda and tossing up wisps of fog. The raccoons keep painting at the bakers while bricks crumble and tumble through the breeze as more firecrackers strike the veranda. Some of the raccoons are startled as bakers creep onto the veranda and begin to scale down it. The raccoons keep painting, and a baker is tickled with a feather while a raccoon is pecked in the leg. Raccoons drum on the lid of a crate but it's sealed, and a curtain is drawn open. They manage to slither into a cave and the ferret is tickled, collapsing to the dirt with its ear and paw tingling. The owl hops to it and tugs it into the cave as the fox chops the metal ladder away so the bakers can't pursue. The raccoons scurry down to the basement of the cave as bakers bolt into the cave with knives clattering. The ferret is on the owl's wing as the owl crouches beneath a table. Bakers point their spatulas down at the floor where the fox and the raccoons are nestled in the cellar below. The forks drop down through the ceiling striking most of the raccoons, who tumble. The owl spies a high window, pushes it shut, slides up into a chimney, and tugs the ferret up with it. The bakers are now downstairs and point their ladles at the fox and a nearby raccoon, the only ones still seated. The fox hoists the yellow pennant and bakers stop baking. The fox leaps up through the door, swinging sideways from the eaves still holding the yellow pennant. Later on the sandy beach above, the pelican, now in costume, stomps through a puddle of oil on sand scattered with the bones of bakers. The pelican flutters into the cave where the musicians took haven and notices the sleeping raccoons stacked wildly one atop the other on the ceiling. Its feathers glare inactively from its old, dim beak as the pelican flaps down at the top of the tree beside the shell of the hedgehog. Moved by the moment, the pelican reaches from its pocket the heart-shaped Badge of Courage trinket with its blue lace and sticks it to the hedgehog's fur. The pelican smirks, its feathers flicking about lazily as it kneels up, glances around, and skips to a window, twists the latch, and pulls it closed. In the chimney, the owl is tossing the dozing ferret distressingly, while on leaf level, the pelican senses the owl sweating and tries to track the source of the whisper. It flutters to another window, senses, and gazes up at a square exit to the chimneys. The owl glides up a pipe tunnel with the ferret, and they tumble into the open chimneys, soaring alert in bright mist. On leaf level, the pelican smirks."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Valjean calls to Marius as cannons fire and the barricade splinters. Students shoot at soldiers who advance and climb the barricade. Amidst the chaos, Marius is shot and Valjean drags him into a building. Enjolras destroys the stairs to prevent soldiers from following, but they burst in, shooting through the floor and hitting most students. Valjean escapes with Marius through a sewer. Soldiers confront Enjolras, who raises a red flag before being shot and falling. Javert, now in uniform, walks among the dead soldiers and students, moved by the sight. He pins a Legion of Honor medal on Gavroche's coat. In the sewers, Valjean carries Marius, while above, Javert hears them and searches for the source of the noise. Valjean and Marius fall further into the sewers, landing in dark sludge."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "On ground level Javert frowns Valjean slips down a duct tunnel with Marius and they plummet into the cavernous sewers landing unconscious in dark sludge He goes to another door listens and peers down at a round entrance to the sewers Javert hears Valjean straining and tries to find the source of the noise In the sewer Valjean is heaving the unconscious Marius along while on ground level Javert frowns his eyes darting about wildly as he gets up looks around and goes to a door turns the handle and pushes it open Moved by the scene Javert removes from his jacket the starshaped Legion of Honor medal with its red ribbon and pins it to Gavroche's coat His eyes stare out lifelessly from his young pale face as Javert squats down at the end of the line beside the corpse of Gavroche Javert walks into the building where the protesters took refuge and sees the dead students laid neatly side by side on the floor Javert now in uniform walks through a puddle of blood on cobbles strewn with the corpses of soldiers Later on the cobble street below Enjolras falls back through a window hanging upside down from the ledge still clutching the red flag Enjolras raises the red flag and soldiers open fire The soldiers are now upstairs and aim their weapons at Enjolras and a fellow student the only ones left standing Valjean sees a low door yanks it open climbs down into a sewer and drags Marius in with him The shots go up through the floor hitting most of the students who fall Soldiers aim their muskets up at the ceiling where Enjolras and the students are huddled in the room above Marius is over Valjean's shoulder as Valjean hides behind a door The students climb up to the first floor of the building as soldiers burst into the building with guns blazing Valjean goes to him and drags him into the building as Enjolras hacks the wooden stairs away so the soldiers cannot follow They manage to get into a building and Marius is shot falling to the ground with his head and arm bleeding Students hammer on the door of a house but it is locked and a shutter is pulled closed The students keep shooting and a soldier is slashed with a sword while a student is bayoneted in the back Some of the students are injured as soldiers advance on the barricade and start to climb up it The students keep shooting at the soldiers while wood splinters and flies through the air as more cannon balls hit the barricade Calls Valjean to Marius as cannons are fired splintering the barricade and throwing up clouds of smoke"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The students keep shooting at the soldiers while wood splinters and flies through the air as more cannon balls hit the barricade Calls Valjean to Marius as cannons are fired splintering the barricade and throwing up clouds of smoke The students keep shooting and a soldier is slashed with a sword while a student is bayoneted in the back Some of the students are injured as soldiers advance on the barricade and start to climb up it They manage to get into a building and Marius is shot falling to the ground with his head and arm bleeding Students hammer on the door of a house but it is locked and a shutter is pulled closed The students climb up to the first floor of the building as soldiers burst into the building with guns blazing Valjean goes to him and drags him into the building as Enjolras hacks the wooden stairs away so the soldiers cannot follow Soldiers aim their muskets up at the ceiling where Enjolras and the students are huddled in the room above Marius is over Valjean's shoulder as Valjean hides behind a door Valjean sees a low door yanks it open climbs down into a sewer and drags Marius in with him The shots go up through the floor hitting most of the students who fall Enjolras raises the red flag and soldiers open fire The soldiers are now upstairs and aim their weapons at Enjolras and a fellow student the only ones left standing Later on the cobble street below Enjolras falls back through a window hanging upside down from the ledge still clutching the red flag Javert walks into the building where the protesters took refuge and sees the dead students laid neatly side by side on the floor Javert now in uniform walks through a puddle of blood on cobbles strewn with the corpses of soldiers Moved by the scene Javert removes from his jacket the starshaped Legion of Honor medal with its red ribbon and pins it to Gavroche's coat His eyes stare out lifelessly from his young pale face as Javert squats down at the end of the line beside the corpse of Gavroche In the sewer Valjean is heaving the unconscious Marius along while on ground level Javert frowns his eyes darting about wildly as he gets up looks around and goes to a door turns the handle and pushes it open He goes to another door listens and peers down at a round entrance to the sewers Javert hears Valjean straining and tries to find the source of the noise On ground level Javert frowns Valjean slips down a duct tunnel with Marius and they plummet into the cavernous sewers landing unconscious in dark sludge"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Enjolras raises the red flag and soldiers open fire Enjolras falls back through a window hanging upside down from the ledge still clutching the red flag Later on the cobble street below Javert now in uniform walks through a puddle of blood on cobbles strewn with the corpses of soldiers Javert walks into the building where the protesters took refuge and sees the dead students laid neatly side by side on the floor His eyes stare out lifelessly from his young pale face as Javert squats down at the end of the line beside the corpse of Gavroche Moved by the scene Javert removes from his jacket the starshaped Legion of Honor medal with its red ribbon and pins it to Gavroche's coat Javert frowns his eyes darting about wildly as he gets up looks around and goes to a door turns the handle and pushes it open In the sewer Valjean is heaving the unconscious Marius along while on ground level Javert hears Valjean straining and tries to find the source of the noise He goes to another door listens and peers down at a round entrance to the sewers Valjean slips down a duct tunnel with Marius and they plummet into the cavernous sewers landing unconscious in dark sludge On ground level Javert frowns Calls Valjean to Marius as cannons are fired splintering the barricade and throwing up clouds of smoke The students keep shooting at the soldiers while wood splinters and flies through the air as more cannon balls hit the barricade Some of the students are injured as soldiers advance on the barricade and start to climb up it The students keep shooting and a soldier is slashed with a sword while a student is bayoneted in the back Students hammer on the door of a house but it is locked and a shutter is pulled closed They manage to get into a building and Marius is shot falling to the ground with his head and arm bleeding Valjean goes to him and drags him into the building as Enjolras hacks the wooden stairs away so the soldiers cannot follow The students climb up to the first floor of the building as soldiers burst into the building with guns blazing Marius is over Valjean's shoulder as Valjean hides behind a door Soldiers aim their muskets up at the ceiling where Enjolras and the students are huddled in the room above The shots go up through the floor hitting most of the students who fall Valjean sees a low door yanks it open climbs down into a sewer and drags Marius in with him The soldiers are now upstairs and aim their weapons at Enjolras and a fellow student the only ones left standing"
        }
      ]
    }
  ]
}