{
  "ground_truth": "He pretends to spoon more of the sauce, and Kate opens her mouth, ready to taste it. Nick draws the spoon away a couple of times and watches her full lips open and close. Then, he leans over and plants a kiss to one side of her mouth. The couple move apart slightly, and Kate pulls off her blindfold. She moves back in towards Nick. Nick's face edges towards Kate's, and this time he kisses her fully on the lips. The couple begin to kiss more urgently. Kate brings her hands up to cup Nick's face, and she stands. Her eyes are closed, and her face is relaxed into a serene ecstasy, as Nick kisses her neck then returns to her lips. Finally, Kate falls into Nick's embrace. Next morning, Nick strides down the hallway rattling a spoon in a saucepan. In Zoe's room, Zoe, Kate, and Nick are piled into a photo booth. Outside, Kate screams with glee at the pictures. The trio walk down a cold, sunny New York street. Nick has Zoe on his shoulders. All three wear coats, scarves, and woolly hats. They dart across a busy street to a Chinese vegetable shop. They leave the shop. All three wear cycling helmets as they pedal a bicycle made for three. The sun sets against the Manhattan skyline as they pedal alongside the river. Nick sits up front. Later in the evening, they come across a street artist copying a fantastical picture of a ballerina onto the pavement in colored chalk. Nick and Kate hold hands. Zoe beams up at them as she admires the drawing. The staff are gathered at the restaurant to review the menu. In the kitchen, Nick completes a vegetable garnish on a dish and lays it out for a waiter. Kate eyes him with suspicion. Paula strolls in from the dining room. Nick is wide-eyed with surprise as he watches Kate stride off to the walk-in fridge. He joins her. The couple stare at each other. From the kitchen, they're framed in the window of the fridge door. Kate is left thoughtful. She returns to her apartment, where a woman in her 60s waits on the sofa. Kate locks the apartment door, turns out the hall lights, and saunters back into the room. Passing a side table, she presses a button on the answer phone then lifts a remote and turns off the music. Kate stares thoughtfully. She heads towards her bedroom. Zoe cuddles up to her furry kangaroo. Kate goes into her room. Zoe rolls onto her side. At the restaurant, Paula tackles Kate as she prepares dishes. Kate interviews a series of applicants. At the apartment, Zoe watches TV as Kate works at her desk.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He feigns to ladle more of the gravy, and Kate opens her mouth, ready to sample it. Nick pulls the ladle away a pair of times and observes her full lips part and close. Then, he inclines over and places a peck to one side of her mouth. The duo shift apart slightly, and Kate removes her blindfold. She moves back in towards Nick. Nick's visage moves towards Kate's, and this time he pecks her fully on the lips. The duo commence to peck more fervently. Kate raises her hands up to cradle Nick's visage, and she stands. Her eyes are shut, and her visage is relaxed into a tranquil bliss, as Nick pecks her neck then returns to her lips. Finally, Kate falls into Nick's clasp. Next morning, Nick strides down the corridor clattering a ladle in a cooking pot. In Zoe's chamber, Zoe, Kate, and Nick are piled into a photo booth. Outside, Kate exclaims with delight at the pictures. The trio stroll along a chilly, sunny New York avenue. Nick has Zoe on his shoulders. All three wear jackets, scarves, and woolly caps. They scurry across a bustling avenue to a Chinese produce shop. They exit the shop. All three wear cycling helmets as they pedal a bicycle crafted for three. The sun descends against the Manhattan skyline as they pedal beside the river. Nick sits up front. Later in the evening, they encounter a street artist replicating a whimsical painting of a ballerina onto the sidewalk in colored chalk. Nick and Kate clasp hands. Zoe beams up at them as she admires the illustration. The staff are assembled at the eatery to review the menu. In the kitchen, Nick completes a produce garnish on a dish and places it out for a server. Kate gazes at him with mistrust. Paula ambles in from the dining area. Nick is wide-eyed with astonishment as he observes Kate stride off to the walk-in cooler. He joins her. The duo gaze at each other. From the kitchen, they're framed in the window of the cooler door. Kate is left pensive. She returns to her flat, where a woman in her 60s waits on the sofa. Kate locks the flat door, turns out the corridor lights, and saunters back into the room. Passing a side table, she presses a button on the answering machine then lifts a remote and turns off the music. Kate gazes pensively. She heads towards her chamber. Zoe cuddles up to her furry kangaroo. Kate goes into her chamber. Zoe rolls onto her flank. At the eatery, Paula confronts Kate as she prepares dishes. Kate interviews a series of candidates. At the flat, Zoe watches TV as Kate works at her desk."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He pretends to spoon more of the sauce, and her mouth is opened by Kate, ready to taste it. The spoon is drawn away by Nick a couple of times, and he watches her full lips open and close. Then, he leans over, and a kiss is planted by him to one side of her mouth. The couple are moved apart slightly, and Kate pulls off her blindfold. She moves back in towards Nick. Nick's face edges towards Kate's, and this time her lips are kissed by him fully. The couple begin to kiss more urgently. Nick's face is cupped by Kate's hands, and she stands. Her eyes are closed, and her face is relaxed into a serene ecstasy, as her neck is kissed by Nick and then her lips are returned to. Finally, Nick's embrace is fallen into by Kate. Next morning, a spoon is rattled in a saucepan by Nick as he strides down the hallway. In Zoe's room, a photo booth is piled into by Zoe, Kate, and Nick. Outside, glee is screamed with by Kate at the pictures. The trio walk down a cold, sunny New York street. Zoe is had on his shoulders by Nick. All three wear coats, scarves, and woolly hats. A busy street is darted across by them to a Chinese vegetable shop. The shop is left by them. Cycling helmets are worn by all three as a bicycle made for three is pedaled by them. The sun sets against the Manhattan skyline as the river is pedaled alongside by them. Nick sits up front. Later in the evening, a street artist is come across by them copying a fantastical picture of a ballerina onto the pavement in colored chalk. Nick and Kate hold hands. Zoe beams up at them as she admires the drawing. The staff gather at the restaurant to review the menu. In the kitchen, a vegetable garnish is completed on a dish by Nick and laid out for a waiter. Kate eyes him with suspicion. Paula strolls in from the dining room. Wide-eyed with surprise, Nick is as he watches Kate stride off to the walk-in fridge. He joins her. The couple stare at each other. From the kitchen, they're framed in the window of the fridge door. Kate is left thoughtful. She returns to her apartment, where a woman in her 60s waits on the sofa. The apartment door is locked by Kate, the hall lights are turned out, and back into the room, she saunters. A button on the answer phone is pressed by her as she passes a side table, then the music is turned off by her after lifting a remote. Kate stares thoughtfully. Towards her bedroom, she heads. Her furry kangaroo is cuddled up to by Zoe. Her room is entered by Kate. Zoe rolls onto her side. At the restaurant, Kate is tackled by Paula as dishes are prepared by her. A series of applicants are interviewed by Kate. At the apartment, the TV is watched by Zoe as her desk is worked at by Kate."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Nick pretends to spoon more sauce as Kate, blindfolded, opens her mouth. Teasingly, he pulls the spoon away and kisses the side of her mouth. They pull apart, and Kate removes her blindfold, returning for a fuller kiss. As they kiss passionately, Kate cups Nick's face, stands, and closes her eyes in bliss as he kisses her neck. She falls into his embrace. The next morning, Nick rattles a spoon in a saucepan. In Zoe's room, the trio—Zoe, Kate, and Nick—are in a photo booth. Outside, Kate gleefully reacts to the pictures on a cold, sunny New York street. Nick carries Zoe on his shoulders. They cross a street to a Chinese vegetable shop and leave wearing helmets, pedaling a bicycle made for three along the river at sunset. They encounter a street artist drawing a ballerina in chalk, admiring the artwork. At the restaurant, staff review the menu as Nick finishes a dish. Kate watches Nick, intrigued. As Paula enters, Nick follows Kate to the walk-in fridge. They stare at each other through its door window. Kate returns home to a woman in her 60s waiting. After locking up, she listens to the answer machine and turns off the music, contemplating. She heads to bed, where Zoe snuggles her stuffed kangaroo. At the restaurant, Paula confronts Kate while preparing dishes and interviewing candidates. At home, Zoe watches TV as Kate works at her desk."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Nick pretends to spoon more sauce as Kate opens her mouth to taste, but he kisses her instead. Kate removes her blindfold and kisses Nick fully. They kiss urgently, and Kate cups Nick's face, eyes closed, in bliss. Nick kisses her neck, then lips again, and Kate falls into his embrace.\n\nNext morning, Nick rattles a spoon in a saucepan, and Zoe, Kate, and Nick take photos in a booth. Kate laughs at the pictures as they walk down a sunny, cold New York street, Zoe on Nick's shoulders. They visit a Chinese vegetable shop, then cycle wearing helmets as the sun sets over Manhattan. They encounter a street artist sketching a ballerina, Nick and Kate hold hands, and Zoe admires the drawing.\n\nAt the restaurant, Nick finishes a garnish while Kate eyes him suspiciously. Paula enters, and Nick is surprised as Kate heads to the fridge, where they stare at each other. Kate returns home to a woman in her 60s. She locks the door, turns off the lights and music, and heads to her bedroom. Zoe cuddles a kangaroo, and Kate joins her. At the restaurant, Paula confronts Kate, who conducts interviews. Zoe watches TV as Kate works at her desk."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He engages in a playful act, pretending to ladle more of the savory sauce as Kate eagerly opens her mouth, anticipating the taste. With a mischievous glint, Nick pulls the spoon away a couple of times, amusedly watching as her full, inviting lips part and close in response. Then, in a spontaneous gesture of affection, he leans over and gently places a kiss on one side of her mouth. The couple slightly separate for a moment, and with a sense of anticipation, Kate removes her blindfold. She then moves back towards Nick, closing the distance between them. Nick's face inches closer to Kate's, and this time, he kisses her fully on the lips, a moment filled with warmth and connection. The couple begins to kiss with increased urgency and passion. Kate gracefully brings her hands up to cradle Nick's face, and as she stands, her eyes flutter closed, her expression softening into a serene state of ecstasy. Nick continues to shower her with affectionate kisses, moving from her neck back to her lips. Eventually, Kate finds herself enveloped in Nick's comforting embrace.\n\nThe following morning, with a lively demeanor, Nick strides down the hallway, playfully rattling a spoon against a saucepan. In Zoe's room, a delightful scene unfolds as Zoe, Kate, and Nick squeeze into a small photo booth, capturing the joyful memory together. Outside, Kate's laughter fills the air as she squeals with delight at the pictures they took. The trio then walk together along a cold yet sunlit street in the bustling city of New York. Nick carries Zoe on his shoulders, and all three are bundled up in cozy coats, warm scarves, and snug woolly hats. With excitement in their steps, they dash across a busy street, arriving at a Chinese vegetable shop. After their visit, they leave the shop, now all sporting cycling helmets as they prepare to pedal away on a unique three-seater bicycle. As they ride along the river, the sun begins to set, casting a beautiful glow against the iconic Manhattan skyline. Upfront, Nick takes the lead on their cycling adventure. As evening falls, they stumble upon a talented street artist meticulously replicating a fantastical image of a ballerina on the pavement using vibrant colored chalk. Nick and Kate hold hands, sharing a moment of wonder and admiration for the artwork, while Zoe beams up at them, captivated by the drawing.\n\nBack in the restaurant, the staff gathers for a meeting to review the new menu. In the bustling kitchen, Nick skillfully completes a vegetable garnish on a dish, presenting it to a waiter with precision. Observing him, Kate casts a glance filled with suspicion. Paula, with an air of authority, casually enters from the dining room. Nick, caught off guard, widens his eyes in surprise as he watches Kate stride off purposefully towards the walk-in fridge. He quickly follows her, joining her there. The couple stands facing each other, communicating silently yet intensely through their eyes. From the kitchen, their figures are perfectly framed in the window of the fridge door, capturing the intensity of the moment. Kate is left deep in thought as she processes the encounter. She later returns to her apartment, where an older woman in her 60s awaits on the sofa, a familiar presence in her life. Kate methodically locks the apartment door, turns off the hall lights, and leisurely makes her way back into the main room. As she passes a side table, she casually presses a button on the answering machine before picking up a remote and switching off the music. Standing silently, Kate stares thoughtfully, lost in contemplation. Eventually, she heads towards the sanctuary of her bedroom, where Zoe, wrapped in comfort, cuddles her cherished furry kangaroo. Kate enters her room quietly, and as she does, Zoe rolls onto her side, settling in for the night.\n\nMeanwhile, at the restaurant, Paula confronts Kate with determination as Kate diligently prepares dishes. In another scene, Kate interviews a series of applicants, evaluating each with care. Back at the apartment, Zoe is absorbed in watching TV while Kate concentrates on her work at her desk, balancing her responsibilities with grace."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He delightfully engages in a playful act, humorously pretending to ladle more of the savory sauce, while Kate eagerly opens her mouth, anticipating the rich taste of the dish. With a mischievous glint in his eyes, Nick teasingly pulls the spoon away a couple of times, amused by the sight of her full, inviting lips that part and close in response to his actions. Then, in a spontaneous and affectionate gesture, he leans over and gently places a tender kiss on one side of her mouth. The couple slightly separate for a fleeting moment, and with a sense of anticipation, Kate removes her blindfold. She then moves back towards Nick, purposefully closing the distance between them. Nick's face inches closer to Kate's, and this time, he kisses her fully on the lips, filling the moment with warmth and a profound sense of connection. The couple begins to kiss with increased urgency and unmistakable passion. Kate gracefully lifts her hands to cradle Nick's face, and as she stands, her eyes flutter closed, her expression softening into a serene state of ecstasy. Nick continues to shower her with affectionate kisses, moving from her neck back to her lips. Eventually, Kate finds herself enveloped in Nick's comforting and reassuring embrace.\n\nThe following morning, with a lively and energetic demeanor, Nick strides down the hallway, playfully and rhythmically rattling a spoon against a saucepan. In Zoe's room, a delightful scene unfolds as Zoe, Kate, and Nick squeeze into a small photo booth, enthusiastically capturing the joyful memory together. Outside, Kate's laughter fills the air as she squeals with delight at the whimsical pictures they took. The happy trio then walks together along a cold yet sunlit street in the bustling and vibrant city of New York. Nick carries Zoe on his shoulders, and all three are bundled up in cozy coats, warm scarves, and snug woolly hats. With excitement in their steps, they dash across a busy street, arriving at a quaint Chinese vegetable shop. After their visit, they leave the shop, now all sporting cycling helmets as they prepare to pedal away on a unique three-seater bicycle. As they ride along the river, the sun begins to set, casting a beautiful and picturesque glow against the iconic Manhattan skyline. Upfront, Nick takes the lead on their cycling adventure. As evening falls, they stumble upon a talented street artist meticulously replicating a fantastical image of a ballerina on the pavement using vibrant and colorful chalk. Nick and Kate hold hands, sharing a moment of wonder and admiration for the exquisite artwork, while Zoe beams up at them, entirely captivated by the stunning drawing.\n\nBack in the restaurant, the dedicated staff gathers for an important meeting to review the new menu. In the bustling and busy kitchen, Nick skillfully completes a fresh vegetable garnish on a dish, presenting it to a waiter with precision and care. Observing him closely, Kate casts a glance filled with suspicion. Paula, exuding an air of authority, casually enters from the dining room. Nick, caught off guard, widens his eyes in surprise as he watches Kate stride off purposefully towards the walk-in fridge. He quickly follows her, joining her there. The couple stands facing each other, communicating silently yet intensely through their eyes. From the kitchen, their figures are perfectly framed in the window of the fridge door, capturing the intensity of the moment. Kate is left deep in thought as she processes the encounter. She later returns to her cozy apartment, where an older woman in her 60s awaits on the sofa, a familiar presence in her life. Kate methodically locks the apartment door, turns off the hall lights, and leisurely makes her way back into the main room. As she passes a side table, she casually presses a button on the answering machine before picking up a remote and switching off the music. Standing silently, Kate stares thoughtfully, lost in contemplation. Eventually, she heads towards the sanctuary of her bedroom, where Zoe, wrapped in comfort, cuddles her cherished furry kangaroo. Kate enters her room quietly, and as she does, Zoe rolls onto her side, settling in for the peaceful night.\n\nMeanwhile, at the bustling restaurant, Paula confronts Kate with determination as Kate diligently and meticulously prepares several dishes. In another scene, Kate interviews a series of eager applicants, evaluating each with care and attention. Back at the apartment, Zoe is absorbed in watching TV while Kate concentrates on her work at her desk, skillfully balancing her numerous responsibilities with grace."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He playfully pretends to spoon more of the sauce, holding the utensil teasingly above the plate, and Kate, anticipating the taste, opens her mouth expectantly, ready to sample the culinary creation. With a mischievous glint in his eye, Nick draws the spoon away, repeating the gesture a couple of times, as he amusedly watches her full lips part and then close in an involuntary dance of anticipation and slight frustration. Seizing the moment of playful teasing, he leans over, his face drawing near hers, and gently plants a soft, quick kiss to one side of her mouth, eliciting a quiet, surprised response. The couple instinctively moves apart slightly with a shared, quiet laughter, and then, with a small determined motion, Kate reaches up, fingers brushing against her skin, and pulls off her blindfold to reveal her eyes. Without hesitation, she moves back in towards Nick, their mutual attraction pulling them close once more. Nick's face inches closer again, a tender intent in his movements as he closes the gap between them, and this time, their lips meet fully in a deep, meaningful kiss. The couple soon becomes more fervent, their kisses growing increasingly urgent, as if speaking a language all their own, unspoken yet understood. Kate lifts her hands, the warmth of her palms enveloping Nick's cheeks, cupping his face with affection, while slowly and deliberately, she stands, her body rising to meet his. Her eyes remain closed, savoring the intimate connection, her expression one of serene ecstasy as Nick's lips trail softly along her neck before returning to capture her lips once again in a lingering embrace. Finally, she surrenders to the moment completely, her body melting into Nick's protective embrace as they hold each other closely. The next morning, Nick confidently strides down the hallway, the sound of a spoon clattering against a saucepan echoing in his wake, a playful wake-up call for those still asleep. In Zoe's room, laughter and the snap of photos capture a moment of camaraderie as Zoe, Kate, and Nick squeeze together into a photo booth, their faces beaming with delight at the happy chaos of their captured images. Outside the booth, Kate is overtaken by a bubbling scream of glee as she holds up the pictures, the joy of the moment spilling over into the cold, sunny New York street. Together, the trio sets off, walking down the street with energy and warmth, each wrapped in protective layers of coats, scarves, and woolly hats against the chill. Zoe rides atop Nick's shoulders, a spirited bounce in her balance, as they all dart with nimble footsteps across a busy street toward the inviting sight of a Chinese vegetable shop. Having gathered what they need, they exit the shop, now clad in cycling helmets, and mount a bicycle crafted sumptuously for three. They pedal with synchronized movements along the river as the sun dips, casting brilliant hues against the Manhattan skyline, with Nick positioned upfront guiding their journey. Later, in the fading light of evening, they stumble across a street artist, who bends low to the pavement, carefully replicating a fantastical picture of a ballerina in vivid colored chalks. It's a scene that captivates the trio's attention, and Nick and Kate instinctively join hands, a small gesture of shared joy and wonder, as Zoe's eyes widen with admiration at the evolving artwork before them. Back at the restaurant, the staff gathers, an eager audience ready to review the latest culinary offerings on the menu. In the kitchen, Nick, with practiced precision, completes the final touches of a vegetable garnish on a dish, presenting it with a flourish for the waiter's approval. Kate observes him keenly, her eyes narrowing with suspicion as she tries to decipher his intentions. Paula, with her usual stride of confidence, saunters in from the dining room, adding her presence to the bustling kitchen dynamic. Nick blinks in wide-eyed surprise, momentarily thrown off balance, as he watches Kate stride purposefully to the walk-in fridge, leaving him no choice but to follow. Together, they enter the fridge, their figures framed by the window in the door, as they stand facing each other, a charged silence enveloping the space. In that shared stillness, Kate is left pensive, her thoughts a whirlpool of considerations. She later returns to her apartment, where an older woman, comfortably settled in her 60s, waits patiently on the sofa. Kate methodically locks the apartment door, her fingers moving surely over the lock, then turns out the hall lights, casting a warm, muted glow as she saunters back into the room. As she passes a side table, her fingers reach out to press a button on the answer phone, the machine whirring to life, while with her other hand she deftly lifts a remote control, decisively turning off the background music to invite a reflective silence. Kate pauses, casting her gaze thoughtfully around the room, a quiet contemplation settling over her features. She then heads with a sense of resolve towards her bedroom, where Zoe is nestled comfortably, cuddling up to her furry kangaroo companion, a picture of nighttime coziness. Kate enters her room, a serene presence as she prepares to end her day, while Zoe, sensing her mother's presence, rolls onto her side, drawing comfort from her nearness. At the restaurant, Kate faces Paula's direct approach as their paths intersect, and she continues her culinary preparations undeterred. Kate remains focused as she interviews a series of applicants, each interaction adding to the day's challenges. Back at the apartment, Zoe sits mesmerized by the television's glow, while Kate works diligently at her desk, navigating the balancing act of career and parenting with her steadfast dedication."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Nick teases Kate with a spoonful of sauce before surprising her with a kiss on the corner of her mouth. They pull apart slightly, allowing Kate to remove her blindfold, and then they kiss passionately. Kate cups Nick's face, rising to her feet as they continue their embrace, sharing tender kisses on her neck and lips, before she falls into his arms.\n\nThe next morning, Nick playfully rattles a spoon in a saucepan as he walks down the hallway. In Zoe's room, the three—Zoe, Kate, and Nick—cram into a photo booth, later laughing over the pictures. They stroll through a chilly, sunny New York street, with Zoe perched on Nick's shoulders, all bundled warmly in coats and hats. The trio crosses a busy street to visit a Chinese vegetable shop and, leaving the shop, don helmets to ride a tandem bicycle along the river as the sun sets behind the Manhattan skyline.\n\nThat evening, they encounter a street artist creating a vivid chalk drawing of a ballerina. Nick and Kate hold hands while Zoe admires the artwork. At the restaurant, staff gather to review the menu as Nick completes a dish with a vegetable garnish. Kate watches him with suspicion before she heads to the walk-in fridge, prompting Nick to follow. They share a moment framed in the fridge door window, leaving Kate contemplative.\n\nReturning to her apartment, Kate is greeted by a woman in her 60s waiting on the sofa. After locking the door and turning off the hall lights, Kate turns off the music and listens to her answering machine. Deep in thought, she heads to her bedroom where Zoe snuggles with a stuffed kangaroo. At the restaurant, Paula challenges Kate as she prepares dishes and later interviews applicants. Meanwhile, at home, Zoe watches TV while Kate works at her desk."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He pretends to spoon more of the sauce, sourced from a local artisan known for their unique blend of spices, and Kate opens her mouth, ready to taste it. Nick draws the spoon away a couple of times and watches her full lips open and close, reminiscent of a teasing game they often play. Then, he leans over and plants a kiss to one side of her mouth. The couple move apart slightly, and Kate pulls off her blindfold, a silky piece she bought at a small boutique in the city. She moves back in towards Nick. Nick's face edges towards Kate's, and this time he kisses her fully on the lips, echoing the warmth of their shared evening. The couple begin to kiss more urgently. Kate brings her hands up to cup Nick's face, and she stands. Her eyes are closed, and her face is relaxed into a serene ecstasy, as Nick kisses her neck then returns to her lips. Finally, Kate falls into Nick's embrace, recalling the first time they met at a bustling café. Next morning, Nick strides down the hallway rattling a spoon in a saucepan, a playful morning ritual they started years ago. In Zoe's room, Zoe, Kate, and Nick are piled into a photo booth, a classic New York activity capturing memories forever. Outside, Kate screams with glee at the pictures, which show them making silly faces. The trio walk down a cold, sunny New York street, the city bustling with its usual vibrant energy. Nick has Zoe on his shoulders. All three wear coats, scarves, and woolly hats, their breath visible in the crisp winter air. They dart across a busy street to a Chinese vegetable shop, renowned for its fresh produce. They leave the shop. All three wear cycling helmets as they pedal a bicycle made for three, a quirky rental they found in Central Park. The sun sets against the Manhattan skyline, casting a golden hue as they pedal alongside the river. Nick sits up front. Later in the evening, they come across a street artist copying a fantastical picture of a ballerina onto the pavement in colored chalk, an echo of New York's vibrant art scene. Nick and Kate hold hands. Zoe beams up at them as she admires the drawing, the colors vivid against the gray concrete. The staff are gathered at the restaurant, a popular bistro known for its innovative dishes, to review the menu. In the kitchen, Nick completes a vegetable garnish on a dish, skillfully arranging it like a work of art, and lays it out for a waiter. Kate eyes him with suspicion, recalling a recent disagreement about presentation styles. Paula strolls in from the dining room, her presence always commanding attention. Nick is wide-eyed with surprise as he watches Kate stride off to the walk-in fridge. He joins her. The couple stare at each other, the tension of unresolved conversations hanging in the air. From the kitchen, they're framed in the window of the fridge door, a silent moment shared amidst the clatter of kitchen work. Kate is left thoughtful. She returns to her apartment, located in a charming old building in the East Village, where a woman in her 60s, her mother visiting from Boston, waits on the sofa. Kate locks the apartment door, turns out the hall lights, and saunters back into the room. Passing a side table, she presses a button on the answer phone, listening to messages left by friends and family, then lifts a remote and turns off the music, leaving the room in comforting silence. Kate stares thoughtfully. She heads towards her bedroom. Zoe cuddles up to her furry kangaroo, a cherished gift from her grandmother. Kate goes into her room. Zoe rolls onto her side, dreaming of adventures. At the restaurant, Paula tackles Kate as she prepares dishes, determined to ensure the evening's service goes smoothly. Kate interviews a series of applicants, looking for the perfect addition to their team. At the apartment, Zoe watches TV, engrossed in her favorite cartoon, as Kate works at her desk, compiling notes for the next day's meetings."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Nick's face edges towards Kate's and this time he kisses her fully on the lips He pretends to spoon more of the sauce and Kate opens her mouth ready to taste it Nick draws the spoon away a couple of times and watches her full lips open and close Then he leans over and plants a kiss to one side of her mouth The couple move apart slightly and Kate pulls off her blindfold She moves back in towards Nick Nick's face edges towards Kate's and this time he kisses her fully on the lips The couple begin to kiss more urgently Kate brings her hands up to cup Nick's face and she stands The sun sets against the Manhattan skyline as they pedal alongside the river Her eyes are closed and her face is relaxed into a serene ecstasy as Nick kisses her neck then returns to her lips Nick and Kate hold hands At the restaurant Paula tackles Kate as she prepares dishes Finally Kate falls into Nick's embrace He joins her He pretends to spoon more of the sauce and Kate opens her mouth ready to taste it Next morning Nick strides down the hallway rattling a spoon in a saucepan In Zoe's room Zoe Kate and Nick are piled into a photo booth Outside Kate screams with glee at the pictures The trio walk down a cold sunny New York street All three wear coats scarves and woolly hats They dart across a busy street to a Chinese vegetable shop Nick has Zoe on his shoulders All three wear coats scarves and woolly hats The couple begin to kiss more urgently They dart across a busy street to a Chinese vegetable shop Kate interviews a series of applicants They leave the shop All three wear cycling helmets as they pedal a bicycle made for three The sun sets against the Manhattan skyline as they pedal alongside the river Nick sits up front Later in the evening they come across a street artist copying a fantastical picture of a ballerina onto the pavement in colored chalk Nick and Kate hold hands Kate stares thoughtfully Zoe beams up at them as she admires the drawing The staff are gathered at the restaurant to review the menu In the kitchen Nick completes a vegetable garnish on a dish and lays it out for a waiter They leave the shop Nick has Zoe on his shoulders Kate eyes him with suspicion Paula strolls in from the dining room Nick is wideeyed with surprise as he watches Kate stride off to the walkin fridge He joins her The couple stare at each other From the kitchen they are framed in the window of the fridge door At the apartment Zoe watches TV as Kate works at her desk Kate is left thoughtful She returns to her apartment where a woman in her 60s waits on the sofa Her eyes are closed and her face is relaxed into a serene ecstasy as Nick kisses her neck then returns to her lips Nick draws the spoon away a couple of times and watches her full lips open and close Kate locks the apartment door turns out the hall lights and saunters back into the room Passing a side table she presses a button on the answer phone then lifts a remote and turns off the music Kate is left thoughtful Kate stares thoughtfully She heads towards her bedroom Zoe cuddles up to her furry kangaroo Kate goes into her room Zoe rolls onto her side Paula strolls in from the dining room Zoe rolls onto her side At the restaurant Paula tackles Kate as she prepares dishes Then he leans over and plants a kiss to one side of her mouth Kate interviews a series of applicants Kate brings her hands up to cup Nick's face and she stands Kate locks the apartment door turns out the hall lights and saunters back into the room At the apartment Zoe watches TV as Kate works at her desk"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He pretends to spoon more of the sauce and Kate opens her mouth ready to taste it. Nick draws the spoon away a couple of times and watches her full lips open and close. Then he leans over and plants a kiss to one side of her mouth. The couple move apart slightly and Kate pulls off her blindfold. She moves back in towards Nick. Nick's face edges towards Kate's and this time he kisses her fully on the lips. The couple begin to kiss more urgently. Kate brings her hands up to cup Nick's face and she stands. Her eyes are closed and her face is relaxed into a serene ecstasy as Nick kisses her neck then returns to her lips. Finally Kate falls into Nick's embrace. Next morning Nick strides down the hallway rattling a spoon in a saucepan. In Zoe's room Zoe Kate and Nick are piled into a photo booth. Outside Kate screams with glee at the pictures. The trio walk down a cold sunny New York street. Nick has Zoe on his shoulders. All three wear coats scarves and woolly hats. They dart across a busy street to a Chinese vegetable shop. They leave the shop. All three wear cycling helmets as they pedal a bicycle made for three. The sun sets against the Manhattan skyline as they pedal alongside the river. Nick sits up front. Later in the evening they come across a street artist copying a fantastical picture of a ballerina onto the pavement in colored chalk. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Nick and Kate hold hands. Zoe beams up at them as she admires the drawing. The staff are gathered at the restaurant to review the menu. In the kitchen Nick completes a vegetable garnish on a dish and lays it out for a waiter. Kate eyes him with suspicion. Paula strolls in from the dining room. Nick is wideeyed with surprise as he watches Kate stride off to the walkin fridge. He joins her. The couple stare at each other. From the kitchen they are framed in the window of the fridge door. Kate is left thoughtful. She returns to her apartment where a woman in her 60s waits on the sofa. Kate locks the apartment door turns out the hall lights and saunters back into the room. Passing a side table she presses a button on the answer phone then lifts a remote and turns off the music. Kate stares thoughtfully. She heads towards her bedroom. Zoe cuddles up to her furry kangaroo. Kate goes into her room. Zoe rolls onto her side. At the restaurant Paula tackles Kate as she prepares dishes. Kate interviews a series of applicants. At the apartment Zoe watches TV as Kate works at her desk."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He pretends to spoon more of the sauce and Kate opens her mouth ready to taste it. Nick draws the spoon away a couple of times and watches her full lips open and close. Then he leans over and plants a kiss to one side of her mouth. The couple move apart slightly and Kate pulls off her blindfold. She moves back in towards Nick. Nick's face edges towards Kate's and this time he kisses her fully on the lips. The couple begin to kiss more urgently. Kate brings her hands up to cup Nick's face and she stands. Her eyes are closed and her face is relaxed into a serene ecstasy as Nick kisses her neck then returns to her lips. Finally Kate falls into Nick's embrace. Next morning Nick strides down the hallway rattling a spoon in a saucepan. In Zoe's room Zoe Kate and Nick are piled into a photo booth. Outside Kate screams with glee at the pictures. The trio walk down a cold sunny New York street. Nick has Zoe on his shoulders. All three wear coats scarves and woolly hats. They dart across a busy street to a Chinese vegetable shop. They leave the shop. All three wear cycling helmets as they pedal a bicycle made for three. The sun sets against the Manhattan skyline as they pedal alongside the river. Nick sits up front. Later in the evening they come across a street artist copying a fantastical picture of a ballerina onto the pavement in colored chalk. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Nick and Kate hold hands. Zoe beams up at them as she admires the drawing. The staff are gathered at the restaurant to review the menu. In the kitchen Nick completes a vegetable garnish on a dish and lays it out for a waiter. Kate eyes him with suspicion. Paula strolls in from the dining room. Nick is wideeyed with surprise as he watches Kate stride off to the walkin fridge. He joins her. The couple stare at each other. From the kitchen they are framed in the window of the fridge door. Kate is left thoughtful. She returns to her apartment where a woman in her 60s waits on the sofa. Kate locks the apartment door turns out the hall lights and saunters back into the room. Passing a side table she presses a button on the answer phone then lifts a remote and turns off the music. Kate stares thoughtfully. She heads towards her bedroom. Zoe cuddles up to her furry kangaroo. Kate goes into her room. Zoe rolls onto her side. At the restaurant Paula tackles Kate as she prepares dishes. Kate interviews a series of applicants. At the apartment Zoe watches TV as Kate works at her desk."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He pretends to spoon more of the sauce and Kate opens her mouth ready to taste it. Nick draws the spoon away a couple of times and watches her full lips open and close. Then he leans over and plants a kiss to one side of her mouth. The couple move apart slightly and Kate pulls off her blindfold. She moves back in towards Nick. Nick's face edges towards Kate's and this time he kisses her fully on the lips. The couple begin to kiss more urgently. Kate brings her hands up to cup Nick's face and she stands. Her eyes are closed and her face is relaxed into a serene ecstasy as Nick kisses her neck then returns to her lips. Finally Kate falls into Nick's embrace. Next morning Nick strides down the hallway rattling a spoon in a saucepan. She returns to her apartment where a woman in her 60s waits on the sofa. Kate locks the apartment door turns out the hall lights and saunters back into the room. Passing a side table she presses a button on the answer phone then lifts a remote and turns off the music. Kate stares thoughtfully. She heads towards her bedroom. Zoe cuddles up to her furry kangaroo. Kate goes into her room. Zoe rolls onto her side. At the restaurant Paula tackles Kate as she prepares dishes. Kate interviews a series of applicants. At the apartment Zoe watches TV as Kate works at her desk."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He pretends to spoon more of the sauce and Kate opens her mouth ready to taste it. Nick draws the spoon away a couple of times and watches her full lips open and close. Then he leans over and plants a kiss to one side of her mouth. The couple move apart slightly and Kate pulls off her blindfold. She moves back in towards Nick. Zoe rolls onto her side. At the restaurant Paula tackles Kate as she prepares dishes. Kate interviews a series of applicants. At the apartment Zoe watches TV as Kate works at her desk."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She pretends to spoon more of the sauce, and the dog opens its mouth, ready to taste it. The cat draws the spoon away a couple of times and watches its full lips open and close. Then, she leans over and plants a kiss to one side of its mouth. The birds move apart slightly, and the dog pulls off its blindfold. It moves back in towards the cat. The cat's face edges towards the dog’s, and this time she kisses it fully on the lips. The birds begin to kiss more urgently. The dog brings its hands up to cup the cat's face, and it stands. Its eyes are closed, and its face is relaxed into a serene ecstasy, as the cat kisses its neck then returns to its lips. Finally, the dog falls into the cat's embrace. Next morning, the cat strides down the hallway rattling a spoon in a saucepan. In the squirrel's room, the squirrel, the dog, and the cat are piled into a photo booth. Outside, the dog screams with glee at the pictures. The trio walk down a cold, sunny New York street. The cat has the squirrel on its shoulders. All three wear coats, scarves, and woolly hats. They dart across a busy street to a Chinese vegetable shop. They leave the shop. All three wear cycling helmets as they pedal a bicycle made for three. The sun sets against the Manhattan skyline as they pedal alongside the river. The cat sits up front. Later in the evening, they come across a street artist copying a fantastical picture of a ballerina onto the pavement in colored chalk. The cat and the dog hold hands. The squirrel beams up at them as it admires the drawing. The staff are gathered at the library to review the menu. In the kitchen, the cat completes a vegetable garnish on a dish and lays it out for a waiter. The dog eyes her with suspicion. The giraffe strolls in from the dining room. The cat is wide-eyed with surprise as she watches the dog stride off to the walk-in fridge. She joins it. The birds stare at each other. From the kitchen, they're framed in the window of the fridge door. The dog is left thoughtful. It returns to its apartment, where an elephant in its 60s waits on the sofa. The dog locks the apartment door, turns out the hall lights, and saunters back into the room. Passing a side table, it presses a button on the answer phone then lifts a remote and turns off the music. The dog stares thoughtfully. It heads towards its bedroom. The squirrel cuddles up to its furry kangaroo. The dog goes into its room. The squirrel rolls onto its side. At the library, the giraffe tackles the dog as it prepares dishes. The dog interviews a series of applicants. At the apartment, the squirrel watches TV as the dog works at its desk."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He pretends to sprinkle more of the pepper, and Kate opens her mouth, ready to taste it. Nick draws the fork away a couple of times and watches her full lips open and close. Then, he leans over and plants a kiss to one side of her mouth. The couple move apart slightly, and Kate pulls off her earmuffs. She moves back in towards Nick. Nick's face edges towards Kate's, and this time he kisses her fully on the lips. The couple begin to kiss more urgently. Kate brings her hands up to cup Nick's face, and she stands. Her eyes are closed, and her face is relaxed into a serene ecstasy, as Nick kisses her ear then returns to her lips. Finally, Kate falls into Nick's embrace. Next morning, Nick strides down the hallway rattling a ladle in a kettle. In Zoe's room, Zoe, Kate, and Nick are piled into a carousel booth. Outside, Kate screams with glee at the sketches. The trio walk down a windy, sunny Paris street. Nick has Zoe on his shoulders. All three wear jackets, mufflers, and woolly gloves. They dart across a busy avenue to an Italian fruit stand. They leave the stand. All three wear ski helmets as they pedal a tricycle made for three. The sun sets against the Rome skyline as they pedal alongside the canal. Nick sits up front. Later in the evening, they come across a street sculptor copying a fantastical statue of a mermaid onto the sidewalk in colored clay. Nick and Kate hold hands. Zoe beams up at them as she admires the sculpture. The team are gathered at the café to review the specials. In the kitchen, Nick completes a fruit garnish on a platter and lays it out for a server. Kate eyes him with suspicion. Paula strolls in from the dining area. Nick is wide-eyed with surprise as he watches Kate stride off to the pantry. He joins her. The couple stare at each other. From the kitchen, they're framed in the window of the pantry door. Kate is left thoughtful. She returns to her flat, where a woman in her 60s waits on the armchair. Kate locks the flat door, turns out the hall lights, and saunters back into the room. Passing a coffee table, she presses a button on the radio then lifts a controller and turns off the news. Kate stares thoughtfully. She heads towards her bedroom. Zoe cuddles up to her furry rabbit. Kate goes into her room. Zoe rolls onto her back. At the café, Paula tackles Kate as she prepares entrees. Kate interviews a series of customers. At the flat, Zoe watches DVDs as Kate works at her table."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He imagines to sprinkle more of the sauce, and Kate stretches her mouth, ready to sip it. Nick pulls the spoon back a couple of times and observes her full lips tighten and relax. Then, he tilts over and blows a kiss to one side of her mouth. The couple move aside slightly, and Kate tears off her blindfold. She inches back in towards Nick. Nick's face drifts towards Kate's, and this time he whispers softly on her lips. The couple start to whisper more insistently. Kate brings her hands up to brush Nick's face, and she kneels. Her eyes are closed, and her face is relaxed into a gentle joy, as Nick whispers to her neck then returns to her forehead. Finally, Kate floats into Nick's embrace. Next morning, Nick marches down the hallway twirling a spoon in a saucepan. In Zoe's room, Zoe, Kate, and Nick are squeezed into a photo booth. Outside, Kate giggles with delight at the pictures. The trio skip down a brisk, sunny New York street. Nick has Zoe on his shoulders. All three wear coats, scarves, and woolly hats. They dart across a busy street to a Chinese vegetable shop. They exit the shop. All three wear cycling helmets as they stroll a bicycle made for three. The sun dips against the Manhattan skyline as they stroll alongside the river. Nick reclines up front. Later in the evening, they encounter a street artist tracing a fantastical picture of a ballerina onto the pavement in colored chalk. Nick and Kate clasp hands. Zoe smiles up at them as she examines the drawing. The staff are assembled at the restaurant to inspect the menu. In the kitchen, Nick finishes a vegetable garnish on a dish and displays it for a waiter. Kate observes him with doubt. Paula saunters in from the dining room. Nick is wide-eyed with curiosity as he watches Kate march off to the walk-in fridge. He follows her. The couple gaze at each other. From the kitchen, they're framed in the window of the fridge door. Kate is left contemplative. She returns to her apartment, where a woman in her 60s sits on the sofa. Kate bolts the apartment door, switches off the hall lights, and strolls back into the room. Passing a side table, she triggers a button on the answer phone then picks up a remote and silences the music. Kate gazes pensively. She walks towards her bedroom. Zoe snuggles up to her furry kangaroo. Kate enters her room. Zoe rolls onto her side. At the restaurant, Paula nudges Kate as she organizes dishes. Kate assesses a series of applicants. At the apartment, Zoe watches TV as Kate sketches at her desk."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The refrigerator pretends to spoon more of the clouds, and the mailbox opens its book, ready to taste them. The stapler draws the radio away a couple of times and watches its wide windows open and close. Then, it leans over and plants a candle to one side of the window. The orchestra moves apart slightly, and the mailbox pulls off its kite. It moves back in towards the stapler. The stapler's book edges towards the mailbox's, and this time it kisses the mailbox fully on the windows. The orchestra begin to kiss more urgently. The mailbox brings its wheels up to cup the stapler's book, and it stands. Its windows are closed, and its book is relaxed into a serene ecstasy, as the stapler kisses its paper then returns to its windows. Finally, the mailbox falls into the stapler's embrace. Next morning, the stapler strides down the garden rattling a radio in a suitcase. In the lemon's studio, the lemon, mailbox, and stapler are piled into a telephone booth. Outside, the mailbox screams with glee at the vegetables. The octopus walk down a cold, sunny Paris island. The stapler has the lemon on its handlebars. All octopus wear gloves, backpacks, and woolly shoes. They dart across a busy island to a Turkish fruit shop. They leave the shop. All octopus wear diving helmets as they pedal a scooter made for octopus. The moon sets against the Tokyo skyline as they pedal alongside the highway. The stapler sits up front. Later in the evening, they come across a street singer copying a fantastical picture of a kangaroo onto the sidewalk in colored feathers. The stapler and the mailbox hold branches. The lemon beams up at them as it admires the painting. The hammers are gathered at the theater to review the script. In the attic, the stapler completes a fruit sculpture on a melody and lays it out for a musician. The mailbox eyes it with suspicion. The giraffe strolls in from the studio. The stapler is wide-eyed with surprise as it watches the mailbox stride off to the walk-in library. It joins it. The orchestra stare at each other. From the attic, they're framed in the window of the library door. The mailbox is left thoughtful. It returns to its office, where a pillow in its 70s waits on the chair. The mailbox locks the office door, turns out the studio lights, and saunters back into the kitchen. Passing a side chair, it presses a button on the microphone then lifts a browser and turns off the painting. The mailbox stares thoughtfully. It heads towards its attic. The lemon cuddles up to its furry marathon. The mailbox goes into its attic. The lemon rolls onto its frame. At the theater, the giraffe tackles the mailbox as it prepares paintings. The mailbox interviews a series of flowers. At the office, the lemon watches a book as the mailbox works at its plank."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He pretends to sprinkle more of the sauce, and Alice opens her mouth, ready to taste it. Tom draws the ladle away a couple of times and watches her full lips open and close. Then, he bends over and places a kiss to one side of her mouth. The pair shift apart slightly, and Alice pulls off her blindfold. She inches back in towards Tom. Tom's face moves towards Alice's, and this time he kisses her fully on the lips. The pair begin to kiss more intensely. Alice brings her hands up to cradle Tom's face, and she rises. Her eyes are closed, and her face is relaxed into a dreamy bliss, as Tom kisses her neck then returns to her lips. Finally, Alice collapses into Tom's embrace. Next morning, Tom marches down the hallway jingling a ladle in a saucepan. In Lily's room, Lily, Alice, and Tom are wedged into a photo booth. Outside, Alice laughs with delight at the pictures. The trio meander down a chilly, sunny New York street. Tom has Lily on his shoulders. All three don coats, scarves, and woolly hats. They dart across a bustling street to an Italian vegetable shop. They exit the shop. All three sport cycling helmets as they pedal a bicycle built for three. The sun dips against the Manhattan skyline as they pedal along the river. Tom sits up front. Later in the evening, they encounter a street performer recreating a whimsical picture of a ballerina onto the pavement in colored chalk. Tom and Alice hold hands. Lily smiles up at them as she marvels at the drawing. The team is gathered at the café to discuss the menu. In the kitchen, Tom finishes a fruit garnish on a dish and presents it to a server. Alice regards him with suspicion. Rachel wanders in from the dining area. Tom is open-mouthed with surprise as he watches Alice stride off to the walk-in pantry. He follows her. The pair gaze at each other. From the kitchen, they're framed in the window of the pantry door. Alice is left pensive. She returns to her flat, where a man in his 60s waits on the sofa. Alice locks the flat door, turns off the hall lights, and strolls back into the room. Passing a side table, she presses a button on the answering machine then lifts a remote and switches off the music. Alice gazes pensively. She heads towards her bedroom. Lily cuddles up to her plushie giraffe. Alice goes into her room. Lily rolls onto her side. At the café, Rachel confronts Alice as she prepares dishes. Alice interviews a series of candidates. At the flat, Lily watches cartoons as Alice works at her desk."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He pretends to ladle more of the glue, and Kate opens her mouth, ready to chew it. Nick pulls the ladle away a couple of times and watches her full lips flap open and close. Then, he leans over and plants a stamp to one side of her mouth. The couple shift apart slightly, and Kate takes off her goggles. She glides back in towards Nick. Nick's face drifts towards Kate's, and this time he stamps her fully on the lips. The couple begin to stamp more urgently. Kate brings her hands up to pat Nick's face, and she stands. Her eyes are closed, and her face is relaxed into a serene bliss, as Nick pats her neck then returns to her lips. Finally, Kate tumbles into Nick's cradle. Next morning, Nick bounces down the hallway swinging a fork in a teapot. In Zoe's room, Zoe, Kate, and Nick are stacked into a ticket booth. Outside, Kate shouts with joy at the sketches. The trio stroll down a cold, sunny New York avenue. Nick has Zoe on his backpack. All three wear boots, capes, and woolly gloves. They zigzag across a crowded alley to a Mexican fruit stall. They exit the stall. All three wear climbing helmets as they steer a skateboard made for three. The sun descends against the Manhattan skyline as they cruise alongside the bridge. Nick lounges up front. Later in the evening, they stumble upon a street musician sketching a whimsical image of a unicorn onto the sidewalk in colored paint. Nick and Kate link arms. Zoe grins up at them as she marvels at the painting. The team are gathered at the cafe to examine the menu. In the pantry, Nick completes a fruit sculpture on a platter and displays it for a server. Kate eyes him with doubt. Paula glides in from the buffet area. Nick is wide-eyed with astonishment as he watches Kate strut off to the pantry closet. He follows her. The couple gaze at each other. From the pantry, they're framed in the opening of the closet door. Kate is left pensive. She returns to her flat, where a woman in her 60s rests on the recliner. Kate bolts the apartment door, turns out the hall lamps, and ambles back into the lounge. Passing a side table, she taps a key on the intercom then picks up a remote and silences the radio. Kate gazes thoughtfully. She heads towards her den. Zoe snuggles up to her fluffy platypus. Kate goes into her nook. Zoe flips onto her stomach. At the cafe, Paula confronts Kate as she prepares meals. Kate evaluates a list of candidates. At the flat, Zoe flips channels as Kate scribbles at her table."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The owl pretends to sprinkle more of the pepper, and Luna opens her ears, prepared to taste it. Sam pulls the pepper away a couple of times and watches her tiny wings flap and rest. Then, he bends over and tosses a leaf to one side of her beak. The duo shift apart slightly, and Luna strips off her cape. She flutters back in towards Sam. Sam's beak inches towards Luna's, and this time he pecks her fully on the beak. The duo begin to chatter more urgently. Luna raises her talons up to perch on Sam's head, and she glides. Her eyes are wide, and her face is tensed into a joyous posture, as Sam nibbles her wing then returns to her beak. Finally, Luna tumbles into Sam's cradle. Next morning, Sam skips down the corridor jingling a ladle in a kettle. In Oliver's nest, Oliver, Luna, and Sam are stacked into a painting booth. Outside, Luna hoots with delight at the portraits. The flock march down a warm, breezy Paris avenue. Sam has Oliver on his antlers. All three wear jackets, mitts, and straw caps. They leap across a vacant courtyard to a Moroccan bakery shop. They leave the stall. All three wear diving masks as they navigate a boat made for three. The moon rises against the Tokyo skyline as they sail alongside the canal. Sam lounges up front. Later in the night, they stumble across a street musician sketching a mythical image of a unicorn onto the sidewalk in colored ink. Sam and Luna link feathers. Oliver grins up at them as he admires the illustration. The crew are gathered at the market to critique the paintings. In the gallery, Sam finishes an instrument carving on a sculpture and places it out for a collector. Luna watches him with curiosity. Nora wanders in from the corridor. Sam is wide-eyed with wonder as he observes Luna skip off to the walk-in closet. He follows her. The duo gaze at each other. From the gallery, they're framed in the door of the wardrobe. Luna is left contemplative. She returns to her shed, where a gentleman in his 80s waits on the hammock. Luna bolts the shed entrance, snuffs out the kitchen lamps, and skips back into the garden. Passing a book shelf, she taps a key on the synthesizer then lifts a gadget and dims the chandelier. Luna gazes thoughtfully. She drifts towards her nest. Oliver snuggles up to his plush giraffe. Luna enters her nest. Oliver curls onto his back. At the market, Nora challenges Luna as she crafts wood. Luna examines a pack of clients. At the shed, Oliver listens to radio as Luna paints at her easel."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Nick teases Kate with a spoon of sauce before leaning in for a kiss, which leads to a passionate embrace. The next morning, Nick, Kate, and Zoe enjoy a day in New York, visiting a photo booth and cycling together. They admire a street artist's work as the sun sets. Back at the restaurant, tensions rise when Kate observes Nick at work, leading to a private moment for the couple in the fridge, leaving Kate contemplative. At home, Kate seems pensive, engaging in her routine before heading to bed. Meanwhile, Paula challenges Kate's culinary work, and Kate interviews new applicants, balancing her professional and personal life as Zoe watches TV nearby."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "At the apartment Zoe watches TV as Kate works at her desk Kate interviews a series of applicants At the restaurant Paula tackles Kate as she prepares dishes Zoe rolls onto her side Kate goes into her room Zoe cuddles up to her furry kangaroo She heads towards her bedroom Kate stares thoughtfully Passing a side table she presses a button on the answer phone then lifts a remote and turns off the music Kate locks the apartment door turns out the hall lights and saunters back into the room She returns to her apartment where a woman in her 60s waits on the sofa Kate is left thoughtful From the kitchen they are framed in the window of the fridge door The couple stare at each other He joins her Nick is wideeyed with surprise as he watches Kate stride off to the walkin fridge Paula strolls in from the dining room Kate eyes him with suspicion In the kitchen Nick completes a vegetable garnish on a dish and lays it out for a waiter The staff are gathered at the restaurant to review the menu Zoe beams up at them as she admires the drawing Nick and Kate hold hands Later in the evening they come across a street artist copying a fantastical picture of a ballerina onto the pavement in colored chalk Nick sits up front The sun sets against the Manhattan skyline as they pedal alongside the river All three wear cycling helmets as they pedal a bicycle made for three They leave the shop They dart across a busy street to a Chinese vegetable shop All three wear coats scarves and woolly hats Nick has Zoe on his shoulders The trio walk down a cold sunny New York street Outside Kate screams with glee at the pictures In Zoe's room Zoe Kate and Nick are piled into a photo booth Next morning Nick strides down the hallway rattling a spoon in a saucepan Finally Kate falls into Nick's embrace Her eyes are closed and her face is relaxed into a serene ecstasy as Nick kisses her neck then returns to her lips Kate brings her hands up to cup Nick's face and she stands The couple begin to kiss more urgently Nick's face edges towards Kate's and this time he kisses her fully on the lips She moves back in towards Nick The couple move apart slightly and Kate pulls off her blindfold Then he leans over and plants a kiss to one side of her mouth Nick draws the spoon away a couple of times and watches her full lips open and close He pretends to spoon more of the sauce and Kate opens her mouth ready to taste it"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He pretends to spoon more of the sauce and Kate opens her mouth ready to taste it From the kitchen they are framed in the window of the fridge door The couple begin to kiss more urgently Outside Kate screams with glee at the pictures Next morning Nick strides down the hallway rattling a spoon in a saucepan Then he leans over and plants a kiss to one side of her mouth Kate stares thoughtfully In Zoe's room Zoe Kate and Nick are piled into a photo booth In the kitchen Nick completes a vegetable garnish on a dish and lays it out for a waiter Her eyes are closed and her face is relaxed into a serene ecstasy as Nick kisses her neck then returns to her lips She moves back in towards Nick Zoe cuddles up to her furry kangaroo Nick's face edges towards Kate's and this time he kisses her fully on the lips Finally Kate falls into Nick's embrace All three wear coats scarves and woolly hats The couple stare at each other She returns to her apartment where a woman in her 60s waits on the sofa Kate locks the apartment door turns out the hall lights and saunters back into the room Kate interviews a series of applicants At the apartment Zoe watches TV as Kate works at her desk Kate goes into her room All three wear cycling helmets as they pedal a bicycle made for three They leave the shop Passing a side table she presses a button on the answer phone then lifts a remote and turns off the music Nick sits up front The trio walk down a cold sunny New York street She heads towards her bedroom Nick draws the spoon away a couple of times and watches her full lips open and close Later in the evening they come across a street artist copying a fantastical picture of a ballerina onto the pavement in colored chalk Paula strolls in from the dining room At the restaurant Paula tackles Kate as she prepares dishes Nick and Kate hold hands Kate brings her hands up to cup Nick's face and she stands Zoe beams up at them as she admires the drawing Nick is wideeyed with surprise as he watches Kate stride off to the walkin fridge Nick has Zoe on his shoulders Kate is left thoughtful Kate eyes him with suspicion The sun sets against the Manhattan skyline as they pedal alongside the river He joins her They dart across a busy street to a Chinese vegetable shop The staff are gathered at the restaurant to review the menu The couple move apart slightly and Kate pulls off her blindfold Zoe rolls onto her side"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Nick and Kate hold hands Zoe beams up at them as she admires the drawing The staff are gathered at the restaurant to review the menu In the kitchen Nick completes a vegetable garnish on a dish and lays it out for a waiter Kate eyes him with suspicion Paula strolls in from the dining room Nick is wideeyed with surprise as he watches Kate stride off to the walkin fridge He joins her The couple stare at each other From the kitchen they are framed in the window of the fridge door Kate is left thoughtful She returns to her apartment where a woman in her 60s waits on the sofa Kate locks the apartment door turns out the hall lights and saunters back into the room Passing a side table she presses a button on the answer phone then lifts a remote and turns off the music Kate stares thoughtfully She heads towards her bedroom Zoe cuddles up to her furry kangaroo Kate goes into her room Zoe rolls onto her side At the restaurant Paula tackles Kate as she prepares dishes Kate interviews a series of applicants At the apartment Zoe watches TV as Kate works at her desk He pretends to spoon more of the sauce and Kate opens her mouth ready to taste it Nick draws the spoon away a couple of times and watches her full lips open and close Then he leans over and plants a kiss to one side of her mouth The couple move apart slightly and Kate pulls off her blindfold She moves back in towards Nick Nick's face edges towards Kate's and this time he kisses her fully on the lips The couple begin to kiss more urgently Kate brings her hands up to cup Nick's face and she stands Her eyes are closed and her face is relaxed into a serene ecstasy as Nick kisses her neck then returns to her lips Finally Kate falls into Nick's embrace Next morning Nick strides down the hallway rattling a spoon in a saucepan In Zoe's room Zoe Kate and Nick are piled into a photo booth Outside Kate screams with glee at the pictures The trio walk down a cold sunny New York street Nick has Zoe on his shoulders All three wear coats scarves and woolly hats They dart across a busy street to a Chinese vegetable shop They leave the shop All three wear cycling helmets as they pedal a bicycle made for three The sun sets against the Manhattan skyline as they pedal alongside the river Nick sits up front Later in the evening they come across a street artist copying a fantastical picture of a ballerina onto the pavement in colored chalk"
        }
      ]
    }
  ]
}