{
  "ground_truth": "Zoe returns to watching the black-and-white gangster movie on the TV, her eyes darting around as she thinks. Suddenly, she rises resolutely from the sofa, strides out of the open-plan lounge and down the hallway, past the double doors opening onto Kate's desk, ignoring Kate, who remains at her desk. In her room, Zoe sits on her bed with a scarlet-haired smiling rag doll resting on her drawn-up knees, pulls up the doll's striped skirt and red polka dot top, considers the words with downcast eyes, then replaces the doll's clothing, and stares into the doll's face. Wearing a white dressing gown and with damp hair, Kate strides down the hallway and is later outside Zoe's school. They drive around in Nick's blue pickup truck, and Kate holds her hand to her mouth, runs her hand through her hair, moves around to the side of Zoe's bed, catching sight of the cuddly toys on her pillow, considers them briefly, then picks up the furry kangaroo. They drive past leafless trees into the bleak, deserted cemetery, where Zoe returns the hug that Kate has given her. Both crying, Kate kisses Zoe's cheek and gently wipes away her tears before the pair separate. Zoe mouths an acknowledgment, then turns to pick up her red rucksack, and they stand. Kate brushes off her long, black coat and takes Zoe's hand as they walk away from the grave towards Nick, who's been watching from a distance. Amid the faded flowers on the grave is Zoe's peacock feather, fluttering in the breeze. Nick drives Zoe and Kate home, and as he pulls up, Zoe turns to him. Kate and Zoe climb out of the truck, and Kate hands her the keys. Nick offers his hand, which Kate takes, her eyes fixing longingly on him. Nick squeezes her hand, she pulls away, closes the door, and looks at Nick through the window. Kate stands alone in the sunlit street as a truck drives away. In the busy restaurant kitchen, Bernadette reenters, and brandishing an uncooked steak held high on a carving fork, Kate marches out of the kitchen through the dining room and up to table seven. Kate tears off her apron, thrusts it at a waiter, and strides out. Paula stares blankly as Kate hails a cab and gets in. On her therapist's roof terrace overlooking Manhattan, Kate turns and eyes the man with realization. In a shabby elevator, Kate clutches a copper saucepan wrapped in a tea towel, steps out onto a landing lined with a discarded metal trolley and window grill, hesitates, then knocks. Without taking his eyes off Kate, Nick steps back from the door, revealing an open-plan loft apartment beyond.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Zoe returns to observing the black-and-white mobster film on the TV, her eyes flicking around as she contemplates. Suddenly, she rises determinedly from the sofa, strides out of the open-plan lounge and down the corridor, past the double doors opening onto Kate's desk, disregarding Kate, who remains at her desk. In her room, Zoe sits on her bed with a scarlet-haired smiling rag doll resting on her drawn-up knees, pulls up the doll's striped skirt and red polka dot top, examines the letters with downcast eyes, then replaces the doll's apparel, and gazes into the doll's face. Wearing a white dressing gown and with damp hair, Kate strides down the corridor and is later outside Zoe's school. They drive around in Nick's blue pickup truck, and Kate holds her hand to her mouth, runs her hand through her hair, moves around to the side of Zoe's bed, catching sight of the cuddly toys on her pillow, considers them briefly, then picks up the furry kangaroo. They drive past leafless trees into the bleak, deserted graveyard, where Zoe returns the embrace that Kate has given her. Both weeping, Kate kisses Zoe's cheek and gently wipes away her tears before the pair part. Zoe mouths an acknowledgment, then turns to pick up her red rucksack, and they stand. Kate brushes off her long, black coat and takes Zoe's hand as they walk away from the grave towards Nick, who's been observing from a distance. Amid the faded flowers on the grave is Zoe's peacock plume, fluttering in the breeze. Nick drives Zoe and Kate home, and as he pulls up, Zoe turns to him. Kate and Zoe climb out of the truck, and Kate hands her the keys. Nick offers his hand, which Kate takes, her eyes fixing yearningly on him. Nick squeezes her hand, she pulls away, closes the door, and looks at Nick through the window. Kate stands alone in the sunlit street as a truck drives away. In the busy restaurant kitchen, Bernadette reenters, and brandishing an uncooked steak held high on a carving fork, Kate marches out of the kitchen through the dining room and up to table seven. Kate tears off her apron, thrusts it at a waiter, and strides out. Paula stares blankly as Kate hails a cab and gets in. On her therapist's roof terrace overlooking Manhattan, Kate turns and eyes the man with realization. In a shabby elevator, Kate clutches a copper saucepan wrapped in a tea towel, steps out onto a landing lined with a discarded metal cart and window grill, hesitates, then knocks. Without taking his eyes off Kate, Nick steps back from the door, revealing an open-plan loft apartment beyond."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Watching the black-and-white gangster movie on the TV is returned to by Zoe, her eyes darting around as thoughts occupy her mind. Suddenly, the sofa is resolutely risen from by her, and the open-plan lounge is strode out of by her, moving down the hallway, past the double doors that open onto Kate's desk, ignoring Kate, who stays at her desk. In her room, the bed is sat on by Zoe with a scarlet-haired smiling rag doll resting on her drawn-up knees, the doll's striped skirt and red polka dot top are pulled up by her, and with downcast eyes, the words are considered by her, then the doll's clothing is replaced by her, and the doll's face is stared into by her. Wearing a white dressing gown and with damp hair, Kate strides down the hallway and later stands outside Zoe's school. In Nick's blue pickup truck, they are driven around, and Kate holds her hand to her mouth, runs her hand through her hair, moving around to Zoe's bed's side, sighting the cuddly toys on her pillow, considering them briefly, then the furry kangaroo is picked up by her. They pass leafless trees into the bleak, deserted cemetery, where Kate gives Zoe a hug that is returned by Zoe. Both crying, Zoe’s cheek is kissed by Kate, who gently wipes away her tears before the pair separates. An acknowledgment is mouthed by Zoe, then she turns to pick up her red rucksack, and they stand. The long, black coat is brushed off by Kate, and Zoe's hand is taken by her as they walk away from the grave towards Nick, who watches from a distance. Amid the faded flowers on the grave, Zoe has left her peacock feather fluttering in the breeze. Zoe and Kate are driven home by Nick, and as the truck is pulled up by him, Zoe turns to him. The truck is climbed out of by Kate and Zoe, and the keys are handed to Zoe by Kate. Nick offers his hand, which is taken by Kate, her eyes longing for him. Her hand is squeezed by Nick, she pulls away, the door is closed, and Nick is looked at through the window by her. Alone in the sunlit street, Kate stands as a truck is driven away. In the busy restaurant kitchen, Bernadette reenters, and with an uncooked steak brandished high on a carving fork, the kitchen is marched out of by Kate through the dining room and up to table seven. Her apron is torn off by Kate, thrusting it at a waiter, and the restaurant is strode out of by her. Paula stares blankly as a cab is hailed by Kate, who gets in. On her therapist's roof terrace overlooking Manhattan, Kate turns and eyes the man with realization. In a shabby elevator, Kate clutches a copper saucepan wrapped in a tea towel, stepping out onto a landing lined with a discarded metal trolley and window grill, hesitating, then knocking. Without taking his eyes off Kate, the door is stepped back from by Nick, revealing an open-plan loft apartment beyond."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Zoe resumes watching the black-and-white gangster film, her eyes darting as she thinks. Suddenly, she rises, strides out of the lounge and down the hallway, passing Kate's desk without a glance. In her room, Zoe sits with a rag doll on her knees, lifts its striped skirt and red top, considers the words, then dresses the doll and gazes at its face. Wearing a white gown with damp hair, Kate later stands outside Zoe's school. They drive in Nick's blue pickup, and Kate runs her hand through her hair, moves to Zoe's bed, sees the cuddly toys, and picks up a kangaroo. They pass leafless trees to a deserted cemetery, where Zoe hugs Kate. Both cry as Kate kisses Zoe's cheek and wipes her tears before separating. Zoe acknowledges, picks up her red rucksack, and they stand. Kate brushes off her coat and takes Zoe's hand as they walk to Nick, who watches from afar. Among faded flowers on the grave is Zoe's peacock feather. Nick drives them home, and Zoe turns to him as they arrive. Kate and Zoe exit, and Kate gives her the keys. Nick offers his hand, which Kate takes, her eyes longing. Nick squeezes her hand, Kate pulls away, closes the door, and looks through the window. Kate stands alone as the truck departs. In a restaurant kitchen, Bernadette reenters, and Kate, holding a steak on a fork, marches to table seven. She tears off her apron, thrusts it at a waiter, and leaves. Paula stares as Kate hails a cab. On her therapist's terrace, Kate eyes the man with realization. In an elevator, Kate clutches a saucepan wrapped in a towel, steps onto a landing with a trolley, hesitates, then knocks. Nick steps back, revealing a loft apartment."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Zoe watches a black-and-white gangster movie, then decisively leaves the lounge, passing Kate at her desk. In her room, Zoe sits with a red-haired rag doll, adjusts its clothing, and stares at its face. Kate, in a white robe with damp hair, later stands outside Zoe's school. They drive in Nick's blue pickup, with Kate briefly examining Zoe's toys before picking up a kangaroo. Passing leafless trees, they arrive at a cemetery, where Zoe hugs Kate. Both crying, Kate kisses Zoe and wipes her tears. Zoe retrieves her red rucksack, and they stand to leave. Kate brushes her coat and holds Zoe's hand as they walk to Nick, who observes. A peacock feather flutters on the grave. Nick drives them home; Zoe turns to him as they arrive. Zoe and Kate exit the truck, and Kate gives Zoe the keys. Nick offers his hand, which Kate briefly holds, then looks at him through the window as she stands alone on the street. In a bustling restaurant kitchen, Kate marches out with an uncooked steak to table seven, discards her apron, and leaves. Paula watches as Kate hails a cab. On her therapist's Manhattan terrace, Kate looks at a man with realization. In a shabby elevator, Kate carries a wrapped copper saucepan, exits onto a landing, hesitates, and knocks. Nick, without looking away, steps back from the open door, revealing a loft apartment inside."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Zoe returns her attention to watching the black-and-white gangster movie playing on the TV screen. Her eyes dart around the room as she becomes lost in thought. Suddenly, she rises with determination from the comfortable sofa and strides purposefully out of the open-plan lounge. She moves briskly down the hallway, passing by the double doors that open onto Kate's desk. She deliberately ignores Kate, who remains focused and immersed in her work at her desk. Once inside her room, Zoe sits quietly on her bed. She holds a scarlet-haired rag doll that smiles gently, resting it on her drawn-up knees. Zoe carefully pulls up the doll's striped skirt and red polka dot top. She considers the words thoughtfully with her eyes cast down, before replacing the doll's clothing and staring thoughtfully into its face. Meanwhile, Kate, wearing a white dressing gown and with her hair still damp, strides purposefully down the hallway and soon finds herself outside Zoe’s school. They drive around together in Nick's blue pickup truck. Kate, feeling a mix of emotions, holds her hand to her mouth, runs her fingers anxiously through her hair, and then moves to the side of Zoe's bed. She catches sight of the array of cuddly toys adorning the pillow, considers them for a brief moment, and then picks up the furry kangaroo. They drive past the leafless trees into the bleak, deserted cemetery, and there, Zoe returns the heartfelt hug that Kate gives her. Tears in their eyes, both Kate and Zoe cry, and Kate lovingly kisses Zoe’s cheek. She gently wipes away her daughter’s tears before they reluctantly separate. Zoe mouths an acknowledgment to her mother, then turns to pick up her trusty red rucksack, and together, they stand up. Kate brushes off her long, black coat and takes Zoe's hand warmly as they walk away from the grave towards Nick, who has been watching them quietly from a distance. Amidst the faded flowers lying on the grave is Zoe's precious peacock feather, fluttering softly in the gentle breeze. Nick drives Zoe and Kate home, and as he carefully pulls up to a stop, Zoe turns toward him. Kate and Zoe climb out of the truck, and Kate hands Zoe the keys. Nick offers his hand, which Kate accepts, her eyes lingering longingly on him. Nick gives her hand a reassuring squeeze, then she gently pulls away, closes the door, and looks back at Nick through the window. Kate remains standing alone in the sunlit street as the truck drives away. In the bustling restaurant kitchen, Bernadette reenters, and with an uncooked steak held high on a carving fork, Kate marches determinedly out of the kitchen, through the crowded dining room, and approaches table seven boldly. Kate dramatically tears off her apron and thrusts it into the hands of a nearby waiter before striding out. Paula stares blankly, taken aback, as Kate decisively hails a cab and gets inside. On her therapist's serene roof terrace overlooking the vast expanse of Manhattan, Kate turns and looks at the man with a newfound realization. In a shabby, worn-down elevator, Kate clutches a copper saucepan carefully wrapped in a tea towel. She steps out onto a landing lined with a discarded metal trolley and window grill, hesitates for a moment, then decides to knock. Without taking his eyes off of Kate, Nick steps back from the door, revealing the open-plan loft apartment that lies beyond."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Zoe redirects her focus to the black-and-white gangster movie playing prominently on the TV screen in front of her. Her eyes, however, furtively scan the room as she drifts into her own world of thoughts. In an instant, she rises with a sense of determination from the inviting and plush sofa, striding purposefully out of the open-plan lounge area. She moves with brisk energy down the hallway, passing by the double doors that reveal a view of Kate's desk. She makes the deliberate choice to disregard Kate's presence, as Kate remains intently focused, fully immersed in her work at her desk. Once she reaches the privacy of her own room, Zoe settles quietly on her bed. She cradles a scarlet-haired rag doll with a gentle smile, resting it comfortably on her drawn-up knees. With care, Zoe lifts the doll's striped skirt and red polka dot top, her eyes downward as she considers the words thoughtfully. Afterward, she replaces the doll's clothing and gazes contemplatively into its face.\n\nMeanwhile, Kate, dressed in a white dressing gown with her hair still damp from a recent wash, strides decisively down the hallway and soon finds herself standing outside Zoe’s school. Together, they take a drive in Nick's familiar blue pickup truck. As they drive, Kate, experiencing a swirl of emotions, presses her hand to her mouth, fingers running anxiously through her hair. She then moves to the side of Zoe's bed. As her eyes fall on the array of cuddly toys adorning the pillow, she pauses momentarily in contemplation, eventually picking up the soft furry kangaroo. They continue to drive past the stark, leafless trees into the somber, deserted confines of the cemetery, where Zoe gratefully returns the heartfelt hug Kate gives her. Tears fill their eyes as both Kate and Zoe cry together, and Kate lovingly plants a kiss on Zoe’s cheek. She wipes away her daughter’s tears with tenderness before they gently pull apart. Zoe mouths a silent acknowledgment to her mother, then turns to retrieve her trusty red rucksack, and together, they rise to their feet. Brushing off her long, black coat, Kate takes Zoe's hand warmly, and they walk away from the grave towards Nick, who has been quietly observing them from a distance. Amidst the faded flowers resting on the grave lies Zoe's cherished peacock feather, lightly fluttering in the gentle breeze. Nick, ever the careful driver, transports Zoe and Kate back home, pulling up to their stop. Zoe turns toward him as they come to a halt. Kate and Zoe exit the truck, and Kate hands the keys over to Zoe. Nick extends his hand, which Kate accepts, her gaze lingering with longing upon him. Nick gives her hand a reassuring squeeze, and then she gently releases it, closes the door, and looks back at Nick through the window. As the truck drives away, Kate is left standing alone in the sunlit street.\n\nBack in the bustling kitchen of the restaurant, Bernadette reenters the scene, and with an uncooked steak held aloft on a carving fork, Kate walks out with newfound determination through the crowded dining room, advancing boldly towards table seven. In a bold gesture, Kate dramatically removes her apron and thrusts it into the hands of a waiter nearby, before striding resolutely out. Paula watches with a blank stare, caught off guard, as Kate decisively hails a cab and steps inside. On the serene rooftop terrace of her therapist's office, overlooking the vast expanse of Manhattan, Kate turns to look at the man with a newfound realization dawning upon her. In a shabby, worn-down elevator, she carefully holds a copper saucepan wrapped protectively in a tea towel. She steps out onto a landing cluttered with a discarded metal trolley and window grill. Pausing momentarily in hesitation, she decides to knock. Without removing his eyes from Kate, Nick steps back from the door, revealing the open-plan loft apartment that extends beyond."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Zoe shifts her focus back to the black-and-white gangster movie playing on the TV, her eyes moving quickly as she processes her thoughts. Suddenly, with determination, she pushes herself up from the sofa and strides purposefully out of the open-plan lounge. She continues down the hallway, moving past the double doors that open onto Kate's desk, where Kate remains absorbed in her work and Zoe does not acknowledge her presence. Once in her room, Zoe lowers herself onto her bed and positions a smiling rag doll with scarlet hair on her knees, which are drawn up to her chest. She carefully raises the doll's striped skirt and red polka dot top, examines the hidden words with a pensive expression and downturned eyes, then gently replaces the doll's clothing and gazes searchingly into the doll's face. Meanwhile, wearing a white dressing gown and with her hair still damp, Kate strides briskly down the hallway and is seen later outside Zoe's school. As they drive around in Nick's blue pickup truck, Kate places a hand over her mouth in deep thought, runs her fingers through her hair, and makes her way to the side of Zoe's bed. She notices the cuddly toys scattered on the pillow, pauses to consider them, and then selects the furry kangaroo, holding it momentarily. They continue driving past barren, leafless trees into the somber, deserted cemetery, where Zoe returns the hug Kate gives her, both of them shedding tears. Kate kisses Zoe tenderly on the cheek and softly wipes away her tears before they part. Zoe silently mouths a word of acknowledgment, turns to pick up her red rucksack, and they both rise to their feet. Kate then brushes off her long, black coat and grasps Zoe's hand as they walk away from the grave towards Nick, who has been observing from afar. Among the wilted flowers on the grave, Zoe's peacock feather flutters gently in the breeze. Nick drives Zoe and Kate home, and as the vehicle comes to a stop, Zoe turns to look at him. Zoe and Kate exit the truck, and Kate passes her the keys. Nick extends his hand to Kate, which she accepts, her eyes locking onto his longingly. Nick gives her hand a reassuring squeeze before she gently withdraws, shuts the door, and looks back at Nick through the window. Standing alone on the sunlit street, Kate watches as the truck drives away. In the bustling restaurant kitchen, Bernadette enters once more, and Kate, holding an uncooked steak high on a carving fork, marches assertively out of the kitchen. She moves through the dining room and approaches table seven, where she removes her apron with a swift motion, thrusts it into a waiter's hands, and strides out confidently. Paula watches her with a blank expression as Kate steps outside, raises her arm to hail a cab, and climbs in. Up on her therapist's roof terrace, which offers a view of Manhattan, Kate turns, and with a dawning realization, her eyes meet the man's. In a shabby elevator, Kate clutches a copper saucepan wrapped snugly in a tea towel, steps out onto a landing cluttered with a discarded metal trolley and window grill, hesitates momentarily, and then knocks on the door. Without breaking his gaze from Kate, Nick steps back from the door, revealing the expansive open-plan loft apartment beyond."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Zoe returns to watching the black-and-white gangster movie on the TV, her thoughts evident in her darting eyes. Suddenly, she decisively leaves the lounge, striding past Kate, who is focused at her desk, without acknowledging her. In her room, Zoe sits on her bed with a rag doll, lifts and examines its clothing, then replaces them and stares into its face. Meanwhile, Kate, wearing a white dressing gown and with damp hair, later picks Zoe up from school. They drive in Nick's blue pickup truck, during which Kate, deep in thought, sits by Zoe's bed, briefly considering her cuddly toys before picking up a furry kangaroo. They then drive to a deserted cemetery, where they share a tearful embrace by the grave. Kate kisses Zoe's cheek, wipes her tears, and after a tender moment, they part. Zoe mouths an acknowledgment, picks up her red rucksack, and stands as Kate brushes off her coat and takes Zoe's hand to walk away toward Nick, who watches from a distance. Meanwhile, Zoe's peacock feather flutters among the faded grave flowers. Nick drives them home, and upon arrival, Zoe turns to him. After exiting the truck, Kate gives Zoe the keys; Nick offers his hand, which Kate takes, exchanging a long look before she pulls away, closes the door, and watches Nick drive off, standing alone in the street. Later, in the bustling restaurant kitchen, Bernadette reenters as Kate, holding an uncooked steak on a fork, marches out to table seven. She removes her apron, thrusts it at a waiter, and leaves, while Paula stares blankly as Kate hails a cab. On her therapist's Manhattan roof terrace, Kate has a moment of realization looking at a man. In a shabby elevator, she holds a copper saucepan, hesitates on the landing, and knocks at a door. Nick, without breaking eye contact, steps back to reveal the open-plan loft apartment beyond."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Zoe, drawn to the allure of classic cinema, returns to watching the black-and-white gangster movie on the TV, her eyes darting around as she thinks. Suddenly, she rises resolutely from the sofa, strides out of the open-plan lounge, which is designed to promote a sense of spaciousness, and down the hallway. She passes the double doors opening onto Kate's desk, which is cluttered with architectural sketches, ignoring Kate, who remains focused at her desk. In her room, Zoe sits on her bed with a scarlet-haired smiling rag doll, handcrafted by her grandmother, resting on her drawn-up knees. She pulls up the doll's striped skirt and red polka dot top, considers the words with downcast eyes, then replaces the doll's clothing and stares into the doll's face as if seeking comfort. Wearing a white dressing gown and with damp hair scented with lavender, Kate strides down the hallway and is later seen outside Zoe's school, a renowned institution for the arts. They drive around in Nick's blue pickup truck, a vintage model lovingly restored, and Kate holds her hand to her mouth, runs her hand through her hair, moves around to the side of Zoe's bed. She catches sight of the cuddly toys on her pillow, considers them briefly, then picks up the furry kangaroo, a souvenir from their trip to Australia. They drive past leafless trees into the bleak, deserted cemetery, where Zoe returns the hug that Kate has given her, a silent act of solidarity. Both crying, Kate kisses Zoe's cheek and gently wipes away her tears before the pair separate. Zoe mouths an acknowledgment of the unspoken understanding between them, then turns to pick up her red rucksack, a gift from Nick. They stand, and Kate brushes off her long, black coat, tailored for winter, and takes Zoe's hand as they walk away from the grave towards Nick, who's been watching from a respectful distance. Amid the faded flowers on the grave, a relic of a life once vibrant, is Zoe's peacock feather, fluttering in the breeze, symbolizing her wish for eternal beauty. Nick drives Zoe and Kate home, and as he pulls up, Zoe turns to him with a look of gratitude. Kate and Zoe climb out of the truck, and Kate hands her the keys to the house, a family heirloom. Nick offers his hand, which Kate takes, her eyes fixing longingly on him, recalling their shared past. Nick squeezes her hand, she pulls away, closes the door, and looks at Nick through the window, a silent goodbye. Kate stands alone in the sunlit street, washed in the golden glow of afternoon, as the truck drives away. In the busy restaurant kitchen, where the scent of culinary creations fills the air, Bernadette reenters, and brandishing an uncooked steak held high on a carving fork as a symbol of defiance, Kate marches out of the kitchen through the dining room and up to table seven. Kate tears off her apron, thrusts it at a waiter, and strides out, determined to forge her own path. Paula stares blankly as Kate hails a cab and gets in, leaving behind old routines. On her therapist's roof terrace overlooking Manhattan, with its iconic skyline, Kate turns and eyes the man with realization, contemplating a breakthrough. In a shabby elevator with flickering lights, Kate clutches a copper saucepan wrapped in a tea towel, steps out onto a landing lined with a discarded metal trolley and window grill, signs of disrepair, hesitates, then knocks. Without taking his eyes off Kate, Nick steps back from the door, revealing an open-plan loft apartment beyond, a space filled with memories of their shared dreams."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Zoe returns to watching the blackandwhite gangster movie on the TV her eyes darting around as she thinks. Suddenly she rises resolutely from the sofa strides out of the openplan lounge and down the hallway past the double doors opening onto Kate's desk ignoring Kate who remains at her desk. In her room Zoe sits on her bed with a scarlethaired smiling rag. doll resting on her drawnup knees pulls up the doll's striped skirt and red polka dot top considers the words with downcast eyes then replaces the doll's clothing and stares into the doll's face. Wearing a white dressing gown and with damp hair Kate strides down the hallway and is later outside Zoe's school. They drive around in Nick's blue pickup truck and Kate holds her hand to her mouth runs her hand through her hair moves around to the side of Zoe's bed catching sight of the cuddly toys on her pillow considers them briefly then picks up the furry kangaroo. They drive past leafless trees into the bleak deserted cemetery where Zoe returns the hug that Kate has given her. Both crying. Kate kisses Zoe's cheek and gently wipes away her tears before the pair separate. Zoe mouths an acknowledgment then turns to pick up her red rucksack and they stand. Kate brushes off her long black coat and takes Zoe's hand as they walk away from the grave towards Nick who is been watching from a distance. Amid the faded flowers on the grave is Zoe's peacock feather fluttering in the breeze. Nick drives Zoe and Kate home and as he pulls up Zoe turns to him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Kate and Zoe climb out of the truck and Kate hands her the keys. Nick offers his hand which Kate takes her eyes fixing longingly on him. Nick squeezes her hand she pulls away closes the door and looks at Nick through the window. Kate stands alone in the sunlit street as a truck drives away. In the busy restaurant kitchen Bernadette reenters and brandishing an uncooked steak held high on a carving fork. Kate marches out of the kitchen through the dining room and up to table seven. Kate tears off her apron thrusts it at a waiter and strides out. Paula stares blankly as Kate hails a cab and gets in. On her therapist's roof terrace overlooking Manhattan. Kate turns and eyes the man with realization. In a shabby elevator Kate clutches a copper saucepan wrapped in a tea towel steps out onto a landing lined with a discarded metal trolley and window grill hesitates then knocks. Without taking his eyes off Kate. Nick steps back from the door revealing an openplan loft apartment beyond."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Zoe returns to watching the blackandwhite gangster movie on the TV her eyes darting around as she thinks. Suddenly she rises resolutely from the sofa strides out of the openplan lounge and down the hallway past the double doors opening onto Kate's desk ignoring Kate who remains at her desk. In her room Zoe sits on her bed with a scarlethaired smiling rag. doll resting on her drawnup knees pulls up the doll's striped skirt and red polka dot top considers the words with downcast eyes then replaces the doll's clothing and stares into the doll's face. Wearing a white dressing gown and with damp hair Kate strides down the hallway and is later outside Zoe's school. They drive around in Nick's blue pickup truck and Kate holds her hand to her mouth runs her hand through her hair moves around to the side of Zoe's bed catching sight of the cuddly toys on her pillow considers them briefly then picks up the furry kangaroo. They drive past leafless trees into the bleak deserted cemetery where Zoe returns the hug that Kate has given her. Both crying. Kate kisses Zoe's cheek and gently wipes away her tears before the pair separate. Zoe mouths an acknowledgment then turns to pick up her red rucksack and they stand. Kate brushes off her long black coat and takes Zoe's hand as they walk away from the grave towards Nick who is been watching from a distance. Amid the faded flowers on the grave is Zoe's peacock feather fluttering in the breeze. Nick drives Zoe and Kate home and as he pulls up Zoe turns to him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Kate and Zoe climb out of the truck and Kate hands her the keys. Nick offers his hand which Kate takes her eyes fixing longingly on him. Nick squeezes her hand she pulls away closes the door and looks at Nick through the window. Kate stands alone in the sunlit street as a truck drives away. In the busy restaurant kitchen Bernadette reenters and brandishing an uncooked steak held high on a carving fork. Kate marches out of the kitchen through the dining room and up to table seven. Kate tears off her apron thrusts it at a waiter and strides out. Paula stares blankly as Kate hails a cab and gets in. On her therapist's roof terrace overlooking Manhattan. Kate turns and eyes the man with realization. In a shabby elevator Kate clutches a copper saucepan wrapped in a tea towel steps out onto a landing lined with a discarded metal trolley and window grill hesitates then knocks. Without taking his eyes off Kate. Nick steps back from the door revealing an openplan loft apartment beyond."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Zoe returns to watching the blackandwhite gangster movie on the TV her eyes darting around as she thinks. Suddenly she rises resolutely from the sofa strides out of the openplan lounge and down the hallway past the double doors opening onto Kate's desk ignoring Kate who remains at her desk. In her room Zoe sits on her bed with a scarlethaired smiling rag. doll resting on her drawnup knees pulls up the doll's striped skirt and red polka dot top considers the words with downcast eyes then replaces the doll's clothing and stares into the doll's face. Wearing a white dressing gown and with damp hair Kate strides down the hallway and is later outside Zoe's school. They drive around in Nick's blue pickup truck and Kate holds her hand to her mouth runs her hand through her hair moves around to the side of Zoe's bed catching sight of the cuddly toys on her pillow considers them briefly then picks up the furry kangaroo. They drive past leafless trees into the bleak deserted cemetery where Zoe returns the hug that Kate has given her. Paula stares blankly as Kate hails a cab and gets in. On her therapist's roof terrace overlooking Manhattan. Kate turns and eyes the man with realization. In a shabby elevator Kate clutches a copper saucepan wrapped in a tea towel steps out onto a landing lined with a discarded metal trolley and window grill hesitates then knocks. Without taking his eyes off Kate. Nick steps back from the door revealing an openplan loft apartment beyond."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Zoe returns to watching the blackandwhite gangster movie on the TV her eyes darting around as she thinks. Suddenly she rises resolutely from the sofa strides out of the openplan lounge and down the hallway past the double doors opening onto Kate's desk ignoring Kate who remains at her desk. In her room Zoe sits on her bed with a scarlethaired smiling rag. In a shabby elevator Kate clutches a copper saucepan wrapped in a tea towel steps out onto a landing lined with a discarded metal trolley and window grill hesitates then knocks. Without taking his eyes off Kate. Nick steps back from the door revealing an openplan loft apartment beyond."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Elaine resumes observing the colorful pirate opera on the smartphone, her ears twitching as she calculates. Instantly, she hops eagerly from the armchair, glides into the crowded kitchen and through the corridor, past the swinging windows revealing Josh's aquarium, ignoring Josh, who remains at his aquarium. In her alcove, Elaine perches on her rug with a turquoise-clad giggling puppet lounging on her bent elbows, lifts the puppet's checkered pants and yellow floral vest, analyzes the symbols with closed eyes, then restores the puppet's attire, and peers into the puppet's eyes. Wearing a black trench coat and with braided hair, Josh glides through the corridor and is soon beneath Elaine's library. They pedal around in Steve's red bicycle, and Josh covers his ear, scratches his nose, wanders around to the corner of Elaine's hammock, glimpsing the plush animals on her quilt, ponders them fleetingly, then grabs the plush dinosaur. They pedal past snowy hills into the vibrant, bustling fairground, where Elaine reciprocates the pat that Josh has given her. Both laughing, Josh taps Elaine's shoulder and softly pats away her sweat before the two disperse. Elaine whispers a farewell, then spins to grab her green backpack, and they rise. Josh dusts off his short, brown jacket and grips Elaine's wrist as they stroll toward Steve, who's been observing from afar. Among the blooming roses on the pedestal is Elaine's butterfly wing, fluttering in the wind. Steve transports Elaine and Josh back, and as he halts, Elaine faces him. Josh and Elaine disembark the bicycle, and Josh hands her the helmet. Steve extends a fist, which Josh bumps, his gaze lingering fondly on him. Steve releases his fist, she extracts hers, shuts the gate, and gazes at Steve through the glass. Josh stands solo in the moonlit plaza as a bicycle zooms off. In the quiet bakery storeroom, Rachel exits, and waving a grilled fish held high on a soup ladle, Josh glides out of the storeroom through the patio and over to seat three. Josh tosses off his hat, flings it at a chef, and glides away. Monica gazes thoughtfully as Josh hops on a scooter and zooms off. On her doctor's balcony overlooking London, Josh pivots and surveys the dog with curiosity. In a clean staircase, Josh grasps a brass kettle wrapped in plastic wrap, steps onto a veranda lined with a dropped wooden suitcase and balcony railing, pauses, then buzzes. Without moving his gaze from Josh, Steve retreats from the curtain, revealing an open-concept garden lounge beyond."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Zoe watches a black-and-white gangster movie but soon leaves to sit with her scarlet-haired rag doll, lost in thought. Meanwhile, Kate, dressed in a white gown, picks up Zoe from school. They drive through a cemetery, where emotional moments lead to Zoe placing a peacock feather on a grave. As they head home in Nick's blue pickup, Kate and Nick share a brief, tender moment before parting. Kate stands alone, watching the truck leave. Later, in a bustling restaurant, Kate abandons her job, hailing a cab to her therapist's rooftop with a sense of realization. She finally knocks on Nick’s door, revealing his loft apartment."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Nick steps back from the door revealing an openplan loft apartment beyond Without taking his eyes off Kate In a shabby elevator Kate clutches a copper saucepan wrapped in a tea towel steps out onto a landing lined with a discarded metal trolley and window grill hesitates then knocks Kate turns and eyes the man with realization On her therapist's roof terrace overlooking Manhattan Paula stares blankly as Kate hails a cab and gets in Kate tears off her apron thrusts it at a waiter and strides out Kate marches out of the kitchen through the dining room and up to table seven In the busy restaurant kitchen Bernadette reenters and brandishing an uncooked steak held high on a carving fork Kate stands alone in the sunlit street as a truck drives away Nick squeezes her hand she pulls away closes the door and looks at Nick through the window Nick offers his hand which Kate takes her eyes fixing longingly on him Kate and Zoe climb out of the truck and Kate hands her the keys Nick drives Zoe and Kate home and as he pulls up Zoe turns to him Amid the faded flowers on the grave is Zoe's peacock feather fluttering in the breeze Kate brushes off her long black coat and takes Zoe's hand as they walk away from the grave towards Nick who is been watching from a distance Zoe mouths an acknowledgment then turns to pick up her red rucksack and they stand Kate kisses Zoe's cheek and gently wipes away her tears before the pair separate Both crying They drive past leafless trees into the bleak deserted cemetery where Zoe returns the hug that Kate has given her They drive around in Nick's blue pickup truck and Kate holds her hand to her mouth runs her hand through her hair moves around to the side of Zoe's bed catching sight of the cuddly toys on her pillow considers them briefly then picks up the furry kangaroo Wearing a white dressing gown and with damp hair Kate strides down the hallway and is later outside Zoe's school doll resting on her drawnup knees pulls up the doll's striped skirt and red polka dot top considers the words with downcast eyes then replaces the doll's clothing and stares into the doll's face In her room Zoe sits on her bed with a scarlethaired smiling rag Suddenly she rises resolutely from the sofa strides out of the openplan lounge and down the hallway past the double doors opening onto Kate's desk ignoring Kate who remains at her desk Zoe returns to watching the blackandwhite gangster movie on the TV her eyes darting around as she thinks"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Suddenly she rises resolutely from the sofa strides out of the openplan lounge and down the hallway past the double doors opening onto Kate's desk ignoring Kate who remains at her desk Zoe returns to watching the blackandwhite gangster movie on the TV her eyes darting around as she thinks doll resting on her drawnup knees pulls up the doll's striped skirt and red polka dot top considers the words with downcast eyes then replaces the doll's clothing and stares into the doll's face In her room Zoe sits on her bed with a scarlethaired smiling rag They drive around in Nick's blue pickup truck and Kate holds her hand to her mouth runs her hand through her hair moves around to the side of Zoe's bed catching sight of the cuddly toys on her pillow considers them briefly then picks up the furry kangaroo Wearing a white dressing gown and with damp hair Kate strides down the hallway and is later outside Zoe's school Both crying They drive past leafless trees into the bleak deserted cemetery where Zoe returns the hug that Kate has given her Zoe mouths an acknowledgment then turns to pick up her red rucksack and they stand Kate kisses Zoe's cheek and gently wipes away her tears before the pair separate Amid the faded flowers on the grave is Zoe's peacock feather fluttering in the breeze Kate brushes off her long black coat and takes Zoe's hand as they walk away from the grave towards Nick who is been watching from a distance Kate and Zoe climb out of the truck and Kate hands her the keys Nick drives Zoe and Kate home and as he pulls up Zoe turns to him Nick squeezes her hand she pulls away closes the door and looks at Nick through the window Nick offers his hand which Kate takes her eyes fixing longingly on him In the busy restaurant kitchen Bernadette reenters and brandishing an uncooked steak held high on a carving fork Kate stands alone in the sunlit street as a truck drives away Kate tears off her apron thrusts it at a waiter and strides out Kate marches out of the kitchen through the dining room and up to table seven On her therapist's roof terrace overlooking Manhattan Paula stares blankly as Kate hails a cab and gets in In a shabby elevator Kate clutches a copper saucepan wrapped in a tea towel steps out onto a landing lined with a discarded metal trolley and window grill hesitates then knocks Kate turns and eyes the man with realization Nick steps back from the door revealing an openplan loft apartment beyond Without taking his eyes off Kate"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Kate and Zoe climb out of the truck and Kate hands her the keys Nick offers his hand which Kate takes her eyes fixing longingly on him Nick squeezes her hand she pulls away closes the door and looks at Nick through the window Kate stands alone in the sunlit street as a truck drives away In the busy restaurant kitchen Bernadette reenters and brandishing an uncooked steak held high on a carving fork Kate marches out of the kitchen through the dining room and up to table seven Kate tears off her apron thrusts it at a waiter and strides out Paula stares blankly as Kate hails a cab and gets in On her therapist's roof terrace overlooking Manhattan Kate turns and eyes the man with realization In a shabby elevator Kate clutches a copper saucepan wrapped in a tea towel steps out onto a landing lined with a discarded metal trolley and window grill hesitates then knocks Without taking his eyes off Kate Nick steps back from the door revealing an openplan loft apartment beyond Zoe returns to watching the blackandwhite gangster movie on the TV her eyes darting around as she thinks Suddenly she rises resolutely from the sofa strides out of the openplan lounge and down the hallway past the double doors opening onto Kate's desk ignoring Kate who remains at her desk In her room Zoe sits on her bed with a scarlethaired smiling rag doll resting on her drawnup knees pulls up the doll's striped skirt and red polka dot top considers the words with downcast eyes then replaces the doll's clothing and stares into the doll's face Wearing a white dressing gown and with damp hair Kate strides down the hallway and is later outside Zoe's school They drive around in Nick's blue pickup truck and Kate holds her hand to her mouth runs her hand through her hair moves around to the side of Zoe's bed catching sight of the cuddly toys on her pillow considers them briefly then picks up the furry kangaroo They drive past leafless trees into the bleak deserted cemetery where Zoe returns the hug that Kate has given her Both crying Kate kisses Zoe's cheek and gently wipes away her tears before the pair separate Zoe mouths an acknowledgment then turns to pick up her red rucksack and they stand Kate brushes off her long black coat and takes Zoe's hand as they walk away from the grave towards Nick who is been watching from a distance Amid the faded flowers on the grave is Zoe's peacock feather fluttering in the breeze Nick drives Zoe and Kate home and as he pulls up Zoe turns to him"
        }
      ]
    }
  ]
}