{
  "ground_truth": "Kate slowly wakes up and takes in her surroundings and looks across at Zoe, who’s staring at her. Aunt and niece gaze at each other for a few moments, then Kate sits up and stares unblinkingly at the young girl. Tears roll down Zoe's face, and Kate nods sadly. Zoe's anguished face is crumpled as a tear trickles down Kate’s face. Kate walks wearily into her apartment, removes her long, red scarf from around her neck, and walks over to the answer machine. Transfixed, Kate stands in the hallway, clutching her coat, then turns and walks back towards the door. At the restaurant, they all turn and stare as Kate walks in and past them, while Paula puts her wineglass down. In the empty kitchen, Kate ties her apron around her waist, and without looking at Paula, Kate walks away. Concerned, Leah looks over at Kate, who seems distracted, her eyes filling with tears. Kate crouches on the floor of the walk-in fridge with Christine's letter, and Paula looks in at her through a window in the door. Distraught, Kate looks up as Paula enters, nodding, her chin quivering, while Paula takes hold of Kate's hands. In Zoe's hospital room, Kate walks in, goes to the end of Zoe’s bed, and places her bag down on the over-bed table. Kate takes the bag and places it on a chair by the window, puts her handbag beside it, and takes off her coat and scarf as she talks to Zoe. Zoe goes back to watching the Bugs Bunny cartoon as Kate sits in the chair beside her bed. Zoe looks away but gives a faint nod and turns back to the TV. A yellow taxicab drives along a New York street, with Zoe in the back seat, looking out through the rain-splashed window as if in a trance. The cab pulls up, and Zoe and Kate get out. Zoe slings a red rucksack over her shoulder and stands looking up at Kate’s apartment building, a smart brownstone with a wide set of steps leading up to an arched entranceway. Inside, Kate shows Zoe around the apartment, walks down a hallway, and Zoe walks slowly into her new bedroom, which is light and airy, with a large bay window and window seat and a huge double bed. At a cemetery high on a hill overlooking the city, Zoe stares morosely at her mother's casket, which sits by the graveside. As other mourners begin to disburse, Zoe turns to Kate, and the two of them walk slowly away. A large, lifelike, cuddly toy giraffe is carried up the steps of Kate's brownstone, followed by more toys and a bike being taken inside, while Zoe carries a stuffed elephant. A collection of cuddly toys is arranged around Zoe’s room.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Kate gradually awakens and absorbs her environment and glances across at Zoe, who’s gazing at her. Aunt and niece regard one another for several moments, then Kate rises and peers unflinchingly at the young girl. Tears cascade down Zoe's visage, and Kate acknowledges sorrowfully. Zoe's tormented demeanor is wrinkled as a tear drips down Kate’s face. Kate ambles tiredly into her apartment, detaches her lengthy, crimson scarf from around her neck, and moves over to the answering machine. Mesmerized, Kate lingers in the corridor, gripping her jacket, then rotates and strides back towards the doorway. At the eatery, they all pivot and gaze as Kate strides in and past them, while Paula sets her wineglass down. In the vacant kitchen, Kate knots her apron around her waist, and without glancing at Paula, Kate strides away. Worried, Leah glances over at Kate, who appears preoccupied, her eyes brimming with tears. Kate crouches on the ground of the walk-in refrigerator with Christine's letter, and Paula peers in at her through a pane in the entrance. Upset, Kate glances up as Paula enters, nodding, her chin trembling, while Paula grasps Kate's hands. In Zoe's hospital chamber, Kate enters, proceeds to the foot of Zoe’s bed, and sets her bag down on the over-bed surface. Kate takes the bag and places it on a seat by the window, puts her purse beside it, and removes her jacket and scarf as she converses with Zoe. Zoe returns to viewing the Bugs Bunny animation as Kate sits in the seat beside her bed. Zoe looks away but gives a slight nod and turns back to the TV. A yellow taxi drives along a New York avenue, with Zoe in the rear seat, gazing out through the rain-dappled pane as if in a daze. The cab halts, and Zoe and Kate exit. Zoe tosses a crimson backpack over her shoulder and stands gazing up at Kate’s apartment building, a stylish brownstone with a broad set of steps leading up to an arched entryway. Inside, Kate shows Zoe around the apartment, walks down a hallway, and Zoe strides slowly into her new bedroom, which is bright and breezy, with a large bay window and window seat and a huge double bed. At a graveyard high on a hill overlooking the metropolis, Zoe stares despondently at her mother's coffin, which sits by the graveside. As other mourners begin to disperse, Zoe turns to Kate, and the two of them walk slowly away. A large, realistic, plush toy giraffe is conveyed up the steps of Kate's brownstone, followed by more toys and a bicycle being taken inside, while Zoe carries a stuffed elephant. A collection of plush toys is arranged around Zoe’s chamber."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Kate is slowly woken up, and her surroundings are taken in by her as Zoe is looked at by her, staring. Each other is gazed at by aunt and niece for a few moments, then Kate is sat up, and the young girl is stared at unblinkingly by her. Zoe’s face is rolled down by tears, and Kate sadly nods. Kate’s face is trickled down by a tear as Zoe’s anguished face crumples. The apartment is walked into wearily by Kate, a long, red scarf is removed from around her neck, and the answer machine is walked over to by her. Kate is transfixed, standing in the hallway, a coat is clutched by her, then she turns and walks back towards the door. At the restaurant, the entrance of Kate is turned and stared at by everyone as they are walked past by her, while a wineglass is put down by Paula. In the empty kitchen, an apron is tied around Kate’s waist, and Paula is walked away from by Kate, without looking at her. Concerned, Leah looks at Kate, who seems distracted, with her eyes filled with tears. The floor of the walk-in fridge is crouched on by Kate with Christine’s letter, and Paula looks at her through a window in the door. Distraught, Kate nods as she looks up while Paula enters, and Kate's hands are taken hold of by Paula. In Zoe’s hospital room, Zoe’s bed is walked to by Kate, her bag is placed down on the over-bed table, and she walks in. The bag is taken by Kate and placed on a chair by the window, her handbag is put beside it, and her coat and scarf are taken off as Zoe is talked to by her. The Bugs Bunny cartoon is watched again by Zoe as the chair beside her bed is sat in by Kate. The TV is turned back to by Zoe after she looks away, giving a faint nod. A yellow taxicab is driven along a New York street, with Zoe in the back seat, looking out through the rain-splashed window as if in a trance. Up pulls the cab, and Zoe and Kate get out. A red rucksack is slung over Zoe’s shoulder, and she stands looking up at Kate’s apartment building, a smart brownstone with a wide set of steps that lead up to an arched entranceway. Inside, around the apartment is shown to Zoe by Kate, and the hallway is walked down by her, while Zoe slowly walks into her new bedroom, which is light and airy, with a large bay window, a window seat, and a huge double bed. At a cemetery high on a hill overlooking the city, Zoe stares morosely at her mother's casket, and it sits by the graveside. As other mourners begin to disburse, Kate is turned to by Zoe, and slowly away they walk. A large, lifelike, cuddly toy giraffe is carried up the steps of Kate’s brownstone, more toys and a bike follow being taken inside, while Zoe carries a stuffed elephant. Zoe’s room is arranged with a collection of cuddly toys."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Kate wakes up and sees Zoe staring at her. They exchange a gaze before Kate sits up, tears rolling down both their faces. Kate enters her apartment, removes her red scarf, and stands by the answering machine, then heads back to the door. At the restaurant, everyone watches as Kate enters, and Paula sets down her wineglass. In the kitchen, Kate ties her apron and walks away from Paula. Leah notices Kate's distraction and tears. Kate crouches in the fridge with Christine's letter, and Paula enters, holding Kate's hands. In Zoe's hospital room, Kate places her bag on the table, moves it to a chair, and removes her coat and scarf while talking to Zoe. Zoe nods faintly and returns to watching Bugs Bunny. A yellow taxi drives Zoe through New York, rain-splashed window blurring her view. The cab stops, and Zoe and Kate exit. Zoe, with a red rucksack, looks up at Kate’s brownstone. Inside, Kate shows Zoe around, and Zoe enters her new, airy bedroom with a bay window and double bed. At a cemetery, Zoe stares at her mother's casket. As mourners leave, Zoe and Kate walk away. A large toy giraffe and more toys are carried into Kate's brownstone, with Zoe holding a stuffed elephant. Cuddly toys are arranged in Zoe’s room."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Kate wakes up, sees Zoe staring at her, and they share a moment. Kate sits up, tears fall from both, and she nods sadly. Kate enters her apartment, removes her scarf, and stands by the answer machine, then heads to the door. At the restaurant, everyone stares as Kate enters, and Paula puts down her glass. In the kitchen, Kate ties her apron and walks away, while Leah notices her tears. Kate crouches in the fridge with Christine's letter, and Paula enters, holding Kate's hands. In Zoe's hospital room, Kate places her bag on the table, moves it to a chair, and talks to Zoe, who nods and watches TV. A yellow cab drives Zoe through New York, and they arrive at Kate's brownstone. Zoe, with a red rucksack, looks at the building. Inside, Kate shows Zoe the apartment and her new airy bedroom. At a cemetery, Zoe stares at her mother's casket, then walks away with Kate. Toys and a bike are carried into Kate's brownstone, and Zoe arranges cuddly toys in her room."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Kate gradually awakens from her slumber, taking a moment to absorb her surroundings. She glances across the room to find Zoe, who is intently staring at her. The aunt and niece share a silent, meaningful gaze for several moments. Eventually, Kate sits up, fixing her unblinking eyes on the young girl. Tears begin to cascade down Zoe's cheeks, and Kate responds with a solemn nod, acknowledging the shared sorrow. Zoe's face is contorted with anguish, and a single tear makes its way down Kate’s face as well. \n\nWith a sense of weariness, Kate enters her apartment, slowly unwinding the long, red scarf from around her neck. She makes her way over to the answering machine, standing transfixed in the hallway, clutching her coat tightly. After a moment of hesitation, she turns and walks back towards the door. At the restaurant, as Kate makes her entrance and walks past the patrons, all eyes turn to follow her. Paula, noticing Kate's arrival, places her wineglass down on the table. In the now-empty kitchen, Kate ties an apron securely around her waist. Without casting a glance in Paula's direction, she walks away. Leah, filled with concern, looks over at Kate, who appears distracted, her eyes brimming with unshed tears.\n\nIn a moment of vulnerability, Kate crouches on the floor of the walk-in fridge, clutching Christine's letter. Paula peers in at her through the small window in the door. Overcome with distress, Kate looks up as Paula enters the room. Paula nods, her chin trembling with emotion, and gently takes hold of Kate's hands, offering silent support. In Zoe's hospital room, Kate enters quietly, making her way to the end of Zoe’s bed. She places her bag down on the over-bed table, then moves it to a chair by the window, setting her handbag beside it. As she removes her coat and scarf, she talks softly to Zoe. Zoe, momentarily distracted, returns her attention to the Bugs Bunny cartoon playing on the TV. She looks away but gives a faint nod before turning back to the screen.\n\nA yellow taxicab makes its way along a bustling New York street, with Zoe seated in the back, gazing out through the rain-splashed window, lost in thought. The cab comes to a stop, and both Zoe and Kate step out. Zoe slings a red rucksack over her shoulder, standing still for a moment as she looks up at Kate’s apartment building. The building is a smart brownstone, featuring a wide set of steps leading up to an elegant arched entranceway. Inside, Kate gives Zoe a tour of the apartment, walking down the hallway. Zoe slowly enters her new bedroom, which is bright and airy, boasting a large bay window with a window seat and a spacious double bed.\n\nAt a cemetery perched high on a hill with a view of the city below, Zoe gazes morosely at her mother's casket, which rests solemnly by the graveside. As the other mourners begin to disperse, Zoe turns to Kate, and together, they walk slowly away from the scene. A large, lifelike, cuddly toy giraffe is carried up the steps of Kate's brownstone, followed by an assortment of other toys and a bike being taken inside. Zoe, carrying a stuffed elephant, watches as a collection of cuddly toys is carefully arranged around her room, creating a comforting and inviting space."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Kate gradually emerges from her deep slumber, taking a few lingering moments to fully absorb and become aware of her surroundings. She casts a glance across the room, only to discover Zoe staring at her with focused intensity. The aunt and niece share a silent and profoundly meaningful gaze, one that lasts for several moments laden with unspoken understanding. Eventually, Kate pulls herself into a seated position, her unblinking eyes fixed steadily on the young girl before her. Tears begin to cascade slowly down Zoe's cheeks, and Kate, in turn, responds with a solemn nod, acknowledging the mutual sorrow between them. Zoe’s face contorts with visible anguish, and a lone tear finds its way down Kate’s face as well, a testament to their shared pain.\n\nWith a sense of weary resignation, Kate slowly makes her way into her apartment, unwinding the long, vibrant red scarf from around her neck. She walks over to the answering machine, standing transfixed in the dimly lit hallway, clutching her coat tightly as if for comfort or stability. After a moment of hesitation and indecision, she turns around and walks back toward the door. Later, at the bustling restaurant, as Kate makes her entrance and walks past the patrons, all eyes instinctively turn to follow her. Paula, observing Kate’s arrival, gently places her wineglass down on the table, an action full of anticipation. In the now-empty, quiet kitchen, Kate secures an apron snugly around her waist. Without sparing so much as a glance in Paula's direction, she walks away with purpose. Leah, filled with evident concern, watches Kate closely, noticing she appears distracted, her eyes brimming with yet-to-fall tears, indicating a deep inner turmoil.\n\nIn a moment of vulnerability, Kate crouches down on the cold, hard floor of the walk-in fridge, clutching Christine's poignant letter tightly in her hand. Paula peers in through the small window in the door, observing Kate’s distress. Overcome with emotion, Kate looks up as Paula enters the room. Paula offers a supportive nod, her chin trembling with emotion, and gently takes hold of Kate’s hands, offering the comfort of silent support. In Zoe’s subdued hospital room, Kate enters quietly, making her way to the end of Zoe’s bed. She places her bag down on the over-bed table, then moves it over to a chair by the window, setting her handbag beside it with care. As she removes both her coat and scarf, she speaks softly to Zoe, her voice tender and soothing. Zoe, momentarily distracted by Kate’s actions, returns her attention to the Bugs Bunny cartoon playing on the television screen. She nods faintly before returning her gaze to the animated show on the screen.\n\nA bright yellow taxicab winds its way along a bustling New York street, with Zoe seated in the back, gazing pensively out through the rain-splashed window, lost in her own thoughts. The cab comes to a halt, and both Zoe and Kate step out onto the wet pavement. Zoe slings a red rucksack over her shoulder and stands still for a moment, taking in the sight of Kate’s apartment building. The building is a smart brownstone, featuring a wide set of steps leading up to an elegant and inviting arched entranceway. Inside this welcoming abode, Kate gives Zoe a tour of the apartment, leading her down the hallway with gentle guidance. Zoe slowly enters her new bedroom, which is bright and airy, boasting a large bay window complete with a window seat and a spacious, comfortable double bed—an inviting sanctuary for new beginnings.\n\nAt a cemetery perched high on a hill that offers a sweeping view of the city below, Zoe gazes morosely at her mother's casket, which rests solemnly by the graveside, a poignant reminder of loss. As the other mourners begin to disperse and fade away, Zoe turns to Kate, and together, they walk slowly and deliberately away from the poignant scene. A large, lifelike, cuddly toy giraffe is carefully carried up the steps of Kate's brownstone, followed by an assortment of other toys and a shiny bike being taken inside, signaling new beginnings and comforts. Zoe, carrying a cherished stuffed elephant, watches as a collection of cuddly toys is thoughtfully arranged around her room, creating a comforting and inviting space filled with warmth and love."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Kate gradually awakens, her eyes fluttering open as she takes in her surroundings, her gaze eventually settling on Zoe, who is intently staring back at her. The two, aunt and niece, lock eyes, sharing a silent moment of connection. After a few moments, Kate shifts her position, sitting up and fixing her unblinking gaze on the young girl. As tears begin to cascade down Zoe's cheeks, Kate acknowledges the shared sorrow with a solemn nod. Zoe's face, contorted with anguish, mirrors the emotion as a single tear makes its way down Kate’s face. With a heavy heart, Kate trudges into her apartment, her movements slow and deliberate as she unwinds the long, red scarf from around her neck. She approaches the answering machine, her attention momentarily captured, standing still in the hallway while clutching her coat. After a pause, she pivots and retraces her steps back towards the door. At the restaurant, the atmosphere shifts as all eyes turn to follow Kate's entrance, her presence commanding attention as she walks past them, prompting Paula to set her wineglass down. In the solitude of the empty kitchen, Kate methodically ties her apron around her waist, deliberately avoiding eye contact with Paula as she moves away. Leah, observing with concern, notices Kate's distracted demeanor, her eyes brimming with unshed tears. In a moment of vulnerability, Kate crouches on the floor of the walk-in fridge, clutching Christine's letter, while Paula peers in through the window in the door. Overcome with emotion, Kate lifts her gaze as Paula enters, her chin trembling as she nods, and Paula reaches out to clasp Kate's hands in a gesture of support. In the sterile environment of Zoe's hospital room, Kate enters with purpose, making her way to the end of Zoe’s bed to place her bag on the over-bed table. She then relocates the bag to a chair by the window, setting her handbag beside it, and removes her coat and scarf, all the while engaging Zoe in conversation. Zoe, momentarily distracted by the Bugs Bunny cartoon, returns her attention to the TV as Kate settles into the chair beside her bed. Zoe briefly averts her gaze but offers a faint nod before turning back to the animated antics on the screen. Meanwhile, a yellow taxicab navigates the bustling streets of New York, with Zoe seated in the back, her eyes distant as she gazes through the rain-splattered window, lost in thought. The cab comes to a halt, and both Zoe and Kate alight, with Zoe slinging a red rucksack over her shoulder. She pauses, taking in the sight of Kate’s apartment building, a stately brownstone with a broad set of steps leading up to an arched entranceway. Once inside, Kate takes on the role of guide, showing Zoe around the apartment, leading her down a hallway. Zoe ventures slowly into her new bedroom, a space filled with light and air, featuring a large bay window with a window seat and a spacious double bed. At a cemetery perched high on a hill with a view of the city, Zoe stands somberly, her eyes fixed on her mother's casket resting by the graveside. As the other mourners begin to disperse, Zoe turns to Kate, and together they walk away, their pace slow and measured. A large, lifelike, cuddly toy giraffe is carried up the steps of Kate's brownstone, followed by an assortment of toys and a bike being brought inside, while Zoe clutches a stuffed elephant. In her room, a collection of cuddly toys is carefully arranged, creating a comforting presence around her."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Kate wakes up and exchanges a silent, emotional gaze with her niece, Zoe, as they both shed tears. Kate then enters her apartment, removes her scarf, and momentarily pauses by the answering machine before heading out again. At the restaurant, she walks past everyone, including Paula, who sets down her wineglass. In the kitchen, Kate ties on her apron and walks away without acknowledging Paula. Leah notices Kate's distracted demeanor as her eyes fill with tears. In the walk-in fridge, Kate reads Christine's letter, and Paula offers comfort by holding her hands. In Zoe's hospital room, Kate places her belongings on the table and chair, removes her coat and scarf, and talks to Zoe, who nods faintly while watching a cartoon. Later, a yellow taxicab drives through New York with Zoe in the back seat, lost in thought. Upon arrival, Zoe and Kate exit the cab, and Zoe, with her red rucksack, looks up at Kate’s apartment building. Inside, Kate shows Zoe around, and Zoe explores her new, airy bedroom. At a cemetery, Zoe mournfully watches her mother's casket and then walks away with Kate. Back at the brownstone, toys and a bike are carried inside, with Zoe holding a stuffed elephant, as her room is filled with cuddly toys."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Kate slowly wakes up and takes in her surroundings, which are filled with early morning light streaming through a large bedroom window, and looks across at Zoe, who’s staring at her with an earnest expression that speaks of their close bond. Aunt and niece gaze at each other for a few moments, then Kate sits up and stares unblinkingly at the young girl. Tears roll down Zoe's face, and Kate nods sadly, sharing the unspoken pain and understanding between family. Zoe's anguished face is crumpled as a tear trickles down Kate’s face, mirroring her sadness at their recent loss. Kate walks wearily into her apartment, a third-floor unit in a historic New York City brownstone, removes her long, red scarf from around her neck, and walks over to the answer machine, a device that now feels outdated in the age of smartphones. Transfixed, Kate stands in the hallway, clutching her coat, then turns and walks back towards the door as if seeking solace in the outside world. At the restaurant, a cozy Italian bistro known for its hand-made pastas, they all turn and stare as Kate walks in and past them, while Paula, Kate's long-time friend and colleague, puts her wineglass down. In the empty kitchen, filled with the aromatic scent of herbs and spices, Kate ties her apron around her waist, and without looking at Paula, Kate walks away, her mind elsewhere. Concerned, Leah, a young sous-chef with a compassionate nature, looks over at Kate, who seems distracted, her eyes filling with tears as memories flood back. Kate crouches on the floor of the walk-in fridge with Christine's letter, a critical piece of correspondence that holds deep personal significance, and Paula looks in at her through a window in the door. Distraught, Kate looks up as Paula enters, nodding, her chin quivering, while Paula takes hold of Kate's hands, offering silent support. In Zoe's hospital room, where the walls are painted a calming shade of blue, Kate walks in, goes to the end of Zoe’s bed, and places her bag down on the over-bed table, which holds an array of get-well cards. Kate takes the bag and places it on a chair by the window, puts her handbag beside it, and takes off her coat and scarf as she talks to Zoe, gently trying to lift her spirits. Zoe goes back to watching the Bugs Bunny cartoon, a classic that has entertained generations with its humor, as Kate sits in the chair beside her bed. Zoe looks away but gives a faint nod and turns back to the TV, the familiar antics of Bugs bringing a brief smile to her face. A yellow taxicab, emblematic of New York City, drives along a New York street, with Zoe in the back seat, looking out through the rain-splashed window as if in a trance, the city a blur of lights and sounds. The cab pulls up, and Zoe and Kate get out. Zoe slings a red rucksack over her shoulder and stands looking up at Kate’s apartment building, a smart brownstone with a wide set of steps leading up to an arched entranceway that echoes the grandeur of early 20th-century architecture. Inside, Kate shows Zoe around the apartment, infused with Kate’s personal style, walks down a hallway, and Zoe walks slowly into her new bedroom, which is light and airy, with a large bay window and window seat and a huge double bed, providing a sanctuary for the young girl. At a cemetery high on a hill overlooking the city, a peaceful resting place offering solace with its sweeping views, Zoe stares morosely at her mother's casket, which sits by the graveside, a stark reminder of their loss. As other mourners begin to disburse, Zoe turns to Kate, and the two of them walk slowly away, finding comfort in each other's presence. A large, lifelike, cuddly toy giraffe is carried up the steps of Kate's brownstone, followed by more toys and a bike being taken inside, while Zoe carries a stuffed elephant, symbols of comfort and the joys of childhood. A collection of cuddly toys is arranged around Zoe’s room, each one a soft reminder of love and friendship."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Kate slowly wakes up and takes in her surroundings and looks across at Zoe who is staring at her. Aunt and niece gaze at each other for a few moments then Kate sits up and stares unblinkingly at the young girl. Tears roll down Zoe's face and Kate nods sadly. Zoe's anguished face is crumpled as a tear trickles down Kate’s face. Kate walks wearily into her apartment removes her long red scarf from around her neck and walks over to the answer machine. Transfixed Kate stands in the hallway clutching her coat then turns and walks back towards the door. At the restaurant they all turn and stare as Kate walks in and past them while Paula puts her wineglass down. In the empty kitchen Kate ties her apron around her waist and without looking at Paula Kate walks away. Concerned Leah looks over at Kate who seems distracted her eyes filling with tears. Kate crouches on the floor of the walkin fridge with Christine's letter and Paula looks in at her through a window in the door. Distraught Kate looks up as Paula enters nodding her chin quivering while Paula takes hold of Kate's hands. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. In Zoe's hospital room Kate walks in goes to the end of Zoe’s bed and places her bag down on the overbed table. Kate takes the bag and places it on a chair by the window puts her handbag beside it and takes off her coat and scarf as she talks to Zoe. Zoe goes back to watching the Bugs Bunny cartoon as Kate sits in the chair beside her bed. Zoe looks away but gives a faint nod and turns back to the TV. A yellow taxicab drives along a New York street with Zoe in the back seat looking out through the rainsplashed window as if in a trance. The cab pulls up and Zoe and Kate get out. Zoe slings a red rucksack over her shoulder and stands looking up at Kate’s apartment building a smart brownstone with a wide set of steps leading up to an arched entranceway. Inside Kate shows Zoe around the apartment walks down a hallway and Zoe walks slowly into her new bedroom which is light and airy with a large bay window and window seat and a huge double bed. At a cemetery high on a hill overlooking the city Zoe stares morosely at her mother's casket which sits by the graveside. As other mourners begin to disburse Zoe turns to Kate and the two of them walk slowly away. A large lifelike cuddly toy giraffe is carried up the steps of Kate's brownstone followed by more toys and a bike being taken inside while Zoe carries a stuffed elephant. A collection of cuddly toys is arranged around Zoe’s room."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Kate slowly wakes up and takes in her surroundings and looks across at Zoe who is staring at her. Aunt and niece gaze at each other for a few moments then Kate sits up and stares unblinkingly at the young girl. Tears roll down Zoe's face and Kate nods sadly. Zoe's anguished face is crumpled as a tear trickles down Kate’s face. Kate walks wearily into her apartment removes her long red scarf from around her neck and walks over to the answer machine. Transfixed Kate stands in the hallway clutching her coat then turns and walks back towards the door. At the restaurant they all turn and stare as Kate walks in and past them while Paula puts her wineglass down. In the empty kitchen Kate ties her apron around her waist and without looking at Paula Kate walks away. Concerned Leah looks over at Kate who seems distracted her eyes filling with tears. Kate crouches on the floor of the walkin fridge with Christine's letter and Paula looks in at her through a window in the door. Distraught Kate looks up as Paula enters nodding her chin quivering while Paula takes hold of Kate's hands. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In Zoe's hospital room Kate walks in goes to the end of Zoe’s bed and places her bag down on the overbed table. Kate takes the bag and places it on a chair by the window puts her handbag beside it and takes off her coat and scarf as she talks to Zoe. Zoe goes back to watching the Bugs Bunny cartoon as Kate sits in the chair beside her bed. Zoe looks away but gives a faint nod and turns back to the TV. A yellow taxicab drives along a New York street with Zoe in the back seat looking out through the rainsplashed window as if in a trance. The cab pulls up and Zoe and Kate get out. Zoe slings a red rucksack over her shoulder and stands looking up at Kate’s apartment building a smart brownstone with a wide set of steps leading up to an arched entranceway. Inside Kate shows Zoe around the apartment walks down a hallway and Zoe walks slowly into her new bedroom which is light and airy with a large bay window and window seat and a huge double bed. At a cemetery high on a hill overlooking the city Zoe stares morosely at her mother's casket which sits by the graveside. As other mourners begin to disburse Zoe turns to Kate and the two of them walk slowly away. A large lifelike cuddly toy giraffe is carried up the steps of Kate's brownstone followed by more toys and a bike being taken inside while Zoe carries a stuffed elephant. A collection of cuddly toys is arranged around Zoe’s room."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Kate slowly wakes up and takes in her surroundings and looks across at Zoe who is staring at her. Aunt and niece gaze at each other for a few moments then Kate sits up and stares unblinkingly at the young girl. Tears roll down Zoe's face and Kate nods sadly. Zoe's anguished face is crumpled as a tear trickles down Kate’s face. Kate walks wearily into her apartment removes her long red scarf from around her neck and walks over to the answer machine. Transfixed Kate stands in the hallway clutching her coat then turns and walks back towards the door. Zoe slings a red rucksack over her shoulder and stands looking up at Kate’s apartment building a smart brownstone with a wide set of steps leading up to an arched entranceway. Inside Kate shows Zoe around the apartment walks down a hallway and Zoe walks slowly into her new bedroom which is light and airy with a large bay window and window seat and a huge double bed. At a cemetery high on a hill overlooking the city Zoe stares morosely at her mother's casket which sits by the graveside. As other mourners begin to disburse Zoe turns to Kate and the two of them walk slowly away. A large lifelike cuddly toy giraffe is carried up the steps of Kate's brownstone followed by more toys and a bike being taken inside while Zoe carries a stuffed elephant. A collection of cuddly toys is arranged around Zoe’s room."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Kate slowly wakes up and takes in her surroundings and looks across at Zoe who is staring at her. Aunt and niece gaze at each other for a few moments then Kate sits up and stares unblinkingly at the young girl. As other mourners begin to disburse Zoe turns to Kate and the two of them walk slowly away. A large lifelike cuddly toy giraffe is carried up the steps of Kate's brownstone followed by more toys and a bike being taken inside while Zoe carries a stuffed elephant. A collection of cuddly toys is arranged around Zoe’s room."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Larry abruptly leaps up and surveys his surroundings and glances across at Max, who’s grinning at him. Uncle and nephew squint at each other for a few seconds, then Larry jumps up and grins toothily at the young boy. Raindrops tumble down Max's arm, and Larry shrugs happily. Max's joyful arm is rigid as a droplet slides down Larry’s leg. Larry hops briskly into his caravan, retrieves his short, blue tie from around his waist, and skips over to the radio. Enthralled, Larry lingers in the corridor, gripping his umbrella, then pivots and skips back towards the gate. At the stadium, they all pivot and grin as Larry skips in and past them, while Rachel lowers her notebook. In the vacant office, Larry ties his belt around his shoulder, and without glancing at Rachel, Larry skips away. Interested, Sarah glances over at Larry, who seems focused, her fingers clutching with excitement. Larry crouches on the ceiling of the walk-in oven with David's portrait, and Rachel peeks in at him through a skylight in the roof. Overjoyed, Larry glances up as Rachel exits, shrugging, her cheek trembling, while Rachel grasps Larry's feet. In Max's dojo, Larry skips in, goes to the edge of Max’s mat, and tosses his helmet down on the over-mat cushion. Larry grabs the helmet and tosses it on a shelf by the door, places his backpack beside it, and tosses off his umbrella and tie as he sings to Max. Max returns to enjoying the Mickey Mouse opera as Larry jumps in the chair beside his mat. Max glances away but gives a bold shake and spins back to the TV. A purple hot air balloon floats along a London river, with Max in the basket, peering out through the foggy sky as if in a daze. The balloon lands, and Max and Larry hop out. Max hurls a blue backpack over his ankle and stands peering down at Larry’s caravan complex, a sleek skyscraper with a narrow set of tunnels leading down to a square driveway. Outside, Larry guides Max around the caravan, skips down a corridor, and Max skips briskly into his fresh chamber, which is dark and cozy, with a tiny circular window and floor mat and a tiny single table. At a stadium deep in a forest overlooking the valley, Max peers gleefully at his sister's cup, which rests near the riverside. As other spectators begin to gather, Max spins to Larry, and the two of them skip briskly away. A small, flat, plastic robot chicken is dragged down the driveway of Larry's skyscraper, accompanied by fewer gadgets and a skateboard being rolled inside, while Max rolls a cardboard panda. A pile of plastic gadgets is thrown around Max’s chamber."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Kate wakes and exchanges a tearful gaze with her niece, Zoe, indicating shared grief. Kate, visibly weary, returns to her apartment, removes her scarf, and is momentarily paralyzed by an emotional voicemail. At a restaurant, Kate's distraction worries Leah as she silently retreats to the kitchen. There, Kate, distressed and holding Christine's letter, is comforted by Paula. In Zoe's hospital room, Kate gently interacts with her niece while Zoe watches cartoons. Later, Zoe, deep in thought, rides a taxi with Kate to her new home, a brownstone. Inside, Zoe explores her bright new bedroom. At the cemetery, Zoe mournfully observes her mother's casket before leaving with Kate. Finally, toys and a bike are brought into Kate's home for Zoe, symbolizing a beginning of healing, as Zoe arranges her stuffed animals in her room."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A collection of cuddly toys is arranged around Zoe’s room A large lifelike cuddly toy giraffe is carried up the steps of Kate's brownstone followed by more toys and a bike being taken inside while Zoe carries a stuffed elephant  As other mourners begin to disburse Zoe turns to Kate and the two of them walk slowly away  At a cemetery high on a hill overlooking the city Zoe stares morosely at her mother's casket which sits by the graveside  Inside Kate shows Zoe around the apartment walks down a hallway and Zoe walks slowly into her new bedroom which is light and airy with a large bay window and window seat and a huge double bed  Zoe slings a red rucksack over her shoulder and stands looking up at Kate’s apartment building a smart brownstone with a wide set of steps leading up to an arched entranceway  The cab pulls up and Zoe and Kate get out  A yellow taxicab drives along a New York street with Zoe in the back seat looking out through the rainsplashed window as if in a trance  Zoe looks away but gives a faint nod and turns back to the TV  Zoe goes back to watching the Bugs Bunny cartoon as Kate sits in the chair beside her bed  Kate takes the bag and places it on a chair by the window puts her handbag beside it and takes off her coat and scarf as she talks to Zoe  In Zoe's hospital room Kate walks in goes to the end of Zoe’s bed and places her bag down on the overbed table  Distraught Kate looks up as Paula enters nodding her chin quivering while Paula takes hold of Kate's hands  Kate crouches on the floor of the walkin fridge with Christine's letter and Paula looks in at her through a window in the door  Concerned Leah looks over at Kate who seems distracted her eyes filling with tears  In the empty kitchen Kate ties her apron around her waist and without looking at Paula Kate walks away  At the restaurant they all turn and stare as Kate walks in and past them while Paula puts her wineglass down  Transfixed Kate stands in the hallway clutching her coat then turns and walks back towards the door  Kate walks wearily into her apartment removes her long red scarf from around her neck and walks over to the answer machine  Zoe's anguished face is crumpled as a tear trickles down Kate’s face  Tears roll down Zoe's face and Kate nods sadly  Aunt and niece gaze at each other for a few moments then Kate sits up and stares unblinkingly at the young girl  Kate slowly wakes up and takes in her surroundings and looks across at Zoe who’s staring at her "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Aunt and niece gaze at each other for a few moments then Kate sits up and stares unblinkingly at the young girl Kate slowly wakes up and takes in her surroundings and looks across at Zoe who is staring at her Zoe's anguished face is crumpled as a tear trickles down Kate’s face Tears roll down Zoe's face and Kate nods sadly Transfixed Kate stands in the hallway clutching her coat then turns and walks back towards the door Kate walks wearily into her apartment removes her long red scarf from around her neck and walks over to the answer machine In the empty kitchen Kate ties her apron around her waist and without looking at Paula Kate walks away At the restaurant they all turn and stare as Kate walks in and past them while Paula puts her wineglass down Kate crouches on the floor of the walkin fridge with Christine's letter and Paula looks in at her through a window in the door Concerned Leah looks over at Kate who seems distracted her eyes filling with tears In Zoe's hospital room Kate walks in goes to the end of Zoe’s bed and places her bag down on the overbed table Distraught Kate looks up as Paula enters nodding her chin quivering while Paula takes hold of Kate's hands Zoe goes back to watching the Bugs Bunny cartoon as Kate sits in the chair beside her bed Kate takes the bag and places it on a chair by the window puts her handbag beside it and takes off her coat and scarf as she talks to Zoe A yellow taxicab drives along a New York street with Zoe in the back seat looking out through the rainsplashed window as if in a trance Zoe looks away but gives a faint nod and turns back to the TV Zoe slings a red rucksack over her shoulder and stands looking up at Kate’s apartment building a smart brownstone with a wide set of steps leading up to an arched entranceway The cab pulls up and Zoe and Kate get out At a cemetery high on a hill overlooking the city Zoe stares morosely at her mother's casket which sits by the graveside Inside Kate shows Zoe around the apartment walks down a hallway and Zoe walks slowly into her new bedroom which is light and airy with a large bay window and window seat and a huge double bed A large lifelike cuddly toy giraffe is carried up the steps of Kate's brownstone followed by more toys and a bike being taken inside while Zoe carries a stuffed elephant As other mourners begin to disburse Zoe turns to Kate and the two of them walk slowly away A collection of cuddly toys is arranged around Zoe’s room"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Kate takes the bag and places it on a chair by the window puts her handbag beside it and takes off her coat and scarf as she talks to Zoe  Zoe goes back to watching the Bugs Bunny cartoon as Kate sits in the chair beside her bed  Zoe looks away but gives a faint nod and turns back to the TV  A yellow taxicab drives along a New York street with Zoe in the back seat looking out through the rainsplashed window as if in a trance  The cab pulls up and Zoe and Kate get out  Zoe slings a red rucksack over her shoulder and stands looking up at Kate’s apartment building a smart brownstone with a wide set of steps leading up to an arched entranceway  Inside Kate shows Zoe around the apartment walks down a hallway and Zoe walks slowly into her new bedroom which is light and airy with a large bay window and window seat and a huge double bed  At a cemetery high on a hill overlooking the city Zoe stares morosely at her mother's casket which sits by the graveside  As other mourners begin to disburse Zoe turns to Kate and the two of them walk slowly away  A large lifelike cuddly toy giraffe is carried up the steps of Kate's brownstone followed by more toys and a bike being taken inside while Zoe carries a stuffed elephant  A collection of cuddly toys is arranged around Zoe’s room Kate slowly wakes up and takes in her surroundings and looks across at Zoe who’s staring at her  Aunt and niece gaze at each other for a few moments then Kate sits up and stares unblinkingly at the young girl  Tears roll down Zoe's face and Kate nods sadly  Zoe's anguished face is crumpled as a tear trickles down Kate’s face  Kate walks wearily into her apartment removes her long red scarf from around her neck and walks over to the answer machine  Transfixed Kate stands in the hallway clutching her coat then turns and walks back towards the door  At the restaurant they all turn and stare as Kate walks in and past them while Paula puts her wineglass down  In the empty kitchen Kate ties her apron around her waist and without looking at Paula Kate walks away  Concerned Leah looks over at Kate who seems distracted her eyes filling with tears  Kate crouches on the floor of the walkin fridge with Christine's letter and Paula looks in at her through a window in the door  Distraught Kate looks up as Paula enters nodding her chin quivering while Paula takes hold of Kate's hands  In Zoe's hospital room Kate walks in goes to the end of Zoe’s bed and places her bag down on the overbed table "
        }
      ]
    }
  ]
}