{
  "ground_truth": "Kate arrives home and looks around with a frown, making her way to the kitchen where a plate of cigarette ends sits on the table. She picks it up and empties the cigarette butts into the bin. Kate looks at a clock above the stove and then makes her way down the hall to Zoe's bedroom, where Zoe has made herself a den under the bed. Kate nods, then peers under the bed to see that Zoe has several stuffed toys with her. Zoe gives a brief nod and looks away from her aunt, and Kate's smile fades as she looks down sadly. Zoe turns back to Kate and gives a faint smile. Kate kisses her fingers and touches Zoe's forehead before pulling the valance sheet down, hiding Zoe from view. Kate stands up, walks slowly out of the bedroom, and makes to close the door behind her but has a change of heart and leaves it open. The next day, Kate and Zoe walk down the street towards the restaurant. Paula looks up as they enter the restaurant, and Kate leads Zoe towards the kitchen. Inside, a bored Zoe sits on a worktop, swinging her legs, while Kate chats to Leah, and Nick, who has overheard, searches on a shelf behind Zoe and brings out a bowl and bunch of basil. He places the bowl next to Zoe, sniffs the basil, and begins to pick the leaves, then holds the bunch out to Zoe, who smells it. Kate sees Nick talking to Zoe and watches as he gives her a handful of basil, and although the youngster hesitates, she begins to help him pick the leaves. Paula walks in and then goes back into the restaurant. Later, Nick empties a pan of spaghetti and tomato sauce into a large pasta bowl and walks over to where Zoe is sitting, joining her with the spaghetti. Zoe watches him a little shyly as Nick sprinkles some of the basil leaves over his meal, winds the spaghetti around his fork, and begins to eat. Zoe eyes the food hungrily, and when a waiter addresses the kitchen, Nick hands the bowl of spaghetti to Zoe and goes back to work, watching her as she looks down longingly at the pasta. Zoe looks over at Nick, then back down at the spaghetti and gingerly picks up the fork to take a mouthful. Nick continues to watch her as she tucks in hungrily to the spaghetti and grins at him. Walking back into the kitchen, Kate picks up her apron and ties it around her waist, gaping in surprise as she sees Zoe devouring the bowl of spaghetti.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Kate reaches home and glances around with a grimace, making her way to the culinary area where a dish of cigarette ends rests on the table. She lifts it up and dumps the cigarette butts into the trash. Kate glances at a timepiece above the stove and then makes her way down the corridor to Zoe's chamber, where Zoe has fashioned herself a lair beneath the bed. Kate nods, then peers under the bed to see that Zoe has several plush toys with her. Zoe gives a brief nod and glances away from her aunt, and Kate's smile diminishes as she looks down sorrowfully. Zoe turns back to Kate and gives a faint smile. Kate kisses her fingers and touches Zoe's forehead before pulling the valance sheet down, concealing Zoe from view. Kate stands up, strolls slowly out of the chamber, and makes to close the door behind her but has a change of heart and leaves it open. The next day, Kate and Zoe stroll down the road towards the eatery. Paula glances up as they enter the eatery, and Kate guides Zoe towards the culinary area. Inside, a bored Zoe sits on a countertop, swinging her legs, while Kate chats to Leah, and Nick, who has overheard, searches on a shelf behind Zoe and brings out a bowl and bunch of basil. He places the bowl next to Zoe, sniffs the basil, and begins to pick the leaves, then holds the bunch out to Zoe, who smells it. Kate sees Nick conversing with Zoe and observes as he gives her a handful of basil, and although the youngster hesitates, she begins to assist him in picking the leaves. Paula enters and then goes back into the eatery. Later, Nick empties a saucepan of pasta and tomato sauce into a large pasta bowl and walks over to where Zoe is sitting, joining her with the pasta. Zoe observes him a little shyly as Nick sprinkles some of the basil leaves over his dish, winds the pasta around his fork, and begins to eat. Zoe eyes the food hungrily, and when a server addresses the culinary area, Nick hands the bowl of pasta to Zoe and goes back to work, watching her as she looks down longingly at the pasta. Zoe looks over at Nick, then back down at the pasta and cautiously picks up the fork to take a bite. Nick continues to watch her as she digs in ravenously to the pasta and grins at him. Walking back into the culinary area, Kate picks up her apron and ties it around her waist, gaping in astonishment as she sees Zoe devouring the bowl of pasta."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Kate arrives home and looks around with a frown, making her way to the kitchen where a plate of cigarette ends sits on the table. It is picked up by her, and she empties the cigarette butts into the bin. A clock above the stove is looked at by Kate, and then she makes her way down the hall to Zoe's bedroom, where a den under the bed has been made by Zoe. A nod is given by Kate, then the space under the bed is peered into by her to see that several stuffed toys are with Zoe. Zoe gives a brief nod and looks away from her aunt, and Kate's smile is made to fade as she looks down sadly. Zoe turns back to Kate and gives a faint smile. Her fingers are kissed by Kate, and Zoe's forehead is touched by her before the valance sheet is pulled down, and Zoe is hidden from view. Kate stands up, walks slowly out of the bedroom, and intends to close the door behind her but changes her mind and leaves it open. The next day, the street is walked down by Kate and Zoe towards the restaurant. Paula looks up as the restaurant is entered by them, and Kate leads Zoe towards the kitchen. Inside, a bored Zoe sits on a worktop, swinging her legs, while Leah is chatted to by Kate, and behind Zoe, a search on a shelf is conducted by Nick, who has overheard, and a bowl and bunch of basil are brought out by him. The bowl is placed next to Zoe by him, the basil is sniffed, and then the leaves are picked by him, followed by the bunch being held out to Zoe, who smells it. Nick is seen talking to Zoe by Kate, and she watches as a handful of basil is given to her by him, and although the youngster hesitates, the leaves are begun to be picked by her to help him. Paula walks in and then goes back into the restaurant. Later, a pan of spaghetti and tomato sauce is emptied into a large pasta bowl by Nick, and he walks over to where Zoe is sitting, joining her with the spaghetti. He is watched a little shyly by Zoe as some of the basil leaves are sprinkled over his meal by Nick, the spaghetti is wound around his fork, and he begins to eat. The food is eyed hungrily by Zoe, and when the waiter addresses the kitchen, the bowl of spaghetti is handed to Zoe by Nick, and he goes back to work, watching her as she looks down longingly at the pasta. Nick is looked over at by Zoe, then the spaghetti is looked down at again by her, and gingerly the fork is picked up to take a mouthful. She is watched by Nick as the spaghetti is hungrily tucked into by her, and she grins at him. Walking back into the kitchen, her apron is picked up by Kate and tied around her waist, and she gapes in surprise as the bowl of spaghetti is devoured by Zoe."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Kate arrives home, frowning as she heads to the kitchen where a plate of cigarette butts sits. She empties them into the bin, checks the clock above the stove, and moves to Zoe's room. Zoe has made a den under the bed with stuffed toys. Kate nods and smiles sadly when Zoe looks away, then kisses her fingers and touches Zoe's forehead before covering her with the valance sheet. Exiting slowly, she initially closes the door but decides to leave it open. The next day, Kate and Zoe walk to the restaurant. Inside, Zoe sits on a worktop as Kate chats with Leah. Nick, overhearing, finds a bowl and basil, handing some to Zoe. Hesitant, she starts helping him pick the leaves. Paula enters briefly and leaves. Later, Nick serves spaghetti and tomato sauce, joining Zoe. She watches him sprinkle basil over his meal and eat. Eyeing the food, Zoe is given the bowl by Nick when he returns to work. She looks at the spaghetti longingly, then eats hungrily, smiling at Nick. Kate returns, ties on her apron, and is surprised to see Zoe devouring the spaghetti."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Kate arrives home, frowns, and heads to the kitchen, finding a plate of cigarette butts. She empties it, checks the clock, and walks to Zoe's bedroom. Zoe is under the bed with stuffed toys. Kate nods, peers under, and exchanges glances with Zoe, who nods back. Kate kisses her fingers, touches Zoe’s forehead, pulls the cover down, and leaves the door ajar. The next day, Kate and Zoe head to a restaurant. Inside, a bored Zoe sits as Kate chats with Leah. Nick offers Zoe basil; she hesitantly helps him pick leaves. Later, Nick serves spaghetti, joins Zoe, and garnishes his meal. Zoe eyes the food hungrily. Nick gives her the spaghetti bowl, and she eats eagerly, smiling at him. Kate, returning to the kitchen, ties her apron and is surprised by Zoe devouring the pasta."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Upon arriving home, Kate surveys her surroundings with a distinct frown etched across her face. She makes her way purposefully to the kitchen, where her eyes fall upon a plate littered with cigarette ends, carelessly left on the table. With a sigh, she picks up the plate, diligently disposing of the cigarette butts into the trash bin. Her gaze then shifts to the clock perched above the stove, marking the passage of time, before she turns and heads down the hall towards Zoe's bedroom. There, Zoe has ingeniously crafted a cozy den beneath the bed. Kate nods in acknowledgment, lowering herself to peer beneath the bed to find Zoe nestled with an assortment of stuffed animal toys. Zoe returns her aunt's nod briefly but averts her gaze, causing Kate's warm smile to fade into a look of sadness. Zoe, sensing the change, glances back at Kate and offers a faint, reassuring smile. With tenderness, Kate kisses her fingertips and gently touches Zoe's forehead, then lowers the valance sheet, concealing Zoe once more. Rising to her feet, Kate walks slowly out of the bedroom, pausing as she reaches the door. She hesitates, decides against closing it, and leaves it ajar.\n\nThe following day, Kate and Zoe are seen walking together down the bustling street towards a nearby restaurant. Upon their arrival, Paula looks up from her station and observes them entering. Kate, acting as a guide, leads Zoe towards the restaurant’s kitchen. Inside the bustling kitchen, a visibly bored Zoe perches on a worktop, her legs swinging idly back and forth, while Kate engages in animated conversation with Leah. Nearby, Nick, who has been eavesdropping on their chat, rummages through a shelf behind Zoe. He retrieves a bowl along with a fragrant bunch of basil. Placing the bowl nearby, he inhales the fresh scent of the basil before he begins to meticulously pick the leaves. Offering the enticing bunch to Zoe, he encourages her to smell it herself. Noticing this interaction, Kate pauses in her conversation to watch as Nick hands a portion of the basil to Zoe. Though hesitant at first, the young girl eventually joins in, assisting him in picking the leaves. Paula enters the kitchen briefly but retreats back into the restaurant without a word.\n\nLater on, Nick carefully pours a steaming pan of spaghetti and rich tomato sauce into a generously sized pasta bowl and strolls over to where Zoe is seated, joining her with the tempting dish before him. Zoe, feeling slightly shy, watches him intently as he deftly sprinkles some of the freshly picked basil leaves over his meal, deftly winding the spaghetti around his fork before savoring a bite. With growing hunger, Zoe eyes the enticing food. When a waiter ventures into the kitchen to address someone, Nick seizes the moment to hand the bowl of spaghetti to Zoe and resumes his work, occasionally glancing over to watch as she gazes longingly at the inviting pasta. Gathering her courage, Zoe looks over at Nick, then back down at the spaghetti, gingerly picking up the fork to take her first mouthful. Nick continues to observe her with interest as she eagerly tucks into the spaghetti, grinning at him with newfound delight. As Kate reenters the kitchen, she dons her apron, tying it securely around her waist. Her eyes widen in surprise and joy upon seeing Zoe happily devouring the bowl of spaghetti with newfound enthusiasm."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Upon arriving home, Kate takes a moment to thoroughly survey her immediate surroundings, her expression marked by a distinct and noticeable frown etched across her face. She then makes her way purposefully and with determination to the kitchen, where her eyes fall upon a plate cluttered with cigarette ends, carelessly abandoned on the table. With a weary sigh, she picks up the plate and diligently disposes of the cigarette butts into the trash bin, ensuring they are well out of sight. Her gaze then shifts to the clock, perched prominently above the stove, marking the steady passage of time. After a moment of reflection, she turns and makes her way down the hall, heading decisively towards Zoe's bedroom. In the room, Zoe has ingeniously crafted a cozy little den beneath her bed. Kate nods in acknowledgment of this creation, lowering herself to peer beneath the bed, where she finds Zoe nestled comfortably with an assortment of stuffed animal toys. Zoe returns her aunt's nod briefly but quickly averts her gaze, which causes Kate's warm smile to fade into a look of sadness. Zoe, sensing the change in mood, glances back at Kate and offers a faint, yet reassuring smile. With tenderness and affection, Kate kisses her fingertips and gently touches Zoe's forehead, then lowers the valance sheet to conceal Zoe once more. Rising to her feet, Kate walks slowly out of the bedroom, pausing thoughtfully as she reaches the door. She hesitates for a moment, decides against closing it entirely, and instead leaves it ajar.\n\nThe following day unfolds with Kate and Zoe seen walking together down the bustling street, making their way towards a nearby restaurant. Upon their arrival, Paula looks up from her station and observes them entering the establishment. Kate, acting as a guide and protector, leads Zoe towards the restaurant’s lively and bustling kitchen. Inside the bustling kitchen environment, a visibly bored Zoe is perched on a worktop, her legs swinging idly back and forth, while Kate engages in animated conversation with Leah, her hands gesturing expressively. Nearby, Nick, who has been discreetly eavesdropping on their chat, rummages through a shelf situated behind Zoe. He retrieves a bowl along with a fragrant and aromatic bunch of basil. Placing the bowl nearby, he takes a moment to inhale the fresh, invigorating scent of the basil before he begins to meticulously pick the tender leaves. Offering the enticing bunch to Zoe, he encourages her to take a moment to smell it herself. Noticing this interaction, Kate pauses in her conversation to observe as Nick hands a portion of the basil to Zoe. Though hesitant at first, the young girl eventually joins in, assisting him in picking the leaves. Paula enters the kitchen briefly, casting a quick glance around, but then retreats back into the main area of the restaurant without uttering a word.\n\nLater on, Nick carefully and skillfully pours a steaming pan of spaghetti accompanied by a rich and savory tomato sauce into a generously sized pasta bowl. With a casual stroll, he approaches where Zoe is seated and joins her with the tempting dish placed before him. Zoe, feeling slightly shy, watches him intently as he deftly sprinkles some of the freshly picked basil leaves over his meal, expertly winding the spaghetti around his fork before savoring a bite. With growing hunger, Zoe eyes the enticing food before her. When a waiter ventures into the kitchen to address someone, Nick seizes the opportunity to hand the bowl of spaghetti to Zoe and then resumes his work, occasionally glancing over to watch as she gazes longingly at the inviting pasta. Gathering her courage, Zoe looks over at Nick, then back down at the spaghetti, gingerly picking up the fork to take her first mouthful. Nick continues to observe her with interest as she eagerly tucks into the spaghetti, grinning at him with newfound delight and satisfaction. As Kate reenters the kitchen, she dons her apron, tying it securely and snugly around her waist. Her eyes widen in surprise and joy upon seeing Zoe happily devouring the bowl of spaghetti with newfound enthusiasm and savoring each bite."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Kate arrives home and, upon opening the door, immediately casts her gaze around the room with a frown etched on her face. Her eyes scan her surroundings as she moves purposefully toward the kitchen, where she is greeted by the sight of a plate filled with cigarette ends casually resting on the table. She approaches the table, reaches out to grab the plate, and methodically carries it over to the bin. With a decisive motion, she tips the plate, allowing the cigarette butts to cascade into the bin. Satisfied with her small act of tidiness, Kate's attention is then drawn to the clock positioned above the stove. She observes the time, mentally noting it, then departs from the kitchen, making her way down the hall. Her destination is Zoe's bedroom, where upon arrival, she discovers that Zoe has ingeniously created a den for herself underneath the bed. Kate gives a nod of acknowledgment, her eyes narrowing slightly as she bends down to peer into the cozy space. Her gaze takes in the collection of several stuffed toys clustered around Zoe. Zoe, in response to her aunt's presence, gives a brief nod before shifting her gaze away, avoiding further eye contact. Observing this, Kate's hopeful smile gradually fades, replaced by a look of sadness as she gazes down at her niece. In an unexpected moment of connection, Zoe turns her attention back to Kate and offers a faint, tentative smile. In a gesture filled with tenderness, Kate kisses her own fingers and gently taps them against Zoe's forehead, a silent sign of affection and reassurance. With that, she reaches for the edge of the valance sheet and carefully pulls it down, effectively obscuring Zoe from view. Standing up with deliberate slowness, Kate turns and begins to walk out of the bedroom, her steps measured and intentional, and pauses at the doorway, initially intent on closing the door. However, at the last moment, she reconsiders, changes her mind, and leaves the door ajar. The transition to the next day finds Kate and Zoe walking side by side down the street, their destination a nearby restaurant. As they step inside, Paula glances up, acknowledging their entrance with a nod. Kate gently leads Zoe through the restaurant and into the bustling kitchen. Inside the kitchen, Zoe finds herself seated on a worktop, her legs swinging back and forth in unison with her growing boredom, while Kate engages in animated conversation with Leah. Meanwhile, Nick, having overheard Kate and Leah's chat, turns his attention to a shelf located behind Zoe and begins a search. He soon discovers a bowl and a bunch of basil, which he retrieves with a sense of purpose. Approaching Zoe, he places the bowl beside her and sniffs the aromatic basil before methodically picking the leaves off. With a friendly gesture, he offers the bunch to Zoe, who leans in and takes a tentative sniff. Observing this interaction from a distance, Kate notices Nick speaking to Zoe and carefully watches as he hands her a small handful of basil leaves. Although Zoe hesitates initially, she soon joins in the activity, helping him pick the remaining leaves. As this unfolds, Paula briefly enters the kitchen, surveys the scene, and then retreats back into the restaurant. The day progresses, and later, Nick stands by the stove, emptying a pan brimming with spaghetti and tomato sauce into a large pasta bowl, which he then carries over to join Zoe, who continues to sit in her perch. Zoe watches Nick with a mix of curiosity and shyness as he sprinkles the basil leaves over his portion of pasta, expertly winds the spaghetti around his fork, and begins to eat. Her eyes linger on the meal with a hunger that is unmistakable. As a waiter calls out to the kitchen, Nick, sensing the opportunity, hands the inviting bowl of spaghetti to Zoe before returning to his duties. He remains watchful, observing her as she gazes down at the pasta, longing evident in her expression. Zoe glances over at Nick briefly before returning her focus to the dish in front of her, finally summoning the courage to gingerly pick up the fork and take a hesitant mouthful. As she tastes the spaghetti, her initial caution gives way to enthusiasm, and she begins to eat hungrily, her face lighting up with delight as she grins at Nick. As this heartwarming scene unfolds, Kate re-enters the kitchen, securing her apron around her waist, only to gape in surprise as she witnesses Zoe enthusiastically devouring the bowl of spaghetti, a sight that fills the room with an unexpected and heartening sense of normalcy and joy."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Kate returns home, frowning as she heads to the kitchen to dispose of a plate of cigarette ends. Noticing the clock above the stove, she proceeds to Zoe's bedroom, where she finds Zoe nestled with her stuffed toys under the bed. A silent exchange occurs between them, with Zoe's brief smile prompting Kate to affectionately touch Zoe’s forehead before pulling down the valance sheet for privacy. As Kate leaves, she decides to keep the door open.\n\nThe following day, Kate and Zoe head to the restaurant together. They are greeted by Paula upon entering, then continue to the kitchen where Zoe sits idly on a worktop. While Kate converses with Leah, Nick engages Zoe by presenting her with a bunch of basil. Although hesitant at first, Zoe eventually participates in picking the leaves with Nick's gentle encouragement. Moments later, as Nick serves a bowl of spaghetti and tomato sauce, he shares some basil leaves with Zoe and starts to eat. Zoe, eyeing the spaghetti hungrily, is handed the bowl when Nick is called away by a waiter. Encouraged by Nick's supportive gaze, Zoe begins to eat. Kate, re-entering the kitchen and putting on her apron, is surprised and pleased to see Zoe enjoying her meal with gusto."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Kate arrives home and looks around with a frown, making her way to the kitchen where a plate of cigarette ends, remnants of her late sister's habit that Kate had struggled to quit herself, sits on the table. She picks it up and empties the cigarette butts into the bin, recalling her promise to keep the house smoke-free for Zoe's sake. Kate looks at a clock above the stove, an antique piece inherited from her grandmother, and then makes her way down the hall to Zoe's bedroom, where Zoe has made herself a den under the bed, a cozy retreat lined with blankets. Kate nods, then peers under the bed to see that Zoe has several stuffed toys with her, each one a member of the cherished collection she inherited from her mother. Zoe gives a brief nod and looks away from her aunt, and Kate's smile fades as she looks down sadly, remembering the struggles they both faced after the accident. Zoe turns back to Kate and gives a faint smile that feels like a small victory to her aunt. Kate kisses her fingers and touches Zoe's forehead, a gesture they shared since Zoe was a baby, before pulling the valance sheet down, hiding Zoe from view in her comforting hideaway. Kate stands up, walks slowly out of the bedroom, and makes to close the door behind her but has a change of heart and leaves it open, allowing Zoe to know she's welcome anytime.\n\nThe next day, Kate and Zoe walk down the street towards the restaurant, a family-owned Italian bistro that welcomed them into its bustling heart after Kate took a job there. Paula, the friendly owner who had known Kate's family for years, looks up as they enter the restaurant, and Kate leads Zoe towards the kitchen. Inside, a bored Zoe sits on a worktop, swinging her legs, while Kate chats to Leah, the head chef known for her culinary expertise and warmth, and Nick, who has overheard, searches on a shelf behind Zoe and brings out a bowl and bunch of basil, freshly delivered from a local farm that morning. He places the bowl next to Zoe, sniffs the basil, which is known for its sweet aroma, and begins to pick the leaves, then holds the bunch out to Zoe, who smells it, enchanted by its fragrance. Kate sees Nick talking to Zoe and watches as he gives her a handful of basil, and although the youngster hesitates, she begins to help him pick the leaves, enjoying her first real interaction in the kitchen. Paula walks in and then goes back into the restaurant, content to see Zoe settling in. Later, Nick empties a pan of spaghetti and tomato sauce, a signature dish of the restaurant renowned for its rich flavor, into a large pasta bowl and walks over to where Zoe is sitting, joining her with the spaghetti. Zoe watches him a little shyly as Nick sprinkles some of the basil leaves over his meal, winds the spaghetti around his fork, and begins to eat. Zoe eyes the food hungrily, her stomach rumbling in response, and when a waiter addresses the kitchen, Nick hands the bowl of spaghetti to Zoe and goes back to work, watching her as she looks down longingly at the pasta, a meal she hadn't seen since her mother would make it. Zoe looks over at Nick, then back down at the spaghetti and gingerly picks up the fork to take a mouthful, savoring the taste. Nick continues to watch her as she tucks in hungrily to the spaghetti and grins at him, feeling a warmth from his approval. Walking back into the kitchen, Kate picks up her apron and ties it around her waist, gaping in surprise as she sees Zoe devouring the bowl of spaghetti, finally showing interest in a meal."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Kate arrives home and looks around with a frown making her way to the kitchen where a plate of cigarette ends sits on the table. She picks it up and empties the cigarette butts into the bin. Kate looks at a clock above the stove and then makes her way down the hall to Zoe's bedroom where Zoe has made herself a den under the bed. Kate nods then peers under the bed to see that Zoe has several stuffed toys with her. Zoe gives a brief nod and looks away from her aunt and Kate's smile fades as she looks down. sadly. Zoe turns back to Kate and gives a faint smile. Kate kisses her fingers and touches Zoe's forehead before pulling the valance sheet down hiding Zoe from view. Kate stands up walks slowly out of the bedroom and makes to close the door behind her but has a change of heart and leaves it open. The next day Kate and Zoe walk down the street towards the restaurant. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Paula looks up as they enter the restaurant and Kate leads Zoe towards the kitchen. Inside a bored Zoe sits on a worktop swinging her legs while Kate chats to Leah and Nick who has overheard searches on a shelf behind Zoe and brings out a bowl and bunch of basil. He places the bowl next to Zoe sniffs the basil and begins to pick the leaves then holds the bunch out to Zoe who smells it. Kate sees Nick talking to Zoe and watches as he gives her a handful of basil and although the youngster hesitates she begins to help him pick the leaves. Paula walks in and then goes back into the restaurant. Later Nick empties a pan of spaghetti and tomato sauce into a large pasta bowl and walks over to where Zoe is sitting joining her with the spaghetti. Zoe watches him a little shyly as Nick sprinkles some of the basil leaves over his meal winds the spaghetti around his fork and begins to eat. Zoe eyes the food hungrily and when a waiter addresses the kitchen Nick hands the bowl of spaghetti to Zoe and goes back to work watching her as she looks down longingly at the pasta. Zoe looks over at Nick then back down at the spaghetti and gingerly picks up the fork to take a mouthful Nick continues to watch her as she tucks in hungrily to the spaghetti and grins at him. Walking back into the kitchen Kate picks up her apron and ties it around her waist gaping in surprise as she sees Zoe devouring the bowl of spaghetti."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Kate arrives home and looks around with a frown making her way to the kitchen where a plate of cigarette ends sits on the table. She picks it up and empties the cigarette butts into the bin. Kate looks at a clock above the stove and then makes her way down the hall to Zoe's bedroom where Zoe has made herself a den under the bed. Kate nods then peers under the bed to see that Zoe has several stuffed toys with her. Zoe gives a brief nod and looks away from her aunt and Kate's smile fades as she looks down. sadly. Zoe turns back to Kate and gives a faint smile. Kate kisses her fingers and touches Zoe's forehead before pulling the valance sheet down hiding Zoe from view. Kate stands up walks slowly out of the bedroom and makes to close the door behind her but has a change of heart and leaves it open. The next day Kate and Zoe walk down the street towards the restaurant. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Paula looks up as they enter the restaurant and Kate leads Zoe towards the kitchen. Inside a bored Zoe sits on a worktop swinging her legs while Kate chats to Leah and Nick who has overheard searches on a shelf behind Zoe and brings out a bowl and bunch of basil. He places the bowl next to Zoe sniffs the basil and begins to pick the leaves then holds the bunch out to Zoe who smells it. Kate sees Nick talking to Zoe and watches as he gives her a handful of basil and although the youngster hesitates she begins to help him pick the leaves. Paula walks in and then goes back into the restaurant. Later Nick empties a pan of spaghetti and tomato sauce into a large pasta bowl and walks over to where Zoe is sitting joining her with the spaghetti. Zoe watches him a little shyly as Nick sprinkles some of the basil leaves over his meal winds the spaghetti around his fork and begins to eat. Zoe eyes the food hungrily and when a waiter addresses the kitchen Nick hands the bowl of spaghetti to Zoe and goes back to work watching her as she looks down longingly at the pasta. Zoe looks over at Nick then back down at the spaghetti and gingerly picks up the fork to take a mouthful Nick continues to watch her as she tucks in hungrily to the spaghetti and grins at him. Walking back into the kitchen Kate picks up her apron and ties it around her waist gaping in surprise as she sees Zoe devouring the bowl of spaghetti."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Kate arrives home and looks around with a frown making her way to the kitchen where a plate of cigarette ends sits on the table. She picks it up and empties the cigarette butts into the bin. Kate looks at a clock above the stove and then makes her way down the hall to Zoe's bedroom where Zoe has made herself a den under the bed. Kate nods then peers under the bed to see that Zoe has several stuffed toys with her. Zoe gives a brief nod and looks away from her aunt and Kate's smile fades as she looks down. Later Nick empties a pan of spaghetti and tomato sauce into a large pasta bowl and walks over to where Zoe is sitting joining her with the spaghetti. Zoe watches him a little shyly as Nick sprinkles some of the basil leaves over his meal winds the spaghetti around his fork and begins to eat. Zoe eyes the food hungrily and when a waiter addresses the kitchen Nick hands the bowl of spaghetti to Zoe and goes back to work watching her as she looks down longingly at the pasta. Zoe looks over at Nick then back down at the spaghetti and gingerly picks up the fork to take a mouthful Nick continues to watch her as she tucks in hungrily to the spaghetti and grins at him. Walking back into the kitchen Kate picks up her apron and ties it around her waist gaping in surprise as she sees Zoe devouring the bowl of spaghetti."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Kate arrives home and looks around with a frown making her way to the kitchen where a plate of cigarette ends sits on the table. She picks it up and empties the cigarette butts into the bin. Zoe looks over at Nick then back down at the spaghetti and gingerly picks up the fork to take a mouthful Nick continues to watch her as she tucks in hungrily to the spaghetti and grins at him. Walking back into the kitchen Kate picks up her apron and ties it around her waist gaping in surprise as she sees Zoe devouring the bowl of spaghetti."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Samantha stumbles into the park and glances around with a grin, skipping her way to the library where a mountain of crayons piles on the bookshelf. She grabs them and tosses the crayons into the trashcan. Samantha gazes at a painting above the fireplace and then dances her way down the path to Oliver's tent, where Oliver has constructed himself a fort inside the closet. Samantha shakes her head, then peers into the closet to see that Oliver has several rubber ducks with him. Oliver gives a slight shake of his head and looks toward his uncle, and Samantha's grin widens as she looks upward victoriously. Oliver turns back to Samantha and gives a broad grin. Samantha claps her hands and touches Oliver's cheek before pulling the curtain shut, hiding Oliver from sight. Samantha leaps up, skips joyfully out of the tent, and pretends to close the gate behind her but rethinks it and leaves it open. The following morning, Samantha and Oliver skip through the meadow towards the museum. Parker gazes down as they invade the museum, and Samantha guides Oliver towards the gallery. Inside, a restless Oliver balances on a stool, kicking his feet, while Samantha jokes with Liam, and Chris, who has eavesdropped, rummages on a cabinet behind Oliver and pulls out a vase and sprig of mint. He sets the vase next to Oliver, sniffs the mint, and starts to pluck the twigs, then hands the sprig out to Oliver, who inhales it. Samantha notices Chris interacting with Oliver and observes as he offers her a handful of mint, and although the child stalls, she begins to assist him in plucking the twigs. Parker rushes in and then retreats to the museum. Subsequently, Chris pours a bowl of cereal and honey into a massive salad platter and hops over to where Oliver is perching, joining him with the cereal. Oliver observes him a little awkwardly as Chris scatters some of the mint sprigs over his dish, twirls the cereal around his spoon, and starts to munch. Oliver eyes the snack eagerly, and when a janitor interrupts the gallery, Chris passes the platter of cereal to Oliver and resumes his task, eyeing her as she glances down wistfully at the salad. Oliver glances over at Chris, then back at the cereal and hesitantly grabs the spoon to take a bite. Chris keeps an eye on her as she digs in eagerly to the cereal and beams at him. Wandering back into the gallery, Samantha grabs her scarf and wraps it around her neck, marveling in amusement as she spots Oliver devouring the platter of cereal."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Kate returns home, frowning at the cigarette ends on the kitchen table, which she discards. She checks the clock before visiting her niece, Zoe, who has made a den under her bed with stuffed toys. Kate's initial smile fades as Zoe briefly acknowledges her, but a faint smile from Zoe prompts Kate to tenderly touch Zoe's forehead before leaving the door open. The following day, Kate and Zoe head to a restaurant. In the kitchen, Zoe, initially bored, becomes engaged when Nick offers her basil to smell and pick. Later, Nick shares his spaghetti meal with Zoe, who eagerly begins to eat, showing a newfound enthusiasm. When Kate returns, she's surprised to see Zoe enjoying the food."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Walking back into the kitchen Kate picks up her apron and ties it around her waist gaping in surprise as she sees Zoe devouring the bowl of spaghetti Zoe looks over at Nick then back down at the spaghetti and gingerly picks up the fork to take a mouthful Nick continues to watch her as she tucks in hungrily to the spaghetti and grins at him Zoe eyes the food hungrily and when a waiter addresses the kitchen Nick hands the bowl of spaghetti to Zoe and goes back to work watching her as she looks down longingly at the pasta Zoe watches him a little shyly as Nick sprinkles some of the basil leaves over his meal winds the spaghetti around his fork and begins to eat Later Nick empties a pan of spaghetti and tomato sauce into a large pasta bowl and walks over to where Zoe is sitting joining her with the spaghetti Paula walks in and then goes back into the restaurant Kate sees Nick talking to Zoe and watches as he gives her a handful of basil and although the youngster hesitates she begins to help him pick the leaves He places the bowl next to Zoe sniffs the basil and begins to pick the leaves then holds the bunch out to Zoe who smells it Inside a bored Zoe sits on a worktop swinging her legs while Kate chats to Leah and Nick who has overheard searches on a shelf behind Zoe and brings out a bowl and bunch of basil Paula looks up as they enter the restaurant and Kate leads Zoe towards the kitchen The next day Kate and Zoe walk down the street towards the restaurant Kate stands up walks slowly out of the bedroom and makes to close the door behind her but has a change of heart and leaves it open Kate kisses her fingers and touches Zoe's forehead before pulling the valance sheet down hiding Zoe from view Zoe turns back to Kate and gives a faint smile sadly Zoe gives a brief nod and looks away from her aunt and Kate's smile fades as she looks down Kate nods then peers under the bed to see that Zoe has several stuffed toys with her Kate looks at a clock above the stove and then makes her way down the hall to Zoe's bedroom where Zoe has made herself a den under the bed She picks it up and empties the cigarette butts into the bin Kate arrives home and looks around with a frown making her way to the kitchen where a plate of cigarette ends sits on the table"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "She picks it up and empties the cigarette butts into the bin Kate arrives home and looks around with a frown making her way to the kitchen where a plate of cigarette ends sits on the table Kate nods then peers under the bed to see that Zoe has several stuffed toys with her Kate looks at a clock above the stove and then makes her way down the hall to Zoe's bedroom where Zoe has made herself a den under the bed sadly Zoe gives a brief nod and looks away from her aunt and Kate's smile fades as she looks down Kate kisses her fingers and touches Zoe's forehead before pulling the valance sheet down hiding Zoe from view Zoe turns back to Kate and gives a faint smile The next day Kate and Zoe walk down the street towards the restaurant Kate stands up walks slowly out of the bedroom and makes to close the door behind her but has a change of heart and leaves it open Inside a bored Zoe sits on a worktop swinging her legs while Kate chats to Leah and Nick who has overheard searches on a shelf behind Zoe and brings out a bowl and bunch of basil Paula looks up as they enter the restaurant and Kate leads Zoe towards the kitchen Kate sees Nick talking to Zoe and watches as he gives her a handful of basil and although the youngster hesitates she begins to help him pick the leaves He places the bowl next to Zoe sniffs the basil and begins to pick the leaves then holds the bunch out to Zoe who smells it Later Nick empties a pan of spaghetti and tomato sauce into a large pasta bowl and walks over to where Zoe is sitting joining her with the spaghetti Paula walks in and then goes back into the restaurant Zoe eyes the food hungrily and when a waiter addresses the kitchen Nick hands the bowl of spaghetti to Zoe and goes back to work watching her as she looks down longingly at the pasta Zoe watches him a little shyly as Nick sprinkles some of the basil leaves over his meal winds the spaghetti around his fork and begins to eat Walking back into the kitchen Kate picks up her apron and ties it around her waist gaping in surprise as she sees Zoe devouring the bowl of spaghetti Zoe looks over at Nick then back down at the spaghetti and gingerly picks up the fork to take a mouthful Nick continues to watch her as she tucks in hungrily to the spaghetti and grins at him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Paula looks up as they enter the restaurant and Kate leads Zoe towards the kitchen Inside a bored Zoe sits on a worktop swinging her legs while Kate chats to Leah and Nick who has overheard searches on a shelf behind Zoe and brings out a bowl and bunch of basil He places the bowl next to Zoe sniffs the basil and begins to pick the leaves then holds the bunch out to Zoe who smells it Kate sees Nick talking to Zoe and watches as he gives her a handful of basil and although the youngster hesitates she begins to help him pick the leaves Paula walks in and then goes back into the restaurant Later Nick empties a pan of spaghetti and tomato sauce into a large pasta bowl and walks over to where Zoe is sitting joining her with the spaghetti Zoe watches him a little shyly as Nick sprinkles some of the basil leaves over his meal winds the spaghetti around his fork and begins to eat Zoe eyes the food hungrily and when a waiter addresses the kitchen Nick hands the bowl of spaghetti to Zoe and goes back to work watching her as she looks down longingly at the pasta Zoe looks over at Nick then back down at the spaghetti and gingerly picks up the fork to take a mouthful Nick continues to watch her as she tucks in hungrily to the spaghetti and grins at him Walking back into the kitchen Kate picks up her apron and ties it around her waist gaping in surprise as she sees Zoe devouring the bowl of spaghetti Kate arrives home and looks around with a frown making her way to the kitchen where a plate of cigarette ends sits on the table She picks it up and empties the cigarette butts into the bin Kate looks at a clock above the stove and then makes her way down the hall to Zoe's bedroom where Zoe has made herself a den under the bed Kate nods then peers under the bed to see that Zoe has several stuffed toys with her Zoe gives a brief nod and looks away from her aunt and Kate's smile fades as she looks down sadly Zoe turns back to Kate and gives a faint smile Kate kisses her fingers and touches Zoe's forehead before pulling the valance sheet down hiding Zoe from view Kate stands up walks slowly out of the bedroom and makes to close the door behind her but has a change of heart and leaves it open The next day Kate and Zoe walk down the street towards the restaurant"
        }
      ]
    }
  ]
}