{
  "ground_truth": "Kate looks quizzically at Leah, who smiles and gestures towards Nick. He turns around and nods with a smile. Zoe frowns at Nick. Leah, wearing a thick winter coat, slings her bag over her shoulder as she leaves the staff changing room. Kate walks into her office, where Zoe is slumped over the desk fast asleep. Kate places a scarf around her neck, and looks down at her drawing of a sailboat and a dolphin that Zoe's resting on. Kate carries Zoe through the kitchen, and as she reaches the door, she turns back to Nick with a warm smile. He looks back at her kindly and watches them go. In Zoe's dark bedroom, Kate lays her sleeping niece down gently onto the bed. She undoes the laces on Zoe's red and white baseball boots and removes them. She places one of Zoe's stuffed toys down beside her, and Zoe immediately cuddles up to it. The next morning, Kate reaches out to turn off her square-faced alarm clock, which reads half-past four. She turns onto her back and opens her eyes sleepily. Kate pulls on a dark Berber-style jacket as she walks through to the lounge to pick up her mobile and heads towards the front door. Kate peers back up the hallway at Zoe, who's standing in her bedroom doorway clutching her cuddly Kangaroo. At the fish market, a bored-looking Zoe stands nearby, still clutching her cuddly toy, and yawns sleepily. Back at home, Kate and Zoe are asleep on the sofa. Kate stares and checks her watch, then hurries off. Later, they run along the pavement to the school, and Kate watches Zoe as she climbs the front steps, opens the heavy front door, and goes inside. At the restaurant, Kate and Leah are with a mustachioed man. Leah sniffs it, and he reaches into a bag, conducting Leah as she breathes deeply. Kate walks into her apartment with a smile, her long, dark hair hanging loose in large, soft waves. She hangs her bag on a hook by the door, drops her keys into the bowl, and begins to remove her coat, but her smile suddenly disappears. She grabs her keys and her bag and scurries out again. In a taxi, Kate jumps out and hurries towards the school, where Zoe's sitting on the steps. Zoe ignores her, stands up, and strides peevishly towards the yellow cab. Kate follows her and gets in beside her, pulling the door shut. At home, Zoe stomps straight into her bedroom, and Kate walks into hers. Kate's bedroom door opens, and she slowly steps out into the hallway, crosses to Zoe's room, and hesitates for a moment before knocking on the door.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Kate gazes inquisitively at Leah, who grins and motions towards Nick. He rotates and acknowledges with a grin. Zoe scowls at Nick. Leah, clad in a thick winter jacket, hoists her satchel over her shoulder as she exits the staff changing area. Kate strides into her workspace, where Zoe is sprawled over the desk fast asleep. Kate wraps a scarf around her neck and glances down at her sketch of a sailboat and a dolphin that Zoe's resting on. Kate lifts Zoe through the kitchen, and as she arrives at the entrance, she turns back to Nick with a warm grin. He gazes back at her kindly and observes them depart. In Zoe's dim chamber, Kate lays her slumbering niece down tenderly onto the bed. She loosens the laces on Zoe's red and white baseball footwear and removes them. She places one of Zoe's stuffed playthings down beside her, and Zoe promptly cuddles up to it. The next dawn, Kate reaches out to turn off her square-faced alarm device, which shows half-past four. She turns onto her back and opens her eyes drowsily. Kate pulls on a dark Berber-style coat as she walks through to the lounge to pick up her cellphone and heads towards the front entrance. Kate peers back up the hallway at Zoe, who's standing in her bedroom doorway holding her cuddly Kangaroo. At the fish market, a tired-looking Zoe stands nearby, still holding her cuddly toy, and yawns sleepily. Back at home, Kate and Zoe are asleep on the couch. Kate gazes and checks her timepiece, then hurries off. Later, they sprint along the pavement to the school, and Kate observes Zoe as she climbs the front steps, opens the heavy front entrance, and goes inside. At the restaurant, Kate and Leah are with a mustachioed gentleman. Leah sniffs it, and he reaches into a bag, directing Leah as she breathes deeply. Kate walks into her apartment with a grin, her long, dark hair hanging loose in large, soft waves. She hangs her satchel on a hook by the entrance, drops her keys into the bowl, and begins to remove her coat, but her grin suddenly vanishes. She grabs her keys and her satchel and scurries out again. In a taxi, Kate jumps out and hurries towards the school, where Zoe's sitting on the steps. Zoe disregards her, stands up, and strides irritably towards the yellow cab. Kate follows her and gets in beside her, pulling the entrance shut. At home, Zoe stomps straight into her bedroom, and Kate walks into hers. Kate's bedroom entrance opens, and she slowly steps out into the hallway, crosses to Zoe's room, and hesitates for a moment before knocking on the entrance."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Kate is looked at quizzically by Leah, who smiles and gestures towards Nick. He is turned around and nodded at with a smile by him. Nick is frowned at by Zoe. Leah, wearing a thick winter coat, has her bag slung over her shoulder as she leaves the staff changing room. Kate walks into her office, where Zoe is slumped over the desk fast asleep. A scarf is placed around her neck by Kate, who looks down at her drawing of a sailboat and a dolphin that Zoe's resting on. Zoe is carried by Kate through the kitchen, and as the door is reached by her, Nick is turned back to with a warm smile. He kindly looks back at her and watches them go. In Zoe's dark bedroom, Kate gently lays her sleeping niece down onto the bed. The laces on Zoe's red and white baseball boots are undone by her, and they are removed. One of Zoe's stuffed toys is placed down beside her by Kate, and it is immediately cuddled up to by Zoe. The next morning, the square-faced alarm clock, which reads half-past four, is reached out to and turned off by Kate. She turns onto her back and sleepily opens her eyes. A dark Berber-style jacket is pulled on by Kate as the lounge is walked through to pick up her mobile and the front door is headed towards. Zoe, who's standing in her bedroom doorway clutching her cuddly Kangaroo, is peered back at up the hallway by Kate. At the fish market, a bored-looking Zoe stands nearby, still clutching her cuddly toy, and yawns sleepily. Back at home, Kate and Zoe are asleep on the sofa. Kate stares and checks her watch, then hurries off. Later, they run along the pavement to the school, and Kate watches Zoe as she climbs the front steps, opens the heavy front door, and goes inside. At the restaurant, Kate and Leah are with a mustachioed man. It is sniffed by Leah, and a bag is reached into by him, conducting Leah as she breathes deeply. Kate walks into her apartment with a smile, her long, dark hair hanging loose in large, soft waves. Her bag is hung on a hook by the door by her, her keys are dropped into the bowl, and her coat is begun to be removed, but her smile suddenly disappears. Her keys and bag are grabbed by her, and she scurries out again. In a taxi, Kate jumps out and hurries towards the school, where Zoe is sitting on the steps. Zoe ignores her, stands up, and strides peevishly towards the yellow cab. She follows her and gets in beside her, pulling the door shut. At home, Zoe stomps straight into her bedroom, and Kate walks into hers. Kate's bedroom door opens, and she slowly steps out into the hallway, crosses to Zoe's room, and hesitates for a moment before knocking on the door."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Kate looks quizzically at Leah, who smiles and gestures at Nick, who nods back with a smile. Zoe frowns at Nick. Leah, in a thick winter coat, slings her bag over her shoulder as she exits the staff changing room. Kate enters her office, where Zoe is asleep on the desk. Kate wraps a scarf around her neck, noticing Zoe rests on a drawing of a sailboat and a dolphin. Carrying Zoe through the kitchen, Kate smiles warmly at Nick before heading out. In Zoe's dark bedroom, Kate gently lays her niece on the bed, removes Zoe's red and white baseball boots, and places a stuffed toy next to her, which Zoe cuddles. The next morning, Kate turns off her alarm clock at 4:30, opens her eyes sleepily, and dons a dark Berber-style jacket. She grabs her phone and heads to the front door, glancing back at Zoe holding her toy kangaroo. At the fish market, Zoe, still clutching her toy, yawns. Back home, both are asleep on the sofa until Kate checks her watch and rushes off. They run to school, and Kate watches Zoe climb the steps and enter. At the restaurant, Kate and Leah meet a mustachioed man who conducts Leah as she sniffs a bag. Smiling, Kate returns to her apartment, hangs her bag on a hook, drops her keys in a bowl, and starts to remove her coat but suddenly grabs her things and leaves. In a taxi, Kate rushes to school, where Zoe is on the steps. Zoe ignores her, then walks to the cab. Kate follows and gets in beside her. At home, Zoe stomps to her room, and Kate goes to hers. Kate then hesitates before knocking on Zoe's bedroom door."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Kate looks at Leah, who gestures towards Nick. He nods at them, but Zoe frowns. Leah, in a thick coat, leaves the staff room, as Kate enters her office, finding Zoe asleep on a desk. Kate places a scarf around her neck, notices a drawing, then carries Zoe through the kitchen, smiling warmly at Nick. He watches them leave. In Zoe's bedroom, Kate lays Zoe on the bed, removes her baseball boots, and places a stuffed toy beside her, which she cuddles. The next morning, Kate turns off her alarm at half-past four, puts on a jacket, grabs her mobile, and heads to the door, seeing Zoe with her Kangaroo. At the fish market, Zoe yawns. At home, Kate and Zoe nap on the sofa. Kate checks the time and hurries off. They run to school, and Kate watches Zoe go inside. At the restaurant, Kate and Leah are with a mustachioed man, and Leah sniffs something as he instructs her. Kate returns home smiling, but it fades as she grabs her bag and keys, rushing out again. She finds Zoe at school, and they take a taxi home. Zoe stomps to her room, and Kate hesitantly knocks on her door."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Kate gazes at Leah with a puzzled expression on her face, while Leah responds with a friendly smile and gestures casually towards Nick. In turn, Nick swivels around, nodding his head while a smile spreads across his face. Observing this, Zoe furrows her brow in disapproval at Nick. Meanwhile, Leah, clad warmly in a thick winter coat, swings her bag confidently over her shoulder as she makes her way out from the staff changing room. Simultaneously, Kate enters her own office and finds Zoe sprawled over the desk, fast asleep. Thoughtfully, Kate wraps a scarf snugly around her neck and glances down at the drawing of a sailboat and a dolphin that Zoe is resting upon. Carefully, Kate lifts Zoe in her arms and carries her through the kitchen; as she approaches the door, she turns back to look at Nick with a warm smile. Nick returns her gaze kindly, watching them as they depart. In the darkened bedroom belonging to Zoe, Kate gently lays her sleeping niece onto the bed, ensuring she is comfortable. Tenderly, she unties the laces on Zoe's red and white baseball boots and maneuvers them off her feet. Then, Kate places one of Zoe's cherished stuffed toys beside her, and Zoe instinctively snuggles up to it with a cozy embrace. \n\nThe following morning, Kate extends her arm to switch off her square-shaped alarm clock, which displays the time as half-past four. Sleepily, she turns onto her back and gradually opens her eyes. Donning a dark, Berber-style jacket, Kate makes her way through to the lounge, retrieves her mobile phone, and heads purposefully towards the front door. Along the way, she glances back up the hallway at Zoe, who stands clutching her beloved cuddly Kangaroo in the doorway of her bedroom. At the bustling fish market, Zoe stands nearby, looking rather bored, still gripping her stuffed toy, and lets out a sleepy yawn. Once back at home, both Kate and Zoe find themselves fast asleep on the comfortable sofa. Kate suddenly glances at her watch, realizing the time, and quickly rushes off. Later on, they sprint energetically along the pavement to reach the school, where Kate observes as Zoe ascends the front steps, pushes the substantial door open, and disappears inside. At the restaurant, Kate, Leah, and a man sporting a mustache engage in a conversation. Leah takes a sniff, while the man reaches into a bag, guiding Leah as she breathes deeply. When Kate returns to her apartment, her face is adorned with a smile, and her long, dark hair cascades down loosely in large, soft waves. She hangs her bag on a convenient hook by the door, drops her keys into a bowl, and starts to remove her coat. However, her smile abruptly fades, and she quickly grabs her keys along with her bag, then rushes out once again. In a taxi, Kate quickly jumps out and hastens towards the school, where Zoe is waiting sullenly on the steps. Zoe gives Kate the silent treatment, gets to her feet, and strides irritably toward the waiting yellow cab. Kate follows alongside her, climbs in, and closes the door behind them. Upon returning home, Zoe stomps directly into her bedroom, and meanwhile, Kate retreats into her own. After a moment, Kate's bedroom door slowly swings open, and she cautiously steps out into the hallway. She crosses over to Zoe's room, hesitates slightly, taking a deep breath before gently knocking on the door."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Kate gazes intently at Leah, her expression filled with a curious and somewhat confused look, as she tries to understand Leah's intention. In response, Leah flashes a warm and friendly smile, and with a casual gesture, she directs Kate's attention towards Nick. Observing this interaction, Nick smoothly swivels around in his seat, nodding his head in acknowledgment as a broad smile spreads across his face, exuding friendliness. Noticing Nick’s reaction, Zoe furrows her brow in evident disapproval, casting a stern look at him. Meanwhile, Leah, enveloped in a thick and cozy winter coat to keep the chill at bay, swings her bag confidently over her shoulder as she makes her way out of the staff changing room, ready to face the day. Simultaneously, Kate walks into her own spacious office, only to find Zoe sprawled across the desk, deeply asleep. Thoughtfully, Kate wraps a warm scarf snugly around her neck and lowers her gaze to the drawing upon which Zoe is resting, depicting a sailboat and a playful dolphin. Carefully and gently, Kate lifts Zoe in her arms and carries her through the kitchen; as she approaches the door, she turns back to meet Nick's eyes with a warm and inviting smile. Nick returns her gaze with kindness, watching them as they make their way out. In the dimly lit bedroom that belongs to Zoe, Kate gently lays her sleeping niece onto the bed, ensuring she is comfortable and at ease. Tenderly, she loosens the laces on Zoe's red and white baseball boots, maneuvering them off her small feet. Then, Kate places Zoe’s cherished stuffed animal beside her, and Zoe instinctively snuggles up to it in a cozy and comforting embrace.\n\nThe following morning, Kate extends her arm to reach for her alarm clock, shaped in a square and displaying the time as half-past four. Sleepily, she turns onto her back and gradually opens her eyes, allowing the morning light to seep in. Afterward, donning a dark Berber-style jacket for warmth, Kate makes her way through to the lounge area, retrieves her mobile phone, and heads purposefully toward the front door. Along her path, she pauses briefly to glance back down the hallway at Zoe, who stands clutching her beloved cuddly Kangaroo at the doorway of her bedroom, looking on. At the bustling and lively fish market, Zoe stands nearby, appearing somewhat tired and bored, still gripping her stuffed toy tightly, and lets out a sleepy yawn. Once back at their cozy home, both Kate and Zoe find themselves fast asleep on the comfortable sofa, wrapped in a peaceful slumber. Suddenly, Kate glances at her watch, her eyes widening as she realizes the time, prompting her to quickly rush off. Later, they sprint energetically along the pavement, trying to reach the school in time, where Kate attentively observes as Zoe climbs up the front steps, pushes the substantial door open with some effort, and disappears inside. At the restaurant, Kate, Leah, and a man sporting a distinct mustache engage in a lively conversation. Leah takes a deep sniff, while the man reaches into a bag, guiding Leah as she breathes deeply and takes in the aroma. When Kate returns to her apartment, a joyful smile adorns her face, and her long, dark hair cascades down loosely in large, soft waves. She hangs her bag on a convenient hook by the door, drops her keys into a decorative bowl, and starts to remove her coat. However, her smile abruptly fades, replaced by concern, and she quickly grabs her keys along with her bag, then rushes out once again in haste. In a taxi, Kate exits quickly and hastens toward the school, where Zoe is waiting sullenly on the steps. Zoe gives Kate the silent treatment, not uttering a word, and gets to her feet, striding irritably toward the waiting yellow cab with visible frustration. Kate follows alongside her, climbs in, and closes the door behind them. Upon returning home, Zoe stomps directly into her bedroom, filled with annoyance, while Kate retreats into her own room, seeking solitude. After a moment, Kate's bedroom door slowly swings open, and she cautiously steps out into the hallway. She crosses over to Zoe's room, hesitates slightly, taking a deep breath for courage before gently knocking on the door, preparing to reconcile."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Kate directs a puzzled look at Leah, who responds with a warm smile and a gesture towards Nick. Nick, noticing the gesture, turns around and acknowledges them with a friendly nod and a smile. Zoe, however, looks disapprovingly at Nick. Clad in a thick winter coat, Leah efficiently slings her bag over her shoulder as she exits the staff changing room. Meanwhile, Kate enters her office to find Zoe collapsed over the desk, sound asleep. With care, Kate wraps a scarf around her neck and glances down at a drawing of a sailboat and a dolphin beneath Zoe. Deciding to move Zoe, Kate gently carries her through the kitchen, pausing at the door to exchange a tender smile with Nick, who reciprocates her gesture with a kind expression as he watches them leave. In the dim light of Zoe's bedroom, Kate carefully lays her sleeping niece onto the bed, unties the laces of Zoe's red and white baseball boots, and removes them with precision, then tenderly places one of Zoe's stuffed toys beside her, prompting Zoe to instinctively snuggle it. The following morning, Kate groggily reaches to silence her square-faced alarm clock, which shows half-past four, then lazily turns onto her back, allowing her eyes to open gradually. She dons a dark, Berber-style jacket while making her way through to the lounge, retrieving her mobile in the process, and strides toward the front door. Before leaving, Kate steals a glance back up the hallway at Zoe, who stands in her bedroom doorway, clasping her cuddly kangaroo. At the bustling fish market, Zoe, looking uninterested, stands nearby with her cuddly toy in hand, suppressing a sleepy yawn. Once back home, the duo falls asleep on the sofa, but Kate, upon waking, checks her watch and rushes off with urgency. Later, they dash briskly along the pavement to reach the school, where Kate, filled with anticipation, observes Zoe as she ascends the front steps, opens the heavy front door, and vanishes inside. At the restaurant, Kate and Leah are in the company of a mustachioed man; Leah sniffs something as he fishes into a bag, orchestrating Leah's deep breaths with subtle gestures. Returning to her apartment, Kate enters with a smile, her long, dark hair hanging in loose, soft waves. She hangs her bag on a hook by the door, lets her keys drop into the bowl, and just as she starts to shed her coat, her smile fades abruptly. Acting swiftly, she snatches her keys and bag and hurriedly departs again. Hailing a taxi, Kate leaps out and races toward the school, where she finds Zoe sitting on the steps, visibly upset. Zoe stands up defiantly, ignoring Kate, and purposefully strides toward the yellow cab. Without hesitation, Kate follows her and slides in beside her, decisively pulling the door shut behind them. Back at home, Zoe storms directly into her bedroom, while Kate solemnly retreats to her own. After a moment, Kate's bedroom door creaks open as she tentatively steps into the hallway, crosses over to Zoe's room, and hesitates briefly before rapping gently on the door."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Kate exchanges a quizzical look with Leah, who gestures towards Nick with a smile. Nick acknowledges them with a nod and smile, while Zoe frowns at him. Leah, in a thick winter coat, slings her bag over her shoulder and leaves the staff changing room. Kate enters her office to find Zoe asleep over a desk, places a scarf around her neck, and notices a drawing of a sailboat and dolphin beneath Zoe. She carries Zoe through the kitchen, pausing to smile warmly at Nick before leaving. In Zoe's dark bedroom, Kate gently lays her niece on the bed, removes Zoe's baseball boots, and places a stuffed toy beside her, which Zoe immediately cuddles.\n\nThe next morning, Kate turns off her alarm clock at half-past four, groggily gets up, and dons a dark jacket as she heads to the lounge to pick up her mobile and move towards the door. She glances back to see Zoe in the bedroom doorway clutching her toy kangaroo. At the fish market, Zoe, still clutching her toy, stands nearby and yawns. Back home, Kate and Zoe nap on the sofa until Kate checks her watch and hurries off. Later, they run along the pavement to school, and Kate watches Zoe climb the steps and enter the building. At a restaurant, Kate and Leah meet with a mustachioed man, and Leah sniffs an item he offers her.\n\nSmiling, Kate returns to her apartment, hangs her bag, drops her keys, and starts to remove her coat, but her smile fades abruptly. She grabs her keys and bag, rushes out to a taxi, and hurries to the school to find Zoe on the steps. Zoe ignores Kate, gets up, and strides peevishly toward the cab. Kate follows her, gets in beside her, and shuts the door. At home, Zoe stomps into her bedroom, and Kate enters hers. After a moment, Kate emerges, crosses to Zoe's room, and hesitates before knocking on the door."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Kate looks quizzically at Leah, who smiles and gestures towards Nick, the manager known for his jovial personality. He turns around and nods with a smile. Zoe, whose competitive nature often surfaces at unexpected times, frowns at Nick. Leah, wearing a thick winter coat designed for sub-zero temperatures, slings her bag over her shoulder as she leaves the staff changing room where employees gather before starting their shifts. Kate walks into her office, where Zoe is slumped over the desk fast asleep, exhausted from the late nights they’ve spent preparing for the annual community event. Kate places a scarf around her neck, the one her mother knitted for her last Christmas, and looks down at her drawing of a sailboat and a dolphin that Zoe's resting on. The drawing is part of Zoe's art project, inspired by their recent trip to the coast of Maine. Kate carries Zoe through the kitchen filled with the aroma of freshly baked cookies, and as she reaches the door, she turns back to Nick with a warm smile. He looks back at her kindly and watches them go. In Zoe's dark bedroom, Kate lays her sleeping niece down gently onto the bed, which is adorned with a quilt that has been in the family for generations. She undoes the laces on Zoe's red and white baseball boots, the ones she wears religiously despite the wear and tear, and removes them. She places one of Zoe's stuffed toys, a fluffy dog named Max, down beside her, and Zoe immediately cuddles up to it. The next morning, Kate reaches out to turn off her square-faced alarm clock, an antique from her grandmother, which reads half-past four. She turns onto her back and opens her eyes sleepily. Kate pulls on a dark Berber-style jacket, reminiscent of the traditional North African attire, as she walks through to the lounge to pick up her mobile and heads towards the front door. Kate peers back up the hallway at Zoe, who's standing in her bedroom doorway clutching her cuddly Kangaroo, a souvenir from their vacation to Australia. At the fish market, a place bustling with the early morning catch, a bored-looking Zoe stands nearby, still clutching her cuddly toy, and yawns sleepily. Back at home, Kate and Zoe are asleep on the sofa, surrounded by a pile of picture books. Kate stares and checks her watch, remembering her appointment, then hurries off. Later, they run along the pavement to the school, an institution known for its academic excellence, and Kate watches Zoe as she climbs the front steps, opens the heavy front door, and goes inside. At the restaurant, Kate and Leah are with a mustachioed man, a renowned food critic famous in the culinary circles. Leah sniffs it, detecting the subtle aroma of saffron, and he reaches into a bag, conducting Leah as she breathes deeply. Kate walks into her apartment with a smile, her long, dark hair hanging loose in large, soft waves, a look she often receives compliments for. She hangs her bag on a hook by the door, drops her keys into the bowl, and begins to remove her coat, but her smile suddenly disappears, realizing she forgot to pick up Zoe. She grabs her keys and her bag and scurries out again. In a taxi, Kate jumps out and hurries towards the school, where Zoe's sitting on the steps, surrounded by autumn leaves. Zoe ignores her, stands up, and strides peevishly towards the yellow cab. Kate follows her and gets in beside her, pulling the door shut. At home, Zoe stomps straight into her bedroom, upset about the misunderstanding, and Kate walks into hers, deep in thought about how to make amends. Kate's bedroom door opens, and she slowly steps out into the hallway, crosses to Zoe's room, and hesitates for a moment before knocking on the door, ready to offer an apology."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "At home Zoe stomps straight into her bedroom and Kate walks into hers Kate looks quizzically at Leah who smiles and gestures towards Nick Kate looks quizzically at Leah who smiles and gestures towards Nick He turns around and nods with a smile Zoe frowns at Nick Leah wearing a thick winter coat slings her bag over her shoulder as she leaves the staff changing room Kate walks into her office where Zoe is slumped over the desk fast asleep Kate places a scarf around her neck and looks down at her drawing of a sailboat and a dolphin that Zoe's resting on Leah sniffs it and he reaches into a bag conducting Leah as she breathes deeply Kate follows her and gets in beside her pulling the door shut Leah wearing a thick winter coat slings her bag over her shoulder as she leaves the staff changing room Kate stares and checks her watch then hurries off Kate carries Zoe through the kitchen and as she reaches the door she turns back to Nick with a warm smile Back at home Kate and Zoe are asleep on the sofa He looks back at her kindly and watches them go In Zoe's dark bedroom Kate lays her sleeping niece down gently onto the bed She grabs her keys and her bag and scurries out again She undoes the laces on Zoe's red and white baseball boots and removes them He looks back at her kindly and watches them go He turns around and nods with a smile She places one of Zoe's stuffed toys down beside her and Zoe immediately cuddles up to it The next morning Kate reaches out to turn off her squarefaced alarm clock which reads halfpast four Kate walks into her office where Zoe is slumped over the desk fast asleep She turns onto her back and opens her eyes sleepily Kate pulls on a dark Berberstyle jacket as she walks through to the lounge to pick up her mobile and heads towards the front door Kate pulls on a dark Berberstyle jacket as she walks through to the lounge to pick up her mobile and heads towards the front door Kate peers back up the hallway at Zoe who is standing in her bedroom doorway clutching her cuddly Kangaroo At the fish market a boredlooking Zoe stands nearby still clutching her cuddly toy and yawns sleepily Back at home Kate and Zoe are asleep on the sofa Kate stares and checks her watch then hurries off Later they run along the pavement to the school and Kate watches Zoe as she climbs the front steps opens the heavy front door and goes inside Zoe frowns at Nick At the restaurant Kate and Leah are with a mustachioed man Leah sniffs it and he reaches into a bag conducting Leah as she breathes deeply Kate walks into her apartment with a smile her long dark hair hanging loose in large soft waves In Zoe's dark bedroom Kate lays her sleeping niece down gently onto the bed Zoe ignores her stands up and strides peevishly towards the yellow cab She hangs her bag on a hook by the door drops her keys into the bowl and begins to remove her coat but her smile suddenly disappears She grabs her keys and her bag and scurries out again In a taxi Kate jumps out and hurries towards the school where Zoe's sitting on the steps Zoe ignores her stands up and strides peevishly towards the yellow cab Kate follows her and gets in beside her pulling the door shut At home Zoe stomps straight into her bedroom and Kate walks into hers Kate's bedroom door opens and she slowly steps out into the hallway crosses to Zoe's room and hesitates for a moment before knocking on the door"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Kate looks quizzically at Leah who smiles and gestures towards Nick. He turns around and nods with a smile. Zoe frowns at Nick. Leah wearing a thick winter coat slings her bag over her shoulder as she leaves the staff changing room. Kate walks into her office where Zoe is slumped over the desk fast asleep. Kate places a scarf around her neck and looks down at her drawing of a sailboat and a dolphin that Zoe's resting on. Kate carries Zoe through the kitchen and as she reaches the door she turns back to Nick with a warm smile. He looks back at her kindly and watches them go. In Zoe's dark bedroom Kate lays her sleeping niece down gently onto the bed. She undoes the laces on Zoe's red and white baseball boots and removes them. She places one of Zoe's stuffed toys down beside her and Zoe immediately cuddles up to it. The next morning Kate reaches out to turn off her squarefaced alarm clock which reads halfpast four. She turns onto her back and opens her eyes sleepily. Kate pulls on a dark Berberstyle jacket as she walks through to the lounge to pick up her mobile and heads towards the front door. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Kate peers back up the hallway at Zoe who is standing in her bedroom doorway clutching her cuddly Kangaroo. At the fish market a boredlooking Zoe stands nearby still clutching her cuddly toy and yawns sleepily. Back at home Kate and Zoe are asleep on the sofa. Kate stares and checks her watch then hurries off. Later they run along the pavement to the school and Kate watches Zoe as she climbs the front steps opens the heavy front door and goes inside. At the restaurant Kate and Leah are with a mustachioed man. Leah sniffs it and he reaches into a bag conducting Leah as she breathes deeply. Kate walks into her apartment with a smile her long dark hair hanging loose in large soft waves. She hangs her bag on a hook by the door drops her keys into the bowl and begins to remove her coat but her smile suddenly disappears. She grabs her keys and her bag and scurries out again. In a taxi Kate jumps out and hurries towards the school where Zoe's sitting on the steps. Zoe ignores her stands up and strides peevishly towards the yellow cab. Kate follows her and gets in beside her pulling the door shut. At home Zoe stomps straight into her bedroom and Kate walks into hers. Kate's bedroom door opens and she slowly steps out into the hallway crosses to Zoe's room and hesitates for a moment before knocking on the door."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Kate looks quizzically at Leah who smiles and gestures towards Nick. He turns around and nods with a smile. Zoe frowns at Nick. Leah wearing a thick winter coat slings her bag over her shoulder as she leaves the staff changing room. Kate walks into her office where Zoe is slumped over the desk fast asleep. Kate places a scarf around her neck and looks down at her drawing of a sailboat and a dolphin that Zoe's resting on. Kate carries Zoe through the kitchen and as she reaches the door she turns back to Nick with a warm smile. He looks back at her kindly and watches them go. In Zoe's dark bedroom Kate lays her sleeping niece down gently onto the bed. She undoes the laces on Zoe's red and white baseball boots and removes them. She places one of Zoe's stuffed toys down beside her and Zoe immediately cuddles up to it. The next morning Kate reaches out to turn off her squarefaced alarm clock which reads halfpast four. She turns onto her back and opens her eyes sleepily. Kate pulls on a dark Berberstyle jacket as she walks through to the lounge to pick up her mobile and heads towards the front door. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Kate peers back up the hallway at Zoe who is standing in her bedroom doorway clutching her cuddly Kangaroo. At the fish market a boredlooking Zoe stands nearby still clutching her cuddly toy and yawns sleepily. Back at home Kate and Zoe are asleep on the sofa. Kate stares and checks her watch then hurries off. Later they run along the pavement to the school and Kate watches Zoe as she climbs the front steps opens the heavy front door and goes inside. At the restaurant Kate and Leah are with a mustachioed man. Leah sniffs it and he reaches into a bag conducting Leah as she breathes deeply. Kate walks into her apartment with a smile her long dark hair hanging loose in large soft waves. She hangs her bag on a hook by the door drops her keys into the bowl and begins to remove her coat but her smile suddenly disappears. She grabs her keys and her bag and scurries out again. In a taxi Kate jumps out and hurries towards the school where Zoe's sitting on the steps. Zoe ignores her stands up and strides peevishly towards the yellow cab. Kate follows her and gets in beside her pulling the door shut. At home Zoe stomps straight into her bedroom and Kate walks into hers. Kate's bedroom door opens and she slowly steps out into the hallway crosses to Zoe's room and hesitates for a moment before knocking on the door."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Kate looks quizzically at Leah who smiles and gestures towards Nick. He turns around and nods with a smile. Zoe frowns at Nick. Leah wearing a thick winter coat slings her bag over her shoulder as she leaves the staff changing room. Kate walks into her office where Zoe is slumped over the desk fast asleep. Kate places a scarf around her neck and looks down at her drawing of a sailboat and a dolphin that Zoe's resting on. Kate carries Zoe through the kitchen and as she reaches the door she turns back to Nick with a warm smile. Kate walks into her apartment with a smile her long dark hair hanging loose in large soft waves. She hangs her bag on a hook by the door drops her keys into the bowl and begins to remove her coat but her smile suddenly disappears. She grabs her keys and her bag and scurries out again. In a taxi Kate jumps out and hurries towards the school where Zoe's sitting on the steps. Zoe ignores her stands up and strides peevishly towards the yellow cab. Kate follows her and gets in beside her pulling the door shut. At home Zoe stomps straight into her bedroom and Kate walks into hers. Kate's bedroom door opens and she slowly steps out into the hallway crosses to Zoe's room and hesitates for a moment before knocking on the door."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Kate looks quizzically at Leah who smiles and gestures towards Nick. He turns around and nods with a smile. Zoe frowns at Nick. Kate follows her and gets in beside her pulling the door shut. At home Zoe stomps straight into her bedroom and Kate walks into hers. Kate's bedroom door opens and she slowly steps out into the hallway crosses to Zoe's room and hesitates for a moment before knocking on the door."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog looks quizzically at the giraffe, who smiles and gestures towards the kangaroo. The horse turns around and nods with a smile. The zebra frowns at the kangaroo. The giraffe, wearing a thick winter coat, slings her bag over her shoulder as she leaves the staff changing room. The dog walks into her office, where the zebra is slumped over the desk fast asleep. The dog places a scarf around her neck and looks down at her drawing of a sailboat and a dolphin that the zebra's resting on. The dog carries the zebra through the kitchen, and as she reaches the door, she turns back to the kangaroo with a warm smile. The horse looks back at her kindly and watches them go. In the zebra's dark bedroom, the dog lays her sleeping niece down gently onto the bed. She undoes the laces on the zebra's red and white baseball boots and removes them. She places one of the zebra's stuffed toys down beside her, and the zebra immediately cuddles up to it. The next morning, the dog reaches out to turn off her square-faced alarm clock, which reads half-past four. She turns onto her back and opens her eyes sleepily. The dog pulls on a dark Berber-style jacket as she walks through to the lounge to pick up her mobile and heads towards the front door. The dog peers back up the hallway at the zebra, who's standing in her bedroom doorway clutching her cuddly Kangaroo. At the fish market, a bored-looking zebra stands nearby, still clutching her cuddly toy, and yawns sleepily. Back at home, the dog and the zebra are asleep on the sofa. The dog stares and checks her watch, then hurries off. Later, they run along the pavement to the school, and the dog watches the zebra as she climbs the front steps, opens the heavy front door, and goes inside. At the restaurant, the dog and the giraffe are with a mustachioed man. The giraffe sniffs it, and he reaches into a bag, conducting the giraffe as she breathes deeply. The dog walks into her apartment with a smile, her long, dark hair hanging loose in large, soft waves. She hangs her bag on a hook by the door, drops her keys into the bowl, and begins to remove her coat, but her smile suddenly disappears. She grabs her keys and her bag and scurries out again. In a taxi, the dog jumps out and hurries towards the school, where the zebra's sitting on the steps. The zebra ignores her, stands up, and strides peevishly towards the yellow cab. The dog follows her and gets in beside her, pulling the door shut. At home, the zebra stomps straight into her bedroom, and the dog walks into hers. The dog's bedroom door opens, and she slowly steps out into the hallway, crosses to the zebra's room, and hesitates for a moment before knocking on the door."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Kate looks perplexed at Leah, who smiles and gestures towards Nick. He turns around and nods with a grin. Zoe scowls at Nick. Leah, wearing a thick raincoat, tosses her backpack over her shoulder as she leaves the employee lounge. Kate walks into her studio, where Zoe is sprawled over the table fast asleep. Kate wraps a shawl around her neck and looks down at her sketch of a mountain and an eagle that Zoe's resting on. Kate carries Zoe through the pantry, and as she reaches the threshold, she turns back to Nick with a warm smile. He looks back at her kindly and watches them depart. In Zoe's dim nursery, Kate lays her sleeping niece down gently onto the mattress. She undoes the straps on Zoe's purple and yellow hiking boots and removes them. She places one of Zoe's plush animals down beside her, and Zoe immediately snuggles up to it. The next morning, Kate reaches out to turn off her diamond-shaped alarm clock, which reads half-past four. She turns onto her back and opens her eyes drowsily. Kate pulls on a dark velvet dress as she walks through to the den to pick up her tablet and heads towards the front door. Kate peers back up the corridor at Zoe, who's standing in her bedroom doorway clutching her cuddly turtle. At the flower stall, a disinterested Zoe stands nearby, still clutching her cuddly toy, and yawns sleepily. Back at home, Kate and Zoe are asleep on the recliner. Kate stares and checks her watch, then hurries off. Later, they run along the sidewalk to the library, and Kate watches Zoe as she climbs the front steps, opens the heavy glass door, and goes inside. At the café, Kate and Leah are with a mustachioed man. Leah sniffs it, and he reaches into a pouch, conducting Leah as she breathes deeply. Kate walks into her flat with a smile, her long, dark hair hanging loose in large, soft waves. She hangs her backpack on a peg by the door, drops her keys into the jar, and begins to remove her sweater, but her smile suddenly disappears. She grabs her keys and her backpack and rushes out again. In a tram, Kate jumps out and hurries towards the library, where Zoe's sitting on the steps. Zoe ignores her, stands up, and strides peevishly towards the green tram. Kate follows her and gets in beside her, pulling the door shut. At home, Zoe stomps straight into her bedroom, and Kate walks into hers. Kate's bedroom door opens, and she slowly steps out into the hallway, crosses to Zoe's room, and hesitates for a moment before knocking on the door."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Kate glances curiously at Leah, who grins and points towards Nick. He pivots and grins with a smirk. Zoe scowls at Nick. Leah, wearing a thick winter coat, swings her bag under her arm as she exits the staff changing room. Kate strolls into her office, where Zoe is sprawled over the desk in a deep sleep. Kate wraps a scarf around her neck, and gazes at her sketch of a sailboat and a dolphin that Zoe's nestled on. Kate lifts Zoe through the kitchen, and as she approaches the door, she glances back to Nick with a warm grin. He nods at her kindly and observes them leaving. In Zoe's dim bedroom, Kate places her sleeping niece down gently onto the bed. She loosens the laces on Zoe's red and white baseball boots and pulls them off. She tucks one of Zoe's stuffed toys beside her, and Zoe instantly snuggles up to it. The next morning, Kate stretches to silence her square-faced alarm clock, which shows half-past four. She rolls onto her back and blinks sleepily. Kate slips on a dark Berber-style jacket as she meanders through to the lounge to grab her mobile and strides towards the front door. Kate glances back up the hallway at Zoe, who's standing in her bedroom doorway hugging her cuddly Kangaroo. At the fish market, a tired-looking Zoe stands nearby, still holding her cuddly toy, and stretches sleepily. Back at home, Kate and Zoe are dozing on the sofa. Kate blinks and checks her watch, then dashes off. Later, they sprint along the pavement to the school, and Kate observes Zoe as she ascends the front steps, pushes the heavy front door, and goes inside. At the restaurant, Kate and Leah are with a bearded man. Leah sniffs it, and he rummages in a bag, guiding Leah as she inhales deeply. Kate steps into her apartment with a grin, her long, dark hair cascading loose in large, soft waves. She places her bag on a hook by the door, drops her keys into the bowl, and starts to unbutton her coat, but her smile quickly fades. She seizes her keys and her bag and rushes out again. In a taxi, Kate hops out and dashes towards the school, where Zoe's perched on the steps. Zoe dismisses her, stands up, and strides moodily towards the yellow cab. Kate trails her and settles in beside her, pulling the door shut. At home, Zoe marches straight into her bedroom, and Kate ambles into hers. Kate's bedroom door swings open, and she slowly tiptoes out into the hallway, crosses to Zoe's room, and pauses for a moment before tapping on the door."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The bookshelf looks quizzically at the telephone pole, which smiles and gestures towards the fountain. The mailbox turns around and nods with a smile. The bicycle frowns at the fountain. The telephone pole, wearing a thick winter coat, slings its bag over its shoulder as it leaves the garden shed. The bookshelf walks into its office, where the bicycle is slumped over the desk fast asleep. The bookshelf places a necklace around its neck, and looks down at its drawing of a spaceship and a walrus that the bicycle's resting on. The bookshelf carries the bicycle through the kitchen, and as it reaches the gate, it turns back to the fountain with a warm smile. The mailbox looks back at it kindly and watches them go. In the bicycle's dark garage, the bookshelf lays its sleeping mannequin down gently onto the rug. It undoes the laces on the bicycle's red and white roller skates and removes them. It places one of the bicycle's stuffed plants down beside it, and the bicycle immediately cuddles up to it. The next morning, the bookshelf reaches out to turn off its hexagon-faced sundial, which reads half-past four. It turns onto its back and opens its eyes sleepily. The bookshelf pulls on a dark Berber-style hat as it walks through to the study to pick up its remote and heads towards the mailbox door. The bookshelf peers back up the hallway at the bicycle, who's standing in its garage doorway clutching its cuddly hedgehog. At the flower market, a bored-looking bicycle stands nearby, still clutching its cuddly object, and yawns sleepily. Back at the treehouse, the bookshelf and the bicycle are asleep on the hammock. The bookshelf stares and checks its calendar, then hurries off. Later, they run along the boardwalk to the library, and the bookshelf watches the bicycle as it climbs the front ladder, opens the heavy front drawer, and goes inside. At the museum, the bookshelf and the telephone pole are with a bearded fish. The telephone pole sniffs it, and it reaches into a suitcase, conducting the telephone pole as it breathes deeply. The bookshelf walks into its yurt with a smile, its long, dark hair hanging loose in large, soft waves. It hangs its jacket on a hook by the entrance, drops its keys into the basin, and begins to remove its hat, but its smile suddenly disappears. It grabs its keys and its suitcase and scurries out again. In a gondola, the bookshelf jumps out and hurries towards the library, where the bicycle's sitting on the ladder. The bicycle ignores it, stands up, and strides peevishly towards the yellow tricycle. The bookshelf follows it and gets in beside it, pulling the gate shut. At the cave, the bicycle stomps straight into its garage, and the bookshelf walks into its own. The bookshelf's bedroom door opens, and it slowly steps out into the hallway, crosses to the bicycle's room, and hesitates for a moment before knocking on the gate."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Sarah glances curiously at Emily, who grins and motions towards Jack. He pivots around and winks with a grin. Anna scowls at Jack. Emily, dressed in a thick autumn jacket, flings her bag over her arm as she exits the workers’ lounge. Sarah strides into her office, where Anna is sprawled over the table fast asleep. Sarah wraps a scarf around her shoulders and gazes down at her sketch of a mountain and an eagle that Anna's resting on. Sarah lifts Anna through the dining room, and as she approaches the exit, she turns back to Jack with a cheerful grin. He gazes back at her affectionately and observes them leave. In Anna's dim room, Sarah sets her dozing cousin gently onto the bed. She loosens the straps on Anna's blue and yellow sneakers and takes them off. She places one of Anna's stuffed animals down beside her, and Anna instinctively snuggles with it. The following morning, Sarah reaches out to deactivate her circular alarm clock, which displays half-past four. She rolls onto her back and opens her eyes drowsily. Sarah slips on a light alpaca-style sweater as she walks through to the living room to grab her phone and heads towards the main entrance. Sarah glances back down the corridor at Anna, who's standing in her room doorway clutching her cuddly Panda. At the flower market, a disinterested Anna stands nearby, still clutching her stuffed animal, and yawns lethargically. Back at home, Sarah and Anna are napping on the couch. Sarah gazes and checks her watch, then scurries off. Later, they shuffle along the sidewalk to the library, and Sarah observes Anna as she ascends the front steps, pushes open the heavy front door, and enters inside. At the cafe, Sarah and Emily are with a bearded gentleman. Emily sniffs it, and he delves into a bag, guiding Emily as she inhales deeply. Sarah steps into her apartment with a grin, her long, dark hair hanging loose in large, soft curls. She hangs her bag on a peg by the doorway, tosses her keys into the dish, and starts to take off her sweater, but her grin abruptly vanishes. She snatches her keys and her bag and dashes out again. In a bus, Sarah leaps out and sprints towards the library, where Anna's sitting on the steps. Anna disregards her, stands up, and marches irritably towards the red bus. Sarah follows her and hops in beside her, pulling the door closed. At home, Anna trudges straight into her room, and Sarah walks into hers. Sarah's bedroom door swings open, and she slowly steps out into the corridor, crosses to Anna's room, and pauses for a moment before tapping on the door."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Kate gazes curiously at Leah, who smirks and waves towards Nick. He spins around and winks with a grin. Zoe scowls at Nick. Leah, sporting a feather boa, flings her hat over her shoulder as she exits the staff lounge. Kate strides into her study, where Zoe is sprawled over the couch sound asleep. Kate wraps a ribbon around her wrist and glances down at her sketch of a mountain and an eagle that Zoe's resting on. Kate hauls Zoe through the garage, and as she reaches the entrance, she glances back to Nick with a friendly grin. He glances back at her warmly and observes them going. In Zoe's dim bedroom, Kate places her sleeping niece down gently onto the rug. She unties the ribbons on Zoe's red and white hiking sandals and slips them off. She sets one of Zoe's stuffed animals down beside her, and Zoe promptly snuggles up to it. The next dawn, Kate stretches out to mute her circular alarm, which reads half-past six. She rolls onto her side and blinks her eyes lazily. Kate pulls on a light safari-style shirt as she strides through to the den to grab her tablet and moves towards the back entrance. Kate glances back down the hallway at Zoe, who's standing in her bedroom doorway gripping her plush Dinosaur. At the flower market, a sleepy-eyed Zoe lingers close by, still gripping her stuffed toy and yawns lazily. Back at home, Kate and Zoe are napping on the armchair. Kate gazes and checks her phone, then dashes off. Later, they sprint along the driveway to the library, and Kate observes Zoe as she hops up the front steps, pushes the revolving door, and disappears inside. At the gallery, Kate and Leah are with a spectacled woman. Leah sniffs it, and she reaches into a pouch, guiding Leah as she inhales deeply. Kate walks into her flat with a grin, her long, curly hair cascading loose in gentle, soft waves. She hooks her purse on a rack by the door, tosses her watch into the basin, and starts to shrug off her sweatshirt, but her grin quickly vanishes. She snatches her watch and her purse and rushes out again. In a bus, Kate leaps out and sprints towards the library, where Zoe's lounging on the steps. Zoe disregards her, stands up, and marches grouchily towards the red limousine. Kate trails her and settles in beside her, slamming the door shut. At home, Zoe storms directly into her bedroom, and Kate wanders into hers. Kate's bedroom door swings open, and she slowly tiptoes out into the hallway, crosses to Zoe's room, and pauses for a moment before rapping on the door."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Monica blinks curiously at Sam, who giggles and points towards Alex. She spins around and winks with a grin. Lily grimaces at Alex. Sam, donning a heavy raincoat, tosses her backpack over her elbow as she exits the crew locker room. Monica strolls into her study, where Lily is sprawled over the table snoring loudly. Monica wraps a belt around her waist and glances down at her sketch of a hot air balloon and a penguin that Lily's lying on. Monica hauls Lily through the pantry, and as she nears the window, she pivots back to Alex with a gentle grin. He glances back at her warmly and observes them leave. In Lily's dim nursery, Monica places her snoozing cousin softly onto the mattress. She loosens the straps on Lily's green and yellow hiking shoes and slips them off. She places one of Lily's plush animals down beside her, and Lily instantly snuggles up to it. The following dawn, Monica stretches out to disable her round-faced timer, which displays twelve-thirty. She flips onto her side and pops her eyes open lazily. Monica slips on a bright Aztec-patterned blazer as she strides through to the den to grab her tablet and heads towards the back gate. Monica glances back down the corridor at Lily, who's standing in her study entrance hugging her plush Koala. At the farmer's bazaar, a weary-looking Lily stands close by, still hugging her plush animal, and yawns lazily. Back at the mansion, Monica and Lily are dozing on the couch. Monica gazes and checks her phone, then rushes off. Eventually, they sprint along the sidewalk to the academy, and Monica observes Lily as she ascends the rear stairs, pushes the light rear door, and slips inside. At the café, Monica and Sam are with a bearded gentleman. Sam whiffs it, and he reaches into a pouch, guiding Sam as she inhales deeply. Monica saunters into her flat with a grin, her long, light hair cascading free in small, firm curls. She hooks her backpack on a peg by the gate, drops her cards into the dish, and starts to shed her blazer, but her grin suddenly fades. She snatches her cards and her backpack and dashes out again. In a sedan, Monica leaps out and rushes towards the academy, where Lily's perched on the stairs. Lily disregards her, stands up, and saunters irately towards the blue sedan. Monica tails her and climbs in beside her, pulling the gate closed. At the villa, Lily marches straight into her study, and Monica steps into hers. Monica's study gate swings open, and she quietly steps out into the corridor, crosses to Lily's room, and pauses for a moment before tapping on the gate."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Kate looks at Leah, who gestures toward Nick. Zoe frowns at Nick. Leah, wearing a thick winter coat, leaves the staff changing room as Kate enters her office, finding Zoe asleep at the desk. Kate wraps a scarf around her neck and carries Zoe to her bedroom, removing her boots and placing a stuffed toy beside her. The next morning, Kate rises at half-past four and prepares to leave. Zoe, holding a stuffed toy, stands in her doorway. At the fish market, Zoe yawns, still clutching the toy. Back home, Kate and Zoe fall asleep on the sofa. Realizing the time, Kate hurries, and they run to Zoe's school. Later, at the restaurant, Kate and Leah meet a mustachioed man. Returning home, Kate's smile fades as she quickly heads to the school to find Zoe on the steps. Zoe ignores Kate and heads to the cab. At home, Zoe storms to her room. Kate hesitates before knocking on Zoe's door."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Kate's bedroom door opens and she slowly steps out into the hallway crosses to Zoe's room and hesitates for a moment before knocking on the door At home Zoe stomps straight into her bedroom and Kate walks into hers Kate follows her and gets in beside her pulling the door shut Zoe ignores her stands up and strides peevishly towards the yellow cab In a taxi Kate jumps out and hurries towards the school where Zoe's sitting on the steps She grabs her keys and her bag and scurries out again She hangs her bag on a hook by the door drops her keys into the bowl and begins to remove her coat but her smile suddenly disappears Kate walks into her apartment with a smile her long dark hair hanging loose in large soft waves Leah sniffs it and he reaches into a bag conducting Leah as she breathes deeply At the restaurant Kate and Leah are with a mustachioed man Later they run along the pavement to the school and Kate watches Zoe as she climbs the front steps opens the heavy front door and goes inside Kate stares and checks her watch then hurries off Back at home Kate and Zoe are asleep on the sofa At the fish market a boredlooking Zoe stands nearby still clutching her cuddly toy and yawns sleepily Kate peers back up the hallway at Zoe who is standing in her bedroom doorway clutching her cuddly Kangaroo Kate pulls on a dark Berberstyle jacket as she walks through to the lounge to pick up her mobile and heads towards the front door She turns onto her back and opens her eyes sleepily The next morning Kate reaches out to turn off her squarefaced alarm clock which reads halfpast four She places one of Zoe's stuffed toys down beside her and Zoe immediately cuddles up to it She undoes the laces on Zoe's red and white baseball boots and removes them In Zoe's dark bedroom Kate lays her sleeping niece down gently onto the bed He looks back at her kindly and watches them go Kate carries Zoe through the kitchen and as she reaches the door she turns back to Nick with a warm smile Kate places a scarf around her neck and looks down at her drawing of a sailboat and a dolphin that Zoe's resting on Kate walks into her office where Zoe is slumped over the desk fast asleep Leah wearing a thick winter coat slings her bag over her shoulder as she leaves the staff changing room Zoe frowns at Nick He turns around and nods with a smile Kate looks quizzically at Leah who smiles and gestures towards Nick"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Later they run along the pavement to the school and Kate watches Zoe as she climbs the front steps opens the heavy front door and goes inside Kate peers back up the hallway at Zoe who is standing in her bedroom doorway clutching her cuddly Kangaroo She places one of Zoe's stuffed toys down beside her and Zoe immediately cuddles up to it She hangs her bag on a hook by the door drops her keys into the bowl and begins to remove her coat but her smile suddenly disappears Kate walks into her apartment with a smile her long dark hair hanging loose in large soft waves Kate carries Zoe through the kitchen and as she reaches the door she turns back to Nick with a warm smile Kate places a scarf around her neck and looks down at her drawing of a sailboat and a dolphin that Zoe's resting on She turns onto her back and opens her eyes sleepily The next morning Kate reaches out to turn off her squarefaced alarm clock which reads halfpast four At the fish market a boredlooking Zoe stands nearby still clutching her cuddly toy and yawns sleepily She undoes the laces on Zoe's red and white baseball boots and removes them In a taxi Kate jumps out and hurries towards the school where Zoe's sitting on the steps At the restaurant Kate and Leah are with a mustachioed man Kate's bedroom door opens and she slowly steps out into the hallway crosses to Zoe's room and hesitates for a moment before knocking on the door Back at home Kate and Zoe are asleep on the sofa Kate follows her and gets in beside her pulling the door shut He turns around and nods with a smile Kate pulls on a dark Berberstyle jacket as she walks through to the lounge to pick up her mobile and heads towards the front door Zoe frowns at Nick Kate stares and checks her watch then hurries off At home Zoe stomps straight into her bedroom and Kate walks into hers Kate walks into her office where Zoe is slumped over the desk fast asleep Zoe ignores her stands up and strides peevishly towards the yellow cab He looks back at her kindly and watches them go In Zoe's dark bedroom Kate lays her sleeping niece down gently onto the bed She grabs her keys and her bag and scurries out again Kate looks quizzically at Leah who smiles and gestures towards Nick Leah wearing a thick winter coat slings her bag over her shoulder as she leaves the staff changing room Leah sniffs it and he reaches into a bag conducting Leah as she breathes deeply"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "At the fish market a boredlooking Zoe stands nearby still clutching her cuddly toy and yawns sleepily Back at home Kate and Zoe are asleep on the sofa Kate stares and checks her watch then hurries off Later they run along the pavement to the school and Kate watches Zoe as she climbs the front steps opens the heavy front door and goes inside At the restaurant Kate and Leah are with a mustachioed man Leah sniffs it and he reaches into a bag conducting Leah as she breathes deeply Kate walks into her apartment with a smile her long dark hair hanging loose in large soft waves She hangs her bag on a hook by the door drops her keys into the bowl and begins to remove her coat but her smile suddenly disappears She grabs her keys and her bag and scurries out again In a taxi Kate jumps out and hurries towards the school where Zoe's sitting on the steps Zoe ignores her stands up and strides peevishly towards the yellow cab Kate follows her and gets in beside her pulling the door shut At home Zoe stomps straight into her bedroom and Kate walks into hers Kate's bedroom door opens and she slowly steps out into the hallway crosses to Zoe's room and hesitates for a moment before knocking on the door Kate looks quizzically at Leah who smiles and gestures towards Nick He turns around and nods with a smile Zoe frowns at Nick Leah wearing a thick winter coat slings her bag over her shoulder as she leaves the staff changing room Kate walks into her office where Zoe is slumped over the desk fast asleep Kate places a scarf around her neck and looks down at her drawing of a sailboat and a dolphin that Zoe's resting on Kate carries Zoe through the kitchen and as she reaches the door she turns back to Nick with a warm smile He looks back at her kindly and watches them go In Zoe's dark bedroom Kate lays her sleeping niece down gently onto the bed She undoes the laces on Zoe's red and white baseball boots and removes them She places one of Zoe's stuffed toys down beside her and Zoe immediately cuddles up to it The next morning Kate reaches out to turn off her squarefaced alarm clock which reads halfpast four She turns onto her back and opens her eyes sleepily Kate pulls on a dark Berberstyle jacket as she walks through to the lounge to pick up her mobile and heads towards the front door Kate peers back up the hallway at Zoe who is standing in her bedroom doorway clutching her cuddly Kangaroo"
        }
      ]
    }
  ]
}