{
  "ground_truth": "Mary prepares to play, and the men quickly take their places opposite their partners; as the music starts, the ladies curtsy and the men bow, while a group of onlookers gather. Mrs. Bennet turns to glare at her husband as the men stand in one line with the ladies opposite them, briefly touching hands as they move around the other dancers. Mrs. Gardiner crosses the room and sees Charlotte and Jane sitting down; Charlotte is busy chatting with someone, but Jane looks quietly upset. Later, the girl with red hair is standing with Wickham as Charlotte and Lizzie look on. Wickham smiles at Lizzie as he takes the girl's hand and leads her down through the column of dancers; Lizzie smiles back at him, then turns to look at Charlotte, who has a serious expression on her face. Lizzie turns her attention back to the dance floor where the red-haired girl is eyeing Wickham coyly. Charlotte grabs Lizzie's arm as Mary King continues to dance with Wickham, smiling contentedly. Winter has arrived, and the ground outside Longbourn is crisp with a white layer of frost, while Lizzie reads a letter; Jane walks out, then is sitting looking out of her window. A carriage pulls up, and Caroline gets out, then climbs back into her carriage, which sets off down the street as Jane stares dolefully out of her window. Back at Longbourn, Lizzie lowers her sister's letter with a pained expression. It's a mild, sunny day, and Lizzie is taking a walk in a field near Longbourn. She wanders past post and rail fencing surrounding an old oak tree, idly toying with a leafy twig, and as she reaches the grounds of Longbourn, she tosses the twig away and wanders up the graveled driveway to the house, with a pensive, yet carefree air, her face framed by the straw brim of her gold-colored bonnet. Lydia comes running out to meet her in the garden, and they continue on past the gardener, who's busily pruning a bush; Lizzie casually reaches out to a branch above her head and pulls off a leaf. Indoors, Mr. Bennet is reading. Hearing a noise from the hall, he looks up from his book to see trunks being moved and Lizzie standing in her coat and bonnet. She comes in to see him, goes over to him, and he takes her hand and kisses it. He watches her leave with an endearing smile, then goes back to his book. Lizzie is sharing her carriage with Maria and Sir William Lucas as the horse-drawn carriage continues on past the green canopy of trees. Eventually, it pulls through the gates and into the drive of a sizable, ivy-clad house, where Mr. Collins and Charlotte hurry out to meet them as Lizzie, Maria, and Sir William emerge from the cab.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Mary readies to engage, and the gentlemen swiftly assume their positions opposite their companions; as the melody begins, the women curtsy and the gentlemen bow, while a cluster of spectators assemble. Mrs. Bennet turns to scowl at her spouse as the gentlemen stand in one row with the women opposite them, briefly brushing hands as they proceed around the other dancers. Mrs. Gardiner crosses the chamber and observes Charlotte and Jane sitting down; Charlotte is occupied conversing with someone, but Jane appears quietly distressed. Later, the maiden with auburn hair is standing with Wickham as Charlotte and Lizzie observe. Wickham grins at Lizzie as he takes the maiden's hand and guides her down through the column of dancers; Lizzie grins back at him, then turns to observe Charlotte, who has a solemn expression on her visage. Lizzie turns her focus back to the dance floor where the auburn-haired maiden is regarding Wickham slyly. Charlotte seizes Lizzie's arm as Mary King continues to dance with Wickham, smiling blissfully. Winter has arrived, and the terrain outside Longbourn is crisp with a white layer of rime, while Lizzie peruses a letter; Jane walks out, then is sitting gazing out of her pane. A carriage draws up, and Caroline alights, then climbs back into her carriage, which sets off down the lane as Jane watches mournfully out of her pane. Back at Longbourn, Lizzie lowers her sister's letter with a woeful expression. It's a mild, sunny day, and Lizzie is taking a stroll in a meadow near Longbourn. She meanders past post and rail barrier enclosing an ancient oak tree, idly playing with a leafy sprig, and as she reaches the grounds of Longbourn, she flings the sprig away and wanders up the graveled approach to the abode, with a contemplative, yet untroubled demeanor, her face framed by the straw brim of her gold-colored hat. Lydia comes running out to meet her in the garden, and they continue on past the gardener, who's industriously trimming a shrub; Lizzie casually reaches out to a branch above her head and plucks off a leaf. Indoors, Mr. Bennet is reading. Hearing a clatter from the corridor, he looks up from his volume to see trunks being relocated and Lizzie standing in her coat and hat. She comes in to see him, goes over to him, and he takes her hand and kisses it. He watches her depart with a loving smile, then goes back to his volume. Lizzie is sharing her carriage with Maria and Sir William Lucas as the horse-drawn carriage continues on past the verdant canopy of trees. Eventually, it pulls through the gates and into the drive of a considerable, ivy-clad abode, where Mr. Collins and Charlotte hasten out to meet them as Lizzie, Maria, and Sir William emerge from the cab."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Mary is prepared to play, and places are quickly taken by the men opposite their partners; as the music starts, curtsies are made by the ladies and bows are made by the men, while a group of onlookers gathers. Mrs. Bennet turns to glare at her husband as a line is formed by the men with the ladies opposite them, hands are touched briefly as movement occurs around the other dancers. The room is crossed by Mrs. Gardiner, and Charlotte and Jane are seen sitting down; Charlotte busies herself chatting with someone, but Jane appears quietly upset. Later, Wickham is standing with the girl with red hair as Charlotte and Lizzie watch. A smile is given by Wickham to Lizzie as the girl's hand is taken by him and she is led down through the column of dancers; Lizzie smiles back at him, then turns to look at Charlotte, whose face holds a serious expression. Lizzie’s attention is turned back to the dance floor where Wickham is eyed coyly by the red-haired girl. Lizzie's arm is grabbed by Charlotte as Wickham is continued to be danced with by Mary King, smiling contentedly. Winter arrives, and the ground outside Longbourn is covered with a crisp frosty layer, while a letter is read by Lizzie; Jane walks out, then looks out of her window while sitting. A carriage pulls up, and Caroline gets out, then climbs back into her carriage, which is set off down the street as Jane dolefully stares out of her window. Back at Longbourn, her sister's letter is lowered by Lizzie with a pained expression. It's a mild, sunny day, and a walk is taken by Lizzie in a field near Longbourn. The fence post and rail surrounding an old oak tree are wandered past by her, idly toying with a leafy twig, and as the grounds of Longbourn are reached by her, the twig is tossed away, and she wanders up the graveled driveway to the house, with a pensive yet carefree air, her face framed by the straw brim of her gold-colored bonnet. Lydia comes running out to meet her in the garden, and they continue past the gardener, who busily prunes a bush; a branch above her head is casually reached out to by Lizzie, and a leaf is pulled off. Indoors, a book is read by Mr. Bennet. A noise is heard by him from the hall, causing him to look up from his book to see trunks being moved and Lizzie standing in her coat and bonnet. She comes in to see him, goes over to him, and her hand is taken by him and kissed. Her departure is watched by him with an endearing smile, then his attention returns to his book. Her carriage is shared by Lizzie with Maria and Sir William Lucas as the horse-drawn carriage continues on past the green canopy of trees. Eventually, it is pulled through the gates and into the drive of a sizable, ivy-clad house, where Mr. Collins and Charlotte hurry out to meet them as the cab is exited by Lizzie, Maria, and Sir William."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Mary prepares to play as men quickly take their positions; when the music starts, ladies curtsy and men bow while onlookers gather. Mrs. Bennet glares at her husband as men line up opposite ladies, briefly touching hands as they move. Mrs. Gardiner sees Charlotte chatting and Jane looking upset. Later, the red-haired girl stands with Wickham as Charlotte and Lizzie observe. Wickham smiles at Lizzie while leading the girl through the dancers; Lizzie smiles back before seeing Charlotte’s serious face. Lizzie watches the red-haired girl eyeing Wickham coyly. Charlotte grabs Lizzie's arm as Mary King continues dancing with a content smile. Winter arrives with a frost covering Longbourn's ground; Lizzie reads a letter as Jane looks out the window. A carriage arrives and Caroline gets out, then leaves, as Jane stares dolefully outside. Back at Longbourn, Lizzie lowers her sister’s letter with a pained look. On a mild, sunny day, Lizzie walks near Longbourn, playing with a twig before tossing it away. She walks up the graveled driveway, pensive yet carefree under her bonnet. Lydia runs to meet her, and they pass the gardener pruning bushes; Lizzie plucks a leaf from a branch. Inside, Mr. Bennet, hearing noise, sees Lizzie in her coat and bonnet. She approaches him, and he kisses her hand before she leaves with a smile as he resumes reading. Lizzie rides with Maria and Sir William Lucas in a horse-drawn carriage past tree canopies, arriving at an ivy-clad house where Mr. Collins and Charlotte meet Lizzie, Maria, and Sir William."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mary gets ready to play; men quickly take positions opposite their partners. As music starts, ladies curtsy, men bow, and onlookers gather. Mrs. Bennet glares at her husband as dancers briefly touch hands. Mrs. Gardiner sees Charlotte chatting, while Jane looks upset. A red-haired girl stands with Wickham; he smiles at Lizzie while leading the girl through dancers. Lizzie smiles back, then sees Charlotte's serious expression. The red-haired girl coyly eyes Wickham. Charlotte grabs Lizzie's arm as Mary King dances with Wickham. Winter arrives, frost covers the ground; Lizzie reads a letter. Jane sits, staring out the window. A carriage arrives; Caroline exits, returns, then departs as Jane watches. Back at Longbourn, Lizzie lowers the letter, pained. It's sunny; Lizzie walks near Longbourn, playing with a twig. Reaching the house, she discards it, walking up the drive. Lydia joins her, passing the gardener. Indoors, Mr. Bennet reads, noticing Lizzie in her coat and bonnet. She enters, he kisses her hand, smiling as she leaves. Lizzie rides with Maria and Sir William Lucas. They reach an ivy-clad house, where Mr. Collins and Charlotte greet them as they emerge."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Mary is poised and ready to begin playing the music, and the men around her rapidly assume their positions opposite their respective partners. As the enchanting music begins to fill the air, the ladies gracefully curtsy, and the gentlemen perform a refined bow, creating a harmonious beginning to the dance. Meanwhile, a group of curious onlookers gathers to witness the elegant scene. Mrs. Bennet casts a sharp, disapproving glance at her husband as the men stand neatly in a single line, directly facing the ladies. Briefly, they touch hands as they elegantly maneuver around the other dancers, adding to the fluidity of the dance. \n\nMrs. Gardiner makes her way across the expansive room and notices Charlotte and Jane sitting down. Charlotte is engaged in lively conversation with someone, but Jane, on the other hand, appears to be quietly troubled, a hint of upset shadowing her features. As the event progresses, a girl with striking red hair stands beside Wickham, while Charlotte and Lizzie observe them with interest. Wickham flashes a charming smile at Lizzie as he gently takes the red-haired girl by the hand, leading her gracefully down the column formed by the dancers. Lizzie returns his smile warmly, then turns her gaze towards Charlotte, noting her friend's serious expression.\n\nLizzie refocuses her attention on the dance floor, where the red-haired girl looks at Wickham with a coy and playful gaze. Charlotte, feeling the tension, firmly grasps Lizzie's arm as Mary King continues to dance with Wickham, her face glowing with contentment. Winter has made its presence felt, and the area outside Longbourn is covered in a crisp, white blanket of frost. Within the house, Lizzie is absorbed in reading a letter, while Jane steps outside and later sits at her window, staring out with a distant, melancholy air. A carriage arrives, and Caroline steps out briefly before returning to her carriage, which then rolls down the street as Jane watches despondently from her window.\n\nBack at Longbourn, Lizzie lowers the letter from her sister with a visibly pained expression. It's a mild, sunny day, and Lizzie is enjoying a leisurely stroll through the fields that lie near Longbourn. She wanders past the sturdy post and rail fencing surrounding a venerable old oak tree, idly playing with a twig full of leaves. As she approaches the grounds of Longbourn, she casually tosses the twig away and meanders up the gravel driveway leading to the house. Her demeanor is both pensive and carefree, her face beautifully framed by the straw brim of her gold-colored bonnet.\n\nLydia comes dashing out to join her sister in the garden, and together they continue on, passing by the busy gardener who is intently pruning a bush. Lizzie reaches up casually, plucking a single leaf from a branch overhead. Inside the house, Mr. Bennet is engrossed in his book. Upon hearing the commotion from the hall, he looks up, observing the movement of trunks and Lizzie standing there in her coat and bonnet. She enters the room to see him, approaches him fondly, and he tenderly takes her hand, placing a gentle kiss upon it. He watches her leave with an endearing smile, then returns to his book with renewed focus.\n\nLizzie finds herself sharing a carriage with Maria and Sir William Lucas as the horse-drawn vehicle glides past a magnificent green canopy of trees. Eventually, the carriage pulls through the gates, proceeding up the drive of a sizable, ivy-clad house. Mr. Collins and Charlotte eagerly hurry out to greet them as Lizzie, Maria, and Sir William step out of the cab, ready to embark on the next chapter of their journey."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Mary stands poised, with an air of readiness as she prepares to begin playing the music that will set the tone for the gathering. The men surrounding her quickly and efficiently take their designated positions, standing directly opposite their respective partners. As the enchanting and melodious strains of the music begin to fill the air, the ladies execute graceful curtsies, while the gentlemen offer elegant, refined bows, creating an exquisitely harmonious opening to the dance. Meanwhile, a captivated group of onlookers gathers, full of curiosity, to witness the elegant and charming scene unfold. Mrs. Bennet, with a disapproving expression, casts a sharp look at her husband as the men line up neatly, face to face with the ladies. They briefly touch hands, delicately and elegantly maneuvering around the other dancers, adding a fluid and seamless quality to the dance.\n\nMrs. Gardiner makes her way across the expansive and buzzing room, noticing Charlotte and Jane seated together. Charlotte is engaged in lively conversation with someone, animatedly sharing words and laughter, whereas Jane shows signs of quiet unease, her features shadowed by a hint of upset. As the event continues to unfold, a striking girl with vivid red hair is seen standing beside Wickham, drawing the interest of Charlotte and Lizzie, who observe the pair attentively. Wickham, with a charming and engaging smile, acknowledges Lizzie before he gently takes the hand of the red-haired girl, leading her gracefully and with ease down the line formed by the dancers. Lizzie reciprocates his smile warmly, then shifts her attention to Charlotte, noticing her friend's suddenly serious expression.\n\nLizzie returns her focus to the dance floor, where she observes the red-haired girl gazing at Wickham with a playful and coy look in her eyes. Sensing the undercurrent of tension, Charlotte clasps Lizzie's arm firmly as Mary King continues to dance alongside Wickham, her face radiant with contentment. The winter season has firmly settled in, cloaking the area outside Longbourn in a pristine, white blanket of frost. Inside the cozy house, Lizzie is deeply engrossed in reading a letter, while Jane steps outside for a moment, later settling at her window, staring out with a distant, melancholy expression. A carriage arrives, and Caroline steps out briefly before returning to the carriage, which then moves steadily down the street, as Jane watches despondently from her window perch.\n\nBack at Longbourn, Lizzie lowers the letter from her sister, her face displaying a visibly pained expression. It is a mild, sunny day, and Lizzie is relishing a leisurely stroll through the fields that stretch near Longbourn. She meanders past the solid post and rail fencing that encases a venerable old oak tree, idly toying with a twig laden with leaves. As she approaches the familiar grounds of Longbourn, she casually discards the twig and leisurely wanders up the gravel driveway leading to the house. Her demeanor remains both pensive and carefree, her face beautifully set off by the straw brim of her gold-colored bonnet.\n\nLydia comes rushing out enthusiastically to join her sister in the garden, and together they continue on, walking past the industrious gardener who is intently pruning a bush with precision. Lizzie reaches up nonchalantly, plucking a solitary leaf from an overhead branch. Inside the house, Mr. Bennet is absorbed in the pages of his book. Upon hearing the noise emanating from the hall, he looks up, noting the movement of trunks and seeing Lizzie standing there, adorned in her coat and bonnet. She enters the room to see him, approaching him with affection, and he takes her hand tenderly, placing a gentle kiss upon it. He watches her departure with an endearing smile, then returns to his book with renewed focus and interest.\n\nLizzie finds herself sharing a carriage journey with Maria and Sir William Lucas as the horse-drawn vehicle glides smoothly past a magnificent, lush green canopy of trees. Eventually, the carriage pulls through the gates, proceeding up the drive of a sizable and charming ivy-clad house. Mr. Collins and Charlotte eagerly and energetically rush out to greet them as Lizzie, Maria, and Sir William step out of the cab, ready and eager to embark on the exciting next chapter of their journey."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Mary takes a moment to gather herself and prepare to play, while the men in the room quickly move across the floor to stand opposite their partners, setting the stage for the dance. As the vibrant music begins to fill the air, the ladies gracefully dip into a curtsy, and the men respond with a courteous bow, acknowledging the start of the dance in unison. A curious group of onlookers begins to assemble nearby, captivated by the spectacle unfolding before them. Amidst this, Mrs. Bennet swivels her head to cast a sharp glare at her husband, her eyes fixated on the scene where the men and ladies form a line, positioning themselves opposite each other. Hands are briefly but gently touched as they begin their movements, weaving skillfully through the maze of dancers around them. Meanwhile, Mrs. Gardiner makes her way across the room with a purposeful stride, her gaze landing on Charlotte and Jane, who are seated. Charlotte is absorbed in animated conversation with someone, her gestures lively, while Jane sits quietly, her face marred by a hint of distress that she tries to mask. Later, the red-haired girl stands closely beside Wickham, engaging in quiet conversation, as Charlotte and Lizzie watch them intently from a distance. Wickham offers Lizzie a charming smile, placing his hand confidently in the girl's, and begins to lead her elegantly down the column formed by the dancers. In response, Lizzie returns his smile warmly before shifting her glance towards Charlotte, whose face now bears a serious expression that speaks volumes. Redirecting her focus back to the dance floor, Lizzie notices the red-haired girl engaging Wickham with a playful, flirtatious look. At this moment, Charlotte instinctively reaches out, grabbing Lizzie's arm gently as Mary King continues to dance alongside Wickham, her expression one of pure contentment. As time progresses, winter blankets the landscape, transforming the ground outside Longbourn into a delicate white tapestry of frost. Within the cozy confines of the house, Lizzie finds herself absorbed in reading a letter, while Jane, caught in her own thoughts, steps out only to find herself sitting quietly, gazing out of the window, her expression troubled. A carriage arrives with a gentle rumble and comes to a halt; Caroline steps out briefly before climbing back in, and the carriage resumes its course down the street, all the while Jane's eyes follow it with a somber, forlorn gaze from her window seat. Within Longbourn, Lizzie finishes reading her sister's letter and lowers it slowly, a pained expression shadowing her face. The next scene unfolds on a mild, sunny day where Lizzie leisurely walks through a field near Longbourn, her steps unhurried. She roams past a fence made of posts and rails encircling an ancient oak tree, her fingers absentmindedly toying with a leafy twig plucked from a branch. As she approaches the familiar grounds of Longbourn, she lets the twig slip from her fingers and heads up the gravel driveway towards the house, her demeanor shifting between pensive reflection and carefree wandering. Her face remains partially shaded by the straw brim of her gold-colored bonnet. Lydia, filled with youthful exuberance, rushes out to greet her sister in the garden; together, they walk past the gardener, who is engrossed in the meticulous pruning of a bush. In a spontaneous moment, Lizzie reaches up to a branch that hangs overhead and effortlessly snaps off a leaf. Inside the house, Mr. Bennet sits absorbed in his reading, only to be drawn out of his literary world by the faint sounds echoing from the hall. He raises his eyes from the pages to watch as trunks are moved and to see Lizzie standing poised in her coat and bonnet. She steps inside to visit him, approaching with familiarity and warmth, and he returns the gesture with tenderness, taking her hand and placing a gentle kiss upon it. With an affectionate smile, he follows her departure with his eyes before returning his attention to his book. Lizzie finds herself seated in a carriage alongside Maria and Sir William Lucas, the rhythmic clip-clop of the horses' hooves accompanying the journey as they pass under a verdant canopy of trees. At length, the carriage rolls through an elegant gate and along the drive of a sizable house ensconced in lush ivy. As they come to a halt, Mr. Collins and Charlotte appear quickly, hurrying out to welcome them, and in a flurry of activity, Lizzie, Maria, and Sir William step down from the carriage, greeted by their hosts."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Mary prepares to play the music as the men quickly position themselves opposite their partners. As the music begins, the ladies curtsy and the men bow, while onlookers gather. Mrs. Bennet glares at her husband as the dancers briefly touch hands while moving through their formations. Meanwhile, Mrs. Gardiner notices Charlotte chatting animatedly while Jane sits quietly, appearing upset. Later, Charlotte and Lizzie observe Wickham smiling at Lizzie while he leads a red-haired girl through the dancers. Lizzie smiles back, then exchanges a serious look with Charlotte before focusing on the dance floor where the girl flirts with Wickham. Charlotte grasps Lizzie's arm as Mary King dances contentedly with Wickham.\n\nWinter arrives with a frost-covered landscape at Longbourn. Lizzie reads a letter while Jane gazes dolefully out the window. A carriage arrives; Caroline briefly disembarks, then leaves as Jane continues to stare pensively. Returning indoors, Lizzie reads the letter from Jane with a pained expression. On a mild, sunny day, Lizzie strolls through a field near Longbourn, playfully handling a leafy twig, and as she reaches the grounds, she discards it with a contemplative yet carefree demeanor. Lydia meets her, and they continue past the gardener, where Lizzie casually plucks a leaf from a branch above. Inside, Mr. Bennet, engrossed in his book, acknowledges Lizzie and affectionately kisses her hand when she visits him before he returns to reading. Lizzie then shares a carriage with Maria and Sir William Lucas, riding past lush trees until they arrive at an ivy-covered house. There, Mr. Collins and Charlotte hurry out to welcome them as Lizzie, Maria, and Sir William disembark."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Mary prepares to play the piano, filling the room with anticipation, and the men quickly take their places opposite their partners; as the lively music, reminiscent of English country dance tunes from the early 19th century, starts, the ladies curtsy and the men bow, while a group of onlookers, dressed in elegant Regency attire, gather to watch. Mrs. Bennet, a character known for her dramatic flair in Jane Austen's \"Pride and Prejudice,\" turns to glare at her husband as the men stand in one line with the ladies opposite them, briefly touching hands as they move gracefully around the other dancers. Mrs. Gardiner, who possesses a keen interest in travel, crosses the room and sees Charlotte and Jane sitting down; Charlotte is busy chatting with someone, possibly gossiping as is customary at social events of the time, but Jane looks quietly upset, perhaps due to her recent misunderstandings with Mr. Bingley. Later, the girl with striking red hair is standing with Wickham, whose charming demeanor often masks his unscrupulous nature, as Charlotte and Lizzie look on. Wickham smiles at Lizzie as he takes the girl's hand and leads her down through the column of dancers, reminiscent of a scene from a traditional ball; Lizzie, who is used to Wickham's flirtations, smiles back at him, then turns to look at Charlotte, who has a serious expression on her face, reflecting her practical concern for financial security. Lizzie turns her attention back to the dance floor where the red-haired girl, identified as Mary King with her modest inheritance, is eyeing Wickham coyly. Charlotte grabs Lizzie's arm as Mary King continues to dance with Wickham, smiling contentedly unaware of his intentions.\n\nWinter has arrived, painting the countryside in serene white, and the ground outside Longbourn, the Bennet family estate, is crisp with a white layer of frost, while Lizzie reads a letter from her beloved sister Jane; Jane, in her characteristically gentle manner, walks out, then is sitting looking out of her window, lost in thought over Bingley's absence. A carriage, a common mode of transport in the Regency era, pulls up, and Caroline Bingley, who is known for her attempts to separate Jane from her brother, gets out, then climbs back into her carriage, which sets off down the street as Jane stares dolefully out of her window, reflecting the emotional turmoil she feels. Back at Longbourn, Lizzie lowers her sister's letter with a pained expression, deeply empathetic to Jane's distress. It's a mild, sunny day, and Lizzie is taking a walk in a field near Longbourn, enjoying the respite that nature provides. She wanders past post and rail fencing surrounding an old oak tree, idly toying with a leafy twig, and as she reaches the grounds of Longbourn, she tosses the twig away and wanders up the graveled driveway to the house, with a pensive, yet carefree air, her face framed by the straw brim of her gold-colored bonnet, a popular fashion accessory at the time. Lydia, known for her impetuousness, comes running out to meet her in the garden, and they continue on past the gardener, who's busily pruning a bush; Lizzie casually reaches out to a branch above her head and pulls off a leaf, enjoying the simple pleasures of her surroundings.\n\nIndoors, Mr. Bennet, a man of wit and sarcasm, is reading. Hearing a noise from the hall, he looks up from his book, perhaps a volume of history or philosophy as was his preference, to see trunks being moved and Lizzie standing in her coat and bonnet. She comes in to see him, goes over to him, and he takes her hand and kisses it, expressing his fondness for his daughter. He watches her leave with an endearing smile, then goes back to his book, finding solace in its pages. Lizzie is sharing her carriage with Maria and Sir William Lucas, her lively neighbors, as the horse-drawn carriage continues on past the green canopy of trees, their gentle sway a soothing accompaniment. Eventually, it pulls through the gates and into the drive of a sizable, ivy-clad house, known as Hunsford Parsonage where Mr. Collins and Charlotte, now married and settled, hurry out to meet them as Lizzie, Maria, and Sir William emerge from the cab, ready to enjoy the hospitality of their friends."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Mary prepares to play and the men quickly take their places opposite their partners. as the music starts the ladies curtsy and the men bow while a group of onlookers gather. Mrs Bennet turns to glare at her husband as the men stand in one line with the ladies opposite them briefly touching hands as they move around the other dancers. Mrs Gardiner crosses the room and sees Charlotte and Jane sitting down. Charlotte is busy chatting with someone but Jane looks quietly upset. Later the girl with red hair is standing with Wickham as Charlotte and Lizzie look on. Wickham smiles at Lizzie as he takes the girl's hand and leads her down through the column of dancers. Lizzie smiles back at him then turns to look at Charlotte who has a serious expression on her face. Lizzie turns her attention back to the dance floor where the redhaired girl is eyeing Wickham coyly. Charlotte grabs Lizzie's arm as Mary King continues to dance with Wickham smiling contentedly. Winter has arrived and the ground outside Longbourn is crisp with a white layer of frost. while Lizzie reads a letter. Jane walks out then is sitting looking out of her window. A carriage pulls up and Caroline gets out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. then climbs back into her carriage which sets off down the street as Jane stares dolefully out of her window. Back at Longbourn Lizzie lowers her sister's letter with a pained expression. It is a mild sunny day and Lizzie is taking a walk in a field near Longbourn. She wanders past post and rail fencing surrounding an old oak tree idly toying with a leafy twig and as she reaches the grounds of Longbourn she tosses the twig away and wanders up the graveled driveway to the house with a pensive yet carefree air her face framed by the straw brim of her goldcolored bonnet. Lydia comes running out to meet her in the garden and they continue on past the gardener who is busily pruning a bush. Lizzie casually reaches out to a branch above her head and pulls off a leaf. Indoors. Mr Bennet is reading. Hearing a noise from the hall he looks up from his book to see trunks being moved and Lizzie standing in her coat and bonnet. She comes in to see him goes over to him and he takes her hand and kisses it. He watches her leave with an endearing smile then goes back to his book. Lizzie is sharing her carriage with Maria and Sir William Lucas. as the horsedrawn carriage continues on past the green canopy of trees. Eventually it pulls through the gates and into the drive of a sizable ivyclad house where Mr Collins and Charlotte hurry out to meet them as Lizzie. Maria and Sir William emerge from the cab."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Mary prepares to play and the men quickly take their places opposite their partners. as the music starts the ladies curtsy and the men bow while a group of onlookers gather. Mrs Bennet turns to glare at her husband as the men stand in one line with the ladies opposite them briefly touching hands as they move around the other dancers. Mrs Gardiner crosses the room and sees Charlotte and Jane sitting down. Charlotte is busy chatting with someone but Jane looks quietly upset. Later the girl with red hair is standing with Wickham as Charlotte and Lizzie look on. Wickham smiles at Lizzie as he takes the girl's hand and leads her down through the column of dancers. Lizzie smiles back at him then turns to look at Charlotte who has a serious expression on her face. Lizzie turns her attention back to the dance floor where the redhaired girl is eyeing Wickham coyly. Charlotte grabs Lizzie's arm as Mary King continues to dance with Wickham smiling contentedly. Winter has arrived and the ground outside Longbourn is crisp with a white layer of frost. while Lizzie reads a letter. Jane walks out then is sitting looking out of her window. A carriage pulls up and Caroline gets out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. then climbs back into her carriage which sets off down the street as Jane stares dolefully out of her window. Back at Longbourn Lizzie lowers her sister's letter with a pained expression. It is a mild sunny day and Lizzie is taking a walk in a field near Longbourn. She wanders past post and rail fencing surrounding an old oak tree idly toying with a leafy twig and as she reaches the grounds of Longbourn she tosses the twig away and wanders up the graveled driveway to the house with a pensive yet carefree air her face framed by the straw brim of her goldcolored bonnet. Lydia comes running out to meet her in the garden and they continue on past the gardener who is busily pruning a bush. Lizzie casually reaches out to a branch above her head and pulls off a leaf. Indoors. Mr Bennet is reading. Hearing a noise from the hall he looks up from his book to see trunks being moved and Lizzie standing in her coat and bonnet. She comes in to see him goes over to him and he takes her hand and kisses it. He watches her leave with an endearing smile then goes back to his book. Lizzie is sharing her carriage with Maria and Sir William Lucas. as the horsedrawn carriage continues on past the green canopy of trees. Eventually it pulls through the gates and into the drive of a sizable ivyclad house where Mr Collins and Charlotte hurry out to meet them as Lizzie. Maria and Sir William emerge from the cab."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Mary prepares to play and the men quickly take their places opposite their partners. as the music starts the ladies curtsy and the men bow while a group of onlookers gather. Mrs Bennet turns to glare at her husband as the men stand in one line with the ladies opposite them briefly touching hands as they move around the other dancers. Mrs Gardiner crosses the room and sees Charlotte and Jane sitting down. Charlotte is busy chatting with someone but Jane looks quietly upset. Later the girl with red hair is standing with Wickham as Charlotte and Lizzie look on. Wickham smiles at Lizzie as he takes the girl's hand and leads her down through the column of dancers. Mr Bennet is reading. Hearing a noise from the hall he looks up from his book to see trunks being moved and Lizzie standing in her coat and bonnet. She comes in to see him goes over to him and he takes her hand and kisses it. He watches her leave with an endearing smile then goes back to his book. Lizzie is sharing her carriage with Maria and Sir William Lucas. as the horsedrawn carriage continues on past the green canopy of trees. Eventually it pulls through the gates and into the drive of a sizable ivyclad house where Mr Collins and Charlotte hurry out to meet them as Lizzie. Maria and Sir William emerge from the cab."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Mary prepares to play and the men quickly take their places opposite their partners. as the music starts the ladies curtsy and the men bow while a group of onlookers gather. Mrs Bennet turns to glare at her husband as the men stand in one line with the ladies opposite them briefly touching hands as they move around the other dancers. as the horsedrawn carriage continues on past the green canopy of trees. Eventually it pulls through the gates and into the drive of a sizable ivyclad house where Mr Collins and Charlotte hurry out to meet them as Lizzie. Maria and Sir William emerge from the cab."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Susan plans to sketch, and the cats slowly settle in their spots beside their friends; as the melody begins, the dogs jump and the cats stretch, while a group of spectators assembles. Mrs. Thompson turns to laugh at her son as the cats stand in a circle with the dogs circling them, briefly shaking paws as they glide around the other skaters. Mrs. Allen hops across the garden and spots Sarah and Emma lying down; Sarah is busy doodling with anyone, but Emma glances quietly cheerful. Later, the woman with green shoes is sitting with Trevor as Sarah and Maggie observe. Trevor frowns at Maggie as he releases the woman's shoe and guides her through the line of skaters; Maggie frowns back at him, then twists to glance at Sarah, who has a delighted look on her face. Maggie spins her gaze back to the rink where the green-shoed woman is noticing Trevor playfully. Sarah snags Maggie's sleeve as Laura Hill proceeds to skate with Trevor, grinning joyfully. Autumn has arrived, and the field beyond Rivendell is crisp with a gray layer of leaves, while Maggie reads a flyer; Emma runs out, then is standing peering out of her door. A bicycle rolls up, and Madison jumps out, then leaps back onto her bicycle, which pedals down the alley as Emma peers whimsically out of her door. At Rivendell again, Maggie lifts her friend's flyer with a gleeful expression. It's a warm, starry night, and Maggie is taking a walk in a meadow near Rivendell. She skips past stone and rope fencing encircling an ancient pine tree, absently playing with a thorny branch, and as she nears the lawns of Rivendell, she tosses the branch aside and skips up the cobbled pathway to the cottage, with a thoughtful, yet lively air, her face framed by the velvet trim of her red-colored cap. Hannah comes strolling out to greet her in the courtyard, and they stroll on past the chef, who's earnestly grilling a steak; Maggie coolly extends an arm to a vine over her shoulder and plucks off a bud. Indoors, Mr. Thompson is napping. Hearing a crash from the pantry, he peers over from his bench to see packages being nudged and Maggie standing in her gown and hat. She whispers to see him, bounds over to him, and he shakes her foot and hugs it. He hears her linger with a drowsy wink, then collapses back to his bench. Maggie is sharing her wagon with Bella and Lord Robert Hall as the ox-drawn cart drifts on past the blue horizon of hills. Eventually, it wheels through the forest and into the path of a massive, rose-laden tower, where Mr. Johnson and Sarah dash out to watch them as Maggie, Bella, and Lord Robert retreat from the van."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Mary begins playing, leading the men and women to take their places for the dance, exchanging bows and curtsies as onlookers gather. Mrs. Bennet expresses frustration while Mrs. Gardiner notices Jane, looking upset. Meanwhile, Lizzie and Charlotte observe Wickham dancing with a red-haired girl, with Lizzie smiling at Wickham and Charlotte appearing serious. As winter sets in, Lizzie reads a letter with concern while Jane mournfully watches Caroline's departure. Lizzie later takes a reflective walk near Longbourn, tossing a twig and meeting Lydia. Inside, Mr. Bennet is interrupted from reading as Lizzie readies to leave, exchanging a tender farewell. Lizzie travels with Maria and Sir William Lucas to a house where Mr. Collins and Charlotte greet them eagerly."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Maria and Sir William emerge from the cab Eventually it pulls through the gates and into the drive of a sizable ivyclad house where Mr Collins and Charlotte hurry out to meet them as Lizzie as the horsedrawn carriage continues on past the green canopy of trees Lizzie is sharing her carriage with Maria and Sir William Lucas He watches her leave with an endearing smile then goes back to his book She comes in to see him goes over to him and he takes her hand and kisses it Hearing a noise from the hall he looks up from his book to see trunks being moved and Lizzie standing in her coat and bonnet Mr Bennet is reading Indoors Lizzie casually reaches out to a branch above her head and pulls off a leaf Lydia comes running out to meet her in the garden and they continue on past the gardener who is busily pruning a bush She wanders past post and rail fencing surrounding an old oak tree idly toying with a leafy twig and as she reaches the grounds of Longbourn she tosses the twig away and wanders up the graveled driveway to the house with a pensive yet carefree air her face framed by the straw brim of her goldcolored bonnet It is a mild sunny day and Lizzie is taking a walk in a field near Longbourn Back at Longbourn Lizzie lowers her sister's letter with a pained expression then climbs back into her carriage which sets off down the street as Jane stares dolefully out of her window A carriage pulls up and Caroline gets out Jane walks out then is sitting looking out of her window while Lizzie reads a letter Winter has arrived and the ground outside Longbourn is crisp with a white layer of frost Charlotte grabs Lizzie's arm as Mary King continues to dance with Wickham smiling contentedly Lizzie turns her attention back to the dance floor where the redhaired girl is eyeing Wickham coyly Lizzie smiles back at him then turns to look at Charlotte who has a serious expression on her face Wickham smiles at Lizzie as he takes the girl's hand and leads her down through the column of dancers Later the girl with red hair is standing with Wickham as Charlotte and Lizzie look on Charlotte is busy chatting with someone but Jane looks quietly upset Mrs Gardiner crosses the room and sees Charlotte and Jane sitting down Mrs Bennet turns to glare at her husband as the men stand in one line with the ladies opposite them briefly touching hands as they move around the other dancers as the music starts the ladies curtsy and the men bow while a group of onlookers gather Mary prepares to play and the men quickly take their places opposite their partners"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "as the music starts the ladies curtsy and the men bow while a group of onlookers gather Mary prepares to play and the men quickly take their places opposite their partners Mrs Gardiner crosses the room and sees Charlotte and Jane sitting down Mrs Bennet turns to glare at her husband as the men stand in one line with the ladies opposite them briefly touching hands as they move around the other dancers Later the girl with red hair is standing with Wickham as Charlotte and Lizzie look on Charlotte is busy chatting with someone but Jane looks quietly upset Lizzie smiles back at him then turns to look at Charlotte who has a serious expression on her face Wickham smiles at Lizzie as he takes the girl's hand and leads her down through the column of dancers Charlotte grabs Lizzie's arm as Mary King continues to dance with Wickham smiling contentedly Lizzie turns her attention back to the dance floor where the redhaired girl is eyeing Wickham coyly while Lizzie reads a letter Winter has arrived and the ground outside Longbourn is crisp with a white layer of frost A carriage pulls up and Caroline gets out Jane walks out then is sitting looking out of her window Back at Longbourn Lizzie lowers her sister's letter with a pained expression then climbs back into her carriage which sets off down the street as Jane stares dolefully out of her window She wanders past post and rail fencing surrounding an old oak tree idly toying with a leafy twig and as she reaches the grounds of Longbourn she tosses the twig away and wanders up the graveled driveway to the house with a pensive yet carefree air her face framed by the straw brim of her goldcolored bonnet It is a mild sunny day and Lizzie is taking a walk in a field near Longbourn Lizzie casually reaches out to a branch above her head and pulls off a leaf Lydia comes running out to meet her in the garden and they continue on past the gardener who is busily pruning a bush Mr Bennet is reading Indoors She comes in to see him goes over to him and he takes her hand and kisses it Hearing a noise from the hall he looks up from his book to see trunks being moved and Lizzie standing in her coat and bonnet Lizzie is sharing her carriage with Maria and Sir William Lucas He watches her leave with an endearing smile then goes back to his book Eventually it pulls through the gates and into the drive of a sizable ivyclad house where Mr Collins and Charlotte hurry out to meet them as Lizzie as the horsedrawn carriage continues on past the green canopy of trees Maria and Sir William emerge from the cab"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Back at Longbourn Lizzie lowers her sister's letter with a pained expression It is a mild sunny day and Lizzie is taking a walk in a field near Longbourn She wanders past post and rail fencing surrounding an old oak tree idly toying with a leafy twig and as she reaches the grounds of Longbourn she tosses the twig away and wanders up the graveled driveway to the house with a pensive yet carefree air her face framed by the straw brim of her goldcolored bonnet Lydia comes running out to meet her in the garden and they continue on past the gardener who is busily pruning a bush Lizzie casually reaches out to a branch above her head and pulls off a leaf Indoors Mr Bennet is reading Hearing a noise from the hall he looks up from his book to see trunks being moved and Lizzie standing in her coat and bonnet She comes in to see him goes over to him and he takes her hand and kisses it He watches her leave with an endearing smile then goes back to his book Lizzie is sharing her carriage with Maria and Sir William Lucas as the horsedrawn carriage continues on past the green canopy of trees Eventually it pulls through the gates and into the drive of a sizable ivyclad house where Mr Collins and Charlotte hurry out to meet them as Lizzie Maria and Sir William emerge from the cab Mary prepares to play and the men quickly take their places opposite their partners as the music starts the ladies curtsy and the men bow while a group of onlookers gather Mrs Bennet turns to glare at her husband as the men stand in one line with the ladies opposite them briefly touching hands as they move around the other dancers Mrs Gardiner crosses the room and sees Charlotte and Jane sitting down Charlotte is busy chatting with someone but Jane looks quietly upset Later the girl with red hair is standing with Wickham as Charlotte and Lizzie look on Wickham smiles at Lizzie as he takes the girl's hand and leads her down through the column of dancers Lizzie smiles back at him then turns to look at Charlotte who has a serious expression on her face Lizzie turns her attention back to the dance floor where the redhaired girl is eyeing Wickham coyly Charlotte grabs Lizzie's arm as Mary King continues to dance with Wickham smiling contentedly Winter has arrived and the ground outside Longbourn is crisp with a white layer of frost while Lizzie reads a letter Jane walks out then is sitting looking out of her window A carriage pulls up and Caroline gets out then climbs back into her carriage which sets off down the street as Jane stares dolefully out of her window"
        }
      ]
    }
  ]
}