{
  "ground_truth": "A third man, Mr. Hurst, comes over as Darcy regards the building with an air of detachment. Inside, the dancing is well under way, with smiling men and women in pastel gowns holding hands and going round in a circle. An older man, Sir William Lucas, claps from the sidelines. Dressed in their empire-line dresses, Lizzie and Lydia are thoroughly enjoying themselves. With dainty steps, they set to their partners and do-si-do before re-forming the circle. In a two-line formation, before the chamber musicians, the ladies and gentlemen set to their respective partners, then in unison glide across the floor, back and forth, a blaze of color and feathers. Heralding the arrival of the Bingley party, an awestruck hush descends upon the room. The new arrivals look distinctly ill at ease before Sir William Lucas hurries over to greet them. As people take to the floor again, Lizzie joins Jane and Mary, who are standing with Sir William's daughter, Charlotte. The two girls go to join their mother, and the ladies curtsy. But, with a curt bow, Darcy is gone, much to Mrs. Bennet's annoyance. Jane glances at her mother, before returning her attention to Bingley. Later, she's dancing with him, holding hands and smiling warmly. Whilst the young couple are enjoying themselves, watching at the side, Darcy cannot hide his disdain. Darcy turns and spots Mrs. Bennet holding court over tea and cake, not bothering to hide her contempt for him. Then, moving on, he spots Kitty and Lydia, running wild through the hall. On the dark street below, local men are getting merry and mimicking the dancing going on inside. One man is so enthusiastic he trips and falls in a water trough. When Jane and Bingley's dance comes to an end, he leads her by the hand to present her to his sisters. Mrs. Bennet looks on, with an approving smile. Jane and Bingley dance again. Bingley wears a dark tailcoat with pale satin breeches. Jane's dress is a delicate creamy gold with puff sleeves. She wears long white evening gloves. Bingley, who has noble features and fair curly hair, is an accomplished dancer, moving through the steps with ease and grace. Darcy prowls through the hall, his face set in grim forbearance. Sir William goes to speak to him but then thinks better of it. Nearby, Lizzie is sitting with a rather serious Mary. With a nervous glance at his party, Bingley allows Jane to lead him to be introduced to Charlotte Lucas. Another dance begins. Sitting nearby, Lizzie hears him and bristles. Bingley heads off. Having heard everything, Lizzie looks at Darcy out the corner of her eye. Then, with a mischievous smile, she gets up and crosses the room in front of him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A third gentleman, Mr. Hurst, approaches as Darcy considers the structure with an aura of indifference. Inside, the dancing is well in progress, with grinning gentlemen and ladies in pastel robes holding hands and going around in a circle. An older gentleman, Sir William Lucas, applauds from the sidelines. Clothed in their empire-line dresses, Lizzie and Lydia are thoroughly relishing themselves. With delicate steps, they set to their partners and do-si-do before re-forming the circle. In a two-line arrangement, before the chamber musicians, the ladies and gentlemen set to their respective partners, then in unison glide across the floor, back and forth, a blaze of hue and plumes. Heralding the advent of the Bingley party, an awestruck silence descends upon the chamber. The new arrivals look distinctly uncomfortable before Sir William Lucas hastens over to greet them. As people take to the floor again, Lizzie joins Jane and Mary, who are standing with Sir William's daughter, Charlotte. The two girls go to join their mother, and the ladies curtsy. But, with a curt bow, Darcy is gone, much to Mrs. Bennet's displeasure. Jane glances at her mother, before returning her focus to Bingley. Later, she's dancing with him, holding hands and smiling warmly. Whilst the young couple are relishing themselves, watching at the side, Darcy cannot hide his scorn. Darcy turns and notices Mrs. Bennet presiding over tea and cake, not bothering to hide her disdain for him. Then, moving on, he notices Kitty and Lydia, running wild through the hall. On the dark street below, local gentlemen are becoming merry and imitating the dancing happening inside. One gentleman is so enthusiastic he trips and falls in a water trough. When Jane and Bingley's dance concludes, he leads her by the hand to present her to his siblings. Mrs. Bennet looks on, with an approving grin. Jane and Bingley dance again. Bingley wears a dark tailcoat with pale satin breeches. Jane's dress is a delicate creamy gold with puff sleeves. She wears long white evening gloves. Bingley, who has aristocratic features and fair curly hair, is an accomplished dancer, moving through the steps with ease and elegance. Darcy prowls through the hall, his face set in grim patience. Sir William goes to converse with him but then thinks better of it. Nearby, Lizzie is sitting with a rather serious Mary. With a nervous glance at his group, Bingley permits Jane to lead him to be introduced to Charlotte Lucas. Another dance commences. Sitting nearby, Lizzie hears him and bristles. Bingley heads off. Having heard everything, Lizzie looks at Darcy out the corner of her eye. Then, with a mischievous grin, she rises and crosses the chamber in front of him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A third man, Mr. Hurst, is observed by Darcy as the building is regarded by him with an air of detachment. Inside, the dancing has been set well under way, with smiling men and women in pastel gowns holding hands and going round in a circle. From the sidelines, Sir William Lucas claps. Dressed in their empire-line dresses, Lizzie and Lydia thoroughly enjoy themselves. With dainty steps, their partners are set to and they do-si-do before the circle is re-formed by them. In a two-line formation, before the chamber musicians, their respective partners are set to by the ladies and gentlemen, then, in unison, they glide across the floor, back and forth, a blaze of color and feathers. An awestruck hush heralds the arrival of the Bingley party as it descends upon the room. The new arrivals look distinctly ill at ease before Sir William Lucas hurries over to greet them. As people are taken to the floor again, Jane and Mary are joined by Lizzie, who stands with Sir William's daughter, Charlotte. The girls go to join their mother, and the curtsies are made by the ladies. But, with a curt bow, Darcy leaves, much to Mrs. Bennet's annoyance. Jane glances at her mother, before her attention is returned to Bingley by her. Later, she is danced with by him, hands are held and warm smiles are exchanged. Whilst the young couple enjoys themselves, at the side, Darcy cannot hide his disdain. Darcy turns and spots Mrs. Bennet as she holds court over tea and cake, not bothering to hide her contempt for him. Then, moving on, Kitty and Lydia are spotted by him running wild through the hall. On the dark street below, local men become merry and mimic the dancing going on inside. So enthusiastic is one man that he trips and falls in a water trough. When the dance of Jane and Bingley comes to an end, she is led by him by the hand to present her to his sisters. With an approving smile, Mrs. Bennet looks on. Jane and Bingley dance again. A dark tailcoat with pale satin breeches is worn by Bingley. A delicate creamy gold dress with puff sleeves is worn by Jane. Long white evening gloves are worn by her. Noble features and fair curly hair belong to Bingley, who is an accomplished dancer, moving through the steps with ease and grace. The hall is prowled through by Darcy, his face set in grim forbearance. Sir William goes to speak to him but then thinks better of it. Nearby, Lizzie sits with a rather serious Mary. With a nervous glance at his party, Jane is allowed to lead Bingley to be introduced to Charlotte Lucas by him. Another dance is begun. Sitting nearby, him is heard by Lizzie and she bristles. Off heads Bingley. Having heard everything, Darcy is looked at by Lizzie out the corner of her eye. Then, with a mischievous smile, the room is crossed by her in front of him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Mr. Hurst joins Darcy, who observes the building with detachment. Inside, the dance is in full swing, with smiling men and women in pastel gowns moving in circles. Sir William Lucas claps from the sidelines. Lizzie and Lydia, in empire-line dresses, enjoy themselves, performing dainty steps and do-si-do before re-forming the circle. In two lines, the dancers glide across the floor, a blaze of color and feathers. An awestruck hush greets the Bingley party's arrival, and Sir William Lucas quickly welcomes them. As dancing resumes, Lizzie joins Jane, Mary, and Charlotte. The girls join their mother, curtsy, and Darcy departs with a curt bow, annoying Mrs. Bennet. Jane glances at her mother before focusing on Bingley. Later, she dances with him, holding hands and smiling. While they enjoy themselves, Darcy watches with disdain. He notices Mrs. Bennet's contempt and Kitty and Lydia running wild. Outside, local men mimic the dancing, one falling into a water trough. After Jane and Bingley's dance, he introduces her to his sisters, and Mrs. Bennet smiles approvingly. They dance again; Bingley in a dark tailcoat and satin breeches, Jane in a creamy gold dress with puff sleeves and long gloves. Bingley, with noble features and fair hair, dances gracefully. Darcy prowls the hall, grim-faced. Sir William approaches him but hesitates. Nearby, Lizzie sits with serious Mary. Bingley lets Jane introduce him to Charlotte Lucas. Another dance begins, and Lizzie, hearing everything, bristles. Bingley departs, and Lizzie, with a mischievous smile, crosses the room in front of Darcy."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mr. Hurst joins Darcy, who observes the building indifferently. Inside, the dance is lively, with men and women in pastel gowns circling. Sir William Lucas claps from the sidelines. Lizzie and Lydia, in empire-line dresses, enjoy themselves, do-si-doing and re-forming the circle. Before the musicians, couples glide in unison, a colorful display. The Bingley party's arrival hushes the room. They appear uneasy until Sir William greets them. Lizzie joins Jane, Mary, and Charlotte. The girls curtsy, but Darcy leaves, annoying Mrs. Bennet. Jane focuses on Bingley, later dancing with him, smiling warmly. Darcy watches disdainfully, noticing Mrs. Bennet's contempt. He sees Kitty and Lydia running wild. Outside, men mimic the dance, one falling into a trough. After Jane and Bingley's dance, he introduces her to his sisters. Mrs. Bennet smiles approvingly. They dance again; Bingley in a dark tailcoat, Jane in creamy gold with gloves. Bingley, with noble features, dances gracefully. Darcy prowls grimly. Sir William hesitates to speak to him. Lizzie sits with Mary. Bingley lets Jane introduce him to Charlotte. Another dance starts. Lizzie hears and bristles, watching Darcy. With a mischievous smile, she crosses the room in front of him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As Mr. Darcy stands with an air of detachment, observing the building with a distant gaze, a third gentleman, Mr. Hurst, approaches him. Inside the lively hall, the dancing is already in full swing, with cheerful men and women dressed in pastel-colored gowns, joyfully holding hands and moving in a circular formation. On the sidelines, an older gentleman, Sir William Lucas, enthusiastically claps along to the rhythm. Lizzie and Lydia, adorned in their elegant empire-line dresses, are thoroughly immersed in the festivities. With graceful, dainty steps, they engage with their partners in a do-si-do before seamlessly re-forming the circle. In a two-line formation before the chamber musicians, the ladies and gentlemen face their respective partners, then glide across the polished floor in unison, moving back and forth in a vibrant display of color and feathers.\n\nAs the Bingley party makes its grand entrance, an awestruck hush falls over the room, signaling their arrival. The newcomers appear distinctly uncomfortable until Sir William Lucas quickly approaches to greet them warmly. As the dancing resumes, Lizzie joins her sisters, Jane and Mary, who are standing with Sir William's daughter, Charlotte. The two younger girls then proceed to join their mother, and the ladies offer a graceful curtsy. However, with a curt bow, Mr. Darcy departs, much to Mrs. Bennet's irritation. Jane glances at her mother before turning her attention back to Mr. Bingley. Later, she is seen dancing with him, their hands clasped together as they exchange warm smiles. While the young couple enjoys their time on the dance floor, Mr. Darcy, watching from the sidelines, cannot conceal his disdain. He turns his gaze and notices Mrs. Bennet presiding over tea and cake, her contempt for him barely hidden. Moving on, he spots Kitty and Lydia, who are running wild through the hall with youthful exuberance.\n\nOutside, on the dimly lit street below, local men are reveling in merriment, mimicking the dancing taking place inside. One particularly enthusiastic man becomes so carried away that he trips and falls into a water trough. As Jane and Bingley's dance concludes, he gallantly leads her by the hand to introduce her to his sisters, while Mrs. Bennet looks on with a satisfied smile. Jane and Bingley take to the dance floor once more. Bingley is dressed in a dark tailcoat paired with pale satin breeches, while Jane's dress is a delicate creamy gold with puff sleeves, complemented by long white evening gloves. Bingley, with his noble features and fair curly hair, is an accomplished dancer, moving through the steps with effortless ease and grace. Meanwhile, Mr. Darcy prowls through the hall, his expression set in grim forbearance. Sir William considers speaking to him but ultimately decides against it. Nearby, Lizzie sits with a rather serious Mary. With a nervous glance at his party, Bingley allows Jane to lead him to be introduced to Charlotte Lucas. As another dance begins, Lizzie, sitting nearby, overhears him and bristles. Bingley departs, and having heard everything, Lizzie casts a sidelong glance at Mr. Darcy. Then, with a mischievous smile playing on her lips, she rises and crosses the room in front of him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As Mr. Darcy stands with an air of aloofness, observing the grand building with a distant, almost pensive gaze, a third gentleman known as Mr. Hurst makes his approach toward him. Within the lively and bustling hall, dancing is already in full swing, with cheerful men and women dressed in pastel-colored gowns, joyfully holding hands while moving in a circular formation with great enthusiasm. On one side of this vibrant scene, an older gentleman, Sir William Lucas, joins in by clapping along enthusiastically to the rhythm of the music. Lizzie and Lydia, adorned in their elegant and flowing empire-line dresses, find themselves thoroughly immersed in the festivities. With graceful and dainty steps, they engage with their partners in a traditional do-si-do before seamlessly re-forming the circle once more. In a neat two-line formation before the chamber musicians, the ladies and gentlemen face their respective partners and then glide across the polished floor in unison, moving back and forth in a vibrant display of color, embellished with feathers.\n\nAs the prestigious Bingley party makes its grand entrance, an awestruck hush falls over the room, signaling their arrival to all present. The newcomers appear distinctly uncomfortable and a little out of place until Sir William Lucas quickly approaches to greet them in a warm and friendly manner. As the dancing resumes its lively pace, Lizzie joins her sisters, Jane and Mary, who are standing alongside Sir William's daughter, Charlotte. The two younger girls proceed to join their mother, and the ladies offer a graceful curtsy. However, with a brief and curt bow, Mr. Darcy takes his leave, much to the noticeable irritation of Mrs. Bennet. Jane exchanges a glance with her mother before turning her attention back to the charming Mr. Bingley. Later, she is seen gracefully dancing with him, their hands clasped together as they exchange warm and sincere smiles. While the young couple enjoys their time together on the dance floor, Mr. Darcy, observing from the sidelines, cannot hide his disdain. He turns his gaze and notices Mrs. Bennet presiding over the service of tea and cake, her contempt for him barely hidden beneath her polite exterior. Moving on, he spots Kitty and Lydia, who are running wildly through the hall with youthful exuberance and unchecked energy.\n\nOutside, on the dimly lit street below, local men are reveling in merriment, mimicking the dancing taking place inside with their own spontaneous flair. One particularly enthusiastic man becomes so carried away with his spirited dancing that he trips and falls headlong into a water trough, much to the amusement of his companions. As Jane and Bingley's dance reaches its conclusion, he gallantly guides her by the hand to introduce her to his sisters, while Mrs. Bennet observes with a satisfied and approving smile. Jane and Bingley take to the dance floor once more, resuming their enchanting movements. Bingley is dressed in a dark and stylish tailcoat paired with pale satin breeches, while Jane's dress is a delicate creamy gold with puff sleeves, complemented by long white evening gloves. Bingley, with his noble features and fair curly hair, is an accomplished dancer, moving through the steps with effortless ease and grace. Meanwhile, Mr. Darcy prowls through the hall, his expression set in grim forbearance. Sir William considers the possibility of speaking to him but ultimately decides against it. Nearby, Lizzie sits with a rather serious Mary. With a nervous glance at his party, Bingley allows Jane to lead him to be introduced to Charlotte Lucas. As the strains of another dance begin, Lizzie, sitting nearby, overhears him and bristles slightly. Bingley departs, and having heard everything, Lizzie casts a sidelong and knowing glance at Mr. Darcy. Then, with a mischievous smile playing on her lips, she rises and confidently crosses the room right in front of him."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Mr. Hurst approaches, Darcy stands with an air of detachment, his gaze fixed on the building. Inside, the scene is lively, with men and women in pastel gowns smiling as they hold hands and move in a circle, their steps synchronized to the music. Sir William Lucas, an older man, stands on the sidelines, clapping in rhythm with the dancers. Lizzie and Lydia, dressed in their empire-line dresses, are thoroughly enjoying the festivities. They take dainty steps, setting to their partners and performing a do-si-do before seamlessly re-forming the circle. In a two-line formation before the chamber musicians, the ladies and gentlemen face their respective partners, then glide across the floor in unison, moving back and forth in a vibrant display of color and feathers. As the Bingley party arrives, an awestruck hush falls over the room, and the new arrivals appear distinctly ill at ease until Sir William Lucas hurries over to greet them. As the dancing resumes, Lizzie joins Jane and Mary, who are standing with Sir William's daughter, Charlotte. The two girls then go to join their mother, and the ladies curtsy. However, Darcy, with a curt bow, departs, much to Mrs. Bennet's annoyance. Jane glances at her mother before turning her attention back to Bingley. Later, she is seen dancing with him, holding hands and smiling warmly. While the young couple enjoys themselves, Darcy watches from the side, unable to conceal his disdain. He turns and notices Mrs. Bennet presiding over tea and cake, her contempt for him evident. Moving on, he spots Kitty and Lydia running wild through the hall. Outside, on the dark street below, local men are getting merry, mimicking the dancing inside. One man, in his enthusiasm, trips and falls into a water trough. As Jane and Bingley's dance concludes, he takes her by the hand to introduce her to his sisters, while Mrs. Bennet looks on with an approving smile. Jane and Bingley dance again, with Bingley in a dark tailcoat and pale satin breeches, and Jane in a delicate creamy gold dress with puff sleeves and long white evening gloves. Bingley, with his noble features and fair curly hair, dances with ease and grace. Meanwhile, Darcy prowls through the hall, his face set in grim forbearance. Sir William approaches to speak to him but then reconsiders. Nearby, Lizzie sits with a rather serious Mary. With a nervous glance at his party, Bingley allows Jane to lead him to be introduced to Charlotte Lucas. As another dance begins, Lizzie, sitting nearby, hears him and bristles. Bingley departs, and having heard everything, Lizzie looks at Darcy out of the corner of her eye. Then, with a mischievous smile, she rises and crosses the room in front of him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Mr. Hurst joins Darcy, who is observing the building with detachment. Inside, the dance is in full swing, with men and women in pastel gowns moving in circles, while Sir William Lucas claps from the sidelines. Lizzie and Lydia, in their empire-line dresses, enjoy the dance, performing steps and re-forming circles with their partners. As the Bingley party arrives, an awestruck hush falls over the room, and Sir William Lucas quickly greets them. Lizzie joins Jane and Mary with Charlotte, Sir William's daughter. The girls then join their mother, curtsying as Darcy departs with a curt bow, annoying Mrs. Bennet. Jane, after a glance at her mother, focuses on Bingley and later dances with him, smiling warmly. Meanwhile, Darcy watches with disdain, noticing Mrs. Bennet's contemptuous gaze and Kitty and Lydia's wild antics. Outside, local men mimic the dance, with one enthusiastically falling into a water trough. After Jane and Bingley's dance, he introduces her to his sisters, earning Mrs. Bennet's approval. They dance again, with Bingley in a dark tailcoat and Jane in a creamy gold dress. Bingley, with noble features and fair hair, dances gracefully. Darcy prowls the hall, grim-faced, as Sir William hesitates to approach him. Nearby, Lizzie sits with a serious Mary. Bingley, after a nervous glance at his party, lets Jane introduce him to Charlotte Lucas. As another dance begins, Lizzie overhears Bingley, bristles, and watches him leave. With a mischievous smile, she crosses the room in front of Darcy."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A third man, Mr. Hurst, comes over as Darcy, a wealthy gentleman from London known for his reserved demeanor, regards the elegant Georgian-era building with an air of detachment. Inside, the dancing is well under way, with smiling men and women in pastel gowns reminiscent of the Regency fashion trend holding hands and going round in a circle. An older man, Sir William Lucas, a local dignitary who once served as mayor, claps from the sidelines. Dressed in their empire-line dresses, a popular style of the period emphasizing a high waistline, Lizzie and Lydia are thoroughly enjoying themselves. With dainty steps, they set to their partners and do-si-do before re-forming the circle. In a two-line formation, before the chamber musicians who are playing lively tunes on violins and pianos, the ladies and gentlemen set to their respective partners, then in unison glide across the polished wooden floor, back and forth, a blaze of color and feathers from their elaborate headpieces. Heralding the arrival of the Bingley party, a prominent family new to the neighborhood, an awestruck hush descends upon the room. The new arrivals look distinctly ill at ease before Sir William Lucas hurries over to greet them with his customary enthusiasm. As people take to the floor again, Lizzie joins Jane and Mary, who are standing with Sir William's daughter, Charlotte, known for her sensible and practical nature. The two girls go to join their mother, and the ladies curtsy, a gesture of respect and politeness. But, with a curt bow, Darcy is gone, much to Mrs. Bennet's annoyance as she sees potential suitors for her daughters slipping away. Jane glances at her mother, before returning her attention to Bingley, whose charm and affability have won her over. Later, she's dancing with him, holding hands and smiling warmly, caught up in the joy of the evening. Whilst the young couple are enjoying themselves, watching at the side, Darcy cannot hide his disdain for such social amusements. Darcy turns and spots Mrs. Bennet holding court over tea and cake, not bothering to hide her contempt for him, a mere gentleman without noble title. Then, moving on, he spots Kitty and Lydia, running wild through the hall in a manner that defies social decorum. On the dark street below, local men are getting merry, likely fueled by ale from the nearby tavern, and mimicking the dancing going on inside. One man is so enthusiastic he trips and falls in a water trough, drawing laughter from his companions. When Jane and Bingley's dance comes to an end, he leads her by the hand to present her to his sisters, hoping to gain their approval. Mrs. Bennet looks on, with an approving smile, pleased by the match's potential. Jane and Bingley dance again, moving gracefully to the rhythm of the music. Bingley wears a dark tailcoat with pale satin breeches, attired in the gentlemanly fashion of the day. Jane's dress is a delicate creamy gold with puff sleeves, highlighting her graceful figure. She wears long white evening gloves, a mark of elegance. Bingley, who has noble features and fair curly hair, is an accomplished dancer, moving through the steps with ease and grace that pleases the onlookers. Darcy prowls through the hall, his face set in grim forbearance, clearly unimpressed by the festive atmosphere. Sir William goes to speak to him but then thinks better of it, seeing Darcy's unapproachable expression. Nearby, Lizzie is sitting with a rather serious Mary, known for her piety and love for moralizing books. With a nervous glance at his party, Bingley allows Jane to lead him to be introduced to Charlotte Lucas, hoping to build better social connections. Another dance begins with the lively strains of a country tune. Sitting nearby, Lizzie hears him and bristles at a slight overheard. Bingley heads off, leaving a trail of interest behind him. Having heard everything, Lizzie looks at Darcy out the corner of her eye, wary of his judgments. Then, with a mischievous smile that hints at her spirited nature, she gets up and crosses the room in front of him, defying his aloofness."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A third man Mr Hurst comes over as Darcy regards the building with an air of detachment  Dressed in their empireline dresses Lizzie and Lydia are thoroughly enjoying themselves  With dainty steps they set to their partners and dosido before reforming the circle  In a twoline formation before the chamber musicians the ladies and gentlemen set to their respective partners then in unison glide across the floor back and forth a blaze of color and feathers  Heralding the arrival of the Bingley party an awestruck hush descends upon the room  The new arrivals look distinctly ill at ease before Sir William Lucas hurries over to greet them  As people take to the floor again Lizzie joins Jane and Mary who are standing with Sir William's daughter Charlotte  The two girls go to join their mother and the ladies curtsy  But with a curt bow Darcy is gone much to Mrs Bennet's annoyance  Jane glances at her mother before returning her attention to Bingley  Later she's dancing with him holding hands and smiling warmly  Whilst the young couple are enjoying themselves watching at the side Darcy cannot hide his disdain  Darcy turns and spots Mrs Bennet holding court over tea and cake not bothering to hide her contempt for him  Then moving on he spots Kitty and Lydia running wild through the hall  On the dark street below local men are getting merry and mimicking the dancing going on inside  One man is so enthusiastic he trips and falls in a water trough  When Jane and Bingley's dance comes to an end he leads her by the hand to present her to his sisters  Mrs Bennet looks on with an approving smile  Jane and Bingley dance again  Inside the dancing is well under way with smiling men and women in pastel gowns holding hands and going round in a circle  An older man Sir William Lucas claps from the sidelines  Dressed in their empireline dresses Lizzie and Lydia are thoroughly enjoying themselves  With dainty steps they set to their partners and dosido before reforming the circle  In a twoline formation before the chamber musicians the ladies and gentlemen set to their respective partners then in unison glide across the floor back and forth a blaze of color and feathers  Heralding the arrival of the Bingley party an awestruck hush descends upon the room  The new arrivals look distinctly ill at ease before Sir William Lucas hurries over to greet them  As people take to the floor again Lizzie joins Jane and Mary who are standing with Sir William's daughter Charlotte  The two girls go to join their mother and the ladies curtsy  But with a curt bow Darcy is gone much to Mrs Bennet's annoyance  Jane glances at her mother before returning her attention to Bingley  Later she's dancing with him holding hands and smiling warmly  Whilst the young couple are enjoying themselves watching at the side Darcy cannot hide his disdain  Darcy turns and spots Mrs Bennet holding court over tea and cake not bothering to hide her contempt for him  Then moving on he spots Kitty and Lydia running wild through the hall  On the dark street below local men are getting merry and mimicking the dancing going on inside  One man is so enthusiastic he trips and falls in a water trough  When Jane and Bingley's dance comes to an end he leads her by the hand to present her to his sisters  Mrs Bennet looks on with an approving smile  Jane and Bingley dance again  Bingley wears a dark tailcoat with pale satin breeches  Jane's dress is a delicate creamy gold with puff sleeves  She wears long white evening gloves  Bingley who has noble features and fair curly hair is an accomplished dancer moving through the steps with ease and grace  Darcy prowls through the hall his face set in grim forbearance  Sir William goes to speak to him but then thinks better of it  Nearby Lizzie is sitting with a rather serious Mary  With a nervous glance at his party Bingley allows Jane to lead him to be introduced to Charlotte Lucas  Another dance begins  Sitting nearby  Lizzie hears him and bristles  Bingley heads off  Having heard everything Lizzie looks at Darcy out the corner of her eye  Then with a mischievous smile she gets up and crosses the room in front of him"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A third man Mr Hurst comes over as Darcy regards the building with an air of detachment. Inside the dancing is well under way with smiling men and women in pastel gowns holding hands and going round in a circle. An older man Sir William Lucas claps from the sidelines. Dressed in their empireline dresses Lizzie and Lydia are thoroughly enjoying themselves. With dainty steps they set to their partners and dosido before reforming the circle. In a twoline formation before the chamber musicians the ladies and gentlemen set to their respective partners then in unison glide across the floor back and forth a blaze of color and feathers. Heralding the arrival of the Bingley party an awestruck hush descends upon the room. The new arrivals look distinctly ill at ease before Sir William Lucas hurries over to greet them. As people take to the floor again Lizzie joins Jane and Mary who are standing with Sir William's daughter Charlotte. The two girls go to join their mother and the ladies curtsy. But with a curt bow Darcy is gone much to Mrs Bennet's annoyance. Jane glances at her mother before returning her attention to Bingley. Later she is dancing with him holding hands and smiling warmly. Whilst the young couple are enjoying themselves watching at the side Darcy cannot hide his disdain. Darcy turns and spots Mrs Bennet holding court over tea and cake not bothering to hide her contempt for him. Then moving on he spots Kitty and Lydia running wild through the hall. On the dark street below local men are getting merry and mimicking the dancing going on inside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. One man is so enthusiastic he trips and falls in a water trough. When Jane and Bingley's dance comes to an end he leads her by the hand to present her to his sisters. Mrs Bennet looks on with an approving smile. Jane and Bingley dance again. Bingley wears a dark tailcoat with pale satin breeches. Jane's dress is a delicate creamy gold with puff sleeves. She wears long white evening gloves. Bingley who has noble features and fair curly hair is an accomplished dancer moving through the steps with ease and grace. Darcy prowls through the hall his face set in grim forbearance. Sir William goes to speak to him but then thinks better of it. Nearby Lizzie is sitting with a rather serious Mary. With a nervous glance at his party Bingley allows Jane to lead him to be introduced to Charlotte Lucas. Another dance begins. Sitting nearby. Lizzie hears him and bristles. Bingley heads off. Having heard everything Lizzie looks at Darcy out the corner of her eye. Then with a mischievous smile she gets up and crosses the room in front of him."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A third man Mr Hurst comes over as Darcy regards the building with an air of detachment. Inside the dancing is well under way with smiling men and women in pastel gowns holding hands and going round in a circle. An older man Sir William Lucas claps from the sidelines. Dressed in their empireline dresses Lizzie and Lydia are thoroughly enjoying themselves. With dainty steps they set to their partners and dosido before reforming the circle. In a twoline formation before the chamber musicians the ladies and gentlemen set to their respective partners then in unison glide across the floor back and forth a blaze of color and feathers. Heralding the arrival of the Bingley party an awestruck hush descends upon the room. The new arrivals look distinctly ill at ease before Sir William Lucas hurries over to greet them. As people take to the floor again Lizzie joins Jane and Mary who are standing with Sir William's daughter Charlotte. The two girls go to join their mother and the ladies curtsy. But with a curt bow Darcy is gone much to Mrs Bennet's annoyance. Jane glances at her mother before returning her attention to Bingley. Later she is dancing with him holding hands and smiling warmly. Whilst the young couple are enjoying themselves watching at the side Darcy cannot hide his disdain. Darcy turns and spots Mrs Bennet holding court over tea and cake not bothering to hide her contempt for him. Then moving on he spots Kitty and Lydia running wild through the hall. On the dark street below local men are getting merry and mimicking the dancing going on inside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. One man is so enthusiastic he trips and falls in a water trough. When Jane and Bingley's dance comes to an end he leads her by the hand to present her to his sisters. Mrs Bennet looks on with an approving smile. Jane and Bingley dance again. Bingley wears a dark tailcoat with pale satin breeches. Jane's dress is a delicate creamy gold with puff sleeves. She wears long white evening gloves. Bingley who has noble features and fair curly hair is an accomplished dancer moving through the steps with ease and grace. Darcy prowls through the hall his face set in grim forbearance. Sir William goes to speak to him but then thinks better of it. Nearby Lizzie is sitting with a rather serious Mary. With a nervous glance at his party Bingley allows Jane to lead him to be introduced to Charlotte Lucas. Another dance begins. Sitting nearby. Lizzie hears him and bristles. Bingley heads off. Having heard everything Lizzie looks at Darcy out the corner of her eye. Then with a mischievous smile she gets up and crosses the room in front of him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A third man Mr Hurst comes over as Darcy regards the building with an air of detachment. Inside the dancing is well under way with smiling men and women in pastel gowns holding hands and going round in a circle. An older man Sir William Lucas claps from the sidelines. Dressed in their empireline dresses Lizzie and Lydia are thoroughly enjoying themselves. With dainty steps they set to their partners and dosido before reforming the circle. In a twoline formation before the chamber musicians the ladies and gentlemen set to their respective partners then in unison glide across the floor back and forth a blaze of color and feathers. Heralding the arrival of the Bingley party an awestruck hush descends upon the room. The new arrivals look distinctly ill at ease before Sir William Lucas hurries over to greet them. As people take to the floor again Lizzie joins Jane and Mary who are standing with Sir William's daughter Charlotte. Sir William goes to speak to him but then thinks better of it. Nearby Lizzie is sitting with a rather serious Mary. With a nervous glance at his party Bingley allows Jane to lead him to be introduced to Charlotte Lucas. Another dance begins. Sitting nearby. Lizzie hears him and bristles. Bingley heads off. Having heard everything Lizzie looks at Darcy out the corner of her eye. Then with a mischievous smile she gets up and crosses the room in front of him."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A third man Mr Hurst comes over as Darcy regards the building with an air of detachment. Inside the dancing is well under way with smiling men and women in pastel gowns holding hands and going round in a circle. An older man Sir William Lucas claps from the sidelines. Lizzie hears him and bristles. Bingley heads off. Having heard everything Lizzie looks at Darcy out the corner of her eye. Then with a mischievous smile she gets up and crosses the room in front of him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A third llama, Mr. Hurst, comes over as a penguin regards the building with an air of detachment. Inside, the dancing is well under way, with smiling giraffes and zebras in pastel gowns holding hands and going round in a circle. An older rabbit, Sir William Lucas, claps from the sidelines. Dressed in their empire-line dresses, dolphins and sharks are thoroughly enjoying themselves. With dainty steps, they set to their partners and do-si-do before re-forming the circle. In a two-line formation, before the chamber musicians, the kangaroos and pandas set to their respective partners, then in unison glide across the floor, back and forth, a blaze of color and feathers. Heralding the arrival of the Bingley flock, an awestruck hush descends upon the room. The new arrivals look distinctly ill at ease before Sir William Lucas hurries over to greet them. As elephants take to the floor again, turtles join leopards and tigers, who are standing with Sir William's daughter, Charlotte. The two dragons go to join their mother, and the owls curtsy. But, with a curt bow, a walrus is gone, much to Mrs. Bennet's annoyance. A gazelle glances at her mother, before returning her attention to Bingley. Later, she's dancing with him, holding hands and smiling warmly. Whilst the young couple are enjoying themselves, watching at the side, an eagle cannot hide its disdain. The eagle turns and spots Mrs. Bennet holding court over tea and cake, not bothering to hide her contempt for him. Then, moving on, the eagle spots kittens and puppies, running wild through the hall. On the dark street below, local foxes are getting merry and mimicking the dancing going on inside. One fox is so enthusiastic it trips and falls in a water trough. When swans and Bingley's dance comes to an end, he leads her by the paw to present her to his sisters. Mrs. Bennet looks on, with an approving smile. Swans and Bingley dance again. Bingley wears a dark tailcoat with pale satin breeches. A giraffe's dress is a delicate creamy gold with puff sleeves. She wears long white evening gloves. Bingley, who has noble features and fair curly hair, is an accomplished dancer, moving through the steps with ease and grace. The owl prowls through the hall, its face set in grim forbearance. Sir William goes to speak to the owl but then thinks better of it. Nearby, flamingos are sitting with a rather serious turtle. With a nervous glance at its flock, Bingley allows a swan to lead him to be introduced to Charlotte Lucas. Another dance begins. Sitting nearby, flamingos hear him and bristle. Bingley heads off. Having heard everything, flamingos look at the walrus out the corner of their eye. Then, with a mischievous smile, the flamingo gets up and crosses the room in front of it."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A third man, Mr. Hurst, comes over as Darcy regards the garden with an air of detachment. Inside, the singing is well under way, with laughing men and women in vibrant cloaks holding hands and going round in a square. An older man, Sir William Lucas, snaps from the sidelines. Dressed in their empire-line skirts, Lizzie and Lydia are thoroughly enjoying themselves. With nimble steps, they set to their partners and spin around before re-forming the square. In a two-beam formation, before the chamber singers, the ladies and gentlemen set to their respective partners, then in unison float across the tiles, back and forth, a blaze of color and ribbons. Heralding the arrival of the Bingley troop, an awestruck hush descends upon the stage. The new arrivals look distinctly ill at ease before Sir William Lucas hurries over to greet them. As people take to the tiles again, Lizzie joins Jane and Mary, who are standing with Sir William's niece, Charlotte. The two girls go to join their aunt, and the ladies bow. But, with a curt nod, Darcy is gone, much to Mrs. Bennet's annoyance. Jane glances at her aunt, before returning her attention to Bingley. Later, she's singing with him, holding hands and smiling warmly. Whilst the young couple are enjoying themselves, watching at the side, Darcy cannot hide his disdain. Darcy turns and spots Mrs. Bennet holding court over cider and muffins, not bothering to hide her contempt for him. Then, moving on, he spots Kitty and Lydia, running wild through the corridor. On the shadowy path below, local women are getting merry and mimicking the singing going on inside. One woman is so enthusiastic she trips and falls in a mud puddle. When Jane and Bingley's song comes to an end, he leads her by the hand to present her to his brothers. Mrs. Bennet looks on, with an approving grin. Jane and Bingley sing again. Bingley wears a dark tunic with pale satin trousers. Jane's cloak is a delicate creamy gold with puff collars. She wears long white evening mittens. Bingley, who has noble features and fair curly hair, is an accomplished singer, moving through the notes with ease and grace. Darcy prowls through the corridor, his face set in grim determination. Sir William goes to speak to him but then thinks better of it. Nearby, Lizzie is sitting with a rather serious Mary. With a nervous glance at his troop, Bingley allows Jane to lead him to be introduced to Charlotte Lucas. Another song begins. Sitting nearby, Lizzie hears him and tightens. Bingley heads off. Having heard everything, Lizzie looks at Darcy out the corner of her eye. Then, with a mischievous smile, she gets up and crosses the corridor in front of him."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A third man, Mr. Hurst, ambles over as Darcy surveys the building with an air of detachment. Inside, the dancing is already in full swing, with smiling men and women in pastel gowns spinning umbrellas and jumping on one foot in a circle. An older man, Sir William Lucas, whistles from the sidelines. Dressed in their empire-line dresses, Lizzie and Lydia are observing a juggling act enthusiastically. With dainty hops, they nod to their partners and wiggle their fingers before re-forming the circle. In a two-line formation, before the chamber musicians, the ladies and gentlemen nod to their respective partners, then in unison twirl across the floor, side to side, a whirlwind of color and feathers. Announcing the presence of the Bingley party, a stunned silence floods over the room. The new arrivals look distinctly uncomfortable before Sir William Lucas rushes over to acknowledge them. As people return to their seats again, Lizzie meets up with Jane and Mary, who are sitting with Sir William's daughter, Charlotte. The two girls wander off to greet their mother, and the ladies wave. But, with a brisk nod, Darcy disappears, much to Mrs. Bennet's displeasure. Jane peeks at her mother, before redirecting her attention to Bingley. Later, she's chatting with him, giggling and sharing a joke. Whilst the young couple are having a pleasant time, observing from the side, Darcy struggles to conceal his disdain. Darcy turns and observes Mrs. Bennet tutoring others over tea and cake, not attempting to conceal her judgment of him. Then, moving onward, he sees Kitty and Lydia, skipping energetically through the hall. On the dark street below, local men are becoming boisterous and mimicking the festivities unfolding inside. One man is so absorbed he stumbles and plunges into a fountain. When Jane and Bingley's dance concludes, he guides her by the arm to introduce her to his sisters. Mrs. Bennet watches, with a nod of approval. Jane and Bingley twirl again. Bingley wears a dark tailcoat with pale satin breeches. Jane's dress is a delicate creamy gold with fluttering sleeves. She wears long white evening gloves. Bingley, who has dignified features and fair curly hair, is a talented performer, maneuvering through the routines with flair and poise. Darcy stalks through the hall, his expression fixed in stoic disapproval. Sir William contemplates speaking to him but reconsiders. Nearby, Lizzie is lounging with a rather pensive Mary. With a cautious glance at his group, Bingley grants Jane the chance to introduce him to Charlotte Lucas. Another display commences. Sitting nearby, Lizzie overhears him and bristles. Bingley departs. Having understood everything, Lizzie peeks at Darcy from the corner of her eye. Then, with a teasing grin, she rises and tiptoes across the room in front of him."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A third cat, Ms. Feather, meanders over as Bentley observes the carousel with an air of detachment. Inside, the juggling is well under way, with laughing sunflowers and clouds in striped suits holding umbrellas and spinning round in a circle. An elderberry, Sir Timothy Treetop, claps from the sidelines. Clothed in their polka-dot skirts, Mandy and Carla are thoroughly enjoying themselves. With bouncy hops, they skip to their mushrooms and juggle before re-forming the circle. In a zigzag pattern, before the jungle drummers, the hats and shoes skip to their respective mushrooms, then in unison glide across the floor, back and forth, a blaze of lights and sparkles. Announcing the arrival of the Whisker clan, an astounded silence falls over the meadow. The new guests look distinctly out of place before Sir Timothy Treetop hurries over to greet them. As flowers sway to the beat again, Mandy joins Sarah and Lucy, who are standing with Sir Timothy's branch, Violet. The two candles go to join their wallpaper, and the hats curtsy. But, with a swift nod, Bentley is gone, much to Ms. Maple's annoyance. Sarah glances at her wallpaper, before returning her attention to Whisker. Later, she's juggling with him, holding umbrellas and laughing warmly. Whilst the sprightly duo are enjoying themselves, watching at the edge, Bentley cannot hide his disgust. Bentley turns and spots Ms. Maple holding court over lemonade and muffins, not bothering to hide her scorn for him. Then, moving on, he spots Daisy and Carla, skipping wild through the meadow. On the dim pathway below, neighboring cats are getting jolly and mimicking the juggling happening inside. One cat is so thrilled he trips and falls in a puddle. When Sarah and Whisker's juggling concludes, he leads her by the paw to present her to his scarves. Ms. Maple looks on, with an approving grin. Sarah and Whisker juggle once more. Whisker dons a bright waistcoat with floral patterned leggings. Sarah's outfit is a soft lavender silk with lace sleeves. She wears long velvet evening mittens. Whisker, who has regal features and lush wavy locks, is a skilled juggler, moving through the stages with ease and elegance. Bentley prowls through the meadow, his expression set in stern restraint. Sir Timothy approaches to converse with him but then reconsiders. Nearby, Mandy is sitting with a rather solemn Lucy. With a cautious glance at his crowd, Whisker allows Sarah to lead him to be introduced to Violet Treetop. Another juggling act starts. Sitting nearby, Mandy hears him and stiffens. Whisker departs. Having heard everything, Mandy glances at Bentley out the corner of her eye. Then, with a playful grin, she rises and crosses the meadow in front of him."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A third bird, Mr. Finch, hops over as a hawk examines the building with a sense of indifference. Inside, the skating is well underway, with frowning cats and dogs in striped outfits wagging tails and spinning in a line. A younger penguin, Sir Joseph Lucas, whistles from the sidelines. Clothed in their galaxy-spangled robes, Anne and Lucy are barely containing their irritation. With clumsy leaps, they hop to their partners and waltz before scattering the line. In a mixed formation, near the wind musicians, the squirrels and rabbits hop to their respective partners, then in unison float across the air, left and right, a swirl of hues and leaves. Announcing the appearance of the Robinson crew, a fascinated whisper floats through the arena. The new guests look exceptionally relaxed before Sir Joseph Lucas ambles over to ignore them. As creatures float to the sky again, Anne joins Jane and Mary, who are standing with Sir Joseph's son, Charles. The two birds fly to join their father, and the squirrels nod. But, with a sharp wink, the hawk is airborne, much to Mr. Bennet's delight. Jane peeks at her father, before shifting her focus to Robinson. Later, she’s skating with him, wagging tails and frowning warmly. Whilst the old couple are enduring themselves, cheering at the skies, the hawk cannot hide its admiration. The hawk turns and spots Mr. Bennet holding court over nectar and honey, pretending to hide her disdain for it. Then, flying off, it observes Kelly and Lucy, flying gracefully through the sky. On the bright ocean below, local fish are getting tired and copying the skating going on above. One fish is so overjoyed it leaps and lands in a sandy dune. When Jane and Robinson's skate concludes, she nudges him by the wing to introduce him to his brothers. Mr. Bennet looks away, with a dismissive scowl. Jane and Robinson skate again. Robinson wears a bright waistcoat with dark velvet trousers. Jane's outfit is a bold crimson blue with long fringe sleeves. She wears short red evening mittens. Robinson, who has striking spots and dark wavy fur, is a clumsy skater, tripping through the steps with strain and effort. The hawk flits through the sky, its gaze fixed in grim awe. Sir Joseph approaches to chat with it but then retreats swiftly. Nearby, Anne is floating with a terribly cheerful Mary. With a confident grin at his crew, Robinson permits Jane to pull him to be introduced to Charles Lucas. Another skate concludes. Sitting afar, Anne hears her and relaxes. Robinson soars off. Having watched everything, Anne glances at the hawk from the side of her vision. Then, with a benevolent grin, she flutters up and sails across the sky above it."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A third man, Mr. Hurst, wanders over as Darcy inspects the painting with an air of curiosity. Inside, the singing is well underway, with laughing men and women in vibrant suits shaking elbows and twirling in a line. An older man, Sir William Lucas, snaps from the sidelines. Clad in their regal gowns, Lizzie and Lydia are absolutely entertaining themselves. With nimble jumps, they turn to their partners and promenade before breaking the line. In a single-file arrangement, before the street musicians, the ladies and gentlemen bow to their respective partners, then in unison skip across the yard, side to side, a splash of light and ribbons. Signaling the departure of the Bingley party, an appreciative cheer ascends from the room. The new leavers look distinctly poised before Sir William Lucas rushes over to farewell them. As people drift from the yard again, Lizzie joins Jane and Mary, who are lingering with Sir William's daughter, Charlotte. The two girls move to accompany their father, and the ladies nod. But, with a swift wave, Darcy is absent, much to Mrs. Bennet's delight. Jane peers at her father, before shifting her focus to Bingley. Later, she's chatting with him, shaking heads and giggling softly. Whilst the young couple are amusing themselves, spectating at the back, Darcy cannot veil his admiration. Darcy turns and observes Mrs. Bennet holding court over soup and pastries, not bothering to veil her curiosity for him. Then, moving on, he observes Kitty and Lydia, walking calmly through the room. On the bright street above, local women are getting sleepy and imitating the singing happening outside. One woman is so relaxed she slips and lands in a haystack. When Jane and Bingley's chat draws to a close, he guides her by the arm to present her to his brothers. Mrs. Bennet gazes on, with a disapproving frown. Jane and Bingley chat again. Bingley wears a bright vest with dark linen trousers. Jane's outfit is a bold emerald blue with ruffled sleeves. She wears short black morning gloves. Bingley, who has subtle features and dark straight hair, is a skilled conversationalist, navigating the topics with ease and charm. Darcy drifts through the street, his face set in merry anticipation. Sir William approaches to dance with him but then changes his mind. Nearby, Lizzie is standing with a rather lively Mary. With a confident stride towards his family, Bingley entices Jane to introduce him to Charlotte Lucas. Another song begins. Standing nearby, Lizzie hears him and relaxes. Bingley heads away. Having seen everything, Lizzie glances at Darcy out the corner of her eye. Then, with a playful grin, she sits down and gazes across the street in front of him."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A fourth cat, Mr. Whiskers, slides over as Alex observes the mountain with an air of curiosity. Outside, the flying is well under way, with laughing birds and squirrels in vibrant hats waving tails and soaring through the sky. A younger cat, Sir Thomas Tail, chirps from the treetops. Wearing their travel cloaks, Sarah and Maria are thoroughly amusing themselves. With rapid hops, they leap to their friends and whirl around before forming a triangle. In a one-line march, beside the forest dancers, the birds and raccoons leap to their respective friends, then in harmony drift through the air, up and down, a burst of sound and whiskers. Announcing the departure of the Whiskers gang, a puzzled chatter descends upon the sky. The departing guests appear distinctly thrilled before Sir Thomas Tail scurries over to wave at them. As creatures take to the air again, Sarah joins Anna and Ruth, who are swinging with Sir Thomas's sister, Georgia. The three owls fly to meet their cousin, and the birds flap. But, with a sharp chirp, Alex is vanished, much to Mrs. Sparrow's delight. Anna glances at her cousin, before focusing her gaze on Whiskers. Later, she's soaring with him, waving wings and chirping loudly. Whilst the young duo are amusing themselves, observing from the nest, Alex cannot hide his envy. Alex turns and observes Mrs. Sparrow gathering seeds over tea and honey, not bothering to hide her pride for him. Then, drifting on, he observes Daisy and Mia, flying high through the sky. In the bright cloud above, wandering birds are getting playful and echoing the flying happening outside. One bird is so eager he dives and splashes in a rain puddle. When Anna and Whiskers' twirl comes to an end, she nudges him by the wing to introduce her to his cousins. Mrs. Sparrow watches on, with an approving chuckle. Anna and Whiskers soar again. Whiskers wears a bright vest with glossy feathers. Anna's coat is a delicate rosy blue with soft tufts. She sports shiny gold talons. Whiskers, who has graceful wings and shiny sleek fur, is a skilled flyer, gliding through the air with flair and poise. Alex soars through the sky, his eyes filled with eager anticipation. Sir Thomas approaches to talk to him but then reconsiders. Nearby, Sarah is perching with a slightly amused Ruth. With an anxious hop at her flock, Whiskers allows Anna to guide him to be introduced to Georgia Tail. Another flight begins. Spinning nearby, Sarah observes him and flutters. Whiskers glides off. Having noticed everything, Sarah peeks at Alex out the corner of her eye. Then, with a playful grin, she leaps and glides across the sky in front of him."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Mr. Hurst joins Darcy, who observes the building indifferently. Inside, a lively dance unfolds, with elegantly dressed guests moving gracefully. Sir William Lucas claps from the sidelines. Lizzie and Lydia enjoy the dance, while an awestruck silence greets the arrival of the Bingley party. Despite their unease, Sir William greets them warmly. Lizzie reunites with Jane and Mary as the dancers continue. Darcy's abrupt departure frustrates Mrs. Bennet, who disapproves of him. Jane dances happily with Bingley, while Darcy watches disdainfully. Spotting Mrs. Bennet's scornful glance, Darcy notices Kitty and Lydia's lively antics. Meanwhile, a merry local man outside falls into a water trough. As Bingley introduces Jane to his sisters, Mrs. Bennet smiles approvingly. Bingley, an adept dancer, and Jane are elegantly attired, sharing another dance. Darcy prowls the hall, avoiding conversation with Sir William. Lizzie, sitting with Mary, becomes aware of Bingley's movements and mischievously crosses the room, catching Darcy's attention."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Then with a mischievous smile she gets up and crosses the room in front of him Having heard everything Lizzie looks at Darcy out the corner of her eye  Bingley heads off  Lizzie hears him and bristles  Sitting nearby  Another dance begins  With a nervous glance at his party Bingley allows Jane to lead him to be introduced to Charlotte Lucas  Nearby Lizzie is sitting with a rather serious Mary  Sir William goes to speak to him but then thinks better of it  Darcy prowls through the hall his face set in grim forbearance  Bingley who has noble features and fair curly hair is an accomplished dancer moving through the steps with ease and grace  She wears long white evening gloves  Jane's dress is a delicate creamy gold with puff sleeves  Bingley wears a dark tailcoat with pale satin breeches  Jane and Bingley dance again  Mrs Bennet looks on with an approving smile  When Jane and Bingley's dance comes to an end he leads her by the hand to present her to his sisters  One man is so enthusiastic he trips and falls in a water trough  On the dark street below local men are getting merry and mimicking the dancing going on inside  Then moving on he spots Kitty and Lydia running wild through the hall  Darcy turns and spots Mrs Bennet holding court over tea and cake not bothering to hide her contempt for him  Whilst the young couple are enjoying themselves watching at the side Darcy cannot hide his disdain  Later she's dancing with him holding hands and smiling warmly  Jane glances at her mother before returning her attention to Bingley  But with a curt bow Darcy is gone much to Mrs Bennet's annoyance  The two girls go to join their mother and the ladies curtsy  As people take to the floor again Lizzie joins Jane and Mary who are standing with Sir William's daughter Charlotte  The new arrivals look distinctly ill at ease before Sir William Lucas hurries over to greet them  Heralding the arrival of the Bingley party an awestruck hush descends upon the room  In a twoline formation before the chamber musicians the ladies and gentlemen set to their respective partners then in unison glide across the floor back and forth a blaze of color and feathers  With dainty steps they set to their partners and dosido before reforming the circle  Dressed in their empireline dresses Lizzie and Lydia are thoroughly enjoying themselves  An older man Sir William Lucas claps from the sidelines  Inside the dancing is well under way with smiling men and women in pastel gowns holding hands and going round in a circle  A third man Mr Hurst comes over as Darcy regards the building with an air of detachment "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Bingley who has noble features and fair curly hair is an accomplished dancer moving through the steps with ease and grace  When Jane and Bingley's dance comes to an end he leads her by the hand to present her to his sisters  Lizzie hears him and bristles  Jane's dress is a delicate creamy gold with puff sleeves  But with a curt bow Darcy is gone much to Mrs Bennet's annoyance  The new arrivals look distinctly ill at ease before Sir William Lucas hurries over to greet them  Bingley heads off  Darcy prowls through the hall his face set in grim forbearance  With dainty steps they set to their partners and dosido before reforming the circle  Then with a mischievous smile she gets up and crosses the room in front of him A third man Mr Hurst comes over as Darcy regards the building with an air of detachment  She wears long white evening gloves  Then moving on he spots Kitty and Lydia running wild through the hall  Jane and Bingley dance again  On the dark street below local men are getting merry and mimicking the dancing going on inside  Sir William goes to speak to him but then thinks better of it  The two girls go to join their mother and the ladies curtsy  Having heard everything Lizzie looks at Darcy out the corner of her eye  An older man Sir William Lucas claps from the sidelines  Sitting nearby  Another dance begins  One man is so enthusiastic he trips and falls in a water trough  Darcy turns and spots Mrs Bennet holding court over tea and cake not bothering to hide her contempt for him  Inside the dancing is well under way with smiling men and women in pastel gowns holding hands and going round in a circle  As people take to the floor again Lizzie joins Jane and Mary who are standing with Sir William's daughter Charlotte  Mrs Bennet looks on with an approving smile  With a nervous glance at his party Bingley allows Jane to lead him to be introduced to Charlotte Lucas  Nearby Lizzie is sitting with a rather serious Mary  Jane glances at her mother before returning her attention to Bingley  Dressed in their empireline dresses Lizzie and Lydia are thoroughly enjoying themselves  Later she's dancing with him holding hands and smiling warmly  In a twoline formation before the chamber musicians the ladies and gentlemen set to their respective partners then in unison glide across the floor back and forth a blaze of color and feathers  Heralding the arrival of the Bingley party an awestruck hush descends upon the room  Bingley wears a dark tailcoat with pale satin breeches  Whilst the young couple are enjoying themselves watching at the side Darcy cannot hide his disdain "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "When Jane and Bingley's dance comes to an end he leads her by the hand to present her to his sisters  Mrs Bennet looks on with an approving smile  Jane and Bingley dance again  Bingley wears a dark tailcoat with pale satin breeches  Jane's dress is a delicate creamy gold with puff sleeves  She wears long white evening gloves  Bingley who has noble features and fair curly hair is an accomplished dancer moving through the steps with ease and grace  Darcy prowls through the hall his face set in grim forbearance  Sir William goes to speak to him but then thinks better of it  Nearby Lizzie is sitting with a rather serious Mary  With a nervous glance at his party Bingley allows Jane to lead him to be introduced to Charlotte Lucas  Another dance begins  Sitting nearby  Lizzie hears him and bristles  Bingley heads off  Having heard everything Lizzie looks at Darcy out the corner of her eye  Then with a mischievous smile she gets up and crosses the room in front of him A third man Mr Hurst comes over as Darcy regards the building with an air of detachment  Inside the dancing is well under way with smiling men and women in pastel gowns holding hands and going round in a circle  An older man Sir William Lucas claps from the sidelines  Dressed in their empireline dresses Lizzie and Lydia are thoroughly enjoying themselves  With dainty steps they set to their partners and dosido before reforming the circle  In a twoline formation before the chamber musicians the ladies and gentlemen set to their respective partners then in unison glide across the floor back and forth a blaze of color and feathers  Heralding the arrival of the Bingley party an awestruck hush descends upon the room  The new arrivals look distinctly ill at ease before Sir William Lucas hurries over to greet them  As people take to the floor again Lizzie joins Jane and Mary who are standing with Sir William's daughter Charlotte  The two girls go to join their mother and the ladies curtsy  But with a curt bow Darcy is gone much to Mrs Bennet's annoyance  Jane glances at her mother before returning her attention to Bingley  Later she's dancing with him holding hands and smiling warmly  Whilst the young couple are enjoying themselves watching at the side Darcy cannot hide his disdain  Darcy turns and spots Mrs Bennet holding court over tea and cake not bothering to hide her contempt for him  Then moving on he spots Kitty and Lydia running wild through the hall  On the dark street below local men are getting merry and mimicking the dancing going on inside  One man is so enthusiastic he trips and falls in a water trough "
        }
      ]
    }
  ]
}