{
  "ground_truth": "Caroline Bingley paces the room, holding an open book in her hands, while Mr. Bingley prods the fire with his foot. Miss Bingley walks over to Darcy, who's engrossed in a book, and flirtatiously leans on his chair in order to read over his shoulder, but he ignores her and turns the page. With malevolent intent in her eyes, she crosses to Lizzie, who looks around her awkwardly, then shuts her book, stands, and sets off, arms linked, around the room with Miss Bingley. Darcy considers this for a moment, and Miss Bingley attempts to break the palpable tension by crossing to the piano as Darcy and Lizzie steadily hold each other's gazes. Jane and Lizzie are in a two-horse carriage as he beams at her, and Bingley steps away from the door, still grinning, raising a hand to bid them farewell. As the carriage leaves, Darcy watches its progress from a window and remains staring out of the window. Now inside the carriage, Jane smiles dreamily. A lady's hand is at work on a delicate piece of floral embroidery. Lizzie is walking through the countryside, with green leaves starting to turn brown, and she watches the progress of geese flying through the sky overhead. At the Bennet's dining table, he gives them a look as an austere-looking woman is also present. The obsequious Mr. Collins pulls up and clumsily climbs down from the carriage, causing Jane to stifle a giggle, and he bows to them reverentially. Now, a lavish dinner takes place, and Lizzie gives her father a look before she giggles. Mr. Collins gives Jane an ingratiating smile. Now the family is outside amusing themselves in the gardens as Mr. Collins is walking with Mrs. Bennet and looks at the girls carefully. Lydia and Kitty are playing a game with hoops, Mary is studying a book, and finally Lizzie is laughing and smiling with Jane. Mr. Collins bustles over to her, and she looks uncertain. Now the sisters are walking over a stone bridge, accompanied by Mr. Collins, who is exhausted from the walk. They make their way into the village, with carriages rolling past and people talking on corners. Lydia and Kitty rush ahead and stop at a shop window as Denny crosses to meet them with his companion. Bingley and Darcy ride by, with Darcy dismounting from his gray horse to join them. Mr. Wickham and Mr. Darcy spot each other, and a look passes between them before Mr. Wickham lifts his hat to him. Lizzie watches the exchange with interest and studies Darcy as he rides away sitting stiff and proper in the saddle. Lizzie and Kitty race in followed by Mary, and he backs away from them and takes a seat at a card table. Lizzie looks grateful for his departure as Mary starts playing the piano. At the whist table, Mr. Collins lays down a card, much to Mrs. Phillips's disgust.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Caroline Bingley strides the chamber, clutching an exposed volume in her hands, while Mr. Bingley pokes the blaze with his foot. Miss Bingley strolls over to Darcy, who's absorbed in a book, and coquettishly leans on his seat in order to read over his shoulder, but he disregards her and flips the page. With malevolent intent in her eyes, she moves to Lizzie, who glances around her awkwardly, then closes her book, rises, and sets off, arms linked, around the room with Miss Bingley. Darcy ponders this for a moment, and Miss Bingley endeavors to break the palpable strain by moving to the piano as Darcy and Lizzie steadily hold each other's gazes. Jane and Lizzie are in a two-horse vehicle as he beams at her, and Bingley steps away from the door, still grinning, raising a hand to bid them farewell. As the carriage departs, Darcy watches its progress from a window and remains staring out of the pane. Now inside the carriage, Jane smiles dreamily. A lady's hand is at work on a delicate piece of floral needlework. Lizzie is strolling through the countryside, with green leaves starting to turn brown, and she observes the progress of geese flying through the sky overhead. At the Bennet's dining table, he gives them a look as a severe-looking woman is also present. The servile Mr. Collins pulls up and clumsily climbs down from the carriage, causing Jane to stifle a giggle, and he bows to them reverentially. Now, a lavish banquet takes place, and Lizzie gives her father a look before she giggles. Mr. Collins gives Jane an ingratiating smile. Now the family is outside amusing themselves in the gardens as Mr. Collins is walking with Mrs. Bennet and looks at the girls carefully. Lydia and Kitty are playing a game with hoops, Mary is perusing a book, and finally, Lizzie is laughing and smiling with Jane. Mr. Collins bustles over to her, and she looks uncertain. Now the sisters are walking over a stone arch, accompanied by Mr. Collins, who is exhausted from the walk. They make their way into the village, with carriages rolling past and people talking on corners. Lydia and Kitty rush ahead and stop at a shop window as Denny crosses to meet them with his companion. Bingley and Darcy ride by, with Darcy dismounting from his gray steed to join them. Mr. Wickham and Mr. Darcy spot each other, and a look passes between them before Mr. Wickham lifts his hat to him. Lizzie watches the interchange with interest and studies Darcy as he rides away sitting stiff and proper in the saddle. Lizzie and Kitty race in followed by Mary, and he backs away from them and takes a seat at a card table. Lizzie looks grateful for his departure as Mary starts playing the piano. At the whist table, Mr. Collins lays down a card, much to Mrs. Phillips's disgust."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The room is paced by Caroline Bingley, with an open book held in her hands, while the fire is prodded with Mr. Bingley's foot. Darcy is walked over to by Miss Bingley, who's engrossed in a book, and his chair is flirtatiously leaned on by her in order to read over his shoulder, but she is ignored by him, and the page is turned. With malevolent intent in her eyes, Lizzie is crossed to by her, who awkwardly looks around her, then her book is shut, and she stands, linking arms and setting off around the room with Miss Bingley. This is considered for a moment by Darcy, and the palpable tension is attempted to be broken by Miss Bingley, who crosses to the piano as each other's gazes are steadily held by Darcy and Lizzie. In a two-horse carriage, Jane and Lizzie beam at him, and the door is stepped away from by Bingley, still grinning, and a hand is raised by him to bid them farewell. As the carriage leaves, its progress is watched by Darcy from a window, and he remains staring out of it. Now, inside the carriage, Jane smiles dreamily. A lady works on a delicate piece of floral embroidery. The countryside is walked through by Lizzie, with green leaves starting to turn brown, and the progress of geese flying through the sky overhead is watched by her. At the Bennet’s dining table, a look is given by him as an austere-looking woman is also present. Mr. Collins pulls up the carriage and clumsily climbs down from it, causing Jane to stifle a giggle, and they are bowed to reverentially by him. Now, a lavish dinner is taking place, and a look is given by Lizzie to her father before a giggle is let out by her. An ingratiating smile is given by Mr. Collins to Jane. Now the family amuses themselves outside in the gardens as Mrs. Bennet walks with Mr. Collins, who looks carefully at the girls. A game with hoops is played by Lydia and Kitty, Mary studies a book, and finally, laughter and smiles are shared by Lizzie with Jane. Mr. Collins bustles over to her, and uncertainty is felt by her. Now the sisters are walked over a stone bridge by Mr. Collins, who accompanies them exhausted from the walk. Their way is made into the village by them, with carriages rolling past and conversations happening on corners. Lydia and Kitty rush ahead and stop at a shop window as Denny meets them with his companion crossing over. By ride Bingley and Darcy, with Darcy dismounting from his gray horse to join them. Mr. Wickham and Mr. Darcy spot each other, and a look is shared between them before the hat is lifted by Mr. Wickham to him. The exchange is watched with interest by Lizzie and Darcy is studied by her as he rides away, sitting stiff and proper in the saddle. Lizzie and Kitty race in, followed by Mary, and they are backed away from by him as a seat is taken by him at a card table. Gratitude is felt by Lizzie for his departure as Mary starts playing the piano. At the whist table, a card is laid down by Mr. Collins, much to Mrs. Phillips's disgust."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Caroline Bingley paces with an open book, while Mr. Bingley prods the fire. Miss Bingley approaches Darcy, reading over his shoulder flirtatiously, but he ignores her and continues reading. With intent, she moves to Lizzie, who shuts her book and walks with Miss Bingley. Darcy ponders, and Miss Bingley attempts to relieve tension by playing the piano, as Darcy and Lizzie maintain eye contact. Jane and Lizzie, in a two-horse carriage, are seen off by a grinning Bingley. Darcy watches the carriage leave from a window. Inside, Jane smiles dreamily as a hand works on floral embroidery. Lizzie walks through countryside, observing geese overhead. At the Bennet table, an austere woman is present as Mr. Collins clumsily arrives, making Jane giggle. During a lavish dinner, Lizzie and her father exchange looks while she giggles. Mr. Collins smiles at Jane. Outside, the family amuses themselves in the gardens, with Mr. Collins observing. Lydia and Kitty play hoops, Mary reads, and Lizzie laughs with Jane. Mr. Collins approaches Lizzie, who looks uncertain. The sisters, with Mr. Collins, cross a stone bridge, entering the village with bustling scenes. Lydia and Kitty stop at a shop as Denny approaches with a companion. Bingley and Darcy ride by, with Darcy dismounting to join them. Wickham and Darcy exchange glances before Wickham tips his hat. Lizzie watches Darcy ride away. Lizzie and Kitty race inside with Mary, while Darcy departs to the card table. Lizzie is relieved as Mary begins playing the piano. At the whist table, Mr. Collins plays a card, annoying Mrs. Phillips."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Caroline Bingley paces with a book while Mr. Bingley adjusts the fire. She leans flirtatiously over Darcy's shoulder, but he ignores her. She then links arms with Lizzie to walk around the room, trying to ease tension as Darcy and Lizzie exchange glances. In a carriage, Jane beams, and Bingley waves farewell. Darcy watches from a window as Jane smiles. A woman embroiders as Lizzie walks through browning countryside, observing geese. At dinner, Mr. Collins arrives clumsily, amusing Jane. Lizzie shares a look and giggle with her father. Mr. Collins smiles ingratiatingly at Jane. Outside, the family enjoys the garden. Mr. Collins joins them, uncertain around Lizzie. The sisters cross a bridge with an exhausted Mr. Collins. In the village, Lydia and Kitty meet Denny as Bingley and Darcy pass. Darcy and Wickham exchange glances. Lizzie observes Darcy's proper departure. Lizzie and Kitty arrive followed by Mary, who starts playing the piano while Mr. Collins displeases Mrs. Phillips at the card table."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Caroline Bingley, feeling restless and unable to sit still, paces back and forth across the room in a somewhat agitated manner, all the while holding an open book in her hands as if reading, though her mind seems elsewhere. Meanwhile, Mr. Bingley, with a mixture of boredom and curiosity, idly prods at the crackling fire with his foot, sending a few embers flying. Miss Bingley, with deliberate intent, saunters over to where Mr. Darcy is deeply engrossed in reading his book. In a coquettish manner, she leans over his chair, attempting to catch his attention and read over his shoulder; however, he remains completely uninterested, ignoring her completely, and simply turns the page to continue with his reading. With a gleam of malevolent intent in her eyes, she redirects her attention to Lizzie, who is looking around awkwardly, trying to find a way to escape the uncomfortable situation. Lizzie then shuts her book with a soft thud, stands up decisively, and links arms with Miss Bingley. Together, they begin to walk around the room. Darcy watches them thoughtfully, and Miss Bingley, sensing the tension in the air, tries to alleviate it by moving to the piano. Meanwhile, Darcy and Lizzie maintain a steady gaze at each other without wavering. In a different scene, Jane and Lizzie are seated in a two-horse carriage. Jane is beaming happily at them as Mr. Bingley steps back from the door with an enormous grin on his face, raising his hand in a cheerful wave to bid them farewell. As the carriage begins to roll away, Darcy stays behind at the window, watching its progress with a thoughtful expression. Inside the carriage, Jane is lost in her own world, smiling dreamily. Elsewhere, a delicate lady's hand is diligently working on an intricate piece of floral embroidery. Lizzie, now outdoors, is walking through the picturesque countryside where the vibrant green leaves are just starting to turn brown with the onset of the season. She pauses for a moment to watch the graceful V-formation of geese flying overhead. At the Bennet's dining table, there is a moment of pause as he gives them a particular look, with an austere-looking woman also present at the table. The obsequious Mr. Collins arrives with his usual fanfare, awkwardly pulling up and clumsily climbing down from his carriage, causing Jane to stifle a giggle of amusement. He bows reverentially to them, emphasizing his respect. Following this, a lavish and sumptuous dinner takes place. During this, Lizzie shares a knowing look with her father, prompting a quiet giggle. Mr. Collins directs an ingratiating smile towards Jane, trying to win her favor. Later, the family is seen outside enjoying themselves amidst the beauty of the gardens. Mr. Collins is taking a leisurely stroll with Mrs. Bennet, casting careful and observant glances at the girls. Lydia and Kitty are energetically engaged in a game with hoops, while Mary is absorbed in studying a book. Finally, Lizzie is laughing and smiling, sharing a moment of joy with Jane. Mr. Collins, bustling over to Lizzie, causes her to have a moment of uncertainty. Subsequently, the sisters are seen walking over an old stone bridge, with Mr. Collins trailing behind them, visibly exhausted from the hike. They make their way into the bustling village, where carriages are rolling past, and people are engaged in animated conversations at street corners. Lydia and Kitty excitedly rush ahead of the group, stopping at an enticing shop window, just as Denny approaches to meet them alongside his companion. Bingley and Darcy ride into the scene, with Darcy dismounting gracefully from his elegant gray horse to join the group. Mr. Wickham and Mr. Darcy notice each other from a distance, and a significant look passes between them before Mr. Wickham respectfully lifts his hat in acknowledgment. Lizzie observes this exchange with keen interest, her eyes studying Darcy as he rides away, sitting stiff and proper in the saddle. Lizzie and Kitty then race into the scene, followed closely by Mary. He backs away from their youthful energy and takes refuge at a nearby card table. Lizzie appears grateful for his departure, as Mary begins to play the piano with dedication. At the whist table, Mr. Collins lays down a card with enthusiasm, much to the expressed disgust of Mrs. Phillips, who finds his play disagreeable."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Caroline Bingley, unable to quell her restlessness and finding it impossible to remain seated, paces repeatedly across the expanse of the room in a somewhat agitated and unsettled manner. In her hands, she clutches an open book, flipping through its pages as if she were deeply engrossed in reading, though it is abundantly clear her thoughts are wandering elsewhere. Meanwhile, Mr. Bingley, caught in a state that straddles both boredom and curiosity, finds himself idly poking and prodding at the crackling fire with his foot, causing a few glowing embers to scatter and dance into the air. With deliberate and purposeful intent, Miss Bingley saunters over to Mr. Darcy, who is deeply absorbed in the pages of his own book. In a coquettish and flirtatious manner, she leans over the back of his chair, making a concerted effort to capture his attention and sneakily read over his shoulder; however, he remains entirely uninterested, displaying no inclination towards her, and simply turns the page without a hint of distraction, continuing with his reading uninterrupted. With a gleam of malevolent intent reflected in her eyes, she shifts her gaze to Lizzie, who appears somewhat awkward and uneasy, scanning her surroundings as she looks for a way to extricate herself from the uncomfortable situation. Lizzie promptly closes her book with a soft yet decisive thud, rises to her feet with purpose, and links arms with Miss Bingley. Together, they begin to walk leisurely around the room. Darcy, observing thoughtfully, keeps his gaze on them, while Miss Bingley, sensing the palpable tension lingering in the air, attempts to alleviate it by moving gracefully over to the piano. Simultaneously, Darcy and Lizzie maintain steady eye contact with one another, neither of them wavering. In an entirely different scene, Jane and Lizzie find themselves seated in a two-horse carriage. Jane's face is illuminated with a radiant, beaming smile as she looks at them, while Mr. Bingley steps back from the carriage door with an enormous grin adorning his face, raising his hand in a cheerful, animated wave to bid them a fond farewell. As the carriage begins to roll away, traveling down the path, Darcy remains behind at the window, watching its progress with a contemplative, thoughtful expression etched onto his features. Inside the carriage, Jane is immersed in her own joyful thoughts, an expression of dreamy happiness gracing her face. Elsewhere, a delicate lady's hand is meticulously working on an intricate piece of floral embroidery with a keen eye for detail. Now outdoors, Lizzie is making her way through the picturesque countryside, where the once vibrant green leaves are just beginning to transition into a warm shade of brown with the arrival of the new season. She pauses momentarily, her gaze drawn upwards to observe the graceful formation of geese flying overhead in a perfect V-formation. At the Bennet family's dining table, a noticeable moment of pause occurs as he directs a particular look at them, with an austere and severe-looking woman also present at the table. The ever-obsequious Mr. Collins inevitably arrives with his typical fanfare, awkwardly pulling up and clumsily descending from his carriage, evoking a stifled giggle of amusement from Jane. He bows deeply and reverentially to them, emphasizing his respect with sincerity. Following this, an opulent and sumptuous dinner takes place. During the course of this meal, Lizzie catches her father's eye, and they share a knowing look, prompting a quiet, shared giggle. Mr. Collins, with an ingratiating smile plastered on his face, directs it toward Jane, clearly attempting to win her favor. Later on, the entire family is seen outdoors, reveling in the enjoyment of the garden's beauty. Mr. Collins is taking a leisurely stroll alongside Mrs. Bennet, casting careful and observant glances at the girls. Meanwhile, Lydia and Kitty are energetically engaged in an enthusiastic game with hoops, while Mary remains absorbed in studying a book with determination. Finally, Lizzie is seen laughing and smiling, sharing an affectionate moment of joy with Jane. Mr. Collins, bustling over to Lizzie, causes her a brief moment of uncertainty. Subsequently, the sisters are depicted walking across an old stone bridge, with Mr. Collins trailing behind them, visibly fatigued from the exertion of the hike. They proceed to make their way into the bustling and lively village, where carriages are rolling past, and people are animatedly engaged in spirited conversations at various street corners. With excitement, Lydia and Kitty race ahead of the group, coming to a stop at a shop window that has caught their fancy, just as Denny approaches to join them with a companion by his side. Bingley and Darcy ride into the scene, Darcy dismounting gracefully from his elegant, poised gray horse to join their gathering. From a distance, Mr. Wickham and Mr. Darcy notice each other, and a significant shared look passes between them before Mr. Wickham respectfully lifts his hat in acknowledgment. Lizzie observes this exchange with keen, discerning interest, her eyes studying Darcy as he rides away, sitting rigid and proper in the saddle. Subsequently, Lizzie and Kitty race into the scene, closely followed by Mary. His departure from their lively energy is appreciated as he takes refuge at a nearby card table. Lizzie appears grateful for his retreat, as Mary begins to play the piano with dedication and focus. At the nearby whist table, Mr. Collins lays down a card with animated enthusiasm, much to the expressed disgust of Mrs. Phillips, who finds his manner of play disagreeable."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Caroline Bingley, with a determined stride, moves back and forth across the room, her fingers gently gripping the open book she is reading, pausing occasionally to glance at its pages, while Mr. Bingley gently nudges the fire's embers with his foot, attempting to stoke the flames. Miss Bingley approaches Darcy quietly, who is deeply engrossed in his book, and as she reaches his side, she leans over flirtatiously against his chair, letting her gaze drift over his shoulder to catch a glimpse of the words he reads, only to find that he is deliberately ignoring her, methodically turning the page without acknowledging her presence. With a subtle shift in her demeanor, a hint of malice flickers in her eyes as she moves over to Lizzie, who is seated nearby, exuding awkwardness as she glances around the room. Lizzie promptly closes her book, rises gracefully to her feet, and, linking arms with Miss Bingley, begins to walk around the room with her. Darcy takes a moment to observe this interaction thoughtfully, while Miss Bingley tries to dispel the overwhelming tension in the room by making her way to the piano, yet Darcy and Lizzie remain locked in a steady and intense eye contact. Meanwhile, Jane and Lizzie find themselves comfortably seated in a two-horse carriage, as Bingley stands at the door filled with joy, his face beaming with happiness, and he raises his hand in a cheerful wave to bid them farewell. As the carriage sets into motion and begins to leave, Darcy watches its movement intently from the window, keeping his gaze fixed on it as it disappears from sight, remaining at the window with a contemplative stare. Inside the carriage, Jane is enveloped in a dreamy smile. A woman's hand, poised and graceful, is diligently crafting a delicate piece of floral embroidery. During a leisurely walk through the countryside, Lizzie absorbs the beauty around her, noticing that the green leaves are just beginning to turn brown, and she gazes skyward to follow the path of geese flying overhead, their formation steady and purposeful. Seated around the Bennet's dining table, he casts a meaningful look toward an austere woman sitting among them, whose presence is markedly notable. Mr. Collins, ever obsequious, arrives in a carriage, managing to climb down with a degree of awkwardness that causes Jane to suppress a giggle, and he bows reverentially to those present. Now, as the scene shifts to a lavish dinner, Lizzie catches her father's eye and cannot help but laugh quietly. Mr. Collins offers Jane an ingratiating smile, trying to curry favor. Outside in the garden, the family enjoys a pleasant day, Mr. Collins eagerly walking alongside Mrs. Bennet while casting careful glances at the girls. Lydia and Kitty engage in a playful game with hoops, Mary is absorbed in a book, and Lizzie shares a moment of laughter and camaraderie with Jane. Mr. Collins hurriedly approaches Lizzie, who reacts with uncertainty. The sisters proceed to walk across a stone bridge, accompanied by a visibly fatigued Mr. Collins, and they make their way toward the village, taking in the bustling atmosphere with carriages rolling past and people engaging in lively discussions on street corners. Lydia and Kitty rush eagerly ahead, pausing to admire a shop window as Denny approaches to greet them alongside his companion. Bingley and Darcy ride by on horseback, with Darcy dismounting from his gray horse to join the group. As Mr. Wickham and Mr. Darcy catch sight of each other, an unspoken exchange passes between them, with Mr. Wickham lifting his hat in acknowledgment. Lizzie observes this interaction with keen interest, her eyes following Darcy as he rides away, his posture rigid and dignified in the saddle. Lizzie and Kitty burst into a room, followed closely by Mary, prompting him to retreat from their exuberance and settle at a card table. Lizzie appears relieved by his departure as Mary begins to play the piano. At the whist table, Mr. Collins places a card on the table, eliciting a disapproving reaction from Mrs. Phillips."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Caroline Bingley paces the room with an open book, while Mr. Bingley tends to the fire. Miss Bingley attempts to engage Darcy by leaning over his shoulder to read, but he remains engrossed in his book, ignoring her. She then shifts her attention to Lizzie, who awkwardly responds by closing her book and linking arms with Miss Bingley for a walk around the room, prompting a thoughtful gaze from Darcy that leads to a tense moment. Miss Bingley, trying to alleviate the tension, moves to the piano while Darcy and Lizzie hold each other's gaze. In the carriage, Jane shares a sweet moment with Bingley, who waves her farewell with a smile, while Darcy watches the departing carriage from the window. Inside, Jane appears dreamy, as a lady works on floral embroidery. Lizzie strolls through the countryside, observing the changing leaves and geese overhead. At the Bennet dining table, an austere-looking woman shares the space with them. Mr. Collins disembarks clumsily from a carriage, earning a giggle from Jane before he bows reverently. During a lavish dinner, Lizzie gives her father a knowing look, and Mr. Collins exchanges ingratiating smiles with Jane. Outside, the family enjoys the garden as Mr. Collins closely observes the girls while walking with Mrs. Bennet. Lydia and Kitty play with hoops, Mary studies a book, and Lizzie shares laughter with Jane. Mr. Collins approaches Lizzie, who looks unsure. The sisters, with a weary Mr. Collins, walk over a stone bridge into the village, passing bustling carriages and townsfolk. Lydia and Kitty excitedly stop at a shop window where Denny meets them, accompanied by a companion. Bingley and Darcy arrive on horseback, with Darcy dismounting to join the group. A brief, tense exchange occurs between Mr. Wickham and Darcy as they acknowledge one another, observed with interest by Lizzie. Darcy rides away, stiff and proper, as Lizzie takes note. Lizzie and Kitty dash in, followed by Mary, and Mr. Collins retreats to a card table, leaving Lizzie relieved. Mary begins playing the piano, and Mr. Collins plays a card at the whist table, annoying Mrs. Phillips."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Caroline Bingley paces the room, holding an open book in her hands, while Mr. Bingley prods the fire with his foot, a common practice in the early 19th-century English countryside homes to keep the room warm. Miss Bingley walks over to Darcy, who's engrossed in a book, a frequent pastime among the upper class of the Regency era, and flirtatiously leans on his chair in order to read over his shoulder, but he ignores her and turns the page. With malevolent intent in her eyes, she crosses to Lizzie, who looks around her awkwardly, aware of the social tensions in the room, then shuts her book, stands, and sets off, arms linked, around the room with Miss Bingley. Darcy considers this for a moment, reflecting the societal expectations of courtship, and Miss Bingley attempts to break the palpable tension by crossing to the piano, a centerpiece in many affluent homes used for entertainment, as Darcy and Lizzie steadily hold each other's gazes. Jane and Lizzie are in a two-horse carriage, an essential mode of transportation during this period, as he beams at her, and Bingley steps away from the door, still grinning, raising a hand to bid them farewell. As the carriage leaves, Darcy watches its progress from a window and remains staring out of the window, lost in thought about the day's events. Now inside the carriage, Jane smiles dreamily, envisioning her future happiness. A lady's hand is at work on a delicate piece of floral embroidery, a common pastime for women of her status. Lizzie is walking through the countryside, with green leaves starting to turn brown, signaling the arrival of autumn, and she watches the progress of geese flying through the sky overhead, a sign of seasonal migration. At the Bennet's dining table, he gives them a look as an austere-looking woman, Lady Catherine de Bourgh’s acquaintance, is also present. The obsequious Mr. Collins pulls up and clumsily climbs down from the carriage, causing Jane to stifle a giggle, and he bows to them reverentially, eager to please his esteemed patrons. Now, a lavish dinner takes place, typical of the Bennet family's efforts to impress their guests, and Lizzie gives her father a look before she giggles. Mr. Collins gives Jane an ingratiating smile, seeking her favor. Now the family is outside amusing themselves in the gardens, reflective of the leisurely pursuits of the gentry, as Mr. Collins is walking with Mrs. Bennet and looks at the girls carefully, assessing potential marital prospects. Lydia and Kitty are playing a game with hoops, a popular pastime for children, Mary is studying a book, perhaps on moral virtues, and finally Lizzie is laughing and smiling with Jane. Mr. Collins bustles over to her, and she looks uncertain, aware of his attentions. Now the sisters are walking over a stone bridge, the type often found in quaint English villages, accompanied by Mr. Collins, who is exhausted from the walk, not accustomed to such exertion. They make their way into the village, with carriages rolling past and people talking on corners, illustrating the bustling social life. Lydia and Kitty rush ahead and stop at a shop window, filled with items from the latest London fashion, as Denny crosses to meet them with his companion. Bingley and Darcy ride by, with Darcy dismounting from his gray horse, a sign of wealth and status, to join them. Mr. Wickham and Mr. Darcy spot each other, and a look passes between them, hinting at their complicated past, before Mr. Wickham lifts his hat to him in acknowledgment. Lizzie watches the exchange with interest and studies Darcy as he rides away, sitting stiff and proper in the saddle, maintaining his refined image. Lizzie and Kitty race in followed by Mary, whose pianoforte performances are often critiqued, and he backs away from them and takes a seat at a card table, preferring the quieter pursuit. Lizzie looks grateful for his departure as Mary starts playing the piano, filling the room with strained music. At the whist table, a popular card game in the era, Mr. Collins lays down a card, much to Mrs. Phillips's disgust, as his choices tend to disrupt the strategy."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Caroline Bingley paces the room holding an open book in her hands while Mr Bingley prods the fire with his foot. Miss Bingley walks over to Darcy who is engrossed in a book and flirtatiously leans on his chair in order to read over his shoulder but he ignores her and turns the page. With malevolent intent in her eyes. she crosses to Lizzie who looks around her awkwardly then shuts her book stands and sets off arms linked around the room with Miss Bingley. Darcy considers this for a moment and Miss Bingley attempts to break the palpable tension by crossing to the piano as Darcy and Lizzie steadily hold each other's gazes. Jane and Lizzie are in a twohorse carriage as he beams at her and Bingley steps away from the door still grinning raising a hand to bid them farewell. As the carriage leaves Darcy watches its progress from a window and remains staring out of the window. Now inside the carriage Jane smiles dreamily. A lady's hand is at work on a delicate piece of floral embroidery. Lizzie is walking through the countryside with green leaves starting to turn brown and she watches the progress of geese flying through the sky overhead. At the Bennet's dining table he gives them a look as an austerelooking woman is also present. The obsequious Mr Collins pulls up and clumsily climbs down from the carriage causing Jane to stifle a giggle and he bows to them reverentially. Now a lavish dinner takes place and Lizzie gives her father a look before she giggles. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Mr Collins gives Jane an ingratiating smile. Now the family is outside amusing themselves in the gardens as Mr Collins is walking with Mrs Bennet and looks at the girls carefully. Lydia and Kitty are playing a game with hoops. Mary is studying a book and finally Lizzie is laughing and smiling with Jane. Mr Collins bustles over to her and she looks uncertain. Now the sisters are walking over a stone bridge accompanied by Mr Collins who is exhausted from the walk. They make their way into the village with carriages rolling past and people talking on corners. Lydia and Kitty rush ahead and stop at a shop window as Denny crosses to meet them with his companion. Bingley and Darcy ride by with Darcy dismounting from his gray horse to join them. Mr Wickham and Mr Darcy spot each other and a look passes between them before Mr Wickham lifts his hat to him. Lizzie watches the exchange with interest and studies Darcy as he rides away sitting stiff and proper in the saddle. Lizzie and Kitty race in followed by Mary and he backs away from them and takes a seat at a card table. Lizzie looks grateful for his departure as Mary starts playing the piano. At the whist table Mr Collins lays down a card much to Mrs Phillips's disgust."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Caroline Bingley paces the room holding an open book in her hands while Mr Bingley prods the fire with his foot. Miss Bingley walks over to Darcy who is engrossed in a book and flirtatiously leans on his chair in order to read over his shoulder but he ignores her and turns the page. With malevolent intent in her eyes. she crosses to Lizzie who looks around her awkwardly then shuts her book stands and sets off arms linked around the room with Miss Bingley. Darcy considers this for a moment and Miss Bingley attempts to break the palpable tension by crossing to the piano as Darcy and Lizzie steadily hold each other's gazes. Jane and Lizzie are in a twohorse carriage as he beams at her and Bingley steps away from the door still grinning raising a hand to bid them farewell. As the carriage leaves Darcy watches its progress from a window and remains staring out of the window. Now inside the carriage Jane smiles dreamily. A lady's hand is at work on a delicate piece of floral embroidery. Lizzie is walking through the countryside with green leaves starting to turn brown and she watches the progress of geese flying through the sky overhead. At the Bennet's dining table he gives them a look as an austerelooking woman is also present. The obsequious Mr Collins pulls up and clumsily climbs down from the carriage causing Jane to stifle a giggle and he bows to them reverentially. Now a lavish dinner takes place and Lizzie gives her father a look before she giggles. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Mr Collins gives Jane an ingratiating smile. Now the family is outside amusing themselves in the gardens as Mr Collins is walking with Mrs Bennet and looks at the girls carefully. Lydia and Kitty are playing a game with hoops. Mary is studying a book and finally Lizzie is laughing and smiling with Jane. Mr Collins bustles over to her and she looks uncertain. Now the sisters are walking over a stone bridge accompanied by Mr Collins who is exhausted from the walk. They make their way into the village with carriages rolling past and people talking on corners. Lydia and Kitty rush ahead and stop at a shop window as Denny crosses to meet them with his companion. Bingley and Darcy ride by with Darcy dismounting from his gray horse to join them. Mr Wickham and Mr Darcy spot each other and a look passes between them before Mr Wickham lifts his hat to him. Lizzie watches the exchange with interest and studies Darcy as he rides away sitting stiff and proper in the saddle. Lizzie and Kitty race in followed by Mary and he backs away from them and takes a seat at a card table. Lizzie looks grateful for his departure as Mary starts playing the piano. At the whist table Mr Collins lays down a card much to Mrs Phillips's disgust."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Caroline Bingley paces the room holding an open book in her hands while Mr Bingley prods the fire with his foot. Miss Bingley walks over to Darcy who is engrossed in a book and flirtatiously leans on his chair in order to read over his shoulder but he ignores her and turns the page. With malevolent intent in her eyes. she crosses to Lizzie who looks around her awkwardly then shuts her book stands and sets off arms linked around the room with Miss Bingley. Darcy considers this for a moment and Miss Bingley attempts to break the palpable tension by crossing to the piano as Darcy and Lizzie steadily hold each other's gazes. Jane and Lizzie are in a twohorse carriage as he beams at her and Bingley steps away from the door still grinning raising a hand to bid them farewell. As the carriage leaves Darcy watches its progress from a window and remains staring out of the window. Lydia and Kitty rush ahead and stop at a shop window as Denny crosses to meet them with his companion. Bingley and Darcy ride by with Darcy dismounting from his gray horse to join them. Mr Wickham and Mr Darcy spot each other and a look passes between them before Mr Wickham lifts his hat to him. Lizzie watches the exchange with interest and studies Darcy as he rides away sitting stiff and proper in the saddle. Lizzie and Kitty race in followed by Mary and he backs away from them and takes a seat at a card table. Lizzie looks grateful for his departure as Mary starts playing the piano. At the whist table Mr Collins lays down a card much to Mrs Phillips's disgust."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Caroline Bingley paces the room holding an open book in her hands while Mr Bingley prods the fire with his foot. Miss Bingley walks over to Darcy who is engrossed in a book and flirtatiously leans on his chair in order to read over his shoulder but he ignores her and turns the page. With malevolent intent in her eyes. Lizzie and Kitty race in followed by Mary and he backs away from them and takes a seat at a card table. Lizzie looks grateful for his departure as Mary starts playing the piano. At the whist table Mr Collins lays down a card much to Mrs Phillips's disgust."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Gordon Larkin drifts through the forest, clutching a rusty lantern in his claws, while Mrs. Larkin nudges the snow with her tail. Miss Larkin stomps over to Barclay, who's entranced by a map, and awkwardly rests against his ladder in an attempt to peek over his shoulder, but he dismisses her and flips the map. With mischievous glint in her nose, she scuttles to Penny, who twirls around her clumsily, then slams her map, crouches, and skips off, tails entwined, around the forest with Miss Larkin. Barclay contemplates this for a spell, and Miss Larkin endeavors to dissolve the obvious discomfort by advancing to the harp as Barclay and Penny bravely lock each other's noses. Oscar and Penny are in a two-donkey wagon as she laughs at him, and Larkin retreats from the hatch, still chuckling, waving a feather to salute them goodbye. As the wagon departs, Barclay observes its journey from a ledge and lingers gazing out of the ledge. Now inside the wagon, Oscar grins blissfully. An otter's snout is creating an intricate mosaic of snowy branches. Penny is wandering through the tundra, with icy branches beginning to thaw, and she observes the journey of otters swimming through the river beneath. At the Harper's breakfast nook, she grants them a scowl as an aloof-looking otter is also there. The servile Mr. Barkley jets up and clumsily slides down from the wagon, causing Oscar to stifle a chuckle, and he nods to them respectfully. Now, a grand brunch unfolds, and Penny grants her uncle a grimace before she chuckles. Mr. Barkley grants Jane an obsequious grimace. Now the troop is inside entertaining themselves in the lodge as Mr. Barkley is trudging with Mrs. Harper and observes the lads judiciously. Lucas and Charlie are enjoying a match with feathers, Mia is examining a scroll, and lastly Penny is chuckling and basking with Oscar. Mr. Barkley scurries over to her, and she feels perplexed. Now the lads are meandering over a wooden arch, accompanied by Mr. Barkley, who is winded from the stroll. They wind their way into the hamlet, with wagons rattling by and creatures chatting on porches. Lucas and Charlie dash ahead and pause at a stall doorway as Rupert ambles to greet them with his cohort. Larkin and Barclay trot by, with Barclay dismounting from his brown donkey to accompany them. Mr. Reed and Mr. Barclay recognize each other, and a nod passes between them before Mr. Reed raises his paw to him. Penny observes the interaction with curiosity and scrutinizes Barclay as he trots away perched rigid and dignified in the seat. Penny and Charlie sprint in followed by Mia, and he retreats from them and collapses onto a hay bale. Penny feels relieved for his absence as Mia begins strumming the guitar. At the chess board, Mr. Barkley replaces a piece, much to Mrs. Foster's disappointment."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Caroline Bingley paces with a book while Mr. Bingley tends the fire. Caroline flirts with Darcy, who ignores her. She then engages Lizzie, and they walk together, with tension lingering between Lizzie and Darcy. Outside, Jane and Lizzie leave by carriage, with Darcy watching. Jane is happy, and Lizzie later reflects while walking. At the Bennet's dining table, Mr. Collins arrives awkwardly, amusing Jane. The family enjoys time outdoors, with Mr. Collins observing the girls. Lizzie shares a laugh with Jane but looks uncertain when approached by Mr. Collins. The sisters, with him in tow, enter the village bustling with life. Lydia and Kitty stop by a shop as Denny greets them. Bingley and Darcy arrive, and Darcy exchanges a tense glance with Mr. Wickham, which Lizzie notices. Finally, Lizzie appears relieved as Mary plays piano and Mr. Collins plays cards at a gathering."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "At the whist table Mr Collins lays down a card much to Mrs Phillips's disgust Lizzie looks grateful for his departure as Mary starts playing the piano Lizzie and Kitty race in followed by Mary and he backs away from them and takes a seat at a card table Lizzie watches the exchange with interest and studies Darcy as he rides away sitting stiff and proper in the saddle Mr Wickham and Mr Darcy spot each other and a look passes between them before Mr Wickham lifts his hat to him Bingley and Darcy ride by with Darcy dismounting from his gray horse to join them Lydia and Kitty rush ahead and stop at a shop window as Denny crosses to meet them with his companion They make their way into the village with carriages rolling past and people talking on corners Now the sisters are walking over a stone bridge accompanied by Mr Collins who is exhausted from the walk Mr Collins bustles over to her and she looks uncertain Mary is studying a book and finally Lizzie is laughing and smiling with Jane Lydia and Kitty are playing a game with hoops Now the family is outside amusing themselves in the gardens as Mr Collins is walking with Mrs Bennet and looks at the girls carefully Mr Collins gives Jane an ingratiating smile Now a lavish dinner takes place and Lizzie gives her father a look before she giggles The obsequious Mr Collins pulls up and clumsily climbs down from the carriage causing Jane to stifle a giggle and he bows to them reverentially At the Bennet's dining table he gives them a look as an austerelooking woman is also present Lizzie is walking through the countryside with green leaves starting to turn brown and she watches the progress of geese flying through the sky overhead A lady's hand is at work on a delicate piece of floral embroidery Now inside the carriage Jane smiles dreamily As the carriage leaves Darcy watches its progress from a window and remains staring out of the window Jane and Lizzie are in a twohorse carriage as he beams at her and Bingley steps away from the door still grinning raising a hand to bid them farewell Darcy considers this for a moment and Miss Bingley attempts to break the palpable tension by crossing to the piano as Darcy and Lizzie steadily hold each other's gazes she crosses to Lizzie who looks around her awkwardly then shuts her book stands and sets off arms linked around the room with Miss Bingley With malevolent intent in her eyes Miss Bingley walks over to Darcy who is engrossed in a book and flirtatiously leans on his chair in order to read over his shoulder but he ignores her and turns the page Caroline Bingley paces the room holding an open book in her hands while Mr Bingley prods the fire with his foot"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Miss Bingley walks over to Darcy who is engrossed in a book and flirtatiously leans on his chair in order to read over his shoulder but he ignores her and turns the page Caroline Bingley paces the room holding an open book in her hands while Mr Bingley prods the fire with his foot she crosses to Lizzie who looks around her awkwardly then shuts her book stands and sets off arms linked around the room with Miss Bingley With malevolent intent in her eyes Jane and Lizzie are in a twohorse carriage as he beams at her and Bingley steps away from the door still grinning raising a hand to bid them farewell Darcy considers this for a moment and Miss Bingley attempts to break the palpable tension by crossing to the piano as Darcy and Lizzie steadily hold each other's gazes Now inside the carriage Jane smiles dreamily As the carriage leaves Darcy watches its progress from a window and remains staring out of the window Lizzie is walking through the countryside with green leaves starting to turn brown and she watches the progress of geese flying through the sky overhead A lady's hand is at work on a delicate piece of floral embroidery The obsequious Mr Collins pulls up and clumsily climbs down from the carriage causing Jane to stifle a giggle and he bows to them reverentially At the Bennet's dining table he gives them a look as an austerelooking woman is also present Mr Collins gives Jane an ingratiating smile Now a lavish dinner takes place and Lizzie gives her father a look before she giggles Lydia and Kitty are playing a game with hoops Now the family is outside amusing themselves in the gardens as Mr Collins is walking with Mrs Bennet and looks at the girls carefully Mr Collins bustles over to her and she looks uncertain Mary is studying a book and finally Lizzie is laughing and smiling with Jane They make their way into the village with carriages rolling past and people talking on corners Now the sisters are walking over a stone bridge accompanied by Mr Collins who is exhausted from the walk Bingley and Darcy ride by with Darcy dismounting from his gray horse to join them Lydia and Kitty rush ahead and stop at a shop window as Denny crosses to meet them with his companion Lizzie watches the exchange with interest and studies Darcy as he rides away sitting stiff and proper in the saddle Mr Wickham and Mr Darcy spot each other and a look passes between them before Mr Wickham lifts his hat to him Lizzie looks grateful for his departure as Mary starts playing the piano Lizzie and Kitty race in followed by Mary and he backs away from them and takes a seat at a card table At the whist table Mr Collins lays down a card much to Mrs Phillips's disgust"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Now the family is outside amusing themselves in the gardens as Mr Collins is walking with Mrs Bennet and looks at the girls carefully Lydia and Kitty are playing a game with hoops Mary is studying a book and finally Lizzie is laughing and smiling with Jane Mr Collins bustles over to her and she looks uncertain Now the sisters are walking over a stone bridge accompanied by Mr Collins who is exhausted from the walk They make their way into the village with carriages rolling past and people talking on corners Lydia and Kitty rush ahead and stop at a shop window as Denny crosses to meet them with his companion Bingley and Darcy ride by with Darcy dismounting from his gray horse to join them Mr Wickham and Mr Darcy spot each other and a look passes between them before Mr Wickham lifts his hat to him Lizzie watches the exchange with interest and studies Darcy as he rides away sitting stiff and proper in the saddle Lizzie and Kitty race in followed by Mary and he backs away from them and takes a seat at a card table Lizzie looks grateful for his departure as Mary starts playing the piano At the whist table Mr Collins lays down a card much to Mrs Phillips's disgust Caroline Bingley paces the room holding an open book in her hands while Mr Bingley prods the fire with his foot Miss Bingley walks over to Darcy who is engrossed in a book and flirtatiously leans on his chair in order to read over his shoulder but he ignores her and turns the page With malevolent intent in her eyes she crosses to Lizzie who looks around her awkwardly then shuts her book stands and sets off arms linked around the room with Miss Bingley Darcy considers this for a moment and Miss Bingley attempts to break the palpable tension by crossing to the piano as Darcy and Lizzie steadily hold each other's gazes Jane and Lizzie are in a twohorse carriage as he beams at her and Bingley steps away from the door still grinning raising a hand to bid them farewell As the carriage leaves Darcy watches its progress from a window and remains staring out of the window Now inside the carriage Jane smiles dreamily A lady's hand is at work on a delicate piece of floral embroidery Lizzie is walking through the countryside with green leaves starting to turn brown and she watches the progress of geese flying through the sky overhead At the Bennet's dining table he gives them a look as an austerelooking woman is also present The obsequious Mr Collins pulls up and clumsily climbs down from the carriage causing Jane to stifle a giggle and he bows to them reverentially Now a lavish dinner takes place and Lizzie gives her father a look before she giggles Mr Collins gives Jane an ingratiating smile"
        }
      ]
    }
  ]
}