{
  "ground_truth": "Jean rushes toward the door, cloaked by the shower curtain but awkwardly trying to push it off; still thrashing, Jean crashes against the upstairs railing, trips on the curtain and falls, thumping crazily down the stairs. Grimsrud follows and trots down after her. Wade sits behind his desk; another man rises as Jerry enters, and Stan Grossman shakes his hand. Wade scowls, looks at Stan, and is angry. We are high and wide on the office building's parking lot. Jerry emerges wrapped in a parka, his arms sticking stiffly out at his sides, his breath vaporizing. He goes to his car, opens its front door, pulls out a red plastic scraper and starts methodically scraping off the thin crust of ice that has developed on his windshield; the scrape-scrape-scrape sound carries in the frigid air. Jerry goes into a frenzy, banging the scraper against the windshield and the hood of his car, but the tantrum passes; scrape-scrape-scrape - he goes back to work on the windshield. The door swings open and Jerry edges in, looking about, holding a sack of groceries. He shuts the door and has already seen the shower curtain on the floor. Jerry stands in wide shot, hands on hips, looking down at a telephone; after a motionless beat he picks up the phone and punches in a number. It is a flannel-shirt woodsman carrying a double-edged axe over one shoulder. As we hear the rumble of an approaching car, the continuing tilt and boom down brings us down the woodsman's body to a pedestal. A sweep of headlights illuminates a sign on the pedestal. The headlights sweep off and a car hums past and on into the background. The two-lane highway is otherwise empty. Carl drives while Jean lies bound and curled on the back seat underneath a tarpaulin, and from the back seat we hear whimpering. Grimsrud smokes and gazes out the window, then turns to look and stares at Carl, then turns back to the window. At a loud WHOOP Carl starts and looks back out the rear window; fifty yards behind a state trooper has turned on his gumballs. Carl looks up at the rear-view mirror and Grimsrud looks at him. Both cars have stopped, and Carl looks into the back seat as the car bounces and slows on the gravel shoulder. The trooper is stopped on the shoulder just behind them, writing in his citation book, as Carl watches and Grimsrud stares at Carl. The trooper walks up the shoulder, one hand resting lightly on top of his holster, his breath steaming in the cold night air. Carl opens his window as the trooper draws up; the trooper scans car interior, taking his time, while Grimsrud smokes and gazes calmly out his window.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Jean dashes toward the entrance, shrouded by the shower drape but clumsily attempting to shove it off; still flailing, Jean collides against the upstairs banister, stumbles on the drape and plummets, thudding wildly down the steps. Grimsrud trails and jogs down after her. Wade perches behind his counter; another gentleman ascends as Jerry arrives, and Stan Grossman grasps his hand. Wade frowns, glances at Stan, and is irate. We are elevated and expansive on the office edifice's parking area. Jerry appears wrapped in a parka, his limbs jutting stiffly out at his sides, his breath condensing. He proceeds to his vehicle, unlatches its front door, pulls out a crimson plastic scraper and begins systematically scraping off the slender crust of frost that has formed on his windscreen; the scrape-scrape-scrape noise echoes in the icy air. Jerry descends into a frenzy, striking the scraper against the windscreen and the hood of his vehicle, but the tantrum subsides; scrape-scrape-scrape - he returns to labor on the windscreen. The entrance swings open and Jerry edges in, scanning around, clutching a sack of provisions. He closes the entrance and has already spotted the shower drape on the ground. Jerry stands in broad shot, hands on hips, gazing down at a telephone; after a still beat he lifts the receiver and dials a numeral. It is a flannel-shirt woodsman bearing a dual-edged axe over one shoulder. As we hear the rumble of an approaching automobile, the continuing tilt and boom down brings us down the woodsman's form to a base. A sweep of headlights illuminates a sign on the base. The headlights sweep off and an automobile hums by and on into the distance. The two-lane roadway is otherwise barren. Carl maneuvers while Jean reclines bound and curled on the rear seat beneath a tarpaulin, and from the rear seat we hear whimpering. Grimsrud puffs and gazes out the pane, then rotates to look and stares at Carl, then rotates back to the pane. At a loud WHOOP Carl starts and peers back out the rear pane; fifty yards behind a state officer has activated his gumballs. Carl glances up at the rear-view mirror and Grimsrud glances at him. Both vehicles have halted, and Carl gazes into the rear seat as the automobile bounces and decelerates on the gravel shoulder. The officer is halted on the shoulder just behind them, scribbling in his citation book, as Carl observes and Grimsrud stares at Carl. The officer strides up the shoulder, one hand resting lightly on top of his holster, his breath misting in the frigid night air. Carl lowers his pane as the officer draws up; the officer scans the vehicle's interior, taking his time, while Grimsrud puffs and gazes serenely out his pane."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Jean is rushed toward the door, cloaked by the shower curtain but awkwardly trying to push it off; still thrashing, the upstairs railing is crashed against by Jean, the curtain is tripped on by her, and she is caused to fall, thumping crazily down the stairs. Grimsrud follows and trots down after her. Wade sits behind his desk; another man is risen as Jerry enters, and Stan Grossman is shaken hands with by him. Wade scowls, looks at Stan, and is made angry. We high and wide on the office building's parking lot show. Jerry is emerged wrapped in a parka, his arms stiffly stuck out at his sides, his breath vaporizing. His car is gone to by him, its front door is opened, a red plastic scraper is pulled out by him and the thin crust of ice that has developed on his windshield is methodically started to be scraped off; the scrape-scrape-scrape sound is carried in the frigid air. A frenzy is gone into by Jerry, the scraper is banged by him against the windshield and the hood of his car, but the tantrum passes; scrape-scrape-scrape - the work on the windshield is gone back to by him. The door is swung open and Jerry is edged in, looking about, a sack of groceries is held by him. The door is shut by him and the shower curtain on the floor has already been seen by him. Jerry is stood in wide shot, hands on hips, looking down at a telephone; after a motionless beat, the phone is picked up by him and he punches in a number. It is a flannel-shirt woodsman carrying a double-edged axe over one shoulder. As the rumble of an approaching car is heard by us, the continuing tilt and boom down bring us down the woodsman's body to a pedestal. A sweep of headlights illuminates a sign on the pedestal. The headlights sweep off and a car is hummed past and on into the background by it. The two-lane highway is otherwise empty. Carl drives while Jean is bound and curled on the back seat underneath a tarpaulin, and whimpering is heard by us from the back seat. Grimsrud smokes and gazes out the window, then he turns, looks, and stares at Carl, then turns back to the window. At a loud WHOOP Carl is started and the rear window is looked back out by him; fifty yards behind a state trooper has turned on his gumballs. The rear-view mirror is looked up at by Carl and Grimsrud looks at him. Both cars are stopped, and the back seat is looked into by Carl as the car is bounced and slowed on the gravel shoulder. The trooper is stopped on the shoulder just behind them, writing in his citation book, as Carl watches and Grimsrud stares at Carl. The trooper walks up the shoulder, one hand is resting lightly on top of his holster by him, his breath steaming in the cold night air. The window is opened by Carl as the trooper draws up; the car interior is scanned by the trooper, he takes his time, while Grimsrud smokes and gazes calmly out his window."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Jean rushes to the door, awkwardly tangled in the shower curtain, crashes against the railing, trips, and tumbles down the stairs. Grimsrud follows her. Wade sits at his desk; another man stands as Jerry enters, and Stan Grossman shakes his hand. Wade scowls at Stan, clearly angry. Outside, Jerry, in a parka, breath visible, scrapes ice off his car windshield. He bangs the scraper in frustration but resumes scraping. Jerry enters with groceries, notices the shower curtain on the floor, and stands with hands on hips before dialing a number. A woodsman with an axe is illuminated by car headlights on a two-lane highway. Carl drives with Jean bound under a tarpaulin in the back seat, whimpering. Grimsrud smokes, staring out the window, then at Carl. A state trooper's siren startles Carl; both cars stop. The trooper writes a citation as Carl watches and Grimsrud smokes. The trooper approaches, scanning the car interior, while Grimsrud gazes out the window."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Jean rushes to the door, tangled in the shower curtain, crashes against the railing, trips, and tumbles down the stairs. Grimsrud follows her. Wade sits at his desk; another man stands as Jerry enters, and Stan Grossman shakes his hand. Wade scowls at Stan, angry. Outside the office building, Jerry, in a parka, scrapes ice off his car windshield. He bangs the scraper in frustration but resumes scraping. Jerry enters, holding groceries, sees the shower curtain on the floor, and picks up the phone. A flannel-shirted woodsman with an axe is illuminated by car headlights. Carl drives with Jean bound under a tarpaulin in the back seat, whimpering. Grimsrud smokes, gazes out, then stares at Carl. A state trooper turns on his lights behind them. Carl and Grimsrud exchange looks as both cars stop. The trooper approaches, hand on his holster, breath steaming. Carl opens his window as the trooper scans the car interior, while Grimsrud smokes calmly."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Jean, in a frantic rush, makes her way toward the door, awkwardly cloaked by the shower curtain that she is desperately trying to push off. Still thrashing about, she crashes against the upstairs railing, trips over the curtain, and tumbles, thumping wildly and uncontrollably down the stairs. Grimsrud, observing the commotion, follows her and trots down the stairs after her. Meanwhile, Wade is seated behind his desk; as Jerry enters the room, another man stands up, and Stan Grossman extends his hand for a handshake. Wade, with a scowl on his face, looks at Stan, clearly displaying his anger. We find ourselves high and wide, overlooking the parking lot of the office building. Jerry emerges, wrapped snugly in a parka, his arms sticking stiffly out at his sides, with his breath visibly vaporizing in the cold air. He makes his way to his car, opens the front door, and retrieves a red plastic scraper. He then begins methodically scraping off the thin crust of ice that has formed on his windshield; the repetitive scrape-scrape-scrape sound echoes in the frigid air. Suddenly, Jerry goes into a frenzy, banging the scraper against the windshield and the hood of his car, but the tantrum soon passes; scrape-scrape-scrape - he resumes his work on the windshield. The door swings open, and Jerry edges inside, looking around cautiously, holding a sack of groceries. He shuts the door and immediately notices the shower curtain lying on the floor. Jerry stands in a wide shot, hands on his hips, looking down at a telephone; after a moment of stillness, he picks up the phone and punches in a number. We see a flannel-shirted woodsman carrying a double-edged axe over one shoulder. As the rumble of an approaching car is heard, the continuing tilt and boom down brings us down the woodsman's body to a pedestal. A sweep of headlights illuminates a sign on the pedestal. The headlights sweep off, and a car hums past, continuing on into the background. The two-lane highway is otherwise empty and desolate. Carl is driving while Jean lies bound and curled up on the back seat underneath a tarpaulin, and from the back seat, we hear her whimpering. Grimsrud, smoking, gazes out the window, then turns to look and stares intently at Carl, before turning back to the window. At a loud WHOOP, Carl starts and looks back out the rear window; fifty yards behind, a state trooper has turned on his gumballs. Carl glances up at the rear-view mirror, and Grimsrud looks at him. Both cars have come to a stop, and Carl looks into the back seat as the car bounces and slows on the gravel shoulder. The trooper is stopped on the shoulder just behind them, writing in his citation book, as Carl watches and Grimsrud continues to stare at Carl. The trooper walks up the shoulder, one hand resting lightly on top of his holster, his breath steaming in the cold night air. Carl opens his window as the trooper approaches; the trooper scans the car's interior, taking his time, while Grimsrud smokes and gazes calmly out his window."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Jean, in an almost frantic and panicked rush, makes her way toward the door, awkwardly and clumsily cloaked by the cumbersome shower curtain that she is desperately and unsuccessfully trying to push away and off herself. Still thrashing about in a state of disarray, she unintentionally crashes against the upstairs railing, trips over the cumbersome curtain, and subsequently tumbles, thumping wildly and uncontrollably down the staircase. Grimsrud, observing this chaotic commotion from nearby, quickly follows her trajectory and trots down the stairs after her. Meanwhile, Wade is seated comfortably behind his desk; as Jerry enters the room, another man immediately stands up, and Stan Grossman promptly extends his hand for a cordial handshake. Wade, with a deep scowl etched on his face, looks at Stan, clearly and unmistakably displaying his anger and displeasure. We find ourselves positioned high and wide, overlooking the expansive parking lot of the office building. Jerry emerges into the scene, wrapped snugly and warmly in a substantial parka, his arms sticking stiffly out at his sides, with each breath visibly vaporizing in the frigid and biting cold air. He then makes his way over to his car, opens the front door, and retrieves a red plastic scraper. With determination, he begins methodically scraping off the thin crust of ice that has formed on his windshield; the repetitive and consistent scrape-scrape-scrape sound echoes sharply in the cold, still air. Suddenly, Jerry goes into a wild frenzy, angrily banging the scraper against the windshield and the hood of his car, but this brief tantrum soon passes; scrape-scrape-scrape - he resumes his diligent work on the windshield. The door swings open with a soft creak, and Jerry edges cautiously inside, looking around carefully, holding a sack of groceries. He shuts the door behind him and immediately notices the shower curtain lying conspicuously on the floor. Jerry stands in a wide shot, hands planted firmly on his hips, looking down at a telephone; after a brief moment of stillness and contemplation, he finally picks up the phone and punches in a number. We see a flannel-shirted woodsman carrying a large double-edged axe over one shoulder. As the rumble of an approaching car grows louder, the continuing tilt and boom down brings our view down the woodsman's body to a pedestal he stands on. A sweeping arc of headlights suddenly illuminates a sign on the pedestal. The headlights sweep off just as quickly, and the car hums past, continuing its journey into the distant background. The two-lane highway remains otherwise empty and desolate. Carl is behind the wheel driving while Jean lies bound and curled up on the back seat underneath a heavy tarpaulin, and from the confines of the back seat, we hear her soft whimpering. Grimsrud, casually smoking, gazes out the window thoughtfully, then turns to look and stares intently at Carl for a moment before turning back to gaze out the window again. At the sudden sound of a loud WHOOP, Carl starts with a jolt and looks back out the rear window; fifty yards behind, a state trooper has turned on his gumballs, signaling a stop. Carl glances up anxiously at the rear-view mirror, and Grimsrud looks at him pointedly. Both cars have slowly come to a stop, and Carl looks into the back seat as the car bounces and slows on the gravel shoulder. The trooper has stopped on the shoulder just behind them, writing diligently in his citation book, as Carl watches and Grimsrud continues to stare steadfastly at Carl. The trooper walks up the shoulder with measured steps, one hand resting lightly on the top of his holster, his breath visibly steaming in the frigid cold night air. Carl opens his window with a deliberate motion as the trooper approaches; the trooper scans the car's interior cautiously, taking his time, while Grimsrud smokes leisurely and gazes calmly out his window."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Jean, in a frantic rush, makes her way toward the door, her movements hindered by the shower curtain that clings to her, creating an awkward struggle as she attempts to push it off. In her thrashing, she collides with the upstairs railing, loses her balance due to the entangling curtain, and tumbles, her body thumping wildly as she descends the stairs. Grimsrud, observing the chaos, follows her and makes his way down the stairs at a steady pace. Meanwhile, Wade is seated behind his desk, and as Jerry enters the room, another man stands up. This man, Stan Grossman, extends his hand to Jerry for a handshake. Wade, however, scowls, casting an angry glance at Stan. The scene shifts to a high and wide view of the office building's parking lot, where Jerry emerges, bundled in a parka with his arms protruding stiffly at his sides, his breath visible in the cold air. He approaches his car, opens the front door, retrieves a red plastic scraper, and begins the methodical task of scraping the thin layer of ice from his windshield, the repetitive scrape-scrape-scrape sound echoing in the frigid atmosphere. Suddenly, Jerry is overcome with frustration, and he erupts into a frenzy, violently banging the scraper against the windshield and the hood of his car. The tantrum subsides, and he resumes his task, scrape-scrape-scrape, continuing to clear the windshield. Later, Jerry carefully edges into a room, holding a sack of groceries, and as he shuts the door, he notices the shower curtain lying on the floor. Standing in a wide shot, with his hands on his hips, he gazes down at a telephone. After a moment of stillness, he picks up the phone and dials a number. In another scene, a flannel-shirted woodsman carries a double-edged axe over one shoulder. As the rumble of an approaching car grows louder, the camera tilts and booms down the woodsman's body to reveal a pedestal. Headlights sweep across, illuminating a sign on the pedestal before the car hums past and continues into the background, leaving the otherwise empty two-lane highway behind. Inside the car, Carl drives while Jean lies bound and curled on the back seat beneath a tarpaulin, her whimpering audible from the back. Grimsrud, smoking, gazes out the window, then turns to stare at Carl before returning his gaze to the window. A sudden loud WHOOP startles Carl, prompting him to look back out the rear window, where he sees a state trooper fifty yards behind, having turned on his gumballs. Carl glances up at the rear-view mirror, and Grimsrud looks at him. Both cars come to a stop, and as Carl's car bounces and slows on the gravel shoulder, he looks into the back seat. The trooper, having stopped on the shoulder just behind them, writes in his citation book while Carl watches and Grimsrud continues to stare at Carl. The trooper approaches, walking up the shoulder with one hand resting lightly on top of his holster, his breath visible in the cold night air. Carl rolls down his window as the trooper arrives, taking his time to scan the car's interior, while Grimsrud smokes and gazes calmly out his window."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jean, entangled in a shower curtain, rushes toward the door, crashes against the upstairs railing, and tumbles down the stairs. Grimsrud follows her descent. Meanwhile, in an office, Wade sits behind his desk, scowling as Jerry enters and shakes hands with Stan Grossman. Outside, Jerry, bundled in a parka, methodically scrapes ice off his car windshield, briefly succumbing to a tantrum before resuming his task. Later, Jerry enters a room with groceries, notices the shower curtain on the floor, and, after a pause, dials a number on the phone. In a different scene, a woodsman with an axe is illuminated by passing car headlights on an otherwise empty highway. Carl drives with Jean bound under a tarpaulin in the back seat, while Grimsrud smokes and gazes out the window. A state trooper activates his lights behind them, prompting Carl to check the rear-view mirror. Both cars stop, and the trooper approaches, scanning the car's interior as Grimsrud continues to smoke and look out the window."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Jean rushes toward the door, cloaked by the shower curtain but awkwardly trying to push it off; still thrashing, Jean crashes against the upstairs railing of the two-story suburban home, trips on the curtain and falls, thumping crazily down the stairs with a chaotic clatter. Grimsrud, a stoic and intimidating figure known for his criminal background, follows and trots down after her. \n\nWade sits behind his desk in an office decorated with family photos and awards; another man rises as Jerry enters, and Stan Grossman, a prominent businessman known for his keen negotiation skills, shakes his hand. Wade scowls, looks at Stan, and is angry. We are high and wide on the office building's parking lot, which is notably spacious and lined with rows of well-maintained vehicles. Jerry emerges wrapped in a parka, his arms sticking stiffly out at his sides, his breath vaporizing in the frigid temperatures common to Minnesota winters. He goes to his car, opens its front door, pulls out a red plastic scraper, essential for dealing with icy conditions, and starts methodically scraping off the thin crust of ice that has developed on his windshield; the scrape-scrape-scrape sound carries in the frigid air, resonating in the stillness. Jerry goes into a frenzy, banging the scraper against the windshield and the hood of his car, but the tantrum passes; scrape-scrape-scrape - he goes back to work on the windshield. \n\nThe door swings open to a cold burst of air and Jerry edges in, looking about, holding a sack of groceries from the local market. He shuts the door and has already seen the shower curtain on the floor, a remnant of the earlier chaos. Jerry stands in wide shot, hands on hips, looking down at a telephone; after a motionless beat he picks up the phone and punches in a number. It is a flannel-shirt woodsman, a rugged individual used to the harsh outdoor elements, carrying a double-edged axe over one shoulder. As we hear the rumble of an approaching car, the continuing tilt and boom down brings us down the woodsman's body to a pedestal, a makeshift signpost indicating a nearby trailhead. A sweep of headlights illuminates a sign on the pedestal. The headlights sweep off and a car hums past and on into the background. The two-lane highway is otherwise empty, a desolate stretch often subjected to treacherous weather conditions. \n\nCarl drives along this lonely highway while Jean lies bound and curled on the back seat underneath a tarpaulin, muffling her sounds, and from the back seat we hear whimpering. Grimsrud smokes a cigarette with an air of detachment and gazes out the window, then turns to look and stares at Carl, then turns back to the window. At a loud WHOOP Carl starts and looks back out the rear window; fifty yards behind, a state trooper has turned on his gumballs, a colloquial term for police lights. Carl looks up at the rear-view mirror and Grimsrud looks at him. Both cars have stopped, and Carl looks into the back seat as the car bounces and slows on the gravel shoulder. The trooper is stopped on the shoulder just behind them, writing in his citation book, as Carl watches and Grimsrud stares at Carl. The trooper walks up the shoulder, one hand resting lightly on top of his holster, a standard safety procedure, his breath steaming in the cold night air. Carl opens his window as the trooper draws up; the trooper scans the car interior, taking his time and ensuring caution in his approach, while Grimsrud smokes and gazes calmly out his window."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Jean rushes toward the door cloaked by the shower curtain but awkwardly trying to push it off. still thrashing. Jean crashes against the upstairs railing trips on the curtain and falls thumping crazily down the stairs. Grimsrud follows and trots down after her. Wade sits behind his desk. another man rises as Jerry enters and Stan Grossman shakes his hand. Wade scowls looks at Stan and is angry. We are high and wide on the office building's parking lot. Jerry emerges wrapped in a parka his arms sticking stiffly out at his sides his breath vaporizing. He goes to his car opens its front door pulls out a red plastic scraper and starts methodically scraping off the thin crust of ice that has developed on his windshield. the scrapescrapescrape sound carries in the frigid air. Jerry goes into a frenzy banging the scraper against the windshield and the hood of his car but the tantrum passes scrapescrapescrape. he goes back to work on the windshield. The door swings open and Jerry edges in looking about holding a sack of groceries. He shuts the door and has already seen the shower curtain on the floor. Jerry stands in wide shot hands on hips looking down at a telephone after a motionless beat. he picks up the phone and punches in a number. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. It is a flannelshirt woodsman carrying a doubleedged axe over one shoulder. As we hear the rumble of an approaching car the continuing tilt and boom down brings us down the woodsman's body to a pedestal. A sweep of headlights illuminates a sign on the pedestal. The headlights sweep off and a car hums past and on into the background. The twolane highway is otherwise empty. Carl drives while Jean lies bound and curled on the back seat underneath a tarpaulin and from the back seat we hear whimpering. Grimsrud smokes and gazes out the window then turns to look and stares at. Carl then turns back to the window. At a loud WHOOP. Carl starts and looks back out the rear window fifty yards behind. a state trooper has turned on his gumballs. Carl looks up at the rearview mirror and Grimsrud looks at him. Both cars have stopped and Carl looks into the back seat as the car bounces and slows on the gravel shoulder. The trooper is stopped on the shoulder just behind them writing in his citation book as Carl watches and Grimsrud stares at Carl. The trooper walks up the shoulder one hand resting lightly on top of his holster his breath steaming in the cold night air. Carl opens his window as the trooper draws up. the trooper scans car interior taking his time while Grimsrud smokes and gazes calmly out his window."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Jean rushes toward the door cloaked by the shower curtain but awkwardly trying to push it off. still thrashing. Jean crashes against the upstairs railing trips on the curtain and falls thumping crazily down the stairs. Grimsrud follows and trots down after her. Wade sits behind his desk. another man rises as Jerry enters and Stan Grossman shakes his hand. Wade scowls looks at Stan and is angry. We are high and wide on the office building's parking lot. Jerry emerges wrapped in a parka his arms sticking stiffly out at his sides his breath vaporizing. He goes to his car opens its front door pulls out a red plastic scraper and starts methodically scraping off the thin crust of ice that has developed on his windshield. the scrapescrapescrape sound carries in the frigid air. Jerry goes into a frenzy banging the scraper against the windshield and the hood of his car but the tantrum passes scrapescrapescrape. he goes back to work on the windshield. The door swings open and Jerry edges in looking about holding a sack of groceries. He shuts the door and has already seen the shower curtain on the floor. Jerry stands in wide shot hands on hips looking down at a telephone after a motionless beat. he picks up the phone and punches in a number. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. It is a flannelshirt woodsman carrying a doubleedged axe over one shoulder. As we hear the rumble of an approaching car the continuing tilt and boom down brings us down the woodsman's body to a pedestal. A sweep of headlights illuminates a sign on the pedestal. The headlights sweep off and a car hums past and on into the background. The twolane highway is otherwise empty. Carl drives while Jean lies bound and curled on the back seat underneath a tarpaulin and from the back seat we hear whimpering. Grimsrud smokes and gazes out the window then turns to look and stares at. Carl then turns back to the window. At a loud WHOOP. Carl starts and looks back out the rear window fifty yards behind. a state trooper has turned on his gumballs. Carl looks up at the rearview mirror and Grimsrud looks at him. Both cars have stopped and Carl looks into the back seat as the car bounces and slows on the gravel shoulder. The trooper is stopped on the shoulder just behind them writing in his citation book as Carl watches and Grimsrud stares at Carl. The trooper walks up the shoulder one hand resting lightly on top of his holster his breath steaming in the cold night air. Carl opens his window as the trooper draws up. the trooper scans car interior taking his time while Grimsrud smokes and gazes calmly out his window."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Jean rushes toward the door cloaked by the shower curtain but awkwardly trying to push it off. still thrashing. Jean crashes against the upstairs railing trips on the curtain and falls thumping crazily down the stairs. Grimsrud follows and trots down after her. Wade sits behind his desk. another man rises as Jerry enters and Stan Grossman shakes his hand. Wade scowls looks at Stan and is angry. We are high and wide on the office building's parking lot. Jerry emerges wrapped in a parka his arms sticking stiffly out at his sides his breath vaporizing. Carl starts and looks back out the rear window fifty yards behind. a state trooper has turned on his gumballs. Carl looks up at the rearview mirror and Grimsrud looks at him. Both cars have stopped and Carl looks into the back seat as the car bounces and slows on the gravel shoulder. The trooper is stopped on the shoulder just behind them writing in his citation book as Carl watches and Grimsrud stares at Carl. The trooper walks up the shoulder one hand resting lightly on top of his holster his breath steaming in the cold night air. Carl opens his window as the trooper draws up. the trooper scans car interior taking his time while Grimsrud smokes and gazes calmly out his window."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Jean rushes toward the door cloaked by the shower curtain but awkwardly trying to push it off. still thrashing. Jean crashes against the upstairs railing trips on the curtain and falls thumping crazily down the stairs. Grimsrud follows and trots down after her. The trooper walks up the shoulder one hand resting lightly on top of his holster his breath steaming in the cold night air. Carl opens his window as the trooper draws up. the trooper scans car interior taking his time while Grimsrud smokes and gazes calmly out his window."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Nina dashes toward the wall, cloaked by the beach towel but awkwardly trying to lift it off; still flailing, Nina bounces against the attic bookshelf, stumbles on the towel and tumbles, rolling wildly down the ladder. Fluffy follows and hops down after her. Tom reclines behind his counter; another lady rises as Bob arrives, and Lily Johnson shakes his foot. Tom frowns, glances at Lily, and is cheerful. We are far and wide on the skyscraper’s bicycle rack. Bob appears wrapped in a cape, his legs jutting crookedly out at his hips, his breath crystallizing. He jogs to his scooter, unlatches its side panel, pulls out a blue metal drill and starts methodically drilling off the thick film of snow that has settled on his helmet; the drill-drill-drill sound echoes in the chilly breeze. Bob goes into a frenzy, smashing the drill against the helmet and the roof of his scooter, but the tantrum passes; drill-drill-drill - he returns to work on the helmet. The panel swings open and Bob sneaks in, glancing around, clutching a bundle of carrots. He shuts the panel and has already spotted the beach towel on the floor. Bob stands in a full view, feet on knees, peering down at a lantern; after a silent moment he lifts the lantern and dials in a frequency. It is a leather-jacket farmer carrying a single-edged shovel over one elbow. As we hear the hum of an approaching van, the descending tilt and glide down brings us down the farmer’s form to a stool. A sweep of floodlights illuminates a notice on the stool. The floodlights sweep away and a van zooms past and on into the foreground. The one-lane alley is otherwise deserted. Mike pedals while Nina rests bound and sprawled on the back shelf underneath a quilt, and from the back shelf we hear sniffling. Fluffy sips and glances out the porthole, then turns to look and points at Mike, then swivels back to the porthole. At a loud BEEP Mike jumps and peers out the side porthole; fifty feet behind a park ranger has flashed on his sirens. Mike peers up at the side-view reflector and Fluffy observes him. Both vans have paused, and Mike peeks into the back shelf as the van jolts and halts on the dirt verge. The ranger is halted on the verge just behind them, scribbling in his notebook, as Mike watches and Fluffy observes Mike. The ranger strides up the verge, one limb resting lightly on top of his belt, his breath fogging in the icy dusk air. Mike opens his porthole as the ranger steps up; the ranger scans van interior, taking his time, while Fluffy sips and peers placidly out his porthole."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jean, cloaked by a shower curtain, crashes against the railing and tumbles down the stairs as Grimsrud follows. Meanwhile, Jerry emerges from a tense meeting with Wade and Stan Grossman, frustrated and scraping ice off his car windshield. After a moment of losing control, he calms down and continues working on the windshield. Jerry enters his house, noticing a shower curtain on the floor, and calls someone. In another scene, Carl drives with Jean bound in the back seat under a tarp while Grimsrud smokes. A state trooper pulls them over, turning on his lights. As the trooper approaches, Carl nervously eyes the rear-view mirror while Grimsrud remains composed and looks out the window."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "the trooper scans car interior taking his time while Grimsrud smokes and gazes calmly out his window Carl opens his window as the trooper draws up  The trooper walks up the shoulder one hand resting lightly on top of his holster his breath steaming in the cold night air  The trooper is stopped on the shoulder just behind them writing in his citation book as Carl watches and Grimsrud stares at Carl  Both cars have stopped and Carl looks into the back seat as the car bounces and slows on the gravel shoulder  Carl looks up at the rearview mirror and Grimsrud looks at him  a state trooper has turned on his gumballs  Carl starts and looks back out the rear window fifty yards behind  At a loud WHOOP  Carl then turns back to the window  Grimsrud smokes and gazes out the window then turns to look and stares at  Carl drives while Jean lies bound and curled on the back seat underneath a tarpaulin and from the back seat we hear whimpering  The twolane highway is otherwise empty  The headlights sweep off and a car hums past and on into the background  A sweep of headlights illuminates a sign on the pedestal  As we hear the rumble of an approaching car the continuing tilt and boom down brings us down the woodsman's body to a pedestal  It is a flannelshirt woodsman carrying a doubleedged axe over one shoulder  he picks up the phone and punches in a number  Jerry stands in wide shot hands on hips looking down at a telephone after a motionless beat  He shuts the door and has already seen the shower curtain on the floor  The door swings open and Jerry edges in looking about holding a sack of groceries  he goes back to work on the windshield  Jerry goes into a frenzy banging the scraper against the windshield and the hood of his car but the tantrum passes scrapescrapescrape   the scrapescrapescrape sound carries in the frigid air  He goes to his car opens its front door pulls out a red plastic scraper and starts methodically scraping off the thin crust of ice that has developed on his windshield  Jerry emerges wrapped in a parka his arms sticking stiffly out at his sides his breath vaporizing  We are high and wide on the office building's parking lot  Wade scowls looks at Stan and is angry  another man rises as Jerry enters and Stan Grossman shakes his hand  Wade sits behind his desk  Grimsrud follows and trots down after her  Jean crashes against the upstairs railing trips on the curtain and falls thumping crazily down the stairs  still thrashing  Jean rushes toward the door cloaked by the shower curtain but awkwardly trying to push it off "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "still thrashing Jean rushes toward the door cloaked by the shower curtain but awkwardly trying to push it off Grimsrud follows and trots down after her Jean crashes against the upstairs railing trips on the curtain and falls thumping crazily down the stairs another man rises as Jerry enters and Stan Grossman shakes his hand Wade sits behind his desk We are high and wide on the office building's parking lot Wade scowls looks at Stan and is angry He goes to his car opens its front door pulls out a red plastic scraper and starts methodically scraping off the thin crust of ice that has developed on his windshield Jerry emerges wrapped in a parka his arms sticking stiffly out at his sides his breath vaporizing Jerry goes into a frenzy banging the scraper against the windshield and the hood of his car but the tantrum passes scrapescrapescrape the scrapescrapescrape sound carries in the frigid air The door swings open and Jerry edges in looking about holding a sack of groceries he goes back to work on the windshield Jerry stands in wide shot hands on hips looking down at a telephone after a motionless beat He shuts the door and has already seen the shower curtain on the floor It is a flannelshirt woodsman carrying a doubleedged axe over one shoulder he picks up the phone and punches in a number A sweep of headlights illuminates a sign on the pedestal As we hear the rumble of an approaching car the continuing tilt and boom down brings us down the woodsman's body to a pedestal The twolane highway is otherwise empty The headlights sweep off and a car hums past and on into the background Grimsrud smokes and gazes out the window then turns to look and stares at Carl drives while Jean lies bound and curled on the back seat underneath a tarpaulin and from the back seat we hear whimpering At a loud WHOOP Carl then turns back to the window a state trooper has turned on his gumballs Carl starts and looks back out the rear window fifty yards behind Both cars have stopped and Carl looks into the back seat as the car bounces and slows on the gravel shoulder Carl looks up at the rearview mirror and Grimsrud looks at him The trooper walks up the shoulder one hand resting lightly on top of his holster his breath steaming in the cold night air The trooper is stopped on the shoulder just behind them writing in his citation book as Carl watches and Grimsrud stares at Carl the trooper scans car interior taking his time while Grimsrud smokes and gazes calmly out his window Carl opens his window as the trooper draws up"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "It is a flannelshirt woodsman carrying a doubleedged axe over one shoulder  As we hear the rumble of an approaching car the continuing tilt and boom down brings us down the woodsman's body to a pedestal  A sweep of headlights illuminates a sign on the pedestal  The headlights sweep off and a car hums past and on into the background  The twolane highway is otherwise empty  Carl drives while Jean lies bound and curled on the back seat underneath a tarpaulin and from the back seat we hear whimpering  Grimsrud smokes and gazes out the window then turns to look and stares at  Carl then turns back to the window  At a loud WHOOP  Carl starts and looks back out the rear window fifty yards behind  a state trooper has turned on his gumballs  Carl looks up at the rearview mirror and Grimsrud looks at him  Both cars have stopped and Carl looks into the back seat as the car bounces and slows on the gravel shoulder  The trooper is stopped on the shoulder just behind them writing in his citation book as Carl watches and Grimsrud stares at Carl  The trooper walks up the shoulder one hand resting lightly on top of his holster his breath steaming in the cold night air  Carl opens his window as the trooper draws up  the trooper scans car interior taking his time while Grimsrud smokes and gazes calmly out his window Jean rushes toward the door cloaked by the shower curtain but awkwardly trying to push it off  still thrashing  Jean crashes against the upstairs railing trips on the curtain and falls thumping crazily down the stairs  Grimsrud follows and trots down after her  Wade sits behind his desk  another man rises as Jerry enters and Stan Grossman shakes his hand  Wade scowls looks at Stan and is angry  We are high and wide on the office building's parking lot  Jerry emerges wrapped in a parka his arms sticking stiffly out at his sides his breath vaporizing  He goes to his car opens its front door pulls out a red plastic scraper and starts methodically scraping off the thin crust of ice that has developed on his windshield  the scrapescrapescrape sound carries in the frigid air  Jerry goes into a frenzy banging the scraper against the windshield and the hood of his car but the tantrum passes scrapescrapescrape   he goes back to work on the windshield  The door swings open and Jerry edges in looking about holding a sack of groceries  He shuts the door and has already seen the shower curtain on the floor  Jerry stands in wide shot hands on hips looking down at a telephone after a motionless beat  he picks up the phone and punches in a number "
        }
      ]
    }
  ]
}