{
  "ground_truth": "As the blonde man draws closer, Dillinger grabs him in a chokehold and aims a gun at Gilbert. He cocks his head. D'Andrea looks at Gilbert whose hand rests on his gun. He turns to Dillinger and Red. Dillinger tosses the blonde man away. D'Andrea sits calmly on the edge of a desk. Dillinger holsters his gun. Dillinger knits his brow thoughtfully then meets D'Andrea's gaze. D'Andrea shrugs. Dillinger glares at D'Andrea, his lips curved into a frown. The mustached gangster leans in closer. Dillinger tilts his head, his eyes narrowing as he meets D'Andrea's gaze. He turns away. Dillinger and Red exit. Now, Hoover and Purvis walk down a hall. Outside, Hoover turns from Purvis and heads over to a group of well-dressed boys standing in two lines. They shake hands. Hoover faces the press. In a movie theatre, the event plays on a newsreel. Dillinger talks to the rugged gangster. Dillinger nods his head at Shouse. A photo of Dillinger appears onscreen. Dillinger subtly covers his face. Shouse stands and Red yanks him back into his seat. Homer looks away nervously. As Dillinger sits with a worried look, his face tilted down, the overhead light turns on, bathing the audience member's faces. The audience turns, peering at the people to the right. The audience turns again. As the audience members settle their eyes back toward the front, the lights fade down and a new story begins. Tommy turns to Dillinger. Dillinger rubs his lips thoughtfully as he looks at Tommy and nods. He exchanges a glance with Red and they rise, grabbing their coats. A few rows ahead, Homer puts on his hat and steps into the aisle behind them. As they exit the theater, Red moves closer to Dillinger. People mill around a town square. A stiff wind flutters the awnings of a storefront. On the far side of the square, a policeman pulls up on a motorcycle. Inside a bank, Baby Face stands on a table and fires his gun through a window at the policeman. He fires at the ceiling. Outside, Homer grabs a man and holds him hostage. Inside, Dillinger and Tommy exchange an exasperated look. From inside a vault, Dillinger tosses a bag to Tommy. He guides the bank president by the shoulder. A woman joins the bank president. The gangsters shield themselves with the hostages as they exit the bank. They pass Homer, who waits outside by their car with his own hostage. Baby Face fires wildly into the town square. Two men dive to the ground. From a window across the street, a man aims a gun. Dillinger lurches forward, his eyes wide. He drops to a seated position, his gun still raised, then notices Tommy who lies on his stomach in a pool of blood.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "As the fair-haired gentleman approaches closer, Dillinger seizes him in a headlock and points a firearm at Gilbert. He tilts his head. D'Andrea observes Gilbert whose hand lies on his pistol. He turns to Dillinger and Red. Dillinger flings the fair-haired gentleman away. D'Andrea perches calmly on the edge of a table. Dillinger sheaths his pistol. Dillinger furrows his brow pensively then meets D'Andrea's gaze. D'Andrea shrugs. Dillinger scowls at D'Andrea, his lips curved into a scowl. The mustachioed mobster leans in nearer. Dillinger inclines his head, his eyes narrowing as he meets D'Andrea's gaze. He turns away. Dillinger and Red leave. Now, Hoover and Purvis stroll down a corridor. Outside, Hoover turns from Purvis and heads over to a group of well-dressed lads standing in two rows. They shake hands. Hoover confronts the press. In a cinema, the occurrence plays on a newsreel. Dillinger speaks to the rugged mobster. Dillinger nods his head at Shouse. A photograph of Dillinger surfaces onscreen. Dillinger discreetly covers his visage. Shouse rises and Red pulls him back into his seat. Homer looks away apprehensively. As Dillinger sits with an anxious expression, his face tilted down, the overhead light turns on, illuminating the audience member's faces. The audience turns, peering at the people to the right. The audience turns again. As the audience members settle their eyes back toward the front, the lights dim down and a new tale begins. Tommy turns to Dillinger. Dillinger rubs his lips pensively as he looks at Tommy and nods. He exchanges a glance with Red and they rise, grabbing their overcoats. A few rows ahead, Homer places on his hat and steps into the passage behind them. As they exit the cinema, Red moves closer to Dillinger. People mill around a town plaza. A brisk breeze flutters the awnings of a storefront. On the far side of the plaza, a constable pulls up on a motorcycle. Inside a bank, Baby Face stands on a table and discharges his firearm through a window at the constable. He discharges at the ceiling. Outside, Homer seizes a man and holds him captive. Inside, Dillinger and Tommy exchange an exasperated look. From inside a vault, Dillinger throws a bag to Tommy. He guides the bank president by the shoulder. A woman joins the bank president. The mobsters shield themselves with the captives as they leave the bank. They pass Homer, who waits outside by their automobile with his own captive. Baby Face discharges wildly into the town plaza. Two men dive to the ground. From a window across the street, a man points a firearm. Dillinger lunges forward, his eyes wide. He drops to a seated position, his firearm still raised, then notices Tommy who lies on his stomach in a pool of blood."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "As the blonde man is drawn closer by Dillinger, he is grabbed in a chokehold and a gun is aimed at Gilbert by him. His head is cocked. Gilbert looks at D'Andrea whose hand is rested on his gun. Dillinger and Red are turned to by him. The blonde man is tossed away by Dillinger. The edge of a desk is calmly sat on by D'Andrea. His gun is holstered by Dillinger. Dillinger’s brow is knitted thoughtfully, then D'Andrea’s gaze is met by him. A shrug is given by D'Andrea. D'Andrea is glared at by Dillinger, his lips curved into a frown. Closer leans the mustached gangster. D'Andrea’s gaze is met by Dillinger as his head is tilted and his eyes narrowed. Away, he turns. An exit is made by Dillinger and Red. Now, a hall is walked down by Hoover and Purvis. Outside, Purvis is turned from and over to a group of well-dressed boys standing in two lines, Hoover heads. Hands are shaken by them. The press is faced by Hoover. In a movie theatre, the event is played on a newsreel. The rugged gangster is talked to by Dillinger. Shouse is nodded at by Dillinger. Onscreen, a photo of Dillinger appears. His face is subtly covered by Dillinger. Shouse is stood and yanked back into his seat by Red. Nervously, away looks Homer. As a worried look is sat with by Dillinger, his face tilted down, the overhead light is turned on, bathing the audience members' faces. The audience is turned, peering at the people to the right. Again, the audience turns. As the eyes of the audience members are settled back toward the front, the lights are faded down and a new story is begun. Dillinger is turned to by Tommy. His lips are rubbed thoughtfully by Dillinger as Tommy is looked at by him and a nod is given. A glance is exchanged with Red and they rise, their coats are grabbed. A few rows ahead, his hat is put on by Homer and the aisle is stepped into behind them. As the theater is exited by them, closer to Dillinger moves Red. Around a town square, people mill. The awnings of a storefront are fluttered by a stiff wind. On the far side of the square, a motorcycle is pulled up by a policeman. Inside a bank, a table is stood on by Baby Face and his gun is fired through a window at the policeman. At the ceiling, he fires. Outside, a man is grabbed by Homer and held hostage. An exasperated look is exchanged by Dillinger and Tommy inside. From inside a vault, a bag is tossed to Tommy by Dillinger. The bank president is guided by the shoulder. The bank president is joined by a woman. The hostages are used by the gangsters as a shield as the bank is exited by them. Homer is passed, who waits with his own hostage by their car outside. Into the town square, Baby Face fires wildly. To the ground, two men dive. From a window across the street, a gun is aimed by a man. Forward, Dillinger lurches, his eyes wide. To a seated position, he drops, his gun still raised, then Tommy is noticed by him, who lies on his stomach in a pool of blood."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "As the blonde man approaches, Dillinger grabs him in a chokehold and aims a gun at Gilbert, cocking his head. D'Andrea sees Gilbert’s hand on his gun, then looks at Dillinger and Red. Dillinger tosses the blonde man aside. D'Andrea calmly sits on a desk’s edge. Dillinger holsters his gun, knits his brow, then meets D'Andrea's gaze. D'Andrea shrugs. Dillinger frowns and glares at him. The mustached gangster leans in. Dillinger narrows his eyes at D'Andrea, then turns away. Dillinger and Red leave. Hoover and Purvis walk down a hallway. Outside, Hoover leaves Purvis and greets a line of well-dressed boys with handshakes. Hoover then faces the press. In a theater, a newsreel of the event plays. Dillinger speaks to a rugged gangster, nods at Shouse. A photo of Dillinger appears onscreen, and he subtly covers his face. Shouse stands, but Red pulls him back into his seat. Homer looks away nervously. Dillinger, face tilted down, looks worried as the overhead light turns on, illuminating the audience. They turn to the right, then forward again. The lights dim and a new story begins. Tommy turns to Dillinger, who rubs his lips, nods at Tommy, glances at Red, and they rise, grabbing coats. Ahead, Homer dons his hat and steps into the aisle. As they leave the theater, Red moves close to Dillinger. People gather in a town square. A strong wind shakes storefront awnings. Across the square, a policeman arrives on a motorcycle. In a bank, Baby Face stands on a table and fires through a window at the policeman, then shoots the ceiling. Outside, Homer grabs a hostage. Inside, Dillinger and Tommy exchange a frustrated look. Dillinger, in the vault, tosses a bag to Tommy and guides the bank president. A woman joins them. The gangsters use hostages as shields while exiting. They pass Homer, who waits with his own hostage. Baby Face fires wildly into the square. Two men dive. Across the street, a man aims a gun from a window. Dillinger lurches forward, eyes wide, and drops to a seated position with his gun still raised. He sees Tommy lying in a pool of blood."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "As the blonde man approaches, Dillinger grabs him in a chokehold, aiming a gun at Gilbert. D'Andrea observes Gilbert's hand on his gun, then turns to Dillinger and Red. Dillinger releases the blonde man, holsters his gun, and exchanges a thoughtful look with D'Andrea, who shrugs. Dillinger frowns at D'Andrea, then exits with Red. Hoover and Purvis walk down a hall. Outside, Hoover greets a group of well-dressed boys and faces the press. In a theater, a newsreel shows Dillinger, who nods at Shouse. Dillinger covers his face as Shouse stands, but Red pulls him back. Homer looks away nervously. Dillinger, worried, sits as the lights reveal the audience. The lights dim, and a new story begins. Tommy turns to Dillinger, who nods and exchanges a glance with Red. They grab their coats and exit, with Homer following. Outside, a stiff wind flutters storefront awnings. A policeman arrives on a motorcycle. Inside a bank, Baby Face fires at the policeman and ceiling. Outside, Homer takes a hostage. Dillinger and Tommy exchange looks, and Dillinger tosses a bag to Tommy. They guide the bank president and a woman outside, using hostages as shields. Homer waits by their car with a hostage. Baby Face fires into the square, and two men dive. A man across the street aims a gun. Dillinger lurches forward, drops to a seated position, and sees Tommy in a pool of blood."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As the blonde-haired man steadily draws closer, Dillinger swiftly grabs him in a firm chokehold, simultaneously aiming a gun directly at Gilbert. He cocks his head slightly to the side. D'Andrea, observing the situation, looks intently at Gilbert, whose hand rests tensely on his own gun. He then turns his attention to Dillinger and Red. With a dismissive gesture, Dillinger tosses the blonde man aside. D'Andrea, maintaining his composure, sits calmly on the edge of a nearby desk. Dillinger carefully holsters his gun. He knits his brow thoughtfully, then meets D'Andrea's gaze with a questioning look. D'Andrea merely shrugs in response. Dillinger glares at D'Andrea, his lips curving into a displeased frown. The mustached gangster leans in closer, scrutinizing the situation. Dillinger tilts his head, his eyes narrowing as he locks eyes with D'Andrea. He then turns away. Dillinger and Red make their exit. Meanwhile, Hoover and Purvis walk purposefully down a hall. Once outside, Hoover turns away from Purvis and approaches a group of well-dressed boys standing neatly in two lines. They exchange firm handshakes. Hoover then turns to face the press. In a movie theatre, the event is being shown on a newsreel. Dillinger engages in conversation with the rugged gangster. He nods his head in acknowledgment at Shouse. A photo of Dillinger appears onscreen, prompting him to subtly cover his face. Shouse stands, but Red quickly yanks him back into his seat. Homer looks away nervously, his eyes darting around. As Dillinger sits with a worried expression, his face tilted downward, the overhead light suddenly turns on, illuminating the faces of the audience members. The audience turns, peering curiously at the people to their right. The audience turns once more. As the audience members settle their eyes back toward the front, the lights gradually fade down, and a new story begins. Tommy turns to face Dillinger. Dillinger rubs his lips thoughtfully as he looks at Tommy and nods in agreement. He exchanges a glance with Red, and together they rise, grabbing their coats. A few rows ahead, Homer puts on his hat and steps into the aisle behind them. As they exit the theater, Red moves closer to Dillinger. People mill around a bustling town square. A stiff wind flutters the awnings of a nearby storefront. On the far side of the square, a policeman pulls up on a motorcycle. Inside a bank, Baby Face stands on a table and fires his gun through a window at the policeman. He then fires at the ceiling. Outside, Homer grabs a man and holds him hostage. Inside, Dillinger and Tommy exchange an exasperated look. From inside a vault, Dillinger tosses a bag to Tommy. He guides the bank president by the shoulder. A woman joins the bank president. The gangsters shield themselves with the hostages as they make their way out of the bank. They pass Homer, who waits outside by their car with his own hostage. Baby Face fires wildly into the town square. Two men dive to the ground for cover. From a window across the street, a man aims a gun. Dillinger lurches forward, his eyes wide with shock. He drops to a seated position, his gun still raised, then notices Tommy, who lies on his stomach in a pool of blood."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the blonde-haired man steadily approaches, drawing ever closer with each step, Dillinger swiftly and decisively seizes him in a firm chokehold. At the same time, he skillfully aims a gun directly at Gilbert, demonstrating his readiness for any outcome. Dillinger cocks his head slightly to the side, a subtle gesture that conveys his confidence in the situation. D'Andrea, observing intently from his vantage point, fixes his gaze on Gilbert, whose hand tensely rests on his own gun, ready for action. After a moment, D'Andrea shifts his focus to Dillinger and Red, taking in the entire scene. With a dismissive flick of his wrist, Dillinger casually tosses the blonde man aside, indicating his disinterest. D'Andrea, maintaining an air of calm composure, sits nonchalantly on the edge of a nearby desk, seemingly unfazed by the events unfolding around him. Dillinger carefully holsters his weapon, then knits his brow thoughtfully as he meets D'Andrea's gaze with a questioning look. D'Andrea simply responds with a nonchalant shrug, offering no additional insight. Dillinger glares at D'Andrea, his lips curving into a frown of displeasure. The mustached gangster leans in closer, scrutinizing every detail of the situation. Dillinger tilts his head, narrowing his eyes as he locks eyes with D'Andrea, then deliberately turns his attention away. Having surveyed the scene, Dillinger and Red make their exit. Meanwhile, Hoover and Purvis stride purposefully down a hall with determined expressions. Once outside, Hoover turns away from Purvis and makes his way toward a group of well-dressed boys, who stand neatly in two orderly lines. They exchange firm, confident handshakes. Hoover then turns to face the press, presenting a composed demeanor. In a movie theatre, the ongoing event is being broadcast on a newsreel for all to see. Dillinger engages in conversation with the rugged gangster, nodding his head in acknowledgment at Shouse's presence. A photograph of Dillinger appears onscreen, prompting him to subtly cover his face in an attempt to remain incognito. Shouse stands abruptly, but Red swiftly pulls him back down into his seat, ensuring discretion. Feeling uneasy, Homer looks away nervously, his eyes darting around the theater. Dillinger sits with a worried expression on his face, his head tilted downward in contemplation. Just then, the overhead light suddenly switches on, casting an illuminating glow on the faces of the audience members. Those in the audience turn their heads, peering curiously at the people seated to their right. The audience turns once more, their curiosity unabated. As the audience members eventually settle their eyes back toward the front screen, the lights gradually dim, and a new story begins to unfold. Tommy turns to face Dillinger, who rubs his lips in a thoughtful manner as he looks at Tommy, nodding in agreement. He exchanges a meaningful glance with Red, and together they rise from their seats, grabbing their coats in preparation to leave. A few rows ahead, Homer dons his hat and steps into the aisle behind them, ready to follow. As they exit the theater, Red moves closer to Dillinger, staying by his side. Outside, people mill around a bustling town square, where a stiff wind flutters the awnings of a nearby storefront. On the far side of the square, a policeman arrives on a motorcycle, pulling up with authority. Inside a bank, Baby Face stands on a table and fires his gun through a window at the approaching policeman, then directs his fire toward the ceiling, causing a commotion. Outside, Homer seizes a passerby, holding the man hostage. Inside the bank, Dillinger and Tommy exchange a look of exasperation, silently communicating their frustration. From within a vault, Dillinger tosses a bag to Tommy, efficiently coordinating their efforts. He guides the bank president by the shoulder, leading him through the chaos. A woman quickly joins the bank president, adding to the scene. The gangsters use their hostages as human shields as they make their calculated escape from the bank. They pass by Homer, who stands outside vigilantly, waiting by their getaway car with his own hostage. Baby Face continues to fire wildly into the town square, creating pandemonium. Two men dive to the ground, seeking cover from the chaos. From the safety of a window across the street, a man carefully aims his gun, ready to intervene. Dillinger suddenly lurches forward, his eyes wide with shock as he processes the unfolding events. He drops to a seated position, his gun still raised defensively, then notices Tommy, who lies motionless on his stomach in a growing pool of blood, the gravity of the situation sinking in."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the blonde man approaches, Dillinger swiftly reaches out and secures him in a firm chokehold, simultaneously raising his gun to aim directly at Gilbert. With a slight tilt of his head, Dillinger signals his intent. D'Andrea, observing the tense situation, glances at Gilbert, whose hand is poised on his own gun, ready to react. D'Andrea then shifts his attention to Dillinger and Red, assessing their next move. In a sudden motion, Dillinger releases the blonde man, tossing him aside with little effort. D'Andrea, maintaining his composure, calmly perches on the edge of a desk, exuding an air of nonchalance. Dillinger, having holstered his gun, furrows his brow in deep thought before locking eyes with D'Andrea. In response, D'Andrea offers a noncommittal shrug, prompting Dillinger to glare at him, his lips forming a displeased frown. The mustached gangster leans in closer, scrutinizing the exchange. Dillinger, with a slight tilt of his head and narrowed eyes, meets D'Andrea's gaze once more before turning away decisively. With a shared understanding, Dillinger and Red make their exit. Meanwhile, Hoover and Purvis stride purposefully down a hall. Once outside, Hoover diverges from Purvis and approaches a group of well-dressed boys arranged in two neat lines, extending his hand for a firm handshake. Turning to face the press, Hoover presents a composed demeanor. In a movie theatre, the unfolding event is captured on a newsreel, drawing the audience's attention. Dillinger engages in conversation with the rugged gangster, nodding subtly at Shouse. As a photo of Dillinger appears onscreen, he discreetly shields his face from view. Shouse attempts to stand, but Red quickly pulls him back into his seat. Homer, feeling the tension, averts his gaze nervously. Dillinger, seated with a worried expression and his face angled downward, is illuminated by the overhead light, which casts a glow on the audience members' faces. The audience collectively turns, scrutinizing the individuals to their right, then shifts their focus again. As they settle their eyes back toward the front, the lights gradually dim, signaling the start of a new story. Tommy turns his attention to Dillinger, who thoughtfully rubs his lips while nodding at Tommy. Exchanging a knowing glance with Red, they both rise, gathering their coats in preparation to leave. A few rows ahead, Homer dons his hat and steps into the aisle, trailing behind them. As they exit the theater, Red instinctively moves closer to Dillinger, ensuring their safety. Outside, people bustle around a lively town square, where a brisk wind flutters the awnings of a nearby storefront. On the opposite side of the square, a policeman arrives on a motorcycle, ready to maintain order. Inside a bank, Baby Face stands atop a table, firing his gun through a window at the approaching policeman, then directing his shots toward the ceiling to assert control. Outside, Homer seizes a man, holding him hostage to deter interference. Inside, Dillinger and Tommy exchange a look of exasperation, silently communicating their shared frustration. From within the vault, Dillinger tosses a bag to Tommy, who catches it deftly. Dillinger then guides the bank president by the shoulder, ensuring compliance, as a woman joins the bank president, adding to the group of hostages. The gangsters strategically use the hostages as shields while making their way out of the bank, passing by Homer, who stands guard by their car with his own hostage. Baby Face continues to fire indiscriminately into the town square, causing two men to dive to the ground for cover. From a window across the street, a man takes aim with his gun, ready to intervene. Dillinger, sensing the danger, lurches forward with wide eyes, then drops to a seated position, his gun still raised in defense. It is then that he notices Tommy lying on his stomach in a pool of blood, the grim reality of the situation sinking in."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As the blonde man approaches, Dillinger seizes him in a chokehold and threatens Gilbert with a gun. D'Andrea observes the situation, glancing between Gilbert and Dillinger, before sitting calmly on a desk. Dillinger releases the blonde man, holsters his gun, and exchanges a tense look with D'Andrea, who responds with a shrug. After a brief, intense exchange of glances, Dillinger and Red leave the scene.\n\nMeanwhile, Hoover and Purvis walk down a hall. Outside, Hoover greets a group of well-dressed boys, shaking hands before facing the press. In a movie theater, a newsreel shows the event. Dillinger converses with a rugged gangster and nods at Shouse. As a photo of Dillinger appears onscreen, he discreetly covers his face. Shouse attempts to stand, but Red pulls him back into his seat. Homer looks away nervously. As Dillinger sits with a worried expression, the lights come on, prompting the audience to glance around before refocusing on the screen as the lights dim and a new story begins. Tommy turns to Dillinger, who nods thoughtfully, exchanges a glance with Red, and they both rise, grabbing their coats. Homer follows them out of the theater, putting on his hat as he steps into the aisle.\n\nOutside, people gather in a town square as a stiff wind flutters storefront awnings. A policeman arrives on a motorcycle. Inside a bank, Baby Face fires his gun through a window at the policeman and then at the ceiling. Outside, Homer takes a man hostage. Inside, Dillinger and Tommy share an exasperated look before Dillinger tosses a bag to Tommy and guides the bank president, joined by a woman, out of the bank. The gangsters use the hostages as shields while exiting, passing Homer, who waits by their car with his own hostage. Baby Face fires wildly into the square, causing two men to dive for cover. From a window across the street, a man aims a gun. Dillinger, eyes wide, lurches forward and drops to a seated position, gun still raised, then notices Tommy lying in a pool of blood."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "As the blonde man, who seems unfamiliar to the bustling streets of Chicago in the 1930s, draws closer, Dillinger, the infamous bank robber, grabs him in a chokehold and aims a gun at Gilbert, a known associate of Dillinger’s gang. He cocks his head, considering his next move. D'Andrea, a local criminal with a notorious reputation, looks at Gilbert whose hand rests on his gun, fingers twitching with anticipation. He turns to Dillinger and Red, another trusted gang member notorious for his hot temper. Dillinger, known for his quick decisions, tosses the blonde man away. D'Andrea sits calmly on the edge of a desk, a common fixture in clandestine meetings of the era. Dillinger holsters his gun with a practiced motion. Dillinger knits his brow thoughtfully then meets D'Andrea's gaze, conveying silent questions and decisions. D'Andrea shrugs, displaying his usual nonchalance in tense situations. Dillinger glares at D'Andrea, his lips curved into a frown, aware of the unspoken tension. The mustached gangster, a frequent face in the underground realm, leans in closer. Dillinger tilts his head, his eyes narrowing as he meets D'Andrea's gaze, assessing the dynamics of trust and betrayal. He turns away, making a swift decision. Dillinger and Red exit, their departure signaling the end of the confrontation.\n\nNow, Hoover, the director of the newly established FBI, and Purvis, a renowned agent known for pursuing Dillinger, walk down a hall, their footsteps echoing the weight of their mission. Outside, Hoover turns from Purvis and heads over to a group of well-dressed boys standing in two lines, part of a public relations effort to boost the FBI's image. They shake hands, a show of unity and strength. Hoover faces the press, his demeanor authoritative, ready to speak on the latest developments. In a movie theatre, the event plays on a newsreel, a popular medium for news dissemination during the Great Depression. Dillinger talks to the rugged gangster, discussing plans and potential risks. Dillinger nods his head at Shouse, another confidante well-entrenched in the criminal underworld. A photo of Dillinger appears onscreen, capturing his infamy. Dillinger subtly covers his face, wary of recognition despite his celebrity status among criminals. Shouse stands and Red yanks him back into his seat, indicating the need for discretion. Homer, another member of the gang, looks away nervously, aware of the mounting pressure. As Dillinger sits with a worried look, his face tilted down, the overhead light turns on, bathing the audience member's faces in an unwelcome spotlight. The audience turns, peering at the people to the right, curious and suspicious. The audience turns again, scanning for any sign of trouble. As the audience members settle their eyes back toward the front, the lights fade down and a new story begins on the screen, shifting focus from the real-life drama.\n\nTommy turns to Dillinger, a trusted ally amidst the chaos. Dillinger rubs his lips thoughtfully as he looks at Tommy and nods, communicating through brief gestures. He exchanges a glance with Red and they rise, grabbing their coats, ready to move as one. A few rows ahead, Homer puts on his hat and steps into the aisle behind them, poised to follow their lead. As they exit the theater, Red moves closer to Dillinger, shielding him with an unspoken promise of protection. People mill around a town square, a central hub in many American towns. A stiff wind flutters the awnings of a storefront, adding a sense of urgency to the scene. On the far side of the square, a policeman pulls up on a motorcycle, drawn by the commotion. Inside a bank, Baby Face, another infamous gangster known for his volatile temper, stands on a table and fires his gun through a window at the policeman, escalating the situation. He fires at the ceiling, signaling chaos and control. Outside, Homer grabs a man and holds him hostage, a strategy to deter the police. Inside, Dillinger and Tommy exchange an exasperated look, aware of the unfolding mayhem. From inside a vault, Dillinger tosses a bag to Tommy, filled with stolen money, the fruits of their risky endeavor. He guides the bank president by the shoulder, ensuring compliance. A woman joins the bank president, fear evident in her eyes. The gangsters shield themselves with the hostages as they exit the bank, a common tactic to ensure safe passage. They pass Homer, who waits outside by their car with his own hostage, ready to escape. Baby Face fires wildly into the town square, an act of intimidation. Two men dive to the ground, seeking safety. From a window across the street, a man aims a gun, perhaps a vigilante or an undercover cop. Dillinger lurches forward, his eyes wide, sensing danger. He drops to a seated position, his gun still raised, then notices Tommy who lies on his stomach in a pool of blood, a stark reminder of the life-and-death stakes in their line of work."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "As the blonde man draws closer Dillinger grabs him in a chokehold and aims a gun at Gilbert  He cocks his head  D'Andrea looks at Gilbert whose hand rests on his gun  He turns to Dillinger and Red  Dillinger tosses the blonde man away  D'Andrea sits calmly on the edge of a desk Dillinger holsters his gun  Dillinger knits his brow thoughtfully then meets D'Andrea's gaze  Dillinger nods his head at Shouse  A photo of Dillinger appears onscreen  Dillinger subtly covers his face  Shouse stands and Red yanks him back into his seat  Homer looks away nervously  As Dillinger sits with a worried look his face tilted down the overhead light turns on bathing the audience member's faces  The audience turns peering at the people to the right  The audience turns again  As the audience members settle their eyes back toward the front the lights fade down and a new story begins  Tommy turns to Dillinger  Dillinger rubs his lips thoughtfully as he looks at Tommy and nods  He exchanges a glance with Red and they rise grabbing their coats  A few rows ahead  Homer puts on his hat and steps into the aisle behind them  As they exit the theater Red moves closer to Dillinger  People mill around a town square  A stiff wind flutters the awnings of a storefront  On the far side of the square a policeman pulls up on a motorcycle  Inside a bank  Baby Face stands on a table and fires his gun through a window at the policeman  He fires at the ceiling  Outside Homer grabs a man and holds him hostage  Inside  Dillinger and Tommy exchange an exasperated look  From inside a vault Dillinger tosses a bag to Tommy  He guides the bank president by the shoulder  A woman joins the bank president  The gangsters shield themselves with the hostages as they exit the bank  D'Andrea shrugs  Dillinger glares at D'Andrea his lips curved into a frown  The mustached gangster leans in closer  Dillinger tilts his head his eyes narrowing as he meets D'Andrea's gaze  He turns away  Dillinger and Red exit  Now Hoover and Purvis walk down a hall  Outside  Hoover turns from Purvis and heads over to a group of welldressed boys standing in two lines  They shake hands  Hoover faces the press  In a movie theatre the event plays on a newsreel  Dillinger talks to the rugged gangster  Dillinger nods his head at Shouse  A photo of Dillinger appears onscreen  Dillinger subtly covers his face  Shouse stands and Red yanks him back into his seat  Homer looks away nervously  As Dillinger sits with a worried look his face tilted down the overhead light turns on bathing the audience member's faces  The audience turns peering at the people to the right  The audience turns again  As the audience members settle their eyes back toward the front the lights fade down and a new story begins  Tommy turns to Dillinger  Dillinger rubs his lips thoughtfully as he looks at Tommy and nods  He exchanges a glance with Red and they rise grabbing their coats  A few rows ahead  Homer puts on his hat and steps into the aisle behind them  As they exit the theater Red moves closer to Dillinger  People mill around a town square  A stiff wind flutters the awnings of a storefront  On the far side of the square a policeman pulls up on a motorcycle  Inside a bank  Baby Face stands on a table and fires his gun through a window at the policeman  He fires at the ceiling  Outside Homer grabs a man and holds him hostage  Inside  Dillinger and Tommy exchange an exasperated look  From inside a vault Dillinger tosses a bag to Tommy  He guides the bank president by the shoulder  A woman joins the bank president  The gangsters shield themselves with the hostages as they exit the bank  They pass Homer who waits outside by their car with his own hostage  Baby Face fires wildly into the town square  Two men dive to the ground  From a window across the street a man aims a gun  Dillinger lurches forward his eyes wide  He drops to a seated position his gun still raised  then notices Tommy who lies on his stomach in a pool of blood"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "As the blonde man draws closer Dillinger grabs him in a chokehold and aims a gun at Gilbert. He cocks his head. D'Andrea looks at Gilbert whose hand rests on his gun. He turns to Dillinger and Red. Dillinger tosses the blonde man away. D'Andrea sits calmly on the edge of a desk Dillinger holsters his gun. Dillinger knits his brow thoughtfully then meets D'Andrea's gaze. D'Andrea shrugs. Dillinger glares at D'Andrea his lips curved into a frown. The mustached gangster leans in closer. Dillinger tilts his head his eyes narrowing as he meets D'Andrea's gaze. He turns away. Dillinger and Red exit. Now Hoover and Purvis walk down a hall. Outside. Hoover turns from Purvis and heads over to a group of welldressed boys standing in two lines. They shake hands. Hoover faces the press. In a movie theatre the event plays on a newsreel. Dillinger talks to the rugged gangster. Dillinger nods his head at Shouse. A photo of Dillinger appears onscreen. Dillinger subtly covers his face. Shouse stands and Red yanks him back into his seat. Homer looks away nervously. As Dillinger sits with a worried look his face tilted down the overhead light turns on bathing the audience member's faces. The audience turns peering at the people to the right. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. The audience turns again. As the audience members settle their eyes back toward the front the lights fade down and a new story begins. Tommy turns to Dillinger. Dillinger rubs his lips thoughtfully as he looks at Tommy and nods. He exchanges a glance with Red and they rise grabbing their coats. A few rows ahead. Homer puts on his hat and steps into the aisle behind them. As they exit the theater Red moves closer to Dillinger. People mill around a town square. A stiff wind flutters the awnings of a storefront. On the far side of the square a policeman pulls up on a motorcycle. Inside a bank. Baby Face stands on a table and fires his gun through a window at the policeman. He fires at the ceiling. Outside Homer grabs a man and holds him hostage. Inside. Dillinger and Tommy exchange an exasperated look. From inside a vault Dillinger tosses a bag to Tommy. He guides the bank president by the shoulder. A woman joins the bank president. The gangsters shield themselves with the hostages as they exit the bank. They pass Homer who waits outside by their car with his own hostage. Baby Face fires wildly into the town square. Two men dive to the ground. From a window across the street a man aims a gun. Dillinger lurches forward his eyes wide. He drops to a seated position his gun still raised. then notices Tommy who lies on his stomach in a pool of blood."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "As the blonde man draws closer Dillinger grabs him in a chokehold and aims a gun at Gilbert. He cocks his head. D'Andrea looks at Gilbert whose hand rests on his gun. He turns to Dillinger and Red. Dillinger tosses the blonde man away. D'Andrea sits calmly on the edge of a desk Dillinger holsters his gun. Dillinger knits his brow thoughtfully then meets D'Andrea's gaze. D'Andrea shrugs. Dillinger glares at D'Andrea his lips curved into a frown. The mustached gangster leans in closer. Dillinger tilts his head his eyes narrowing as he meets D'Andrea's gaze. He turns away. Dillinger and Red exit. Now Hoover and Purvis walk down a hall. Outside. Hoover turns from Purvis and heads over to a group of welldressed boys standing in two lines. They shake hands. Hoover faces the press. In a movie theatre the event plays on a newsreel. Dillinger talks to the rugged gangster. Dillinger nods his head at Shouse. A photo of Dillinger appears onscreen. Dillinger subtly covers his face. Shouse stands and Red yanks him back into his seat. Homer looks away nervously. As Dillinger sits with a worried look his face tilted down the overhead light turns on bathing the audience member's faces. The audience turns peering at the people to the right. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. The audience turns again. As the audience members settle their eyes back toward the front the lights fade down and a new story begins. Tommy turns to Dillinger. Dillinger rubs his lips thoughtfully as he looks at Tommy and nods. He exchanges a glance with Red and they rise grabbing their coats. A few rows ahead. Homer puts on his hat and steps into the aisle behind them. As they exit the theater Red moves closer to Dillinger. People mill around a town square. A stiff wind flutters the awnings of a storefront. On the far side of the square a policeman pulls up on a motorcycle. Inside a bank. Baby Face stands on a table and fires his gun through a window at the policeman. He fires at the ceiling. Outside Homer grabs a man and holds him hostage. Inside. Dillinger and Tommy exchange an exasperated look. From inside a vault Dillinger tosses a bag to Tommy. He guides the bank president by the shoulder. A woman joins the bank president. The gangsters shield themselves with the hostages as they exit the bank. They pass Homer who waits outside by their car with his own hostage. Baby Face fires wildly into the town square. Two men dive to the ground. From a window across the street a man aims a gun. Dillinger lurches forward his eyes wide. He drops to a seated position his gun still raised. then notices Tommy who lies on his stomach in a pool of blood."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "As the blonde man draws closer Dillinger grabs him in a chokehold and aims a gun at Gilbert. He cocks his head. D'Andrea looks at Gilbert whose hand rests on his gun. He turns to Dillinger and Red. Dillinger tosses the blonde man away. D'Andrea sits calmly on the edge of a desk Dillinger holsters his gun. Dillinger knits his brow thoughtfully then meets D'Andrea's gaze. D'Andrea shrugs. Dillinger glares at D'Andrea his lips curved into a frown. The mustached gangster leans in closer. Dillinger tilts his head his eyes narrowing as he meets D'Andrea's gaze. He turns away. Dillinger and Red exit. Now Hoover and Purvis walk down a hall. Outside Homer grabs a man and holds him hostage. Inside. Dillinger and Tommy exchange an exasperated look. From inside a vault Dillinger tosses a bag to Tommy. He guides the bank president by the shoulder. A woman joins the bank president. The gangsters shield themselves with the hostages as they exit the bank. They pass Homer who waits outside by their car with his own hostage. Baby Face fires wildly into the town square. Two men dive to the ground. From a window across the street a man aims a gun. Dillinger lurches forward his eyes wide. He drops to a seated position his gun still raised. then notices Tommy who lies on his stomach in a pool of blood."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "As the blonde man draws closer Dillinger grabs him in a chokehold and aims a gun at Gilbert. He cocks his head. D'Andrea looks at Gilbert whose hand rests on his gun. He turns to Dillinger and Red. Dillinger tosses the blonde man away. Baby Face fires wildly into the town square. Two men dive to the ground. From a window across the street a man aims a gun. Dillinger lurches forward his eyes wide. He drops to a seated position his gun still raised. then notices Tommy who lies on his stomach in a pool of blood."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "As the blonde man draws closer, the raccoon grabs him in a chokehold and aims a gun at the giraffe. The raccoon cocks his head. The flamingo looks at the giraffe whose hand rests on his gun. The flamingo turns to the raccoon and the kangaroo. The raccoon tosses the blonde man away. The flamingo sits calmly on the edge of a desk. The raccoon holsters his gun. The raccoon knits his brow thoughtfully then meets the flamingo's gaze. The flamingo shrugs. The raccoon glares at the flamingo, his lips curved into a frown. The kangaroo leans in closer. The raccoon tilts his head, his eyes narrowing as he meets the flamingo's gaze. The raccoon turns away. The raccoon and the kangaroo exit. Now, the penguin and the ostrich walk down a hall. Outside, the penguin turns from the ostrich and heads over to a group of well-dressed turtles standing in two lines. They shake hands. The penguin faces the press. In a movie theatre, the event plays on a newsreel. The raccoon talks to the rugged owl. The raccoon nods his head at the squirrel. A photo of the raccoon appears onscreen. The raccoon subtly covers his face. The squirrel stands and the kangaroo yanks him back into his seat. The dolphin looks away nervously. As the raccoon sits with a worried look, his face tilted down, the overhead light turns on, bathing the audience member's faces. The audience turns, peering at the people to the right. The audience turns again. As the audience members settle their eyes back toward the front, the lights fade down and a new story begins. The chipmunk turns to the raccoon. The raccoon rubs his lips thoughtfully as he looks at the chipmunk and nods. The raccoon exchanges a glance with the kangaroo and they rise, grabbing their coats. A few rows ahead, the dolphin puts on his hat and steps into the aisle behind them. As they exit the theater, the kangaroo moves closer to the raccoon. Animals mill around a town square. A stiff wind flutters the awnings of a storefront. On the far side of the square, a pelican pulls up on a motorcycle. Inside a bank, the fox stands on a table and fires his gun through a window at the pelican. The fox fires at the ceiling. Outside, the dolphin grabs a man and holds him hostage. Inside, the raccoon and the chipmunk exchange an exasperated look. From inside a vault, the raccoon tosses a bag to the chipmunk. The raccoon guides the bank president by the shoulder. A woman joins the bank president. The bunnies shield themselves with the hostages as they exit the bank. They pass the dolphin, who waits outside by their car with his own hostage. The fox fires wildly into the town square. Two men dive to the ground. From a window across the street, a bear aims a gun. The raccoon lurches forward, his eyes wide. The raccoon drops to a seated position, his gun still raised, then notices the chipmunk who lies on his stomach in a pool of blood."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "As the blonde man draws closer, Dillinger grabs him in a headlock and aims a slingshot at Gilbert. He cocks his head. D'Andrea looks at Gilbert whose hand rests on his slingshot. He turns to Dillinger and Red. Dillinger tosses the blonde man away. D'Andrea sits calmly on the edge of a piano. Dillinger holsters his slingshot. Dillinger knits his brow thoughtfully then meets D'Andrea's gaze. D'Andrea shrugs. Dillinger glares at D'Andrea, his lips curved into a frown. The mustached gangster leans in closer. Dillinger tilts his head, his eyes narrowing as he meets D'Andrea's gaze. He turns away. Dillinger and Red exit. Now, Hoover and Purvis walk down a corridor. Outside, Hoover turns from Purvis and heads over to a group of well-dressed girls standing in two lines. They shake hands. Hoover faces the photographers. In a concert hall, the event plays on a newsreel. Dillinger talks to the rugged gangster. Dillinger nods his head at Shouse. A portrait of Dillinger appears onscreen. Dillinger subtly covers his face. Shouse stands and Red yanks him back into his seat. Homer looks away nervously. As Dillinger sits with a worried look, his face tilted down, the overhead fan turns on, bathing the audience member's faces. The audience turns, peering at the people to the right. The audience turns again. As the audience members settle their eyes back toward the front, the lights fade down and a new story begins. Tommy turns to Dillinger. Dillinger rubs his chin thoughtfully as he looks at Tommy and nods. He exchanges a glance with Red and they rise, grabbing their scarves. A few rows ahead, Homer puts on his cap and steps into the aisle behind them. As they exit the hall, Red moves closer to Dillinger. People mill around a park. A stiff breeze flutters the curtains of a cafe. On the far side of the park, a policeman pulls up on a bicycle. Inside a bakery, Baby Face stands on a stool and fires his slingshot through a window at the policeman. He fires at the ceiling. Outside, Homer grabs a woman and holds her hostage. Inside, Dillinger and Tommy exchange an exasperated look. From inside a safe, Dillinger tosses a box to Tommy. He guides the bakery owner by the shoulder. A child joins the bakery owner. The gangsters shield themselves with the hostages as they exit the bakery. They pass Homer, who waits outside by their van with his own hostage. Baby Face fires wildly into the park. Two women dive to the ground. From a window across the street, a woman aims a slingshot. Dillinger lurches forward, his eyes wide. He drops to a seated position, his slingshot still raised, then notices Tommy who lies on his stomach in a puddle of water."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "As the blonde man inches away, Dillinger pats him on the back and waves a gun at Gilbert. He tilts his head. D'Andrea glances at Gilbert whose hand taps on his gun. He nods to Dillinger and Red. Dillinger nudges the blonde man aside. D'Andrea lounges comfortably on the edge of a desk. Dillinger tucks away his gun. Dillinger scratches his head thoughtfully then avoids D'Andrea's gaze. D'Andrea sighs. Dillinger smiles at D'Andrea, his lips curved into a grin. The mustached gangster steps back. Dillinger shakes his head, his eyes softening as he avoids D'Andrea's gaze. He stays put. Dillinger and Red remain. Now, Hoover and Purvis stroll through a garden. Outside, Hoover turns from Purvis and gestures over to a group of well-dressed boys standing in two lines. They nod heads. Hoover waves at the press. In a movie theatre, the event plays on a newsreel. Dillinger jokes with the rugged gangster. Dillinger tilts his head at Shouse. A photo of Dillinger appears onscreen. Dillinger gently strokes his face. Shouse stands and Red eases him back into his seat. Homer glances away nervously. As Dillinger stands with a relaxed look, his face tilted up, the overhead light dims, shadowing the audience member's faces. The audience spins, glancing at the people to the left. The audience spins again. As the audience members settle their eyes back toward the front, the lights brighten up and a new scene begins. Tommy gestures to Dillinger. Dillinger taps his lips thoughtfully as he looks at Tommy and shakes his head. He shares a nod with Red and they sit down, adjusting their coats. A few rows ahead, Homer takes off his hat and steps into the aisle in front of them. As they remain in the theater, Red relaxes near Dillinger. People wander idly in a town square. A gentle breeze ripples the awnings of a storefront. On the far side of the square, a policeman walks up on foot. Inside a bank, Baby Face sits on a table and throws his gun through a window at the policeman. He points at the ceiling. Outside, Homer shakes hands with a man and befriends him. Inside, Dillinger and Tommy exchange a contented look. From inside a vault, Dillinger hands a bag to Tommy. He reassures the bank president with a nod. A woman waves to the bank president. The gangsters accompany the hostages as they remain in the bank. They nod at Homer, who stands outside by their car with his own acquaintance. Baby Face waves cheerfully into the town square. Two men leap to the ground. From a window across the street, a man waves a flag. Dillinger steps back, his eyes softening. He rises to a standing position, his gun still lowered, then notices Tommy who rests on his stomach in a pool of light."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "As the gray-haired woman draws closer, Lancaster grabs her in a chokehold and aims a broom at Foster. She cocks her head. Malone looks at Foster whose foot rests on her broom. She turns to Lancaster and Green. Lancaster tosses the gray-haired woman away. Malone sits calmly on the edge of a ladder. Lancaster holsters her broom. Lancaster knits her brow thoughtfully then meets Malone's gaze. Malone shrugs. Lancaster glares at Malone, her lips curved into a frown. The bespectacled chef leans in closer. Lancaster tilts her head, her eyes narrowing as she meets Malone's gaze. She turns away. Lancaster and Green exit. Now, Edison and Morrow walk down a tunnel. Outside, Edison turns from Morrow and heads over to a group of shabby dogs standing in two rows. They shake tails. Edison faces the orchestra. In a lecture hall, the incident plays on a chalkboard. Lancaster talks to the polished chef. Lancaster nods her head at Wheeler. A sketch of Lancaster appears onscreen. Lancaster subtly covers her forehead. Wheeler stands and Green yanks her back into her spot. Lowell looks away nervously. As Lancaster sits with a worried look, her head tilted down, the overhead fan turns on, bathing the audience member's hands. The audience turns, peering at the chairs to the left. The audience turns again. As the audience members settle their eyes back toward the back, the fan fades down and a new lecture begins. Kirby turns to Lancaster. Lancaster rubs her chin thoughtfully as she looks at Kirby and nods. She exchanges a glance with Green and they rise, grabbing their scarves. A few rows ahead, Lowell puts on her cap and steps into the corridor behind them. As they exit the hall, Green moves closer to Lancaster. People mill around a city park. A gentle breeze flutters the curtains of a window. On the near side of the park, a firefighter pulls up on a bicycle. Inside a library, Sunshine stands on a bench and throws her hat through a door at the firefighter. She throws at the window. Outside, Lowell grabs a woman and holds her captive. Inside, Lancaster and Kirby exchange an exasperated look. From inside a locker, Lancaster tosses a book to Kirby. She guides the library assistant by the elbow. A child joins the library assistant. The chefs shield themselves with the captives as they exit the library. They pass Lowell, who waits outside by their van with her own captive. Sunshine throws wildly into the city park. Two women dive to the ground. From a roof across the street, a woman aims a broom. Lancaster lurches forward, her eyes wide. She drops to a seated position, her broom still raised, then notices Kirby who lies on her stomach in a pool of ink."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "As the tall woman approaches, Reynolds lifts her in a bear hug and points a camera at Smith. She tilts her chin. Maxwell peers at Smith whose finger taps on his phone. He glances at Reynolds and Blue. Reynolds nudges the tall woman aside. Maxwell lounges comfortably on the top of a crate. Reynolds stores his camera. Reynolds scratches his chin thoughtfully, then locks eyes with Maxwell. Maxwell shrugs. Reynolds squints at Maxwell, his lips forming a scowl. The bearded thief inches in closer. Reynolds tilts his head, his eyes narrowing as he locks eyes with Maxwell. He turns away. Reynolds and Blue leave. Now, Hoover and Purvis stroll through a corridor. Outside, Hoover separates from Purvis and approaches a group of elegantly dressed girls standing in two lines. They exchange greetings. Hoover addresses the spectators. In a theater, the scene unfolds on a newsreel. Reynolds converses with the scruffy burglar. Reynolds nods his head at Simpson. A picture of Reynolds appears onscreen. Reynolds discreetly shields his visage. Simpson rises and Blue pulls him back into his chair. Charlie looks away uneasily. As Reynolds sits with a concerned expression, his face angled downward, the overhead light illuminates, casting light on the audience's faces. The audience glances over at the individuals to the left. The audience glances again. As the audience members settle their eyes back toward the screen, the lights dim and a new scene unfolds. Billy turns to Reynolds. Reynolds massages his chin thoughtfully as he gazes at Billy and nods. He shares a look with Blue and they stand, pulling on their jackets. A few seats ahead, Charlie dons his cap and steps into the aisle behind them. As they depart the cinema, Blue moves nearer to Reynolds. People meander around a park. A strong breeze flaps the banners of a kiosk. On the far side of the park, a fireman pulls up on a bicycle. Inside a shop, Baby Face perches on a counter and fires his water gun through a window at the fireman. He sprays at the lights. Outside, Charlie grabs a woman and grips her as leverage. Inside, Reynolds and Billy trade an irritated glance. From inside a closet, Reynolds tosses a sack to Billy. He guides the shop manager by the elbow. A child joins the shop manager. The burglars shield themselves with the hostages as they leave the shop. They pass Charlie, who waits outside by their bicycle with his own hostage. Baby Face sprays indiscriminately into the park. Two women dive toward the ground. From a window across the path, a woman wields a water balloon. Reynolds charges forward, his eyes wide. He drops to a crouching position, his camera still aimed, then notices Billy who lies on his side in a puddle of paint."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "As the blonde man approaches, Dillinger envelops him in a bear hug and points a stick at Gilbert. He tilts his shoulder. D'Andrea glances at Gilbert whose hand sits atop his knife. He swivels to face Dillinger and Red. Dillinger flings the blonde man aside. D'Andrea reclines casually on the rim of a chair. Dillinger pockets his stick. Dillinger furrows his forehead pensively then locks eyes with D'Andrea. D'Andrea raises an eyebrow. Dillinger scowls at D'Andrea, his lips curling into a pout. The mustached gangster edges in nearer. Dillinger swivels his head, his eyes squinting as he locks eyes with D'Andrea. He spins around. Dillinger and Red retreat. Now, Hoover and Purvis amble down a corridor. Outside, Hoover pivots from Purvis and strolls over to a cluster of well-dressed girls standing in two circles. They exchange salutes. Hoover confronts the reporters. In a playhouse, the occasion unfolds on a slideshow. Dillinger whispers to the scruffy gangster. Dillinger bobs his head at Shouse. A snapshot of Dillinger flashes onscreen. Dillinger subtly shields his profile. Shouse rises and Red pulls him back into his spot. Homer gazes away anxiously. As Dillinger lounges with a tense expression, his face angled downward, the overhead lamp switches off, immersing the audience member's faces in shadow. The audience rotates, squinting at the people to the left. The audience rotates once more. As the audience members direct their eyes back toward the stage, the shadows lift and a new tale unfolds. Tommy glances at Dillinger. Dillinger taps his chin thoughtfully as he gazes at Tommy and winks. He trades a look with Red and they stand, grabbing their hats. A few rows ahead, Homer adjusts his coat and slips into the aisle alongside them. As they leave the playhouse, Red shifts nearer to Dillinger. People amble around a village green. A gentle breeze ruffles the flags of a kiosk. On the opposite side of the green, a fireman coasts up on a bicycle. Inside a diner, Baby Face perches on a counter and waves his hat through a door at the fireman. He swings it at the wall. Outside, Homer embraces a woman and hugs her tightly. Inside, Dillinger and Tommy swap a resigned glance. From inside a cabinet, Dillinger flings a book to Tommy. He steers the cook by the arm. A man joins the cook. The gangsters cloak themselves with the women as they leave the diner. They pass Homer, who stands outside by their wagon with his own woman. Baby Face waves fervently into the village green. Two women huddle to the pavement. From a doorway across the street, a man brandishes a bat. Dillinger stumbles backward, his eyes wide. He collapses to a kneeling position, his bat still lifted, then notices Tommy who sprawls on his side in a puddle of ink."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "As the tall lady drifts farther, Jenkins hugs her in a bearhug and directs a flashlight at Ronald. She shakes her foot. Marisol stares at Ronald whose hat sits in his pocket. She glances at Jenkins and Green. Jenkins flings the tall lady afar. Marisol reclines patiently on the rim of a bench. Jenkins slips his flashlight. Jenkins combs his hair absentmindedly then catches Marisol's glance. Marisol yawns. Jenkins squints at Marisol, his eyes etched into a scowl. The bearded pilot bends in farther. Jenkins spins his shoe, his shoulders tightening as he catches Marisol's glance. She spins around. Jenkins and Green depart. Now, Langston and Wilmer stroll along a street. Inside, Langston spins from Wilmer and sways over to a crowd of neatly dressed girls lingering in two groups. They nod heads. Langston greets the audience. In a nightclub, the scene unfolds on a slideshow. Jenkins whispers to the clean-shaven pilot. Jenkins tilts his nose at Fresco. A sketch of Jenkins appears onscreen. Jenkins subtly masks his hair. Fresco sits and Green nudges him up from his chair. Henry looks yonder anxiously. As Jenkins stands with a hopeful expression, his hands tilted outward, the overhead fan spins on, lighting the visitor's hands. The visitor glances, squinting at the ceiling to the left. The visitor glances again. As the visitor bows their heads back toward the back, the fans glow up and a fresh tale unfolds. Jerry reverses to Jenkins. Jenkins pats his nose thoughtfully as he stares at Jerry and nods. He exchanges a whisper with Green and they leap, fastening their hats. A few aisles back, Henry adjusts his scarf and lunges into the row in front of them. As they flee the concert hall, Green swings alongside Jenkins. People stroll around an open field. A gentle breeze dances the flags of an office. On the near edge of the field, a mayor zooms up on a scooter. Inside a shop, Tiny stands on a chair and waves his shoe through a curtain at the mayor. He waves at the floor. Outside, Henry shakes a woman and hugs her enemy. Inside, Jenkins and Jerry trade a bored glance. From inside a locker, Jenkins flings a package to Jerry. He guides the shopkeeper by the elbow. A child follows the shopkeeper. The sailors shield themselves with the civilians as they leave the shop. They cross Henry, who paces inside by their scooter with his own civilian. Tiny waves frantically into the open field. Two women leap to their feet. From a rooftop across the park, a lady waves a flashlight. Jenkins crawls backward, his ears closed. He jumps to a lying position, his shoe still lowered, then spots Jerry who stands on his knees in a lake of ink."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Dillinger, in a tense standoff, releases a blonde man and holsters his gun after assessing D'Andrea. Later, Hoover meets with a group of boys and faces the press, an event shown in a newsreel at a theater. Dillinger, cautious after seeing his photo onscreen, discreetly covers his face. As the lights dim, he and Red leave the theater with Tommy. Outside, a stiff wind blows near a store as Baby Face shoots at a policeman from a bank window. Inside the bank, Dillinger and Tommy exchange looks before Dillinger throws a bag to Tommy and leads the bank president out, using hostages for cover. As they exit, Baby Face fires wildly, and Dillinger, lurching forward, discovers Tommy lying in a pool of blood."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "then notices Tommy who lies on his stomach in a pool of blood He drops to a seated position his gun still raised  Dillinger lurches forward his eyes wide  From a window across the street a man aims a gun  Two men dive to the ground  Baby Face fires wildly into the town square  They pass Homer who waits outside by their car with his own hostage  The gangsters shield themselves with the hostages as they exit the bank  A woman joins the bank president  He guides the bank president by the shoulder  From inside a vault Dillinger tosses a bag to Tommy  Dillinger and Tommy exchange an exasperated look  Inside  Outside Homer grabs a man and holds him hostage  He fires at the ceiling  Baby Face stands on a table and fires his gun through a window at the policeman  Inside a bank  On the far side of the square a policeman pulls up on a motorcycle  A stiff wind flutters the awnings of a storefront  People mill around a town square  As they exit the theater Red moves closer to Dillinger  Homer puts on his hat and steps into the aisle behind them  A few rows ahead  He exchanges a glance with Red and they rise grabbing their coats  Dillinger rubs his lips thoughtfully as he looks at Tommy and nods  Tommy turns to Dillinger  As the audience members settle their eyes back toward the front the lights fade down and a new story begins  The audience turns again  The audience turns peering at the people to the right  As Dillinger sits with a worried look his face tilted down the overhead light turns on bathing the audience member's faces  Homer looks away nervously  Shouse stands and Red yanks him back into his seat  Dillinger subtly covers his face  A photo of Dillinger appears onscreen  Dillinger nods his head at Shouse  Dillinger talks to the rugged gangster  In a movie theatre the event plays on a newsreel  Hoover faces the press  They shake hands  Hoover turns from Purvis and heads over to a group of welldressed boys standing in two lines  Outside  Now Hoover and Purvis walk down a hall  Dillinger and Red exit  He turns away  Dillinger tilts his head his eyes narrowing as he meets D'Andrea's gaze  The mustached gangster leans in closer  Dillinger glares at D'Andrea his lips curved into a frown  D'Andrea shrugs  Dillinger knits his brow thoughtfully then meets D'Andrea's gaze  D'Andrea sits calmly on the edge of a desk Dillinger holsters his gun  Dillinger tosses the blonde man away  He turns to Dillinger and Red  D'Andrea looks at Gilbert whose hand rests on his gun  He cocks his head  As the blonde man draws closer Dillinger grabs him in a chokehold and aims a gun at Gilbert "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "They pass Homer who waits outside by their car with his own hostage  As the blonde man draws closer Dillinger grabs him in a chokehold and aims a gun at Gilbert  As they exit the theater Red moves closer to Dillinger  As Dillinger sits with a worried look his face tilted down the overhead light turns on bathing the audience member's faces  The audience turns peering at the people to the right  Hoover turns from Purvis and heads over to a group of welldressed boys standing in two lines  Outside Homer grabs a man and holds him hostage  A photo of Dillinger appears onscreen  He turns away  The audience turns again  The mustached gangster leans in closer  He turns to Dillinger and Red  They shake hands  A few rows ahead  The gangsters shield themselves with the hostages as they exit the bank  Dillinger talks to the rugged gangster  Two men dive to the ground  then notices Tommy who lies on his stomach in a pool of blood He cocks his head  He exchanges a glance with Red and they rise grabbing their coats  As the audience members settle their eyes back toward the front the lights fade down and a new story begins  Dillinger rubs his lips thoughtfully as he looks at Tommy and nods  People mill around a town square  Dillinger nods his head at Shouse  Dillinger glares at D'Andrea his lips curved into a frown  From a window across the street a man aims a gun  Dillinger and Tommy exchange an exasperated look  From inside a vault Dillinger tosses a bag to Tommy  D'Andrea shrugs  Dillinger lurches forward his eyes wide  Homer puts on his hat and steps into the aisle behind them  On the far side of the square a policeman pulls up on a motorcycle  Baby Face fires wildly into the town square  He fires at the ceiling  Now Hoover and Purvis walk down a hall  Dillinger subtly covers his face  Inside a bank  Dillinger tilts his head his eyes narrowing as he meets D'Andrea's gaze  He drops to a seated position his gun still raised  Tommy turns to Dillinger  Hoover faces the press  Homer looks away nervously  Dillinger knits his brow thoughtfully then meets D'Andrea's gaze  A woman joins the bank president  D'Andrea sits calmly on the edge of a desk Dillinger holsters his gun  In a movie theatre the event plays on a newsreel  Outside  Inside  D'Andrea looks at Gilbert whose hand rests on his gun  Dillinger tosses the blonde man away  He guides the bank president by the shoulder  Dillinger and Red exit  A stiff wind flutters the awnings of a storefront  Shouse stands and Red yanks him back into his seat  Baby Face stands on a table and fires his gun through a window at the policeman "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "As the audience members settle their eyes back toward the front the lights fade down and a new story begins  Tommy turns to Dillinger  Dillinger rubs his lips thoughtfully as he looks at Tommy and nods  He exchanges a glance with Red and they rise grabbing their coats  A few rows ahead  Homer puts on his hat and steps into the aisle behind them  As they exit the theater Red moves closer to Dillinger  People mill around a town square  A stiff wind flutters the awnings of a storefront  On the far side of the square a policeman pulls up on a motorcycle  Inside a bank  Baby Face stands on a table and fires his gun through a window at the policeman  He fires at the ceiling  Outside Homer grabs a man and holds him hostage  Inside  Dillinger and Tommy exchange an exasperated look  From inside a vault Dillinger tosses a bag to Tommy  He guides the bank president by the shoulder  A woman joins the bank president  The gangsters shield themselves with the hostages as they exit the bank  They pass Homer who waits outside by their car with his own hostage  Baby Face fires wildly into the town square  Two men dive to the ground  From a window across the street a man aims a gun  Dillinger lurches forward his eyes wide  He drops to a seated position his gun still raised  then notices Tommy who lies on his stomach in a pool of blood As the blonde man draws closer Dillinger grabs him in a chokehold and aims a gun at Gilbert  He cocks his head  D'Andrea looks at Gilbert whose hand rests on his gun  He turns to Dillinger and Red  Dillinger tosses the blonde man away  D'Andrea sits calmly on the edge of a desk Dillinger holsters his gun  Dillinger knits his brow thoughtfully then meets D'Andrea's gaze  D'Andrea shrugs  Dillinger glares at D'Andrea his lips curved into a frown  The mustached gangster leans in closer  Dillinger tilts his head his eyes narrowing as he meets D'Andrea's gaze  He turns away  Dillinger and Red exit  Now Hoover and Purvis walk down a hall  Outside  Hoover turns from Purvis and heads over to a group of welldressed boys standing in two lines  They shake hands  Hoover faces the press  In a movie theatre the event plays on a newsreel  Dillinger talks to the rugged gangster  Dillinger nods his head at Shouse  A photo of Dillinger appears onscreen  Dillinger subtly covers his face  Shouse stands and Red yanks him back into his seat  Homer looks away nervously  As Dillinger sits with a worried look his face tilted down the overhead light turns on bathing the audience member's faces  The audience turns peering at the people to the right  The audience turns again "
        }
      ]
    }
  ]
}