{
  "ground_truth": "He reaches for his wallet and forces a laugh. The policeman thoughtfully pats the fifty into the bill-fold and hands it back into the car. Carl's nervous smile fades as there is a whimpering sound. The policeman hesitates and leans forward into the car, listening. Grimsrud reaches across Carl, grabs the trooper by the hair, and slams his head down onto the car door. With his free hand, Grimsrud pops the glove compartment, brings a gun out, and reaches across Carl, shooting at the back of the trooper's head. Jean screams as he releases the policeman, whose head slides out the window and whose body flops back onto the street. Carl looks out at the cop in the road, gets out, and leans down to hoist up the body. Headlights appear: an oncoming car that Grimsrud notices as the car approaches, slowing. Carl, with the trooper's body hoisted halfway up, is frozen in the headlights. The car carries the silhouettes of two occupants in front as Grimsrud slides into the driver's seat. The car accelerates, roars past, and away. Grimsrud squeals into a U-turn, the driver's door slamming shut with his spin. He takes the cigarette from his mouth and stubs it in his ashtray. Small red tail lights fishtail up ahead as Jean starts screaming in the back seat. The red tail lights ahead start to turn, and with a distant crunching sound, they disappear. The headlights now show only empty road, starting to turn the car. Grimsrud is not gaining on the tail lights, so he frowns and slows. The wrecked car's headlights shine off into a snowfield abutting the highway as Grimsrud applies brakes. Jean slides off the back seat and thumps into the leg-well. His headlights show the car up ahead off the road, crumpled around a telephone pole, having failed to hold a turn. Grimsrud sweeps his gun off the front seat, opens his door, and gets out. A young man in a down parka is limping across the snowfield, away from the wrecked car. Grimsrud strides calmly out after the injured boy, raises his gun, and fires. With a poof of feathers, a hole opens up in the boy's back, and he pitches into the snow. Grimsrud walks up to the wreck and peers in its half-open door, where a young woman is trapped inside the twisted wreckage, injured. Grimsrud raises his gun and fires. A blue-winged teal in flight over a swampy marshland. The room in which it hangs is dark, and the continuing track reveals a couple in bed, sleeping. The man, fortyish, pajama-clad, is big and big-bellied with his mouth agape. He snores while his arms are flung over a woman in her thirties, wearing a nightie, mouth also open, not snoring.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He extends for his billfold and compels a chuckle. The officer thoughtfully pats the fifty into the wallet and returns it into the automobile. Carl's uneasy grin diminishes as there is a whimpering noise. The officer pauses and leans forward into the automobile, listening. Grimsrud extends across Carl, seizes the trooper by the hair, and smashes his head down onto the automobile door. With his free hand, Grimsrud pops the glove compartment, produces a firearm out, and extends across Carl, firing at the back of the trooper's head. Jean shrieks as he releases the officer, whose head slides out the window and whose body flops back onto the roadway. Carl gazes out at the cop in the street, exits, and leans down to lift up the body. Headlights emerge: an approaching automobile that Grimsrud perceives as the automobile nears, decelerating. Carl, with the trooper's body lifted halfway up, is immobilized in the headlights. The automobile carries the outlines of two riders in front as Grimsrud slides into the operator's seat. The automobile speeds, roars past, and away. Grimsrud screeches into a U-turn, the operator's door banging shut with his spin. He takes the cigarette from his mouth and stubs it in his ashtray. Small crimson rear lights fishtail up ahead as Jean begins shrieking in the rear seat. The crimson rear lights ahead start to turn, and with a remote crunching sound, they vanish. The headlights now exhibit only vacant roadway, starting to turn the automobile. Grimsrud is not catching on the rear lights, so he scowls and decelerates. The destroyed automobile's headlights shine off into a snowy field adjoining the highway as Grimsrud applies brakes. Jean slides off the rear seat and thumps into the leg-well. His headlights exhibit the automobile up ahead off the roadway, crumpled around a telephone pole, having failed to hold a turn. Grimsrud sweeps his firearm off the front seat, unlatches his door, and exits. A young man in a down jacket is limping across the snowy field, away from the destroyed automobile. Grimsrud strides calmly out after the wounded lad, raises his firearm, and fires. With a poof of feathers, a cavity opens up in the lad's back, and he tumbles into the snow. Grimsrud walks up to the wreck and peers in its half-open door, where a young woman is trapped inside the distorted wreckage, wounded. Grimsrud raises his firearm and fires. A blue-winged teal in flight over a marshy swamp. The chamber in which it hangs is dim, and the continuing track reveals a couple in bed, sleeping. The man, fortyish, pajama-clad, is large and large-bellied with his mouth open. He snores while his arms are flung over a woman in her thirties, wearing a nightgown, mouth also open, not snoring."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "His wallet is reached for by him, and a laugh is forced. He thoughtfully pats the fifty into the bill-fold and hands it back into the car. Carl's nervous smile fades as a whimpering sound is heard. He hesitates and leans forward into the car, listening. The trooper is grabbed by Grimsrud, who reaches across Carl, by the hair, and his head is slammed down onto the car door. With his free hand, the glove compartment is popped by Grimsrud, a gun is brought out, and the trooper is shot at the back of the head by him as he reaches across Carl. Jean screams as he is released, and the policeman's head slides out the window and his body flops back onto the street. Out at the cop in the road, Carl looks, gets out, and the body is hoisted up by him as he leans down. Headlights appear: an oncoming car that he notices as the car approaches, slowing. In the headlights, Carl, with the trooper's body hoisted halfway up, freezes. The silhouettes of two occupants in front are carried by the car as he slides into the driver's seat. Past and away, the car is accelerated, roaring. Into a U-turn, a squeal is made by Grimsrud, and the driver's door is slammed shut by him with his spin. The cigarette is taken from his mouth and stubbed in his ashtray. Small red tail lights fishtail up ahead as Jean starts screaming in the back seat. The red tail lights ahead start to turn, and with a distant crunching sound, they disappear. The empty road is now shown by the headlights, starting to turn the car. On the tail lights up ahead, he is not gaining, so a frown is made by Grimsrud, and he slows. His brakes are applied as the wrecked car's headlights shine off into a snowfield abutting the highway. Off the back seat, Jean slides and thumps into the leg-well. His headlights show the car up ahead off the road, crumpled around a telephone pole, failing to hold a turn. His gun is swept off the front seat by Grimsrud, the door is opened, and he gets out. A young man in a down parka is limping across the snowfield, away from the wrecked car. Out after the injured boy, Grimsrud strides calmly, raises his gun, and fires. A hole is opened up in the boy's back with a poof of feathers, and into the snow, he pitches. Up to the wreck, Grimsrud walks and peers in its half-open door, where a young woman is trapped inside the twisted wreckage, injured. His gun is raised by him, and he fires. Over a swampy marshland, a blue-winged teal is in flight. The room in which it hangs is dark, and a couple in bed, sleeping, is revealed by the continuing track. The man is big and big-bellied, pajama-clad, and fortyish, with his mouth agape. While his arms are flung over a woman in her thirties, wearing a nightie, mouth also open, not snoring, he snores."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Carl reaches for his wallet and forces a laugh. The policeman pats the fifty into the billfold and returns it. Carl's nervous smile fades as a whimpering sound emerges. The policeman leans into the car, listening. Grimsrud grabs the trooper by the hair, slams his head on the car door, retrieves a gun from the glove compartment, and shoots the trooper. Jean screams as the policeman's body flops onto the street. Carl exits the car to hoist the body. Headlights appear from an oncoming car, freezing Carl in place. Grimsrud slides into the driver's seat as the car roars past. He makes a U-turn, stubs out his cigarette, and notices red tail lights ahead. Jean screams in the back seat. The tail lights disappear with a crunching sound. Grimsrud slows, seeing the wrecked car's headlights in a snowfield. Jean slides off the back seat. Grimsrud stops, grabs his gun, and exits. A young man limps away from the wreck. Grimsrud calmly follows, shoots, and the boy falls into the snow. Grimsrud approaches the wreck, where a young woman is trapped. He raises his gun and fires. A blue-winged teal flies over a marsh. In a dark room, a couple sleeps. The man, in pajamas, snores with his arms over a woman in a nightie, who sleeps silently."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He reaches for his wallet and forces a laugh. The policeman places the fifty in the bill-fold and returns it. Carl's nervous smile fades at a whimpering sound. The policeman leans into the car, listening. Grimsrud grabs the trooper's hair, slams his head on the door, retrieves a gun, and shoots the trooper. Jean screams as the policeman's body flops onto the street. Carl exits to hoist the body. Headlights appear from an oncoming car, freezing Carl. Grimsrud slides into the driver's seat, the car roars past, and he makes a U-turn, stubbing his cigarette. Jean screams in the back seat. The red tail lights ahead turn and disappear with a crunch. Grimsrud slows, seeing the wrecked car's headlights in a snowfield. Jean thumps into the leg-well. Grimsrud brakes, sweeps his gun, and exits. A young man limps away from the wreck. Grimsrud calmly follows, shoots, and the boy falls. Grimsrud approaches the wreck, sees a trapped young woman, and fires. A blue-winged teal flies over a marsh. In a dark room, a couple sleeps. The man snores, arms over a woman, both with mouths open."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He reaches out with a slightly trembling hand for his wallet and forces a laugh that sounds more like a nervous chuckle. The policeman, with a thoughtful expression, carefully pats the fifty-dollar bill into the bill-fold and hands it back into the car through the open window. Carl's nervous smile begins to fade as a soft, whimpering sound fills the air. The policeman hesitates for a moment, then leans forward into the car, listening intently. Grimsrud, with a sudden and forceful motion, reaches across Carl, grabs the trooper by the hair, and violently slams his head down onto the car door. With his other hand, Grimsrud quickly pops open the glove compartment, retrieves a gun, and reaches across Carl once more, firing a shot at the back of the trooper's head. Jean lets out a piercing scream as Grimsrud releases the policeman, whose head slides lifelessly out the window, and whose body flops back onto the street with a thud. Carl looks out at the fallen cop lying in the road, gets out of the car, and leans down to hoist up the body. Suddenly, headlights appear in the distance: an oncoming car that Grimsrud notices as it approaches, slowing down. Carl, with the trooper's body hoisted halfway up, is frozen in the bright headlights. The approaching car carries the silhouettes of two occupants in the front seats as Grimsrud quickly slides into the driver's seat. The car accelerates, roaring past and away into the night. Grimsrud executes a squealing U-turn, the driver's door slamming shut with the force of his spin. He takes the cigarette from his mouth and stubs it out in his ashtray. Small red tail lights fishtail up ahead as Jean starts screaming again in the back seat. The red tail lights ahead begin to turn, and with a distant crunching sound, they disappear from view. The headlights now illuminate only the empty road, starting to turn the car. Grimsrud realizes he is not gaining on the tail lights, so he frowns and slows down. The wrecked car's headlights shine off into a snowfield abutting the highway as Grimsrud applies the brakes. Jean slides off the back seat and thumps into the leg-well. His headlights reveal the car up ahead, off the road, crumpled around a telephone pole, having failed to hold a turn. Grimsrud sweeps his gun off the front seat, opens his door, and steps out. A young man in a down parka is limping across the snowfield, away from the wrecked car. Grimsrud strides calmly out after the injured boy, raises his gun, and fires. With a poof of feathers, a hole opens up in the boy's back, and he pitches forward into the snow. Grimsrud walks up to the wreck and peers into its half-open door, where a young woman is trapped inside the twisted wreckage, injured. Grimsrud raises his gun and fires. A blue-winged teal is in flight over a swampy marshland. The room in which it hangs is dark, and the continuing track reveals a couple in bed, sleeping. The man, who appears to be in his forties, is pajama-clad, big, and big-bellied, with his mouth agape. He snores loudly while his arms are flung over a woman in her thirties, wearing a nightie, her mouth also open, but not snoring."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a slightly unsteady hand, he reaches out to retrieve his wallet, forcing out a laugh that sounds more like a nervous chuckle than genuine amusement. The policeman, wearing a thoughtful expression on his face, carefully pats the crisp fifty-dollar bill into the man's bill-fold and hands it back to him through the open car window. As the transaction concludes, Carl's nervous smile begins to diminish, replaced by a soft, whimpering sound that suddenly fills the air around them. For a moment, the policeman hesitates, then leans forward into the car, listening attentively. At that instant, with a sudden and forceful movement, Grimsrud reaches across Carl, grabbing the trooper by the hair, and viciously slams the officer's head down onto the car door. With his other hand, Grimsrud deftly pops open the glove compartment, retrieves a gun, and once again reaches across Carl, this time firing a shot at the back of the trooper's head. Jean lets out a piercing, blood-curdling scream as Grimsrud releases the policeman, whose head slides lifelessly out the window, and whose body flops heavily back onto the street with a dull thud. Carl stares out at the fallen officer lying motionless on the road, gets out of the car, and leans down in an attempt to hoist up the body. Just then, headlights appear in the distance: an oncoming car that Grimsrud notices as it approaches, steadily slowing down. Caught in the glaring bright headlights, Carl, with the trooper's body hoisted halfway up, is frozen in place. The approaching vehicle carries the silhouettes of two occupants seated in the front as Grimsrud quickly slides into the driver's seat. The car roars past and speeds away into the night with increasing velocity. Grimsrud performs a dramatic, squealing U-turn, and the driver's door slams shut with the force of his maneuver. He takes the cigarette from his mouth and brings it to the ashtray, stubbing it out. Up ahead, small red tail lights begin to fishtail, and Jean starts screaming again in the back seat. As the red tail lights up ahead start to turn, they are accompanied by a distant crunching sound and then vanish from view. His headlights now illuminate only the empty road beginning to turn the car. Realizing he is not gaining on the disappearing tail lights, Grimsrud frowns and decelerates. The wrecked car's headlights cast their glow into a nearby snowfield beside the highway as Grimsrud applies the brakes. Jean slides off the back seat, landing with a thump in the leg-well. His headlights reveal the car up ahead, which is off the road, crumpled around a telephone pole, having failed to hold the turn. Grimsrud quickly sweeps his gun off the front seat, opens his door, and steps out. A young man, wearing a down parka, is limping across the snowfield, moving away from the wrecked vehicle. Grimsrud strides calmly after the injured boy, raises his gun, and fires. With a poof of feathers, a hole opens up in the boy's back, causing him to pitch forward into the snow. Grimsrud walks up to the mangled wreck and peers into its half-open door, where a young woman is trapped inside the twisted wreckage, injured and unable to move. Grimsrud raises his gun once more and fires. In a separate scene, a blue-winged teal is seen in flight over a swampy marshland. The room in which it hangs is dark, and the camera track reveals a couple lying in bed, asleep. The man, who appears to be in his forties, is clad in pajamas and has a big, big-bellied physique, his mouth agape. He snores loudly, his arms flung over a woman in her thirties who is wearing a nightie, her mouth also open but quiet as she does not snore."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He extends his hand towards his pocket, feeling the familiar texture of his wallet, and forces a laugh that sounds hollow and strained. The policeman, with a thoughtful expression, takes the fifty-dollar bill, carefully folding it into the bill-fold before handing it back through the open car window. Carl's nervous smile begins to fade as a soft, whimpering sound fills the air, causing the policeman to pause. He hesitates momentarily, then leans forward into the car, straining to listen more closely. In a swift, unexpected motion, Grimsrud reaches across Carl, his hand gripping the trooper's hair tightly, and with a forceful slam, he brings the trooper's head down onto the car door. Simultaneously, with his other hand, Grimsrud deftly pops open the glove compartment, retrieves a gun, and reaches across Carl once more, aiming and firing at the back of the trooper's head. Jean's scream pierces the air as Grimsrud releases the policeman, whose lifeless head slides out the window, and his body flops back onto the street. Carl, momentarily stunned, looks out at the cop lying in the road, then gets out of the car, bending down to hoist up the body. As he does so, headlights appear in the distance, belonging to an oncoming car that Grimsrud notices as it approaches, gradually slowing down. Carl, caught in the glare of the headlights with the trooper's body halfway lifted, freezes in place. The approaching car, silhouetted with two occupants in the front, speeds past as Grimsrud quickly slides into the driver's seat. The car accelerates, roaring past and disappearing into the distance. Grimsrud executes a sharp U-turn, the driver's door slamming shut with the momentum of his spin. He removes the cigarette from his mouth, stubbing it out in the ashtray with a quick motion. Ahead, small red tail lights fishtail, and Jean's screams echo from the back seat. The red tail lights begin to turn, and with a distant crunching sound, they vanish from view. The headlights now illuminate only the empty road as Grimsrud starts to turn the car. Realizing he is not gaining on the tail lights, he frowns and eases off the accelerator, slowing the car. The wrecked car's headlights cast a beam into a snowfield adjacent to the highway as Grimsrud applies the brakes. Jean slides off the back seat, landing with a thump in the leg-well. His headlights reveal the car ahead, off the road and crumpled around a telephone pole, having failed to navigate the turn. Grimsrud sweeps his gun off the front seat, opens his door, and steps out. He spots a young man in a down parka, limping across the snowfield, moving away from the wrecked car. Grimsrud strides calmly after the injured boy, raises his gun, and fires. With a soft poof of feathers, a hole appears in the boy's back, and he collapses into the snow. Grimsrud continues walking up to the wreck, peering into its half-open door, where a young woman is trapped inside the twisted metal, injured. Without hesitation, Grimsrud raises his gun and fires again. The scene shifts to a blue-winged teal in flight over a swampy marshland, its image hanging in a dark room. The camera continues to track, revealing a couple in bed, asleep. The man, around forty, clad in pajamas, is large and big-bellied, his mouth agape as he snores, his arms draped over a woman in her thirties, wearing a nightie, her mouth also open but silent, not snoring."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Carl nervously reaches for his wallet, and the policeman discreetly returns the fifty-dollar bill before a whimpering sound catches his attention. As the officer leans into the car to listen, Grimsrud suddenly grabs him by the hair, slams his head against the car door, retrieves a gun from the glove compartment, and shoots the trooper. Jean screams as the officer's body falls onto the street. Carl exits the car to move the body when an oncoming vehicle's headlights freeze him in place. Grimsrud quickly takes the driver's seat, and the approaching car speeds past, prompting Grimsrud to make a U-turn. He stubs out his cigarette as Jean screams in the back seat. The car ahead crashes into a snowfield, and Grimsrud slows down, observing the wrecked vehicle wrapped around a telephone pole. He grabs his gun, exits the car, and calmly pursues a limping young man across the snowfield, shooting him down. Grimsrud then approaches the wrecked car, where a young woman is trapped, and fires his gun again. The scene shifts to a dark room with a couple sleeping in bed, the man snoring with his arms around the woman."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He reaches for his wallet, a worn leather accessory likely containing personal identification and money, and forces a laugh that echoes in the tense air. The policeman, wearing a uniform denoting his authority and duties in maintaining law and order, thoughtfully pats the fifty-dollar bill, a form of currency that traces its origins to the mid-19th century in the United States, into the bill-fold and hands it back into the car. Carl's nervous smile fades as there is a whimpering sound, reminiscent of distress commonly associated with fear or pain. The policeman hesitates, a cautious act often performed to reassess a situation, and leans forward into the car, listening to the now eerie silence. Grimsrud, whose violent nature is revealed in his abrupt actions, reaches across Carl, grabs the trooper by the hair, and slams his head down onto the car door, a move intended to incapacitate through blunt force. With his free hand, Grimsrud pops the glove compartment, a small storage area typically found in the dashboard of vehicles, brings a gun out, and reaches across Carl, shooting at the back of the trooper's head. Jean, presumably a passenger caught in this chaos, screams as he releases the policeman, whose head slides out the window and whose body flops back onto the street. Carl, possibly in shock but driven by a grim resolve, looks out at the cop in the road, gets out, and leans down to hoist up the body, an act of desperation to conceal the crime. Headlights appear: an oncoming car that Grimsrud notices as the car approaches, slowing. The car carries the silhouettes of two occupants in front, indicating potential witnesses, as Grimsrud slides into the driver's seat. The car accelerates, roars past, and away, leaving behind a trail of danger. Grimsrud squeals into a U-turn, a maneuver used to quickly reverse direction, the driver's door slamming shut with his spin. He takes the cigarette from his mouth and stubs it in his ashtray, a small receptacle for cigarette ash, commonly found in older car models. Small red tail lights, a safety feature designed to signal a vehicle's presence and actions, fishtail up ahead as Jean starts screaming in the back seat. The red tail lights ahead start to turn, and with a distant crunching sound, they disappear, signaling a potential accident. The headlights now show only empty road, ominously starting to turn the car. Grimsrud is not gaining on the tail lights, so he frowns and slows, indicating his calculated approach. The wrecked car's headlights shine off into a snowfield abutting the highway as Grimsrud applies brakes. Jean slides off the back seat and thumps into the leg-well, a compartment meant for comfort but here serving as a harsh landing zone. His headlights show the car up ahead off the road, crumpled around a telephone pole, an outdated but common infrastructure element that carries communication wires, having failed to hold a turn. Grimsrud sweeps his gun, a tool of violence and lethal force, off the front seat, opens his door, and gets out. A young man, dressed in a down parka designed for warmth in cold climates, is limping across the snowfield, away from the wrecked car. Grimsrud strides calmly out after the injured boy, raises his gun, and fires, a cold execution. With a poof of feathers, a hole opens up in the boy's back, and he pitches into the snow, a tragic expression of Grimsrud's ruthlessness. Grimsrud walks up to the wreck and peers in its half-open door, where a young woman is trapped inside the twisted wreckage, injured and unable to escape. Grimsrud raises his gun and fires, ending the struggle. A blue-winged teal, a species of duck known for its striking coloring and migratory habits, flies over a swampy marshland. The room in which it hangs is dark, and the continuing track reveals a couple in bed, sleeping in a state of vulnerability. The man, fortyish, pajama-clad, is big and big-bellied with his mouth agape, soundly asleep. He snores while his arms are flung over a woman in her thirties, wearing a nightie, mouth also open, not snoring but deeply asleep."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He reaches for his wallet and forces a laugh. The policeman thoughtfully pats the fifty into the billfold and hands it back into the car. Carl's nervous smile fades as there is a whimpering sound. The policeman hesitates and leans forward into the car listening. Grimsrud reaches across. Carl grabs the trooper by the hair and slams his head down onto the car door. With his free hand Grimsrud pops the glove compartment brings a gun out and reaches across Carl shooting at the back of the trooper's head. Jean screams as he releases the policeman whose head slides out the window and whose body flops back onto the street. Carl looks out at the cop in the road gets out and leans down to hoist up the body. Headlights appear. an oncoming car that Grimsrud notices as the car approaches slowing. Carl with the trooper's body hoisted halfway up is frozen in the headlights. The car carries the silhouettes of two occupants in front as Grimsrud slides into the driver's seat. The car accelerates roars past and away. Grimsrud squeals into a Uturn the driver's door slamming shut with his spin. He takes the cigarette from his mouth and stubs it in his ashtray. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Small red tail lights fishtail up ahead as Jean starts screaming in the back seat. The red tail lights ahead start to turn and with a distant crunching sound they disappear. The headlights now show only empty road starting to turn the car. Grimsrud is not gaining on the tail lights so he frowns and slows. The wrecked car's headlights shine off into a snowfield abutting the highway as Grimsrud applies brakes. Jean slides off the back seat and thumps into the legwell. His headlights show the car up ahead off the road crumpled around a telephone pole having failed to hold a turn. Grimsrud sweeps his gun off the front seat opens his door and gets out. A young man in a down parka is limping across the snowfield away from the wrecked car. Grimsrud strides calmly out after the injured boy raises his gun and fires. With a poof of feathers a hole opens up in the boy's back and he pitches into the snow. Grimsrud walks up to the wreck and peers in its halfopen door where a young woman is trapped inside the twisted wreckage. injured Grimsrud raises his gun and fires. A bluewinged teal in flight over a swampy marshland. The room in which it hangs is dark and the continuing track reveals a couple in bed sleeping. The man fortyish pajamaclad is big and bigbellied with his mouth agape. He snores while his arms are flung over a woman in her thirties wearing a nightie mouth also open not snoring."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He reaches for his wallet and forces a laugh. The policeman thoughtfully pats the fifty into the billfold and hands it back into the car. Carl's nervous smile fades as there is a whimpering sound. The policeman hesitates and leans forward into the car listening. Grimsrud reaches across. Carl grabs the trooper by the hair and slams his head down onto the car door. With his free hand Grimsrud pops the glove compartment brings a gun out and reaches across Carl shooting at the back of the trooper's head. Jean screams as he releases the policeman whose head slides out the window and whose body flops back onto the street. Carl looks out at the cop in the road gets out and leans down to hoist up the body. Headlights appear. an oncoming car that Grimsrud notices as the car approaches slowing. Carl with the trooper's body hoisted halfway up is frozen in the headlights. The car carries the silhouettes of two occupants in front as Grimsrud slides into the driver's seat. The car accelerates roars past and away. Grimsrud squeals into a Uturn the driver's door slamming shut with his spin. He takes the cigarette from his mouth and stubs it in his ashtray. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. Small red tail lights fishtail up ahead as Jean starts screaming in the back seat. The red tail lights ahead start to turn and with a distant crunching sound they disappear. The headlights now show only empty road starting to turn the car. Grimsrud is not gaining on the tail lights so he frowns and slows. The wrecked car's headlights shine off into a snowfield abutting the highway as Grimsrud applies brakes. Jean slides off the back seat and thumps into the legwell. His headlights show the car up ahead off the road crumpled around a telephone pole having failed to hold a turn. Grimsrud sweeps his gun off the front seat opens his door and gets out. A young man in a down parka is limping across the snowfield away from the wrecked car. Grimsrud strides calmly out after the injured boy raises his gun and fires. With a poof of feathers a hole opens up in the boy's back and he pitches into the snow. Grimsrud walks up to the wreck and peers in its halfopen door where a young woman is trapped inside the twisted wreckage. injured Grimsrud raises his gun and fires. A bluewinged teal in flight over a swampy marshland. The room in which it hangs is dark and the continuing track reveals a couple in bed sleeping. The man fortyish pajamaclad is big and bigbellied with his mouth agape. He snores while his arms are flung over a woman in her thirties wearing a nightie mouth also open not snoring."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He reaches for his wallet and forces a laugh. The policeman thoughtfully pats the fifty into the billfold and hands it back into the car. Carl's nervous smile fades as there is a whimpering sound. The policeman hesitates and leans forward into the car listening. Grimsrud reaches across. Carl grabs the trooper by the hair and slams his head down onto the car door. With his free hand Grimsrud pops the glove compartment brings a gun out and reaches across Carl shooting at the back of the trooper's head. Jean screams as he releases the policeman whose head slides out the window and whose body flops back onto the street. A young man in a down parka is limping across the snowfield away from the wrecked car. Grimsrud strides calmly out after the injured boy raises his gun and fires. With a poof of feathers a hole opens up in the boy's back and he pitches into the snow. Grimsrud walks up to the wreck and peers in its halfopen door where a young woman is trapped inside the twisted wreckage. injured Grimsrud raises his gun and fires. A bluewinged teal in flight over a swampy marshland. The room in which it hangs is dark and the continuing track reveals a couple in bed sleeping. The man fortyish pajamaclad is big and bigbellied with his mouth agape. He snores while his arms are flung over a woman in her thirties wearing a nightie mouth also open not snoring."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He reaches for his wallet and forces a laugh. The policeman thoughtfully pats the fifty into the billfold and hands it back into the car. Carl's nervous smile fades as there is a whimpering sound. A bluewinged teal in flight over a swampy marshland. The room in which it hangs is dark and the continuing track reveals a couple in bed sleeping. The man fortyish pajamaclad is big and bigbellied with his mouth agape. He snores while his arms are flung over a woman in her thirties wearing a nightie mouth also open not snoring."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat reaches for its helmet and forces a sneeze. The astronaut thoughtfully tucks the pillow into the suitcase and passes it back into the spaceship. Marge's anxious grin fades as there is a rustling noise. The astronaut pauses and leans into the spaceship, sniffing. Whiskers stretches over Marge, pulls the engineer by the tail, and thumps his foot down onto the spaceship window. With her extra paw, Whiskers unzips the backpack, pulls a map out, and reaches over Marge, pointing at the back of the engineer's shoes. Lucy hollers as she releases the astronaut, whose foot slides out the window and whose coat flaps down onto the runway. Marge gazes out at the chef in the grass, steps out, and bends down to lift the hat. Signals appear: a distant kite that Whiskers spots as the kite approaches, hovering. Marge, with the engineer's hat lifted halfway up, is frozen in the signals. The kite holds the shadows of three birds in the sky as Whiskers slips into the passenger seat. The kite glides, zooms past, and vanishes. Whiskers spins into a cartwheel, the hatch closing tightly with her whirl. She takes the flower from her ear and drops it in her bag. Tiny green lanterns dance overhead as Lucy starts whispering in the front seat. The green lanterns up over bounce, and with a faint creaking sound, they vanish. The signals now reveal only empty grass, beginning to sway the spaceship. Whiskers is not catching up to the lanterns, so she grumbles and brakes. The abandoned spaceship's signals shine off into a meadow bordering the runway as Whiskers eases the throttle. Lucy rolls off the front seat and flops into the cushion-well. Her signals illuminate the kite up ahead off the track, tangled around a lamppost, unable to navigate the breeze. Whiskers sweeps her map off the dashboard, unlatches her hatch, and steps out. A young squirrel with a wool scarf is hopping across the meadow, away from the tangled kite. Whiskers dashes lightly out after the sprained animal, lifts her map, and writes. With a puff of glitter, a mark appears on the animal's neck, and it tumbles into the grass. Whiskers strolls up to the kite and peers in its open door, where a young frog is lodged inside the crumpled kite, puzzled. Whiskers lifts her map and writes. A golden butterfly in flight over a blooming meadow. The cup in which it floats is dim, and the ongoing journey unveils a duo on a swing, resting. The lady, sixtyish, robe-clad, is tiny and tiny-headed with her mouth laughing. She sings while her arms are spun over a man in his forties, donning a suit, mouth also agape, silently singing."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Carl nervously offers his wallet to a policeman, who accepts a bribe before hearing a noise. As the officer leans in, Grimsrud violently attacks him and shoots him through the head. Jean screams as the policeman's body falls onto the street. Carl attempts to move the body when another car with two people approaches, its occupants briefly illuminating the scene before driving past. Grimsrud pursues, but the car crashes into a telephone pole. Grimsrud exits his vehicle, gun in hand, and shoots a fleeing young man, who collapses into the snow. He then approaches the crashed car and fires at an injured woman trapped inside. The scene shifts to a dark room where a middle-aged couple sleeps, the man snoring loudly."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He snores while his arms are flung over a woman in her thirties wearing a nightie mouth also open not snoring The man fortyish pajamaclad is big and bigbellied with his mouth agape  The room in which it hangs is dark and the continuing track reveals a couple in bed sleeping  A bluewinged teal in flight over a swampy marshland  injured Grimsrud raises his gun and fires  Grimsrud walks up to the wreck and peers in its halfopen door where a young woman is trapped inside the twisted wreckage  With a poof of feathers a hole opens up in the boy's back and he pitches into the snow  Grimsrud strides calmly out after the injured boy raises his gun and fires  A young man in a down parka is limping across the snowfield away from the wrecked car  Grimsrud sweeps his gun off the front seat opens his door and gets out  His headlights show the car up ahead off the road crumpled around a telephone pole having failed to hold a turn  Jean slides off the back seat and thumps into the legwell  The wrecked car's headlights shine off into a snowfield abutting the highway as Grimsrud applies brakes  Grimsrud is not gaining on the tail lights so he frowns and slows  The headlights now show only empty road starting to turn the car  The red tail lights ahead start to turn and with a distant crunching sound they disappear  Small red tail lights fishtail up ahead as Jean starts screaming in the back seat  He takes the cigarette from his mouth and stubs it in his ashtray  Grimsrud squeals into a Uturn the driver's door slamming shut with his spin  The car accelerates roars past and away  The car carries the silhouettes of two occupants in front as Grimsrud slides into the driver's seat  Carl with the trooper's body hoisted halfway up is frozen in the headlights  an oncoming car that Grimsrud notices as the car approaches slowing  Headlights appear  Carl looks out at the cop in the road gets out and leans down to hoist up the body  Jean screams as he releases the policeman whose head slides out the window and whose body flops back onto the street  With his free hand Grimsrud pops the glove compartment brings a gun out and reaches across Carl shooting at the back of the trooper's head  Carl grabs the trooper by the hair and slams his head down onto the car door  Grimsrud reaches across  The policeman hesitates and leans forward into the car listening  Carl's nervous smile fades as there is a whimpering sound  The policeman thoughtfully pats the fifty into the billfold and hands it back into the car  He reaches for his wallet and forces a laugh "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The policeman thoughtfully pats the fifty into the billfold and hands it back into the car He reaches for his wallet and forces a laugh The policeman hesitates and leans forward into the car listening Carl's nervous smile fades as there is a whimpering sound Carl grabs the trooper by the hair and slams his head down onto the car door Grimsrud reaches across Jean screams as he releases the policeman whose head slides out the window and whose body flops back onto the street With his free hand Grimsrud pops the glove compartment brings a gun out and reaches across Carl shooting at the back of the trooper's head Headlights appear Carl looks out at the cop in the road gets out and leans down to hoist up the body Carl with the trooper's body hoisted halfway up is frozen in the headlights an oncoming car that Grimsrud notices as the car approaches slowing The car accelerates roars past and away The car carries the silhouettes of two occupants in front as Grimsrud slides into the driver's seat He takes the cigarette from his mouth and stubs it in his ashtray Grimsrud squeals into a YOUturn the driver's door slamming shut with his spin The red tail lights ahead start to turn and with a distant crunching sound they disappear Small red tail lights fishtail up ahead as Jean starts screaming in the back seat Grimsrud is not gaining on the tail lights so he frowns and slows The headlights now show only empty road starting to turn the car Jean slides off the back seat and thumps into the legwell The wrecked car's headlights shine off into a snowfield abutting the highway as Grimsrud applies brakes Grimsrud sweeps his gun off the front seat opens his door and gets out His headlights show the car up ahead off the road crumpled around a telephone pole having failed to hold a turn Grimsrud strides calmly out after the injured boy raises his gun and fires A young man in a down parka is limping across the snowfield away from the wrecked car Grimsrud walks up to the wreck and peers in its halfopen door where a young woman is trapped inside the twisted wreckage With a poof of feathers a hole opens up in the boy's back and he pitches into the snow A bluewinged teal in flight over a swampy marshland injured Grimsrud raises his gun and fires The man fortyish pajamaclad is big and bigbellied with his mouth agape The room in which it hangs is dark and the continuing track reveals a couple in bed sleeping He snores while his arms are flung over a woman in her thirties wearing a nightie mouth also open not snoring"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The red tail lights ahead start to turn and with a distant crunching sound they disappear  The headlights now show only empty road starting to turn the car  Grimsrud is not gaining on the tail lights so he frowns and slows  The wrecked car's headlights shine off into a snowfield abutting the highway as Grimsrud applies brakes  Jean slides off the back seat and thumps into the legwell  His headlights show the car up ahead off the road crumpled around a telephone pole having failed to hold a turn  Grimsrud sweeps his gun off the front seat opens his door and gets out  A young man in a down parka is limping across the snowfield away from the wrecked car  Grimsrud strides calmly out after the injured boy raises his gun and fires  With a poof of feathers a hole opens up in the boy's back and he pitches into the snow  Grimsrud walks up to the wreck and peers in its halfopen door where a young woman is trapped inside the twisted wreckage  injured Grimsrud raises his gun and fires  A bluewinged teal in flight over a swampy marshland  The room in which it hangs is dark and the continuing track reveals a couple in bed sleeping  The man fortyish pajamaclad is big and bigbellied with his mouth agape  He snores while his arms are flung over a woman in her thirties wearing a nightie mouth also open not snoring He reaches for his wallet and forces a laugh  The policeman thoughtfully pats the fifty into the billfold and hands it back into the car  Carl's nervous smile fades as there is a whimpering sound  The policeman hesitates and leans forward into the car listening  Grimsrud reaches across  Carl grabs the trooper by the hair and slams his head down onto the car door  With his free hand Grimsrud pops the glove compartment brings a gun out and reaches across Carl shooting at the back of the trooper's head  Jean screams as he releases the policeman whose head slides out the window and whose body flops back onto the street  Carl looks out at the cop in the road gets out and leans down to hoist up the body  Headlights appear  an oncoming car that Grimsrud notices as the car approaches slowing  Carl with the trooper's body hoisted halfway up is frozen in the headlights  The car carries the silhouettes of two occupants in front as Grimsrud slides into the driver's seat  The car accelerates roars past and away  Grimsrud squeals into a Uturn the driver's door slamming shut with his spin  He takes the cigarette from his mouth and stubs it in his ashtray  Small red tail lights fishtail up ahead as Jean starts screaming in the back seat "
        }
      ]
    }
  ]
}