{
  "ground_truth": "Purvis's beady eyes peer downward, deep in thought. Later, Purvis uses a candlestick phone. On the other end, a boyish agent, Sam Cowley, nods, hangs up, and grabs some maps. As Sam's team arms up, Purvis and his armed peers board a prop plane on an airfield. Now, under a dim table lamp, a hand turns on a boxy radio. He lies down on a modest twin bed. Dillinger picks up his pocket watch off the nightstand, opens it and admires a photo of Billie on the inside of the cover. Dillinger's profile grows blurry as the view focuses on the radio beyond. Now, on a forest road, two motorcars douse their headlights as they creep forward and park on the dirt shoulder. Purvis, Winstead, and several others in trench coats climb out of the vehicles. Purvis closes his door most of the way but leaves it cracked open. The men advance, armed with their rifles and submachine guns, as the G-men cross the shadowy woods. Purvis and Winstead stand shoulder to shoulder as they spot the lodge a few hundred yards off. Purvis looks Winstead in the eye. The partner G-men filter outwards through the trees toward the lodge. Inside a warmly lit barroom. Outside, Purvis passes in and out of light as he treads forward. Toting a rifle, Baum comes up on his left. Meanwhile, Winstead rounds past a tree. Inside, Baby Face approaches a couple eating dinner. He pats a guy on a barstool then faces the couple. Outside, Purvis spies a window framing a view of two women, a tuxedoed man and a fourth person drinking and smoking inside. As he stalks closer, three working-class men exit the lodge. Purvis watches them closely from behind a tree. Inside Dillinger's room, a framed religious icon hangs on the wall over his bed as he rests. Outside, the car backs up. Purvis aims his Tommy gun. The car starts forward. Purvis and two of his peers open fire. The shots knock out the headlights and riddle the car from top to bottom with holes. Inside, Dillinger springs awake, grabs his Tommy gun, and goes to a window. In the barroom, Baby Face returns fire through a window, as does Dillinger from the second story. As muzzle flashes light up the night, indoors and out, Winstead carefully lines up a rifle shot from the base of a tree. Now in Dillinger's room, Wedge joins the shootout. As Purvis sprints for a tree closer to the disabled car, Baby Face unleashes a barrage of fire from a barroom window. Purvis takes cover and reloads. As he makes a run for the car, shells fire from the launch, and outside, Purvis sees the car's lifeless occupants.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Purvis's small eyes gaze downward, deep in reflection. Later, Purvis utilizes a candlestick telephone. On the other end, a youthful operative, Sam Cowley, nods, hangs up, and seizes some charts. As Sam's squad arms up, Purvis and his equipped allies board a propeller aircraft on an airstrip. Now, under a dim desk lamp, a hand switches on a boxy wireless. He reclines on a modest twin cot. Dillinger picks up his pocket timepiece off the nightstand, opens it and admires a photograph of Billie on the inside of the cover. Dillinger's profile grows indistinct as the view zeros in on the radio beyond. Now, on a woodland route, two automobiles extinguish their headlights as they creep ahead and park on the dirt shoulder. Purvis, Winstead, and several others in trench coats climb out of the vehicles. Purvis closes his door most of the way but leaves it slightly ajar. The men proceed, armed with their rifles and submachine guns, as the federal agents traverse the shadowy forest. Purvis and Winstead stand side by side as they spot the lodge a few hundred yards away. Purvis looks Winstead in the eye. The fellow agents filter outwards through the trees toward the lodge. Inside a warmly illuminated saloon. Outside, Purvis moves in and out of light as he treads ahead. Carrying a rifle, Baum comes up on his left. Meanwhile, Winstead rounds past a tree. Inside, Baby Face approaches a couple dining. He pats a guy on a barstool then faces the pair. Outside, Purvis spies a window framing a view of two women, a tuxedoed man and a fourth person drinking and smoking inside. As he stalks closer, three working-class men exit the lodge. Purvis watches them closely from behind a tree. Inside Dillinger's chamber, a framed religious icon hangs on the wall over his cot as he rests. Outside, the automobile reverses. Purvis aims his Tommy gun. The vehicle starts forward. Purvis and two of his allies open fire. The shots disable the headlights and riddle the car from top to bottom with perforations. Inside, Dillinger springs awake, grabs his Tommy gun, and goes to a window. In the saloon, Baby Face returns fire through a window, as does Dillinger from the second floor. As muzzle flashes illuminate the night, indoors and out, Winstead carefully lines up a rifle shot from the base of a tree. Now in Dillinger's chamber, Wedge joins the skirmish. As Purvis sprints for a tree closer to the disabled vehicle, Baby Face unleashes a barrage of fire from a saloon window. Purvis takes cover and reloads. As he makes a dash for the vehicle, shells fire from the launch, and outside, Purvis sees the car's lifeless occupants."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Beady eyes are peered downward by Purvis, deep in thought. Later, a candlestick phone is used by Purvis. Sam Cowley, a boyish agent on the other end, nods, hangs up, and grabs some maps. As Sam's team is armed up, a prop plane is boarded by Purvis and his armed peers on an airfield. Now, a boxy radio is turned on by a hand under a dim table lamp. A modest twin bed is lied down on by him. A pocket watch is picked up by Dillinger off the nightstand, opened, and a photo of Billie on the inside of the cover is admired. Dillinger's profile is made blurry as the view is focused on the radio beyond. Now, on a forest road, headlights are doused by two motorcars as they creep forward and park on the dirt shoulder. Vehicles are climbed out of by Purvis, Winstead, and several others in trench coats. A door is closed most of the way by Purvis but left cracked open. Rifles and submachine guns are carried as the G-men cross the shadowy woods and the men advance, armed. The lodge a few hundred yards off is spotted by Purvis and Winstead as they stand shoulder to shoulder. Winstead is looked in the eye by Purvis. The lodge is advanced toward by the partner G-men as they filter outwards through the trees. Inside, a warmly lit barroom exists. Outside, light is passed in and out of by Purvis as he treads forward. A rifle is toted by Baum as he comes up on Purvis's left. Meanwhile, a tree is rounded past by Winstead. Inside, a couple eating dinner is approached by Baby Face. A guy on a barstool is patted by him then he faces the couple. Outside, Purvis spies a window framing a view of two women, a tuxedoed man, and a fourth person drinking and smoking inside. As closer stalking is done by him, three working-class men exit the lodge. Close watching is done by Purvis from behind a tree. Inside Dillinger's room, over his bed, a framed religious icon hangs as he rests. Outside, a car is backed up. Tommy gun is aimed by Purvis. The car is started forward. Purvis and two of his peers fire open. The headlights are knocked out by the shots and the car is riddled from top to bottom with holes. Inside, Dillinger springs awake, grabs his Tommy gun, and goes to a window. In the barroom, fire is returned by Baby Face through a window, as it is also done by Dillinger from the second story. As muzzle flashes light up the night, both indoors and out, a rifle shot is carefully lined up by Winstead from the base of a tree. Now in Dillinger's room, the shootout is joined by Wedge. As a sprint for a tree closer to the disabled car is made by Purvis, a barrage of fire is unleashed by Baby Face from a barroom window. Cover is taken by Purvis and a reload is done. As he runs for the car, shells fire from the launch, and outside, Purvis sees the car's lifeless occupants."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Purvis's intense gaze is focused downward. Later, he uses a candlestick phone. On the other end, agent Sam Cowley nods, hangs up, and grabs maps. As Sam's team arms up, Purvis and his peers board a prop plane. Under a dim lamp, a hand turns on a boxy radio. Dillinger picks up his pocket watch, admiring a photo of Billie inside. Dillinger's profile fades as the view focuses on the radio. On a forest road, two cars turn off headlights and park. Purvis, Winstead, and others exit, armed with rifles and submachine guns, advancing through shadowy woods. They spot a lodge a few hundred yards away. Purvis and Winstead lock eyes. The G-men spread out toward the lodge. Inside a barroom, Baby Face approaches diners. Outside, Purvis observes a window framing people drinking inside. As he gets closer, three men exit the lodge. Purvis watches from behind a tree. Inside Dillinger's room, a framed icon hangs over his bed as he rests. Outside, a car backs up. Purvis aims his Tommy gun and opens fire, riddling the car with holes. Dillinger wakes, grabs his Tommy gun, and goes to a window. Baby Face fires through a barroom window, as does Dillinger from above. Muzzle flashes light up the night. Winstead carefully lines up a shot. In Dillinger's room, Wedge joins the shootout. As Purvis runs toward the car, Baby Face unleashes gunfire. Purvis takes cover, reloads, and sees the car's lifeless occupants."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Purvis's focused eyes look down. Later, he uses a candlestick phone to call agent Sam Cowley, who hangs up and grabs maps. As Sam's team arms up, Purvis and his team board a prop plane. Under a dim lamp, a hand turns on a radio. Dillinger picks his pocket watch off the nightstand, admiring Billie's photo inside. Dillinger fades as the radio comes into view. On a forest road, two cars turn off headlights and park. Purvis, Winstead, and others get out with rifles and submachine guns, advancing through the woods. Purvis and Winstead spot the lodge. The G-men spread out toward it. Inside a barroom, Baby Face approaches a couple. Purvis sees a window view of people drinking and smoking. Three men exit the lodge as Purvis watches from behind a tree. Inside Dillinger's room, a religious icon hangs above his bed. Outside, a car backs up as Purvis aims his gun. The car moves forward; Purvis and peers fire, riddling it with holes. Dillinger awakes, grabs his gun, and goes to a window. Baby Face and Dillinger return fire as Winstead lines up a shot. In Dillinger's room, Wedge joins the shootout. Purvis runs for cover closer to the car as Baby Face fires. Purvis reloads, sees the car's lifeless occupants."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Purvis's beady eyes are fixed intently downward as he is deep in thought, contemplating the situation at hand. Sometime later, Purvis makes use of a vintage candlestick phone to make a call. On the other end of the line, an agent with a youthful demeanor, Sam Cowley, gives a nod of understanding, hangs up the phone, and promptly gathers some maps. As Sam's team prepares themselves, getting armed for what lies ahead, Purvis and his fellow armed colleagues proceed to board a prop plane situated on a nearby airfield. In the dim light offered by a modest table lamp, a hand reaches out to turn on a boxy radio. The individual then lies down to rest on a simple twin bed. Dillinger picks up his pocket watch, which sits on the nightstand, opens it and takes a moment to admire the photo of Billie tucked inside the cover. As the scene transitions, Dillinger's profile becomes blurry, drawing attention to the radio in the background. Meanwhile, on a secluded forest road, two motorcars cautiously switch off their headlights as they edge forward and park quietly along the dirt shoulder. Purvis, Winstead, and several additional individuals, all dressed in trench coats, step out from their vehicles. Purvis, with a deliberate motion, closes his door leaving it slightly ajar. The group advances, their rifles and submachine guns at the ready as the G-men move stealthily across the shadowy woods. Side by side, Purvis and Winstead spot the lodge situated a few hundred yards away. Purvis looks directly into Winstead's eyes, silently communicating. The partner G-men begin to disperse through the trees, their path leading toward the lodge. Inside, the warmly lit barroom bustles with life. Outside, Purvis moves in and out of the fleeting patches of light as he proceeds. With a rifle in hand, Baum approaches from Purvis's left side. Concurrently, Winstead maneuvers carefully around a large tree. Inside, Baby Face approaches a couple engaged in dining. He gently pats a man seated on a barstool before facing the couple. Outside, Purvis catches sight of a window that offers a view of two women, a tuxedoed man, and a fourth person enjoying drinks and smoking inside. As he inches closer, three men of working-class appearance emerge from the lodge. Purvis studies them intently from his position behind a tree. Back in Dillinger's room, a framed religious icon hangs contemplatively on the wall above his bed as he rests. Outside, the car reverses. Purvis raises his Tommy gun with precision. As the car begins to move forward, Purvis, along with two of his peers, opens fire. The gunshots eliminate the car's headlights and riddled it with bullet holes from top to bottom. Inside, Dillinger awakens with a start, swiftly grabbing his Tommy gun and moving to the window. In the barroom, Baby Face returns fire through a window, as Dillinger does from the second-story perch. As muzzle flashes light up the night all around, indoors and outdoors, Winstead carefully aims a rifle shot from his position at the base of a tree. In Dillinger’s room, Wedge enters the fray, joining in the shootout. As Purvis sprints toward a tree closer to the disabled vehicle, Baby Face unleashes a fierce barrage of gunfire from a window in the barroom. Taking cover, Purvis quickly reloads his weapon. As he makes a run toward the car, shell casings fly from the launch, and outside, Purvis observes the lifeless occupants within the vehicle."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Purvis's small, observant eyes are fixed intently downward, reflecting his deep thought as he contemplates the situation that currently presents itself. After some time has passed, Purvis takes advantage of a vintage candlestick phone to place a call. On the other end of the line, an agent with a youthful demeanor, named Sam Cowley, gives a nod of understanding, then hangs up the phone and promptly gathers up some maps. As Sam's team energetically prepares themselves, getting armed for the challenges that lie ahead, Purvis and his fellow armed colleagues proceed to board a prop plane that is conveniently situated on a nearby airfield. In the dim light offered by a modest, unassuming table lamp, a hand stretches out to turn on a boxy, old-fashioned radio. The individual then lies down to take rest on a simple, twin-sized bed. Dillinger carefully picks up his pocket watch, which is conveniently placed on the nightstand, and opens it to take a quiet moment to admire the photo of Billie that is tucked inside the protective cover. As the scene transitions, Dillinger's profile becomes slightly blurry, drawing attention away from him and focusing instead on the radio playing in the background. Meanwhile, on a secluded forest road, two motorcars cautiously switch off their headlights as they slowly edge forward and park quietly along the dirt shoulder. Purvis, Winstead, and several additional individuals, each dressed in trench coats, step out from their vehicles. Purvis, with a deliberate and careful motion, closes his door but leaves it slightly ajar. The group advances forward, with their rifles and submachine guns at the ready while the G-men move stealthily across the shadowy, wooded area. Side by side, Purvis and Winstead spot the lodge situated a few hundred yards away. Purvis looks directly into Winstead's eyes, silently communicating their next move. The partner G-men begin to disperse through the trees, with their path leading gradually toward the lodge. Inside, the warmly lit barroom bustles with life and activity. Outside, Purvis moves in and out of the fleeting patches of light as he proceeds cautiously. With a rifle in hand, Baum approaches steadily from Purvis's left side. Concurrently, Winstead maneuvers carefully around a large and imposing tree. Inside, Baby Face comes upon a couple who are engaged in dining. He gently pats a man seated on a barstool before turning his attention to face the couple. Outside, Purvis catches sight of a window that offers a clear view of two women, a tuxedoed man, and a fourth person all enjoying drinks and smoking inside. As he inches ever closer, three men of working-class appearance emerge from the lodge. Purvis studies them intently, his eyes following their every move from his concealed position behind a tree. Back in Dillinger's room, a framed religious icon hangs contemplatively on the wall above his bed as he rests in thought. Outside, the car reverses. Purvis raises his Tommy gun with precision and expert handling. As the car begins to move forward, Purvis, along with two of his peers, opens fire with determination. The relentless gunshots eliminate the car's headlights and riddle it with bullet holes from top to bottom. Inside, Dillinger awakens with a start, swiftly grabbing his Tommy gun before moving quickly to the window. In the barroom, Baby Face returns fire through a window, just as Dillinger does from his second-story perch. As muzzle flashes light up the night all around, both indoors and outdoors, Winstead carefully aims a rifle shot from his position at the base of a sturdy tree. In Dillinger’s room, Wedge enters the fray, joining in the intense shootout. As Purvis sprints toward a tree closer to the disabled vehicle, Baby Face unleashes a fierce barrage of gunfire from a window in the barroom. Taking cover behind a tree, Purvis quickly reloads his weapon in preparation. As he makes a determined run toward the car, shell casings fly from the launch, and outside, Purvis observes the lifeless occupants now inside the vehicle."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Purvis's beady eyes intently gaze downward as he becomes absorbed in a deep and contemplative state. Later, with a focused intent, Purvis lifts the receiver of a candlestick phone and begins a conversation. On the other end of the line, a youthful-looking agent named Sam Cowley listens attentively, nods in understanding, and then methodically ends the call by placing the receiver back on its hook. Sam then proceeds to gather a collection of maps, his mind set on the task ahead. As preparations heighten, Sam's team arms themselves, readying for an operation of notable importance, while simultaneously, Purvis and his armed colleagues approach an airfield where they make their way onto a waiting prop plane, gearing up for their impending mission. Under the dim glow of a table lamp, a hand reaches out deliberately to turn on a boxy radio, the static giving way to the broadcast. The scene shifts to someone lying down on a modest twin bed, seeking a moment of respite. In another setting, Dillinger carefully picks up a cherished pocket watch from the nightstand, opens it with a gentle click, and lovingly gazes at a photo of Billie nestled inside the cover, taking a moment to admire her likeness. As Dillinger's profile gradually becomes a blur, the focus sharpens on the radio positioned in the background, the music continuing to play softly. Now, on a secluded forest road, two motorcars with their headlights extinguished cautiously creep forward, coming to a subtle halt as they park along the dirt shoulder. Emerging from the vehicles, Purvis, Winstead, and several others, clad in trench coats, step onto the scene. Purvis closes his car door with purpose, leaving it slightly ajar as if anticipating a swift return. The men, armed and ready, advance with determination, gripping rifles and submachine guns as they navigate through the shadowy woods. Standing shoulder to shoulder, Purvis and Winstead cast their gaze toward a lodge visible a few hundred yards away. In a silent exchange, Purvis locks eyes with Winstead, communicating an unspoken understanding. Their partner G-men disperse strategically, melting into the cover of the trees as they head toward the lodge. Inside, a barroom emits a warm glow, its atmosphere contrasting sharply with the tense scene outside where Purvis walks forward, intermittently moving in and out of the patches of light and shadow. Armed with a rifle, Baum approaches quietly on Purvis's left, blending into the backdrop of trees. In parallel, Winstead stealthily rounds past a tree trunk, positioning himself advantageously. Meanwhile, inside, Baby Face casually approaches a couple engaged in their dinner, patting a man seated on a barstool before directing his attention to the couple. Simultaneously, outside, Purvis observes a window that frames the lively scene of two women, a tuxedoed man, and an additional figure who are engaged in drinking and smoking, all oblivious to the impending danger. As Purvis inches closer, three men of working-class demeanor emerge from the lodge, catching his cautious attention as he takes cover behind a tree. In the privacy of Dillinger's room, a framed religious icon hangs solemnly above his bed, keeping silent watch as he rests. Outside, a car begins to reverse, stirring Purvis into action as he takes aim with his Tommy gun. As the car lurches forward, Purvis and two of his armed peers unleash a barrage of gunfire, systematically taking out the car's headlights and riddling the vehicle with bullet holes from top to bottom. Inside the lodge, the commotion stirs Dillinger, who springs into action, grabbing his Tommy gun and swiftly moving to the window. In the barroom, Baby Face quickly returns fire through a window, his actions mirrored by Dillinger from the second story, both men igniting the battle as muzzle flashes illuminate the night. Outside, Winstead, nestled at the base of a tree, carefully aligns his rifle sights, preparing for a precise shot. Within the confines of Dillinger's room, Wedge enters with urgency, joining the chaotic exchange of gunfire. Purvis, with a burst of speed, dashes toward a tree situated nearer to the now-disabled car, all while Baby Face maintains a relentless fusillade from a barroom window. Taking a moment to catch his breath and reload, Purvis gathers himself before charging once more toward the car, even as shells continue to erupt from the launch, his gaze falling upon the lifeless occupants within the vehicle, a silent testament to the night's violent events."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Purvis, deep in thought, later uses a candlestick phone to contact Sam Cowley, who nods, hangs up, and prepares maps. As Sam's team gears up, Purvis and his armed peers board a prop plane. Under dim light, a hand turns on a radio, and Dillinger, lying on a bed, admires a photo of Billie inside his pocket watch before the focus shifts to the radio. On a forest road, motorcars creep forward and park as Purvis, Winstead, and others in trench coats emerge, leaving a car door slightly open. Armed, they advance through the woods toward a distant lodge. Purvis and Winstead exchange a glance before G-men fan out through the trees. In a barroom, Baby Face approaches diners, while outside, Purvis observes through a window. As three men exit, Purvis watches from behind a tree. In Dillinger's room, a religious icon hangs as he rests. Outside, a car backs up, and Purvis fires his Tommy gun alongside peers, riddling the car with bullets. Dillinger, awakened, returns fire from a window, while Baby Face also shoots back from the barroom. Amidst the gunfire, Winstead lines up a shot from a tree. In Dillinger's room, Wedge joins in, and Purvis darts to a tree near the disabled car, seeking cover and reloading as Baby Face unleashes more fire. Purvis sees the car's lifeless occupants as the battle continues."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Purvis's beady eyes peer downward, deep in thought, perhaps contemplating the complexities of his law enforcement career during the 1930s crime wave in America. Later, Purvis uses a candlestick phone, once a common device before the advent of the rotary dial, to communicate with others. On the other end, a boyish agent, Sam Cowley, nods, hangs up, and grabs some maps, essential tools for tracking criminal activities across rural landscapes in that era. As Sam's team arms up, preparing with firearms typical of federal agents of the time, Purvis and his armed peers board a prop plane on an airfield, a method of rapid transportation for urgent missions. Now, under a dim table lamp, reminiscent of the low lighting in hideouts of the period, a hand turns on a boxy radio. He lies down on a modest twin bed, common in the frugal lodgings frequented by fugitives. Dillinger picks up his pocket watch off the nightstand, opens it, and admires a photo of Billie on the inside of the cover, a reminder of his romantic ties to Billie Frechette. Dillinger's profile grows blurry as the view focuses on the radio beyond, an object crucial for receiving news and updates. Now, on a forest road, two motorcars douse their headlights as they creep forward and park on the dirt shoulder, a stealth tactic to avoid detection. Purvis, Winstead, and several others in trench coats, standard attire for detectives in that era, climb out of the vehicles. Purvis closes his door most of the way but leaves it cracked open, a precautionary move to silence the latch. The men advance, armed with their rifles and submachine guns, the iconic Thompson guns favored by both lawmen and criminals, as the G-men cross the shadowy woods. Purvis and Winstead stand shoulder to shoulder as they spot the lodge a few hundred yards off, a hideout that often served as a criminal refuge. Purvis looks Winstead in the eye, signaling their readiness. The partner G-men filter outwards through the trees toward the lodge. Inside a warmly lit barroom, a scene of conviviality and tension. Outside, Purvis passes in and out of light as he treads forward. Toting a rifle, Baum comes up on his left, adding to the team’s firepower. Meanwhile, Winstead rounds past a tree, positioning himself strategically. Inside, Baby Face, known for his youthful appearance despite his criminal reputation, approaches a couple eating dinner. He pats a guy on a barstool then faces the couple, a casual gesture hiding his true intentions. Outside, Purvis spies a window framing a view of two women, a tuxedoed man, and a fourth person drinking and smoking inside, illustrating the lodge's social ambiance. As he stalks closer, three working-class men exit the lodge, potentially informants or lookouts. Purvis watches them closely from behind a tree, assessing the threat. Inside Dillinger's room, a framed religious icon hangs on the wall over his bed, reflecting the common practice of keeping spiritual symbols for protection. Outside, the car backs up. Purvis aims his Tommy gun, known for its rapid fire. The car starts forward. Purvis and two of his peers open fire. The shots knock out the headlights and riddle the car from top to bottom with holes, a tactic to immobilize the vehicle. Inside, Dillinger springs awake, grabs his Tommy gun, and goes to a window, preparing to defend himself. In the barroom, Baby Face returns fire through a window, as does Dillinger from the second story, creating a fierce exchange of gunfire. As muzzle flashes light up the night, indoors and out, Winstead carefully lines up a rifle shot from the base of a tree, seeking a clear target. Now in Dillinger's room, Wedge joins the shootout, adding to the defensives. As Purvis sprints for a tree closer to the disabled car, Baby Face unleashes a barrage of fire from a barroom window. Purvis takes cover and reloads. As he makes a run for the car, shells fire from the launch, their explosive power echoing through the night, and outside, Purvis sees the car's lifeless occupants, a grim end to the confrontation."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Purvis's beady eyes peer downward deep in thought. Later Purvis uses a candlestick phone. On the other end a boyish agent Sam Cowley nods hangs up and grabs some maps. As Sam's team arms up Purvis and his armed peers board a prop plane on an airfield. Now under a dim table lamp. a hand turns on a boxy radio. He lies down on a modest twin bed. Dillinger picks up his pocket watch off the nightstand opens it and admires a photo of Billie on the inside of the cover. Dillinger's profile grows blurry as the view focuses on the radio beyond. Now on a forest road two motorcars douse their headlights as they creep forward and park on the dirt shoulder. Purvis Winstead and several others in trench coats climb out of the vehicles. Purvis closes his door most of the way but leaves it cracked open. The men advance armed with their rifles and submachine guns as the Gmen cross the shadowy woods. Purvis and Winstead stand shoulder to shoulder as they spot the lodge a few hundred yards off. Purvis looks Winstead in the eye. The partner Gmen filter outwards through the trees toward the lodge. Inside a warmly lit barroom. Outside Purvis passes in and out of light as he treads forward. Toting a rifle Baum comes up on his left. Meanwhile Winstead rounds past a tree. Inside Baby Face approaches a couple eating dinner. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. He pats a guy on a barstool then faces the couple. Outside Purvis spies a window framing a view of two women. a tuxedoed man and a fourth person drinking and smoking inside. As he stalks closer three workingclass men exit the lodge. Purvis watches them closely from behind a tree. Inside Dillinger's room a framed religious icon hangs on the wall over his bed as he rests. Outside the car backs up. Purvis aims his Tommy gun. The car starts forward. Purvis and two of his peers open fire. The shots knock out the headlights and riddle the car from top to bottom with holes. Inside Dillinger springs awake grabs his Tommy gun and goes to a window. In the barroom Baby Face returns fire through a window as does Dillinger from the second story. As muzzle flashes light up the night indoors and out. Winstead carefully lines up a rifle shot from the base of a tree. Now in Dillinger's room. Wedge joins the shootout. As Purvis sprints for a tree closer to the disabled car Baby Face unleashes a barrage of fire from a barroom window. Purvis takes cover and reloads. As he makes a run for the car shells fire from the launch and outside. Purvis sees the car's lifeless occupants."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Purvis's beady eyes peer downward deep in thought. Later Purvis uses a candlestick phone. On the other end a boyish agent Sam Cowley nods hangs up and grabs some maps. As Sam's team arms up Purvis and his armed peers board a prop plane on an airfield. Now under a dim table lamp. a hand turns on a boxy radio. He lies down on a modest twin bed. Dillinger picks up his pocket watch off the nightstand opens it and admires a photo of Billie on the inside of the cover. Dillinger's profile grows blurry as the view focuses on the radio beyond. Now on a forest road two motorcars douse their headlights as they creep forward and park on the dirt shoulder. Purvis Winstead and several others in trench coats climb out of the vehicles. Purvis closes his door most of the way but leaves it cracked open. The men advance armed with their rifles and submachine guns as the Gmen cross the shadowy woods. Purvis and Winstead stand shoulder to shoulder as they spot the lodge a few hundred yards off. Purvis looks Winstead in the eye. The partner Gmen filter outwards through the trees toward the lodge. Inside a warmly lit barroom. Outside Purvis passes in and out of light as he treads forward. Toting a rifle Baum comes up on his left. Meanwhile Winstead rounds past a tree. Inside Baby Face approaches a couple eating dinner. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. He pats a guy on a barstool then faces the couple. Outside Purvis spies a window framing a view of two women. a tuxedoed man and a fourth person drinking and smoking inside. As he stalks closer three workingclass men exit the lodge. Purvis watches them closely from behind a tree. Inside Dillinger's room a framed religious icon hangs on the wall over his bed as he rests. Outside the car backs up. Purvis aims his Tommy gun. The car starts forward. Purvis and two of his peers open fire. The shots knock out the headlights and riddle the car from top to bottom with holes. Inside Dillinger springs awake grabs his Tommy gun and goes to a window. In the barroom Baby Face returns fire through a window as does Dillinger from the second story. As muzzle flashes light up the night indoors and out. Winstead carefully lines up a rifle shot from the base of a tree. Now in Dillinger's room. Wedge joins the shootout. As Purvis sprints for a tree closer to the disabled car Baby Face unleashes a barrage of fire from a barroom window. Purvis takes cover and reloads. As he makes a run for the car shells fire from the launch and outside. Purvis sees the car's lifeless occupants."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Purvis's beady eyes peer downward deep in thought. Later Purvis uses a candlestick phone. On the other end a boyish agent Sam Cowley nods hangs up and grabs some maps. As Sam's team arms up Purvis and his armed peers board a prop plane on an airfield. Now under a dim table lamp. a hand turns on a boxy radio. He lies down on a modest twin bed. Dillinger picks up his pocket watch off the nightstand opens it and admires a photo of Billie on the inside of the cover. Dillinger's profile grows blurry as the view focuses on the radio beyond. Now on a forest road two motorcars douse their headlights as they creep forward and park on the dirt shoulder. Purvis Winstead and several others in trench coats climb out of the vehicles. Inside Dillinger springs awake grabs his Tommy gun and goes to a window. In the barroom Baby Face returns fire through a window as does Dillinger from the second story. As muzzle flashes light up the night indoors and out. Winstead carefully lines up a rifle shot from the base of a tree. Now in Dillinger's room. Wedge joins the shootout. As Purvis sprints for a tree closer to the disabled car Baby Face unleashes a barrage of fire from a barroom window. Purvis takes cover and reloads. As he makes a run for the car shells fire from the launch and outside. Purvis sees the car's lifeless occupants."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Purvis's beady eyes peer downward deep in thought. Later Purvis uses a candlestick phone. On the other end a boyish agent Sam Cowley nods hangs up and grabs some maps. As Sam's team arms up Purvis and his armed peers board a prop plane on an airfield. Now under a dim table lamp. As Purvis sprints for a tree closer to the disabled car Baby Face unleashes a barrage of fire from a barroom window. Purvis takes cover and reloads. As he makes a run for the car shells fire from the launch and outside. Purvis sees the car's lifeless occupants."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Morton's wide ears flutter upward, lost in concentration. Later, Morton selects a rotary dial telephone. On the other end, a youthful gardener, Tom Casey, shrugs, puts down the receiver, and picks up some blueprints. As Tom's crew gathers supplies, Morton and his equipped colleagues hop onto a bicycle at a farmstead. Now, beneath a bright chandelier, a foot taps on a vintage gramophone. She sits on a luxurious king-size mattress. Huckleberry lifts his wristwatch off the bookshelf, flips it open, and studies a snapshot of Clara on the inside of the lid. Huckleberry's silhouette becomes hazy as the view zeroes in on the gramophone nearby. Now, on a coastal path, two tricycles brighten their taillights as they roll backward and stop on the gravel verge. Morton, Robertson, and several others in raincoats step out of the carts. Morton gently closes his hatch but leaves it slightly ajar. The group proceeds, equipped with their slingshots and boomerangs, as the workers traverse the misty foliage. Morton and Robertson stand back-to-back as they see the cabin a half-mile away. Morton glances Robertson in the jaw. The colleague workers disperse inward through the branches toward the cabin. Inside a brightly lit kitchen. Outside, Morton glides in and out of shadow as he strides backward. Carrying a bow, Green ascends on his right. Meanwhile, Robertson maneuvers past a shrub. Inside, Tiny Tim addresses a few customers eating dessert. He nudges a woman on a sofa then turns to face the group. Outside, Morton notices a skylight framing an angle of three gentlemen, a gown-wearing woman, and a fifth figure napping and humming inside. As he creeps nearer, four middle-class ladies leave the cabin. Morton observes them intently from beneath a bush. Inside Huckleberry's bathroom, a framed painting hangs on the ceiling above his couch as he naps. Outside, the wagon pulls forward. Morton points his blowgun. The wagon moves backward. Morton and two of his companions unleash arrows. The blasts shatter the side mirrors and puncture the wagon from trunk to hood with dents. Inside, Huckleberry jumps up, snatches his blowgun, and rushes to a balcony. In the kitchen, Tiny Tim responds with arrows through a crack, as does Huckleberry from the attic. As flare streaks illuminate the dusk, within and outside, Robertson cautiously targets a slingshot strike from the base of a shrub. Now in Huckleberry's bathroom, Prism joins the quarrel. As Morton jogs to a shrub closer to the broken wagon, Tiny Tim releases a storm of projectiles from a living room crack. Morton hides and replenishes. As he races to the wagon, acorns drop from the launch, and outside, Morton notices the wagon's unmoving passengers."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Purvis, deep in thought, contacts agent Sam Cowley, who gathers maps as his team prepares. Purvis' group boards a plane, while Dillinger, lying on his bed, admires a photo of Billie inside his pocket watch. On a forest road, Purvis, Winstead, and others approach a lodge, armed with rifles and submachine guns. Inside, Baby Face interacts with patrons, while outside, Purvis observes through a window. As Purvis and his peers target a car, they open fire, riddling it with bullets. Awoken by the commotion, Dillinger and Baby Face return fire. Muzzle flashes illuminate the scene as Winstead lines up a rifle shot. In the chaos, Wedge joins Dillinger in the shootout. Purvis races for cover, reloads, and sees the car's occupants lifeless as the battle continues."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Purvis sees the car's lifeless occupants As he makes a run for the car shells fire from the launch and outside Purvis takes cover and reloads As Purvis sprints for a tree closer to the disabled car Baby Face unleashes a barrage of fire from a barroom window Wedge joins the shootout Now in Dillinger's room Winstead carefully lines up a rifle shot from the base of a tree As muzzle flashes light up the night indoors and out In the barroom Baby Face returns fire through a window as does Dillinger from the second story Inside Dillinger springs awake grabs his Tommy gun and goes to a window The shots knock out the headlights and riddle the car from top to bottom with holes Purvis and two of his peers open fire The car starts forward Purvis aims his Tommy gun Outside the car backs up Inside Dillinger's room a framed religious icon hangs on the wall over his bed as he rests Purvis watches them closely from behind a tree As he stalks closer three workingclass men exit the lodge a tuxedoed man and a fourth person drinking and smoking inside Outside Purvis spies a window framing a view of two women He pats a guy on a barstool then faces the couple Inside Baby Face approaches a couple eating dinner Meanwhile Winstead rounds past a tree Toting a rifle Baum comes up on his left Outside Purvis passes in and out of light as he treads forward Inside a warmly lit barroom The partner Gmen filter outwards through the trees toward the lodge Purvis looks Winstead in the eye Purvis and Winstead stand shoulder to shoulder as they spot the lodge a few hundred yards off The men advance armed with their rifles and submachine guns as the Gmen cross the shadowy woods Purvis closes his door most of the way but leaves it cracked open Purvis Winstead and several others in trench coats climb out of the vehicles Now on a forest road two motorcars douse their headlights as they creep forward and park on the dirt shoulder Dillinger's profile grows blurry as the view focuses on the radio beyond Dillinger picks up his pocket watch off the nightstand opens it and admires a photo of Billie on the inside of the cover He lies down on a modest twin bed a hand turns on a boxy radio Now under a dim table lamp As Sam's team arms up Purvis and his armed peers board a prop plane on an airfield On the other end a boyish agent Sam Cowley nods hangs up and grabs some maps Later Purvis uses a candlestick phone Purvis's beady eyes peer downward deep in thought"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Later Purvis uses a candlestick phone Purvis's beady eyes peer downward deep in thought As Sam's team arms up Purvis and his armed peers board a prop plane on an airfield On the other end a boyish agent Sam Cowley nods hangs up and grabs some maps a hand turns on a boxy radio Now under a dim table lamp Dillinger picks up his pocket watch off the nightstand opens it and admires a photo of Billie on the inside of the cover He lies down on a modest twin bed Now on a forest road two motorcars douse their headlights as they creep forward and park on the dirt shoulder Dillinger's profile grows blurry as the view focuses on the radio beyond Purvis closes his door most of the way but leaves it cracked open Purvis Winstead and several others in trench coats climb out of the vehicles Purvis and Winstead stand shoulder to shoulder as they spot the lodge a few hundred yards off The men advance armed with their rifles and submachine guns as the Gmen cross the shadowy woods The partner Gmen filter outwards through the trees toward the lodge Purvis looks Winstead in the eye Outside Purvis passes in and out of light as he treads forward Inside a warmly lit barroom Meanwhile Winstead rounds past a tree Toting a rifle Baum comes up on his left He pats a guy on a barstool then faces the couple Inside Baby Face approaches a couple eating dinner a tuxedoed man and a fourth person drinking and smoking inside Outside Purvis spies a window framing a view of two women Purvis watches them closely from behind a tree As he stalks closer three workingclass men exit the lodge Outside the car backs up Inside Dillinger's room a framed religious icon hangs on the wall over his bed as he rests The car starts forward Purvis aims his Tommy gun The shots knock out the headlights and riddle the car from top to bottom with holes Purvis and two of his peers open fire In the barroom Baby Face returns fire through a window as does Dillinger from the second story Inside Dillinger springs awake grabs his Tommy gun and goes to a window Winstead carefully lines up a rifle shot from the base of a tree As muzzle flashes light up the night indoors and out Wedge joins the shootout Now in Dillinger's room Purvis takes cover and reloads As Purvis sprints for a tree closer to the disabled car Baby Face unleashes a barrage of fire from a barroom window Purvis sees the car's lifeless occupants As he makes a run for the car shells fire from the launch and outside"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He pats a guy on a barstool then faces the couple Outside Purvis spies a window framing a view of two women a tuxedoed man and a fourth person drinking and smoking inside As he stalks closer three workingclass men exit the lodge Purvis watches them closely from behind a tree Inside Dillinger's room a framed religious icon hangs on the wall over his bed as he rests Outside the car backs up Purvis aims his Tommy gun The car starts forward Purvis and two of his peers open fire The shots knock out the headlights and riddle the car from top to bottom with holes Inside Dillinger springs awake grabs his Tommy gun and goes to a window In the barroom Baby Face returns fire through a window as does Dillinger from the second story As muzzle flashes light up the night indoors and out Winstead carefully lines up a rifle shot from the base of a tree Now in Dillinger's room Wedge joins the shootout As Purvis sprints for a tree closer to the disabled car Baby Face unleashes a barrage of fire from a barroom window Purvis takes cover and reloads As he makes a run for the car shells fire from the launch and outside Purvis sees the car's lifeless occupants Purvis's beady eyes peer downward deep in thought Later Purvis uses a candlestick phone On the other end a boyish agent Sam Cowley nods hangs up and grabs some maps As Sam's team arms up Purvis and his armed peers board a prop plane on an airfield Now under a dim table lamp a hand turns on a boxy radio He lies down on a modest twin bed Dillinger picks up his pocket watch off the nightstand opens it and admires a photo of Billie on the inside of the cover Dillinger's profile grows blurry as the view focuses on the radio beyond Now on a forest road two motorcars douse their headlights as they creep forward and park on the dirt shoulder Purvis Winstead and several others in trench coats climb out of the vehicles Purvis closes his door most of the way but leaves it cracked open The men advance armed with their rifles and submachine guns as the Gmen cross the shadowy woods Purvis and Winstead stand shoulder to shoulder as they spot the lodge a few hundred yards off Purvis looks Winstead in the eye The partner Gmen filter outwards through the trees toward the lodge Inside a warmly lit barroom Outside Purvis passes in and out of light as he treads forward Toting a rifle Baum comes up on his left Meanwhile Winstead rounds past a tree Inside Baby Face approaches a couple eating dinner"
        }
      ]
    }
  ]
}