{
  "ground_truth": "Purvis empties his pistol into the man, and Baby Face drops onto his back as a plume of exhaled steam jets from his nose once. Purvis glares over his aimed pistol. Outside a small-town pharmacy, Dillinger returns to the heisted car, where Red leans, sweating and bloody, in the corner of the back seat. Dillinger pours antiseptic over Red's wounded abdomen, fusses with other supplies, applies gauze to the wound, and Red trains his puffy, exhausted eyes on Dillinger, his feeble smile fading. Dillinger slumps a little, then sits back, his blood-stained hand letting go of Red's shoulder. Eyes downcast, Dillinger stays seated by his deceased partner, swallowing and glancing at Red as his lips give a brief, irritated sneer, and he gazes downward. In a field office, Purvis faces his agents at night. On a city street, a scowling Dillinger drives past a parked car, which reflects electrical flashes from a passing train. Two agents sit in the parked vehicle, one a burly man with a Roman nose, peers at an apartment building across the street, while his partner sleeps. In the apartment, a seated Billie checks her watch, then turns up a radio, and the windows behind her show the passing train. Billie crosses the roomy, run-down apartment, then doubles back to a door, where a woman with similar short hair comes down a staircase, hands Billie a large, brown paper bag, and follows her into the apartment. As Billie dons her fur-collared coat, the newcomer takes Billie's seat by the radio. The woman wears a top similar to Billie's. As she skims a newspaper and turns up the radio, another elevated train passes in the windows. In the car, both G-men watch the apartment. In another car, two more agents see someone in an overcoat and fedora toting a paper bag across a dark alley, and the stranger ducks down a narrow passage and reaches out with a delicate hand to a brick wall—it's Billie in disguise. She comes to a street on the other end, carrying the brown paper bag, steps off the sidewalk between parked cars, and looks around in the middle of the street. A car's headlights illuminate and shine on her anxious face, and a car situated about a block away approaches and comes to a stop. Billie hops in next to Dillinger, who chews gum and smiles. Billie takes off the hat, kisses his cheek, and holds him as Dillinger drives off, and she rests her head on his shoulder. In the field office, Purvis and his agents listen to Madala, then the agents abruptly gaze out the door, and Purvis steps forward, arms folded across his chest. In the outer office, the solemn, burly agent stands with his partner, and as Purvis gazes at them, his eyes water.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Purvis drains his firearm into the man, and Baby Face falls onto his back as a plume of expelled vapor spurts from his nose once. Purvis glowers over his aimed firearm. Outside a small-town drugstore, Dillinger returns to the pilfered automobile, where Red reclines, perspiring and bloody, in the corner of the back seat. Dillinger pours disinfectant over Red's injured abdomen, fusses with other provisions, applies bandage to the injury, and Red directs his swollen, weary eyes on Dillinger, his weak smile waning. Dillinger droops a little, then sits back, his blood-soiled hand releasing Red's shoulder. Eyes downcast, Dillinger stays seated by his deceased comrade, swallowing and glancing at Red as his lips give a brief, irritated smirk, and he gazes downward. In a bureau office, Purvis faces his operatives at night. On a city street, a frowning Dillinger drives past a stationary car, which reflects electrical flashes from a passing train. Two operatives sit in the stationary vehicle, one a husky man with a Roman nose, peers at an apartment building across the street, while his partner slumbers. In the apartment, a seated Billie checks her watch, then turns up a radio, and the windows behind her show the passing train. Billie crosses the spacious, dilapidated apartment, then doubles back to a door, where a woman with similar short hair descends a staircase, hands Billie a large, brown paper sack, and follows her into the apartment. As Billie dons her fur-collared coat, the newcomer takes Billie's seat by the radio. The woman wears a top similar to Billie's. As she skims a newspaper and turns up the radio, another elevated train passes in the windows. In the car, both agents watch the apartment. In another car, two more operatives see someone in an overcoat and fedora carrying a paper sack across a dark alley, and the stranger ducks down a narrow passage and reaches out with a delicate hand to a brick wall—it's Billie in disguise. She comes to a street on the other end, carrying the brown paper sack, steps off the sidewalk between stationary cars, and looks around in the middle of the street. A car's headlights illuminate and shine on her anxious face, and a car situated about a block away approaches and comes to a stop. Billie hops in next to Dillinger, who chews gum and smiles. Billie takes off the hat, kisses his cheek, and holds him as Dillinger drives off, and she rests her head on his shoulder. In the bureau office, Purvis and his operatives listen to Madala, then the operatives abruptly gaze out the door, and Purvis steps forward, arms folded across his chest. In the outer office, the grave, husky operative stands with his partner, and as Purvis gazes at them, his eyes mist."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Purvis's pistol is emptied into the man by him, and Baby Face is dropped onto his back as a plume of exhaled steam is jetted from his nose once. Aimed pistol in hand, Purvis is glared over by him. Outside a small-town pharmacy, the heisted car is returned to by Dillinger, where Red is leaned, sweaty and bloody, in the corner of the back seat. Antiseptic is poured by Dillinger over Red's wounded abdomen, other supplies are fussed over, gauze is applied to the wound, and Dillinger is trained on by Red's puffy, exhausted eyes, his feeble smile fading. Dillinger is slumped a little by himself, then the seat is taken back by him, Red's shoulder is let go of by his blood-stained hand. Eyes downcast, Dillinger remains seated by his deceased partner, swallowing and glancing at Red as a brief, irritated sneer is given by his lips, and downward is gazed by him. In a field office, Purvis is faced with his agents at night. On a city street, a scowling Dillinger drives past a parked car, and electrical flashes from a passing train are reflected by it. The apartment building across the street is peered at by a burly man with a Roman nose who sits in the parked vehicle with his sleeping partner. In the apartment, the time is checked by a seated Billie, then a radio is turned up by her, and the passing train is shown by the windows behind her. The roomy, run-down apartment is crossed by Billie, then she doubles back to a door, where a woman with similar short hair descends a staircase, hands over a large, brown paper bag to Billie, and follows her into the apartment. Billie's fur-collared coat is donned by her, and Billie's seat by the radio is taken by the newcomer. A top similar to Billie's is worn by the woman. As a newspaper is skimmed and the radio is turned up by her, another elevated train is passed in the windows. The apartment is watched by both G-men in the car. In another car, two more agents see someone in an overcoat and fedora carrying a paper bag across a dark alley, and a narrow passage is ducked down by the stranger who reaches out with a delicate hand to a brick wall—it's Billie in disguise. A street on the other end is reached by her, the brown paper bag is carried, and the sidewalk is stepped off by her between parked cars, looking around in the middle of the street. Billie is illuminated by a car's headlights, and her anxious face is shone on, while a car situated about a block away approaches and stops. Next to Dillinger, Billie hops in as he chews gum and smiles. The hat is taken off by Billie, and Dillinger's cheek is kissed by her, holding him as the car is driven off, and her head is rested on his shoulder. In the field office, Madala is listened to by Purvis and his agents, then the door is abruptly gazed out by the agents, and forward is stepped by Purvis, arms folded across his chest. In the outer office, the solemn, burly agent stands with his partner, and as Purvis gazes at them, his eyes water."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Purvis empties his pistol into the man, and Baby Face collapses, exhaling steam through his nose. Purvis glares over his aimed pistol. Outside a pharmacy, Dillinger returns to the getaway car, where Red leans, sweating and bloody, in the back seat. Dillinger pours antiseptic on Red's wound, applies gauze, and Red's feeble smile fades. Dillinger slumps, releases Red's shoulder, and stays seated by his deceased partner, swallowing and glancing at him with brief irritation. In a field office, Purvis faces his agents at night. On a city street, Dillinger drives past a parked car reflecting train flashes. Two agents sit inside; one watches an apartment, while his partner sleeps. Inside, Billie checks her watch, turns up the radio, and a train passes in the windows. Another woman brings Billie a paper bag and follows her into the apartment. Billie dons a fur-collared coat, and the newcomer sits by the radio. As she reads a newspaper, another train passes. Both G-men monitor the apartment. In another car, two agents see someone in an overcoat with a paper bag crossing an alley; it's Billie in disguise. She reaches a street, looks around, and is illuminated by approaching headlights. She hops in a car with Dillinger, kisses his cheek, and rests her head on his shoulder as they drive away. In the field office, Purvis and his agents listen to Madala. The agents suddenly look out the door, and Purvis steps forward, arms crossed, as his eyes water."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Purvis empties his pistol into the man, causing Baby Face to fall back, exhaling steam. Purvis glares over his gun. Outside a small-town pharmacy, Dillinger returns to the car with wounded Red in the back seat. Dillinger treats Red's abdomen, applies gauze, and Red's exhausted eyes meet Dillinger's as his smile fades. Dillinger, blood-stained, slumps beside his deceased partner, sneering briefly before gazing downward. In a field office, Purvis meets his agents at night. Dillinger drives past a parked car as a train's flashes reflect off it. Inside, a burly agent with a Roman nose watches an apartment as his partner sleeps. In the apartment, Billie checks her watch, turns up the radio, and accepts a large paper bag from a similar-looking woman. Billie dons a fur coat, and the woman takes her seat. Another train passes as she skims a newspaper. Agents watch the apartment. Elsewhere, two agents see someone in an overcoat with a paper bag cross a dark alley—it's Billie in disguise. She reaches a street, car headlights reveal her anxious face, and a nearby car stops. Billie joins Dillinger, removes her hat, kisses him, and rests on his shoulder as they drive off. In the field office, Purvis listens to Madala, then steps forward, arms folded, as agents glance out the door and his eyes well up."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Purvis steadily empties his pistol into the man lying before him, and Baby Face Nelson falls dramatically onto his back, a sudden plume of exhaled steam jetting from his nose in a singular puff. Purvis maintains his fierce glare over the barrel of his aimed pistol. Outside the unassuming, small-town pharmacy, John Dillinger makes his way back to the getaway car they had earlier heisted. There, Red is slumped, looking distressed and sweating profusely, leaning painfully in the corner of the back seat, bloodied from the fray. Dillinger meticulously pours antiseptic over Red's wounded abdomen, fussing with the assortment of medical supplies he has gathered, and proceeds to carefully apply gauze to the open wound. Red turns his swollen, weary eyes towards Dillinger, managing a weak smile that soon fades away. Dillinger lets himself slump slightly, then resigns to sit back, his blood-stained hand loosening its grip on Red's shoulder. His eyes cast downward, Dillinger remains seated by his deceased partner, swallowing hard and glancing at Red's lifeless body as his lips curl into a brief, irritated sneer, before he fixes his gaze downward once more. Meanwhile, in a dimly-lit field office, Purvis stands facing his agents during the quiet night. On a bustling city street, a stern-looking Dillinger drives past a parked car, its windows flickering with the reflected electrical flashes emanating from a train passing by nearby. Two agents are stationed inside the parked vehicle, one a burly man with a Roman nose, who peers intently at an apartment building situated across the street, while his partner is asleep. Inside the apartment, a seated Billie checks her watch with a sense of urgency, then proceeds to turn up the volume on a radio, the windows behind her revealing yet another train speeding past. Billie moves across the spacious yet run-down apartment, before doubling back to meet a door where a woman with similar short hair descends a staircase, hands Billie a large, brown paper bag, and follows her back into the apartment. As Billie dons her fur-collared coat with purpose, the newcomer takes Billie's previous seat by the radio. The woman, wearing a top similar to Billie's, skims through a newspaper and turns up the radio even further, as another elevated train streaks by in the windows behind her. Back in the car, the two vigilant G-men continue their watch over the apartment. In yet another car, two additional agents observe as someone clad in an overcoat and fedora carries a paper bag across a dimly lit alley, the mysterious figure ducking into a narrow passageway and reaching out with a delicate hand to touch a brick wall—it’s Billie, cleverly disguised. She emerges on a street at the other end, with the brown paper bag still in her possession, stepping off the sidewalk between the parked cars, cautiously looking around in the middle of the street. The glaring headlights of a car illuminate her anxious face as a vehicle situated about a block away begins to approach and eventually comes to a halt. Billie quickly hops into the car next to Dillinger, who is nonchalantly chewing gum and grinning. Billie removes the hat, leans in to kiss his cheek tenderly, and holds him closely as Dillinger drives off into the night, with her head resting gently on his shoulder. Back at the field office, Purvis and his agents listen intently to Madala, and then, almost instinctively, the agents abruptly gaze toward the door. Purvis steps forward intently, his arms folded firmly across his chest. In the outer office, the solemn, burly agent stands alongside his partner, and as Purvis looks at them, his eyes glisten with unspilled tears, a testament to the weight of recent events."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Purvis methodically empties his pistol with unwavering determination into the man lying defenseless before him, and Baby Face Nelson collapses dramatically onto his back. A sudden plume of exhaled steam bursts forth from his nose in a singular, visible puff. Purvis maintains his fierce and concentrated glare over the barrel of his aimed pistol, exhibiting no sign of relief or hesitation. Outside the unassuming and modest small-town pharmacy, John Dillinger makes his way back to the getaway car that they had earlier commandeered in their heist. There, Red is slumped, looking distressed and sweating profusely. He leans painfully in the corner of the back seat, bloodied from the violent fray. Dillinger meticulously pours antiseptic over Red's wounded abdomen, fussing with the assortment of medical supplies he has gathered, and carefully applies gauze to the gaping, open wound. Red turns his swollen, weary eyes towards Dillinger, managing a weak, momentary smile that soon fades away with his waning strength. Dillinger allows himself to slump slightly; he then resigns to sit back, his blood-stained hand loosening its grip on Red's shoulder, realizing that nothing more can be done. His eyes cast downward with sorrow, Dillinger remains seated by his deceased partner, swallowing hard as he glances at Red's lifeless body. His lips curl into a brief, irritated sneer before he fixes his gaze downward once more, contemplating in silence. Meanwhile, in a dimly-lit field office during the stillness of the quiet night, Purvis stands facing his gathered agents. On a bustling city street, a stern-looking Dillinger drives past a parked car, its windows flickering with the reflected electrical flashes emanating from a nearby passing train. Two agents are stationed inside the parked vehicle; one is a burly man with a distinctly Roman nose, who peers intently at an apartment building situated across the street, while his partner sleeps beside him. Inside the apartment, a seated Billie checks her watch with a rising sense of urgency, then proceeds to turn up the volume on a radio, the windows behind her revealing yet another train speeding past in the distance. Billie moves across the spacious yet run-down apartment, before doubling back to meet a door. There, a woman with similar short hair descends a staircase, hands Billie a large brown paper bag, and follows her back into the apartment. As Billie dons her fur-collared coat with a purposeful air, the newcomer takes Billie's previous seat by the radio. The woman, wearing a top similar to Billie's, skims through a newspaper and turns up the radio even further, as another elevated train streaks by in the windows behind her. Back in the car, the two vigilant G-men continue their watchful surveillance over the apartment. In yet another car, two additional agents observe as a mysterious figure, clad in an overcoat and fedora, carries a paper bag across a dimly-lit alley. The figure ducks into a narrow passageway and reaches out with a delicate hand to touch a brick wall—it’s Billie, cleverly disguised. She emerges on a street at the other end, with the brown paper bag still in her possession. She steps off the sidewalk between the parked cars, cautiously looking around in the middle of the street. The glaring headlights of an approaching car illuminate her anxious face as a vehicle situated about a block away begins to approach and eventually comes to a halt. Billie quickly hops into the car next to Dillinger, who is nonchalantly chewing gum and grinning mischievously. Billie removes the hat, leans in to kiss his cheek tenderly, and holds him closely as Dillinger drives off into the night, with her head resting gently on his shoulder, a picture of comfort despite the underlying tension. Back at the field office, Purvis and his agents listen intently to Madala, and then, as if driven by an unspoken instinct, the agents abruptly gaze toward the door. Purvis steps forward with intent, his arms folded firmly across his chest in a stance of quiet resolution. In the outer office, the solemn, burly agent stands alongside his partner, and as Purvis looks at them, his eyes glisten with unspilled tears, a silent testament to the emotional weight of the recent events that they have all endured."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Purvis stands with a steady arm, methodically emptying his pistol into the man, each bullet finding its mark with precision. Baby Face, as if in slow motion, collapses onto his back, and a singular plume of exhaled steam escapes forcefully from his nose. Purvis maintains his severe glare, peering over his poised pistol with intense focus. Outside a small-town pharmacy, Dillinger strides back to the heisted car with urgency, where Red rests in a corner of the back seat, his body glistening with sweat and marked by a fresh, bloody wound. Dillinger, with hurried care, pours antiseptic over the grievous injury on Red's abdomen, taking a moment to organize other medical supplies with a sense of urgency. He then applies gauze with a gentle but firm touch to the wounded area. Red fixes his swollen, weary eyes on Dillinger, offering a feeble smile that quickly fades, overwhelmed by exhaustion. Dillinger allows his shoulders to slacken slightly before he settles back into the seat, his hand, stained with blood, slipping away from its supportive grip on Red's shoulder. He keeps his eyes lowered, remaining seated beside his deceased partner, swallowing hard to suppress his grief. He occasionally casts glances at Red while his lips curl into a momentary, irritated sneer, and then he returns his gaze downward, absorbed in silent mourning. In a dimly lit field office, Purvis stands resolute, facing his agents under the cover of night. Meanwhile, on a city street, Dillinger drives with a scowl etched on his face, cruising past a parked car that catches and reflects the flickering electrical flashes of a passing train. Within the parked vehicle, two agents are stationed; one, a burly man with a prominent Roman nose, remains vigilant as he peers intently across the street at an apartment building, while his partner is slumped in sleep. Inside the apartment, Billie, seated and appearing restless, checks her watch before turning up the volume on the radio, the sound accompanied by the rhythmic clatter of a passing train seen through the windows behind her. She crosses the expansively shabby apartment with purpose, only to pivot and return to a door as a woman with a matching short hairstyle descends a staircase. This woman silently hands Billie a large, brown paper bag and trails her into the apartment. Billie, embracing the cold with a fur-collared coat, watches as the newcomer takes her vacated seat by the radio. The woman, dressed in an outfit reminiscent of Billie's own, skims through a newspaper and, with a slight twist of her wrist, increases the volume of the radio as yet another elevated train rumbles past the windows. Back in the car, the G-men keep their vigilant eyes on the apartment. In a separate car, another duo of agents catches sight of a mysterious figure, clad in an overcoat and fedora while handling a paper bag, making their way stealthily across a dark alley. The enigmatic figure ducks into a narrow passage, extending a delicate hand toward a brick wall, revealing it to be Billie, cleverly disguised. She continues onward until reaching the street on the alley's other end, carefully carrying the brown paper bag. She steps off the sidewalk, weaving between parked cars, and glances around cautiously in the street's center. Suddenly, the bright glare of a car's headlights captures her anxious expression, and a vehicle situated about a block away approaches slowly, coming to a calculated stop. Billie quickly slips into the car beside Dillinger, who greets her with a smile and continues chewing gum. She removes the hat and leans over to plant a kiss on his cheek, then wraps an arm around him as Dillinger resumes driving, allowing her head to rest comfortably on his shoulder as they move forward. Back in the field office, Purvis and his agents are gathered, attentively listening to Madala, when their focus is abruptly broken as they collectively turn their gaze toward the door. Purvis steps forward with a deliberate stride, arms folding across his chest with authority. In the outer office, the solemn, burly agent stands alongside his partner, maintaining a watchful presence. As Purvis examines them, emotion wells up in his eyes, threatening to spill over as he absorbs the weight of the moment."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Purvis empties his pistol into the man, causing Baby Face to fall onto his back as a plume of steam jets from his nose. Purvis stands over him, glaring with his pistol still aimed. Outside a small-town pharmacy, Dillinger returns to the getaway car, where Red sits, sweating and injured, in the back seat. Dillinger administers first aid by pouring antiseptic on Red's wound, applying gauze, and offering comfort as Red's smile fades, leaving Dillinger to slump beside his deceased partner, reflecting on the loss with a brief sneer. \n\nIn a field office, Purvis addresses his agents. Meanwhile, on a city street, a scowling Dillinger drives past a parked car that reflects electrical flashes from a train. In the parked car, one agent watches an apartment while his partner sleeps. Inside the apartment, Billie checks the time, turns up the radio, and interacts with a woman who resembles her, exchanging positions as another train passes by the window. The agents continue to monitor the apartment.\n\nElsewhere, two more agents spot someone in an overcoat with a paper bag moving discreetly through an alley; it's Billie in disguise. She navigates the streets and pauses under the glare of approaching headlights before getting into a car with Dillinger, who drives away as she removes her disguise, kisses him, and rests her head on his shoulder. Back at the field office, Purvis and his agents listen to an update from Madala before an unexpected moment causes them to look toward the door, with Purvis's eyes watering as he observes the solemn agents outside."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Purvis empties his pistol into the man, and Baby Face, the notorious bank robber known for his youthful appearance despite a life of crime, drops onto his back as a plume of exhaled steam, a visual reminder of the cold night air, jets from his nose once. Purvis, a determined and relentless FBI agent leading the pursuit against infamous criminals of the era, glares over his aimed pistol. Outside a small-town pharmacy, an establishment that often doubled as a community hub in rural areas, Dillinger returns to the heisted car, a common practice of using stolen vehicles during getaway attempts in the 1930s, where Red leans, sweating and bloody, in the corner of the back seat. Dillinger pours antiseptic, a crucial but basic medical supply for treating wounds in the field, over Red's wounded abdomen, fusses with other supplies, applies gauze to the wound, and Red trains his puffy, exhausted eyes on Dillinger, his feeble smile fading. Dillinger, the famed Depression-era outlaw who became a symbol of defiance against the system, slumps a little, then sits back, his blood-stained hand letting go of Red's shoulder. Eyes downcast, Dillinger stays seated by his deceased partner, swallowing and glancing at Red as his lips give a brief, irritated sneer, and he gazes downward, overwhelmed by the harsh realities of their criminal lifestyle. In a field office, a strategic hub for the FBI's operations, Purvis faces his agents at night. On a city street, a scowling Dillinger drives past a parked car, which reflects electrical flashes from a passing train, a rapid transit staple of urban environments. Two agents sit in the parked vehicle, one a burly man with a Roman nose, peers at an apartment building across the street, a common stakeout location in an era rife with bootlegging and organized crime, while his partner sleeps. In the apartment, a seated Billie, a close confidante of Dillinger and frequently under surveillance by law enforcement, checks her watch, then turns up a radio, a primary source of news and entertainment in the 1930s, and the windows behind her show the passing train. Billie crosses the roomy, run-down apartment typical of the era's urban housing, then doubles back to a door, where a woman with similar short hair comes down a staircase, hands Billie a large, brown paper bag, often used for carrying illicit goods during Prohibition, and follows her into the apartment. As Billie dons her fur-collared coat, a sign of fashion and status at the time, the newcomer takes Billie's seat by the radio. The woman wears a top similar to Billie's, indicating a shared sense of style or alliance. As she skims a newspaper, another essential medium for information before television, and turns up the radio, another elevated train, a hallmark of city life, passes in the windows. In the car, both G-men, a colloquial term for government agents, watch the apartment. In another car, two more agents see someone in an overcoat and fedora, typical attire for blending into urban environments while engaging in clandestine activities, toting a paper bag across a dark alley, and the stranger ducks down a narrow passage and reaches out with a delicate hand to a brick wall—it's Billie in disguise. She comes to a street on the other end, carrying the brown paper bag, steps off the sidewalk between parked cars, common obstacles in a congested city, and looks around in the middle of the street. A car's headlights illuminate and shine on her anxious face, and a car situated about a block away approaches and comes to a stop. Billie hops in next to Dillinger, who chews gum, a casual habit that contrasts sharply with their dangerous lifestyle, and smiles. Billie takes off the hat, kisses his cheek, and holds him as Dillinger drives off, and she rests her head on his shoulder, creating a rare moment of tenderness amidst their perilous pursuits. In the field office, Purvis and his agents listen to Madala, a likely source of inside information or updates on their targets, then the agents abruptly gaze out the door, and Purvis steps forward, arms folded across his chest in a posture of authority and resolve. In the outer office, the solemn, burly agent stands with his partner, and as Purvis gazes at them, his eyes water, reflecting the emotional toll of their relentless fight against crime."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Billie hops in next to Dillinger who chews gum and smiles Purvis empties his pistol into the man and Baby Face drops onto his back as a plume of exhaled steam jets from his nose once Purvis glares over his aimed pistol Dillinger slumps a little then sits back his bloodstained hand letting go of Red's shoulder In the apartment a seated Billie checks her watch then turns up a radio and the windows behind her show the passing train Outside a smalltown pharmacy Dillinger returns to the heisted car where Red leans sweating and bloody in the corner of the back seat Dillinger pours antiseptic over Red's wounded abdomen fusses with other supplies applies gauze to the wound and Red trains his puffy exhausted eyes on Dillinger his feeble smile fading Eyes downcast Dillinger stays seated by his deceased partner swallowing and glancing at Red as his lips give a brief irritated sneer and he gazes downward As she skims a newspaper and turns up the radio another elevated train passes in the windows Outside a smalltown pharmacy Dillinger returns to the heisted car where Red leans sweating and bloody in the corner of the back seat Dillinger pours antiseptic over Red's wounded abdomen fusses with other supplies applies gauze to the wound and Red trains his puffy exhausted eyes on Dillinger his feeble smile fading Dillinger slumps a little then sits back his bloodstained hand letting go of Red's shoulder Eyes downcast Dillinger stays seated by his deceased partner swallowing and glancing at Red as his lips give a brief irritated sneer and he gazes downward In a field office Purvis faces his agents at night On a city street a scowling Dillinger drives past a parked car which reflects electrical flashes from a passing train Two agents sit in the parked vehicle one a burly man with a Roman nose peers at an apartment building across the street while his partner sleeps In the apartment a seated Billie checks her watch then turns up a radio and the windows behind her show the passing train Billie crosses the roomy rundown apartment then doubles back to a door where a woman with similar short hair comes down a staircase hands Billie a large brown paper bag and follows her into the apartment As Billie dons her furcollared coat the newcomer takes Billie's seat by the radio The woman wears a top similar to Billie's The woman wears a top similar to Billie's As she skims a newspaper and turns up the radio another elevated train passes in the windows Billie takes off the hat kisses his cheek and holds him as Dillinger drives off and she rests her head on his shoulder Billie crosses the roomy rundown apartment then doubles back to a door where a woman with similar short hair comes down a staircase hands Billie a large brown paper bag and follows her into the apartment In the car both Gmen watch the apartment In another car two more agents see someone in an overcoat and fedora toting a paper bag across a dark alley and the stranger ducks down a narrow passage and reaches out with a delicate hand to a brick wall—it is Billie in disguise She comes to a street on the other end carrying the brown paper bag steps off the sidewalk between parked cars and looks around in the middle of the street A car's headlights illuminate and shine on her anxious face and a car situated about a block away approaches and comes to a stop Billie hops in next to Dillinger who chews gum and smiles Purvis empties his pistol into the man and Baby Face drops onto his back as a plume of exhaled steam jets from his nose once Purvis glares over his aimed pistol Billie takes off the hat kisses his cheek and holds him as Dillinger drives off and she rests her head on his shoulder In the field office Purvis and his agents listen to Madala then the agents abruptly gaze out the door and Purvis steps forward arms folded across his chest In the outer office the solemn burly agent stands with his partner and as Purvis gazes at them his eyes water"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Purvis empties his pistol into the man and Baby Face drops onto his back as a plume of exhaled steam jets from his nose once Purvis glares over his aimed pistol. Outside a smalltown pharmacy Dillinger returns to the heisted car where Red leans sweating and bloody in the corner of the back seat Dillinger pours antiseptic over Red's wounded abdomen fusses with other supplies applies gauze to the wound and Red trains his puffy exhausted eyes on Dillinger his feeble smile fading. Dillinger slumps a little then sits back his bloodstained hand letting go of Red's shoulder. Eyes downcast Dillinger stays seated by his deceased partner swallowing and glancing at Red as his lips give a brief irritated sneer and he gazes downward. In a field office Purvis faces his agents at night. On a city street a scowling Dillinger drives past a parked car which reflects electrical flashes from a passing train. Two agents sit in the parked vehicle one a burly man with a Roman nose peers at an apartment building across the street while his partner sleeps. In the apartment a seated Billie checks her watch then turns up a radio and the windows behind her show the passing train. Billie crosses the roomy rundown apartment then doubles back to a door where a woman with similar short hair comes down a staircase hands Billie a large brown paper bag and follows her into the apartment. As Billie dons her furcollared coat the newcomer takes Billie's seat by the radio. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The woman wears a top similar to Billie's. As she skims a newspaper and turns up the radio another elevated train passes in the windows. In the car both Gmen watch the apartment. In another car two more agents see someone in an overcoat and fedora toting a paper bag across a dark alley and the stranger ducks down a narrow passage and reaches out with a delicate hand to a brick wall—it is Billie in disguise. She comes to a street on the other end carrying the brown paper bag steps off the sidewalk between parked cars and looks around in the middle of the street. A car's headlights illuminate and shine on her anxious face and a car situated about a block away approaches and comes to a stop. Billie hops in next to Dillinger who chews gum and smiles. Billie takes off the hat kisses his cheek and holds him as Dillinger drives off and she rests her head on his shoulder. In the field office Purvis and his agents listen to Madala then the agents abruptly gaze out the door and Purvis steps forward arms folded across his chest. In the outer office the solemn burly agent stands with his partner and as Purvis gazes at them his eyes water."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Purvis empties his pistol into the man and Baby Face drops onto his back as a plume of exhaled steam jets from his nose once Purvis glares over his aimed pistol. Outside a smalltown pharmacy Dillinger returns to the heisted car where Red leans sweating and bloody in the corner of the back seat Dillinger pours antiseptic over Red's wounded abdomen fusses with other supplies applies gauze to the wound and Red trains his puffy exhausted eyes on Dillinger his feeble smile fading. Dillinger slumps a little then sits back his bloodstained hand letting go of Red's shoulder. Eyes downcast Dillinger stays seated by his deceased partner swallowing and glancing at Red as his lips give a brief irritated sneer and he gazes downward. In a field office Purvis faces his agents at night. On a city street a scowling Dillinger drives past a parked car which reflects electrical flashes from a passing train. Two agents sit in the parked vehicle one a burly man with a Roman nose peers at an apartment building across the street while his partner sleeps. In the apartment a seated Billie checks her watch then turns up a radio and the windows behind her show the passing train. Billie crosses the roomy rundown apartment then doubles back to a door where a woman with similar short hair comes down a staircase hands Billie a large brown paper bag and follows her into the apartment. As Billie dons her furcollared coat the newcomer takes Billie's seat by the radio. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. The woman wears a top similar to Billie's. As she skims a newspaper and turns up the radio another elevated train passes in the windows. In the car both Gmen watch the apartment. In another car two more agents see someone in an overcoat and fedora toting a paper bag across a dark alley and the stranger ducks down a narrow passage and reaches out with a delicate hand to a brick wall—it is Billie in disguise. She comes to a street on the other end carrying the brown paper bag steps off the sidewalk between parked cars and looks around in the middle of the street. A car's headlights illuminate and shine on her anxious face and a car situated about a block away approaches and comes to a stop. Billie hops in next to Dillinger who chews gum and smiles. Billie takes off the hat kisses his cheek and holds him as Dillinger drives off and she rests her head on his shoulder. In the field office Purvis and his agents listen to Madala then the agents abruptly gaze out the door and Purvis steps forward arms folded across his chest. In the outer office the solemn burly agent stands with his partner and as Purvis gazes at them his eyes water."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Purvis empties his pistol into the man and Baby Face drops onto his back as a plume of exhaled steam jets from his nose once Purvis glares over his aimed pistol. Outside a smalltown pharmacy Dillinger returns to the heisted car where Red leans sweating and bloody in the corner of the back seat Dillinger pours antiseptic over Red's wounded abdomen fusses with other supplies applies gauze to the wound and Red trains his puffy exhausted eyes on Dillinger his feeble smile fading. Dillinger slumps a little then sits back his bloodstained hand letting go of Red's shoulder. Eyes downcast Dillinger stays seated by his deceased partner swallowing and glancing at Red as his lips give a brief irritated sneer and he gazes downward. In a field office Purvis faces his agents at night. A car's headlights illuminate and shine on her anxious face and a car situated about a block away approaches and comes to a stop. Billie hops in next to Dillinger who chews gum and smiles. Billie takes off the hat kisses his cheek and holds him as Dillinger drives off and she rests her head on his shoulder. In the field office Purvis and his agents listen to Madala then the agents abruptly gaze out the door and Purvis steps forward arms folded across his chest. In the outer office the solemn burly agent stands with his partner and as Purvis gazes at them his eyes water."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Purvis empties his pistol into the man and Baby Face drops onto his back as a plume of exhaled steam jets from his nose once Purvis glares over his aimed pistol. Outside a smalltown pharmacy Dillinger returns to the heisted car where Red leans sweating and bloody in the corner of the back seat Dillinger pours antiseptic over Red's wounded abdomen fusses with other supplies applies gauze to the wound and Red trains his puffy exhausted eyes on Dillinger his feeble smile fading. In the field office Purvis and his agents listen to Madala then the agents abruptly gaze out the door and Purvis steps forward arms folded across his chest. In the outer office the solemn burly agent stands with his partner and as Purvis gazes at them his eyes water."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Stewart empties his pistol into the man, and Baby Face drops onto his back as a plume of exhaled steam jets from his nose once. Stewart glares over his aimed pistol. Outside a small-town pharmacy, Clarkson returns to the heisted car, where Ginger leans, sweating and bloody, in the corner of the back seat. Clarkson pours antiseptic over Ginger's wounded abdomen, fusses with other supplies, applies gauze to the wound, and Ginger trains his puffy, exhausted eyes on Clarkson, his feeble smile fading. Clarkson slumps a little, then sits back, his blood-stained hand letting go of Ginger's shoulder. Eyes downcast, Clarkson stays seated by his deceased partner, swallowing and glancing at Ginger as his lips give a brief, irritated sneer, and he gazes downward. In a field office, Stewart faces his agents at night. On a city street, a scowling Clarkson drives past a parked car, which reflects electrical flashes from a passing train. Two cats sit in the parked vehicle, one a burly cat with a Roman nose, peers at an apartment building across the street, while his partner sleeps. In the apartment, a seated Dorothy checks her watch, then turns up a radio, and the windows behind her show the passing train. Dorothy crosses the roomy, run-down apartment, then doubles back to a door, where a fox with similar short hair comes down a staircase, hands Dorothy a large, brown paper bag, and follows her into the apartment. As Dorothy dons her fur-collared coat, the newcomer takes Dorothy's seat by the radio. The fox wears a top similar to Dorothy's. As the fox skims a newspaper and turns up the radio, another elevated train passes in the windows. In the car, both owls watch the apartment. In another car, two more seagulls see someone in an overcoat and fedora toting a paper bag across a dark alley, and the stranger ducks down a narrow passage and reaches out with a delicate hand to a brick wall—it's Dorothy in disguise. She comes to a street on the other end, carrying the brown paper bag, steps off the sidewalk between parked cars, and looks around in the middle of the street. A car's headlights illuminate and shine on her anxious face, and a bus situated about a block away approaches and comes to a stop. Dorothy hops in next to Clarkson, who chews gum and smiles. Dorothy takes off the hat, kisses his cheek, and holds him as Clarkson drives off, and she rests her head on his shoulder. In the field office, Stewart and his agents listen to Madala, then the agents abruptly gaze out the door, and Stewart steps forward, arms folded across his chest. In the outer office, the solemn, burly owl stands with his partner, and as Stewart gazes at them, his eyes water."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Purvis empties his slingshot into the man, and Baby Face drops onto his back as a plume of exhaled ink jets from his nose once. Purvis glares over his aimed slingshot. Outside a small-town bakery, Dillinger returns to the borrowed bicycle, where Red leans, sweating and muddy, in the corner of the back seat. Dillinger pours lemonade over Red's wounded knee, fusses with other knick-knacks, applies tape to the wound, and Red trains his puffy, exhausted eyes on Dillinger, his feeble smile fading. Dillinger slumps a little, then sits back, his paint-stained hand letting go of Red's shoulder. Eyes downcast, Dillinger stays seated by his drenched partner, swallowing and glancing at Red as his lips give a brief, irritated sneer, and he gazes downward. In a barn office, Purvis faces his agents at night. On a country road, a scowling Dillinger rides past a parked tractor, which reflects electrical flashes from a passing carousel. Two agents sit in the parked tractor, one a burly man with a Roman nose, peers at a farmhouse across the street, while his partner sleeps. In the farmhouse, a seated Billie checks her sundial, then turns up a gramophone, and the windows behind her show the passing carousel. Billie crosses the spacious, run-down farmhouse, then doubles back to a door, where a woman with similar short hair comes down a spiral staircase, hands Billie a large, red gift box, and follows her into the farmhouse. As Billie dons her velvet-trimmed cape, the newcomer takes Billie's seat by the gramophone. The woman wears a dress similar to Billie's. As she skims a magazine and turns up the gramophone, another wandering horse passes in the windows. In the tractor, both G-men watch the farmhouse. In another cart, two more agents see someone in a topcoat and beret toting a gift box across a dim alley, and the stranger ducks down a narrow passage and reaches out with a delicate hand to a stone wall—it's Billie in disguise. She comes to a path on the other end, carrying the red gift box, steps off the path between parked wagons, and looks around in the middle of the street. A tractor's headlights illuminate and shine on her anxious face, and a cart situated about a block away approaches and comes to a stop. Billie hops in next to Dillinger, who chews licorice and smiles. Billie takes off the beret, kisses his cheek, and holds him as Dillinger rides off, and she rests her head on his shoulder. In the barn office, Purvis and his agents listen to Madala, then the agents abruptly gaze out the door, and Purvis steps forward, arms folded across his chest. In the outer office, the solemn, burly agent stands with his partner, and as Purvis gazes at them, his eyes water."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Purvis dribbles his pistol near the man, and Baby Face spins onto his back as a plume of exhaled steam rises from his nose once. Purvis squints over his aimed pistol. Outside a small-town pharmacy, Dillinger strolls to the heisted car, where Red lounges, sweating and bloody, in the corner of the back seat. Dillinger sprinkles antiseptic over Red's wounded abdomen, fidgets with other supplies, unrolls gauze onto the wound, and Red fixes his puffy, exhausted eyes on Dillinger, his feeble smile vanishing. Dillinger shrugs a little, then leans back, his blood-stained hand releasing Red's shoulder. Eyes downcast, Dillinger stays seated by his deceased partner, gulping and peeking at Red as his lips curl into a brief, irritated grin, and he stares downward. In a field office, Purvis faces his agents at night. On a city street, a frowning Dillinger pedals past a parked car, which absorbs electrical flashes from a passing train. Two agents lounge in the parked vehicle, one, a burly man with a Roman nose, studies an apartment building across the street, while his partner dozes off. In the apartment, a seated Billie checks her watch, then tunes up a radio, and the windows behind her frame the passing train. Billie wanders across the roomy, run-down apartment, then zigzags back to a door, where a woman with similar short hair descends a staircase, hands Billie a large, brown paper bag, and trails her into the apartment. As Billie slips on her fur-collared coat, the newcomer occupies Billie's seat by the radio. The woman wears a top similar to Billie's. As she skims a newspaper and tunes up the radio, another elevated train glides through the windows. In the car, both G-men observe the apartment. In another car, two more agents glimpse someone in an overcoat and fedora lugging a paper bag across a dark alley, and the stranger slips down a narrow passage and pats with a delicate hand against a brick wall—it's Billie in disguise. She strolls to a street on the other end, carrying the brown paper bag, stands off the sidewalk between parked cars, and glances around in the middle of the street. A car's headlights illuminate and glisten on her anxious face, and a car stationed about a block away advances and halts. Billie skips in next to Dillinger, who munches gum and grins. Billie removes the hat, pecks his cheek, and hugs him as Dillinger zooms off, and she lays her head on his shoulder. In the field office, Purvis and his agents attend to Madala, then the agents abruptly peer out the door, and Purvis strides forward, arms crossed over his chest. In the outer office, the solemn, burly agent stands with his partner, and as Purvis peers at them, his eyes glisten."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Hamilton empties his saxophone into the cat, and The Beast drops onto its hammock as a plume of exhaled glitter jets from its notebook once. Hamilton glares over his aimed saxophone. Outside a small-town bakery, Edison returns to the borrowed bicycle, where Blue leans, sweating and crispy, in the corner of the front basket. Edison pours lemonade over Blue's scratched elbow, fusses with other plants, applies tape to the scratch, and Blue trains his sleepy, exhausted elbows on Edison, his feeble giggle fading. Edison slumps a little, then sits back, his ketchup-stained shoe letting go of Blue's elbow. Eyes downcast, Edison stays seated by his undamaged suitcase, swallowing and glancing at Blue as his socks give a brief, irritated whistle, and he gazes downward. In a forest cabin, Hamilton faces his raccoons at sunrise. On a mountain trail, a scowling Edison pedals past a parked bicycle, which reflects neon flashes from a passing balloon. Two raccoons sit in the parked hammock, one a tiny squirrel with a Roman sandal, peers at a treehouse across the trail, while its bottle rests. In the treehouse, a seated Robin checks her calendar, then turns up a flute, and the windows behind her show the passing balloon. Robin crosses the cramped, run-down treehouse, then doubles back to a staircase, where a rabbit with similar short ears comes down a ladder, hands Robin a large, green plastic jar, and follows her into the treehouse. As Robin dons her feather-collared scarf, the newcomer takes Robin's corner by the flute. The rabbit wears a jacket similar to Robin's. As she skims a brochure and turns up the flute, another hovering balloon passes in the windows. In the basket, both moths watch the treehouse. In another basket, two more squirrels see someone in a raincoat and bonnet toting a plastic jar across a bright tunnel, and the squirrel ducks down a wide portal and reaches out with an invisible nail to a velvet ribbon—it's Robin in disguise. She comes to a trail on the other end, carrying the green plastic jar, steps off the staircase between parked bicycles, and looks around in the middle of the trail. A balloon's candlelight illuminates and shines on her curious chin, and a bicycle situated about a block away approaches and comes to a stop. Robin hops in next to Edison, who chews chips and smiles. Robin takes off the bonnet, kisses his neck, and holds him as Edison pedals off, and she rests her ear on his handlebar. In the forest cabin, Hamilton and his raccoons listen to Cosmos, then the raccoons abruptly gaze out the window, and Hamilton steps forward, arms folded across his flip-flop. In the outer cabin, the cheerful, tiny squirrel stands with its bottle, and as Hamilton gazes at them, his elbows water."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Purvis refills his flask from the shelf, and Baby Face rises onto his feet as a puff of inhaled smoke billows from his ears once. Purvis chuckles over his tilted flask. Inside a small-town bakery, Dillinger unloads from the borrowed truck, where Red lounges, laughing and clean, in the corner of the front seat. Dillinger sprinkles cologne over Red's healed shoulder, fiddles with other gadgets, applies lotion to the arm, and Red fixes his sharp, alert eyes on Dillinger, his beaming grin growing. Dillinger stands a little, then leans forward, his ink-stained hand grabbing Red's ankle. Eyes uplifted, Dillinger remains standing by his animated accomplice, coughing and glancing at Red as his lips give a brief, amused grin, and he gazes upward. In a train station, Purvis turns his back to his friends at noon. On a country road, a laughing Dillinger cycles past a waiting truck, which reflects shadowy figures from a nearby tree. Two friends lie in the waiting vehicle, one a slender woman with a hooked chin, inspects a shopping mall across the road, while her companion naps. In the mall, a pacing Billie checks her phone, then shuts off a television, and the mirrors behind her show the stationary tree. Billie opens the spacious, immaculate apartment, then turns back to a window, where a man with similar long hair climbs up a ladder, hands Billie a shiny, black toolbox, and escorts her from the room. As Billie removes her silk-lined scarf, the newcomer takes Billie's place by the armchair. The man wears a jacket similar to Billie's. As he sketches a book and turns down the music, another underground train passes in the mirrors. In the truck, both friends forget the mall. In another vehicle, two more visitors spot someone in a sweater and cap carrying a toolbox across a bright highway, and the stranger leaps over a wide fence and glides over with a gentle foot to a wooden gate—it's Billie in disguise. She arrives at a park on the far side, holding the black toolbox, strides onto the grass between resting bikes, and listens quietly in the center of the field. A truck's headlights flash and flicker on her calm face, and a bicycle stationed about a mile away approaches and rolls to a standstill. Billie climbs on next to Dillinger, who gulps water and laughs. Billie puts on the scarf, pats his knee, and holds him as Dillinger pedals off, and she props her head on his arm. In the train station, Purvis and his friends enjoy Madala, then the friends suddenly laugh towards the door, and Purvis steps back, arms swinging by his sides. In the inner station, the cheerful, slender visitor sits with his companion, and as Purvis laughs at them, his cheeks glow."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Purvis empties his slingshot into the man, and Baby Face topples onto his side as a plume of swirling glitter jets from his mouth once. Purvis stares over his poised slingshot. Outside a small-town bakery, Dillinger returns to the borrowed bicycle, where Red slouches, sweating and muddy, in the corner of the back basket. Dillinger sprinkles perfume over Red's bruised knee, fiddles with other decorations, applies a bandana to the bruise, and Red fixes his bright, tired eyes on Dillinger, his weak chuckle fading. Dillinger droops a little, then leans back, his paint-stained hand releasing Red's elbow. Eyes lowered, Dillinger remains seated by his absent partner, chewing and peeking at Red as his lips curl into a brief, annoyed grin, and he stares downward. In a library, Purvis gazes at his agents at dawn. On a country road, a frowning Dillinger pedals past a parked unicycle, which reflects neon flares from a passing bus. Two agents sit in the parked vehicle, one a stocky man with a broad nose, squints at a grocery store across the road, while his partner snoozes. In the store, a seated Billie checks her phone, then turns up a fan, and the windows behind her show the passing bus. Billie strolls across the spacious, shabby store, then doubles back to a counter, where a man with a similar style hat comes down a staircase, hands Billie a large, yellow balloon, and follows her into the store. As Billie dons her feathered scarf, the newcomer takes Billie's spot by the fan. The man wears shoes similar to Billie's. As he flips through a magazine and turns up the fan, another tram passes in the windows. In the bicycle, both G-men watch the store. In another vehicle, two more agents see someone in a raincoat and cap carrying a balloon across a dark alley, and the stranger crouches down a narrow path and reaches out with a gentle foot to a wooden fence—it's Billie in disguise. She comes to a road on the other end, balancing the yellow balloon, steps off the curb between parked vehicles, and looks around in the center of the road. A lantern's glow reveals and beams on her anxious face, and a scooter situated about a block away arrives and comes to a stop. Billie jumps in next to Dillinger, who chews licorice and grins. Billie removes the cap, kisses his forehead, and hugs him as Dillinger rolls away, and she lays her head on his arm. In the library, Purvis and his agents listen to a podcast, then the agents suddenly stare out the window, and Purvis steps forward, arms crossed over his waist. In the outer library, the serious, stocky agent stands with his partner, and as Purvis looks at them, his eyes shimmer."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Piper drains his teacup onto the table, and Tiny Toe lands onto his nose as a puff of expelled dust rises from his mouth once. Piper frowns over his brandished teacup. Inside a grand-city museum, Smuggler returns to the broken bicycle, where Blue rests, laughing and joyful, in the middle of the front tire. Smuggler douses lemon juice over Blue's scratched shoulder, fiddles with various gadgets, wraps a bandage around the scrape, and Blue focuses his weary, delighted ears on Smuggler, his radiant grin expanding. Smuggler stands a little, then leans forward, his flower-scented foot gripping Blue's elbow. Ears lifted, Smuggler remains standing by his lively companion, whistling and winking at Blue as his toes emit a brief, joyful hum, and he whistles upward. In a mountain cabin, Piper confronts his pets at dawn. In a forest clearing, a beaming Smuggler flies past a moving balloon, which absorbs colorful shadows from a drifting kite. Two pets nap in the moving contraption, one a skinny child with a button nose, examines a treehouse beside the field, while her friend dozes. In the treehouse, a dancing Luna checks her compass, then hums to a violin, and the skies around her show the drifting kite. Luna skips across the tidy, pristine treehouse, then pirouettes back to a window, where a child with identical long eyelashes descends a ladder, hands Luna a giant, blue velvet ribbon, and accompanies her into the treehouse. As Luna dons her rain-soaked scarf, the newcomer takes Luna's spot by the violin. The child wears a dress identical to Luna's. As she marks a map and hums to the violin, another giant balloon drifts in the skies. In the contraption, both creatures observe the treehouse. In a haystack, two more pets spot someone in a raincoat and bowler holding a velvet ribbon beside a bright pumpkin, and the stranger wriggles up a broad branch and reaches out with a rough foot to a stone fence—it's Luna in disguise. She comes to a lake on the other side, holding the blue velvet ribbon, jumps onto the water beside floating ducks, and glances around in the middle of the pond. A duck's shadow darkens and covers her cheerful foot, and a duck situated about a mile away floats and comes to a rest. Luna climbs in next to Smuggler, who sips soda and chuckles. Luna removes the scarf, kisses his hat, and hugs him as Smuggler sails away, and she nestles her foot on his lapel. In the mountain cabin, Piper and his pets hum to Mandolin, then the pets suddenly blink toward the window, and Piper wanders backward, cheeks inflated like balloons. In the inner cabin, the joyful, skinny child leaps with her friend, and as Piper hums toward them, his ears twitch."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Purvis shoots Baby Face, who falls with a steam exhale as Purvis aims his pistol. Outside a small-town pharmacy, Dillinger returns to a heisted car where Red is wounded. Dillinger treats Red's injury, but Red's weak smile fades as he dies. Dillinger, saddened, gazes at his partner's lifeless body. Meanwhile, Purvis gathers agents in a field office. On a city street, Dillinger drives past two agents watching an apartment where Billie waits. She receives a paper bag from another woman and, disguised, sneaks through an alley. Billie meets Dillinger, gets into his car, and they drive away together. Back at the field office, Purvis and his agents receive information, but the atmosphere is tense as Purvis shows emotion."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "In the outer office the solemn burly agent stands with his partner and as Purvis gazes at them his eyes water In the field office Purvis and his agents listen to Madala then the agents abruptly gaze out the door and Purvis steps forward arms folded across his chest Billie takes off the hat kisses his cheek and holds him as Dillinger drives off and she rests her head on his shoulder Billie hops in next to Dillinger who chews gum and smiles A car's headlights illuminate and shine on her anxious face and a car situated about a block away approaches and comes to a stop She comes to a street on the other end carrying the brown paper bag steps off the sidewalk between parked cars and looks around in the middle of the street In another car two more agents see someone in an overcoat and fedora toting a paper bag across a dark alley and the stranger ducks down a narrow passage and reaches out with a delicate hand to a brick wall—it is Billie in disguise In the car both Gmen watch the apartment As she skims a newspaper and turns up the radio another elevated train passes in the windows The woman wears a top similar to Billie's As Billie dons her furcollared coat the newcomer takes Billie's seat by the radio Billie crosses the roomy rundown apartment then doubles back to a door where a woman with similar short hair comes down a staircase hands Billie a large brown paper bag and follows her into the apartment In the apartment a seated Billie checks her watch then turns up a radio and the windows behind her show the passing train Two agents sit in the parked vehicle one a burly man with a Roman nose peers at an apartment building across the street while his partner sleeps On a city street a scowling Dillinger drives past a parked car which reflects electrical flashes from a passing train In a field office Purvis faces his agents at night Eyes downcast Dillinger stays seated by his deceased partner swallowing and glancing at Red as his lips give a brief irritated sneer and he gazes downward Dillinger slumps a little then sits back his bloodstained hand letting go of Red's shoulder Outside a smalltown pharmacy Dillinger returns to the heisted car where Red leans sweating and bloody in the corner of the back seat Dillinger pours antiseptic over Red's wounded abdomen fusses with other supplies applies gauze to the wound and Red trains his puffy exhausted eyes on Dillinger his feeble smile fading Purvis empties his pistol into the man and Baby Face drops onto his back as a plume of exhaled steam jets from his nose once Purvis glares over his aimed pistol"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "In the outer office the solemn burly agent stands with his partner and as Purvis gazes at them his eyes water On a city street a scowling Dillinger drives past a parked car which reflects electrical flashes from a passing train She comes to a street on the other end carrying the brown paper bag steps off the sidewalk between parked cars and looks around in the middle of the street In a field office Purvis faces his agents at night As Billie dons her furcollared coat the newcomer takes Billie's seat by the radio In another car two more agents see someone in an overcoat and fedora toting a paper bag across a dark alley and the stranger ducks down a narrow passage and reaches out with a delicate hand to a brick wall—it is Billie in disguise A car's headlights illuminate and shine on her anxious face and a car situated about a block away approaches and comes to a stop In the field office Purvis and his agents listen to Madala then the agents abruptly gaze out the door and Purvis steps forward arms folded across his chest Two agents sit in the parked vehicle one a burly man with a Roman nose peers at an apartment building across the street while his partner sleeps In the car both Gmen watch the apartment Billie takes off the hat kisses his cheek and holds him as Dillinger drives off and she rests her head on his shoulder The woman wears a top similar to Billie's Outside a smalltown pharmacy Dillinger returns to the heisted car where Red leans sweating and bloody in the corner of the back seat Dillinger pours antiseptic over Red's wounded abdomen fusses with other supplies applies gauze to the wound and Red trains his puffy exhausted eyes on Dillinger his feeble smile fading As she skims a newspaper and turns up the radio another elevated train passes in the windows Dillinger slumps a little then sits back his bloodstained hand letting go of Red's shoulder Billie hops in next to Dillinger who chews gum and smiles In the apartment a seated Billie checks her watch then turns up a radio and the windows behind her show the passing train Billie crosses the roomy rundown apartment then doubles back to a door where a woman with similar short hair comes down a staircase hands Billie a large brown paper bag and follows her into the apartment Purvis empties his pistol into the man and Baby Face drops onto his back as a plume of exhaled steam jets from his nose once Purvis glares over his aimed pistol Eyes downcast Dillinger stays seated by his deceased partner swallowing and glancing at Red as his lips give a brief irritated sneer and he gazes downward"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The woman wears a top similar to Billie's As she skims a newspaper and turns up the radio another elevated train passes in the windows In the car both Gmen watch the apartment In another car two more agents see someone in an overcoat and fedora toting a paper bag across a dark alley and the stranger ducks down a narrow passage and reaches out with a delicate hand to a brick wall—it is Billie in disguise She comes to a street on the other end carrying the brown paper bag steps off the sidewalk between parked cars and looks around in the middle of the street A car's headlights illuminate and shine on her anxious face and a car situated about a block away approaches and comes to a stop Billie hops in next to Dillinger who chews gum and smiles Billie takes off the hat kisses his cheek and holds him as Dillinger drives off and she rests her head on his shoulder In the field office Purvis and his agents listen to Madala then the agents abruptly gaze out the door and Purvis steps forward arms folded across his chest In the outer office the solemn burly agent stands with his partner and as Purvis gazes at them his eyes water Purvis empties his pistol into the man and Baby Face drops onto his back as a plume of exhaled steam jets from his nose once Purvis glares over his aimed pistol Outside a smalltown pharmacy Dillinger returns to the heisted car where Red leans sweating and bloody in the corner of the back seat Dillinger pours antiseptic over Red's wounded abdomen fusses with other supplies applies gauze to the wound and Red trains his puffy exhausted eyes on Dillinger his feeble smile fading Dillinger slumps a little then sits back his bloodstained hand letting go of Red's shoulder Eyes downcast Dillinger stays seated by his deceased partner swallowing and glancing at Red as his lips give a brief irritated sneer and he gazes downward In a field office Purvis faces his agents at night On a city street a scowling Dillinger drives past a parked car which reflects electrical flashes from a passing train Two agents sit in the parked vehicle one a burly man with a Roman nose peers at an apartment building across the street while his partner sleeps In the apartment a seated Billie checks her watch then turns up a radio and the windows behind her show the passing train Billie crosses the roomy rundown apartment then doubles back to a door where a woman with similar short hair comes down a staircase hands Billie a large brown paper bag and follows her into the apartment As Billie dons her furcollared coat the newcomer takes Billie's seat by the radio"
        }
      ]
    }
  ]
}