{
  "ground_truth": "He works his lips as Nitti listens to the radio and then phones D'Andrea. Cardboard tags label switchboard cables at the telephone exchange as two female operators work an adjacent switchboard with an agent standing by. Outside, on a moonlit shoreline, Dillinger sits by a sleeping Billie, whose hair hangs in her face. Dillinger gazes at her, brushes her dark hair aside to reveal her big eyes, and she briefly lowers her gaze before smiling. He takes her in his arm, with the horizon sprawling flat between the sand and black sky. Dillinger's car parks on a street, and Billie smiles at him before getting out. Peering through his round sunglasses, Dillinger watches her go, then looks into his side view mirror and sees only a man at a mailbox, a vagrant, and a few pedestrians. In her fur-collared coat, Billie crosses the street between passing vehicles and enters the building. In the car, Dillinger faces the side mirror and brushes his bangs off his forehead. Inside, Billie passes through another doorway where Purvis' men grab her, handcuff her, and she uncomfortably glances at the agents. Outside, Dillinger waits in the car as more armed agents exit a building directly in front of him, and he startles slightly, but the G-men step right past, realizing he's inside, and cross the street. Dillinger takes off his sunglasses as the agents restraining Billie indoors lead her outside. Dillinger glares into his side mirror, then gets out of the car. The two lovers make eye contact as the burly agent marches Billie away, shoving her toward a government car. Dillinger steps forward with a pistol in hand as the burly agent pushes Billie into the back seat and gets in next to her. As they drive away, Billie peers through the back window, sitting between two agents, and a shocked Dillinger stands out in the open, watching the car drive off. Several armed agents remain behind on the sidewalk but fail to notice Dillinger, who strides around a parked car and returns to his vehicle. Dillinger gets in, shuts the door, grips the steering wheel, bows his head, and collects his breath. His car backs out, leaving the remaining agents behind, and the gangster wipes his reddened face, holding a hand over his mouth as he sobs. In a dim interrogation room, the burly agent leans in front of Billie, who sits in a chair, with his partner standing behind her. She slouches with her left cheek bruised as the interrogator smacks her, grabs her chin, flings her head to the side, and stands upright. The interrogator steps out of the room as Billie trembles, with her right hand cuffed to the chair, holding her knees together.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He labors his mouth as Nitti attends to the radio and then calls D'Andrea. Cardboard labels tag switchboard wires at the telephone interchange as two female operators perform on an adjacent switchboard with an officer standing by. Outside, on a moonlit coast, Dillinger rests by a slumbering Billie, whose hair drapes in her face. Dillinger stares at her, sweeps her dark hair aside to disclose her large eyes, and she momentarily lowers her look before grinning. He takes her in his arm, with the horizon spreading flat between the sand and black sky. Dillinger's auto parks on a street, and Billie grins at him before getting out. Surveying through his round sunglasses, Dillinger observes her leave, then looks into his side view mirror and sees only a man at a mailbox, a homeless person, and a few walkers. In her fur-collared coat, Billie crosses the street between passing automobiles and enters the structure. In the car, Dillinger faces the side mirror and brushes his bangs off his forehead. Inside, Billie moves through another entrance where Purvis' men seize her, shackle her, and she uncomfortably glances at the officers. Outside, Dillinger waits in the car as more armed officers exit a building directly in front of him, and he startles slightly, but the G-men step right past, realizing he's inside, and cross the street. Dillinger removes his sunglasses as the officers restraining Billie indoors lead her outside. Dillinger stares into his side mirror, then gets out of the car. The two lovers make eye contact as the burly officer marches Billie away, shoving her toward a government car. Dillinger steps forward with a firearm in hand as the burly officer pushes Billie into the back seat and gets in next to her. As they drive away, Billie peers through the back window, sitting between two officers, and a stunned Dillinger stands out in the open, watching the car depart. Several armed officers remain behind on the sidewalk but fail to notice Dillinger, who strides around a parked auto and returns to his vehicle. Dillinger gets in, shuts the door, grips the steering wheel, bows his head, and gathers his breath. His car backs out, leaving the remaining officers behind, and the gangster wipes his reddened face, holding a hand over his mouth as he weeps. In a dim questioning chamber, the burly officer leans in front of Billie, who sits in a chair, with his partner standing behind her. She slouches with her left cheek bruised as the interrogator hits her, grabs her chin, flings her head to the side, and stands upright. The interrogator steps out of the chamber as Billie quivers, with her right hand cuffed to the chair, holding her knees together."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "His lips are worked by him as the radio is listened to by Nitti, and D'Andrea is then phoned by him. Switchboard cables are labeled with cardboard tags at the telephone exchange, while two female operators are working an adjacent switchboard with an agent standing by. Outside, on a moonlit shoreline, Billie, who is sleeping, is sat by by Dillinger, and her hair is hung in her face. Her big eyes are revealed by Dillinger as he brushes her dark hair aside after gazing at her, and her gaze is briefly lowered before she smiles. She is taken in his arm by him, with the horizon sprawling flat between the sand and black sky. Dillinger's car is parked on a street, and at him, Billie smiles before she gets out. Through his round sunglasses, Billie is watched going by Dillinger, then his side view mirror is looked into by him, and only a man at a mailbox, a vagrant, and a few pedestrians are seen by him. In her fur-collared coat, the street is crossed by Billie between passing vehicles, and she enters the building. In the car, Dillinger faces the side mirror, and off his forehead, his bangs are brushed by him. Inside, through another doorway, Billie passes, where Purvis' men grab her and handcuff her. At the agents, an uncomfortable glance is shot by her. Outside, in the car, Dillinger waits as a building directly in front of him is exited by more armed agents, and he is startled slightly, but right past, the G-men step, realizing he's inside, and the street is crossed by them. His sunglasses are taken off by Dillinger as the agents restraining Billie indoors lead her outside. Into his side mirror, Dillinger glares, then out of the car, he gets. The two lovers make eye contact as Billie is marched away by the burly agent, who shoves her toward a government car. Forward, with a pistol in hand, Dillinger steps as Billie is pushed into the back seat by the burly agent, who gets in next to her. As away, they drive, through the back window, Billie peers, sitting between two agents, and out in the open, a shocked Dillinger stands, watching the car drive off. On the sidewalk, several armed agents remain behind, but Dillinger, who strides around a parked car and returns to his vehicle, is not noticed by them. In, Dillinger gets, the door is shut by him, the steering wheel is gripped by him, his head is bowed, and his breath is collected. His car backs out, leaving the remaining agents behind, and his reddened face is wiped by the gangster, a hand is held over his mouth by him as he sobs. In a dim interrogation room, in front of Billie, who sits in a chair, the burly agent leans, with his partner standing behind her. With her left cheek bruised, she slouches as the interrogator smacks her, grabs her chin, flings her head to the side, and stands upright. Out of the room, the interrogator steps as Billie trembles, with her right hand cuffed to the chair, holding her knees together."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He moves his lips while Nitti listens to the radio and calls D'Andrea. Labeled switchboard cables are in the exchange as two female operators work nearby with an agent present. On a moonlit shore, Dillinger sits by sleeping Billie, brushing hair from her face to reveal her eyes. She briefly lowers her gaze before smiling, and he holds her with the horizon between sand and sky. Dillinger parks, and Billie smiles as she exits. Through his sunglasses, he watches her go, then checks the side mirror, seeing only a man at a mailbox, a vagrant, and pedestrians. In her fur-collared coat, Billie crosses the street and enters a building. Inside, agents grab and handcuff her; she looks uncomfortably at them. Outside, Dillinger waits in the car as armed agents exit a building, startling him, but they pass by. He removes his sunglasses as agents lead Billie out. They lock eyes as she's shoved into a government car. Dillinger, armed, watches helplessly as Billie, between agents, peers back at him. Shocked, he stands as the car drives off. Other agents remain unaware of Dillinger, who returns to his vehicle, drives away, and sobs. In a dim interrogation room, a burly agent leans before Billie, seated with a bruised cheek. The interrogator smacks her, grabs her chin, turns her head, and steps out as she trembles, handcuffed to the chair."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Nitti listens to the radio, then calls D'Andrea. Two female operators manage switchboard cables as an agent observes. On a moonlit shore, Dillinger sits by a sleeping Billie and gently moves her hair, revealing her eyes. She smiles, and he embraces her beneath the horizon. Dillinger parks on a street; Billie smiles and departs. He watches through sunglasses and checks his side mirror, seeing pedestrians. Billie crosses traffic and enters a building in her fur-collared coat. Dillinger adjusts his hair as agents handcuff Billie inside; she glances nervously. Outside, armed agents exit a building without noticing Dillinger, who removes his sunglasses. Billie's led outside in cuffs; they exchange looks as she's shoved into a government car and driven away. Dillinger stands shocked, unnoticed by the remaining agents, and returns to his car, distressed. He backs out, leaving agents behind, crying into his hand. In an interrogation room, the burly agent confronts Billie, whose cheek is bruised; he strikes her and exits as she trembles, handcuffed to a chair."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As Nitti attentively listens to the radio with unwavering focus, the other man works his lips. Once done, Nitti promptly picks up the phone to contact D'Andrea. Meanwhile, in the bustling environment of the telephone exchange, cardboard tags meticulously label the numerous switchboard cables. Two dedicated female operators diligently manage an adjacent switchboard, performing their tasks with care, as an observant agent stands watchfully by their side. Outside, under the serene illumination of a moonlit shoreline, Dillinger sits close to a sleeping Billie, whose long hair falls gently across her face, partially obscuring her features. As he gazes at her with affectionate interest, he brushes her dark strands aside to reveal her large expressive eyes. She responds by briefly lowering her gaze before offering him a warm, tender smile. Dillinger then tenderly wraps one arm around her, the vast horizon stretched out flatly between the sandy expanse and the blackened sky above. Later, Dillinger's car comes to a halt on a street, where Billie smiles at him sweetly before stepping out. Through his unmistakable round sunglasses, Dillinger watches her departure with a keen eye, then glances into his side view mirror. In the reflection, he sees only a man standing at a mailbox, a wandering vagrant, and a few scattered pedestrians going about their business. Billie, adorned in her elegant fur-collared coat, gracefully crosses the bustling street between passing vehicles and slips into the building. Back in the car, Dillinger's attention returns to the side mirror, as he brushes his bangs away from his forehead with a practiced hand. Inside the building, Billie continues through another doorway where Purvis' men suddenly seize her, locking handcuffs around her wrists. She sends uncomfortable glances in the direction of the agents, clearly disquieted by their presence. Outside, Dillinger patiently waits in the vehicle as a group of armed agents begin to exit a building located directly in front of him. He startles slightly at their sudden appearance, yet the G-men simply stride past him on the street, seemingly oblivious to his presence inside the car. Realizing their oversight, they cross the street in another direction. Dillinger carefully removes his sunglasses just as the agents restraining Billie indoors start to lead her outside. With a piercing glare directed into his side mirror, Dillinger finally steps out of the car. The two lovers exchange a poignant look as the burly agent brusquely marches Billie away, roughly shoving her toward an awaiting government vehicle. Dillinger, filled with determination, advances forward with a pistol gripped tightly in his hand, even as the burly agent forces Billie into the back seat and climbs in next to her. As the car speeds away, Billie turns to peer back through the rear window, seated between two agents. Meanwhile, a visibly shocked Dillinger is left standing out in the open, watching helplessly as the car drives off into the distance. Despite several armed agents lingering behind on the sidewalk, they fail to notice Dillinger, who takes the opportunity to stride around a parked car before returning to his own vehicle. Once inside, he shuts the door with determination, grips the steering wheel firmly, bows his head, and takes a moment to collect his breath. His car then slowly backs out, leaving the remaining agents behind, oblivious to his departure. As he drives away, the gangster, overcome with emotion, wipes his reddened face, holding a hand over his mouth to stifle his sobs. In a dimly lit interrogation room, the burly agent leans menacingly toward Billie, who is seated in a chair, while his partner stands watchfully behind her. Billie slouches in the chair, her left cheek visibly bruised, as the interrogator smacks her rudely, grabs her chin harshly, and flings her head to one side before standing upright. The interrogator then exits the room, leaving Billie behind, trembling with fear and discomfort. Her right hand remains cuffed to the chair as she holds her knees tightly together, trying to maintain her composure."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As Nitti leans forward to listen to the radio with unwavering focus and intense concentration, the other man beside him moves his lips in a silent motion. Once the man finishes, Nitti promptly reaches for the phone, preparing to make a call to D'Andrea with decisiveness. Meanwhile, amidst the hustle and bustle within the telephone exchange environment, numerous switchboard cables are meticulously labeled with cardboard tags, each tag carefully attached. Nearby, two dedicated and attentive female operators are diligently managing the adjacent switchboard. They perform their tasks with the utmost care and precision, while an observant agent stands vigilantly by their side, watching their actions closely. Outside, beyond the confines of the exchange, under the serene illumination of a moonlit shoreline, Dillinger sits closely beside the peacefully sleeping Billie. Her long hair cascades gently across her face, partially obscuring her delicate features. As he gazes at her with affectionate interest, he tenderly brushes her dark strands aside, revealing her large, expressive eyes. She responds to his tender gesture by briefly lowering her gaze before offering him a warm, tender smile. Dillinger then wraps one arm around her tenderly, as the vast horizon stretches out flatly between the sandy expanse and the blackened sky above them. Later, Dillinger's car comes to a controlled stop on a bustling street, where Billie, with a sweet smile on her face, steps out gracefully. Through his characteristic round sunglasses, Dillinger watches her departure with a keen, observant eye, then shifts his gaze to his side view mirror. In the small reflection, he sees only an unremarkable man standing at a mailbox, a wandering vagrant moving along, and a few scattered pedestrians going about their daily business. Billie, elegantly adorned in her fur-collared coat, gracefully makes her way across the bustling street between the passing vehicles and then slips into the building discreetly. Back in the car, Dillinger's attention returns to the side mirror, and he brushes his bangs away from his forehead with a practiced, casual hand. Inside the building, Billie continues through another doorway, only to be suddenly seized by Purvis' men. They swiftly lock handcuffs around her wrists, causing her to send uncomfortable glances toward the agents, clearly disquieted by their intimidating presence. Outside, Dillinger waits patiently in the vehicle, observant and unhurried. He remains seated as a group of armed agents begin to emerge from a building located directly in front of him. Startled slightly by their sudden appearance, the G-men, however, simply stride past him on the street, paying no attention to his presence inside the car. Realizing their oversight, the agents then proceed to cross the street in another direction. Dillinger carefully removes his sunglasses, doing so just as the agents restraining Billie indoors begin to lead her outside. With a piercing glare directed into his side mirror, Dillinger finally decides to step out of the car. The two lovers exchange a poignant and meaningful look as the burly agent brusquely marches Billie away, roughly shoving her toward an awaiting government vehicle. Filled with determination and resolve, Dillinger advances forward with a pistol gripped tightly in his hand, even as the burly agent forces Billie into the back seat and climbs in next to her. As the car speeds away, Billie turns to peer back through the rear window, seated between two agents. Meanwhile, a visibly shocked and distressed Dillinger is left standing out in the open, watching helplessly as the car drives off into the distance. Despite several armed agents lingering behind on the sidewalk, they fail to notice Dillinger, who seizes the opportunity to stride around a parked car before returning to his own vehicle. Once inside, he shuts the door with determined force, grips the steering wheel firmly, bows his head, and takes a crucial moment to collect his breath. His car then slowly backs out, leaving the remaining agents oblivious to his departure. As he drives away, the gangster, overcome with emotion, wipes his reddened face, holding a hand over his mouth to stifle his sobs. In a dimly lit interrogation room, the burly agent leans menacingly toward Billie, who is seated uneasily in a chair, while his partner stands watchfully behind her. Billie, slouching in the chair with visible discomfort, bears a bruise on her left cheek, a testament to the harsh treatment she has endured. The interrogator rudely smacks her, then grabs her chin harshly, flinging her head to one side before standing upright with authority. The interrogator then exits the room, leaving Billie behind, trembling with fear and discomfort. Her right hand remains cuffed to the chair as she holds her knees tightly together, struggling to maintain her composure against the oppressive atmosphere."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Nitti listens intently to the radio, he works his lips, thoughtfully processing the information before reaching for the telephone to call D'Andrea. Meanwhile, at the telephone exchange, cardboard tags meticulously label the switchboard cables, and two female operators are efficiently managing an adjacent switchboard, with an agent observing their activity vigilantly. Outside, in the serene embrace of a moonlit shoreline, Dillinger is seated beside a sleeping Billie, whose dark hair cascades over her face. Dillinger, with a gentle motion, brushes her hair aside to reveal her expressive eyes. For a fleeting moment, she lowers her gaze, then meets his eyes with a brief smile. He draws her into his arm, with the wide horizon stretching flat between the sandy beach and the dark expanse of the sky. Later, Dillinger’s car comes to a stop on a street, and Billie, after flashing him a smile, exits the vehicle. Through his round sunglasses, Dillinger watches her as she departs, then redirects his gaze to the side view mirror, where he observes only the mundane scene of a man at a mailbox, a vagrant, and a few pedestrians going about their day. Billie, wrapped in a fur-collared coat, deftly crosses the street amidst the passing vehicles and makes her way into a building. Meanwhile, Dillinger, still seated in the car, adjusts to his reflection, brushing his bangs away from his forehead as he watches the unfolding events. Inside, Billie steps through another doorway where Purvis' men suddenly confront her, snapping handcuffs onto her wrists, and she casts an uncomfortable glance at the agents surrounding her. Outside, Dillinger remains vigilant in the car as he notices more armed agents emerging from a building directly in front of him. He startles slightly at their presence, but they continue past him, crossing the street, apparently unaware of his identity. As the agents restraining Billie lead her outside, Dillinger removes his sunglasses, his expression tense as he observes through the side mirror. Stepping out of the car, he locks eyes with Billie as a burly agent shoves her toward a government car, their silent connection broken as she is forced into the back seat, the agent climbing in beside her. As the vehicle pulls away, Billie glances back through the rear window, flanked by agents, while Dillinger, standing exposed in the open street, watches in shock as the car disappears from view. On the sidewalk, several armed agents linger, oblivious to Dillinger's presence as he swiftly maneuvers around a parked car to return to his vehicle. Once inside, he closes the door, tightly grips the steering wheel, bows his head, and takes a moment to steady his breathing. The car reverses, backing away from the scene and leaving the agents behind. Overwhelmed by the situation, Dillinger wipes his reddened face, stifling his sobs with a hand over his mouth. In a dimly lit interrogation room elsewhere, the burly agent leans in close to Billie, who sits cuffed to a chair, slouching with a bruised cheek, as the interrogator, with his partner standing ominously behind her, smacks her, forcefully grabs her chin, and jerks her head to the side before standing upright. Billie, visibly trembling, remains in the room after the interrogator exits, her right hand securely fastened to the chair, as she attempts to compose herself, holding her knees together in a posture of both defiance and vulnerability."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Nitti listens to the radio before calling D'Andrea, while at the telephone exchange, labeled switchboard cables are managed by two female operators under the supervision of an agent. On a moonlit shoreline, Dillinger, sitting beside a sleeping Billie, gently brushes her hair from her face and embraces her as they enjoy the horizon's view. Later, in a car, Dillinger watches Billie smile at him before she exits and crosses the street, becoming a target for Purvis' men, who swiftly handcuff her as Dillinger observes unnoticed from his vehicle. As armed agents exit a building, Dillinger remains calm in his parked car until the agents escort Billie outside. Once Dillinger and Billie exchange a fleeting glance of connection, the agents force Billie into a government car. Dillinger steps out, pistol in hand, watching helplessly as the car drives off with Billie inside. He returns to his vehicle, visibly distressed, and collects himself before driving away, leaving the agents oblivious to his presence. In a dim interrogation room, a burly agent interrogates a bruised and trembling Billie, slouched and handcuffed to a chair, before abruptly leaving as she sits in silence."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He works his lips as Nitti, an infamous mob boss known for his involvement in organized crime during the Prohibition era, listens to the radio and then phones D'Andrea. Cardboard tags label switchboard cables at the telephone exchange in a bustling urban area where communication was critical in the early 20th century, as two female operators work an adjacent switchboard with an agent standing by. Outside, on a moonlit shoreline reminiscent of the secluded beaches often used for clandestine meetings during the gangster era, Dillinger sits by a sleeping Billie, whose hair hangs in her face. Dillinger, notorious as a bank robber during the Great Depression, gazes at her, brushes her dark hair aside to reveal her big eyes, and she briefly lowers her gaze before smiling. He takes her in his arm, with the horizon sprawling flat between the sand and black sky, creating a serene yet tense moment away from their chaotic lives. Dillinger's car, a Ford V8 popular among gangsters for its speed and performance, parks on a street, and Billie smiles at him before getting out. Peering through his round sunglasses, a signature accessory that added to his infamous image, Dillinger watches her go, then looks into his side view mirror and sees only a man at a mailbox, a vagrant, and a few pedestrians. In her fur-collared coat, Billie crosses the street between passing vehicles and enters the building, a location often used as a safe house. In the car, Dillinger faces the side mirror and brushes his bangs off his forehead, maintaining his composed demeanor. Inside, Billie passes through another doorway where Purvis' men, led by the FBI agent famous for his relentless pursuit of Dillinger, grab her, handcuff her, and she uncomfortably glances at the agents. Outside, Dillinger waits in the car as more armed agents exit a building directly in front of him, and he startles slightly, recognizing the threat, but the G-men step right past, realizing he's inside, and cross the street. Dillinger takes off his sunglasses as the agents restraining Billie indoors lead her outside, heightening the tension of the moment. Dillinger glares into his side mirror, then gets out of the car. The two lovers make eye contact as the burly agent, known for his rough handling of suspects, marches Billie away, shoving her toward a government car. Dillinger steps forward with a pistol in hand, reflecting the constant danger he lived with, as the burly agent pushes Billie into the back seat and gets in next to her. As they drive away, Billie peers through the back window, sitting between two agents, and a shocked Dillinger stands out in the open, watching the car drive off. Several armed agents remain behind on the sidewalk but fail to notice Dillinger, who strides around a parked car and returns to his vehicle, slipping through the net of law enforcement once again. Dillinger gets in, shuts the door, grips the steering wheel, bows his head, and collects his breath, a moment of vulnerability for the infamous criminal. His car backs out, leaving the remaining agents behind, and the gangster wipes his reddened face, holding a hand over his mouth as he sobs, a rare display of emotion. In a dim interrogation room, the burly agent leans in front of Billie, who sits in a chair, with his partner standing behind her, echoing the intense pressure applied during criminal questioning. She slouches with her left cheek bruised, evidence of the harsh methods often used by law enforcement at the time, as the interrogator smacks her, grabs her chin, flings her head to the side, and stands upright. The interrogator steps out of the room as Billie trembles, with her right hand cuffed to the chair, holding her knees together, illustrating the precarious and dangerous situation she finds herself in."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He works his lips as Nitti listens to the radio and then phones D'Andrea. Cardboard tags label switchboard cables at the telephone exchange as two female operators work an adjacent switchboard with an agent standing by. Outside on a moonlit shoreline Dillinger sits by a sleeping Billie whose hair hangs in her face. Dillinger gazes at her brushes her dark hair aside to reveal her big eyes and she briefly lowers her gaze before smiling. He takes her in his arm with the horizon sprawling flat between the sand and black sky. Dillinger's car parks on a street and Billie smiles at him before getting out. Peering through his round sunglasses Dillinger watches her go then looks into his side view mirror and sees only a man at a mailbox a vagrant and a few pedestrians. In her furcollared coat Billie crosses the street between passing vehicles and enters the building. In the car Dillinger faces the side mirror and brushes his bangs off his forehead. Inside Billie passes through another doorway where Purvis' men grab her handcuff her and she uncomfortably glances at the agents. Outside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Dillinger waits in the car as more armed agents exit a building directly in front of him and he startles slightly but the Gmen step right past realizing he is inside and cross the street. Dillinger takes off his sunglasses as the agents restraining Billie indoors lead her outside. Dillinger glares into his side mirror then gets out of the car. The two lovers make eye contact as the burly agent marches Billie away shoving her toward a government car. Dillinger steps forward with a pistol in hand as the burly agent pushes Billie into the back seat and gets in next to her. As they drive away Billie peers through the back window sitting between two agents and a shocked Dillinger stands out in the open watching the car drive off. Several armed agents remain behind on the sidewalk but fail to notice Dillinger who strides around a parked car and returns to his vehicle. Dillinger gets in shuts the door grips the steering wheel bows his head and collects his breath. His car backs out leaving the remaining agents behind and the gangster wipes his reddened face holding a hand over his mouth as he sobs. In a dim interrogation room the burly agent leans in front of Billie who sits in a chair with his partner standing behind her. She slouches with her left cheek bruised as the interrogator smacks her grabs her chin flings her head to the side and stands upright. The interrogator steps out of the room as Billie trembles with her right hand cuffed to the chair holding her knees together."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He works his lips as Nitti listens to the radio and then phones D'Andrea. Cardboard tags label switchboard cables at the telephone exchange as two female operators work an adjacent switchboard with an agent standing by. Outside on a moonlit shoreline Dillinger sits by a sleeping Billie whose hair hangs in her face. Dillinger gazes at her brushes her dark hair aside to reveal her big eyes and she briefly lowers her gaze before smiling. He takes her in his arm with the horizon sprawling flat between the sand and black sky. Dillinger's car parks on a street and Billie smiles at him before getting out. Peering through his round sunglasses Dillinger watches her go then looks into his side view mirror and sees only a man at a mailbox a vagrant and a few pedestrians. In her furcollared coat Billie crosses the street between passing vehicles and enters the building. In the car Dillinger faces the side mirror and brushes his bangs off his forehead. Inside Billie passes through another doorway where Purvis' men grab her handcuff her and she uncomfortably glances at the agents. Outside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Dillinger waits in the car as more armed agents exit a building directly in front of him and he startles slightly but the Gmen step right past realizing he is inside and cross the street. Dillinger takes off his sunglasses as the agents restraining Billie indoors lead her outside. Dillinger glares into his side mirror then gets out of the car. The two lovers make eye contact as the burly agent marches Billie away shoving her toward a government car. Dillinger steps forward with a pistol in hand as the burly agent pushes Billie into the back seat and gets in next to her. As they drive away Billie peers through the back window sitting between two agents and a shocked Dillinger stands out in the open watching the car drive off. Several armed agents remain behind on the sidewalk but fail to notice Dillinger who strides around a parked car and returns to his vehicle. Dillinger gets in shuts the door grips the steering wheel bows his head and collects his breath. His car backs out leaving the remaining agents behind and the gangster wipes his reddened face holding a hand over his mouth as he sobs. In a dim interrogation room the burly agent leans in front of Billie who sits in a chair with his partner standing behind her. She slouches with her left cheek bruised as the interrogator smacks her grabs her chin flings her head to the side and stands upright. The interrogator steps out of the room as Billie trembles with her right hand cuffed to the chair holding her knees together."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He works his lips as Nitti listens to the radio and then phones D'Andrea. Cardboard tags label switchboard cables at the telephone exchange as two female operators work an adjacent switchboard with an agent standing by. Outside on a moonlit shoreline Dillinger sits by a sleeping Billie whose hair hangs in her face. Dillinger gazes at her brushes her dark hair aside to reveal her big eyes and she briefly lowers her gaze before smiling. He takes her in his arm with the horizon sprawling flat between the sand and black sky. Dillinger's car parks on a street and Billie smiles at him before getting out. Several armed agents remain behind on the sidewalk but fail to notice Dillinger who strides around a parked car and returns to his vehicle. Dillinger gets in shuts the door grips the steering wheel bows his head and collects his breath. His car backs out leaving the remaining agents behind and the gangster wipes his reddened face holding a hand over his mouth as he sobs. In a dim interrogation room the burly agent leans in front of Billie who sits in a chair with his partner standing behind her. She slouches with her left cheek bruised as the interrogator smacks her grabs her chin flings her head to the side and stands upright. The interrogator steps out of the room as Billie trembles with her right hand cuffed to the chair holding her knees together."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He works his lips as Nitti listens to the radio and then phones D'Andrea. Cardboard tags label switchboard cables at the telephone exchange as two female operators work an adjacent switchboard with an agent standing by. In a dim interrogation room the burly agent leans in front of Billie who sits in a chair with his partner standing behind her. She slouches with her left cheek bruised as the interrogator smacks her grabs her chin flings her head to the side and stands upright. The interrogator steps out of the room as Billie trembles with her right hand cuffed to the chair holding her knees together."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The owl flaps its wings as Fiddler munches on the newspaper and then summons McArthur. Glass bottles stampede through the library at the grocery store as three male zebras jiggle an indoor carousel with a tourist lounging nearby. Indoors, on a sunlit tundra, Poppins sprawls by a dancing Buttercup, whose feathers flap in her soup. Poppins gawks at her, flicks her candy mustache aside to reveal her minuscule antlers, and she silently raises her trunk before crying. He rolls her in his wing, with the eternity towering tall between the gravel and white ocean. Poppins's trolley levitates on a mountain, and Buttercup chuckles at him before hopping out. Glancing through his square telescope, Poppins sees her vanish, then peers into his rearview telescope and spots only a wizard at a hydrant, a zombie, and a few magicians. In her sequined apron, Buttercup scales the sidewalk between floating hampsters and invades the spaceship. In the trolley, Poppins faces the rearview telescope and flicks his feathers off his earlobe. Indoors, Buttercup dances through another portal where Medusa’s zombies capture her, shackle her, and she comfortably smirks at the unicorns. Indoors, Poppins lounges in the trolley as fewer unarmed unicorns materialize from a spaceship directly behind him, and he giggles lightly, but the trolls rush up, noticing he's outdoors, and fish in the ocean. Poppins straps on his telescope as the unicorns cuddling Buttercup in outer space lead her indoors. Poppins glances into his rearview telescope, then prances out of the trolley. The two penguins flap wings as the slender unicorn marches Buttercup around, nudging her toward a library book. Poppins shuffles sideways with a whistle in pocket as the slender unicorn nudges Buttercup into the front seat and clutches next to her. As they zoom around, Buttercup stares through the front wall, standing on a dozen unicorns, and a thrilled Poppins sits under an umbrella, noticing the paper zoom off. Many unarmed unicorns dance forward on the ceiling but fail to hug Poppins, who tiptoes beneath a standing trolley and screams at his animal. Poppins skips in, opens the hatch, grips the joystick, raises his eyelid, and gathers his memory. His trolley spins out, leaving the remaining unicorns forward, and the turtle wipes its reddened palm, gripping a foot over its horn as it hollers. In a lit room, the slender unicorn lounges behind Buttercup, who spins in a hammock, with her cousin jiving behind them. She flies with her right arm tickled as the unicorn whispers to her, smashes her elbow, tosses her horns to the ceiling, and skips upside down. The unicorn lounges out of the hammock as Buttercup snoozes, with her left ear tied to the hammock, squeezing her spirits together."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Nitti listens to the radio and calls D'Andrea, while two female operators work at a switchboard. On a moonlit shore, Dillinger sits beside a sleeping Billie, gently brushing her hair aside. They share a tender moment before she leaves the car. Dillinger watches her cross the street and enter a building. Inside, Purvis' men capture and handcuff Billie, leading her outside where Dillinger waits. Agents pass by his car but don't notice him. As Billie is escorted to a government car, she and Dillinger lock eyes. The agents drive away with Billie, and Dillinger, shocked, watches. He returns to his car, distressed, and backs out, leaving the agents behind. In an interrogation room, a bruised Billie sits as an agent smacks her and exits, leaving her trembling and cuffed to a chair."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The interrogator steps out of the room as Billie trembles with her right hand cuffed to the chair holding her knees together She slouches with her left cheek bruised as the interrogator smacks her grabs her chin flings her head to the side and stands upright In a dim interrogation room the burly agent leans in front of Billie who sits in a chair with his partner standing behind her His car backs out leaving the remaining agents behind and the gangster wipes his reddened face holding a hand over his mouth as he sobs Dillinger gets in shuts the door grips the steering wheel bows his head and collects his breath Several armed agents remain behind on the sidewalk but fail to notice Dillinger who strides around a parked car and returns to his vehicle As they drive away Billie peers through the back window sitting between two agents and a shocked Dillinger stands out in the open watching the car drive off Dillinger steps forward with a pistol in hand as the burly agent pushes Billie into the back seat and gets in next to her The two lovers make eye contact as the burly agent marches Billie away shoving her toward a government car Dillinger glares into his side mirror then gets out of the car Dillinger takes off his sunglasses as the agents restraining Billie indoors lead her outside Dillinger waits in the car as more armed agents exit a building directly in front of him and he startles slightly but the Gmen step right past realizing he is inside and cross the street Outside Inside Billie passes through another doorway where Purvis' men grab her handcuff her and she uncomfortably glances at the agents In the car Dillinger faces the side mirror and brushes his bangs off his forehead In her furcollared coat Billie crosses the street between passing vehicles and enters the building Peering through his round sunglasses Dillinger watches her go then looks into his side view mirror and sees only a man at a mailbox a vagrant and a few pedestrians Dillinger's car parks on a street and Billie smiles at him before getting out He takes her in his arm with the horizon sprawling flat between the sand and black sky Dillinger gazes at her brushes her dark hair aside to reveal her big eyes and she briefly lowers her gaze before smiling Outside on a moonlit shoreline Dillinger sits by a sleeping Billie whose hair hangs in her face Cardboard tags label switchboard cables at the telephone exchange as two female operators work an adjacent switchboard with an agent standing by He works his lips as Nitti listens to the radio and then phones D'Andrea"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Cardboard tags label switchboard cables at the telephone exchange as two female operators work an adjacent switchboard with an agent standing by He works his lips as Nitti listens to the radio and then phones D'Andrea Dillinger gazes at her brushes her dark hair aside to reveal her big eyes and she briefly lowers her gaze before smiling Outside on a moonlit shoreline Dillinger sits by a sleeping Billie whose hair hangs in her face Dillinger's car parks on a street and Billie smiles at him before getting out He takes her in his arm with the horizon sprawling flat between the sand and black sky In her furcollared coat Billie crosses the street between passing vehicles and enters the building Peering through his round sunglasses Dillinger watches her go then looks into his side view mirror and sees only a man at a mailbox a vagrant and a few pedestrians Inside Billie passes through another doorway where Purvis' men grab her handcuff her and she uncomfortably glances at the agents In the car Dillinger faces the side mirror and brushes his bangs off his forehead Dillinger waits in the car as more armed agents exit a building directly in front of him and he startles slightly but the Gmen step right past realizing he is inside and cross the street Outside Dillinger glares into his side mirror then gets out of the car Dillinger takes off his sunglasses as the agents restraining Billie indoors lead her outside Dillinger steps forward with a pistol in hand as the burly agent pushes Billie into the back seat and gets in next to her The two lovers make eye contact as the burly agent marches Billie away shoving her toward a government car Several armed agents remain behind on the sidewalk but fail to notice Dillinger who strides around a parked car and returns to his vehicle As they drive away Billie peers through the back window sitting between two agents and a shocked Dillinger stands out in the open watching the car drive off His car backs out leaving the remaining agents behind and the gangster wipes his reddened face holding a hand over his mouth as he sobs Dillinger gets in shuts the door grips the steering wheel bows his head and collects his breath She slouches with her left cheek bruised as the interrogator smacks her grabs her chin flings her head to the side and stands upright In a dim interrogation room the burly agent leans in front of Billie who sits in a chair with his partner standing behind her The interrogator steps out of the room as Billie trembles with her right hand cuffed to the chair holding her knees together"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Dillinger takes off his sunglasses as the agents restraining Billie indoors lead her outside Dillinger glares into his side mirror then gets out of the car The two lovers make eye contact as the burly agent marches Billie away shoving her toward a government car Dillinger steps forward with a pistol in hand as the burly agent pushes Billie into the back seat and gets in next to her As they drive away Billie peers through the back window sitting between two agents and a shocked Dillinger stands out in the open watching the car drive off Several armed agents remain behind on the sidewalk but fail to notice Dillinger who strides around a parked car and returns to his vehicle Dillinger gets in shuts the door grips the steering wheel bows his head and collects his breath His car backs out leaving the remaining agents behind and the gangster wipes his reddened face holding a hand over his mouth as he sobs In a dim interrogation room the burly agent leans in front of Billie who sits in a chair with his partner standing behind her She slouches with her left cheek bruised as the interrogator smacks her grabs her chin flings her head to the side and stands upright The interrogator steps out of the room as Billie trembles with her right hand cuffed to the chair holding her knees together He works his lips as Nitti listens to the radio and then phones D'Andrea Cardboard tags label switchboard cables at the telephone exchange as two female operators work an adjacent switchboard with an agent standing by Outside on a moonlit shoreline Dillinger sits by a sleeping Billie whose hair hangs in her face Dillinger gazes at her brushes her dark hair aside to reveal her big eyes and she briefly lowers her gaze before smiling He takes her in his arm with the horizon sprawling flat between the sand and black sky Dillinger's car parks on a street and Billie smiles at him before getting out Peering through his round sunglasses Dillinger watches her go then looks into his side view mirror and sees only a man at a mailbox a vagrant and a few pedestrians In her furcollared coat Billie crosses the street between passing vehicles and enters the building In the car Dillinger faces the side mirror and brushes his bangs off his forehead Inside Billie passes through another doorway where Purvis' men grab her handcuff her and she uncomfortably glances at the agents Outside Dillinger waits in the car as more armed agents exit a building directly in front of him and he startles slightly but the Gmen step right past realizing he is inside and cross the street"
        }
      ]
    }
  ]
}