{
  "ground_truth": "In the outer office, the burly agent downs a paper cup of water and passes Doris, who glares at him as he returns to the interrogation room. The interrogator returns, shuts the door, and eyes Billie. He crosses to her and grabs her chin again, shakes her, and Billie's mouth hangs open. She shudders, and her lips tremble as she finds words. The two agents leave her. On the way through the field office, the interrogator points to Doris, who holds the telephone at her shoulder. He puts on his jacket as the other men gather their things and move out. Doris dials her telephone. The agents run up a stairwell and, standing outside an apartment door, one shoots the top and bottom hinges. They rush in. Daylight filters into a bare room through an open window. The place is empty, and the burly agent stiffens his jaw. Back in the interrogation room, Billie sits with her head down. The two agents barge in, and the burly one grabs a phone book and whacks her with it. She keeps her head down, then looks directly at him. As Purvis enters the field office, Doris approaches him. In the interrogation room, she lowers her head and wipes her mouth. The interrogator glares down at her and tensely wipes his mouth, while Billie looks him in the eye. He sneers and winds up with his fist, but Winstead intercepts his arm and slams him against the wall. Purvis enters, and the other interrogator quickly uncuffs Billie's right arm from the chair. As she holds her wrist, Purvis leans over to her. He stands upright as Billie presses down on the arms of the chair to get up, then stops. Purvis glances at the other interrogator, then lifts Billie from the chair and carries her out. In the hall, the rest of the agents stand aside as he passes with the weakened woman. In the interrogation room, Winstead lowers his arm from the burly agent's throat and leaves. Purvis nods to Doris, who escorts them. In the interrogation room, the burly agent stays put beside the open door, out of the sightline of his peers, who stare in from the hall. In a pool hall, Marty dials a pay phone, and at his home, Nitti answers. A woman sits at a bar, and a door opens across the room. Marty enters and takes a seat next to her. Her weary gaze hangs straight ahead, then she looks directly at Marty. He takes her hand and gazes into her eyes. They pick up their drinks, share another glance, and both sip. At night, a lake reflects city lights. Marty leads Anna to a car. She gets in back and gazes at the unseen driver.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "In the outer office, the hefty operative consumes a paper cup of water and passes Doris, who glowers at him as he returns to the interrogation room. The questioner reenters, shuts the door, and observes Billie. He strides to her and seizes her chin again, shakes her, and Billie's mouth hangs open. She quivers, and her lips quiver as she finds words. The two operatives leave her. On the way through the field office, the questioner indicates Doris, who grips the telephone at her shoulder. He dons his coat as the other men gather their belongings and move out. Doris dials her telephone. The operatives sprint up a stairwell and, standing outside an apartment door, one fires at the top and bottom hinges. They rush in. Daylight filters into a vacant room through an open window. The place is devoid of occupants, and the hefty agent stiffens his jaw. Back in the interrogation room, Billie sits with her head down. The two operatives barge in, and the hefty one seizes a phone book and strikes her with it. She keeps her head down, then looks directly at him. As Purvis enters the field office, Doris approaches him. In the interrogation room, she lowers her head and wipes her mouth. The questioner glowers down at her and tensely wipes his mouth, while Billie looks him in the eye. He sneers and winds up with his fist, but Winstead intercepts his arm and slams him against the wall. Purvis enters, and the other questioner quickly uncuffs Billie's right arm from the chair. As she holds her wrist, Purvis leans over to her. He stands upright as Billie presses down on the arms of the chair to get up, then stops. Purvis glances at the other questioner, then lifts Billie from the chair and carries her out. In the hall, the rest of the operatives stand aside as he passes with the weakened woman. In the interrogation room, Winstead lowers his arm from the hefty agent's throat and departs. Purvis nods to Doris, who escorts them. In the interrogation room, the hefty agent stays put beside the open door, out of the sightline of his colleagues, who stare in from the hall. In a pool hall, Marty dials a pay phone, and at his home, Nitti answers. A woman sits at a bar, and a door opens across the room. Marty enters and takes a seat next to her. Her tired gaze hangs straight ahead, then she looks directly at Marty. He takes her hand and gazes into her eyes. They pick up their beverages, share another glance, and both sip. At night, a lake mirrors city lights. Marty guides Anna to a car. She gets in back and gazes at the unseen driver."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "In the outer office, a paper cup of water is downed by the burly agent and Doris is passed by him, who is glared at as he returns to the interrogation room by her. The door is shut by the interrogator as he returns and Billie is eyed by him. Her chin is grabbed by him again as he crosses to her, she is shaken by him, and Billie's mouth hangs open. She shudders, and words are found by her as her lips tremble. They leave her. On the way through the field office, Doris is pointed to by the interrogator, who holds the telephone at her shoulder. His jacket is put on by him as their things are gathered by the other men and they move out. The telephone is dialed by Doris. A stairwell is run up by the agents and, standing outside an apartment door, the top and bottom hinges are shot by one. They rush in. Daylight is filtered into a bare room through an open window. The place is empty, and the burly agent's jaw is stiffened. Back in the interrogation room, her head is kept down by Billie. They barge in, and a phone book is grabbed by the burly one and used to whack her with it. Her head is kept down by her, then she looks directly at him. Purvis enters the field office as Doris approaches him. In the interrogation room, her head is lowered and her mouth is wiped by her. Down at her, the interrogator glares and his mouth is tensely wiped by him, while he is looked in the eye by Billie. A sneer is produced and a wind-up with his fist is made by him, but his arm is intercepted by Winstead and he is slammed against the wall. Purvis enters, and Billie's right arm is quickly uncuffed from the chair by the other interrogator. As her wrist is held by her, Purvis leans over to her. He stands upright as the arms of the chair are pressed down on by Billie to get up, then she stops. The other interrogator is glanced at by Purvis, then Billie is lifted from the chair and carried out by him. In the hall, aside they stand as he passes with the weakened woman. In the interrogation room, the burly agent is stayed put by Winstead, who lowers his arm from his throat and leaves. Doris is nodded to by Purvis, who escorts them. In the interrogation room, beside the open door the burly agent stays put, out of the sightline of peers who stare in from the hall. In a pool hall, a pay phone is dialed by Marty, and Nitti answers at his home. A woman sits at a bar, and a door is opened across the room. Marty enters and a seat is taken next to her by him. Her weary gaze hangs straight ahead, then directly at Marty she looks. Her hand is taken by him and into her eyes he gazes. They pick up their drinks, another glance is shared, and both are sipped. At night, city lights are reflected by a lake. Marty leads Anna to a car. She gets in back and the unseen driver is gazed at by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In the outer office, the burly agent finishes a cup of water and passes a glaring Doris as he returns to the interrogation room. He enters, shuts the door, eyes Billie, grabs her chin, shakes her, and she shudders, finding words. The agents leave her, and the interrogator signals Doris, who holds the phone. He dons his jacket as they leave. Doris dials. The agents ascend stairs, shoot an apartment door's hinges, and rush into an empty room. The burly agent stiffens as daylight streams through the window. Back in the interrogation room, Billie sits silently. The agents return, and the burly one hits her with a phone book. She lifts her head to meet his gaze. As Purvis enters, Doris approaches him. In the room, Billie looks at the interrogator, who sneers and prepares to hit her, but Winstead stops him and slams him into the wall. Purvis arrives, Billie is unrestrained, and Purvis lifts her. Agents stand aside as he carries her out. Winstead lowers his arm from the burly agent's throat and exits. Purvis nods to Doris, who escorts them, while the burly agent remains, unseen by peers in the hall. In a pool hall, Marty calls Nitti from a payphone. A woman at the bar sits motionless until Marty sits beside her. They exchange looks, hold hands, sip drinks, and share a glance. Later, Marty leads Anna to a car by a lake reflecting city lights. She enters and looks at the unseen driver."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "In the outer office, the burly agent drinks water and passes Doris, who glares as he enters the interrogation room. The interrogator shuts the door, grabs Billie's chin, and shakes her; she shudders and trembles. The agents leave, and on their way, the interrogator signals Doris, who holds the phone. He wears his jacket as the agents depart. Doris dials. The agents rush up a stairwell, shoot an apartment door’s hinges, and enter. The daylight reveals an empty room, and the burly agent stiffens his jaw. Back in the interrogation room, Billie sits with her head down. The agents return, and the burly one hits her with a phone book. She looks at him. Purvis enters the field office, and Doris approaches. In the room, the interrogator glares at Billie. He sneers, but Winstead stops him from hitting her. Purvis arrives, and Billie's right arm is uncuffed. Purvis assists her, and as Billie tries to stand, he lifts and carries her out while agents step aside. In the hall, Winstead releases the burly agent and leaves. Purvis nods to Doris, who escorts them. The burly agent stays by the open door, unseen by colleagues in the hall. In a pool hall, Marty calls Nitti at home. A woman at the bar watches Marty enter and sit beside her. They hold hands, share a glance, and sip drinks. At night, a lake reflects city lights. Marty guides Anna to a car, where she looks at the unseen driver."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the outer office, the burly agent gulps down a quick paper cup of water before making his way past Doris, who shoots him a sharp, disdainful glare as he returns to the tense atmosphere of the interrogation room. Upon reentering, the interrogator closes the door firmly behind him and fixes his penetrating gaze on Billie. He strides over to her, forcefully grabbing her chin once again, shaking her slightly, as her mouth falls open in silent shock. She shudders visibly, her lips trembling, struggling to find the right words. Eventually, the two agents decide to leave her there. As they make their way through the field office, the interrogator gestures toward Doris, who is holding the telephone against her shoulder in readiness. He slips back into his jacket while the other men begin to gather their belongings and head out. Meanwhile, Doris proceeds to dial her telephone. The agents hurriedly ascend a stairwell and, positioned outside an apartment door, one of them shoots the top and bottom hinges with precision. They burst into the room. Daylight softly filters into the sparse room through an open window, revealing its emptiness. The burly agent tightens his jaw in response to the disappointment. Back in the interrogation room, Billie sits with her head bowed low. The two agents return abruptly, and the burly one seizes a phone book, striking her with it. She maintains her lowered position, then deliberately lifts her gaze to meet his. As Purvis enters the bustling field office, Doris approaches him promptly. Inside the interrogation room, Billie lowers her head again and gently wipes her mouth. The interrogator looms over her, tension evident as he wipes his own mouth, while Billie boldly meets his stare. Sneering, he prepares to strike with his fist, but Winstead intervenes, intercepting his arm and forcefully slamming the interrogator against the wall. Purvis strides in, and the other interrogator swiftly unfastens Billie's right arm from the chair. As she cradles her sore wrist, Purvis bends over her, then rises to full height as Billie begins to press down on the chair's arms to stand, only to pause. Purvis glances meaningfully at the other interrogator before lifting Billie from the chair completely and carrying her out. In the hallway, the remaining agents respectfully stand aside as he moves past with the weakened woman in his arms. Meanwhile, in the interrogation room, Winstead lowers his arm from the burly agent's throat and exits the scene. Purvis nods at Doris, who escorts them. Inside that same room, the burly agent remains motionless beside the open door, staying out of the sightline of his colleagues, who peer in from the hallway. Elsewhere, in a dimly lit pool hall, Marty picks up a pay phone and dials a number. At his home, Nitti picks up the call. Across the room, in a bar, a woman sits alone, and a door opens, catching her attention. Marty enters quietly, taking a seat beside her. Her weary eyes initially stare straight ahead, but then she turns to meet Marty's gaze directly. He takes her hand gently and looks deeply into her eyes. They lift their drinks, exchange another meaningful glance, and both take a sip. At night, the serene surface of a lake reflects the twinkling city lights. Marty leads Anna toward a waiting car. She climbs into the back seat and gazes quietly at the driver, who remains unseen."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the outer office, a stout and robust agent hastily gulps down a quick, small, disposable paper cup brimming with water before he makes his way past Doris. She, with a sharp and disdainful glare, shoots him a look filled with contempt as he resolutely returns to the tense and charged atmosphere of the interrogation room. Upon his reentry, the interrogator purposefully closes the door firmly behind him and fixes his penetrating and intense gaze upon Billie. He strides over to her with determination, forcefully grabbing her chin once again, shaking her slightly as her mouth falls open in silent shock and disbelief. She shudders visibly, her lips quivering as she struggles to find the appropriate words. Eventually, after much thought, the two agents decide to leave her there alone. As they make their way through the bustling field office, the interrogator gestures toward Doris, who is holding the telephone against her shoulder in readiness. He slips back into his neatly tailored jacket, while the other men begin to gather their belongings, preparing to head out. Meanwhile, Doris proceeds to dial her telephone with a sense of urgency. The agents hurriedly ascend a narrow stairwell and, positioned deliberately outside an apartment door, one of them expertly shoots the top and bottom hinges with precision. They burst forcefully into the room. Daylight softly filters into the sparse and empty room through an open window, revealing its bareness. The burly agent tightens his jaw, visibly responding to the disappointment. Back in the interrogation room, Billie sits with her head bowed low in defeat. The two agents return abruptly, and the burly one seizes a heavy phone book, striking her with it. She maintains her lowered position, then deliberately lifts her gaze to meet his, filled with defiance. As Purvis enters the bustling field office, Doris approaches him promptly and without hesitation. Inside the interrogation room, Billie lowers her head again and gently wipes her mouth. The interrogator looms threateningly over her, tension evident as he wipes his own mouth, while Billie boldly meets his fierce stare. Sneering, he prepares to strike her with his fist, but Winstead intervenes, intercepting his arm and forcefully slamming the interrogator against the wall. Purvis strides in with authority, and the other interrogator swiftly unfastens Billie's right arm from the chair. As she cradles her sore wrist, Purvis bends over her with concern, then rises to his full height as Billie begins to press down on the chair's arms to stand, only to pause. Purvis glances meaningfully at the other interrogator before lifting Billie from the chair completely and carrying her out. In the hallway, the remaining agents respectfully stand aside as he moves past with the weakened woman cradled securely in his arms. Meanwhile, in the interrogation room, Winstead lowers his arm from the burly agent's throat and exits the scene with resolve. Purvis nods at Doris, who dutifully escorts them. Inside that same room, the burly agent remains motionless beside the open door, staying out of the sightline of his colleagues, who peer in from the hallway with curiosity. Elsewhere, in the dimly lit and somewhat shadowy pool hall, Marty picks up a pay phone and dials a number with purpose. At his home, Nitti picks up the call with a sense of expectation. Across the room, in a bar, a woman sits alone, and a door opens, catching her immediate attention. Marty enters quietly, taking a seat beside her with ease. Her weary eyes initially stare straight ahead, but then she turns to meet Marty's gaze directly, locking onto his. He takes her hand gently and looks deeply into her eyes, conveying a silent understanding. They lift their drinks in unison, exchange another meaningful and lingering glance, and both take a sip. At night, the serene surface of a tranquil lake reflects the twinkling city lights with a calm beauty. Marty leads Anna toward a waiting car. She climbs into the back seat and gazes quietly at the driver, who remains unseen, shrouded in mystery."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the outer office, the burly agent quickly gulps down the contents of a paper cup filled with water. As he walks out, he passes by Doris, who fixes a glaring gaze on him while he makes his way back to the interrogation room. Upon entering, the interrogator closes the door behind him with a definitive motion and directs his piercing eyes toward Billie. He strides across the room with purpose, reaching her and firmly taking hold of her chin once more. He gives her a sharp shake, causing her mouth to fall open involuntarily. Her body shivers slightly, and her lips quiver as she struggles to form words. After this brief interaction, the two agents depart from her presence. As they make their way through the field office, the interrogator gestures toward Doris, who is holding the telephone against her shoulder, ready to act. He methodically slips on his jacket as the other men gather their belongings in preparation to leave. Meanwhile, Doris proceeds to dial her telephone. The agents hastily ascend a stairwell, and upon reaching an apartment door, one agent swiftly aims and fires at the top and bottom hinges. They charge into the room with urgency. Daylight softly streams into the stark, bare room through an open window, revealing the space to be empty, prompting the burly agent to tense his jaw in frustration. Meanwhile, back in the interrogation room, Billie sits with her head bowed low. The two agents re-enter abruptly, and the burly one seizes a phone book, striking her with it. Despite the assault, she maintains her head lowered, then eventually lifts her gaze to meet his eyes directly. As Purvis makes his entrance into the field office, Doris approaches him with intent. Inside the interrogation room, Billie lowers her head again, using her hand to wipe her mouth. The interrogator looms over her, anxiously wiping his own mouth, while Billie maintains eye contact with him. With a sneer, he readies his fist for another blow, but Winstead intervenes, intercepting the arm mid-swing and forcefully slamming the man against the wall. Purvis steps into the scene, and the other interrogator rapidly releases Billie's right arm from the chair's cuff. Billie clutches her wrist, and Purvis bends down towards her. He then straightens up as Billie presses her hands against the arms of the chair in an effort to stand, but she pauses. Purvis exchanges a glance with the other interrogator, then gently lifts Billie from the chair and carries her out. As they move through the hall, the other agents form a respectful path, stepping aside to allow him to pass with the enfeebled woman. Inside the interrogation room, Winstead slowly releases his grip from around the burly agent's throat before exiting the scene. Purvis gives a nod to Doris, who is orchestrating their movement. In the interrogation room, the burly agent remains rooted to his spot beside the open door, positioned just out of the line of sight of his colleagues, who are peering in from the hallway. Meanwhile, in a pool hall, Marty approaches a pay phone and dials a number. At his home, Nitti picks up the call with a swift motion. Back at a bar, a woman is seated while gazing wearily straight ahead, seemingly lost in thought, as a door opens across the room. Marty steps in and chooses a seat beside her, the two sharing proximity. Her tired gaze lingers in front before she shifts her focus directly onto Marty. He gently takes her hand in his and looks deeply into her eyes, creating a moment of silent understanding between them. They both lift their drinks, exchange another meaningful look, and take a sip together. As night falls, a lake mirrors the twinkling city lights. Marty takes the lead, guiding Anna to a car. She climbs into the back seat and then turns her gaze toward the driver, who remains unseen."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "In the outer office, the burly agent quickly drinks some water and returns to the interrogation room, passing Doris who glares at him. Inside, he eyes Billie, grabs her chin, shakes her, and leaves her shuddering and trembling. As they exit, the interrogator signals Doris, who holds the phone ready. The agents gather their belongings and head out, with Doris dialing the phone. They rush up a stairwell and forcefully enter an empty apartment, only to find daylight filtering through an open window, leaving the burly agent tense and frustrated. Back in the interrogation room, Billie sits with her head down as the agents re-enter. The burly agent hits her with a phone book, but she defiantly meets his gaze. Meanwhile, Doris approaches Purvis as he enters the field office. In the interrogation room, the tension escalates when the interrogator nearly assaults Billie, but Winstead intervenes, slamming the interrogator against the wall. Purvis enters and has Billie uncuffed, then helps her up and carries her past the agents in the hallway. Winstead leaves the room after lowering his arm from the burly agent's throat. Purvis nods at Doris to escort them, while the burly agent remains by the open door, unnoticed by his peers watching from the hall. Meanwhile, at a pool hall, Marty makes a call to Nitti at home. He then sits next to a woman at the bar, exchanging a weary yet meaningful glance with her. They hold hands, share a gaze, and sip their drinks. Later, by a lake reflecting city lights, Marty leads Anna to a car, where she gets in and faces the unseen driver."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In the outer office of the bustling Chicago field office, the burly agent downs a paper cup of water sourced from the building's cooler and passes Doris, known among colleagues for her sharp intuition, who glares at him as he returns to the interrogation room. The interrogator, using techniques some might consider outdated in modern law enforcement, returns, shuts the door, and eyes Billie. He crosses to her and grabs her chin roughly, a tactic meant to intimidate, shakes her, and Billie's mouth hangs open, a silent protest. She shudders, overwhelmed by the situation, and her lips tremble as she finds words. The two agents leave her in the cold, stark room. On the way through the field office, the interrogator points to Doris, who holds the telephone at her shoulder, ready to relay the latest intel. He puts on his jacket as the other men gather their things, mission-focused, and move out. Doris, quick with her fingers, dials her telephone. The agents run up a stairwell, the echoes of their footsteps bouncing off the walls, and, standing outside an apartment door of a suspected hideout, one shoots the top and bottom hinges with precision. They rush in. Daylight, the first of the morning, filters into a bare room through an open window. The place, devoid of any furniture or clues, is empty, and the burly agent stiffens his jaw, frustration mounting. Back in the interrogation room, Billie sits with her head down, eyes tracing the cracks in the old linoleum. The two agents barge in, and the burly one grabs a phone book, a large city directory, and whacks her with it. She keeps her head down, then looks directly at him, defiance in her eyes. As Purvis, the special agent in charge known for his strict adherence to protocol, enters the field office, Doris approaches him, a message in hand. In the interrogation room, she lowers her head and wipes her mouth, a small act of defiance. The interrogator glares down at her, tension palpable, and tensely wipes his mouth, while Billie looks him in the eye, unyielding. He sneers and winds up with his fist, but Winstead, another agent known for his cool demeanor, intercepts his arm and slams him against the wall, a decisive move. Purvis enters, and the other interrogator quickly uncuffs Billie's right arm from the chair, realizing the situation has shifted. As she holds her wrist, feeling the circulation return, Purvis leans over to her, offering comfort. He stands upright as Billie presses down on the arms of the chair to get up, then stops, momentarily unsure. Purvis glances at the other interrogator, his intentions clear, then lifts Billie from the chair and carries her out, a protector’s role. In the hall, the rest of the agents stand aside as he passes with the weakened woman, respect in their eyes. In the interrogation room, Winstead lowers his arm from the burly agent's throat and leaves, the altercation behind him. Purvis nods to Doris, who escorts them with the authority of someone who has been in similar situations before. In the interrogation room, the burly agent stays put beside the open door, out of the sightline of his peers, who stare in from the hall, curiosity piqued. In a smoky pool hall, Marty dials a pay phone, and at his opulent home, Nitti, a known associate of organized crime, answers. A woman sits at a bar, a place she frequents to escape reality, and a door opens across the room. Marty enters and takes a seat next to her, both seeking solace. Her weary gaze hangs straight ahead, then she looks directly at Marty, recognition in her eyes. He takes her hand and gazes into her eyes, a silent promise exchanged. They pick up their drinks, share another glance, and both sip, comfort found in each other’s company. At night, a lake reflects city lights, a serene contrast to the chaos in the city. Marty leads Anna to a car, a vintage model known for its elegance. She gets in back and gazes at the unseen driver, trusting in the journey ahead."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "In the outer office the burly agent downs a paper cup of water and passes Doris who glares at him as he returns to the interrogation room. The interrogator returns shuts the door and eyes Billie. He crosses to her and grabs her chin again shakes her and Billie's mouth hangs open. She shudders and her lips tremble as she finds words. The two agents leave her. On the way through the field office the interrogator points to Doris who holds the telephone at her shoulder. He puts on his jacket as the other men gather their things and move out. Doris dials her telephone. The agents run up a stairwell and standing outside an apartment door one shoots the top and bottom hinges. They rush in. Daylight filters into a bare room through an open window. The place is empty and the burly agent stiffens his jaw. Back in the interrogation room Billie sits with her head down. The two agents barge in and the burly one grabs a phone book and whacks her with it. She keeps her head down then looks directly at him. As Purvis enters the field office Doris approaches him. In the interrogation room she lowers her head and wipes her mouth. The interrogator glares down at her and tensely wipes his mouth while Billie looks him in the eye. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. He sneers and winds up with his fist but Winstead intercepts his arm and slams him against the wall. Purvis enters and the other interrogator quickly uncuffs Billie's right arm from the chair. As she holds her wrist Purvis leans over to her. He stands upright as Billie presses down on the arms of the chair to get up then stops. Purvis glances at the other interrogator then lifts Billie from the chair and carries her out. In the hall the rest of the agents stand aside as he passes with the weakened woman. In the interrogation room Winstead lowers his arm from the burly agent's throat and leaves. Purvis nods to Doris who escorts them. In the interrogation room the burly agent stays put beside the open door out of the sightline of his peers who stare in from the hall. In a pool hall Marty dials a pay phone and at his home Nitti answers. A woman sits at a bar and a door opens across the room. Marty enters and takes a seat next to her. Her weary gaze hangs straight ahead. then she looks directly at Marty. He takes her hand and gazes into her eyes. They pick up their drinks share another glance and both sip. At night a lake reflects city lights. Marty leads Anna to a car. She gets in back and gazes at the unseen driver."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "In the outer office the burly agent downs a paper cup of water and passes Doris who glares at him as he returns to the interrogation room. The interrogator returns shuts the door and eyes Billie. He crosses to her and grabs her chin again shakes her and Billie's mouth hangs open. She shudders and her lips tremble as she finds words. The two agents leave her. On the way through the field office the interrogator points to Doris who holds the telephone at her shoulder. He puts on his jacket as the other men gather their things and move out. Doris dials her telephone. The agents run up a stairwell and standing outside an apartment door one shoots the top and bottom hinges. They rush in. Daylight filters into a bare room through an open window. The place is empty and the burly agent stiffens his jaw. Back in the interrogation room Billie sits with her head down. The two agents barge in and the burly one grabs a phone book and whacks her with it. She keeps her head down then looks directly at him. As Purvis enters the field office Doris approaches him. In the interrogation room she lowers her head and wipes her mouth. The interrogator glares down at her and tensely wipes his mouth while Billie looks him in the eye. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. He sneers and winds up with his fist but Winstead intercepts his arm and slams him against the wall. Purvis enters and the other interrogator quickly uncuffs Billie's right arm from the chair. As she holds her wrist Purvis leans over to her. He stands upright as Billie presses down on the arms of the chair to get up then stops. Purvis glances at the other interrogator then lifts Billie from the chair and carries her out. In the hall the rest of the agents stand aside as he passes with the weakened woman. In the interrogation room Winstead lowers his arm from the burly agent's throat and leaves. Purvis nods to Doris who escorts them. In the interrogation room the burly agent stays put beside the open door out of the sightline of his peers who stare in from the hall. In a pool hall Marty dials a pay phone and at his home Nitti answers. A woman sits at a bar and a door opens across the room. Marty enters and takes a seat next to her. Her weary gaze hangs straight ahead. then she looks directly at Marty. He takes her hand and gazes into her eyes. They pick up their drinks share another glance and both sip. At night a lake reflects city lights. Marty leads Anna to a car. She gets in back and gazes at the unseen driver."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "In the outer office the burly agent downs a paper cup of water and passes Doris who glares at him as he returns to the interrogation room. The interrogator returns shuts the door and eyes Billie. He crosses to her and grabs her chin again shakes her and Billie's mouth hangs open. She shudders and her lips tremble as she finds words. The two agents leave her. On the way through the field office the interrogator points to Doris who holds the telephone at her shoulder. He puts on his jacket as the other men gather their things and move out. Doris dials her telephone. The agents run up a stairwell and standing outside an apartment door one shoots the top and bottom hinges. In a pool hall Marty dials a pay phone and at his home Nitti answers. A woman sits at a bar and a door opens across the room. Marty enters and takes a seat next to her. Her weary gaze hangs straight ahead. then she looks directly at Marty. He takes her hand and gazes into her eyes. They pick up their drinks share another glance and both sip. At night a lake reflects city lights. Marty leads Anna to a car. She gets in back and gazes at the unseen driver."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "In the outer office the burly agent downs a paper cup of water and passes Doris who glares at him as he returns to the interrogation room. The interrogator returns shuts the door and eyes Billie. He crosses to her and grabs her chin again shakes her and Billie's mouth hangs open. She shudders and her lips tremble as she finds words. They pick up their drinks share another glance and both sip. At night a lake reflects city lights. Marty leads Anna to a car. She gets in back and gazes at the unseen driver."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "In the inner cabin, the lanky fisherman sips a tin mug of juice and bypasses Clara, who scowls at him as he ambles to the observation deck. The supervisor arrives, slides the panel, and scans Sammy. He ambles to him and grips his elbow anew, jostles him, and Sammy's eyes widen. He quivers, and his knees wobble as he utters phrases. The pair of sailors exit him. On the trek through the meadow shed, the supervisor signals to Clara, who cradles the radio at her neck. He puts on his hat as the other folks collect their items and proceed out. Clara tunes her radio. The sailors climb down a passageway and, pausing outside a bungalow gate, one kicks the upper and lower bolts. They dart in. Moonlight streams into a sparse parlor through a raised shutter. The area is vacant, and the lanky fisherman tightens his grip. Back on the observation deck, Sammy sits with his gaze lowered. The pair of sailors storm in, and the lanky one clutches a ledger and strikes him with it. He keeps his gaze to the ground, then glances up at him. As Finley enters the meadow shed, Clara approaches him. On the observation deck, he bows his head and dabs his eyes. The supervisor peers down at him and nervously dabs his eyes, while Sammy stares him down. He grimaces and swings his arm, but Thompson seizes his wrist and flings him against the window. Finley enters, and the other supervisor swiftly loosens Sammy's left elbow from the post. As he grasps his forearm, Finley leans in to him. He stands straight as Sammy presses down on the legs of the stool to rise, then halts. Finley casts a glance at the other supervisor, then hoists Sammy from the stool and ushers him out. In the corridor, the rest of the sailors step aside as he ambles with the fatigued lad. On the observation deck, Thompson lowers his wrist from the lanky fisherman's collar and exits. Finley nods to Clara, who guides them. On the observation deck, the lanky fisherman remains fixed beside the open panel, out of view of his comrades, who peer in from the corridor. In a card room, Neil taps a handheld radio, and at his den, Lewis responds. A guy reclines in a nook, and a panel swings ajar across the space. Neil strides in and claims a perch beside him. His drowsy gaze stays straight ahead, then he peers directly at Neil. He clasps his fingers and peers into his gaze. They lift their mugs, exchange another look, and both drink. By twilight, a pond mirrors town flames. Neil guides Claire to a train. She boards and glances at the unseen passenger."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In the outer office, the burly agent drinks water and passes Doris, who glares at him before he returns to the interrogation room to confront Billie. He and another agent leave her, and as they prepare to move out, Doris makes a phone call. The agents storm into a seemingly empty apartment, while another agent looks on. Back in the interrogation room, Billie is assaulted but remains defiant, locking eyes with her interrogator. Winstead intervenes to stop further violence, and Purvis arrives, freeing Billie and carrying her out while the other agents watch. Meanwhile, in a pool hall, Marty calls Nitti from a pay phone. Later, he meets Anna at a bar, and they exchange a meaningful glance. They leave together at night, heading to a car by a lake."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She gets in back and gazes at the unseen driver Marty leads Anna to a car At night a lake reflects city lights They pick up their drinks share another glance and both sip He takes her hand and gazes into her eyes then she looks directly at Marty Her weary gaze hangs straight ahead Marty enters and takes a seat next to her A woman sits at a bar and a door opens across the room In a pool hall Marty dials a pay phone and at his home Nitti answers In the interrogation room the burly agent stays put beside the open door out of the sightline of his peers who stare in from the hall Purvis nods to Doris who escorts them In the interrogation room Winstead lowers his arm from the burly agent's throat and leaves In the hall the rest of the agents stand aside as he passes with the weakened woman Purvis glances at the other interrogator then lifts Billie from the chair and carries her out He stands upright as Billie presses down on the arms of the chair to get up then stops As she holds her wrist Purvis leans over to her Purvis enters and the other interrogator quickly uncuffs Billie's right arm from the chair He sneers and winds up with his fist but Winstead intercepts his arm and slams him against the wall The interrogator glares down at her and tensely wipes his mouth while Billie looks him in the eye In the interrogation room she lowers her head and wipes her mouth As Purvis enters the field office Doris approaches him She keeps her head down then looks directly at him The two agents barge in and the burly one grabs a phone book and whacks her with it Back in the interrogation room Billie sits with her head down The place is empty and the burly agent stiffens his jaw Daylight filters into a bare room through an open window They rush in The agents run up a stairwell and standing outside an apartment door one shoots the top and bottom hinges Doris dials her telephone He puts on his jacket as the other men gather their things and move out On the way through the field office the interrogator points to Doris who holds the telephone at her shoulder The two agents leave her She shudders and her lips tremble as she finds words He crosses to her and grabs her chin again shakes her and Billie's mouth hangs open The interrogator returns shuts the door and eyes Billie In the outer office the burly agent downs a paper cup of water and passes Doris who glares at him as he returns to the interrogation room"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The interrogator returns shuts the door and eyes Billie In the outer office the burly agent downs a paper cup of water and passes Doris who glares at him as he returns to the interrogation room She shudders and her lips tremble as she finds words He crosses to her and grabs her chin again shakes her and Billie's mouth hangs open On the way through the field office the interrogator points to Doris who holds the telephone at her shoulder The two agents leave her Doris dials her telephone He puts on his jacket as the other men gather their things and move out They rush in The agents run up a stairwell and standing outside an apartment door one shoots the top and bottom hinges The place is empty and the burly agent stiffens his jaw Daylight filters into a bare room through an open window The two agents barge in and the burly one grabs a phone book and whacks her with it Back in the interrogation room Billie sits with her head down As Purvis enters the field office Doris approaches him She keeps her head down then looks directly at him The interrogator glares down at her and tensely wipes his mouth while Billie looks him in the eye In the interrogation room she lowers her head and wipes her mouth Purvis enters and the other interrogator quickly uncuffs Billie's right arm from the chair He sneers and winds up with his fist but Winstead intercepts his arm and slams him against the wall He stands upright as Billie presses down on the arms of the chair to get up then stops As she holds her wrist Purvis leans over to her In the hall the rest of the agents stand aside as he passes with the weakened woman Purvis glances at the other interrogator then lifts Billie from the chair and carries her out Purvis nods to Doris who escorts them In the interrogation room Winstead lowers his arm from the burly agent's throat and leaves In a pool hall Marty dials a pay phone and at his home Nitti answers In the interrogation room the burly agent stays put beside the open door out of the sightline of his peers who stare in from the hall Marty enters and takes a seat next to her A woman sits at a bar and a door opens across the room then she looks directly at Marty Her weary gaze hangs straight ahead They pick up their drinks share another glance and both sip He takes her hand and gazes into her eyes Marty leads Anna to a car At night a lake reflects city lights She gets in back and gazes at the unseen driver"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Purvis enters and the other interrogator quickly uncuffs Billie's right arm from the chair As she holds her wrist Purvis leans over to her He stands upright as Billie presses down on the arms of the chair to get up then stops Purvis glances at the other interrogator then lifts Billie from the chair and carries her out In the hall the rest of the agents stand aside as he passes with the weakened woman In the interrogation room Winstead lowers his arm from the burly agent's throat and leaves Purvis nods to Doris who escorts them In the interrogation room the burly agent stays put beside the open door out of the sightline of his peers who stare in from the hall In a pool hall Marty dials a pay phone and at his home Nitti answers A woman sits at a bar and a door opens across the room Marty enters and takes a seat next to her Her weary gaze hangs straight ahead then she looks directly at Marty He takes her hand and gazes into her eyes They pick up their drinks share another glance and both sip At night a lake reflects city lights Marty leads Anna to a car She gets in back and gazes at the unseen driver In the outer office the burly agent downs a paper cup of water and passes Doris who glares at him as he returns to the interrogation room The interrogator returns shuts the door and eyes Billie He crosses to her and grabs her chin again shakes her and Billie's mouth hangs open She shudders and her lips tremble as she finds words The two agents leave her On the way through the field office the interrogator points to Doris who holds the telephone at her shoulder He puts on his jacket as the other men gather their things and move out Doris dials her telephone The agents run up a stairwell and standing outside an apartment door one shoots the top and bottom hinges They rush in Daylight filters into a bare room through an open window The place is empty and the burly agent stiffens his jaw Back in the interrogation room Billie sits with her head down The two agents barge in and the burly one grabs a phone book and whacks her with it She keeps her head down then looks directly at him As Purvis enters the field office Doris approaches him In the interrogation room she lowers her head and wipes her mouth The interrogator glares down at her and tensely wipes his mouth while Billie looks him in the eye He sneers and winds up with his fist but Winstead intercepts his arm and slams him against the wall"
        }
      ]
    }
  ]
}