{
  "ground_truth": "Purvis sits at the wheel while Anna averts her gaze, and Purvis stares at the helpless informant. She gets out of the car, and Purvis' gaze follows her as she walks around his vehicle. Holding a gun in his pocket, Dillinger peeks around a tree, wearing a straw boater hat and sporting a trimmed mustache. He steps out to meet Piquett, and they sit on a roadside park bench. Piquett reaches into his coat, and Dillinger unfolds the page to reveal a handwritten message that reads, \"I am too well guarded. Two years is not a long time anyway.\" Dillinger folds up the note, stands, and walks away while Piquett puts on his hat and heads off in the opposite direction. Now at a stone wall, Dillinger, Alvin Karpis, and other men look down at an idling steam locomotive as Alvin turns away from Dillinger, who stares ahead. Anna sits at the kitchen table fanning herself with a magazine, and Dillinger enters, crossing the room. Anna's fanning motion slows as her knowing gaze follows him. Dillinger glances around the living room, then returns to the kitchen, goes to the sink, and washes his hands. Anna glances at the door as Polly emerges, and Dillinger dries his hands with the towel and leads the way through the house to the front door. They leave, and our view returns to Anna, who remains at the table, covering her mouth with her hand. Madala crosses the field office to Purvis, who sits on a desk, and Purvis eagerly talks the call. As he listens, Winstead looks up from a newspaper, and Purvis lowers the phone, turning to his peers as the agents gather, with all eyes turning to Winstead. Madala checks a newspaper. Dillinger pulls up to a building with Polly, and they enter the building through a set of double doors, where she goes off, and Dillinger steps forward, casually chewing gum as he glances around. An elevator door opens, and Dillinger steps aboard among a few other men, including a uniformed officer, and he glances at the elevator operator as the door glides shut. He enters the quiet office, passing a row of empty chairs against the wall of a waiting area, with daylight shining in through a window. Dillinger hikes up his pants as he enters the main office, turning to a bulletin board where multiple mug shots of familiar criminals hang posted. He crosses to a desk and holds briefly by a secretary busy typing, and a couple of yards ahead, an agent on the phone sits at his desk, unaware of Dillinger's presence. The gangster finds another bulletin board and scans its postings, seeing a mug shot of Homer, photos of a robbed bank and a sprawled body, and a street map. A smile crosses Dillinger's lips as he passes through a brilliant shaft of sunlight.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Purvis perches at the helm while Anna turns her gaze, and Purvis stares at the powerless informant. She exits the automobile, and Purvis' gaze follows her as she strolls around his vehicle. Grasping a pistol in his pocket, Dillinger peers around a tree, wearing a straw boater hat and sporting a trimmed mustache. He steps out to encounter Piquett, and they sit on a roadside park bench. Piquett reaches into his coat, and Dillinger unfolds the sheet to reveal a handwritten message that reads, \"I am too well protected. Two years is not a long time anyway.\" Dillinger folds up the note, stands, and walks away while Piquett puts on his hat and heads off in the opposite direction. Now at a stone wall, Dillinger, Alvin Karpis, and other men look down at an idling steam locomotive as Alvin turns away from Dillinger, who stares forward. Anna sits at the kitchen table fanning herself with a magazine, and Dillinger enters, crossing the room. Anna's fanning motion slows as her knowing gaze follows him. Dillinger glances around the living space, then returns to the kitchen, goes to the sink, and washes his hands. Anna glances at the door as Polly emerges, and Dillinger dries his hands with the towel and leads the way through the dwelling to the front door. They leave, and our view returns to Anna, who remains at the table, covering her mouth with her hand. Madala crosses the field office to Purvis, who perches on a desk, and Purvis eagerly talks the call. As he listens, Winstead looks up from a newspaper, and Purvis lowers the phone, turning to his peers as the agents gather, with all eyes turning to Winstead. Madala checks a newspaper. Dillinger pulls up to a structure with Polly, and they enter the building through a set of double doors, where she goes off, and Dillinger steps forward, casually chewing gum as he glances around. An elevator door opens, and Dillinger steps aboard among a few other men, including a uniformed officer, and he glances at the elevator operator as the door glides shut. He enters the quiet office, passing a row of vacant chairs against the wall of a waiting area, with daylight shining in through a window. Dillinger hikes up his trousers as he enters the main office, turning to a bulletin board where multiple mug shots of familiar criminals hang posted. He crosses to a desk and holds briefly by a secretary busy typing, and a couple of yards ahead, an agent on the phone sits at his desk, unaware of Dillinger's presence. The gangster finds another bulletin board and scans its postings, seeing a mug shot of Homer, photos of a robbed bank and a sprawled body, and a street map. A smile crosses Dillinger's lips as he passes through a brilliant shaft of sunlight."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "At the wheel, the wheel is sat at by Purvis while her gaze is averted by Anna, and the helpless informant is stared at by Purvis. Out of the car, she gets, and her movement around his vehicle is followed by Purvis's gaze. In his pocket, a gun is held by Dillinger, who peeks around a tree, wearing a straw boater hat and sporting a trimmed mustache. Piquett is met by him, and on a roadside park bench, they sit. His coat is reached into by Piquett, and the page is unfolded by Dillinger to reveal a handwritten message that reads, \"I am too well guarded. Two years is not a long time anyway.\" The note is folded up by Dillinger, he stands, and away he walks while his hat is put on by Piquett, who heads off in the opposite direction. At a stone wall, Dillinger, Alvin Karpis, and other men look down at an idling steam locomotive, and away from Dillinger, Alvin turns, who is stared ahead by him. At the kitchen table, Anna is sat fanning herself with a magazine, and the room is crossed by Dillinger as he enters. Her fanning motion is slowed by Anna as a knowing gaze follows him. The living room is glanced around by Dillinger, then the kitchen is returned to by him, the sink is gone to, and his hands are washed by him. At the door, Anna glances as Polly emerges, and with the towel, his hands are dried by Dillinger, and the way through the house to the front door is led by him. They leave, and our view is returned to Anna, who is remained at the table, and her mouth is covered with her hand. The field office is crossed by Madala to Purvis, who is sat on a desk, and the call is eagerly talked by Purvis. As he listens, up from a newspaper looks Winstead, and the phone is lowered by Purvis, turning to his peers as the agents gather, with all eyes turning to Winstead. A newspaper is checked by Madala. At a building, Dillinger is pulled up with Polly, and through a set of double doors, the building is entered, where she goes off, and forward, Dillinger steps, casually chewing gum as around, he glances. An elevator door opens, and aboard steps Dillinger among a few other men, including a uniformed officer, and at the elevator operator, he glances as the door glides shut. The quiet office is entered by him, passing a row of empty chairs against the wall of a waiting area, with daylight shining in through a window. His pants are hiked up by Dillinger as the main office is entered, turning to a bulletin board where multiple mug shots of familiar criminals are hung posted. To a desk, he crosses and briefly holds by a secretary busy typing, and a couple of yards ahead, at his desk sits an agent on the phone, unaware of Dillinger’s presence. Another bulletin board is found by the gangster, and its postings are scanned, seeing a mug shot of Homer, photos of a robbed bank and a sprawled body, and a street map. Through a brilliant shaft of sunlight, a smile crosses Dillinger's lips as he passes."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Purvis sits at the wheel while Anna averts her gaze, and Purvis watches the helpless informant. Anna exits the car, with Purvis' eyes following her as she circles his vehicle. Dillinger, clutching a gun in his pocket, peeks from behind a tree, wearing a straw boater hat and a trimmed mustache. He approaches Piquett, and they sit on a park bench. Piquett retrieves an item from his coat, and Dillinger unfolds a note that reads, \"I am too well guarded. Two years is not a long time anyway.\" Dillinger refolds the note, stands, and leaves as Piquett dons his hat and walks the opposite way. At a stone wall, Dillinger, Alvin Karpis, and others overlook an idling steam locomotive. Alvin turns away, leaving Dillinger staring ahead. Anna sits fanning herself with a magazine at the kitchen table, and Dillinger enters. Her fanning slows as she watches him. Dillinger glances through the living room, returns to the kitchen, goes to the sink, and washes his hands. Anna notices the door as Polly appears, and Dillinger dries his hands, leading Polly through the house to the front door. They leave, with Anna remaining at the table, her hand covering her mouth. Madala crosses the office to Purvis, who eagerly answers the call. Winstead looks up from a newspaper as Purvis communicates with his colleagues, who all turn their attention to Winstead. Madala checks a newspaper. Dillinger and Polly arrive at a building, enter through double doors, and she departs as Dillinger steps forward, chewing gum and looking around. He boards an elevator with other men, including an officer, glancing at the operator before the door closes. In a quiet office, he passes empty chairs in the waiting area, sunlight streaming in. Dillinger adjusts his pants and enters the main office, examining a bulletin board with mug shots of criminals. He pauses by a secretary typing, and further ahead, an agent on the phone is oblivious to Dillinger's presence. Dillinger scans another bulletin board with a mug shot of Homer, photos of a robbed bank, a body, and a street map. Smiling, Dillinger walks through a shaft of sunlight."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Purvis drives as Anna looks away, staring at the informant. She exits, and Purvis watches her walk around the car. Dillinger, with a gun in his pocket and a straw boater hat, peeks from a tree and meets Piquett on a bench. Piquett retrieves a message revealing, \"I am too well guarded. Two years is not a long time anyway.\" Dillinger leaves, Piquett departs the opposite way. At a stone wall, Dillinger, Karpis, and others observe a steam locomotive; Alvin turns away. Anna fans herself at the table as Dillinger enters, washes his hands, and leads Polly out. Madala approaches Purvis on a call, prompting agents to gather and look at Winstead. Dillinger arrives with Polly at a building, enters, and takes the elevator with others. Inside, he passes empty waiting area chairs and daylight from a window. In the main office, he sees a bulletin board with mug shots and a street map, smiling as he passes sunlight."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Seated firmly behind the wheel, Purvis directed his attention forward while Anna intentionally looked away, avoiding any direct gaze, and Purvis continued to fixate on the powerless informant before them. Soon, she exited the vehicle, her movement catching Purvis' eyes, which tracked her as she circled his car with deliberate steps. Meanwhile, hidden behind a sturdy tree, Dillinger cautiously peered around its trunk, his hand subtly gripping a gun concealed in his pocket. His appearance was notable, marked by a straw boater hat perched on his head and a neatly trimmed mustache adorning his face. Stepping confidently out from his hiding spot, he moved to join Piquett, and together they settled onto a bench located by the roadside park. As they sat, Piquett reached into his coat, producing a piece of paper that Dillinger swiftly unfolded to reveal a handwritten message. The note articulated, \"I am too well guarded. Two years is not a long time anyway.\" After considering the message, Dillinger carefully refolded the note, stood up, and started to walk away, while Piquett, adjusting his hat, ventured off in the opposite direction.\n\nThe scene transitioned to a stone wall vantage point, where Dillinger, Alvin Karpis, and a group of other men gathered, their gazes fixed on a steam locomotive, which idled below them. As Alvin turned away from Dillinger, Dillinger remained focused, staring ahead with determination. Meanwhile, indoors, Anna was seated at the kitchen table, gently fanning herself with a magazine when Dillinger entered the room. Her fanning gradually slowed as her perceptive gaze followed him across the room. Dillinger cast a glance around the living room before promptly returning to the kitchen, proceeding directly to the sink to wash his hands. Anna's attention shifted to the door when Polly made her appearance, and Dillinger, having dried his hands on a towel, led the way through the house towards the front door. Together, they departed, leaving Anna behind at the table, where she stayed, contemplatively covering her mouth with her hand.\n\nAt the field office, Madala made his way over to Purvis, who was perched on a desk, and Purvis took the call with noticeable eagerness. As he listened intently, Winstead glanced up from the newspaper he was reading, and observing Purvis lower the phone, he turned to face his colleagues, who had gathered around. Their collective attention was now on Winstead, while Madala scanned the pages of a newspaper. Meanwhile, Dillinger drove up to a substantial building accompanied by Polly, and upon arrival, they entered through a set of imposing double doors. Inside, Polly went her separate way, while Dillinger continued forward, nonchalantly chewing gum as he surveyed his surroundings. The elevator door opened, and Dillinger stepped inside, mingling with a few other men, one of whom was a uniformed officer. He discreetly glanced at the elevator operator when the door slid shut behind them.\n\nUpon entering the tranquil office space, Dillinger passed by a neat row of empty chairs lining the wall of the waiting area, sunlight streaming through a nearby window illuminating the room. As he made his way into the main office, he adjusted his pants, drawing closer to a bulletin board displaying multiple mugshots of known criminals. He then crossed over to a desk, pausing briefly near a secretary who was absorbed in her typing. A short distance ahead, an agent was engrossed in a phone conversation at his desk, seemingly oblivious to Dillinger's presence. Continuing his exploration, Dillinger approached yet another bulletin board, meticulously scanning its array of postings. Among the images, he noticed a mugshot of Homer, photographs depicting a bank that had been robbed, a body sprawled on the ground, and a detailed street map. As he walked through a brilliant shaft of sunlight, a smile briefly played across Dillinger's lips."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Firmly seated behind the steering wheel, Purvis focused his complete attention straight ahead while Anna deliberately averted her eyes, avoiding any direct gaze. Meanwhile, Purvis continued to concentrate intensely on the powerless informant positioned in front of them. Not long after, she stepped out of the vehicle, her movements drawing Purvis' gaze, which attentively followed her as she walked with intentional steps around the perimeter of his car. In the meantime, Dillinger was cautiously hidden behind a robust tree. He peered around the sturdy trunk with care, his hand subtly and securely gripping a concealed gun within his pocket. His appearance was distinctive, with a straw boater hat perched stylishly upon his head and a meticulously trimmed mustache adorning his face. Confidently leaving his place of concealment, he proceeded to join Piquett, and together they settled themselves onto a bench located by the roadside park. As they sat side by side, Piquett reached into his coat pocket, retrieving a piece of paper that Dillinger quickly unfolded to read. The handwritten note declared, \"I am too well guarded. Two years is not a long time anyway.\" After digesting the message, Dillinger refolded the note with care, stood up from the bench, and began to walk away, while Piquett, after adjusting his hat thoughtfully, went off in the opposite direction.\n\nThe scene shifted to a stone wall vantage point, where Dillinger, Alvin Karpis, and a gathering of other men were assembled, their eyes collectively fixed on a steam locomotive that was idling below them. As Alvin turned his attention away from Dillinger, Dillinger maintained his focus, staring straight ahead with unwavering determination. Meanwhile, inside, Anna was comfortably seated at the kitchen table, gently fanning herself with a magazine when Dillinger entered the room. Her fanning motion gradually slowed as her perceptive eyes followed him across the room. Dillinger cast a brief glance around the living room before promptly returning to the kitchen, heading directly to the sink to wash his hands. Anna's attention shifted towards the door when Polly made her entrance, and Dillinger, having dried his hands on a towel, led the way through the house toward the front door. Together, they departed, leaving Anna behind at the table, where she remained, contemplatively covering her mouth with her hand as thoughts lingered in her mind.\n\nAt the field office, Madala approached Purvis, who was perched on top of a desk, and Purvis accepted the call with obvious eagerness. As he listened with keen interest, Winstead glanced up from the newspaper he was deeply engrossed in reading, and upon observing Purvis lower the phone, he turned around to face his colleagues, who had gathered closely around. Their collective attention shifted to Winstead, while Madala scanned through the pages of a newspaper. In the meantime, Dillinger drove up to an imposing building with Polly as his company, and upon arriving, they entered through a notable set of double doors. Once inside, Polly went her separate way, while Dillinger continued forward, casually chewing gum as he surveyed the surroundings around him. When the elevator door opened, Dillinger stepped inside, mingling with a few other men, among whom was a uniformed officer. He discreetly glanced towards the elevator operator as the door slid shut behind them.\n\nUpon entering the tranquil office space, Dillinger passed by a neat row of empty chairs lining the wall of the waiting area, with sunlight streaming through a nearby window and illuminating the room with a warm glow. As he made his way into the main office area, he adjusted his pants, gradually drawing nearer to a bulletin board that prominently displayed multiple mugshots of known criminals. He then continued over to a desk, pausing briefly near a secretary who was fully absorbed in her typing duties. A short distance ahead, an agent was deeply engrossed in a phone conversation at his desk, seemingly unaware of Dillinger's presence. Continuing his exploration, Dillinger approached yet another bulletin board, meticulously scanning its arranged array of postings with keen interest. Among the images, he noticed a mugshot of Homer, photographs depicting a bank that had been recently robbed, a body sprawled on the ground, and a detailed street map. As he walked through a brilliantly illuminated shaft of sunlight, a brief and subtle smile played across Dillinger's lips, revealing a moment of satisfaction."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Purvis sits firmly at the wheel of the parked car, Anna diverts her gaze, purposefully looking away from the tense atmosphere, while Purvis remains fixated on the helpless informant, his eyes never leaving the individual. Anna carefully opens the car door, stepping out gracefully, and Purvis's attentive gaze follows her every movement as she makes her way around the exterior of the vehicle. In the distance, Dillinger cautiously peers from behind the cover of a sturdy tree, stealthily holding a gun within the depths of his pocket. His appearance is marked by a straw boater hat placed securely on his head and a neatly trimmed mustache lining his upper lip. With deliberate steps, he moves out from the tree's concealment to approach Piquett, and together, the two settle on a roadside park bench. Piquett methodically reaches into his coat, and Dillinger carefully unfolds a page to expose a handwritten message, which reads with a somber tone, \"I am too well guarded. Two years is not a long time anyway.\" After taking a moment to absorb the message's significance, Dillinger methodically refolds the note, rises confidently to his feet, and begins to walk away, each step purposeful, while Piquett dons his hat and proceeds to depart in the opposite direction. Now standing by a formidable stone wall, Dillinger and his company, including Alvin Karpis and other men, direct their gazes downward at an idling steam locomotive, its machinery alive with latent power, as Alvin turns dismissively away from Dillinger, who continues to direct his steady stare ahead. Meanwhile, Anna sits back at a kitchen table, the gentle motion of a magazine in her hand creating a small breeze as she fans herself. Dillinger enters the scene, cutting across the room with an air of purpose, and Anna's rhythmic fanning gradually slows as her gaze, filled with understanding, follows him. Dillinger casts a quick glance around the living room, taking in the surroundings, before he returns to the kitchen, making his way to the sink, where he thoroughly washes his hands with care. Anna's eyes dart towards the door just as Polly emerges into the space, and Dillinger, with hands now dried by a towel, takes the lead, guiding the way through the house towards the front door. They step out, and the focus shifts back to Anna, who remains seated at the table, her hand now discretely covering her mouth in a gesture of contemplation. In another location, Madala crosses the bustling field office to reach Purvis, who is perched on a desk, eagerly engaging with an incoming call. As Purvis listens intently, Winstead momentarily lifts his gaze from a newspaper, his curiosity piqued, while Purvis lowers the phone from his ear, turning to address his gathered colleagues, all of whom have now fixed their attention on Winstead. Madala takes a moment to examine a newspaper, his brow furrowed in consideration. Transitioning to a new scene, Dillinger drives up to a building in the company of Polly, and together, they enter the establishment through a set of imposing double doors. Once inside, Polly diverges from Dillinger's path, while he steps forward with a casual demeanor, nonchalantly chewing gum as he surveys his surroundings. An elevator door slides open, and Dillinger steps aboard, finding himself among a few other men, including a uniformed officer, and he casually glances at the elevator operator as the doors smoothly close. Entering the quiet office, Dillinger walks past a row of empty chairs aligned against the wall of a waiting area, daylight streaming in through a window, casting a gentle glow around him. Adjusting his trousers with a slight hitch, Dillinger strides into the main office, turning his attention to a bulletin board where several mug shots of notorious criminals are prominently displayed. He crosses the room to a desk, momentarily pausing beside a secretary engrossed in her typing, her fingers flying over the keys, and a few yards ahead, an agent absorbed in a phone conversation remains oblivious to Dillinger's presence. Continuing his unhurried exploration, the gangster discovers another bulletin board, where he meticulously scans the various postings, noting a mug shot of Homer, photographs depicting a recently robbed bank and a sprawled body, alongside a detailed street map. A smile plays on Dillinger's lips as he moves on, passing through a bright shaft of sunlight that briefly envelops him in its warmth before he continues on his way."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Purvis sits at the wheel while Anna averts her gaze from the helpless informant. As she exits the car, Purvis watches her walk around his vehicle. Meanwhile, Dillinger, wearing a straw boater hat and a trimmed mustache, discreetly observes from behind a tree before meeting Piquett at a roadside bench. Piquett retrieves a note that Dillinger unfolds, revealing a message about being too well guarded, indicating his resignation to a two-year wait. Dillinger then departs opposite Piquett, who dons his hat as he leaves. At a stone wall, Dillinger, Alvin Karpis, and others observe a steam locomotive, with Dillinger focused on the scene as Alvin turns away. Inside, Anna fans herself at the kitchen table as Dillinger enters, crosses the room, and washes his hands at the sink. Anna watches knowingly while Polly appears at the door. Dillinger dries his hands and leads Polly through the house and out the front door, leaving Anna contemplative at the table. At the field office, Madala approaches Purvis, who eagerly takes a call, capturing the attention of Winstead and other agents, who gather as Purvis communicates significant news, prompting Madala to check a newspaper. Dillinger arrives at a building with Polly, entering through double doors before they separate. As he casually chews gum, he surveys his surroundings, boards an elevator with other men, including a uniformed officer, and enters a quiet office. Passing empty chairs in the waiting area, the daylight illuminates his path as he enters the main office, hiking his pants and scanning a bulletin board filled with criminal mug shots. He briefly pauses by a secretary at a desk and observes an agent on the phone, who remains unaware of his presence. Dillinger then examines another bulletin board, finding images of Homer, a robbed bank, a sprawled body, and a street map, smiling as he walks through a brilliant shaft of sunlight."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Purvis sits at the wheel while Anna averts her gaze, and Purvis stares at the helpless informant. She gets out of the car, and Purvis' gaze follows her as she walks around his vehicle. Holding a gun in his pocket, Dillinger, the infamous bank robber whose exploits made headlines during the Great Depression, peeks around a tree, wearing a straw boater hat typical of the 1930s and sporting a trimmed mustache. He steps out to meet Piquett, known as a shrewd lawyer who often represented criminals, and they sit on a roadside park bench. Piquett reaches into his coat, and Dillinger unfolds the page to reveal a handwritten message that reads, \"I am too well guarded. Two years is not a long time anyway,\" a cryptic note hinting at the constant surveillance by law enforcement. Dillinger folds up the note, stands, and walks away while Piquett puts on his hat and heads off in the opposite direction. Now at a stone wall, an iconic location often used for clandestine meetings in films, Dillinger, Alvin Karpis, a fellow notorious gangster on the FBI's most-wanted list, and other men look down at an idling steam locomotive, a major mode of transport during this era, as Alvin turns away from Dillinger, who stares ahead. Anna sits at the kitchen table fanning herself with a magazine featuring glamorous Hollywood stars of the time, and Dillinger enters, crossing the room. Anna's fanning motion slows as her knowing gaze follows him. Dillinger glances around the living room, then returns to the kitchen, goes to the sink, and washes his hands. Anna glances at the door as Polly emerges, a friend involved in Dillinger's criminal operations, and Dillinger dries his hands with the towel and leads the way through the house to the front door. They leave, and our view returns to Anna, who remains at the table, covering her mouth with her hand, reflecting the tension of their lifestyle. Madala crosses the field office to Purvis, the famed FBI agent tasked with capturing Dillinger, who sits on a desk, and Purvis eagerly talks the call. As he listens, Winstead looks up from a newspaper headlined with stories of crime sprees, and Purvis lowers the phone, turning to his peers as the agents gather, with all eyes turning to Winstead. Madala checks a newspaper dated to the year 1934, when public enemy number one was actively pursued. Dillinger pulls up to a building with Polly, and they enter the building through a set of double doors, a common architectural feature in urban settings of the time, where she goes off, and Dillinger steps forward, casually chewing gum, an iconic gesture often associated with nonchalance, as he glances around. An elevator door opens, and Dillinger steps aboard among a few other men, including a uniformed officer, indicative of the ever-present danger for Dillinger, and he glances at the elevator operator as the door glides shut. He enters the quiet office, passing a row of empty chairs against the wall of a waiting area, with daylight shining in through a window, suggesting the setting of a law office. Dillinger hikes up his pants as he enters the main office, turning to a bulletin board where multiple mug shots of familiar criminals hang posted, a testament to the era's most notorious figures. He crosses to a desk and holds briefly by a secretary busy typing on a Remington typewriter, and a couple of yards ahead, an agent on the phone sits at his desk, unaware of Dillinger's presence. The gangster finds another bulletin board and scans its postings, seeing a mug shot of Homer, a fellow criminal associate, photos of a robbed bank and a sprawled body, and a street map. A smile crosses Dillinger's lips as he passes through a brilliant shaft of sunlight, a moment of fleeting triumph amidst a life of constant pursuit."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Madala crosses the field office to Purvis who sits on a desk and Purvis eagerly talks the call Now at a stone wall Purvis sits at the wheel while Anna averts her gaze and Purvis stares at the helpless informant She gets out of the car and Purvis' gaze follows her as she walks around his vehicle Holding a gun in his pocket Dillinger peeks around a tree wearing a straw boater hat and sporting a trimmed mustache He steps out to meet Piquett and they sit on a roadside park bench Piquett reaches into his coat and Dillinger unfolds the page to reveal a handwritten message that reads I am too well guarded Two years is not a long time anyway Dillinger hikes up his pants as he enters the main office turning to a bulletin board where multiple mug shots of familiar criminals hang posted He steps out to meet Piquett and they sit on a roadside park bench She gets out of the car and Purvis' gaze follows her as she walks around his vehicle Dillinger folds up the note stands and walks away while Piquett puts on his hat and heads off in the opposite direction Now at a stone wall Dillinger Alvin Karpis and other men look down at an idling steam locomotive as Alvin turns away from Dillinger who stares ahead Piquett reaches into his coat and Dillinger unfolds the page to reveal a handwritten message that reads I am too well guarded Anna sits at the kitchen table fanning herself with a magazine and Dillinger enters crossing the room Holding a gun in his pocket Dillinger peeks around a tree wearing a straw boater hat and sporting a trimmed mustache Anna's fanning motion slows as her knowing gaze follows him Dillinger glances around the living room then returns to the kitchen goes to the sink and washes his hands an agent on the phone sits at his desk unaware of Dillinger's presence Anna glances at the door as Polly emerges and Dillinger dries his hands with the towel and leads the way through the house to the front door They leave and our view returns to Anna who remains at the table covering her mouth with her hand A smile crosses Dillinger's lips as he passes through a brilliant shaft of sunlight Purvis sits at the wheel while Anna averts her gaze and Purvis stares at the helpless informant Madala crosses the field office to Purvis who sits on a desk and Purvis eagerly talks the call As he listens Winstead looks up from a newspaper and Purvis lowers the phone turning to his peers as the agents gather with all eyes turning to Winstead Dillinger Alvin Karpis and other men look down at an idling steam locomotive as Alvin turns away from Dillinger who stares ahead Madala checks a newspaper Dillinger pulls up to a building with Polly and they enter the building through a set of double doors where she goes off and Dillinger steps forward casually chewing gum as he glances around An elevator door opens and Dillinger steps aboard among a few other men including a uniformed officer and he glances at the elevator operator as the door glides shut The gangster finds another bulletin board and scans its postings seeing a mug shot of Homer photos of a robbed bank and a sprawled body and a street map They leave and our view returns to Anna who remains at the table covering her mouth with her hand He enters the quiet office passing a row of empty chairs against the wall of a waiting area with daylight shining in through a window Dillinger hikes up his pants as he enters the main office turning to a bulletin board where multiple mug shots of familiar criminals hang posted He crosses to a desk and holds briefly by a secretary busy typing and a couple of yards ahead an agent on the phone sits at his desk unaware of Dillinger's presence The gangster finds another bulletin board and scans its postings seeing a mug shot of Homer photos of a robbed bank and a sprawled body and a street map A smile crosses Dillinger's lips as he passes through a brilliant shaft of sunlight"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Purvis sits at the wheel while Anna averts her gaze and Purvis stares at the helpless informant. She gets out of the car and Purvis' gaze follows her as she walks around his vehicle. Holding a gun in his pocket Dillinger peeks around a tree wearing a straw boater hat and sporting a trimmed mustache. He steps out to meet Piquett and they sit on a roadside park bench. Piquett reaches into his coat and Dillinger unfolds the page to reveal a handwritten message that reads I am too well guarded. Two years is not a long time anyway. Dillinger folds up the note stands and walks away while Piquett puts on his hat and heads off in the opposite direction. Now at a stone wall. Dillinger Alvin Karpis and other men look down at an idling steam locomotive as Alvin turns away from Dillinger who stares ahead. Anna sits at the kitchen table fanning herself with a magazine and Dillinger enters crossing the room. Anna's fanning motion slows as her knowing gaze follows him. Dillinger glances around the living room then returns to the kitchen goes to the sink and washes his hands. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Anna glances at the door as Polly emerges and Dillinger dries his hands with the towel and leads the way through the house to the front door. They leave and our view returns to Anna who remains at the table covering her mouth with her hand. Madala crosses the field office to Purvis who sits on a desk and Purvis eagerly talks the call. As he listens Winstead looks up from a newspaper and Purvis lowers the phone turning to his peers as the agents gather with all eyes turning to Winstead. Madala checks a newspaper. Dillinger pulls up to a building with Polly and they enter the building through a set of double doors where she goes off and Dillinger steps forward casually chewing gum as he glances around. An elevator door opens and Dillinger steps aboard among a few other men including a uniformed officer and he glances at the elevator operator as the door glides shut. He enters the quiet office passing a row of empty chairs against the wall of a waiting area with daylight shining in through a window. Dillinger hikes up his pants as he enters the main office turning to a bulletin board where multiple mug shots of familiar criminals hang posted. He crosses to a desk and holds briefly by a secretary busy typing and a couple of yards ahead. an agent on the phone sits at his desk unaware of Dillinger's presence. The gangster finds another bulletin board and scans its postings seeing a mug shot of Homer photos of a robbed bank and a sprawled body and a street map. A smile crosses Dillinger's lips as he passes through a brilliant shaft of sunlight."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Purvis sits at the wheel while Anna averts her gaze and Purvis stares at the helpless informant. She gets out of the car and Purvis' gaze follows her as she walks around his vehicle. Holding a gun in his pocket Dillinger peeks around a tree wearing a straw boater hat and sporting a trimmed mustache. He steps out to meet Piquett and they sit on a roadside park bench. Piquett reaches into his coat and Dillinger unfolds the page to reveal a handwritten message that reads I am too well guarded. Two years is not a long time anyway. Dillinger folds up the note stands and walks away while Piquett puts on his hat and heads off in the opposite direction. Now at a stone wall. Dillinger Alvin Karpis and other men look down at an idling steam locomotive as Alvin turns away from Dillinger who stares ahead. Anna sits at the kitchen table fanning herself with a magazine and Dillinger enters crossing the room. Anna's fanning motion slows as her knowing gaze follows him. Dillinger glances around the living room then returns to the kitchen goes to the sink and washes his hands. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Anna glances at the door as Polly emerges and Dillinger dries his hands with the towel and leads the way through the house to the front door. They leave and our view returns to Anna who remains at the table covering her mouth with her hand. Madala crosses the field office to Purvis who sits on a desk and Purvis eagerly talks the call. As he listens Winstead looks up from a newspaper and Purvis lowers the phone turning to his peers as the agents gather with all eyes turning to Winstead. Madala checks a newspaper. Dillinger pulls up to a building with Polly and they enter the building through a set of double doors where she goes off and Dillinger steps forward casually chewing gum as he glances around. An elevator door opens and Dillinger steps aboard among a few other men including a uniformed officer and he glances at the elevator operator as the door glides shut. He enters the quiet office passing a row of empty chairs against the wall of a waiting area with daylight shining in through a window. Dillinger hikes up his pants as he enters the main office turning to a bulletin board where multiple mug shots of familiar criminals hang posted. He crosses to a desk and holds briefly by a secretary busy typing and a couple of yards ahead. an agent on the phone sits at his desk unaware of Dillinger's presence. The gangster finds another bulletin board and scans its postings seeing a mug shot of Homer photos of a robbed bank and a sprawled body and a street map. A smile crosses Dillinger's lips as he passes through a brilliant shaft of sunlight."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Purvis sits at the wheel while Anna averts her gaze and Purvis stares at the helpless informant. She gets out of the car and Purvis' gaze follows her as she walks around his vehicle. Holding a gun in his pocket Dillinger peeks around a tree wearing a straw boater hat and sporting a trimmed mustache. He steps out to meet Piquett and they sit on a roadside park bench. Piquett reaches into his coat and Dillinger unfolds the page to reveal a handwritten message that reads I am too well guarded. Two years is not a long time anyway. An elevator door opens and Dillinger steps aboard among a few other men including a uniformed officer and he glances at the elevator operator as the door glides shut. He enters the quiet office passing a row of empty chairs against the wall of a waiting area with daylight shining in through a window. Dillinger hikes up his pants as he enters the main office turning to a bulletin board where multiple mug shots of familiar criminals hang posted. He crosses to a desk and holds briefly by a secretary busy typing and a couple of yards ahead. an agent on the phone sits at his desk unaware of Dillinger's presence. The gangster finds another bulletin board and scans its postings seeing a mug shot of Homer photos of a robbed bank and a sprawled body and a street map. A smile crosses Dillinger's lips as he passes through a brilliant shaft of sunlight."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Purvis sits at the wheel while Anna averts her gaze and Purvis stares at the helpless informant. She gets out of the car and Purvis' gaze follows her as she walks around his vehicle. an agent on the phone sits at his desk unaware of Dillinger's presence. The gangster finds another bulletin board and scans its postings seeing a mug shot of Homer photos of a robbed bank and a sprawled body and a street map. A smile crosses Dillinger's lips as he passes through a brilliant shaft of sunlight."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Madala sits at the wheel while Polly averts her gaze, and Madala stares at the helpless informant. The cat gets out of the car, and Madala's gaze follows the cat as it walks around his vehicle. Holding a gun in his pocket, the dog peeks around a tree, wearing a straw boater hat and sporting a trimmed mustache. The dog steps out to meet the rabbit, and they sit on a roadside park bench. The rabbit reaches into its coat, and the dog unfolds the page to reveal a handwritten message that reads, \"I am too well guarded. Two years is not a long time anyway.\" The dog folds up the note, stands, and walks away while the rabbit puts on its hat and heads off in the opposite direction. Now at a stone wall, the dog, the crow, and other men look down at an idling steam locomotive as the crow turns away from the dog, who stares ahead. Polly sits at the kitchen table fanning herself with a magazine, and the dog enters, crossing the room. Polly's fanning motion slows as her knowing gaze follows the dog. The dog glances around the living room, then returns to the kitchen, goes to the sink, and washes his hands. Polly glances at the door as the owl emerges, and the dog dries his hands with the towel and leads the way through the house to the front door. They leave, and our view returns to Polly, who remains at the table, covering her mouth with her hand. Anna crosses the field office to Madala, who sits on a desk, and Madala eagerly talks the call. As Madala listens, the elephant looks up from a newspaper, and Madala lowers the phone, turning to his peers as the agents gather, with all eyes turning to the elephant. Anna checks a newspaper. The dog pulls up to a building with the owl, and they enter the building through a set of double doors, where the owl goes off, and the dog steps forward, casually chewing gum as he glances around. An elevator door opens, and the dog steps aboard among a few other men, including a uniformed officer, and he glances at the elevator operator as the door glides shut. The dog enters the quiet office, passing a row of empty chairs against the wall of a waiting area, with daylight shining in through a window. The dog hikes up his pants as he enters the main office, turning to a bulletin board where multiple mug shots of familiar criminals hang posted. The dog crosses to a desk and holds briefly by a secretary busy typing, and a couple of yards ahead, an agent on the phone sits at his desk, unaware of the dog's presence. The gangster finds another bulletin board and scans its postings, seeing a mug shot of the fox, photos of a robbed bank and a sprawled body, and a street map. A smile crosses the dog's lips as he passes through a brilliant shaft of sunlight."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Purvis sits at the helm while Anna averts her gaze, and Purvis stares at the helpless bystander. She gets out of the buggy, and Purvis' gaze follows her as she walks around his carriage. Holding a pebble in his pocket, Dillinger peeks around a hedge, wearing a fedora and sporting a trimmed beard. He steps out to meet Piquett, and they sit on a roadside fence. Piquett reaches into his satchel, and Dillinger unfolds the brochure to reveal a handwritten message that reads, \"I am too well hidden. Two weeks is not a long time anyway.\" Dillinger folds up the message, stands, and walks away while Piquett puts on his scarf and heads off in the opposite direction. Now at a brick path, Dillinger, Alvin Karpis, and other men look down at an idling trolley as Alvin turns away from Dillinger, who stares ahead. Anna sits at the dining table fanning herself with a newspaper, and Dillinger enters, crossing the room. Anna's fanning motion slows as her knowing gaze follows him. Dillinger glances around the parlor, then returns to the dining room, goes to the counter, and washes his hands. Anna glances at the door as Polly emerges, and Dillinger dries his hands with the cloth and leads the way through the house to the porch. They leave, and our view returns to Anna, who remains at the table, covering her mouth with her hand. Madala crosses the warehouse to Purvis, who sits on a bench, and Purvis eagerly talks the call. As he listens, Winstead looks up from a pamphlet, and Purvis lowers the receiver, turning to his peers as the operatives gather, with all eyes turning to Winstead. Madala checks a pamphlet. Dillinger pulls up to a cabin with Polly, and they enter the building through a set of glass doors, where she goes off, and Dillinger steps forward, casually chewing a toothpick as he glances around. A lift door opens, and Dillinger steps aboard among a few other men, including a uniformed surgeon, and he glances at the lift operator as the door glides shut. He enters the quiet archive, passing a row of empty stools against the wall of a waiting area, with daylight shining in through a skylight. Dillinger adjusts his trousers as he enters the main archive, turning to a cork board where multiple sketches of familiar figures hang posted. He crosses to a counter and holds briefly by a typist busy writing, and a couple of feet ahead, a guard on the phone sits at his counter, unaware of Dillinger's presence. The gangster finds another cork board and scans its postings, seeing a sketch of Homer, photos of a looted train and a sprawled figure, and a zoning plan. A smile crosses Dillinger's lips as he passes through a brilliant shaft of moonlight."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Purvis reclines at the wheel while Anna closes her eyes, and Purvis glares at the helpless informant. She climbs out of the car, and Purvis' gaze tracks her as she skips around his vehicle. Holding a book in his pocket, Dillinger peers around a tree, wearing a straw boater hat and sporting a trimmed mustache. He leaps forward to meet Piquett, and they lounge on a roadside park bench. Piquett pulls a snack from his coat, and Dillinger crumples the page to reveal a handwritten message that reads, \"I am too well guarded. Two years is not a long time anyway.\" Dillinger bundles up the note, sits, and jogs away while Piquett adjusts his hat and strolls off in the opposite direction. Now at a stone wall, Dillinger, Alvin Karpis, and other men gaze down at an idling steam locomotive as Alvin spins away from Dillinger, who blinks ahead. Anna reclines at the kitchen table waving herself with a magazine, and Dillinger enters, striding across the room. Anna's waving motion quickens as her knowing gaze lingers on him. Dillinger peers around the living room, then returns to the kitchen, approaches the sink, and wipes his hands. Anna peers at the door as Polly pops out, and Dillinger shakes his hands with the towel and guides the way through the house to the front door. They exit, and our view returns to Anna, who stays at the table, pressing her mouth with her hand. Madala maneuvers through the field office to Purvis, who leans on a desk, and Purvis eagerly answers the call. As he listens, Winstead peers up from a newspaper, and Purvis raises the phone, turning to his peers as the agents converge, with all eyes glancing to Winstead. Madala inspects a newspaper. Dillinger cruises up to a building with Polly, and they stride into the building through a set of double doors, where she wanders off, and Dillinger strides forward, casually chewing gum as he surveys around. An elevator door slides open, and Dillinger hops aboard among a few other men, including a uniformed officer, and he surveys the elevator operator as the door slides shut. He enters the quiet office, bypassing a row of empty chairs against the wall of a waiting area, with daylight streaming in through a window. Dillinger adjusts his pants as he steps into the main office, turning to a bulletin board where multiple mug shots of familiar criminals dangle posted. He meanders to a desk and lingers briefly by a secretary busy typing, and a couple of yards ahead, an agent on the phone reclines at his desk, unaware of Dillinger's presence. The gangster discovers another bulletin board and skims its postings, seeing a mug shot of Homer, photos of a robbed bank and a sprawled body, and a street map. A grin spreads across Dillinger's lips as he wanders through a brilliant shaft of sunlight."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Blender reclines at the helm while Penelope turns her vision, and Blender gazes at the powerless historian. She exits the bicycle, and Blender's vision trails her as she strolls around his skateboard. Grasping a book in his jacket, Thompson peers around a boulder, donning a wool beanie and boasting a bushy beard. He steps forward to greet Wickham, and they perch on a mountainside bus stop. Wickham reaches into his backpack, and Thompson opens the envelope to expose a typewritten note that states, \"I am too well monitored. Two decades is not a long journey regardless.\" Thompson folds the letter, rises, and ambles away as Wickham dons his scarf and heads off in a contrasting direction. Now at a wooden fence, Thompson, Harold Byrd, and other folks gaze down at a resting bullet train as Harold turns away from Thompson, who looks forward. Penelope reclines at the dining room counter cooling herself with a newspaper, and Thompson arrives, traversing the hall. Penelope's cooling gesture decelerates as her perceptive look follows him. Thompson glances around the den, then returns to the dining room, proceeds to the refrigerator, and cleans his face. Penelope looks at the window as Winnie appears, and Thompson dries his face with the curtain and leads the path through the cabin to the garden gate. They depart, and our sight returns to Penelope, who stays at the counter, shielding her chin with her elbow. McDonald crosses the playhouse to Blender, who perches on a chair, and Blender eagerly accepts the letter. As he reads, Watson glances up from a pamphlet, and Blender lowers the tablet, turning to his comrades as the chefs gather, with all eyes shifting to Watson. McDonald points to a pamphlet. Thompson pulls up to a theater with Winnie, and they enter the theater through a set of revolving doors, where she wanders off, and Thompson steps forward, mindlessly whistling as he observes around. An escalator release opens, and Thompson steps aboard among a few other women, including a costumed attendant, and he looks at the escalator conductor as the release glides shut. He enters the serene studio, passing a line of vacant benches against the panel of a reception zone, with neon shining in through a skylight. Thompson tugs up his jacket as he enters the central studio, turning to a corkboard where multiple sticky notes of recognizable avatars hang displayed. He crosses to a counter and pauses briefly by a librarian busy reading, and a few meters ahead, a chef on the headset sits at his counter, oblivious to Thompson's arrival. The traveler discovers another corkboard and reviews its displays, seeing a sticky note of Hector, images of a looted museum and a standing statue, and a canyon map. A grin graces Thompson's lips as he strides through a stunning beam of moonlight."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Garcia lounges in the hammock while Linda diverts her attention, and Garcia glances at the silent detective. He hops out of the hammock, and Garcia's glance trails her as she dances around his tent. Clutching a whistle in her jacket, Thompson glances from behind a fence, wearing a wool cap and sporting a bushy beard. She shuffles out to encounter Monroe, and they perch on a roadside mailbox. Monroe fumbles in his pocket, and Thompson flips the card to uncover a scribbled note that reads, \"I am too closely watched. Two days is not a long time anyway.\" Thompson closes the card, rises, and jogs away while Monroe adjusts his glasses and ambles off in the opposite direction. Now atop a grassy hill, Thompson, Clyde Barrow, and other women peer down at an immobile cargo truck as Clyde pivots away from Thompson, who peers ahead. Linda sits at the kitchen counter fanning herself with a piece of paper, and Thompson arrives, traversing the area. Linda's fanning lessens as her curious gaze tracks him. Thompson peers around the dining area, then ventures back to the kitchen, approaches the basin, and rinses his fingers. Linda peers at the window as Susan enters, and Thompson pats his fingers with the cloth and guides the way through the building to the main entrance. They depart, and our focus returns to Linda, who lingers at the counter, covering her mouth with her hand. Ramirez crosses the support center to Garcia, who reclines on a bench, and Garcia impatiently answers the message. As he hears, Collins peers over a magazine, and Garcia lifts the receiver, facing his colleagues as the team assembles, with all gazes shifting to Collins. Ramirez browses a magazine. Thompson cruises up to a warehouse with Susan, and they enter the warehouse through a pair of glass doors, where she wanders off, and Thompson strolls ahead, rhythmically tapping his foot as he peers around. An escalator door slides open, and Thompson steps aboard among a few other women, including a uniformed employee, and he peers at the elevator supervisor as the door slides shut. He wanders into the silent chamber, passing a line of unoccupied couches against the wall of a lounge area, with sunlight streaming in through a skylight. Thompson pulls up his socks as he ventures into the main chamber, turning to a corkboard where numerous wanted posters of notable outlaws are displayed. He makes his way to a workstation and pauses briefly by a clerk busy writing, and a few steps ahead, an officer on the headset lounges at his station, unaware of Thompson's arrival. The outlaw discovers another corkboard and surveys its notices, noticing a wanted poster of Clyde, pictures of a looted vault and a collapsed figure, and a city diagram. A grin spreads across Thompson's face as he strides through a brilliant shaft of illumination."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Purvis perches at the handlebars while Anna averts her ears, and Purvis glances at the puzzled traveler. She leaps out of the truck, and Purvis' attention follows her as she dances around his bicycle. Holding a banana in his backpack, Dillinger peers around a hedge, wearing a woolen beanie and sporting a bushy beard. He skips out to greet Piquett, and they perch on a grassy hillock. Piquett rummages through his backpack, and Dillinger unfolds the sheet to reveal a painted portrait that reads, \"I am too well guarded. Two years is not a short time anyway.\" Dillinger rolls up the canvas, hops up, and skips away while Piquett dons his scarf and heads off in the same direction. Now at a wooden gate, Dillinger, Alvin Karpis, and other men gaze down at a whistling teapot as Alvin turns away from Dillinger, who scans ahead. Anna rests at the dining table scratching herself with a newspaper, and Dillinger enters, circling the room. Anna's scratching motion halts as her aware gaze tracks him. Dillinger peers around the hallway, then returns to the dining room, goes to the stove, and cleans his fingernails. Anna peeks at the curtain as Polly enters, and Dillinger dries his fingernails with the cloth and leads the way through the house to the back door. They wander off, and our view swings to Anna, who remains at the table, covering her nose with her hand. Madala skips across the warehouse to Purvis, who lounges on a chair, and Purvis eagerly tosses the letter. As he watches, Winstead peers up from a comic book, and Purvis drops the phone, turning to his friends as the visitors mingle, with all gazes shifting to Winstead. Madala checks a comic book. Dillinger pedals to a barn with Polly, and they skip into the barn through a set of swinging gates, where she veers off, and Dillinger skips forward, casually humming a tune as he peers around. A trapdoor swings open, and Dillinger hops aboard among a few other men, including a suited detective, and he glances at the conductor as the trapdoor swings shut. He enters the bustling workshop, passing a row of empty crates against the wall of a waiting corner, with moonlight streaming in through an arch. Dillinger adjusts his cap as he enters the main workshop, turning to a corkboard where numerous sketches of familiar faces hang tacked. He hops to a counter and pauses briefly by a clerk busy scribbling, and a few steps ahead, a worker on a radio perches at his station, oblivious to Dillinger's presence. The gangster finds another corkboard and scans its sketches, spotting a portrait of Homer, paintings of a looted gallery and a toppled sculpture, and a treasure map. A grin crosses Dillinger's face as he wanders through a dazzling beam of starlight."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Zelda lounges at the helm while Brian averts his gaze, and Zelda stares at the bewildered traveler. He gets out of the truck, and Zelda's gaze follows him as he strides around her carriage. Clutching a stone in his satchel, Max peeks over a hedge, donning a woolen cap and sporting a tangled beard. He strides out to greet Niles, and they perch on a riverside log. Niles digs into his backpack, and Max unfurls the map to unveil a scribbled drawing that states, \"I am too deeply hidden. Two decades is not a lengthy period at all.\" Max wraps up the scroll, rises, and strides off while Niles dons his scarf and ambles off in the opposite way. Now at a wooden fence, Max, Charlie Lucas, and other folks peer down at a resting freight train as Charlie turns away from Max, who stares forward. Brian relaxes at the picnic table, fidgeting with a brochure, and Max arrives, crossing the yard. Brian's fidgeting slows as his puzzled gaze follows him. Max scans the dining room, then returns to the backyard, heads to the well, and rinses his face. Brian glances at the window as Sam emerges, and Max dries his face with the cloth and guides the crew through the grounds to the back gate. They depart, and our vantage returns to Brian, who stays at the table, clutching his chin with his hand. Curtis crosses the mailroom to Zelda, who perches on a chair, and Zelda eagerly reads the letter. As she peruses, Thompson glances up from a magazine, and Zelda lowers the parcel, turning to her colleagues as the staff assembles, with every gaze shifting to Thompson. Curtis checks a catalog. Max pulls up to a warehouse with Sam, and they enter the structure through a pair of swinging doors, where she wanders off, and Max strides forth, leisurely munching on peanuts as he surveys the scene. A conveyor belt starts, and Max steps aboard among a few other passengers, including a uniformed guard, and he peers at the machine operator as the belt glides along. He enters the quiet depot, passing a line of unoccupied stools against the wall of a lobby, with moonlight streaming in through a skylight. Max hoists up his socks as he enters the central chamber, approaching a display case where various sketches of famous adventurers hang affixed. He moves to a counter and pauses briefly by an assistant diligently filing, and a few feet ahead, a clerk on the radio sits at his station, oblivious to Max's approach. The explorer finds another display panel and examines its contents, noticing a portrait of Oscar, images of a conquered fortress and a recumbent statue, and a city blueprint. A grin spreads across Max's face as he moves through a dazzling beam of moonlight."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Purvis sits at the wheel while Anna averts her gaze, watching as the informant exits. Dillinger, with a gun in his pocket, peeks from behind a tree, then meets Piquett on a park bench. Piquett hands Dillinger a note: \"I am too well guarded. Two years is not a long time anyway.\" Dillinger leaves, and Piquett departs in the opposite direction. Later, Dillinger, Alvin Karpis, and others observe a steam locomotive. Anna fans herself at a kitchen table as Dillinger enters, washes his hands, then leaves with Polly, while Anna remains at the table, covering her mouth. At the field office, Purvis takes a call, and the agents, including Winstead, gather with anticipation. Dillinger and Polly enter a building; he steps into an elevator with other men, including an officer, then enters a quiet office. Passing empty chairs, Dillinger approaches a bulletin board displaying mug shots of criminals and scans it, seeing familiar faces and crime scenes, smiling as he walks through a shaft of sunlight."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A smile crosses Dillinger's lips as he passes through a brilliant shaft of sunlight The gangster finds another bulletin board and scans its postings seeing a mug shot of Homer photos of a robbed bank and a sprawled body and a street map an agent on the phone sits at his desk unaware of Dillinger's presence He crosses to a desk and holds briefly by a secretary busy typing and a couple of yards ahead Dillinger hikes up his pants as he enters the main office turning to a bulletin board where multiple mug shots of familiar criminals hang posted He enters the quiet office passing a row of empty chairs against the wall of a waiting area with daylight shining in through a window An elevator door opens and Dillinger steps aboard among a few other men including a uniformed officer and he glances at the elevator operator as the door glides shut Dillinger pulls up to a building with Polly and they enter the building through a set of double doors where she goes off and Dillinger steps forward casually chewing gum as he glances around Madala checks a newspaper As he listens Winstead looks up from a newspaper and Purvis lowers the phone turning to his peers as the agents gather with all eyes turning to Winstead Madala crosses the field office to Purvis who sits on a desk and Purvis eagerly talks the call They leave and our view returns to Anna who remains at the table covering her mouth with her hand Anna glances at the door as Polly emerges and Dillinger dries his hands with the towel and leads the way through the house to the front door Dillinger glances around the living room then returns to the kitchen goes to the sink and washes his hands Anna's fanning motion slows as her knowing gaze follows him Anna sits at the kitchen table fanning herself with a magazine and Dillinger enters crossing the room Dillinger Alvin Karpis and other men look down at an idling steam locomotive as Alvin turns away from Dillinger who stares ahead Now at a stone wall Dillinger folds up the note stands and walks away while Piquett puts on his hat and heads off in the opposite direction Two years is not a long time anyway Piquett reaches into his coat and Dillinger unfolds the page to reveal a handwritten message that reads I am too well guarded He steps out to meet Piquett and they sit on a roadside park bench Holding a gun in his pocket Dillinger peeks around a tree wearing a straw boater hat and sporting a trimmed mustache She gets out of the car and Purvis' gaze follows her as she walks around his vehicle Purvis sits at the wheel while Anna averts her gaze and Purvis stares at the helpless informant"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Madala checks a newspaper Anna glances at the door as Polly emerges and Dillinger dries his hands with the towel and leads the way through the house to the front door Anna sits at the kitchen table fanning herself with a magazine and Dillinger enters crossing the room He enters the quiet office passing a row of empty chairs against the wall of a waiting area with daylight shining in through a window An elevator door opens and Dillinger steps aboard among a few other men including a uniformed officer and he glances at the elevator operator as the door glides shut Dillinger folds up the note stands and walks away while Piquett puts on his hat and heads off in the opposite direction Two years is not a long time anyway Anna's fanning motion slows as her knowing gaze follows him As he listens Winstead looks up from a newspaper and Purvis lowers the phone turning to his peers as the agents gather with all eyes turning to Winstead He crosses to a desk and holds briefly by a secretary busy typing and a couple of yards ahead Dillinger glances around the living room then returns to the kitchen goes to the sink and washes his hands Dillinger pulls up to a building with Polly and they enter the building through a set of double doors where she goes off and Dillinger steps forward casually chewing gum as he glances around She gets out of the car and Purvis' gaze follows her as she walks around his vehicle Madala crosses the field office to Purvis who sits on a desk and Purvis eagerly talks the call an agent on the phone sits at his desk unaware of Dillinger's presence They leave and our view returns to Anna who remains at the table covering her mouth with her hand Holding a gun in his pocket Dillinger peeks around a tree wearing a straw boater hat and sporting a trimmed mustache The gangster finds another bulletin board and scans its postings seeing a mug shot of Homer photos of a robbed bank and a sprawled body and a street map Piquett reaches into his coat and Dillinger unfolds the page to reveal a handwritten message that reads I am too well guarded A smile crosses Dillinger's lips as he passes through a brilliant shaft of sunlight Now at a stone wall Dillinger Alvin Karpis and other men look down at an idling steam locomotive as Alvin turns away from Dillinger who stares ahead Purvis sits at the wheel while Anna averts her gaze and Purvis stares at the helpless informant He steps out to meet Piquett and they sit on a roadside park bench Dillinger hikes up his pants as he enters the main office turning to a bulletin board where multiple mug shots of familiar criminals hang posted"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They leave and our view returns to Anna who remains at the table covering her mouth with her hand Madala crosses the field office to Purvis who sits on a desk and Purvis eagerly talks the call As he listens Winstead looks up from a newspaper and Purvis lowers the phone turning to his peers as the agents gather with all eyes turning to Winstead Madala checks a newspaper Dillinger pulls up to a building with Polly and they enter the building through a set of double doors where she goes off and Dillinger steps forward casually chewing gum as he glances around An elevator door opens and Dillinger steps aboard among a few other men including a uniformed officer and he glances at the elevator operator as the door glides shut He enters the quiet office passing a row of empty chairs against the wall of a waiting area with daylight shining in through a window Dillinger hikes up his pants as he enters the main office turning to a bulletin board where multiple mug shots of familiar criminals hang posted He crosses to a desk and holds briefly by a secretary busy typing and a couple of yards ahead an agent on the phone sits at his desk unaware of Dillinger's presence The gangster finds another bulletin board and scans its postings seeing a mug shot of Homer photos of a robbed bank and a sprawled body and a street map A smile crosses Dillinger's lips as he passes through a brilliant shaft of sunlight Purvis sits at the wheel while Anna averts her gaze and Purvis stares at the helpless informant She gets out of the car and Purvis' gaze follows her as she walks around his vehicle Holding a gun in his pocket Dillinger peeks around a tree wearing a straw boater hat and sporting a trimmed mustache He steps out to meet Piquett and they sit on a roadside park bench Piquett reaches into his coat and Dillinger unfolds the page to reveal a handwritten message that reads I am too well guarded Two years is not a long time anyway Dillinger folds up the note stands and walks away while Piquett puts on his hat and heads off in the opposite direction Now at a stone wall Dillinger Alvin Karpis and other men look down at an idling steam locomotive as Alvin turns away from Dillinger who stares ahead Anna sits at the kitchen table fanning herself with a magazine and Dillinger enters crossing the room Anna's fanning motion slows as her knowing gaze follows him Dillinger glances around the living room then returns to the kitchen goes to the sink and washes his hands Anna glances at the door as Polly emerges and Dillinger dries his hands with the towel and leads the way through the house to the front door"
        }
      ]
    }
  ]
}