{
  "ground_truth": "Farther along the bulletin board, Dillinger finds black and white photos of himself. Others show more buildings, including photos of the Little Bohemia Lodge, the wrecked Ford, and a pair of confiscated Tommy guns, which he views after lowering his sunglasses. He crosses to a bulletin board showing mug shots of Billie, and the last mug shot of Dillinger himself remains unstamped. Dillinger lowers his shades and meets his mug shot's stern gaze. As he rounds a corner, he spies a group of agents around the radio, but one man glances over, and unrecognized, Dillinger moves on. In a cinema lobby, a fair-haired agent scans the surroundings while using a public phone, while elsewhere, another agent ends a call and shakes his head looking across the street. At the wheel of a parked car, Madala looks to Purvis, who is seated shotgun. A shaving kit lies open on a small, round table illuminated by a lamp's modest light, with a handgun beside it. Facing a mirror, Dillinger drags a razor down his lathered cheek, finishes shaving, and opens his pocket watch to eye Billie's photo and the time. He shuts the watch, puts it away, and pockets the gun. Parked near the Biograph, Purvis tensely rubs his thin-lipped mouth as a few anonymous patrons mill into the theater at the box office. The agent looks away, shifting his anxious gaze, then gets out of the car and paces down the sidewalk. He stops, turns, and puts his back to the cinema as a man arrives with two blonde women, one in a conspicuous orange skirt. Purvis blinks, looks over his shoulder, and spotting the trio, he looks away. Entering the packed house, the crime boss leaves Anna at her seat, then proceeds down the aisle with Polly to find adjacent seats as opening titles appear on the screen. In the packed audience, Dillinger stares intently at the screen through his spectacles. Outside, Purvis addresses his agents, pats Winstead's shoulder, and the team splits up. In the movie house, the crowd watches figures on screen playing hockey, followed by Clark Gable washing his hands in a men's room. Another character walks in, and Dillinger gazes at the screen with a boyish smirk as Gable shoots the man. Sitting on her own, Anna turns, peeking nervously over her shoulder, then faces the screen again, her chest heaving. Outside, agents take their positions as Winstead and Hurt duck into a storefront's recessed entryway. In the movie house, Dillinger watches the screen with a furrowed brow while leading lady Myrna Loy stares with her mouth agape. Dillinger gazes at her with a knitted brow and clenched jaw as the exotically pretty actress in a fur-collared coat wears a pensive expression. Later, she shifts her sober gaze and, later still, turns away from a door clad in black.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Further along the notice board, Dillinger discovers black and white photographs of himself. Others display additional structures, including photographs of the Little Bohemia Lodge, the destroyed Ford, and a set of seized Tommy guns, which he observes after lowering his sunglasses. He crosses to a notice board presenting mug shots of Billie, and the final mug shot of Dillinger himself remains unstamped. Dillinger lowers his shades and encounters his mug shot's stern gaze. As he rounds a corner, he notices a group of operatives around the radio, but one individual glances over, and unrecognized, Dillinger continues. In a cinema lobby, a fair-haired operative scans the surroundings while using a public phone, while elsewhere, another operative ends a call and shakes his head looking across the street. At the wheel of a parked vehicle, Madala looks to Purvis, who is seated shotgun. A shaving kit lies open on a small, round table illuminated by a lamp's modest light, with a firearm beside it. Facing a mirror, Dillinger drags a razor down his lathered cheek, finishes shaving, and opens his pocket watch to eye Billie's photograph and the time. He closes the watch, puts it away, and pockets the gun. Parked near the Biograph, Purvis tensely rubs his thin-lipped mouth as a few anonymous patrons mill into the theater at the box office. The operative looks away, shifting his anxious gaze, then gets out of the vehicle and paces down the sidewalk. He stops, turns, and puts his back to the cinema as a man arrives with two blonde women, one in a conspicuous orange skirt. Purvis blinks, looks over his shoulder, and spotting the trio, he looks away. Entering the packed house, the crime boss leaves Anna at her seat, then proceeds down the aisle with Polly to find adjacent seats as opening titles appear on the screen. In the packed audience, Dillinger stares intently at the screen through his spectacles. Outside, Purvis addresses his operatives, pats Winstead's shoulder, and the team splits up. In the movie house, the crowd watches figures on screen playing hockey, followed by Clark Gable washing his hands in a men's room. Another character walks in, and Dillinger gazes at the screen with a boyish smirk as Gable shoots the man. Sitting on her own, Anna turns, peeking nervously over her shoulder, then faces the screen again, her chest heaving. Outside, operatives take their positions as Winstead and Hurt duck into a storefront's recessed entryway. In the movie house, Dillinger watches the screen with a furrowed brow while leading lady Myrna Loy stares with her mouth agape. Dillinger gazes at her with a knitted brow and clenched jaw as the exotically pretty actress in a fur-collared coat wears a pensive expression. Later, she shifts her sober gaze and, later still, turns away from a door clad in black."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Farther along the bulletin board, black and white photos of Dillinger are found by him. More buildings are shown in others, including photos of the Little Bohemia Lodge, the wrecked Ford, and a pair of confiscated Tommy guns, which are viewed by him after his sunglasses are lowered. He crosses to a bulletin board showing mug shots of Billie, and he remains unstamped in the last mug shot of himself. His shades are lowered by Dillinger, and his mug shot's stern gaze is met by him. As a corner is rounded by him, a group of agents are spied around the radio, but one man glances over, and Dillinger, unrecognized, moves on. In a cinema lobby, the surroundings are scanned by a fair-haired agent while he uses a public phone, while elsewhere, another call ends as an agent shakes his head looking across the street. At the wheel of a parked car, Purvis is looked to by Madala, who is seated shotgun. An open shaving kit lies on a small, round table illuminated by a lamp's modest light, with a handgun beside it. Facing a mirror, a razor is dragged down his lathered cheek by Dillinger, shaving is finished, and Billie's photo and the time are eyed by him when he opens his pocket watch. The watch is shut by him, put away, and the gun is pocketed. Near the Biograph, Purvis tensely rubs his thin-lipped mouth as a few anonymous patrons mill into the theater at the box office. His anxious gaze is shifted by the agent, who looks away, then he gets out of the car and paces down the sidewalk. He stops, turns, and his back is put to the cinema as a man arrives with two blonde women, one in a conspicuous orange skirt. Purvis blinks, looks over his shoulder, and when he spots the trio, he looks away. Entering the packed house, Anna is left at her seat by the crime boss, then Polly and he proceed down the aisle to find adjacent seats as opening titles appear on the screen. In the packed audience, the screen is stared at intently by Dillinger through his spectacles. Outside, his agents are addressed by Purvis, Winstead's shoulder is patted, and the team splits up. In the movie house, figures on screen are watched by the crowd playing hockey, followed by Clark Gable washing his hands in a men's room. Another character walks in, and with a boyish smirk, the screen is gazed at by Dillinger as Gable shoots the man. Sitting on her own, Anna turns, nervously peeking over her shoulder, then the screen is faced again by her, her chest heaving. Outside, positions are taken by agents as Winstead and Hurt duck into a storefront's recessed entryway. In the movie house, the screen is watched by Dillinger with a furrowed brow while leading lady Myrna Loy stares with her mouth agape. With a knitted brow and clenched jaw, she is gazed at by Dillinger as the exotically pretty actress in a fur-collared coat wears a pensive expression. Later, she shifts her sober gaze and, later still, she turns away from a door clad in black."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Dillinger finds black-and-white photos of himself and buildings, including the Little Bohemia Lodge, a wrecked Ford, and confiscated Tommy guns, on a bulletin board. He notices unstamped mug shots of Billie and himself. Unrecognized, he sees agents around a radio and moves on. In a cinema lobby, an agent scans the area on a phone while another ends a call. Madala, seated in a car with Purvis, looks on. A shaving kit and gun sit on a table as Dillinger shaves, checks Billie's photo and the time, then pockets the gun. Near the Biograph, Purvis anxiously watches patrons enter, paces, and observes a man with two women, one in an orange skirt. Inside, Dillinger leaves Anna to find seats with Polly as titles appear. He watches the screen intently. Outside, Purvis addresses agents who then scatter. Dillinger smirks at the screen as Gable's character shoots someone. Anna nervously peeks over her shoulder in her seat. Agents, including Winstead and Hurt, take positions. Dillinger observes Myrna Loy on screen with a furrowed brow, as the actress in a fur coat looks pensive and later turns away from a door."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Farther along the bulletin board, Dillinger finds black and white photos of himself and others of buildings, including Little Bohemia Lodge, a wrecked Ford, and confiscated Tommy guns, after lowering his sunglasses. He sees a bulletin board with Billie’s mug shots and his mug shot unstamped. He lowers his shades, meeting his mug shot’s stern gaze. As he rounds a corner, he observes agents around the radio, but unrecognized, he moves on. In a cinema lobby, a fair-haired agent scans the area while on the phone, and another ends a call and looks across the street. In a parked car, Madala glances at Purvis, seated shotgun. A shaving kit on a table with a lamp's light has a handgun beside it. Facing a mirror, Dillinger shaves, checks his pocket watch revealing Billie's photo and the time, then pockets the gun. Near the Biograph, Purvis anxiously watches patrons entering the theater, gets out of the car, and paces. He stops, turns, and observes a man with two blonde women, one in an orange skirt. Entering the theater, the crime boss leaves Anna at her seat, finding seats with Polly as the film starts. Dillinger stares at the screen through his spectacles. Outside, Purvis addresses agents, pats Winstead's shoulder, and the team splits up. In the theater, the crowd watches hockey scenes, followed by Clark Gable in a men's room shooting a man, with Dillinger smirking. Anna nervously glances over her shoulder. Outside, agents take positions, and Winstead and Hurt hide in a storefront. Dillinger watches the screen intently while Myrna Loy's character stares with a pensive expression, then turns away from a door clad in black."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As Dillinger continues to move farther along the crowded bulletin board, he discovers a series of black and white photos of himself on display. Additionally, there are other photographs showcasing various buildings, including snapshots of the notable Little Bohemia Lodge, the wrecked Ford automobile, and a pair of confiscated Tommy guns. He observes these images with interest, his view unimpeded as he lowers his sunglasses to get a clearer look. He then steps across to another section of the bulletin board that displays a collection of mug shots, including those of Billie, and notices that his own final mug shot remains conspicuously unstamped. With a deliberate motion, Dillinger lowers his shades once more to meet the stern, unwavering gaze captured in his mug shot.\n\nAs he makes his way around a nearby corner, his attention is drawn to a group of agents huddled around a radio. Yet, even as one man glances in his direction, Dillinger remains unrecognized and continues to move forward. In the hustle and bustle of a cinema lobby, a fair-haired agent, wearing an alert expression, is busy scanning the surroundings while engaged in a conversation on a public phone. Meanwhile, elsewhere in the vicinity, another agent finishes his phone call and shakes his head, casting a reflective glance across the street. In a parked car, Madala is seated at the wheel, looking over at Purvis, who occupies the shotgun seat. A shaving kit is spread open on a small, round table illuminated by the modest light of a lamp, with a handgun casually laid beside it. Facing his reflection in the mirror, Dillinger smoothly drags a razor down his lathered cheek, completes his shaving ritual, and opens his pocket watch to regard Billie's photo and check the time. Once he's satisfied, he closes the watch, tucks it away, and discreetly pockets the gun for safekeeping.\n\nParked near the Biograph Theater, Purvis, exhibiting a tense demeanor, anxiously rubs his thin-lipped mouth as a few anonymous patrons casually mill about the box office entrance, making their way into the theater. The agent shifts his gaze restlessly, turning his eyes away before getting out of the car and beginning to pace down the sidewalk. He pauses for a moment, turns, and positions himself with his back to the cinema just as a man arrives accompanied by two blonde women, one of whom wears a conspicuous orange skirt that catches the eye. Purvis blinks, casting a glance over his shoulder, and upon spotting the trio, he diverts his attention elsewhere. Inside the bustling movie house, the crime boss, having left Anna at her designated seat, proceeds down the aisle with Polly to locate seats side by side as the opening titles start appearing on the screen. Sitting amidst the packed audience, Dillinger gazes intently at the screen through his spectacles, fully absorbed in the unfolding narrative.\n\nOutside the theater, Purvis addresses his team of agents with a commanding presence, giving Winstead a reassuring pat on the shoulder before the team strategically splits up. Inside the theater, the audience is captivated by figures on the screen engaging in an energetic game of hockey, followed by a scene where Clark Gable is seen washing his hands in a men's room. As another character makes his entrance, Dillinger watches with a boyish smirk as Gable nonchalantly shoots the man. Meanwhile, sitting alone, Anna turns around nervously, stealing glances over her shoulder with a sense of unease, before refocusing on the screen, her chest rising and falling with anxious breaths. Outside, agents strategically take up their positions, while Winstead and Hurt discreetly duck into the recessed entryway of a storefront for cover. Back within the confines of the movie house, Dillinger watches the screen with a furrowed brow, taking in the sight of leading lady Myrna Loy as she stares wide-eyed, her mouth agape in reaction to the on-screen events. Dillinger, deep in thought, gazes at her with a knitted brow and clenched jaw, captivated by the exotic beauty of the actress clad in a fur-collared coat who wears a pensive expression. As the scene progresses, she shifts her contemplative gaze and later turns away, clad in black as she moves away from a door."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As Dillinger continues to move farther along the bustling and crowded bulletin board, he happens upon a series of black and white photographs, prominently featuring himself on display. In addition to these, there are several other striking photographs that showcase various buildings, including well-taken snapshots of the notable Little Bohemia Lodge, the wrecked and damaged Ford automobile, and a pair of confiscated Tommy guns. He observes these images with keen interest, his view unimpeded as he smoothly lowers his sunglasses to get a clearer and unobstructed look at the details. He then steps deliberately across to another section of the bulletin board that displays an assortment of mug shots, including those of Billie, and he takes note that his own final mug shot remains conspicuously unstamped. With a deliberate and purposeful motion, Dillinger lowers his shades once more to meet the stern and unwavering gaze captured in his mug shot.\n\nAs he makes his way around a nearby corner, his attention is drawn to a group of agents intensely huddled around a radio. Yet, even as one man glances in his direction, Dillinger remains unrecognized and continues to move forward without interruption. In the hustle and bustle of a busy cinema lobby, a fair-haired agent, wearing an alert and watchful expression, is busily scanning the surroundings while simultaneously engaged in a conversation on a public phone. Meanwhile, elsewhere in the vicinity, another agent finishes his phone call and shakes his head, casting a reflective glance across the street. In a parked car, Madala is seated at the wheel, looking over at Purvis, who occupies the shotgun seat. A shaving kit is spread open on a small, round table illuminated by the modest light of a lamp, with a handgun casually laid beside it. Facing his reflection in the mirror, Dillinger smoothly drags a razor down his lathered cheek, completes his shaving ritual, and opens his pocket watch to regard Billie's photo and check the time. Once he's satisfied, he closes the watch, tucks it away, and discreetly pockets the gun for safekeeping.\n\nParked near the Biograph Theater, Purvis, exhibiting a tense and anxious demeanor, anxiously rubs his thin-lipped mouth as a few anonymous patrons casually mill about the box office entrance, making their way into the theater. The agent shifts his gaze restlessly, turning his eyes away before getting out of the car and beginning to pace down the sidewalk. He pauses for a moment, turns around, and positions himself with his back to the cinema just as a man arrives accompanied by two blonde women, one of whom wears a conspicuous orange skirt that catches the eye. Purvis blinks, casting a glance over his shoulder, and upon spotting the trio, he diverts his attention elsewhere. Inside the bustling and lively movie house, the crime boss, having left Anna at her designated seat, proceeds confidently down the aisle with Polly to locate seats side by side as the opening titles start appearing on the screen. Sitting amidst the packed audience, Dillinger gazes intently at the screen through his spectacles, fully absorbed in the unfolding and captivating narrative.\n\nOutside the theater, Purvis addresses his team of agents with a commanding and authoritative presence, giving Winstead a reassuring and friendly pat on the shoulder before the team strategically splits up. Inside the theater, the audience is captivated by figures on the screen engaging in an energetic and spirited game of hockey, followed by a scene where Clark Gable is seen washing his hands in a men's room. As another character makes his entrance, Dillinger watches with a boyish and amused smirk as Gable nonchalantly shoots the man. Meanwhile, sitting alone, Anna turns around nervously, stealing anxious glances over her shoulder with a sense of unease, before refocusing on the screen, her chest rising and falling with anxious breaths. Outside, agents strategically take up their positions, while Winstead and Hurt discreetly duck into the recessed entryway of a storefront for cover. Back within the confines of the movie house, Dillinger watches the screen with a furrowed brow, taking in the sight of leading lady Myrna Loy as she stares wide-eyed, her mouth agape in reaction to the on-screen events. Dillinger, deep in thought, gazes at her with a knitted brow and clenched jaw, captivated by the exotic beauty of the actress clad in a fur-collared coat who wears a pensive and contemplative expression. As the scene progresses, she shifts her contemplative gaze and later turns away, clad in black as she moves away from a door with a sense of purpose."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Farther along the bulletin board, Dillinger pauses to examine a series of black and white photos, noticing familiar images of himself among them. He leans in closer to scrutinize the photos, one by one, recognizing buildings and scenes familiar to him, including images of the Little Bohemia Lodge, the wrecked Ford, and a pair of confiscated Tommy guns. To get a clearer view, he deliberately lowers his sunglasses, allowing his eyes to focus intently on each photograph. His gaze lingers, processing the significance of what he's seeing. He then turns his attention to another bulletin board displaying mug shots, including one of Billie and a final, unstamped mug shot of himself. With a calculated motion, Dillinger lowers his shades once more, confronting his own stern gaze captured in the mug shot. He absorbs the gravity of the image before him for a moment, then smoothly rounds a nearby corner, where he spots a group of agents huddled around a radio. One member of the group glances over at him, but Dillinger, remaining unrecognized, casually continues on his way. He transitions into a cinema lobby, where a fair-haired agent stands, scanning the surroundings while speaking into a public phone. In another area, a different agent concludes his phone call and, after shaking his head thoughtfully, casts a glance across the street to assess his surroundings. In a parked car nearby, Madala, occupying the driver’s seat, turns his attention to Purvis, who sits tensely in the passenger seat, quietly observing. Inside the car, a small, round table displays an open shaving kit illuminated by the subtle light from a lamp, next to which lies a handgun. In a private moment, Dillinger stands facing a mirror, methodically dragging a razor down his lathered cheek. He completes his shave, then purposefully opens his pocket watch to check the time, pausing momentarily to gaze at Billie's photo inside. With quiet resolve, he snaps the watch shut, tucks it away, and ensures the gun is securely pocketed. Positioned near the Biograph theater, Purvis nervously rubs his thin-lipped mouth, glancing around as a few anonymous patrons gradually trickle into the theater through the box office. Feeling the weight of the situation, the agent looks elsewhere, shifting his gaze anxiously before exiting the car to pace down the sidewalk. He stops abruptly, turns around, and positions himself with his back to the cinema, observing discreetly as a man arrives accompanied by two blonde women, one notably wearing an eye-catching orange skirt. Purvis blinks, momentarily surprised, then carefully looks over his shoulder at the trio before tactfully redirecting his gaze. Inside the packed theater, the crime boss confidently escorts Anna to her seat, then gently leaves her to continue down the aisle with Polly, seeking out adjacent seats as the opening titles unfurl on the screen. Settling into the packed audience, Dillinger adjusts his spectacles and fixes his eyes intently on the screen, soaking in the atmosphere. Outside, Purvis rallies his agents, addressing them with a determined tone, giving Winstead a reassuring pat on the shoulder as he dispatches the team to fan out strategically. Within the movie house, the audience collectively watches the unfolding film, which depicts figures playing hockey, followed by a scene with Clark Gable washing his hands in a men's room. Dillinger, captivated, observes the scene with a smirk as Gable unexpectedly shoots another character who enters the room. Meanwhile, Anna, sitting alone, stirs nervously, glancing over her shoulder before resettling her focus on the screen, her chest rising and falling with apprehension. Outside, agents strategically position themselves while Winstead and Hurt discreetly retreat into the shadows of a nearby storefront's recessed entryway. Back inside, Dillinger maintains his concentration on the screen, his brow furrowed as Myrna Loy's character appears, her mouth agape in shock. Dillinger regards her with a focused intensity, his brow knitted and jaw clenched, as the alluring actress in a fur-collared coat appears onscreen, her expression contemplative. As the movie progresses, she shifts her solemn gaze and eventually turns away from a doorway while clothed in black."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Dillinger examines black and white photos, including images of himself, Little Bohemia Lodge, a wrecked Ford, and confiscated Tommy guns, by a bulletin board. As he moves to another board displaying mug shots of Billie and an unstamped mug shot of himself, he lowers his sunglasses and meets his own stern gaze. Not recognized by a group of agents gathered around a radio, he continues on his way. In a cinema lobby, a fair-haired agent scans the area while using a phone. Nearby, another agent ends a call, shaking his head as he looks across the street. In a parked car, Madala notes Purvis, who sits beside him, while inside, Dillinger, lit by a lamp, finishes shaving and checks Billie's photo in his pocket watch before securing his gun. Meanwhile, Purvis, parked near the Biograph, nervously rubs his mouth. Observing patrons enter the theater, he exits the car, paces, and casually turns to see a man with two women arriving, noting the one in an orange skirt. Inside the theater, Dillinger leaves Anna at her seat and finds another with Polly as the film begins. In the audience, Dillinger watches intently, smirking at Clark Gable on screen, while Anna nervously glances over her shoulder. Outside, Purvis coordinates with his agents, and Winstead and Hurt take position in a storefront’s entryway. As the film continues, Dillinger remains focused, reacting to the scenes and actors, including Myrna Loy and an exotic actress, both displaying deep emotions."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Farther along the bulletin board in the FBI office, Dillinger, the infamous bank robber of the early 1930s, finds black and white photos of himself. Others show more buildings, including photos of the Little Bohemia Lodge, a rural Wisconsin retreat where a famous gunfight took place involving Dillinger, the wrecked Ford used in their escape, and a pair of confiscated Tommy guns, iconic for their use by both law enforcement and criminals during Prohibition, which he views after lowering his sunglasses to inspect them more closely. He crosses to a bulletin board showing mug shots of Billie, his love interest, and the last mug shot of Dillinger himself remains unstamped, indicating he is still at large. Dillinger lowers his shades and meets his mug shot's stern gaze, reminded of his notoriety. As he rounds a corner, he spies a group of agents gathered intently around the radio, likely receiving updates about his movements, but one man glances over, and unrecognized, Dillinger, employing his signature cool demeanor, moves on. In a cinema lobby, a fair-haired agent scans the surroundings while using a public phone, likely coordinating their stakeout, while elsewhere, another agent ends a call and shakes his head in frustration, looking across the street. At the wheel of a parked car, Madala looks to Purvis, the leading FBI agent on the Dillinger case, who is seated shotgun. A shaving kit lies open on a small, round table illuminated by a lamp's modest light, with a handgun beside it, suggesting readiness for anything. Facing a mirror in his safe house, Dillinger drags a razor down his lathered cheek, finishes shaving, and opens his pocket watch to eye Billie's photo, a token of affection, and the time, aware of his limited freedom. He shuts the watch, puts it away, and pockets the gun, always prepared. Parked near the Biograph Theater, Purvis tensely rubs his thin-lipped mouth as a few anonymous patrons mill into the theater at the box office, the scene of Dillinger's anticipated capture. The agent looks away, shifting his anxious gaze, then gets out of the car and paces down the sidewalk, building tension for the impending operation. He stops, turns, and puts his back to the cinema as a man arrives with two blonde women, one in a conspicuous orange skirt, which would later help identify the group. Purvis blinks, looks over his shoulder, and spotting the trio, he looks away to maintain his cover. Entering the packed house, the crime boss leaves Anna at her seat, a decoy to mislead attention, then proceeds down the aisle with Polly to find adjacent seats as opening titles appear on the screen. In the packed audience, Dillinger stares intently at the screen through his spectacles, blending in with the crowd. Outside, Purvis addresses his agents, pats Winstead's shoulder, known for his sharpshooting skills, and the team splits up to cover all exits. In the movie house, the crowd watches figures on screen playing hockey, followed by Clark Gable washing his hands in a men's room, a scene from the film \"Manhattan Melodrama.\" Another character walks in, and Dillinger gazes at the screen with a boyish smirk as Gable shoots the man, perhaps amused by the on-screen crime. Sitting on her own, Anna, aware of the danger surrounding them, turns, peeking nervously over her shoulder, then faces the screen again, her chest heaving in fear. Outside, agents take their positions as Winstead and Hurt duck into a storefront's recessed entryway, ready to spring into action. In the movie house, Dillinger watches the screen with a furrowed brow while leading lady Myrna Loy stares with her mouth agape, capturing the drama. Dillinger gazes at her with a knitted brow and clenched jaw as the exotically pretty actress in a fur-collared coat wears a pensive expression, mirroring his own tension. Later, she shifts her sober gaze and, later still, turns away from a door clad in black, a metaphor for the dark fate awaiting him."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Farther along the bulletin board Dillinger finds black and white photos of himself. Others show more buildings including photos of the Little Bohemia Lodge the wrecked Ford and a pair of confiscated Tommy guns which he views after lowering his sunglasses. He crosses to a bulletin board showing mug shots of Billie and the last mug shot of Dillinger himself remains unstamped. Dillinger lowers his shades and meets his mug shot's stern gaze. As he rounds a corner he spies a group of agents around the radio but one man glances over and unrecognized Dillinger moves on. In a cinema lobby a fairhaired agent scans the surroundings while using a public phone while elsewhere another agent ends a call and shakes his head looking across the street. At the wheel of a parked car Madala looks to Purvis who is seated shotgun. A shaving kit lies open on a small round table illuminated by a lamp's modest light with a handgun beside it. Facing a mirror Dillinger drags a razor down his lathered cheek finishes shaving and opens his pocket watch to eye Billie's photo and the time. He shuts the watch puts it away and pockets the gun. Parked near the Biograph Purvis tensely rubs his thinlipped mouth as a few anonymous patrons mill into the theater at the box office. The agent looks away shifting his anxious gaze then gets out of the car and paces down the sidewalk. He stops turns and puts his back to the cinema as a man arrives with two blonde women one in a conspicuous orange skirt. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Purvis blinks looks over his shoulder and spotting the trio he looks away. Entering the packed house the crime boss leaves Anna at her seat then proceeds down the aisle with Polly to find adjacent seats as opening titles appear on the screen. In the packed audience Dillinger stares intently at the screen through his spectacles. Outside Purvis addresses his agents pats Winstead's shoulder and the team splits up. In the movie house the crowd watches figures on screen playing hockey followed by Clark Gable washing his hands in a men's room. Another character walks in and Dillinger gazes at the screen with a boyish smirk. as Gable shoots the man. Sitting on her own Anna turns peeking nervously over her shoulder then faces the screen again her chest heaving. Outside agents take their positions as Winstead and Hurt duck into a storefront's recessed entryway. In the movie house Dillinger watches the screen with a furrowed brow while leading lady. Myrna. Loy stares with her mouth agape. Dillinger gazes at her with a knitted brow and clenched jaw as the exotically pretty actress in a furcollared coat wears a pensive expression. Later she shifts her sober gaze and later still turns away from a door clad in black."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Farther along the bulletin board Dillinger finds black and white photos of himself. Others show more buildings including photos of the Little Bohemia Lodge the wrecked Ford and a pair of confiscated Tommy guns which he views after lowering his sunglasses. He crosses to a bulletin board showing mug shots of Billie and the last mug shot of Dillinger himself remains unstamped. Dillinger lowers his shades and meets his mug shot's stern gaze. As he rounds a corner he spies a group of agents around the radio but one man glances over and unrecognized Dillinger moves on. In a cinema lobby a fairhaired agent scans the surroundings while using a public phone while elsewhere another agent ends a call and shakes his head looking across the street. At the wheel of a parked car Madala looks to Purvis who is seated shotgun. A shaving kit lies open on a small round table illuminated by a lamp's modest light with a handgun beside it. Facing a mirror Dillinger drags a razor down his lathered cheek finishes shaving and opens his pocket watch to eye Billie's photo and the time. He shuts the watch puts it away and pockets the gun. Parked near the Biograph Purvis tensely rubs his thinlipped mouth as a few anonymous patrons mill into the theater at the box office. The agent looks away shifting his anxious gaze then gets out of the car and paces down the sidewalk. He stops turns and puts his back to the cinema as a man arrives with two blonde women one in a conspicuous orange skirt. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Purvis blinks looks over his shoulder and spotting the trio he looks away. Entering the packed house the crime boss leaves Anna at her seat then proceeds down the aisle with Polly to find adjacent seats as opening titles appear on the screen. In the packed audience Dillinger stares intently at the screen through his spectacles. Outside Purvis addresses his agents pats Winstead's shoulder and the team splits up. In the movie house the crowd watches figures on screen playing hockey followed by Clark Gable washing his hands in a men's room. Another character walks in and Dillinger gazes at the screen with a boyish smirk. as Gable shoots the man. Sitting on her own Anna turns peeking nervously over her shoulder then faces the screen again her chest heaving. Outside agents take their positions as Winstead and Hurt duck into a storefront's recessed entryway. In the movie house Dillinger watches the screen with a furrowed brow while leading lady. Myrna. Loy stares with her mouth agape. Dillinger gazes at her with a knitted brow and clenched jaw as the exotically pretty actress in a furcollared coat wears a pensive expression. Later she shifts her sober gaze and later still turns away from a door clad in black."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Farther along the bulletin board Dillinger finds black and white photos of himself. Others show more buildings including photos of the Little Bohemia Lodge the wrecked Ford and a pair of confiscated Tommy guns which he views after lowering his sunglasses. He crosses to a bulletin board showing mug shots of Billie and the last mug shot of Dillinger himself remains unstamped. Dillinger lowers his shades and meets his mug shot's stern gaze. As he rounds a corner he spies a group of agents around the radio but one man glances over and unrecognized Dillinger moves on. In a cinema lobby a fairhaired agent scans the surroundings while using a public phone while elsewhere another agent ends a call and shakes his head looking across the street. At the wheel of a parked car Madala looks to Purvis who is seated shotgun. Sitting on her own Anna turns peeking nervously over her shoulder then faces the screen again her chest heaving. Outside agents take their positions as Winstead and Hurt duck into a storefront's recessed entryway. In the movie house Dillinger watches the screen with a furrowed brow while leading lady. Myrna. Loy stares with her mouth agape. Dillinger gazes at her with a knitted brow and clenched jaw as the exotically pretty actress in a furcollared coat wears a pensive expression. Later she shifts her sober gaze and later still turns away from a door clad in black."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Farther along the bulletin board Dillinger finds black and white photos of himself. Others show more buildings including photos of the Little Bohemia Lodge the wrecked Ford and a pair of confiscated Tommy guns which he views after lowering his sunglasses. He crosses to a bulletin board showing mug shots of Billie and the last mug shot of Dillinger himself remains unstamped. Loy stares with her mouth agape. Dillinger gazes at her with a knitted brow and clenched jaw as the exotically pretty actress in a furcollared coat wears a pensive expression. Later she shifts her sober gaze and later still turns away from a door clad in black."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Further down the candy shelf, Arlington uncovers red and blue postcards of a stranger. Others display various animals, including images of the Tiny Penguin Lodge, the destroyed Chevy, and a collection of borrowed saxophones, which he examines after adjusting his binoculars. He skips over to a candy shelf displaying portraits of Gloria, and the final portrait of Arlington himself remains unsigned. Arlington adjusts his binoculars and confronts his portrait's harsh stare. As he rounds a bend, he observes a gathering of janitors around the television, but one gardener peeks over, and overlooked, Arlington wanders off. In a flower shop foyer, a dark-haired librarian inspects the area while using an office computer, while nearby, another librarian ends a chat and shakes his feet peering across the park. Behind the handlebars of a stationary bike, Santana glances at Marlowe, who is seated in the adjacent basket. A music box lies open on a large, oval desk illuminated by a candle's dim glow, with a violin beside it. Facing a painting, Arlington slides a comb through his tangled hair, finishes grooming, and opens his diary to view Gloria's postcard and the date. He closes the diary, sets it aside, and holsters the violin. Parked by the Art Gallery, Marlowe nervously scratches his curved-nosed chin as a couple of unseen performers shuffle into the concert hall at the entrance. The librarian averts his gaze, redirecting his worried stare, then exits the bike and strolls down the boulevard. He pauses, rotates, and leans against the flower shop as a woman arrives with two brunettes, one in a noticeable red dress. Marlowe winces, peeks over his elbow, and noticing the group, he turns away. Entering the crowded venue, the mastermind leaves Bella at her space, then advances down the corridor with Mona to locate adjacent spaces as introductory scenes flash on the display. In the crowded viewers, Arlington gazes intently at the display through his binoculars. Outdoors, Marlowe instructs his gardeners, taps Redford's arm, and the squad disperses. In the display room, the assembly observes characters on display playing baseball, followed by Cary Grant drying his face in a women's lounge. Another persona walks in, and Arlington squints at the display with a youthful grin as Grant slices the stranger. Sitting by herself, Bella turns, glancing timidly over her elbow, then faces the display again, her stomach tightening. Outdoors, gardeners take their places as Redford and Dash duck into a coffee shop's hidden doorway. In the display room, Arlington watches the display with a puzzled grin while leading man Claudette Colbert stares with her eyes wide. Arlington looks at her with a pensive grin and relaxed smile as the exotically handsome actor in a velvet-lined jacket wears a thoughtful look. Later, he adjusts his serious gaze and, later still, rotates away from a curtain draped in white."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Dillinger examines black and white photos of himself and confiscated Tommy guns on a bulletin board, lowering his sunglasses. He notices mug shots of Billie and himself, his gaze stern. Unrecognized, he observes agents around a radio and moves on. In a cinema lobby, agents scan their surroundings as Dillinger shaves, checks a photo of Billie in his pocket watch, and pockets a gun. Near the Biograph, Purvis watches patrons enter the theater. He spots a man with two blonde women, including one in a striking orange skirt, before entering the packed theater himself with Polly, leaving Anna at her seat. Dillinger watches the film intently as figures on screen play hockey and Clark Gable appears in a scene. Anna nervously looks over her shoulder while outside, agents position themselves. Inside, Dillinger watches Myrna Loy with a serious expression, taking in her pensive and later sober looks."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Later she shifts her sober gaze and later still turns away from a door clad in black Dillinger gazes at her with a knitted brow and clenched jaw as the exotically pretty actress in a furcollared coat wears a pensive expression Loy stares with her mouth agape Myrna In the movie house Dillinger watches the screen with a furrowed brow while leading lady Outside agents take their positions as Winstead and Hurt duck into a storefront's recessed entryway Sitting on her own Anna turns peeking nervously over her shoulder then faces the screen again her chest heaving as Gable shoots the man Another character walks in and Dillinger gazes at the screen with a boyish smirk In the movie house the crowd watches figures on screen playing hockey followed by Clark Gable washing his hands in a men's room Outside Purvis addresses his agents pats Winstead's shoulder and the team splits up In the packed audience Dillinger stares intently at the screen through his spectacles Entering the packed house the crime boss leaves Anna at her seat then proceeds down the aisle with Polly to find adjacent seats as opening titles appear on the screen Purvis blinks looks over his shoulder and spotting the trio he looks away He stops turns and puts his back to the cinema as a man arrives with two blonde women one in a conspicuous orange skirt The agent looks away shifting his anxious gaze then gets out of the car and paces down the sidewalk Parked near the Biograph Purvis tensely rubs his thinlipped mouth as a few anonymous patrons mill into the theater at the box office He shuts the watch puts it away and pockets the gun Facing a mirror Dillinger drags a razor down his lathered cheek finishes shaving and opens his pocket watch to eye Billie's photo and the time A shaving kit lies open on a small round table illuminated by a lamp's modest light with a handgun beside it At the wheel of a parked car Madala looks to Purvis who is seated shotgun In a cinema lobby a fairhaired agent scans the surroundings while using a public phone while elsewhere another agent ends a call and shakes his head looking across the street As he rounds a corner he spies a group of agents around the radio but one man glances over and unrecognized Dillinger moves on Dillinger lowers his shades and meets his mug shot's stern gaze He crosses to a bulletin board showing mug shots of Billie and the last mug shot of Dillinger himself remains unstamped Others show more buildings including photos of the Little Bohemia Lodge the wrecked Ford and a pair of confiscated Tommy guns which he views after lowering his sunglasses Farther along the bulletin board Dillinger finds black and white photos of himself"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Others show more buildings including photos of the Little Bohemia Lodge the wrecked Ford and a pair of confiscated Tommy guns which he views after lowering his sunglasses Farther along the bulletin board Dillinger finds black and white photos of himself Dillinger lowers his shades and meets his mug shot's stern gaze He crosses to a bulletin board showing mug shots of Billie and the last mug shot of Dillinger himself remains unstamped In a cinema lobby a fairhaired agent scans the surroundings while using a public phone while elsewhere another agent ends a call and shakes his head looking across the street As he rounds a corner he spies a group of agents around the radio but one man glances over and unrecognized Dillinger moves on A shaving kit lies open on a small round table illuminated by a lamp's modest light with a handgun beside it At the wheel of a parked car Madala looks to Purvis who is seated shotgun He shuts the watch puts it away and pockets the gun Facing a mirror Dillinger drags a razor down his lathered cheek finishes shaving and opens his pocket watch to eye Billie's photo and the time The agent looks away shifting his anxious gaze then gets out of the car and paces down the sidewalk Parked near the Biograph Purvis tensely rubs his thinlipped mouth as a few anonymous patrons mill into the theater at the box office Purvis blinks looks over his shoulder and spotting the trio he looks away He stops turns and puts his back to the cinema as a man arrives with two blonde women one in a conspicuous orange skirt In the packed audience Dillinger stares intently at the screen through his spectacles Entering the packed house the crime boss leaves Anna at her seat then proceeds down the aisle with Polly to find adjacent seats as opening titles appear on the screen In the movie house the crowd watches figures on screen playing hockey followed by Clark Gable washing his hands in a men's room Outside Purvis addresses his agents pats Winstead's shoulder and the team splits up as Gable shoots the man Another character walks in and Dillinger gazes at the screen with a boyish smirk Outside agents take their positions as Winstead and Hurt duck into a storefront's recessed entryway Sitting on her own Anna turns peeking nervously over her shoulder then faces the screen again her chest heaving Myrna In the movie house Dillinger watches the screen with a furrowed brow while leading lady Dillinger gazes at her with a knitted brow and clenched jaw as the exotically pretty actress in a furcollared coat wears a pensive expression Loy stares with her mouth agape Later she shifts her sober gaze and later still turns away from a door clad in black"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Entering the packed house the crime boss leaves Anna at her seat then proceeds down the aisle with Polly to find adjacent seats as opening titles appear on the screen In the packed audience Dillinger stares intently at the screen through his spectacles Outside Purvis addresses his agents pats Winstead's shoulder and the team splits up In the movie house the crowd watches figures on screen playing hockey followed by Clark Gable washing his hands in a men's room Another character walks in and Dillinger gazes at the screen with a boyish smirk as Gable shoots the man Sitting on her own Anna turns peeking nervously over her shoulder then faces the screen again her chest heaving Outside agents take their positions as Winstead and Hurt duck into a storefront's recessed entryway In the movie house Dillinger watches the screen with a furrowed brow while leading lady Myrna Loy stares with her mouth agape Dillinger gazes at her with a knitted brow and clenched jaw as the exotically pretty actress in a furcollared coat wears a pensive expression Later she shifts her sober gaze and later still turns away from a door clad in black Farther along the bulletin board Dillinger finds black and white photos of himself Others show more buildings including photos of the Little Bohemia Lodge the wrecked Ford and a pair of confiscated Tommy guns which he views after lowering his sunglasses He crosses to a bulletin board showing mug shots of Billie and the last mug shot of Dillinger himself remains unstamped Dillinger lowers his shades and meets his mug shot's stern gaze As he rounds a corner he spies a group of agents around the radio but one man glances over and unrecognized Dillinger moves on In a cinema lobby a fairhaired agent scans the surroundings while using a public phone while elsewhere another agent ends a call and shakes his head looking across the street At the wheel of a parked car Madala looks to Purvis who is seated shotgun A shaving kit lies open on a small round table illuminated by a lamp's modest light with a handgun beside it Facing a mirror Dillinger drags a razor down his lathered cheek finishes shaving and opens his pocket watch to eye Billie's photo and the time He shuts the watch puts it away and pockets the gun Parked near the Biograph Purvis tensely rubs his thinlipped mouth as a few anonymous patrons mill into the theater at the box office The agent looks away shifting his anxious gaze then gets out of the car and paces down the sidewalk He stops turns and puts his back to the cinema as a man arrives with two blonde women one in a conspicuous orange skirt Purvis blinks looks over his shoulder and spotting the trio he looks away"
        }
      ]
    }
  ]
}