{
  "ground_truth": "The scene begins with a focus on their regular breathing and snoring, followed by the woman stirring and reaching for the phone, which she then hangs up. The man stirs, clears his throat with a long deep rumble, sits up, gazes around, and clears his throat again. There are remains of a large breakfast plate. A wider view shows Marge in a beige police uniform with a heavy belt carrying a revolver, walkie-talkie, and other police items, while Norm is in a dressing gown. Marge struggles into a parka and makes her way down the icy stoop to her prowler, hearing the front door open off-screen. She stamps the snow off her shoes and approaches the scene from her squad car, where two police cars and an ambulance idle by the road with men inside. A figure in a parka emerges from the first car with two styrofoam cups, handing her one. Marge looks around as they walk, peers into a car, looks up from it, around at the road, and at the prowler parked nearby. She gets up, sweeping snow from her knees, calls up to the road, and then is on her hands and knees by a body in the ditch, examining footprints. The foreground shows a state trooper's head as Marge, still on her hands and knees, peers at it. She claps snow off her hands, climbs out of the ditch, and looks at the idling prowler. Marge drives while Lou sits next to her, gazing out the window. Meanwhile, Jerry and Stan, wearing parkas and galoshes, stand near beached vehicles as Wade waits in an idling Lincoln and taps the horn for Stan, who then gets in. Jerry stares at his laptop. Elsewhere, a lakeside cabin is surrounded by white as a brown Ciera with dealer plates pulls into the drive. Grimsrud and Carl exit the car, with Grimsrud helping Jean out from the back; her hands are tied and a black hood covers her head. Jean cries out, escapes Grimsrud's grasp, and lurches across the lawn as Carl, grinning, stops Grimsrud from retrieving her.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The tableau initiates with a concentration on their habitual respiration and snoring, succeeded by the woman rousing and reaching for the telephone, which she then hangs up. The man rouses, clears his throat with a long deep rumble, sits up, gazes around, and clears his throat again. There are remains of a large breakfast platter. A broader perspective shows Marge in a beige constabulary uniform with a heavy belt bearing a revolver, walkie-talkie, and other constabulary items, while Norm is in a dressing gown. Marge struggles into a parka and makes her way down the icy stoop to her prowler, hearing the front door ajar off-screen. She stamps the snow off her shoes and approaches the tableau from her squad car, where two constabulary cars and an ambulance idle by the road with men inside. A figure in a parka emerges from the first car with two styrofoam cups, handing her one. Marge glances around as they stroll, peers into a car, looks up from it, around at the road, and at the prowler stationed nearby. She gets up, sweeping snow from her knees, calls up to the road, and then is on her hands and knees by a body in the ditch, examining footprints. The foreground shows a state trooper's head as Marge, still on her hands and knees, peers at it. She claps snow off her hands, climbs out of the ditch, and looks at the idling prowler. Marge drives while Lou sits adjacent to her, gazing out the window. Meanwhile, Jerry and Stan, wearing parkas and galoshes, stand near beached vehicles as Wade waits in an idling Lincoln and taps the horn for Stan, who then gets in. Jerry stares at his laptop. Elsewhere, a lakeside cabin is surrounded by white as a brown Ciera with dealer plates pulls into the drive. Grimsrud and Carl exit the car, with Grimsrud assisting Jean out from the back; her hands are tied and a black hood covers her head. Jean cries out, escapes Grimsrud's grip, and lurches across the lawn as Carl, grinning, prevents Grimsrud from retrieving her."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The scene is begun with a focus on their regular breathing and snoring, followed by the phone being reached for by the woman, which is then hung up by her. The man is stirred, clears his throat with a long deep rumble, sits up, gazes around, and clears his throat again. A large breakfast plate has been left in remains. A wider view shows Marge in a beige police uniform with a heavy belt carrying a revolver, walkie-talkie, and other police items, while Norm wears a dressing gown. A parka is struggled into by Marge and her way is made down the icy stoop to her prowler after she hears the front door open off-screen. She stamps the snow off her shoes and the scene is approached by her from her squad car, where two police cars and an ambulance are idling by the road with men inside. A figure in a parka emerges from the first car with two styrofoam cups and hands her one. Marge looks around as they walk, peers into a car, looks up from it, around at the road, and at the prowler parked nearby. She gets up, sweeping snow from her knees, calls up to the road, and then examines footprints while being on her hands and knees by a body in the ditch. The foreground shows a state trooper's head as Marge, still on her hands and knees, peers at it. Snow is clapped off her hands by her, she climbs out of the ditch, and the idling prowler is looked at by her. Lou sits next to Marge, who drives while he gazes out the window. Meanwhile, Jerry and Stan, wearing parkas and galoshes, stand near beached vehicles as Wade waits in an idling Lincoln and taps the horn for Stan, who then gets in. Jerry stares at his laptop. Elsewhere, the white-surrounded lakeside cabin is approached by a brown Ciera with dealer plates that pulls into the drive. Grimsrud and Carl exit the car, with Jean being helped out from the back by Grimsrud; her hands are tied and a black hood covers her head. Jean cries out, escapes Grimsrud's grasp, and is lurched across the lawn by her as Carl, grinning, stops Grimsrud from retrieving her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The scene opens with the sound of breathing and snoring. The woman stirs, reaches for the phone, and hangs up. The man wakes, clears his throat, sits, and looks around. A large breakfast plate is visible. Marge, in a beige police uniform, with a revolver, walkie-talkie, and other items, struggles into a parka and heads down the icy stoop to her prowler, hearing a door open. She stamps snow off her shoes and approaches a scene with two police cars and an ambulance idling. A figure with two styrofoam cups emerges, giving her one. Marge looks around, peers into a car, and examines footprints by a body in a ditch. A state trooper's head is seen as Marge, clearing snow from her hands, climbs out of the ditch. Marge drives with Lou beside her, gazing out. Jerry and Stan, in parkas and galoshes, are near beached vehicles; Wade waits in a Lincoln and honks for Stan, who joins him. Jerry stares at his laptop. At a lakeside cabin, a brown Ciera with dealer plates arrives. Grimsrud and Carl get out, and Grimsrud helps Jean, whose hands are tied and head hooded, out of the back. Jean cries, escapes, and stumbles, while Carl grins and prevents Grimsrud from catching her."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The scene starts with their breathing and snoring. The woman reaches for the phone, hangs up, and the man sits up, clearing his throat. Remnants of breakfast remain. Marge, in a beige police uniform with a revolver and walkie-talkie, dons a parka and heads to her prowler. She spots police cars and an ambulance. A person in a parka gives Marge a cup as they walk. She kneels by a body in a ditch examining footprints, claps snow off her hands, and eyes the prowler. Marge drives with Lou beside her. Jerry and Stan in parkas stand by vehicles, Wade waits in a Lincoln, and Jerry stares at his laptop. At a lakeside cabin, Grimsrud and Carl arrive in a brown Ciera. Grimsrud helps Jean, hooded and hands tied, out. Jean escapes, and Carl stops Grimsrud from pursuing her."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The scene begins with a concentrated focus on their steady, rhythmic breathing and occasional, gentle snoring. This is soon followed by the woman, who suddenly stirs from her slumber and instinctively reaches out for the phone, only to hang it up immediately after. Meanwhile, the man next to her begins to stir as well, clearing his throat with a long, deep rumble that echoes softly in the room. He then sits up, taking a moment to gaze around at his surroundings before he clears his throat once more, as if preparing himself for the day ahead. Nearby, there are remnants of what appears to have been a large and satisfying breakfast plate. The camera pulls back to reveal a wider view of the room showing Marge, dressed in an official-looking beige police uniform complete with a heavy belt that carries essentials like a revolver, walkie-talkie, and various other police items. Meanwhile, Norm can be seen clad in a cozy-looking dressing gown. Marge struggles slightly as she pulls on a parka, then makes her way cautiously down the icy stoop towards her prowler. In the background, the sound of the front door opening off-screen can be faintly heard. She diligently stamps the snow off her shoes before approaching the scene from her parked squad car. Here, two police cars and an ambulance are idling by the road, with several men inside. Emerging from the first car is a figure dressed in a warm parka, carrying two steaming styrofoam cups, one of which is handed to Marge. As they walk together, Marge glances around, examining the area closely. She peers into a nearby car, then looks up from it, glancing around at the road and the prowler parked nearby. Rising to her feet, she brushes the snow from her knees before calling out towards the road. Then, she finds herself on her hands and knees beside a body lying in a ditch, carefully examining the footprints in the snow. In the foreground, the head of a state trooper is visible as Marge, still on hands and knees, peers intently at it. She claps her hands to remove the clinging snow, climbs out of the ditch, and looks pensively at the idling prowler. As Marge drives, Lou sits next to her, quietly gazing out the window, lost in thought. Elsewhere, Jerry and Stan, both bundled up in thick parkas and protective galoshes, stand near some beached vehicles. Wade waits impatiently in an idling Lincoln, tapping the horn to signal Stan, who then promptly gets in. Jerry, meanwhile, focuses intently on his laptop. In a different location, a lakeside cabin is enveloped in a blanket of white, as a brown Ciera with dealer plates pulls into the drive. Grimsrud and Carl exit the car, with Grimsrud assisting Jean out of the back seat; her hands are bound, and a black hood obscures her head. Distressed, Jean cries out and manages to escape Grimsrud’s grasp, stumbling awkwardly across the snow-covered lawn. Carl, with a grin, prevents Grimsrud from retrieving her, creating a tense and suspenseful moment."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The scene begins with a concentrated and deliberate focus on the synchronized and steady rhythm of their breathing, interspersed with occasional gentle snores that break the calm. Shortly thereafter, the tranquility is disrupted as the woman suddenly stirs from her deep slumber, instinctively reaching out with purpose for the phone located nearby, only to hang it up without hesitation immediately after grasping it. During this moment, the man who lies next to her starts to awaken as well, clearing his throat with a long, deep rumble that resonates softly throughout the room, echoing gently off the walls. He then sits up slowly, taking a brief but meaningful moment to gaze around thoughtfully at his familiar surroundings before proceeding to clear his throat once more, as though mentally preparing himself for the day that lies ahead. Nearby, the remnants of what seems to have been an ample and satisfying breakfast plate are visible. The camera gradually pulls back to offer a wider perspective of the room, where Marge is revealed, dressed in an official-looking beige police uniform complete with a heavy-duty belt that carries necessary items like a revolver, a walkie-talkie, and various other essential police equipment. Meanwhile, Norm, in contrast, can be observed clad in a cozy and comfortable-looking dressing gown. Marge struggles slightly as she endeavors to pull on a bulky parka, then cautiously makes her way down the icy stoop toward her prowler. In the background, the subtle sound of the front door opening off-screen can be faintly heard. Diligently stamping the lingering snow from her shoes, she approaches the scene from her parked squad car. Here, two police cars and an ambulance sit idling by the roadside, with several men seated inside. Emerging from the first car is a figure well-insulated in a warm parka, carrying two steaming styrofoam cups, one of which is handed over to Marge. As they walk together, Marge attentively glances around, examining her surroundings closely. She peers into a nearby car, then lifts her gaze from it, scanning the road and her nearby parked prowler. Rising to her feet, she brushes the clinging snow from her knees before calling out towards the road. Subsequently, she finds herself down on her hands and knees beside a body that lies in a ditch, carefully scrutinizing the footprints in the snow. In the foreground, the head of a state trooper is visible as Marge, still positioned on hands and knees, peers intently at it. She claps her hands together to dislodge the clinging snow, climbs out of the ditch, and looks pensively at the idling prowler. As Marge drives, Lou sits quietly next to her, gazing out the window, lost in his thoughts. Elsewhere, Jerry and Stan, both bundled up in thick parkas and sturdy protective galoshes, stand near several beached vehicles. Wade waits with growing impatience in an idling Lincoln, tapping the horn as a signal for Stan, who then promptly climbs in. Meanwhile, Jerry is intently focused on his laptop. In another location, a quaint lakeside cabin stands enveloped in a thick blanket of white, as a brown Ciera with dealer plates pulls into the driveway. Grimsrud and Carl exit the vehicle, with Grimsrud aiding Jean out of the back seat; her hands are securely bound, and a black hood obscures her head completely. Distressed and anxious, Jean cries out and manages to break free from Grimsrud’s grasp, stumbling awkwardly across the snow-covered lawn. Carl, wearing a grin, prevents Grimsrud from retrieving her, creating a tense and suspenseful moment that hangs in the frosty air."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The scene opens with a close-up focus on the rhythmic rise and fall of their chests as they breathe regularly, with a soft sound of snoring filling the room. The woman begins to stir slightly, her eyelids fluttering open as she reaches out, her fingers fumbling slightly to grasp the phone. With a swift motion, she hangs it up, signaling the end of the call. Meanwhile, the man begins to stir; his body shifts as he lets out a long, deep, rumbling sound to clear his throat. Slowly, he pushes himself up into a sitting position, his eyes surveying the room as he clears his throat once more. The remains of a large breakfast plate linger nearby. The camera pulls back to reveal more of the scene, showcasing Marge in her beige police uniform, which is weighed down by a heavy belt equipped with a revolver, a walkie-talkie, and various other police items. Norm is seen clad in a dressing gown. Marge struggles to shrug on a parka, managing to fit it over her uniform before she carefully navigates her way down the icy stoop towards her prowler, while the faint sound of the front door opening can be heard off-screen. She vigorously stamps the stubborn snow from her shoes and approaches the scene from her squad car. Here, several vehicles are gathered; two police cars and an ambulance idle by the roadside with men seated inside. From the first car, a figure emerges dressed in a parka, holding two steaming styrofoam cups, one of which he hands over to Marge. Together, they walk towards the scene as Marge looks around attentively, peering inside a car before lifting her gaze, scanning the road, and noting the prowler parked nearby. She then rises to her feet, brushing snow off her knees, and calls out up to the road. Moments later, she is on her hands and knees beside a body in the ditch, meticulously examining the footprints left in the snow. The focused perspective showcases the head of a state trooper in the foreground, while Marge remains crouched, keenly inspecting. She methodically claps her hands together, dislodging the clinging snow, and climbs out of the ditch, casting her gaze towards the idling prowler once more. Marge is seen driving, her focus unwavering, while Lou sits beside her, his eyes fixated on the passing scenery outside the window. In a different setting, Jerry and Stan, both wrapped in parkas and galoshes, stand near several beached vehicles. Wade waits nearby in an idling Lincoln, impatiently tapping the horn to signal Stan, who promptly gets into the car. Jerry is absorbed in his work, staring intently at his laptop. Elsewhere, a lakeside cabin is enveloped in a blanket of white as a brown Ciera, sporting dealer plates, pulls into the driveway. Grimsrud and Carl exit the vehicle, with Grimsrud assisting Jean out from the backseat; her hands are tightly bound, and a black hood conceals her head. Jean lets out a sharp cry, unexpectedly breaks free from Grimsrud's grasp, and lurches desperately across the lawn. Carl, watching the scene unfold with a grin, prevents Grimsrud from giving chase."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The scene opens with the couple in bed, their peaceful breathing occasionally interrupted by a snore; the woman stirs, reaches for the phone to hang it up, while the man wakes, clears his throat, and surveys the room. Breakfast remnants clutter a plate nearby. The view expands to reveal Marge dressed in her police uniform, complete with a utility belt, and Norm in a dressing gown. Marge dons a parka, navigates the icy stoop to her squad car, stamping snow from her shoes. At the scene, she finds police cars and an ambulance, meeting a colleague who hands her a styrofoam cup. Marge surveys the area, examines a car, then investigates a body in a ditch, studying the footprints with a fellow officer. After clapping snow from her hands, she leaves the ditch and assesses the parked vehicles. Marge then drives with Lou beside her, who gazes out the window. Meanwhile, Jerry and Stan, bundled for the cold, stand by stranded vehicles. Wade, waiting in an idling Lincoln, honks for Stan, who joins him as Jerry focuses on his laptop. At a secluded lakeside cabin, a brown Ciera arrives. Grimsrud and Carl emerge, helping Jean, who is hooded and bound, from the backseat. Jean cries out, attempts to escape across the lawn, but Carl, amused, prevents Grimsrud from recapturing her."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The scene begins with a focus on their regular breathing and snoring, a common sign of deep sleep, followed by the woman stirring and reaching for the phone, which she then hangs up, possibly a routine call that she decided not to complete. The man stirs, clears his throat with a long deep rumble reminiscent of morning routines, sits up, gazes around to orient himself, and clears his throat again, preparing to speak. There are remains of a large breakfast plate, suggesting a hearty meal typical of those needed in cold climates. A wider view shows Marge in a beige police uniform, the standard attire for officers in this region, with a heavy belt carrying a revolver for security, a walkie-talkie for communication, and other police items necessary for her duties, while Norm is in a dressing gown, a typical attire for home comfort. Marge struggles into a parka, a critical piece of clothing in the chilly climate of Minnesota, and makes her way down the icy stoop to her prowler, a common term for a police car in this area, hearing the front door open off-screen, indicating Norm's supportive presence. She stamps the snow off her shoes, a necessary action in the snowy landscape, and approaches the scene from her squad car, where two police cars and an ambulance idle by the road with men inside, ready to assist as needed. A figure in a parka, likely a fellow officer accustomed to the harsh weather, emerges from the first car with two styrofoam cups, handing her one, offering warmth in the cold morning. Marge looks around as they walk, peers into a car, looks up from it, around at the road, and at the prowler parked nearby, assessing the scene with a practiced eye. She gets up, sweeping snow from her knees, calls up to the road, and then is on her hands and knees by a body in the ditch, examining footprints, a crucial step in reconstructing the events that transpired. The foreground shows a state trooper's head as Marge, still on her hands and knees, peers at it, piecing together the evidence. She claps snow off her hands, climbs out of the ditch, and looks at the idling prowler, contemplating her next steps. Marge drives while Lou, her trustworthy partner in these investigations, sits next to her, gazing out the window, possibly lost in thought about the case. Meanwhile, Jerry and Stan, wearing parkas and galoshes to protect against the elements, stand near beached vehicles on the icy roads as Wade waits in an idling Lincoln, a car brand known for luxury, and taps the horn for Stan, who then gets in, indicating their impatience. Jerry stares at his laptop, potentially reviewing important documents. Elsewhere, a lakeside cabin, often used as a getaway in these parts but now part of a critical plot, is surrounded by white snow as a brown Ciera with dealer plates pulls into the drive, indicating it’s a newly acquired or borrowed vehicle. Grimsrud and Carl exit the car, with Grimsrud helping Jean out from the back; her hands are tied and a black hood covers her head, an indication of her dire predicament. Jean cries out, escapes Grimsrud's grasp, and lurches across the lawn, her desperation evident, as Carl, grinning, stops Grimsrud from retrieving her, showing a cruel enjoyment in the situation."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The scene begins with a focus on their regular breathing and snoring followed by the woman stirring and reaching for the phone which she then hangs up. The man stirs clears his throat with a long deep rumble sits up gazes around and clears his throat again. There are remains of a large breakfast plate. A wider view shows Marge in a beige police uniform with a heavy belt carrying a revolver walkietalkie and other police items while Norm is in a dressing gown. Marge struggles into a parka and makes her way down the icy stoop to her prowler hearing the front door open offscreen. She stamps the snow off her shoes and approaches the scene from her squad car where two police cars and an ambulance idle by the road with men inside. A figure in a parka emerges from the first car with two styrofoam cups handing her one. Marge looks around as they walk peers into a car looks up from it around at the road and at the prowler parked nearby. She gets up sweeping snow from her knees calls up to the road and then is on her hands and knees by a body in the ditch examining footprints. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. The foreground shows a state trooper's head as Marge still on her hands and knees peers at it. She claps snow off her hands climbs out of the ditch and looks at the idling prowler. Marge drives while Lou sits next to her gazing out the window. Meanwhile Jerry and Stan wearing parkas and galoshes stand near beached vehicles as Wade waits in an idling Lincoln and taps the horn for Stan who then gets in. Jerry stares at his laptop. Elsewhere a lakeside cabin is surrounded by white as a brown Ciera with dealer plates pulls into the drive. Grimsrud and Carl exit the car with Grimsrud helping Jean out from the back. her hands are tied and a black hood covers her head. Jean cries out escapes Grimsrud's grasp and lurches across the lawn as Carl grinning stops Grimsrud from retrieving her."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The scene begins with a focus on their regular breathing and snoring followed by the woman stirring and reaching for the phone which she then hangs up. The man stirs clears his throat with a long deep rumble sits up gazes around and clears his throat again. There are remains of a large breakfast plate. A wider view shows Marge in a beige police uniform with a heavy belt carrying a revolver walkietalkie and other police items while Norm is in a dressing gown. Marge struggles into a parka and makes her way down the icy stoop to her prowler hearing the front door open offscreen. She stamps the snow off her shoes and approaches the scene from her squad car where two police cars and an ambulance idle by the road with men inside. A figure in a parka emerges from the first car with two styrofoam cups handing her one. Marge looks around as they walk peers into a car looks up from it around at the road and at the prowler parked nearby. She gets up sweeping snow from her knees calls up to the road and then is on her hands and knees by a body in the ditch examining footprints. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. The foreground shows a state trooper's head as Marge still on her hands and knees peers at it. She claps snow off her hands climbs out of the ditch and looks at the idling prowler. Marge drives while Lou sits next to her gazing out the window. Meanwhile Jerry and Stan wearing parkas and galoshes stand near beached vehicles as Wade waits in an idling Lincoln and taps the horn for Stan who then gets in. Jerry stares at his laptop. Elsewhere a lakeside cabin is surrounded by white as a brown Ciera with dealer plates pulls into the drive. Grimsrud and Carl exit the car with Grimsrud helping Jean out from the back. her hands are tied and a black hood covers her head. Jean cries out escapes Grimsrud's grasp and lurches across the lawn as Carl grinning stops Grimsrud from retrieving her."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The scene begins with a focus on their regular breathing and snoring followed by the woman stirring and reaching for the phone which she then hangs up. The man stirs clears his throat with a long deep rumble sits up gazes around and clears his throat again. There are remains of a large breakfast plate. A wider view shows Marge in a beige police uniform with a heavy belt carrying a revolver walkietalkie and other police items while Norm is in a dressing gown. Marge struggles into a parka and makes her way down the icy stoop to her prowler hearing the front door open offscreen. Elsewhere a lakeside cabin is surrounded by white as a brown Ciera with dealer plates pulls into the drive. Grimsrud and Carl exit the car with Grimsrud helping Jean out from the back. her hands are tied and a black hood covers her head. Jean cries out escapes Grimsrud's grasp and lurches across the lawn as Carl grinning stops Grimsrud from retrieving her."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The scene begins with a focus on their regular breathing and snoring followed by the woman stirring and reaching for the phone which she then hangs up. The man stirs clears his throat with a long deep rumble sits up gazes around and clears his throat again. her hands are tied and a black hood covers her head. Jean cries out escapes Grimsrud's grasp and lurches across the lawn as Carl grinning stops Grimsrud from retrieving her."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The scene commences with an emphasis on their consistent wheezing and sneezing, followed by the child hopping and grabbing for the remote, which they then toss aside. The cat hops, scratches its paws with a swift soft hum, crouches down, surveys the vicinity, and scratches its paws once more. There are remnants of a giant pizza box. A broader shot displays Sylvia in a blue firefighter uniform with a bulky harness carrying a flashlight, walkie-talkie, and other firefighter tools, while Max is in a tuxedo. Sylvia wrestles into a raincoat and heads down the muddy slope to her tricycle, hearing the back gate creak off-stage. She wipes the mud off her boots and advances towards the area from her delivery van, where three fire trucks and a helicopter hover above the field with kids inside. A creature in a raincoat appears from the second truck with five paper bags, offering her one. Sylvia scans the surroundings as they stroll, glances into a truck, looks down from it, around at the field, and at the tricycle parked nearby. She rises, brushing dirt from her elbows, calls down to the field, and then finds herself on her belly by a log in the meadow, inspecting tire tracks. The background shows a park ranger's foot as Sylvia, still on her belly, examines it. She shakes dirt off her elbows, climbs out of the meadow, and gazes at the hovering tricycle. Sylvia pedals while Gus sits beside her, staring at the sky. Meanwhile, Pat and Kim, wearing raincoats and flip-flops, stand near stranded bicycles as Lane waits in a silent Tesla and honks the bell for Kim, who then hops in. Pat gazes at his tablet. Elsewhere, a mountain cabin is encompassed by green as a red Subaru with rental plates pulls into the lot. Lenny and Alex exit the vehicle, with Lenny assisting Jamie out from the rear; her feet are shackled, and a red mask covers her face. Jamie yells out, escapes Lenny's hold, and stumbles across the garden as Alex, laughing, prevents Lenny from catching her."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The scene opens with a focus on regular breathing and snoring; the woman reaches for the phone, then hangs up. The man stirs, clears his throat, and sits up. Remains of a large breakfast plate are visible. Marge, in a beige police uniform carrying a revolver and walkie-talkie, struggles into a parka, goes down the icy stoop, reaches her squad car, and approaches a scene with two police cars and an ambulance. A figure in a parka gives her a styrofoam cup. Marge examines a car, the road, and a body in a ditch, before dusting off snow and driving with Lou beside her. Jerry and Stan, in parkas and galoshes, stand near vehicles while Wade taps the horn in an idling Lincoln. A lakeside cabin is surrounded by snow as a brown Ciera arrives. Grimsrud helps Jean, whose hands are tied and head is hooded, out of the car. Jean cries out and escapes but is allowed to lurch across the lawn by Carl."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Jean cries out escapes Grimsrud's grasp and lurches across the lawn as Carl grinning stops Grimsrud from retrieving her her hands are tied and a black hood covers her head Grimsrud and Carl exit the car with Grimsrud helping Jean out from the back Elsewhere a lakeside cabin is surrounded by white as a brown Ciera with dealer plates pulls into the drive Jerry stares at his laptop Meanwhile Jerry and Stan wearing parkas and galoshes stand near beached vehicles as Wade waits in an idling Lincoln and taps the horn for Stan who then gets in Marge drives while Lou sits next to her gazing out the window She claps snow off her hands climbs out of the ditch and looks at the idling prowler The foreground shows a state trooper's head as Marge still on her hands and knees peers at it She gets up sweeping snow from her knees calls up to the road and then is on her hands and knees by a body in the ditch examining footprints Marge looks around as they walk peers into a car looks up from it around at the road and at the prowler parked nearby A figure in a parka emerges from the first car with two styrofoam cups handing her one She stamps the snow off her shoes and approaches the scene from her squad car where two police cars and an ambulance idle by the road with men inside Marge struggles into a parka and makes her way down the icy stoop to her prowler hearing the front door open offscreen A wider view shows Marge in a beige police uniform with a heavy belt carrying a revolver walkietalkie and other police items while Norm is in a dressing gown There are remains of a large breakfast plate The man stirs clears his throat with a long deep rumble sits up gazes around and clears his throat again The scene begins with a focus on their regular breathing and snoring followed by the woman stirring and reaching for the phone which she then hangs up"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The man stirs clears his throat with a long deep rumble sits up gazes around and clears his throat again The scene begins with a focus on their regular breathing and snoring followed by the woman stirring and reaching for the phone which she then hangs up A wider view shows Marge in a beige police uniform with a heavy belt carrying a revolver walkietalkie and other police items while Norm is in a dressing gown There are remains of a large breakfast plate She stamps the snow off her shoes and approaches the scene from her squad car where two police cars and an ambulance idle by the road with men inside Marge struggles into a parka and makes her way down the icy stoop to her prowler hearing the front door open offscreen Marge looks around as they walk peers into a car looks up from it around at the road and at the prowler parked nearby A figure in a parka emerges from the first car with two styrofoam cups handing her one The foreground shows a state trooper's head as Marge still on her hands and knees peers at it She gets up sweeping snow from her knees calls up to the road and then is on her hands and knees by a body in the ditch examining footprints Marge drives while Lou sits next to her gazing out the window She claps snow off her hands climbs out of the ditch and looks at the idling prowler Jerry stares at his laptop Meanwhile Jerry and Stan wearing parkas and galoshes stand near beached vehicles as Wade waits in an idling Lincoln and taps the horn for Stan who then gets in Grimsrud and Carl exit the car with Grimsrud helping Jean out from the back Elsewhere a lakeside cabin is surrounded by white as a brown Ciera with dealer plates pulls into the drive Jean cries out escapes Grimsrud's grasp and lurches across the lawn as Carl grinning stops Grimsrud from retrieving her her hands are tied and a black hood covers her head"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The foreground shows a state trooper's head as Marge still on her hands and knees peers at it She claps snow off her hands climbs out of the ditch and looks at the idling prowler Marge drives while Lou sits next to her gazing out the window Meanwhile Jerry and Stan wearing parkas and galoshes stand near beached vehicles as Wade waits in an idling Lincoln and taps the horn for Stan who then gets in Jerry stares at his laptop Elsewhere a lakeside cabin is surrounded by white as a brown Ciera with dealer plates pulls into the drive Grimsrud and Carl exit the car with Grimsrud helping Jean out from the back her hands are tied and a black hood covers her head Jean cries out escapes Grimsrud's grasp and lurches across the lawn as Carl grinning stops Grimsrud from retrieving her The scene begins with a focus on their regular breathing and snoring followed by the woman stirring and reaching for the phone which she then hangs up The man stirs clears his throat with a long deep rumble sits up gazes around and clears his throat again There are remains of a large breakfast plate A wider view shows Marge in a beige police uniform with a heavy belt carrying a revolver walkietalkie and other police items while Norm is in a dressing gown Marge struggles into a parka and makes her way down the icy stoop to her prowler hearing the front door open offscreen She stamps the snow off her shoes and approaches the scene from her squad car where two police cars and an ambulance idle by the road with men inside A figure in a parka emerges from the first car with two styrofoam cups handing her one Marge looks around as they walk peers into a car looks up from it around at the road and at the prowler parked nearby She gets up sweeping snow from her knees calls up to the road and then is on her hands and knees by a body in the ditch examining footprints"
        }
      ]
    }
  ]
}