{
  "ground_truth": "Gathering himself, he sniffs, flaring his nostrils, and stares forward with a steely gaze. Red peers out the smeared windshield with a solemn expression. Dillinger stands below an overcast sky. Strands of his greasy black hair hang over his forehead. His gaze drifts to a road, which cuts through a desolate field toward the flat horizon. In a farmhouse, gang members change clothes while eating. A woman wraps food in newspapers and brings it over to their table. Pete buttons up next to another escapee. Red puts out a cigarette. All of the men leave. Outside, Dillinger walks alone. Without his overcoat, he wears a black vest and a leather gun holster. The woman stops him. They hold eye contact and she lets go. As Dillinger turns and walks away from the farmhouse, the woman continues to gaze after him. A little boy in overalls comes up and takes her hand. Together, they wander a few steps without taking their eyes off of him. In the car, as Red drives, Dillinger looks back at Pete. He faces forward and glances at Red. A man in a blue suit hurries through lush green woods with a Tommy gun. He trips, then climbs to his feet and runs on. A clean-cut man wearing suspenders swiftly moves after him, toting a rifle. A group of armed lawmen follow behind, charging up a hill. The outlaw races downhill into an apple orchard. At the hill's crest, the clean-cut lawman stops and watches the outlaw run between two rows of trees. He aims his rifle. Floyd runs backwards, firing wildly. The lawman's shot misses. Floyd runs on. Calmly taking a knee, the lawman aims again, rubbing his finger on the trigger. Floyd sprints through the trees, almost out of his pursuer's sight. The lawman's finger engages a secondary trigger, then wraps around the main trigger. The shot blasts through Floyd's belly and he flops on the grass. The shooter gazes up from his sights, then stands and approaches the outlaw with the rest of the men following behind. As the men arrive, Floyd takes out a pistol which the lawman kicks out of his hand. He aims his rifle at the wounded outlaw, who lies on his back. Purvis' piercing stare remains fixed on the dying man. Blood gushes from Floyd's belly wound, saturating his white dress shirt. His head falls back on the grass and his convulsing throat muscles come to rest. The lawmen lower their weapons. Purvis studies the dead outlaw then nods at his men. Purvis slings his rifle strap over his shoulder. His eyes and purses his lips. The Nash sedan comes to a stop. In a clean, white kitchen, a woman standing near the sink folds a newspaper.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Collecting himself, he smells, flaring his nostrils, and gazes forward with a steely stare. Crimson peers out the smeared windshield with a solemn expression. Dillinger stands beneath an overcast sky. Strands of his oily black hair hang over his brow. His stare drifts to a route, which slices through a desolate field toward the flat horizon. In a farmhouse, gang members switch garments while eating. A woman wraps food in newspapers and brings it over to their table. Pete fastens up next to another escapee. Crimson extinguishes a cigarette. All of the men depart. Outside, Dillinger walks alone. Without his overcoat, he wears a black vest and a leather gun holster. The woman halts him. They hold eye contact and she releases. As Dillinger turns and walks away from the farmhouse, the woman continues to gaze after him. A little boy in overalls comes up and grasps her hand. Together, they wander a few steps without taking their eyes off of him. In the car, as Crimson drives, Dillinger looks back at Pete. He faces forward and glances at Crimson. A man in a blue suit hurries through lush green woods with a Tommy gun. He stumbles, then rises to his feet and runs on. A clean-cut man donning suspenders swiftly moves after him, toting a rifle. A group of armed lawmen follow behind, charging up a hill. The outlaw races downhill into an apple orchard. At the hill's crest, the clean-cut lawman halts and watches the outlaw run between two rows of trees. He aims his rifle. Floyd backpedals, discharging wildly. The lawman's shot misses. Floyd runs on. Calmly taking a knee, the lawman aims again, rubbing his finger on the trigger. Floyd dashes through the trees, almost out of his pursuer's sight. The lawman's finger engages a secondary trigger, then wraps around the main trigger. The shot blasts through Floyd's abdomen and he flops on the grass. The shooter gazes up from his sights, then stands and approaches the outlaw with the rest of the men following behind. As the men arrive, Floyd pulls out a pistol which the lawman kicks out of his hand. He aims his rifle at the wounded outlaw, who lies on his back. Purvis' piercing gaze remains fixed on the dying man. Blood gushes from Floyd's abdomen wound, soaking his white dress shirt. His head falls back on the grass and his convulsing throat muscles cease. The lawmen lower their weapons. Purvis studies the dead outlaw then nods at his men. Purvis slings his rifle strap over his shoulder. His eyes and purses his lips. The Nash sedan comes to a halt. In a clean, white kitchen, a woman standing near the sink folds a newspaper."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Gathering himself, he sniffs, his nostrils flared, and is stared at by him with a steely gaze. Red peers out the smeared windshield with a solemn expression. An overcast sky is stood under by Dillinger. Strands of his greasy black hair are hung over his forehead. His gaze drifts to a road, which is cut through a desolate field toward the flat horizon. In a farmhouse, clothes are changed by gang members while they eat. Food is wrapped in newspapers and brought over to their table by a woman. Another escapee is buttoned up next to by Pete. A cigarette is put out by Red. All of the men are led out. Outside, Dillinger is walked alone by himself. Without his overcoat, a black vest and a leather gun holster are worn by him. He is stopped by the woman. Eye contact is held by them and she lets him go. As the farmhouse is turned away from and walked away from by Dillinger, the woman continues to gaze after him. A little boy in overalls comes up and takes her hand. A few steps are wandered by them together without their eyes being taken off him. In the car, as Red drives, Pete is looked back at by Dillinger. Forward is faced by him and Red is glanced at. A man in a blue suit hurries through lush green woods with a Tommy gun. He trips, then climbs to his feet and runs on. A clean-cut man wearing suspenders swiftly moves after him, toting a rifle. They follow behind, charging up a hill as a group of armed lawmen. The outlaw races downhill into an apple orchard. At the hill's crest, the clean-cut lawman stops and watches the outlaw run between two rows of trees. His rifle is aimed by him. Floyd runs backward, firing wildly. The shot by the lawman misses. Floyd runs on. Calmly taking a knee, the trigger is aimed at again by the lawman, rubbing his finger on it. Floyd sprints through the trees, almost out of sight of his pursuer. The lawman's finger engages a secondary trigger, then he wraps it around the main trigger. Floyd's belly is blasted through by the shot, and he flops on the grass. Up from his sights, the shooter gazes, then stands and approaches the outlaw followed by the rest of the men. As the men arrive, a pistol is taken out by Floyd which is kicked out of his hand by the lawman. His rifle is aimed by him at the wounded outlaw, who lies on his back. Purvis' piercing stare remains fixed on the dying man. Blood gushes from Floyd's belly wound, saturating his white dress shirt. His head falls back on the grass and his convulsing throat muscles come to rest. Their weapons are lowered by the lawmen. The dead outlaw is studied by Purvis, then his men are nodded at by him. Purvis slings his rifle strap over his shoulder. His eyes and he purses his lips. The Nash sedan is brought to a stop. In a clean, white kitchen, a newspaper is folded by a woman standing near the sink."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Gathering himself, he sniffs, flaring his nostrils, and stares ahead with a steely gaze. Red peers out the smeared windshield solemnly. Dillinger stands beneath an overcast sky, greasy black hair hanging over his forehead. His gaze shifts to a road cutting through a desolate field toward the flat horizon. In a farmhouse, gang members change clothes while eating. A woman wraps food in newspapers and brings it to their table. Pete buttons up beside another escapee. Red extinguishes a cigarette. All the men leave. Outside, Dillinger walks alone, wearing a black vest and leather gun holster without his overcoat. The woman stops him; they hold eye contact and she lets go. As Dillinger departs the farmhouse, the woman continues to watch him. A little boy in overalls takes her hand. Together, they wander a few steps, eyes still on him. In the car, as Red drives, Dillinger looks back at Pete, then faces forward and glances at Red. A man in a blue suit rushes through lush woods with a Tommy gun, trips, then climbs to his feet and continues. A clean-cut man in suspenders quickly follows, carrying a rifle. Armed lawmen charge up a hill behind him. The outlaw races downhill into an apple orchard. At the hill's crest, the clean-cut lawman stops and watches the outlaw run between tree rows. He aims his rifle. Floyd runs backward, firing wildly. The lawman's shot misses. Floyd keeps running. Calmly kneeling, the lawman aims again, rubbing his finger on the trigger. Floyd sprints through trees, nearly out of sight. The lawman engages a secondary trigger, then the main trigger. The shot hits Floyd's belly, and he collapses on the grass. The shooter rises from his position, approaching the outlaw as the rest of the men follow. As they arrive, Floyd draws a pistol, which the lawman kicks away. He aims his rifle at the wounded outlaw lying on his back. Purvis' piercing stare remains fixed on the dying man. Blood gushes from Floyd's belly wound, soaking his white shirt. His head falls back, and his convulsing throat muscles relax. The lawmen lower their weapons. Purvis studies the dead outlaw, nods at his men, slings his rifle over his shoulder, and purses his lips. The Nash sedan halts. In a clean white kitchen, a woman near the sink folds a newspaper."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gathering himself, he sniffs and stares with a steely gaze. Red peers through the smeared windshield solemnly. Dillinger stands under an overcast sky with greasy black hair hanging over his forehead, gazing toward the road cutting through a desolate field. In a farmhouse, gang members eat and change. A woman wraps food in newspapers. Pete buttons up, and Red extinguishes a cigarette. All men leave. Dillinger walks alone, wearing a black vest and leather gun holster. The woman stops him; they lock eyes, then he turns away. She watches him, a boy in overalls holding her hand as they walk. In the car, Red drives as Dillinger looks back at Pete, then forward. A man in a blue suit runs through lush woods with a Tommy gun, trips, then continues. Another man in suspenders follows with a rifle. Armed lawmen pursue them. The outlaw races into an apple orchard, the lawman aiming his rifle. Floyd fires wildly, the lawman's shot misses. Floyd continues until the lawman aims again and shoots. Floyd collapses. The lawman and his group approach Floyd, who draws a pistol which is kicked away. Purvis stares at the dying outlaw, whose blood soaks his white shirt. Floyd's head falls back, his throat stilling. Lawmen lower their weapons. Purvis nods, slings his rifle, and the Nash sedan stops. In a clean kitchen, a woman folds a newspaper."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Taking a deep breath to steady himself, he sniffs loudly, flaring his nostrils wide, and stares straight ahead with a determined and steely gaze. Red looks out from behind the smeared windshield, his face fixed in a solemn expression, a reflection of the tension in the air. Below, Dillinger stands under the gray, overcast sky, his greasy black hair hanging in strands over his forehead. His eyes drift to a road stretching out before him, cutting through a desolate, forlorn field towards the endless flat horizon. Inside a nearby farmhouse, members of the gang are changing clothes while hurriedly eating their meals. A woman carefully wraps food in newspapers and brings it over to the table where they are seated. Pete, standing next to another escapee, calmly buttons up his shirt. Red, finished with his cigarette, stubs it out. Determined, all of the men rise and leave the farmhouse. Outside, Dillinger walks alone, having shed his overcoat. He now wears a fitted black vest paired with a leather gun holster slung across his body. The woman stops him briefly, their eyes meeting and holding for a moment before she releases him. As Dillinger turns, he walks away from the farmhouse, the woman’s gaze lingering on him. A little boy, dressed in worn overalls, approaches her, taking her hand in his small grip. Together, they take a few steps forward, their eyes never leaving Dillinger's retreating form. In the car, as Red drives along the road, Dillinger looks back at Pete, then turns his attention forward, momentarily glancing at Red. Meanwhile, a man clad in a blue suit urgently hurries through the lush, dense green woods, gripping a Tommy gun tightly. He stumbles over roots, quickly regains his footing, and continues running. A clean-cut man, wearing suspenders, moves swiftly and purposefully after him, carrying a rifle. A determined group of armed lawmen follow closely behind, charging up the hill with focused intent. The outlaw races downhill into an expansive apple orchard. Standing at the hill's crest, the clean-cut lawman pauses to observe as the outlaw sprints between two rows of trees. Carefully, he aims his rifle. Floyd, running backwards, fires his gun wildly, the lawman's initial shot missing its mark. Floyd continues running. Calmly, the lawman takes a knee, his focus unwavering as he aims once more, rubbing his finger thoughtfully along the trigger. Floyd sprints through the trees, nearly escaping the lawman's view. The lawman's finger engages a secondary trigger, then wraps securely around the main one. A loud shot echoes as it pierces through Floyd's belly, sending him flopping onto the grassy ground. The lawman lifts his gaze from the rifle sights and stands, approaching the fallen outlaw with the rest of the men trailing behind. As they reach him, Floyd retrieves a pistol, which the lawman swiftly kicks out of his grasp. He aims his rifle directly at the wounded outlaw, who lies sprawled on his back. Purvis maintains a piercing stare, his eyes locked on the dying man. Blood gushes profusely from the wound in Floyd's belly, staining his white dress shirt. His head falls back onto the grass, and, eventually, his convulsing throat muscles come to a still rest. The lawmen lower their weapons, the tension easing slightly. Purvis, studying the now-dead outlaw, nods at his men, signaling the conclusion of their chase. He slings the rifle strap over his shoulder, his gaze thoughtful, as he purses his lips. Nearby, a Nash sedan comes to a stop. Inside a spotless, white kitchen, a woman stands near the sink, methodically folding a newspaper."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Taking a deep, calming breath in an effort to steady himself, he sniffs loudly, his nostrils flaring wide with intensity, and stares straight ahead, his gaze determined and steely as he focuses on the task at hand. Red looks out from behind the smeared windshield of his vehicle, his face set in a solemn, serious expression that mirrors the tension hanging thickly in the air. Below, Dillinger stands under a gray, overcast sky, his greasy black hair hanging in strands over his forehead, adding to his disheveled appearance. His eyes wander to a road that stretches out before him, cutting through a desolate and forlorn field as it leads toward the endless, flat horizon. Inside the confines of a nearby farmhouse, members of the gang are hastily changing clothes while hurriedly consuming their meals. A woman, with deliberate care, wraps food in newspapers before bringing it over to the table where they are seated. Pete, standing next to another escapee, calmly buttons up his shirt with careful precision. Red, having finished with his cigarette, stubs it out decisively before leaving. With resolute determination, all the men rise from their seats and exit the farmhouse. Outside, Dillinger walks alone, having removed his overcoat. He now wears a fitted black vest, complemented by a leather gun holster slung across his body. The woman stops him briefly, their eyes meeting and holding for a meaningful moment before she releases her grasp. As Dillinger turns away, he walks from the farmhouse, the woman's gaze following him as he goes. A little boy, dressed in worn overalls, approaches her, taking her hand gently with his small grip. Together, they take a few steps forward, their eyes never leaving Dillinger's retreating form. In the car, as Red drives along the road, Dillinger looks back at Pete, then shifts his attention to the front, momentarily glancing at Red with a knowing look. Meanwhile, a man dressed in a sharp blue suit urgently hurries through the lush, dense green woods, gripping a Tommy gun tightly in his hands. He stumbles over protruding roots but quickly regains his footing and continues running with persistence. A clean-cut man, clad in suspenders, moves swiftly and purposefully after him, a rifle firmly in his possession. A determined group of armed lawmen trail closely behind, charging up the hill with focused intent. The outlaw races downhill into an expansive apple orchard. Standing at the hill's crest, the clean-cut lawman pauses briefly to observe as the outlaw sprints between two neatly aligned rows of apple trees. Carefully and deliberately, he aims his rifle, his focus unwavering. Floyd, running backwards, fires his gun wildly, the lawman's initial shot missing its intended mark. Floyd continues running with desperation. Calmly, the lawman takes a knee, his concentration unbroken as he aims once more, rubbing his finger thoughtfully along the trigger. Floyd sprints through the trees, nearly slipping out of the lawman's view. The lawman's finger engages a secondary trigger, then wraps securely around the main one. A loud, resounding shot echoes as it pierces through Floyd's belly, sending him flopping onto the grassy ground with a thud. The lawman lifts his gaze from the rifle sights and stands, approaching the fallen outlaw with the rest of the men trailing behind him. As they reach Floyd, he retrieves a pistol, which the lawman swiftly kicks out of his grasp with precision. He aims his rifle directly at the wounded outlaw, who lies sprawled on his back, vulnerable and defeated. Purvis maintains a piercing stare, his eyes locked with intensity on the dying man. Blood gushes profusely from the wound in Floyd's belly, staining his once-white dress shirt with its vivid color. His head falls back onto the grass, and, eventually, his convulsing throat muscles come to a still and quiet rest. The lawmen lower their weapons, the tension in the air easing slightly. Purvis, studying the now-dead outlaw before him, nods at his men, signaling the conclusion of their relentless chase. He slings the rifle strap over his shoulder, his gaze thoughtful and reflective, as he purses his lips in contemplation. Nearby, a Nash sedan comes to a stop. Inside a spotless, white kitchen, a woman stands near the sink, methodically folding a newspaper with precise movements."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Gathering himself with a deep breath, he sniffs, his nostrils flaring wide, and fixes his gaze forward with a focused, steely determination. Meanwhile, Red, with a solemn look on his face, peers through the smeared windshield, contemplating the scene ahead. Underneath an overcast sky, Dillinger stands, strands of his greasy black hair hanging loosely over his forehead. His eyes wander to a road stretching through a bare, desolate field toward the flat, distant horizon. Inside a nearby farmhouse, gang members are in the process of changing clothes while simultaneously eating their meals. A woman, attentive to their needs, wraps food carefully in newspapers and places it on their table. Pete, standing close to another escapee, diligently buttons up his clothes. Red, having finished his cigarette, extinguishes it before the group of men collectively decide to leave. Outside, Dillinger strides alone with a purposeful air. Without his overcoat, he is clad in a black vest paired with a leather gun holster. The woman intercepts him and they lock eyes, exchanging a silent but profound moment. She releases the insistence of her gaze as Dillinger turns away, retreating from the farmhouse, while she continues to follow his departure with her eyes. A little boy, clad in overalls, approaches and takes the woman's hand, together they wander a few steps, their attention still fixed on Dillinger. Within the car, as Red drives, Dillinger turns his head to glance at Pete, then shifts his focus forward, sparing a quick glance at Red from the corner of his eye. In a different scene, a man outfitted in a blue suit races through the lush green woods, clutching a Tommy gun. He stumbles, then swiftly regains his footing and continues running. Close behind him, a clean-cut man in suspenders, carrying a rifle, moves rapidly in pursuit. A band of armed lawmen follow, charging up a hill with determination. The outlaw makes a dash downhill into an apple orchard, weaving between rows of trees as the clean-cut lawman halts at the hill’s crest to observe. He takes aim with his rifle, ready to fire. Floyd, retreating backward, haphazardly fires his weapon, and the lawman's shot goes astray. Floyd keeps running. With a steady calm, the lawman kneels to aim again, rubbing his finger on the trigger thoughtfully. Floyd sprints on, nearly eluding his pursuer’s line of sight among the trees. The lawman, ensuring precision, engages a secondary trigger before pulling the main trigger. The bullet slices through Floyd’s belly, causing him to collapse onto the grass. The shooter, rising from his sights, stands and, with his men in tow, advances toward the fallen outlaw. As they reach Floyd, he attempts to draw a pistol, but the lawman swiftly kicks it away, maintaining his aim on the now-helpless outlaw. Purvis' piercing gaze remains resolutely fixed on the dying man. Blood streams profusely from Floyd’s belly wound, soaking through his white dress shirt, and as his head drops back on the grass, his convulsing throat muscles finally settle into stillness. The lawmen, assessing the situation, lower their weapons. Purvis studies the deceased outlaw, then gives a nod to his men, signaling the end. He slings the rifle strap over his shoulder, his expression contemplative, lips pursed in thought. Meanwhile, a Nash sedan cruises to a halt. Inside a pristine, white kitchen, a woman standing near the sink completes the careful folding of a newspaper, her actions methodical and precise."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gathering himself with a steely gaze, Red stares through the smeared windshield, while Dillinger stands beneath an overcast sky, observing the road cutting through a desolate field. Inside a farmhouse, gang members change clothes and eat as a woman wraps food in newspapers for them. As Pete finishes buttoning up, Red extinguishes his cigarette, and the men depart. Outside, Dillinger, now without his overcoat, walks alone in his vest and gun holster. A woman stops him momentarily with her gaze, then releases him, watching as he walks away. Nearby, a little boy in overalls joins the woman, and they continue to watch Dillinger as he departs. In the car, Dillinger looks back at Pete, then forward at Red as they drive on. Meanwhile, in the woods, a man in a blue suit, armed with a Tommy gun, hastily moves through lush greenery, tripping and struggling to his feet. A clean-cut man in suspenders, carrying a rifle, pursues him alongside a group of lawmen. As the outlaw navigates the apple orchard, the lawman takes aim. Despite firing, the first shot misses, but on a second, more calculated attempt, the lawman hits Floyd, who collapses. Approaching with the lawmen, Purvis kicks away Floyd's pistol and trains his rifle on the wounded outlaw. As blood saturates Floyd's shirt and his life fades, Purvis remains watchful, then signals to his men to lower their weapons. The Nash sedan halts as a woman, standing in a pristine kitchen, folds a newspaper by the sink."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Gathering himself, he sniffs, flaring his nostrils, and stares forward with a steely gaze. Red peers out the smeared windshield of the car, an old Ford Model A known for its durability during the Great Depression, with a solemn expression. Dillinger, a notorious bank robber of the 1930s, stands below an overcast sky. Strands of his greasy black hair hang over his forehead. His gaze drifts to a road, a narrow gravel path typical of rural America during this era, which cuts through a desolate field toward the flat horizon. In a nearby farmhouse, gang members, fugitives from a recent heist, change clothes while eating. A woman, likely the farmer's wife who sympathizes with their outlaw cause, wraps food in newspapers, a common method of packaging meals at the time, and brings it over to their table. Pete, a fellow escapee who shares Dillinger's criminal notoriety, buttons up next to another escapee. Red puts out a cigarette, a luxury item despite the ongoing economic hardships. All of the men leave. Outside, Dillinger walks alone. Without his overcoat, he wears a black vest and a leather gun holster, emblematic of his life on the run. The woman stops him, a silent goodbye and a hope for his safety. They hold eye contact and she lets go. As Dillinger turns and walks away from the farmhouse, the woman continues to gaze after him. A little boy in overalls, reminiscent of countless children growing up in poverty during the Depression, comes up and takes her hand. Together, they wander a few steps without taking their eyes off of him. In the car, as Red drives, Dillinger looks back at Pete, gauging his ally's readiness. He faces forward and glances at Red, the trusted driver of their crew. Meanwhile, a man in a blue suit, possibly an FBI agent given their distinctive attire, hurries through lush green woods with a Tommy gun, the infamous submachine gun used by both sides of the law. He trips, then climbs to his feet and runs on. A clean-cut man wearing suspenders, likely a skilled marksman who prides himself on precision, swiftly moves after him, toting a rifle. A group of armed lawmen follow behind, charging up a hill in pursuit. The outlaw, Floyd, a rival gangster known for his violent escapades, races downhill into an apple orchard, seeking cover among the trees. At the hill's crest, the clean-cut lawman stops and watches the outlaw run between two rows of trees. He aims his rifle, trained by hours of practice. Floyd runs backwards, firing wildly, a desperate attempt to escape. The lawman's shot misses. Floyd runs on. Calmly taking a knee, the lawman aims again, rubbing his finger on the trigger, his training taking over. Floyd sprints through the trees, almost out of his pursuer's sight. The lawman's finger engages a secondary trigger for better precision, then wraps around the main trigger. The shot blasts through Floyd's belly, known as a fatal wound, and he flops on the grass. The shooter gazes up from his sights, then stands and approaches the outlaw with the rest of the men following behind. As the men arrive, Floyd takes out a pistol, a last act of defiance, which the lawman kicks out of his hand. He aims his rifle at the wounded outlaw, who lies on his back. Purvis, the determined FBI agent famed for taking down numerous infamous criminals, has a piercing stare that remains fixed on the dying man. Blood gushes from Floyd's belly wound, saturating his white dress shirt, a stark contrast against the red. His head falls back on the grass and his convulsing throat muscles come to rest. The lawmen lower their weapons, a signal that the hunt is concluded. Purvis studies the dead outlaw then nods at his men, signaling a job well done. Purvis slings his rifle strap over his shoulder, his eyes and purses his lips, contemplating justice served. The Nash sedan, a popular and reliable vehicle of the time, comes to a stop. In a clean, white kitchen, a woman standing near the sink, perhaps the wife of a local sheriff, folds a newspaper, the headline likely announcing the capture of the notorious outlaw."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The shooter gazes up from his sights then stands and approaches the outlaw with the rest of the men following behind Gathering himself he sniffs flaring his nostrils and stares forward with a steely gaze Red peers out the smeared windshield with a solemn expression Dillinger stands below an overcast sky Strands of his greasy black hair hang over his forehead His gaze drifts to a road which cuts through a desolate field toward the flat horizon In a farmhouse gang members change clothes while eating A woman wraps food in newspapers and brings it over to their table Pete buttons up next to another escapee Together they wander a few steps without taking their eyes off of him Red puts out a cigarette Blood gushes from Floyd's belly wound saturating his white dress shirt He trips then climbs to his feet and runs on Dillinger stands below an overcast sky All of the men leave Outside Purvis slings his rifle strap over his shoulder His eyes and purses his lips Dillinger walks alone Without his overcoat he wears a black vest and a leather gun holster The woman stops him They hold eye contact and she let us go In the car as Red drives Dillinger looks back at Pete In a clean white kitchen As Dillinger turns and walks away from the farmhouse the woman continues to gaze after him A little boy in overalls comes up and takes her hand Red puts out a cigarette Together they wander a few steps without taking their eyes off of him They hold eye contact and she let us go In the car as Red drives Dillinger looks back at Pete He faces forward and glances at Red A man in a blue suit hurries through lush green woods with a Tommy gun A man in a blue suit hurries through lush green woods with a Tommy gun He trips then climbs to his feet and runs on A cleancut man wearing suspenders swiftly moves after him toting a rifle A group of armed lawmen follow behind charging up a hill He aims his rifle at the wounded outlaw who lies on his back The outlaw races downhill into an apple orchard At the hill's crest the cleancut lawman stops and watches the outlaw run between two rows of trees He aims his rifle Red peers out the smeared windshield with a solemn expression A little boy in overalls comes up and takes her hand Floyd runs backwards firing wildly The lawman's shot misses Floyd runs on Calmly taking a knee the lawman aims again rubbing his finger on the trigger Floyd sprints through the trees almost out of his pursuer's sight Gathering himself he sniffs flaring his nostrils and stares forward with a steely gaze The lawman's finger engages a secondary trigger then wraps around the main trigger The shot blasts through Floyd's belly and he flops on the grass A group of armed lawmen follow behind charging up a hill As Dillinger turns and walks away from the farmhouse the woman continues to gaze after him Pete buttons up next to another escapee The shooter gazes up from his sights then stands and approaches the outlaw with the rest of the men following behind As the men arrive Floyd takes out a pistol which the lawman kicks out of his hand The Nash sedan comes to a stop He aims his rifle at the wounded outlaw who lies on his back Purvis' piercing stare remains fixed on the dying man Blood gushes from Floyd's belly wound saturating his white dress shirt His head falls back on the grass and his convulsing throat muscles come to rest The lawmen lower their weapons In a farmhouse gang members change clothes while eating Purvis studies the dead outlaw then nods at his men Purvis slings his rifle strap over his shoulder His eyes and purses his lips The lawman's shot misses The Nash sedan comes to a stop The lawmen lower their weapons A woman wraps food in newspapers and brings it over to their table In a clean white kitchen a woman standing near the sink folds a newspaper"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Gathering himself he sniffs flaring his nostrils and stares forward with a steely gaze. Red peers out the smeared windshield with a solemn expression. Dillinger stands below an overcast sky. Strands of his greasy black hair hang over his forehead. His gaze drifts to a road which cuts through a desolate field toward the flat horizon. In a farmhouse gang members change clothes while eating. A woman wraps food in newspapers and brings it over to their table. Pete buttons up next to another escapee. Red puts out a cigarette. All of the men leave Outside. Dillinger walks alone. Without his overcoat he wears a black vest and a leather gun holster. The woman stops him. They hold eye contact and she let us go. As Dillinger turns and walks away from the farmhouse the woman continues to gaze after him. A little boy in overalls comes up and takes her hand. Together they wander a few steps without taking their eyes off of him. In the car as Red drives Dillinger looks back at Pete. He faces forward and glances at Red. A man in a blue suit hurries through lush green woods with a Tommy gun. He trips then climbs to his feet and runs on. A cleancut man wearing suspenders swiftly moves after him toting a rifle. A group of armed lawmen follow behind charging up a hill. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. The outlaw races downhill into an apple orchard. At the hill's crest the cleancut lawman stops and watches the outlaw run between two rows of trees. He aims his rifle. Floyd runs backwards firing wildly. The lawman's shot misses. Floyd runs on. Calmly taking a knee. the lawman aims again rubbing his finger on the trigger. Floyd sprints through the trees almost out of his pursuer's sight. The lawman's finger engages a secondary trigger then wraps around the main trigger. The shot blasts through Floyd's belly and he flops on the grass. The shooter gazes up from his sights then stands and approaches the outlaw with the rest of the men following behind. As the men arrive Floyd takes out a pistol which the lawman kicks out of his hand. He aims his rifle at the wounded outlaw who lies on his back. Purvis' piercing stare remains fixed on the dying man. Blood gushes from Floyd's belly wound saturating his white dress shirt. His head falls back on the grass and his convulsing throat muscles come to rest. The lawmen lower their weapons. Purvis studies the dead outlaw then nods at his men. Purvis slings his rifle strap over his shoulder His eyes and purses his lips. The Nash sedan comes to a stop. In a clean white kitchen. a woman standing near the sink folds a newspaper."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Gathering himself he sniffs flaring his nostrils and stares forward with a steely gaze. Red peers out the smeared windshield with a solemn expression. Dillinger stands below an overcast sky. Strands of his greasy black hair hang over his forehead. His gaze drifts to a road which cuts through a desolate field toward the flat horizon. In a farmhouse gang members change clothes while eating. A woman wraps food in newspapers and brings it over to their table. Pete buttons up next to another escapee. Red puts out a cigarette. All of the men leave Outside. Dillinger walks alone. Without his overcoat he wears a black vest and a leather gun holster. The woman stops him. They hold eye contact and she let us go. As Dillinger turns and walks away from the farmhouse the woman continues to gaze after him. A little boy in overalls comes up and takes her hand. Together they wander a few steps without taking their eyes off of him. In the car as Red drives Dillinger looks back at Pete. He faces forward and glances at Red. A man in a blue suit hurries through lush green woods with a Tommy gun. He trips then climbs to his feet and runs on. A cleancut man wearing suspenders swiftly moves after him toting a rifle. A group of armed lawmen follow behind charging up a hill. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. The outlaw races downhill into an apple orchard. At the hill's crest the cleancut lawman stops and watches the outlaw run between two rows of trees. He aims his rifle. Floyd runs backwards firing wildly. The lawman's shot misses. Floyd runs on. Calmly taking a knee. the lawman aims again rubbing his finger on the trigger. Floyd sprints through the trees almost out of his pursuer's sight. The lawman's finger engages a secondary trigger then wraps around the main trigger. The shot blasts through Floyd's belly and he flops on the grass. The shooter gazes up from his sights then stands and approaches the outlaw with the rest of the men following behind. As the men arrive Floyd takes out a pistol which the lawman kicks out of his hand. He aims his rifle at the wounded outlaw who lies on his back. Purvis' piercing stare remains fixed on the dying man. Blood gushes from Floyd's belly wound saturating his white dress shirt. His head falls back on the grass and his convulsing throat muscles come to rest. The lawmen lower their weapons. Purvis studies the dead outlaw then nods at his men. Purvis slings his rifle strap over his shoulder His eyes and purses his lips. The Nash sedan comes to a stop. In a clean white kitchen. a woman standing near the sink folds a newspaper."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Gathering himself he sniffs flaring his nostrils and stares forward with a steely gaze. Red peers out the smeared windshield with a solemn expression. Dillinger stands below an overcast sky. Strands of his greasy black hair hang over his forehead. His gaze drifts to a road which cuts through a desolate field toward the flat horizon. In a farmhouse gang members change clothes while eating. A woman wraps food in newspapers and brings it over to their table. Pete buttons up next to another escapee. Red puts out a cigarette. All of the men leave Outside. Dillinger walks alone. Without his overcoat he wears a black vest and a leather gun holster. As the men arrive Floyd takes out a pistol which the lawman kicks out of his hand. He aims his rifle at the wounded outlaw who lies on his back. Purvis' piercing stare remains fixed on the dying man. Blood gushes from Floyd's belly wound saturating his white dress shirt. His head falls back on the grass and his convulsing throat muscles come to rest. The lawmen lower their weapons. Purvis studies the dead outlaw then nods at his men. Purvis slings his rifle strap over his shoulder His eyes and purses his lips. The Nash sedan comes to a stop. In a clean white kitchen. a woman standing near the sink folds a newspaper."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Gathering himself he sniffs flaring his nostrils and stares forward with a steely gaze. Red peers out the smeared windshield with a solemn expression. Dillinger stands below an overcast sky. Strands of his greasy black hair hang over his forehead. His gaze drifts to a road which cuts through a desolate field toward the flat horizon. Purvis studies the dead outlaw then nods at his men. Purvis slings his rifle strap over his shoulder His eyes and purses his lips. The Nash sedan comes to a stop. In a clean white kitchen. a woman standing near the sink folds a newspaper."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Gathering itself, a fox sniffs, flaring its nostrils, and stares forward with a steely gaze. A rabbit peers out the smeared windshield with a solemn expression. An owl stands below an overcast sky. Strands of its greasy black hair hang over its forehead. Its gaze drifts to a road, which cuts through a desolate field toward the flat horizon. In a farmhouse, squirrels change clothes while eating. A horse wraps food in newspapers and brings it over to their table. A goat buttons up next to another escapee. The rabbit puts out a cigarette. All of the animals leave. Outside, the owl walks alone. Without its overcoat, it wears a black vest and a leather gun holster. The horse stops it. They hold eye contact and the horse lets go. As the owl turns and walks away from the farmhouse, the horse continues to gaze after it. A kitten in overalls comes up and takes the horse's hand. Together, they wander a few steps without taking their eyes off of it. In the car, as the rabbit drives, the owl looks back at the goat. It faces forward and glances at the rabbit. A raccoon in a blue suit hurries through lush green woods with a Tommy gun. It trips, then climbs to its feet and runs on. A clean-cut badger wearing suspenders swiftly moves after it, toting a rifle. A group of armed chipmunks follow behind, charging up a hill. The raccoon races downhill into an apple orchard. At the hill's crest, the clean-cut badger stops and watches the raccoon run between two rows of trees. It aims its rifle. A bear runs backwards, firing wildly. The badger's shot misses. The bear runs on. Calmly taking a knee, the badger aims again, rubbing its finger on the trigger. The bear sprints through the trees, almost out of its pursuer's sight. The badger's finger engages a secondary trigger, then wraps around the main trigger. The shot blasts through the bear's belly and it flops on the grass. The shooter gazes up from its sights, then stands and approaches the raccoon with the rest of the chipmunks following behind. As the chipmunks arrive, the bear takes out a pistol which the badger kicks out of its hand. It aims its rifle at the wounded raccoon, which lies on its back. A lynx's piercing stare remains fixed on the dying bear. Blood gushes from the bear's belly wound, saturating its white dress shirt. Its head falls back on the grass and its convulsing throat muscles come to rest. The chipmunks lower their weapons. The lynx studies the dead raccoon then nods at its crew. The lynx slings its rifle strap over its shoulder. Its eyes and purses its lips. The Nash sedan comes to a stop. In a clean, white kitchen, a penguin standing near the sink folds a newspaper."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Gathering himself, he sniffs, flaring his nostrils, and stares forward with a steely gaze. Red peers out the smeared porthole with a solemn expression. Dillinger stands below a cloudy mountain range. Strands of his greasy black hair hang over his forehead. His gaze drifts to a path, which cuts through a barren canyon toward the flat horizon. In a cabin, gang members change uniforms while snacking. A woman wraps snacks in magazines and brings them over to their bench. Pete fastens his boots next to another escapee. Red puts out a matchstick. All of the men leave. Outside, Dillinger walks alone. Without his jacket, he wears a black sweater and a canvas weapon belt. The woman stops him. They hold eye contact and she lets go. As Dillinger turns and walks away from the cabin, the woman continues to gaze after him. A little boy in shorts comes up and takes her hand. Together, they wander a few steps without taking their eyes off of him. In the truck, as Red drives, Dillinger looks back at Pete. He faces forward and glances at Red. A man in a blue coat hurries through thick yellow fields with a crossbow. He stumbles, then climbs to his feet and runs on. A clean-cut man wearing overalls swiftly moves after him, toting a slingshot. A group of armed rangers follow behind, charging up a dune. The outlaw races downhill into a peach orchard. At the dune's crest, the clean-cut ranger stops and watches the outlaw run between two rows of trees. He aims his slingshot. Floyd runs backwards, firing wildly. The ranger's shot misses. Floyd runs on. Calmly taking a knee, the ranger aims again, rubbing his finger on the string. Floyd sprints through the trees, almost out of his pursuer's sight. The ranger's finger engages a secondary mechanism, then wraps around the main string. The shot blasts through Floyd's shoulder and he flops on the sand. The shooter gazes up from his sights, then stands and approaches the outlaw with the rest of the men following behind. As the men arrive, Floyd takes out a dagger which the ranger kicks out of his hand. He aims his slingshot at the wounded outlaw, who lies on his back. Purvis' piercing stare remains fixed on the dying man. Blood gushes from Floyd's shoulder wound, saturating his white sweater. His head falls back on the sand and his convulsing throat muscles come to rest. The rangers lower their weapons. Purvis studies the dead outlaw then nods at his men. Purvis slings his slingshot strap over his shoulder. His eyes and purses his lips. The Ford truck comes to a stop. In a clean, white dining room, a woman standing near the counter folds a map."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Gathering himself, he sneezes, twitching his nostrils, and glares forward with a curious gaze. Red gazes through the smeared windshield with a playful expression. Dillinger dances below an overcast sky. Strands of his greasy black hair flutter over his forehead. His gaze hops to a road, which winds through a desolate field toward the flat horizon. In a farmhouse, gang members rehearse lines while laughing. A woman juggles food in newspapers and slides it over to their table. Pete skips up next to another escapee. Red picks up a cigarette. All of the men disappear. Outside, Dillinger meanders alone. Without his overcoat, he flaunts a black vest and a leather gun holster. The woman grabs him. They exchange eye contact and she releases him. As Dillinger spins and dances away from the farmhouse, the woman continues to observe after him. A little boy in overalls approaches and shakes her hand. Together, they tiptoe a few steps without taking their eyes off of him. In the car, as Red sings, Dillinger whispers back at Pete. He spins forward and winks at Red. A man in a blue suit dances through lush green woods with a Tommy gun. He tumbles, then bounces to his feet and skips on. A clean-cut man wearing suspenders gently leaps after him, cradling a rifle. A group of armed lawmen jog behind, skipping up a hill. The outlaw strolls downhill into an apple orchard. At the hill's crest, the clean-cut lawman freezes and observes the outlaw skid between two rows of trees. He waves his rifle. Floyd twirls backwards, laughing wildly. The lawman's shot swerves. Floyd skips on. Calmly standing tall, the lawman peers again, tapping his finger on the trigger. Floyd twirls through the trees, almost out of his pursuer's sight. The lawman's finger massages a secondary trigger, then brushes the main trigger. The shot whistles through Floyd's belly, and he rolls on the grass. The shooter smiles up from his sights, then leaps and pirouettes toward the outlaw with the rest of the men hopping behind. As the men gather, Floyd presents a pistol which the lawman nudges out of his hand. He balances his rifle at the wounded outlaw, who lies on his back. Purvis' sharp stare remains locked on the resting man. Blood drips from Floyd's belly wound, staining his white dress shirt. His head slumps back on the grass and his twitching throat muscles come to stillness. The lawmen raise their weapons. Purvis examines the dead outlaw, then shrugs at his men. Purvis tosses his rifle strap over his shoulder. His eyes and puffs his lips. The Nash sedan glides to a stop. In a clean, white kitchen, a woman standing near the sink crumples a newspaper."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Steadying itself, the balloon sniffs, flaring its nostrils, and stares forward with a steely gaze. Green peers out the smeared moonroof with a solemn expression. Thompson stands below an overcast sea. Strands of its greasy black feathers hang over its forehead. Its gaze drifts to a sidewalk, which cuts through a desolate desert toward the flat ocean. In a lighthouse, pirates change hats while painting. A cat wraps yarn in napkins and brings it over to its perch. Sam buttons up next to another castaway. Green puts out a flashlight. All of the cats leave. Outside, Thompson walks alone. Without its overalls, it wears a black sweater and a leather book holster. The cat stops it. They hold eye contact and it lets go. As Thompson turns and walks away from the lighthouse, the cat continues to gaze after it. A little rabbit in overalls comes up and takes its paw. Together, they hop a few steps without taking their eyes off of it. In the spaceship, as Green drives, Thompson looks back at Sam. It faces forward and glances at Green. A robot in a red scarf hurries through lush red mountains with a water gun. It trips, then climbs to its wheels and rolls on. A tidy machine wearing headphones swiftly moves after it, toting a lasso. A herd of galloping aliens follow behind, charging up a dune. The thief races downhill into a mango grove. At the dune's crest, the tidy alien stops and watches the thief run between two rows of plants. It aims its lasso. Mace runs backwards, spraying wildly. The alien's shot misses. Mace runs on. Calmly taking a knee, the alien aims again, rubbing its claw on the trigger. Mace sprints through the plants, almost out of its pursuer's sight. The alien's claw engages a secondary button, then wraps around the main button. The shot blasts through Mace's wheel and it flops on the sand. The shooter gazes up from its sights, then stands and approaches the thief with the rest of the aliens following behind. As the aliens arrive, Mace takes out a squirt gun which the alien kicks out of its claw. It aims its lasso at the wounded thief, who lies on its back. Purvis' piercing gaze remains fixed on the dying machine. Paint gushes from Mace's wheel wound, saturating its white leather jacket. Its head falls back on the sand and its convulsing arm joints come to rest. The aliens lower their lassos. Purvis studies the broken thief then nods at its aliens. Purvis slings its lasso strap over its shoulder. Its eyes and rubs its claws. The Ford tricycle comes to a stop. In a messy, blue attic, a dog standing near the ladder folds a letter."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Preparing himself, the cat snorts, twitching its whiskers, and glances forward with a determined expression. Blue gazes out the cracked window with a thoughtful demeanor. Thompson sits below a cloudy sky. Wisps of his dirty blonde hair droop over his cheeks. His focus shifts to a highway, which winds through an empty field toward the endless horizon. In a tavern, cooks swap utensils while chatting. A child packs toys in boxes and places them around their playpen. Sam ties his shoelaces next to another traveler. Blue stamps out a match. All of the women depart. Inside, Thompson sits alone. Without his scarf, he dons a gray jacket and a wool scarf. The child tugs at him. They exchange a glance and the child skips away. As Thompson turns and strolls toward the tavern, the child continues to watch after him. A little girl in dungarees skips up and holds the woman's skirt. Together, they sidle a few steps without removing their gaze from him. In the van, as Blue navigates, Thompson surveys Sam. He turns back and peers at Blue. A woman in a green dress strides through thick redwoods with a bow. She stumbles, then rises to her feet and jogs on. A scruffy man wearing a vest eagerly dashes after her, holding a slingshot. A pack of unarmed hikers trail behind, climbing down a slope. The fugitive dashes uphill into a pear grove. At the hill’s peak, the scruffy hiker pauses and observes the fugitive skip between two lines of trees. He brandishes his slingshot. Earl jogs sideways, hurling random stones. The hiker’s shot veers off. Earl skips onward. Casually crouching, the hiker prepares again, flexing his thumb on the string. Earl leaps through the branches, barely beyond his follower’s vision. The hiker’s thumb releases a secondary string, then clamps onto the main band. The projectile pierces Earl’s shoulder, and he crumples onto the soil. The launcher gazes down from his stance, then advances toward the fugitive with the group of hikers trailing behind. As the group arrives, Earl pulls out a knife which the hiker nudges away with his foot. He brandishes his slingshot at the injured fugitive, who reclines on his side. Carson’s intense glare lingers on the fading woman. Water pours from Earl’s shoulder wound, soaking his tan jacket. Her head droops onto the earth and her twitching arm muscles calm. The hikers lower their gear. Carson examines the fallen fugitive then signals to his companions. Carson hoists his slingshot string over his arm. His brows furrow and he exhales. The Ford truck idles to a pause. In a neat, ceramic bathroom, a child standing near the tub stacks toys."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Gathering himself, he inhales sharply, twitching his eyebrows, and glances upward with a determined expression. Red peers out the foggy window with a thoughtful demeanor. Dillinger stands beneath a clear sky. Strands of his shiny brown hair fall over his forehead. His gaze shifts to a trail, which winds through a barren meadow toward the distant mountains. In a barn, gang members rearrange furniture while humming. A woman wraps flowers in blankets and places them onto their bench. Pete ties his shoes next to another escapee. Red flicks away a matchstick. All of the men depart. Outside, Dillinger ambles alone. Without his hat, he wears a blue vest and a canvas bag. The woman intercepts him. They share a look and she steps back. As Dillinger turns and saunters away from the barn, the woman continues to watch him go. A little boy in suspenders approaches and grabs her scarf. Together, they shuffle a few steps while keeping their gaze on him. In the van, as Red navigates, Dillinger turns to Pete. He looks ahead and peers at Red. A man in a green jacket dashes through sunlit gardens with a slingshot. He stumbles, then leaps up and sprints on. A tidy man wearing a fedora briskly follows him, clutching a bow. A team of uniformed officers trail behind, ascending a slope. The fugitive darts downhill into a cherry grove. At the hill's peak, the tidy officer pauses and observes the fugitive dodge between two rows of trunks. He notches his bow. Floyd retreats sideways, shooting erratically. The officer's arrow misses. Floyd continues his escape. Carefully kneeling, the officer readies again, caressing his thumb on the string. Floyd races through the trunks, nearly vanishing from his pursuer's view. The officer's thumb releases the secondary knot, then pulls the main string. The arrow pierces Floyd's side and he collapses on the soil. The archer looks up from his bow, then stands and advances toward the fugitive with the others trailing behind. As they arrive, Floyd reaches for a dagger which the officer kicks away. He points his bow at the wounded fugitive, who lies facing the sky. Purvis' intense gaze remains locked on the struggling man. Sap oozes from Floyd's side slashes, soaking his striped sweater. His head tilts back on the soil and his twitching eyelid settles still. The officers lower their bows. Purvis examines the fallen fugitive then gestures to his team. Purvis drapes his bowstring over his shoulder. His eyes narrow and he exhales deeply. The jalopy rolls to a halt. In a pristine, blue dining room, a woman standing by the table folds a handkerchief."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Centering himself, the cat twitches, twitching its whiskers, and glances upward with a playful look. Blue gazes out the cracked porthole with a cheerful grin. Marigold sits beneath a clear canopy. Threads of its shiny red scarf drape over its collar. Its attention shifts to a path, which snakes through a vibrant meadow toward the jagged skyline. In a workshop, artists swap paintbrushes while humming. A child packs toys in baskets and places them onto their shelf. Sam laces up beside another traveler. Blue snuffs out a lantern. All of the artists gather. Inside, Marigold sits quietly. Without its sweater, it wears a gray cloak and a velvet pouch. The child halts it. They lock eyes and she backs away. As Marigold stands and hops out of the workshop, the child continues to smile at it. A small bird in feathers flutters over and perches on her arm. Together, they skip a few paces without breaking their gaze from it. On the train, as Blue steers, Marigold glances over at Sam. It faces the window and observes Blue. A squirrel in a yellow jacket dashes through towering redwoods with a slingshot. It stumbles, then springs to its paws and scampers on. A scruffy rabbit, donning a bow tie, quickly hops after it, wielding a boomerang. A troop of gallant knights trample after, charging across a bridge. The bandit dashes uphill into a cherry grove. At the bridge's peak, the scruffy knight halts and watches the bandit dart through two lines of bushes. It hoists its boomerang. Leo scuttles sideways, hurling wildly. The knight's boomerang veers off course. Leo scuttles on. Steadily rising on a stone, the knight takes aim again, itching its paw on the hilt. Leo bolts past the bushes, nearly out of sight of its chaser. The knight's paw grips a hidden lever, then clasps the handle. The projectile soars through Leo's knee and it tumbles into the sand. The hurler tilts its head above its spectacles, then hops and looms over the bandit with the rest of the knights marching near. As the knights file in, Leo pulls out a yo-yo which the knight bats away from its paw. It raises its boomerang at the stricken bandit, who rests on its shell. Maris' unwavering glance stays centered on the exhausted creature. Sap spills from Leo's knee gap, drenching its black fur coat. Its face tilts back onto the palm leaves and its shivering whiskers settle. The knights sheath their tools. Maris examines the fallen bandit then bows to its troop. Maris loops its boomerang belt over its elbow. Its ears and tightens its jaw. The Ford wagon rolls to a halt. In an organized, blue pantry, a child standing near the counter unfolds a map."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Dillinger stands under an overcast sky, gazing at a road stretching across a desolate field. In a farmhouse, his gang changes clothes while a woman brings food. As Dillinger leaves, the woman watches, joined by a little boy in overalls. Meanwhile, in pursuit through lush woods, a clean-cut lawman and armed companions chase an outlaw. The lawman, calm and precise, takes aim and shoots Floyd, who falls in an apple orchard. Despite Floyd's attempt to defend himself, the lawman, Purvis, remains focused, watching Floyd bleed out. As Floyd's life ends, Purvis signals his men, shouldering his rifle with a grim determination. The scene shifts to a white kitchen where a woman folds a newspaper."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "a woman standing near the sink folds a newspaper In a clean white kitchen The Nash sedan comes to a stop Purvis slings his rifle strap over his shoulder His eyes and purses his lips Purvis studies the dead outlaw then nods at his men The lawmen lower their weapons His head falls back on the grass and his convulsing throat muscles come to rest Blood gushes from Floyd's belly wound saturating his white dress shirt Purvis' piercing stare remains fixed on the dying man He aims his rifle at the wounded outlaw who lies on his back As the men arrive Floyd takes out a pistol which the lawman kicks out of his hand The shooter gazes up from his sights then stands and approaches the outlaw with the rest of the men following behind The shot blasts through Floyd's belly and he flops on the grass The lawman's finger engages a secondary trigger then wraps around the main trigger Floyd sprints through the trees almost out of his pursuer's sight the lawman aims again rubbing his finger on the trigger Calmly taking a knee Floyd runs on The lawman's shot misses Floyd runs backwards firing wildly He aims his rifle At the hill's crest the cleancut lawman stops and watches the outlaw run between two rows of trees The outlaw races downhill into an apple orchard A group of armed lawmen follow behind charging up a hill A cleancut man wearing suspenders swiftly moves after him toting a rifle He trips then climbs to his feet and runs on A man in a blue suit hurries through lush green woods with a Tommy gun He faces forward and glances at Red In the car as Red drives Dillinger looks back at Pete Together they wander a few steps without taking their eyes off of him A little boy in overalls comes up and takes her hand As Dillinger turns and walks away from the farmhouse the woman continues to gaze after him They hold eye contact and she let us go The woman stops him Without his overcoat he wears a black vest and a leather gun holster Dillinger walks alone All of the men leave Outside Red puts out a cigarette Pete buttons up next to another escapee A woman wraps food in newspapers and brings it over to their table In a farmhouse gang members change clothes while eating His gaze drifts to a road which cuts through a desolate field toward the flat horizon Strands of his greasy black hair hang over his forehead Dillinger stands below an overcast sky Red peers out the smeared windshield with a solemn expression Gathering himself he sniffs flaring his nostrils and stares forward with a steely gaze"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He faces forward and glances at Red A cleancut man wearing suspenders swiftly moves after him toting a rifle Floyd runs on Dillinger walks alone The outlaw races downhill into an apple orchard All of the men leave Outside Calmly taking a knee The shot blasts through Floyd's belly and he flops on the grass The woman stops him Strands of his greasy black hair hang over his forehead Purvis' piercing stare remains fixed on the dying man His gaze drifts to a road which cuts through a desolate field toward the flat horizon Purvis studies the dead outlaw then nods at his men He aims his rifle Without his overcoat he wears a black vest and a leather gun holster The lawman's finger engages a secondary trigger then wraps around the main trigger As the men arrive Floyd takes out a pistol which the lawman kicks out of his hand His head falls back on the grass and his convulsing throat muscles come to rest a woman standing near the sink folds a newspaper the lawman aims again rubbing his finger on the trigger Floyd sprints through the trees almost out of his pursuer's sight Floyd runs backwards firing wildly At the hill's crest the cleancut lawman stops and watches the outlaw run between two rows of trees He trips then climbs to his feet and runs on A group of armed lawmen follow behind charging up a hill Blood gushes from Floyd's belly wound saturating his white dress shirt Purvis slings his rifle strap over his shoulder His eyes and purses his lips Gathering himself he sniffs flaring his nostrils and stares forward with a steely gaze A man in a blue suit hurries through lush green woods with a Tommy gun Together they wander a few steps without taking their eyes off of him In a clean white kitchen They hold eye contact and she let us go He aims his rifle at the wounded outlaw who lies on his back The Nash sedan comes to a stop Dillinger stands below an overcast sky The lawman's shot misses In a farmhouse gang members change clothes while eating The shooter gazes up from his sights then stands and approaches the outlaw with the rest of the men following behind A woman wraps food in newspapers and brings it over to their table Red puts out a cigarette As Dillinger turns and walks away from the farmhouse the woman continues to gaze after him A little boy in overalls comes up and takes her hand In the car as Red drives Dillinger looks back at Pete Red peers out the smeared windshield with a solemn expression Pete buttons up next to another escapee The lawmen lower their weapons"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The outlaw races downhill into an apple orchard At the hill's crest the cleancut lawman stops and watches the outlaw run between two rows of trees He aims his rifle Floyd runs backwards firing wildly The lawman's shot misses Floyd runs on Calmly taking a knee the lawman aims again rubbing his finger on the trigger Floyd sprints through the trees almost out of his pursuer's sight The lawman's finger engages a secondary trigger then wraps around the main trigger The shot blasts through Floyd's belly and he flops on the grass The shooter gazes up from his sights then stands and approaches the outlaw with the rest of the men following behind As the men arrive Floyd takes out a pistol which the lawman kicks out of his hand He aims his rifle at the wounded outlaw who lies on his back Purvis' piercing stare remains fixed on the dying man Blood gushes from Floyd's belly wound saturating his white dress shirt His head falls back on the grass and his convulsing throat muscles come to rest The lawmen lower their weapons Purvis studies the dead outlaw then nods at his men Purvis slings his rifle strap over his shoulder His eyes and purses his lips The Nash sedan comes to a stop In a clean white kitchen a woman standing near the sink folds a newspaper Gathering himself he sniffs flaring his nostrils and stares forward with a steely gaze Red peers out the smeared windshield with a solemn expression Dillinger stands below an overcast sky Strands of his greasy black hair hang over his forehead His gaze drifts to a road which cuts through a desolate field toward the flat horizon In a farmhouse gang members change clothes while eating A woman wraps food in newspapers and brings it over to their table Pete buttons up next to another escapee Red puts out a cigarette All of the men leave Outside Dillinger walks alone Without his overcoat he wears a black vest and a leather gun holster The woman stops him They hold eye contact and she let us go As Dillinger turns and walks away from the farmhouse the woman continues to gaze after him A little boy in overalls comes up and takes her hand Together they wander a few steps without taking their eyes off of him In the car as Red drives Dillinger looks back at Pete He faces forward and glances at Red A man in a blue suit hurries through lush green woods with a Tommy gun He trips then climbs to his feet and runs on A cleancut man wearing suspenders swiftly moves after him toting a rifle A group of armed lawmen follow behind charging up a hill"
        }
      ]
    }
  ]
}