{
  "ground_truth": "Two other women sit at a table, with one writing and the other looking out the window, while a large man in suspenders peers through the blinds, then turns away and hurries out of the room. Outside, Dillinger and his men step out of their car, greeted by a young blonde woman, whom Dillinger grins at and kisses before they head inside. Later, in a garage, Dillinger sits across from a gunsmith who is disassembling a Tommy gun, removing the trigger handle and pulling out a coil. Outside the window behind the gunsmith, two cars arrive as Red steps out of the safe house. Dillinger glances at the door where the blonde nods to him, prompting him to get up and leave the garage. As Dillinger crosses to the house, he tosses a set of keys to Pete, who joins Red to inspect the new cars. Inside, Dillinger enters the kitchen where a man leans against the refrigerator and a woman smokes at the table. Dillinger washes his hands, hands the man a stuffed envelope, goes around the table, and kisses the woman's cheek before leaving the kitchen. Three men in fedoras and overcoats ascend a wide staircase with two center railings separating them. At the top, Dillinger stops to scan a huge bank with angular walls lined with pillars, then his two cohorts split off. Pete approaches a guard, bashes his face, and knees him in the gut. With Tommy gun in hand, Dillinger gracefully hurtles a counter and grabs a middle-aged man, rips the back of his collar, and parades the bank president around the counter and across the floor, passing a trembling customer. Dillinger pushes the president forward to a metal gate as one of his men collects cash from a teller. The president sorts keys, but Dillinger smacks him in the head with his pistol and points it in his face, prompting the president to return to the door. A robber elbows open a teller cage while the teller frantically gathers cash. Pete hops up on the counter, aiming his machine gun. Outside, Homer discreetly holds a rifle at his side, sees an arriving police car, and backs into a recess by a set of double doors, knocking with the butt of his rifle. Inside the bank, Dillinger waits as the president fills a sack with money from the safe. In a getaway car, Red checks the time on a pocket watch, then drives away. As policemen run across the street toward the bank, Red's car approaches, and Homer casually glances over. Inside, Dillinger pushes the president forward, notices a few dollars in change on the counter, and faces the customer it belongs to.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Two additional females sit at a desk, with one jotting and the other gazing out the pane, while a big man in suspenders peers through the slats, then pivots away and rushes out of the chamber. Outside, Dillinger and his crew step out of their automobile, greeted by a young fair-haired lady, whom Dillinger grins at and smooches before they head indoors. Later, in a workshop, Dillinger sits across from a gunsmith who is disassembling a Tommy gun, removing the trigger handle and pulling out a coil. Outside the glass behind the gunsmith, two automobiles arrive as Red steps out of the safe house. Dillinger glances at the entrance where the blonde nods to him, prompting him to rise and depart the workshop. As Dillinger crosses to the house, he tosses a set of keys to Pete, who joins Red to examine the new automobiles. Inside, Dillinger enters the kitchen where a man leans against the refrigerator and a lady smokes at the desk. Dillinger washes his hands, hands the man a stuffed envelope, goes around the desk, and kisses the lady's cheek before leaving the kitchen. Three men in fedoras and overcoats ascend a wide staircase with two center railings separating them. At the summit, Dillinger stops to scan a vast bank with angular walls lined with columns, then his two comrades split off. Pete approaches a guard, strikes his face, and knees him in the abdomen. With Tommy gun in hand, Dillinger elegantly hurtles a counter and grabs a middle-aged man, rips the back of his collar, and parades the bank president around the counter and across the floor, passing a trembling patron. Dillinger pushes the president onward to a metal gate as one of his men collects cash from a teller. The president sorts keys, but Dillinger smacks him in the head with his pistol and points it in his face, prompting the president to return to the entrance. A bandit elbows open a teller cage while the teller frantically gathers cash. Pete hops up on the counter, aiming his machine gun. Outside, Homer discreetly holds a rifle at his side, sees an arriving police car, and backs into a niche by a set of double portals, knocking with the butt of his rifle. Inside the bank, Dillinger waits as the president fills a sack with currency from the vault. In a getaway car, Red checks the time on a pocket watch, then drives away. As policemen run across the road toward the bank, Red's automobile approaches, and Homer casually glances over. Inside, Dillinger pushes the president onward, notices a few dollars in change on the counter, and faces the patron it belongs to."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Two other women are seated at a table, with one writing and the other looking out the window, while the blinds are peered through by a large man in suspenders, then he turns away and hurries out of the room. Outside, a young blonde woman greets Dillinger and his men as they step out of their car; Dillinger grins at her and kisses her before they head inside. Later, in a garage, a gunsmith sits across from Dillinger and disassembles a Tommy gun, removing the trigger handle and pulling out a coil. Outside the window behind the gunsmith, two cars arrive as the safe house is exited by Red. Dillinger glances at the door where the blonde nods to him, prompting him to rise and leave the garage. As the house is crossed to by Dillinger, a set of keys is tossed to Pete, who joins Red to inspect the new cars. Inside, the kitchen is entered by Dillinger where a man is leaned against the refrigerator and a woman is smoking at the table. Dillinger washes his hands, hands the man a stuffed envelope, circles around the table, and kisses the woman’s cheek before leaving the kitchen. A wide staircase is ascended by three men in fedoras and overcoats, with two center railings separating them. At the top, a huge bank with angular walls lined with pillars is scanned by Dillinger, then his two cohorts split off. A guard is approached by Pete, who bashes his face and knees him in the gut. With a Tommy gun in hand, a counter is gracefully hurtled by Dillinger, and a middle-aged man is grabbed, his collar is ripped from the back, and the bank president is paraded by him around the counter and across the floor, passing a trembling customer. The president is pushed forward by Dillinger to a metal gate as cash is collected by one of his men from a teller. Keys are sorted by the president, but he is smacked in the head with a pistol by Dillinger, who points it in his face, prompting the president to return to the door. A teller cage is elbowed open by a robber while cash is frantically gathered by the teller. Pete hops up on the counter, aiming his machine gun. Outside, a rifle is discreetly held at his side by Homer, who sees an arriving police car and backs into a recess by a set of double doors, knocking with the butt of his rifle. Inside the bank, Dillinger waits while a sack is filled with money from the safe by the president. A pocket watch is checked by Red in a getaway car, then he drives away. As policemen run across the street toward the bank, Red's car is approached, and Homer casually glances over. Inside, the president is pushed forward by Dillinger, who notices a few dollars in change on the counter and faces the customer to whom it belongs."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Two women sit at a table, one writing and the other gazing outside, while a large man in suspenders peers through the blinds and quickly exits the room. Outside, Dillinger meets a young blonde woman, grinning and kissing her before heading inside with his men. In a garage, Dillinger sits across from a gunsmith disassembling a Tommy gun. Outside, two cars arrive as Red leaves the safe house. Dillinger sees the blonde nodding, prompting him to leave. Crossing to the house, he tosses keys to Pete, who joins Red to inspect the new cars. Inside, Dillinger enters the kitchen, hands a stuffed envelope to a man, kisses a woman's cheek, and exits. Three men in fedoras ascend a staircase. At the top, Dillinger stops to scan a large bank. Pete approaches a guard, attacks him, and Dillinger, holding a Tommy gun, jumps a counter, grabs the bank president, and parades him around. Dillinger pushes the president to a metal gate while his men collect cash. When the president sorts keys, Dillinger hits him with his pistol. A robber elbows open a teller cage, and Pete aims his machine gun. Outside, Homer sees a police car, backs into a recess, and knocks with his rifle. Inside, Dillinger waits as the president fills a sack with money. In a getaway car, Red checks a pocket watch and drives off as policemen approach the bank. Inside, Dillinger notices change on a counter and faces a customer."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Two women sit at a table; one writes, the other looks out the window. A large man in suspenders peers through the blinds, then leaves. Outside, Dillinger and his men exit their car, greeted by a young blonde woman. Dillinger grins, kisses her, and they enter. In a garage, Dillinger sits with a gunsmith disassembling a Tommy gun. Outside, two cars arrive as Red leaves the safe house. Dillinger notices the blonde nod and exits, tossing keys to Pete, who joins Red to inspect the cars. Dillinger enters the kitchen, washes his hands, hands a man an envelope, kisses a woman’s cheek, and leaves. Three men in fedoras ascend a staircase; Dillinger scans a bank, then his cohorts split off. Pete attacks a guard. Dillinger leaps a counter with a Tommy gun, grabs the bank president, ripping his collar, and parades him. They reach a metal gate; Dillinger pistol-whips the president, who returns to the door. A robber elbows a teller cage for cash. Pete aims his machine gun on the counter. Outside, Homer discreetly holds a rifle, spots a police car, and hides. Inside, Dillinger waits for the president to fill a sack with money. In a getaway car, Red checks a watch, then drives off as police run toward the bank. Homer watches. Dillinger sees change on the counter and eyes the customer."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Two other women are seated at a table; one of them is diligently writing while the other gazes thoughtfully out the window. Meanwhile, a large man dressed in suspenders peers through the blinds cautiously before quickly turning away and hurrying out of the room. Outside, the atmosphere changes as Dillinger, accompanied by his men, emerges from their car. They are greeted by a young blonde woman, to whom Dillinger offers a wide grin and a warm kiss before they all make their way inside. Later, the setting shifts to a garage where Dillinger is positioned across from a gunsmith. The gunsmith is focused and skillfully disassembling a Tommy gun, taking out the trigger handle and extracting a coil. The scene outside the window behind this meticulous gunsmith reveals two cars pulling up just as Red steps out of the safe house. Dillinger notices the door, where the blonde woman gives him a knowing nod, prompting him to rise and exit the garage. As he makes his way over to the house, he casually tosses a set of keys to Pete, who proceeds to join Red in inspecting the newly arrived cars. Once inside, Dillinger walks into the kitchen, where a man is leaning nonchalantly against the refrigerator, and a woman is smoking leisurely at the table. Dillinger goes to wash his hands, then hands the man a stuffed envelope, moves around the table, and kisses the woman's cheek gently before leaving the kitchen. Meanwhile, three men wearing fedoras and overcoats make their way up a wide staircase, which is distinguished by two center railings that separate them. Upon reaching the top, Dillinger pauses to survey a grandiose bank with its angular walls lined with elegant pillars before his two associates split off in different directions. Pete boldly approaches a guard, strikes his face forcefully, and knees him in the gut, incapacitating him. With a Tommy gun in his hands, Dillinger leaps gracefully over a counter and seizes a middle-aged man by ripping the back of his collar, parading the intimidated bank president around the counter and across the floor, passing by a trembling customer. Dillinger pushes the president forward toward a metal gate as one of his men diligently collects cash from a teller. The president nervously sorts through keys, but Dillinger decisively smacks him on the head with his pistol and points it menacingly in his face, compelling the president to return to the door. A robber, showing no hesitation, elbows open a teller cage while the teller, with frantic movements, gathers cash rapidly. Pete, ever vigilant, hops up on the counter, aiming his machine gun with precision. Outside, Homer discreetly holds a rifle by his side and, upon noticing an approaching police car, strategically backs into a recess positioned by a set of double doors, using the butt of his rifle to knock. Back inside the bank, Dillinger patiently waits as the president fills a sack to the brim with money from the safe. In the getaway car, Red checks the passing time on a pocket watch before driving away swiftly. As policemen sprint across the street toward the bank with urgency, Red's car approaches smoothly, and Homer casts a casual glance over. Inside, Dillinger pushes the president forward again, noticing a few loose dollars in change lying on the counter, and turns his attention to the customer to whom the change belongs."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Seated at a small, unassuming table, there are two other women, each engaged in their own activities; one is writing with careful diligence and focused attention while the other looks thoughtfully, almost dreamily, out of the window, absorbed in her own reflective thoughts. Meanwhile, a large man, who is dressed in suspenders, peers cautiously through the blinds, scanning the outside world before abruptly turning away with a sense of urgency and quickly hurrying out of the room. In contrast to the interior, the atmosphere outside shifts dramatically as Dillinger, together with his loyal men, emerges prominently from their car. They are warmly welcomed by a young blonde woman. Dillinger, full of charm, offers her a wide, friendly grin and a warm, affectionate kiss before they all proceed to make their way inside the building. The scene transitions later to a garage, a place where Dillinger is now positioned directly across from a focused gunsmith. This skilled gunsmith is intently disassembling a Tommy gun with expert precision, removing the trigger handle and carefully extracting a coil. Meanwhile, outside the window behind this meticulous craftsman, the scene reveals two cars pulling up just as Red is seen stepping out of the safe house. Dillinger, always observant, notices the door where the blonde woman gives him a knowing nod. This simple gesture prompts him to rise and exit the garage. As he heads over to the house, he casually tosses a set of keys to Pete, who proceeds to join Red in inspecting the newly arrived vehicles. Once inside the house, Dillinger walks into the kitchen, where a man is leaning nonchalantly against the refrigerator, exhibiting a sense of ease, while a woman sits at the table, smoking leisurely. Dillinger approaches to wash his hands, then hands the man a stuffed envelope before moving around the table to gently kiss the woman's cheek as a farewell gesture before leaving the kitchen. Meanwhile, three men dressed in fedoras and overcoats make their way up a wide, grand staircase, which is uniquely distinguished by two center railings separating them. At the top, Dillinger pauses for a moment to take in the sight of a grandiose bank, its angular walls elegantly lined with classic pillars before his two associates split off in different directions in a coordinated move. Pete, demonstrating boldness, approaches a guard, striking his face with force and delivering a knee to the gut, leaving him incapacitated. With a Tommy gun firmly in hand, Dillinger leaps gracefully over the counter, seizing a middle-aged man by roughly ripping the back of his collar, and parades the intimidated bank president around the counter and across the floor, passing by a customer who is visibly trembling. Dillinger then pushes the president forward toward a metal gate while one of his men, working diligently, collects cash hurriedly from a teller. The nervous president sorts through keys with shaking hands, yet Dillinger decisively smacks him on the head with his pistol and holds it menacingly in his face, compelling him to return and unlock the door. Meanwhile, a robber, with a complete lack of hesitation, elbows open the teller cage while the teller, in a frantic flurry of movement, gathers cash swiftly. Ever vigilant, Pete hops up on the counter, aiming his machine gun with precise intention. Outside the bank, Homer discreetly holds a rifle by his side, and upon noticing an approaching police car, strategically backs into a recessed doorway, using the butt of his rifle to knock as a signal. Back inside, Dillinger waits patiently as the tremulous bank president fills a sack to its capacity with money from the safe. In the getaway car, Red checks the passing time on a pocket watch, noting the urgency before driving away with swiftness. As policemen sprint across the street toward the bank, filled with urgency and purpose, Red's car approaches smoothly, and Homer casts a casual glance over his shoulder. Inside the bank, Dillinger pushes the president forward yet again, noticing a few loose dollars in change lying on the counter and turns his attention to the customer from whom the change came."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Two women are seated at a table, one of them intently focusing on writing as her pen glides across the paper, while the other gazes thoughtfully out the window, her eyes tracing the movement outside. A large man wearing suspenders approaches, his curiosity piqued, and peers through the blinds, squinting slightly to adjust to the light filtering through. After observing for a moment, he decisively turns away, his expression shifting to urgency as he hastily exits the room. Simultaneously, outside the room, Dillinger and his men climb out of their car, their movements coordinated and purposeful. A young blonde woman approaches them, her presence striking and confident. Dillinger meets her gaze, a grin spreading across his face as he leans in and plants a kiss on her lips, a gesture both of greeting and familiarity, before they proceed inside together. In a later scene set within a garage, Dillinger is seated, focused and watching as a skilled gunsmith expertly disassembles a Tommy gun. The gunsmith's hands move with precision, as he carefully removes the trigger handle and meticulously pulls out a coil, each action deliberate and practiced. Meanwhile, outside the window behind the gunsmith, two cars can be seen arriving at the scene as Red exits the safe house with a sense of urgency and purpose. Dillinger, observant and alert, glances towards the door, catching the blonde woman's eye as she nods, signaling something unspoken but understood between them, prompting him to rise from his seat and leave the garage. As he crosses the distance to the house, Dillinger deftly tosses a set of keys to Pete, who catches them with ease and joins Red to scrutinize the new arrivals, their attention keen and appraising. Once inside the house, Dillinger enters the kitchen, where he finds a man casually leaning against the refrigerator, while a woman sits, smoking at the table, her demeanor relaxed and unperturbed. Dillinger heads to the sink to wash his hands, the water cascading over them before he dries them and hands the man a stuffed envelope, its contents not revealed but implying significance. He then circles the table, leaning in to plant a kiss on the woman's cheek, a gesture of familiarity, before leaving the kitchen to continue his mission. Meanwhile, three men, donned in fedoras and overcoats that convey a sense of anonymity and purpose, ascend a wide, grand staircase. The two center railings between them distinctly separate their paths as they march upwards, focused and determined. At the top of the staircase, Dillinger pauses, taking in the expanse of a huge bank with its angular walls adorned by imposing pillars, as he surveys the layout. His sharp eye assesses the scene before his two cohorts strategically diverge, each knowing their role. Pete approaches a guard, his movements swift and calculated as he delivers a blow to the guard's face, incapacitating him before delivering a knee to the gut to ensure compliance. With the fluid grace of someone practiced in such maneuvers, Dillinger, Tommy gun in hand, vaults over a counter with ease, landing smoothly before grabbing a middle-aged man, his grip firm as he tears the back of his collar. He parades the bank president, now his hostage, around the counter and across the floor, their path intersecting with that of a trembling customer who steps back, wide-eyed with fear. Dillinger forcefully pushes the president towards a metal gate as one of his cohorts efficiently collects cash from a teller, the operation running like a well-oiled machine. As the president begins to sort through a set of keys, panic evident in his fumbling movements, Dillinger swiftly smacks him on the head with his pistol, the impact sharp and commanding, as he points the weapon menacingly in the president's face, commanding obedience without words. The president, now fully compliant and motivated by fear, returns to the task of opening the door. Concurrently, a robber uses his elbow to force open a teller cage, the metal door swinging with a creak as the teller inside hurriedly gathers cash, her hands moving with urgency born of fear. Meanwhile, Pete, having hopped up onto the counter, looms large over the scene, his machine gun aimed with a steady hand, ready for any unforeseen threat. Outside, Homer discreetly holds a rifle by his side, his manner calm yet alert. He spots an incoming police car, recognition dawning as he quickly backs into a recessed area by a set of double doors, knocking on the doors with the butt of his rifle to signal his presence to those inside. Within the bank, Dillinger maintains his commanding presence as he waits, watching as the president hurriedly fills a sack with cash taken from the safe, the atmosphere tense and charged with urgency. Meanwhile, in the getaway car stationed outside, Red checks the time on a pocket watch, noting the passage of time with a sharp eye before driving away, every movement calculated to synchronize with the unfolding events. Policemen, responding to the unfolding situation, sprint across the street toward the bank, their sense of duty driving them forward as Red's car approaches with a steady pace. Homer, maintaining his lookout, casts a casual glance over at them, keeping his expression neutral. Inside the bank, Dillinger pushes the president forward, his movements decisive, before noticing a few dollars in change lying on the counter. His eyes flicker to the customer it belongs to, acknowledging their presence with a momentary glance as the orchestrated heist continues to unfold around them."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Two women are seated at a table, one writing and the other gazing out the window, while a large man in suspenders peeks through the blinds and then quickly exits the room. Outside, Dillinger and his crew exit their car, greeted by a young blonde woman. Dillinger smiles, kisses her, and they head inside. Later, in a garage, Dillinger meets with a gunsmith disassembling a Tommy gun. Meanwhile, two cars arrive outside, prompting Red to leave the safe house. Dillinger receives a nod from the blonde at the door, prompting him to leave the garage and toss a set of keys to Pete, who joins Red to inspect the cars. Inside, Dillinger enters the kitchen, washes his hands, gives a stuffed envelope to a man leaning against the refrigerator, and kisses a woman smoking at the table before departing. \n\nThree men in fedoras and overcoats ascend a staircase divided by two railings. At the top, Dillinger pauses to survey a large bank, while his two partners separate. Pete approaches a guard, striking him before Dillinger, wielding a Tommy gun, vaults over a counter to seize and parade the bank president across the floor. Dillinger forces the president to a metal gate while another man collects cash. When the president hesitates, Dillinger hits him with his pistol, urging him to return to the door. A robber elbows a teller cage open as the teller hurriedly gathers money, and Pete positions himself on the counter with his machine gun. Outside, Homer discreetly holds a rifle and spots an incoming police car, prompting him to back into a recess and knock on the double doors with his rifle butt. Inside, Dillinger waits as the president fills a sack with money from the safe. In a getaway car, Red checks his pocket watch before driving off. As police run toward the bank, Red's car approaches with Homer casually observing. Inside, Dillinger continues pushing the president forward, spots a few dollars in change on the counter, and identifies the customer it belongs to."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Two other women sit at a table, with one writing, possibly drafting a letter to a loved one in the days when communication was primarily through mail, and the other looking out the window at the bustling street below, while a large man in suspenders, a common fashion choice in the 1930s for practical and stylistic reasons, peers through the blinds, then turns away and hurries out of the room. Outside, Dillinger, a notorious bank robber from the Great Depression era, and his men step out of their vintage Ford V8 car, greeted by a young blonde woman, whom Dillinger grins at and kisses before they head inside, demonstrating his charisma and audacity. Later, in a garage, an underground workshop where illegal modifications were often made, Dillinger sits across from a gunsmith who is disassembling a Tommy gun, a weapon famously used by criminals during Prohibition, removing the trigger handle and pulling out a coil. Outside the window behind the gunsmith, two cars arrive as Red steps out of the safe house, a hideout well-hidden from law enforcement. Dillinger glances at the door where the blonde, likely acting as a lookout, nods to him, prompting him to get up and leave the garage. As Dillinger crosses to the house, he tosses a set of keys to Pete, one of his trusted gang members, who joins Red to inspect the new cars, possibly stolen or modified for their heist. Inside, Dillinger enters the kitchen where a man leans against the refrigerator, a newly popular household appliance of the time, and a woman smokes at the table, a common habit during this era. Dillinger washes his hands, an unusual act for a man of his reputation, hands the man a stuffed envelope filled with cash, likely from a recent score, goes around the table, and kisses the woman's cheek, showing a softer side before leaving the kitchen. Three men in fedoras and overcoats, attire denoting both style and anonymity of the time's criminals, ascend a wide staircase with two center railings separating them. At the top, Dillinger stops to scan a huge bank designed in the grandiose architecture of the 1920s with angular walls lined with pillars, then his two cohorts split off. Pete approaches a guard, bashes his face, and knees him in the gut, demonstrating the gang's ruthless efficiency. With Tommy gun in hand, Dillinger gracefully hurtles a counter and grabs a middle-aged man, rips the back of his collar, and parades the bank president around the counter and across the floor, passing a trembling customer who is witnessing the infamous scene firsthand. Dillinger pushes the president forward to a metal gate, a barrier to the bank's valuable vault, as one of his men collects cash from a teller under duress. The president sorts keys, but Dillinger smacks him in the head with his pistol used more for intimidation than harm, pointing it in his face, prompting the president to return to the door. A robber elbows open a teller cage, a confined space for securing cash, while the teller frantically gathers cash. Pete hops up on the counter, aiming his machine gun, asserting control over the room. Outside, Homer discreetly holds a rifle at his side, an indication of their prepared escape, sees an arriving police car, and backs into a recess by a set of double doors, knocking with the butt of his rifle to alert his associates. Inside the bank, Dillinger waits as the president fills a sack with money from the safe, the ultimate prize of the heist. In a getaway car, Red checks the time on a pocket watch, a classic timepiece, then drives away with precision timing. As policemen run across the street toward the bank, Red's car approaches in a carefully orchestrated escape plan, and Homer casually glances over, ensuring all is clear. Inside, Dillinger pushes the president forward, notices a few dollars in change on the counter, and faces the customer it belongs to, leaving no detail unattended even in the chaos of the moment."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Three men in fedoras and overcoats ascend a wide staircase with two center railings separating them then his two cohorts split off Two other women sit at a table with one writing and the other looking out the window while a large man in suspenders peers through the blinds then turns away and hurries out of the room Dillinger washes his hands hands the man a stuffed envelope goes around the table and kisses the woman's cheek before leaving the kitchen Two other women sit at a table with one writing and the other looking out the window while a large man in suspenders peers through the blinds then turns away and hurries out of the room Outside Dillinger and his men step out of their car greeted by a young blonde woman whom Dillinger grins at and kisses before they head inside Later in a garage Dillinger sits across from a gunsmith who is disassembling a Tommy gun removing the trigger handle and pulling out a coil at his side sees an arriving police car and backs into a recess by a set of double doors knocking with the butt of his rifle Dillinger glances at the door where the blonde nods to him prompting him to get up and leave the garage Outside the window behind the gunsmith two cars arrive as Red steps out of the safe house Dillinger glances at the door where the blonde nods to him prompting him to get up and leave the garage As Dillinger crosses to the house he tosses a set of keys to Pete who joins Red to inspect the new cars Pete approaches a guard bashes his face and knees him in the gut Inside Dillinger enters the kitchen where a man leans against the refrigerator and a woman smokes at the table Outside Dillinger and his men step out of their car greeted by a young blonde woman whom Dillinger grins at and kisses before they head inside Dillinger washes his hands hands the man a stuffed envelope goes around the table and kisses the woman's cheek before leaving the kitchen Three men in fedoras and overcoats ascend a wide staircase with two center railings separating them At the top Dillinger stops to scan a huge bank with angular walls lined with pillars then his two cohorts split off As policemen run across the street toward the bank Red's car approaches and Homer casually glances over Pete approaches a guard bashes his face and knees him in the gut With Tommy gun in hand Dillinger gracefully hurtles a counter and grabs a middleaged man rips the back of his collar and parades the bank president around the counter and across the floor passing a trembling customer Outside the window behind the gunsmith two cars arrive as Red steps out of the safe house Dillinger pushes the president forward to a metal gate as one of his men collects cash from a teller The president sorts keys but Dillinger smacks him in the head with his pistol and points it in his face prompting the president to return to the door A robber elbows open a teller cage while the teller frantically gathers cash Pete hops up on the counter aiming his machine gun Inside the bank Dillinger waits as the president fills a sack with money from the safe Outside Homer discreetly holds a rifle In a getaway car Red checks the time on a pocket watch then drives away at his side sees an arriving police car and backs into a recess by a set of double doors knocking with the butt of his rifle Inside the bank Dillinger waits as the president fills a sack with money from the safe In a getaway car Red checks the time on a pocket watch then drives away As policemen run across the street toward the bank Red's car approaches and Homer casually glances over Inside Dillinger pushes the president forward notices a few dollars in change on the counter and faces the customer it belongs to"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Two other women sit at a table with one writing and the other looking out the window while a large man in suspenders peers through the blinds then turns away and hurries out of the room. Outside Dillinger and his men step out of their car greeted by a young blonde woman whom Dillinger grins at and kisses before they head inside. Later in a garage Dillinger sits across from a gunsmith who is disassembling a Tommy gun removing the trigger handle and pulling out a coil. Outside the window behind the gunsmith two cars arrive as Red steps out of the safe house. Dillinger glances at the door where the blonde nods to him prompting him to get up and leave the garage. As Dillinger crosses to the house he tosses a set of keys to Pete who joins Red to inspect the new cars. Inside Dillinger enters the kitchen where a man leans against the refrigerator and a woman smokes at the table. Dillinger washes his hands hands the man a stuffed envelope goes around the table and kisses the woman's cheek before leaving the kitchen. Three men in fedoras and overcoats ascend a wide staircase with two center railings separating them. At the top Dillinger stops to scan a huge bank with angular walls lined with pillars. then his two cohorts split off. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Pete approaches a guard bashes his face and knees him in the gut. With Tommy gun in hand Dillinger gracefully hurtles a counter and grabs a middleaged man rips the back of his collar and parades the bank president around the counter and across the floor passing a trembling customer. Dillinger pushes the president forward to a metal gate as one of his men collects cash from a teller. The president sorts keys but Dillinger smacks him in the head with his pistol and points it in his face prompting the president to return to the door. A robber elbows open a teller cage while the teller frantically gathers cash. Pete hops up on the counter aiming his machine gun. Outside Homer discreetly holds a rifle. at his side sees an arriving police car and backs into a recess by a set of double doors knocking with the butt of his rifle. Inside the bank Dillinger waits as the president fills a sack with money from the safe. In a getaway car Red checks the time on a pocket watch then drives away. As policemen run across the street toward the bank Red's car approaches and Homer casually glances over. Inside Dillinger pushes the president forward notices a few dollars in change on the counter and faces the customer it belongs to."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Two other women sit at a table with one writing and the other looking out the window while a large man in suspenders peers through the blinds then turns away and hurries out of the room. Outside Dillinger and his men step out of their car greeted by a young blonde woman whom Dillinger grins at and kisses before they head inside. Later in a garage Dillinger sits across from a gunsmith who is disassembling a Tommy gun removing the trigger handle and pulling out a coil. Outside the window behind the gunsmith two cars arrive as Red steps out of the safe house. Dillinger glances at the door where the blonde nods to him prompting him to get up and leave the garage. As Dillinger crosses to the house he tosses a set of keys to Pete who joins Red to inspect the new cars. Inside Dillinger enters the kitchen where a man leans against the refrigerator and a woman smokes at the table. Dillinger washes his hands hands the man a stuffed envelope goes around the table and kisses the woman's cheek before leaving the kitchen. Three men in fedoras and overcoats ascend a wide staircase with two center railings separating them. At the top Dillinger stops to scan a huge bank with angular walls lined with pillars. then his two cohorts split off. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Pete approaches a guard bashes his face and knees him in the gut. With Tommy gun in hand Dillinger gracefully hurtles a counter and grabs a middleaged man rips the back of his collar and parades the bank president around the counter and across the floor passing a trembling customer. Dillinger pushes the president forward to a metal gate as one of his men collects cash from a teller. The president sorts keys but Dillinger smacks him in the head with his pistol and points it in his face prompting the president to return to the door. A robber elbows open a teller cage while the teller frantically gathers cash. Pete hops up on the counter aiming his machine gun. Outside Homer discreetly holds a rifle. at his side sees an arriving police car and backs into a recess by a set of double doors knocking with the butt of his rifle. Inside the bank Dillinger waits as the president fills a sack with money from the safe. In a getaway car Red checks the time on a pocket watch then drives away. As policemen run across the street toward the bank Red's car approaches and Homer casually glances over. Inside Dillinger pushes the president forward notices a few dollars in change on the counter and faces the customer it belongs to."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Two other women sit at a table with one writing and the other looking out the window while a large man in suspenders peers through the blinds then turns away and hurries out of the room. Outside Dillinger and his men step out of their car greeted by a young blonde woman whom Dillinger grins at and kisses before they head inside. Later in a garage Dillinger sits across from a gunsmith who is disassembling a Tommy gun removing the trigger handle and pulling out a coil. Outside the window behind the gunsmith two cars arrive as Red steps out of the safe house. Dillinger glances at the door where the blonde nods to him prompting him to get up and leave the garage. As Dillinger crosses to the house he tosses a set of keys to Pete who joins Red to inspect the new cars. Outside Homer discreetly holds a rifle. at his side sees an arriving police car and backs into a recess by a set of double doors knocking with the butt of his rifle. Inside the bank Dillinger waits as the president fills a sack with money from the safe. In a getaway car Red checks the time on a pocket watch then drives away. As policemen run across the street toward the bank Red's car approaches and Homer casually glances over. Inside Dillinger pushes the president forward notices a few dollars in change on the counter and faces the customer it belongs to."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Two other women sit at a table with one writing and the other looking out the window while a large man in suspenders peers through the blinds then turns away and hurries out of the room. Outside Dillinger and his men step out of their car greeted by a young blonde woman whom Dillinger grins at and kisses before they head inside. In a getaway car Red checks the time on a pocket watch then drives away. As policemen run across the street toward the bank Red's car approaches and Homer casually glances over. Inside Dillinger pushes the president forward notices a few dollars in change on the counter and faces the customer it belongs to."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Two other dogs sit at a table, with one writing and the other looking out the window, while a large cat in suspenders peers through the blinds, then turns away and hurries out of the room. Outside, a bear and its men step out of their car, greeted by a young blonde giraffe, whom the bear grins at and kisses before they head inside. Later, in a garage, the bear sits across from a dolphin who is disassembling a Tommy gun, removing the trigger handle and pulling out a coil. Outside the window behind the dolphin, two cars arrive as a rabbit steps out of the safe house. The bear glances at the door where the blonde nods to it, prompting it to get up and leave the garage. As the bear crosses to the house, it tosses a set of keys to a shark, who joins the rabbit to inspect the new cars. Inside, the bear enters the kitchen where a turtle leans against the refrigerator and a crow smokes at the table. The bear washes its hands, hands the turtle a stuffed envelope, goes around the table, and kisses the crow's cheek before leaving the kitchen. Three elephants in fedoras and overcoats ascend a wide staircase with two center railings separating them. At the top, the bear stops to scan a huge bank with angular walls lined with pillars, then its two cohorts split off. The shark approaches a guard, bashes its face, and knees it in the gut. With Tommy gun in hand, the bear gracefully hurtles a counter and grabs a middle-aged kangaroo, rips the back of its collar, and parades the bank president around the counter and across the floor, passing a trembling customer. The bear pushes the president forward to a metal gate as one of its men collects cash from a teller. The president sorts keys, but the bear smacks it in the head with its pistol and points it in its face, prompting the president to return to the door. A raccoon elbows open a teller cage while the teller frantically gathers cash. The shark hops up on the counter, aiming its machine gun. Outside, an owl discreetly holds a rifle at its side, sees an arriving police car, and backs into a recess by a set of double doors, knocking with the butt of its rifle. Inside the bank, the bear waits as the president fills a sack with money from the safe. In a getaway car, a fox checks the time on a pocket watch, then drives away. As policemen run across the street toward the bank, the fox's car approaches, and the owl casually glances over. Inside, the bear pushes the president forward, notices a few dollars in change on the counter, and faces the customer it belongs to."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Two other women sit on a bench, with one sketching and the other gazing at a painting, while a large man in overalls peers through the curtains, then turns away and hurries out of the gallery. Outside, Dillinger and his men step out of their motorcycle, greeted by a young brunette woman, whom Dillinger grins at and hugs before they head inside. Later, in a workshop, Dillinger sits across from a locksmith who is disassembling a drill, removing the handle grip and pulling out a wire. Outside the window behind the locksmith, two bicycles arrive as Red steps out of the shelter. Dillinger glances at the gate where the brunette nods to him, prompting him to get up and leave the workshop. As Dillinger crosses to the shelter, he tosses a set of scissors to Pete, who joins Red to inspect the new bicycles. Inside, Dillinger enters the dining room where a man leans against the bookshelf and a woman knits at the table. Dillinger washes his hands, hands the man a stamped envelope, goes around the table, and kisses the woman's forehead before leaving the dining room. Three men in berets and raincoats descend a wide escalator with two center railings separating them. At the bottom, Dillinger stops to scan a huge library with curved walls lined with shelves, then his two cohorts split off. Pete approaches a librarian, punches his shoulder, and elbows him in the chest. With drill in hand, Dillinger gracefully jumps over a book cart and grabs a middle-aged man, rips the back of his vest, and parades the librarian around the book cart and across the aisle, passing a trembling reader. Dillinger pushes the librarian forward to a wooden gate as one of his men collects books from a shelf. The librarian sorts access cards, but Dillinger smacks him in the head with his wrench and points it in his face, prompting the librarian to return to the desk. A robber elbows open a storage cabinet while the assistant frantically gathers books. Pete hops up on the book cart, aiming his cordless drill. Outside, Homer discreetly holds a fishing rod at his side, sees an approaching taxi, and backs into a nook by a set of glass doors, knocking with the butt of his rod. Inside the library, Dillinger waits as the librarian fills a backpack with novels from the vault. On a tandem bike, Red checks the time on a sundial, then pedals away. As deliverymen run across the street toward the library, Red's bike approaches, and Homer casually glances over. Inside, Dillinger pushes the librarian forward, notices a few cents in coins on the cart, and faces the reader it belongs to."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Two other women recline at a table, with one sketching and the other gazing at the window, while a large man in suspenders squats through the blinds, then spins around and strolls out of the room. Outside, Dillinger and his men glide out of their car, approached by a young blonde woman, whom Dillinger nods at and pats before they drift inside. Later, in a garage, Dillinger reclines across from a gunsmith who is polishing a Tommy gun, adjusting the trigger handle and twisting out a coil. Outside the window behind the gunsmith, two cars pause as Red whistles out of the safe house. Dillinger squints at the door where the blonde waves to him, prompting him to sit down and exit the garage. As Dillinger dances to the house, he flips a set of keys to Pete, who jogs over to join Red to polish the new cars. Inside, Dillinger enters the kitchen where a man perches against the refrigerator and a woman lounges at the table. Dillinger dries his hands, shows the man a stuffed envelope, spins around the table, and pats the woman's cheek before departing the kitchen. Three men in fedoras and overcoats slide up a wide staircase with two center railings separating them. At the top, Dillinger pauses to admire a huge bank with angular walls lined with pillars, then his two cohorts wander off. Pete approaches a guard, flicks his nose, and taps him in the gut. With Tommy gun in hand, Dillinger elegantly hops a counter and nudges a middle-aged man, tugs the back of his collar, and dances the bank president around the counter and across the floor, bypassing a trembling customer. Dillinger nudges the president forward to a metal gate as one of his men counts cash from a teller. The president jumbles keys, but Dillinger taps him in the head with his pistol and waves it in his face, prompting the president to shuffle to the door. A robber taps open a teller cage while the teller nervously arranges cash. Pete lounges on the counter, spinning his machine gun. Outside, Homer subtly balances a rifle at his side, spots an approaching police car, and drifts into a recess by a set of double doors, tapping with the butt of his rifle. Inside the bank, Dillinger observes as the president piles a sack with money from the safe. In a getaway car, Red taps the time on a pocket watch, then veers away. As policemen stroll across the street toward the bank, Red's car drifts, and Homer leisurely glances over. Inside, Dillinger nudges the president forward, notices a handful of change on the counter, and gazes at the customer it belongs to."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Two other giraffes sit at a hammock, with one painting and the other looking at the clock, while a tiny child in roller skates peers through the curtains, then turns away and skips out of the closet. Outside, a parrot and its owls step out of their helicopter, greeted by a tall green apple, whom the parrot winks at and hugs before they head uphill. Later, in an igloo, the parrot sits across from a chef who is disassembling a bicycle, removing the pedals and pulling out a spring. Outside the balcony behind the chef, two bicycles arrive as Blue stumbles out of the train station. The parrot glances at the window where the green apple waves to it, prompting it to stand up and leave the igloo. As the parrot crosses to the barn, it tosses a set of marbles to Spike, who joins Blue to inspect the new bicycles. Inside, the parrot enters the garden where a woman leans against the bookshelf and a toddler knits at the desk. The parrot washes its feet, hands the woman a stuffed folder, goes around the hammock, and taps the toddler's nose before leaving the garden. Three mice in sombreros and raincoats descend a narrow ladder with two side ropes separating them. At the bottom, the parrot stops to scan a tiny park with circular bushes lined with lampposts, then its two kangaroos split off. Spike approaches a lamp, flicks its handle, and taps it on the base. With bicycle chain in hand, the parrot slowly tiptoes over a bush and grabs a young rabbit, rips the tip of its hat, and parades the rabbit farmer around the bush and across the sand, passing a yawning turtle. The parrot pushes the farmer backward to a plastic fence as one of its owls counts apples from a waiter. The farmer opens envelopes, but the parrot taps it on the elbow with its fork and waves it in front of its tail, prompting the farmer to return to the window. A burglar nudges open a waiter bin while the waiter quietly stacks apples. Spike crawls under the bush, nodding his fishing rod. Outside, Buddy loudly holds a lamp post to his leg, spots a retreating ambulance, and ducks into a closet by a pair of glass windows, tapping with the stick of his lamp. Inside the park, the parrot waits as the farmer stuffs a backpack with oranges from the cupboard. In a bicycle, Blue checks the temperature on a calendar, then flies away. As artists jog across the bridge toward the park, Blue's bicycle approaches, and Buddy slowly smiles over. Inside, the parrot shoves the farmer sideways, notices a pile of pebbles in a bag on the bush, and glances at the meadow it belongs to."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Two other dancers perch at a tree stump, with one sketching and the other whistling at the ceiling, while a small child in pajamas fiddles with the curtains, then skips away and tiptoes out of the tent. Outside, Wilhelmina and her cats hop out of their wagon, greeted by a tall redhead man, whom Wilhelmina winks at and waves before they wander inside. Later, in a garden, Wilhelmina stands across from a seamstress who is organizing a leather jacket, stitching the sleeve hem and threading a needle. Outside the window behind the seamstress, two bikes roll in as Blue emerges from the cabin. Wilhelmina peers at the roof where the redhead claps to her, prompting her to stretch and exit the garden. As Wilhelmina dances to the barn, she throws a bouquet of flowers to Sam, who meets Blue to admire the sleek bikes. Inside, Wilhelmina enters the parlor where a boy leans against the bookshelf and a girl reads at the counter. Wilhelmina dries her glasses, gives the boy a battered notebook, circles around the counter, and pats the girl's shoulder before exiting the parlor. Three women in bonnets and shawls climb a narrow ladder with a single chain link dangling beside them. At the peak, Wilhelmina stops to observe a vast ship with curvy sails lined with ropes, then her two companions branch off. Sam greets a sailor, slaps his back, and elbows him in the side. With handbag in hand, Wilhelmina artfully hops a bench and nudges a young boy, tears the front of his jacket, and escorts the cabin boy around the bench and along the hallway, passing a giggling child. Wilhelmina nudges the cabin boy onward to a wooden hatch as one of her companions gathers maps from a desk. The cabin boy arranges papers, but Wilhelmina taps him on the knee with her umbrella and gestures at his notebook, urging the boy to return to his corner. An adventurer kicks open a treasure chest while the looker anxiously counts maps. Sam stands on the bench, aiming his water pistol. Outside, Tom quietly hoists a telescope at his chest, notices a passing fishing boat, and slides into a nook by a set of iron gates, tapping with the lens of his telescope. Inside the cabin, Wilhelmina pauses as the cabin boy loads a satchel with scrolls from the locker. In a departure canoe, Blue checks the compass on a string, then paddles away. As sailors stroll across the deck toward the cabin, Blue's canoe glides forward, and Tom wistfully peers around. Inside, Wilhelmina nudges the cabin boy onward, spots a few maps on the bench, and faces the child they belong to."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Two other women perch on a bench, with one sketching and the other gazing into the garden, while a large man in overalls sips from his mug, then wanders away and dances out of the chamber. Outside, Dillinger and his men hop out of their wagon, greeted by a young brunette woman, whom Dillinger winks at and twirls before they drift inside. Later, in a workshop, Dillinger lounges across from a blacksmith who is assembling a crossbow, installing the string handle and inserting a spring. Outside the garden behind the blacksmith, two bicycles arrive as Red climbs out of the hideout. Dillinger peers at the gate where the brunette winks to him, prompting him to rise and wander away from the workshop. As Dillinger strides to the cottage, he flings a map to Pete, who joins Red to admire the new bicycles. Inside, Dillinger enters the pantry where a man perches against the freezer and a woman sketches at the counter. Dillinger dries his hands, tosses the man a crumpled note, strolls around the counter, and brushes the woman's hair before exiting the pantry. Three men in bowler hats and raincoats descend a narrow ladder with two side ropes guiding them. At the bottom, Dillinger pauses to study a vast factory with twisted beams lined with arches, then his two associates branch off. Pete approaches a sentinel, taps his shoulder, and elbows him in the ribs. With crossbow in hand, Dillinger swiftly vaults a barrier and clasps a middle-aged woman, tugs the hem of her sleeve, and escorts the bank manager around the barrier and across the room, bypassing a quivering employee. Dillinger nudges the manager onward to a wooden fence as one of his men gathers tickets from a clerk. The manager sifts papers, but Dillinger pats him on the shoulder with his dagger and nods at his face, prompting the manager to return to the fence. A thief nudges open a clerk's hatch while the clerk frantically scribbles notes. Pete bounces up on the barrier, brandishing his harpoon. Outside, Homer stealthily grips a baton at his waist, notices a departing fire truck, and slides into a niche by a set of barn doors, tapping with the end of his baton. Inside the bank, Dillinger pauses as the manager fills a pouch with jewels from the vault. In a getaway carriage, Red checks the time on a sand timer, then rolls away. As firemen jog across the lawn toward the bank, Red's carriage rolls near, and Homer lazily glances over. Inside, Dillinger nudges the manager forward, notices a handful of marbles on the barrier, and faces the employee it belongs to."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Two different lizards perch on a log, with one drawing and the other staring at the moon, while a petite frog in a vest peers through the curtains, then spins around and skips out of the cave. Outside, Babbage and his crew hop out of their wagon, greeted by a young brunette tiger, whom Babbage frowns at and hugs before they march outside. Later, in a barn, Babbage squats across from a carpenter who is assembling a banjo, attaching the string neck and pushing in a spring. Outside the doorway behind the carpenter, two wagons stop as Blue rolls out of the treehouse. Babbage gazes at the gate where the brunette shakes her head to him, prompting him to stand and enter the barn. As Babbage trots to the shed, he throws a pair of gloves to Max, who joins Blue to repair the rusty wagons. Inside, Babbage greets the pantry where a rabbit slouches against the freezer and a goat chews at the stump. Babbage wipes his feet, tosses the rabbit a thick manuscript, circles the stump, and pats the goat's horn before exiting the pantry. Three owls in bowler hats and cloaks descend a narrow tunnel with two side steps separating them. At the bottom, Babbage halts to stare at a tiny library with twisted roots lined with shelves, then his two companions drift off. Max greets a bouncer, pats his shoulder, and taps him on the toe. With banjo in hand, Babbage awkwardly slides under a table and seizes an elderly donkey, tears the hem of his jacket, and twirls the library manager around the table and across the room, passing a shaking visitor. Babbage nudges the manager backward to a wooden fence as one of his mates gathers apples from a basket. The manager flips pages, but Babbage pinches him on the nose with his banjo and waves it in his face, prompting the manager to step forward to the bookcase. A thief pushes open a bookshelf while the librarian nervously arranges scrolls. Max jumps up on the table, aiming his whistle. Outside, Dexter quietly clutches a sword at his waist, spots an approaching van, and slips into a nook by a set of sliding panels, tapping with the hilt of his sword. Inside the library, Babbage waits as the manager fills a satchel with scrolls from the chest. In a departure coach, Blue notes the time on a sundial, then gallops onward. As constables dash along the meadow toward the library, Blue's coach edges forward, and Dexter nonchalantly observes. Inside, Babbage nudges the manager onward, detects a handful of pebbles in dust on the table, and addresses the visitor it belongs to."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Two women sit at a table, one writing and the other looking out the window, as a large man peeks through the blinds and leaves. Outside, Dillinger arrives with his men, greets a young blonde, and enters a garage to meet a gunsmith dismantling a Tommy gun. Spotting cars arriving outside, Dillinger leaves, tossing keys to Pete, who checks the cars with Red. Inside, Dillinger gives a man a stuffed envelope and kisses a woman's cheek before leaving the kitchen. Three men in fedoras ascend a staircase. Dillinger surveys a bank, then splits from his men. Pete assaults a guard, and Dillinger, wielding a Tommy gun, captures the bank president, parading him across the floor. Dillinger forces the president to open a gate as his men collect cash. Outside, Homer watches a police car arrive and hides. Inside, the president fills a sack with money while Red waits in the getaway car. As police approach, Homer watches, and Dillinger takes the last bit of change from a counter before leaving."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Inside Dillinger pushes the president forward notices a few dollars in change on the counter and faces the customer it belongs to As policemen run across the street toward the bank Red's car approaches and Homer casually glances over In a getaway car Red checks the time on a pocket watch then drives away Inside the bank Dillinger waits as the president fills a sack with money from the safe at his side sees an arriving police car and backs into a recess by a set of double doors knocking with the butt of his rifle Outside Homer discreetly holds a rifle Pete hops up on the counter aiming his machine gun A robber elbows open a teller cage while the teller frantically gathers cash The president sorts keys but Dillinger smacks him in the head with his pistol and points it in his face prompting the president to return to the door Dillinger pushes the president forward to a metal gate as one of his men collects cash from a teller With Tommy gun in hand Dillinger gracefully hurtles a counter and grabs a middleaged man rips the back of his collar and parades the bank president around the counter and across the floor passing a trembling customer Pete approaches a guard bashes his face and knees him in the gut then his two cohorts split off At the top Dillinger stops to scan a huge bank with angular walls lined with pillars Three men in fedoras and overcoats ascend a wide staircase with two center railings separating them Dillinger washes his hands hands the man a stuffed envelope goes around the table and kisses the woman's cheek before leaving the kitchen Inside Dillinger enters the kitchen where a man leans against the refrigerator and a woman smokes at the table As Dillinger crosses to the house he tosses a set of keys to Pete who joins Red to inspect the new cars Dillinger glances at the door where the blonde nods to him prompting him to get up and leave the garage Outside the window behind the gunsmith two cars arrive as Red steps out of the safe house Later in a garage Dillinger sits across from a gunsmith who is disassembling a Tommy gun removing the trigger handle and pulling out a coil Outside Dillinger and his men step out of their car greeted by a young blonde woman whom Dillinger grins at and kisses before they head inside Two other women sit at a table with one writing and the other looking out the window while a large man in suspenders peers through the blinds then turns away and hurries out of the room"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Pete hops up on the counter aiming his machine gun A robber elbows open a teller cage while the teller frantically gathers cash Later in a garage Dillinger sits across from a gunsmith who is disassembling a Tommy gun removing the trigger handle and pulling out a coil The president sorts keys but Dillinger smacks him in the head with his pistol and points it in his face prompting the president to return to the door As Dillinger crosses to the house he tosses a set of keys to Pete who joins Red to inspect the new cars Dillinger pushes the president forward to a metal gate as one of his men collects cash from a teller Outside Homer discreetly holds a rifle With Tommy gun in hand Dillinger gracefully hurtles a counter and grabs a middleaged man rips the back of his collar and parades the bank president around the counter and across the floor passing a trembling customer Inside Dillinger pushes the president forward notices a few dollars in change on the counter and faces the customer it belongs to Inside Dillinger enters the kitchen where a man leans against the refrigerator and a woman smokes at the table At the top Dillinger stops to scan a huge bank with angular walls lined with pillars Outside Dillinger and his men step out of their car greeted by a young blonde woman whom Dillinger grins at and kisses before they head inside Inside the bank Dillinger waits as the president fills a sack with money from the safe Pete approaches a guard bashes his face and knees him in the gut then his two cohorts split off As policemen run across the street toward the bank Red's car approaches and Homer casually glances over Dillinger glances at the door where the blonde nods to him prompting him to get up and leave the garage at his side sees an arriving police car and backs into a recess by a set of double doors knocking with the butt of his rifle Dillinger washes his hands hands the man a stuffed envelope goes around the table and kisses the woman's cheek before leaving the kitchen Three men in fedoras and overcoats ascend a wide staircase with two center railings separating them Two other women sit at a table with one writing and the other looking out the window while a large man in suspenders peers through the blinds then turns away and hurries out of the room Outside the window behind the gunsmith two cars arrive as Red steps out of the safe house In a getaway car Red checks the time on a pocket watch then drives away"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "With Tommy gun in hand Dillinger gracefully hurtles a counter and grabs a middleaged man rips the back of his collar and parades the bank president around the counter and across the floor passing a trembling customer Dillinger pushes the president forward to a metal gate as one of his men collects cash from a teller The president sorts keys but Dillinger smacks him in the head with his pistol and points it in his face prompting the president to return to the door A robber elbows open a teller cage while the teller frantically gathers cash Pete hops up on the counter aiming his machine gun Outside Homer discreetly holds a rifle at his side sees an arriving police car and backs into a recess by a set of double doors knocking with the butt of his rifle Inside the bank Dillinger waits as the president fills a sack with money from the safe In a getaway car Red checks the time on a pocket watch then drives away As policemen run across the street toward the bank Red's car approaches and Homer casually glances over Inside Dillinger pushes the president forward notices a few dollars in change on the counter and faces the customer it belongs to Two other women sit at a table with one writing and the other looking out the window while a large man in suspenders peers through the blinds then turns away and hurries out of the room Outside Dillinger and his men step out of their car greeted by a young blonde woman whom Dillinger grins at and kisses before they head inside Later in a garage Dillinger sits across from a gunsmith who is disassembling a Tommy gun removing the trigger handle and pulling out a coil Outside the window behind the gunsmith two cars arrive as Red steps out of the safe house Dillinger glances at the door where the blonde nods to him prompting him to get up and leave the garage As Dillinger crosses to the house he tosses a set of keys to Pete who joins Red to inspect the new cars Inside Dillinger enters the kitchen where a man leans against the refrigerator and a woman smokes at the table Dillinger washes his hands hands the man a stuffed envelope goes around the table and kisses the woman's cheek before leaving the kitchen Three men in fedoras and overcoats ascend a wide staircase with two center railings separating them At the top Dillinger stops to scan a huge bank with angular walls lined with pillars then his two cohorts split off Pete approaches a guard bashes his face and knees him in the gut"
        }
      ]
    }
  ]
}