{
  "ground_truth": "Alvin nods and heads off as Pete and Homer swagger off. Dillinger leans toward Red, who eyes the brunette in the red dress as she returns to her table. Anna leads a young woman to Red, then follows Red and Veronica as they stroll away, leaving Dillinger alone. He stares at the brunette in the red dress, who laughs and beams. The gang leader sips his drink and stands, keeping his eyes locked on the exotic woman. He strides resolutely through the crowd, halts just behind her, and leans onto her chair. She looks up at him, and he gives his head a stunned shake. Her bright red lips smile coyly, and she grins at the other women seated at her table before sashaying off with Dillinger. He warily locks eyes with her, then looks away. Billie leads the way to the dance floor, where he takes her hand, and she places her other hand on his shoulder. They sway together as Billie smiles. Dillinger gazes off shyly, then finds her lovely face, and Billie stares back defiantly. Her dark eyes probe his as they sway with the music, and she allows a faint smile. Dillinger summons up a breath and arches his brows, and her smile broadens. On stage, the songstress gazes out over the crowded dance floor. Later, Billie and Dillinger stride through the club's foyer, with Billie wrapping her crimson jacket tight around her body. They step outside, and she winces against a gust of wind as Dillinger turns her to face him and drapes his overcoat over her shoulders. She grins bashfully and continues down the sidewalk with his jacket and arm around her. In an elegant restaurant later, Billie uneasily scans her surroundings, then looks to Dillinger, smiles, and glances at a female diner. The snobbish woman gives her the eye, and Billie's smile briefly falters. Dillinger flashes an amused smile and sits back but then breaks off, eyeing another table. Billie and Dillinger lock gazes, and under Billie's thick, dark eyelashes and graceful nose, a faint smile curls the corners of her lips. Dillinger stands and holds her chair as she gets up, then guides her through the restaurant with a hand at her back until they face a coat check counter. At a bar, a stocky man with slicked-back hair notices them. Dillinger glances at the man over his shoulder, then leans toward Billie and steps away. Billie, irritably shifting her gaze, then glares at him and yanks on her coat before she storms out. The two men shake hands as Nitti, a lean man with dark, slick hair and a handlebar mustache, slouches as he eats. A short, husky man with olive skin and a toothbrush mustache approaches Dillinger, and they shake hands before D'Andrea leaves.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Alvin inclines and departs as Pete and Homer strut away. Dillinger tilts toward Red, who observes the brunette in the crimson gown as she returns to her table. Anna guides a youthful lady to Red, then follows Red and Veronica as they amble away, leaving Dillinger solitary. He gazes at the brunette in the scarlet attire, who chuckles and gleams. The crew chief sips his beverage and rises, maintaining his eyes fixed on the exotic lady. He strides determinedly through the throng, pauses just behind her, and leans onto her seat. She glances up at him, and he gives his head a bewildered shake. Her bright red lips smile coyly, and she grins at the other ladies seated at her table before gliding off with Dillinger. He cautiously locks eyes with her, then glances away. Billie leads the way to the dance floor, where he takes her hand, and she places her other hand on his shoulder. They sway together as Billie smiles. Dillinger gazes off shyly, then finds her charming visage, and Billie stares back defiantly. Her dark eyes probe his as they sway with the melody, and she permits a faint smile. Dillinger draws up a breath and arches his brows, and her smile broadens. On stage, the vocalist gazes out over the crowded dance floor. Later, Billie and Dillinger stride through the club's foyer, with Billie wrapping her crimson jacket snug around her form. They step outside, and she winces against a gust of wind as Dillinger turns her to face him and drapes his overcoat over her shoulders. She grins bashfully and continues down the sidewalk with his jacket and arm around her. In an elegant bistro later, Billie uneasily scans her surroundings, then looks to Dillinger, smiles, and glances at a female patron. The haughty woman gives her the eye, and Billie's smile briefly falters. Dillinger flashes an amused smile and reclines but then breaks off, eyeing another table. Billie and Dillinger lock gazes, and under Billie's thick, dark eyelashes and graceful nose, a faint smile curls the corners of her lips. Dillinger stands and holds her chair as she rises, then guides her through the bistro with a hand at her back until they face a coat check counter. At a bar, a stout man with slicked-back hair notices them. Dillinger glances at the man over his shoulder, then leans toward Billie and steps away. Billie, irritably shifting her gaze, then glares at him and tugs on her coat before she storms out. The two men shake hands as Nitti, a lean man with dark, slick hair and a handlebar mustache, slouches as he eats. A short, burly man with olive skin and a toothbrush mustache approaches Dillinger, and they shake hands before D'Andrea departs."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Alvin is nodded at, and off he is headed as Pete and Homer swagger off. Red is leaned toward by Dillinger, while the brunette in the red dress is eyed by him as she returns to her table. A young woman is led to Red by Anna, then Red and Veronica are followed by her as they stroll away, leaving Dillinger alone. The brunette in the red dress is stared at by him, who is laughed and beamed at. His drink is sipped by the gang leader, and he stands, keeping his eyes locked on the exotic woman. The crowd is resolutely strode through by him, and just behind her he is halted, leaning onto her chair. Up at him she looks, and a stunned shake is given by his head. Her bright red lips are smiled coyly, and at the other women seated at her table she grins before Dillinger is sashayed off with by her. Her eyes are warily locked with by him, then away he looks. The way to the dance floor is led by Billie, where her hand is taken by him, and his shoulder is touched by her other hand. Together they are swayed as Billie smiles. Off shyly he gazes, then her lovely face is found, and defiantly back he is stared at by Billie. Into his dark eyes her gaze probes as, with the music, they sway, and a faint smile is allowed by her. A breath is summoned up by Dillinger and his brows are arched, and broader her smile becomes. Over the crowded dance floor, the songstress gazes out from the stage. Later, through the club's foyer, Billie and Dillinger are strode, with her crimson jacket wrapped tight around her body by Billie. Outside they step, and against a gust of wind she winces as to face him she is turned by Dillinger, and then his overcoat is draped over her shoulders. She is grinned at bashfully and down the sidewalk with his jacket and arm around her she continues. In an elegant restaurant later, her surroundings are uneasily scanned by Billie, then to Dillinger she looks, smiles, and at a female diner she glances. The eye is given to her by the snobbish woman, and briefly her smile falters. An amused smile is flashed by Dillinger and he sits back but then breaks off, another table being eyed by him. Billie and Dillinger's gazes are locked, and under Billie's thick, dark eyelashes and graceful nose, the corners of her lips are curled into a faint smile. Her chair is held by Dillinger as she gets up, then through the restaurant she is guided by him with a hand at her back until a coat check counter is faced. A stocky man with slicked-back hair notices them at a bar. Over his shoulder Dillinger glances at the man, then toward Billie he leans and steps away. Irritably her gaze is shifted by Billie, then at him she glares and on her coat she yanks before out she storms. Hands are shaken by the two men as Nitti, a lean man with dark, slick hair and a handlebar mustache, slouches and eats. Dillinger is approached by a short, husky man with olive skin and a toothbrush mustache, and hands are shaken before D'Andrea leaves."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Alvin nods and departs as Pete and Homer swagger away. Dillinger leans toward Red, who watches the brunette in the red dress return to her table. Anna brings a young woman to Red, then follows Red and Veronica as they leave, leaving Dillinger alone. He stares at the brunette, who laughs and beams. The gang leader sips his drink, stands, and keeps his eyes on the exotic woman. He strides through the crowd, stops behind her, and leans on her chair. She looks up, and he shakes his head in surprise. Her red lips smile coyly, and she grins at the other women before leaving with Dillinger. He locks eyes with her, then looks away. Billie leads them to the dance floor, where he takes her hand, and she places her other hand on his shoulder. They sway as Billie smiles. Dillinger shyly gazes off, then finds her face, and Billie stares back defiantly. Her dark eyes probe his as they sway, and she allows a faint smile. Dillinger takes a breath and arches his brows, and her smile broadens. On stage, the songstress gazes over the dance floor. Later, Billie and Dillinger walk through the club's foyer, with Billie wrapping her crimson jacket around her. They step outside, and she winces against the wind as Dillinger turns her to face him and drapes his overcoat over her shoulders. She grins bashfully and continues down the sidewalk with his jacket and arm around her. In a restaurant later, Billie scans her surroundings, then looks to Dillinger, smiles, and glances at a female diner. The snobbish woman gives her the eye, and Billie's smile briefly falters. Dillinger smiles and sits back but then eyes another table. Billie and Dillinger lock gazes, and under Billie's dark eyelashes and graceful nose, a faint smile curls her lips. Dillinger stands and holds her chair as she gets up, then guides her through the restaurant with a hand at her back to a coat check counter. At a bar, a stocky man with slicked-back hair notices them. Dillinger glances at the man, then leans toward Billie and steps away. Billie, irritably shifting her gaze, glares at him and yanks on her coat before storming out. The two men shake hands as Nitti, a lean man with dark hair and a handlebar mustache, slouches as he eats. A short, husky man with olive skin and a toothbrush mustache approaches Dillinger, and they shake hands before D'Andrea leaves."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Alvin nods and departs as Pete and Homer swagger away. Dillinger leans toward Red, who watches the brunette in the red dress return to her table. Anna leads a young woman to Red, then follows Red and Veronica as they leave, leaving Dillinger alone. He stares at the brunette, who laughs and beams. The gang leader sips his drink, stands, and approaches her, leaning onto her chair. She looks up, and he shakes his head in surprise. Her red lips smile coyly, and she grins at her companions before leaving with Dillinger. He locks eyes with her, then looks away. Billie leads him to the dance floor, where they sway together. Dillinger shyly gazes at her, and Billie stares back defiantly. Her dark eyes probe his, and she smiles faintly. Dillinger arches his brows, and her smile broadens. On stage, the songstress watches the dance floor. Later, Billie and Dillinger leave the club, with Billie wrapping her jacket tightly. Outside, she winces against the wind as Dillinger drapes his overcoat over her shoulders. She grins bashfully and continues down the sidewalk with his arm around her. In a restaurant, Billie scans her surroundings, smiles at Dillinger, and glances at a female diner. The woman gives her a look, and Billie's smile falters. Dillinger smiles and sits back, then eyes another table. Billie and Dillinger lock gazes, and she smiles faintly. Dillinger stands, holds her chair, and guides her to the coat check. At a bar, a stocky man notices them. Dillinger glances at him, leans toward Billie, and steps away. Billie glares, yanks on her coat, and storms out. Two men shake hands as Nitti, a lean man with slick hair and a mustache, eats. A short, husky man approaches Dillinger, and they shake hands before D'Andrea leaves."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Alvin gives a nod of understanding and heads off in one direction, while Pete and Homer, with a confident swagger, make their way in another. Meanwhile, Dillinger leans in closer to Red, who is intently watching the brunette in the striking red dress as she makes her way back to her table. Anna, with a gentle guiding hand, leads a young woman over to Red, and then she follows alongside Red and Veronica as they casually stroll away, leaving Dillinger standing alone. His gaze remains fixed on the brunette in the red dress, who is laughing and beaming with joy. The gang leader takes a sip from his drink, stands up, and keeps his eyes locked on the exotic woman. With determination, he strides through the bustling crowd, coming to a stop just behind her, and leans onto her chair. She looks up at him, and he gives his head a stunned shake in response. Her bright red lips form a coy smile, and she grins at the other women seated at her table before she sashays off with Dillinger. He warily locks eyes with her, then looks away momentarily. Billie leads the way to the dance floor, where he takes her hand, and she places her other hand gently on his shoulder. Together, they sway to the music as Billie smiles warmly. Dillinger gazes off shyly into the distance, then finds her lovely face, and Billie stares back at him defiantly. Her dark eyes probe his as they continue to sway with the rhythm of the music, and she allows a faint smile to appear. Dillinger summons up a deep breath and arches his brows, and her smile broadens in response. On stage, the songstress gazes out over the crowded dance floor, taking in the scene. Later, Billie and Dillinger stride through the club's foyer, with Billie wrapping her crimson jacket tightly around her body. They step outside into the night, and she winces against a sudden gust of wind as Dillinger turns her to face him and drapes his overcoat over her shoulders. She grins bashfully and continues down the sidewalk with his jacket and arm wrapped around her. In an elegant restaurant later, Billie uneasily scans her surroundings, then looks to Dillinger, smiles, and glances at a female diner. The snobbish woman gives her a disdainful look, and Billie's smile briefly falters. Dillinger flashes an amused smile and sits back, but then he breaks off, eyeing another table with interest. Billie and Dillinger lock gazes, and under Billie's thick, dark eyelashes and graceful nose, a faint smile curls the corners of her lips. Dillinger stands and holds her chair as she gets up, then guides her through the restaurant with a gentle hand at her back until they reach a coat check counter. At a nearby bar, a stocky man with slicked-back hair notices them. Dillinger glances at the man over his shoulder, then leans toward Billie and steps away. Billie, irritably shifting her gaze, then glares at him and yanks on her coat before she storms out. The two men shake hands as Nitti, a lean man with dark, slick hair and a handlebar mustache, slouches as he eats. A short, husky man with olive skin and a toothbrush mustache approaches Dillinger, and they shake hands before D'Andrea leaves."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Alvin, with a subtle nod of understanding that conveys his agreement, heads off purposefully in one direction, while Pete and Homer, exuding confidence with their assured swagger, make their way in a different direction altogether. Meanwhile, Dillinger leans in closer to Red, whose attention is fully captured by the sight of the brunette in the striking, eye-catching red dress as she makes her way back to her table with a graceful stride. Anna, extending a gentle guiding hand, escorts a young woman over to where Red stands, and then she proceeds to follow alongside both Red and Veronica as they casually stroll away, leaving Dillinger standing in solitude. His gaze remains fixed, unwaveringly, on the brunette in the vivid red dress, who is laughing heartily and beaming with joy. The gang leader, with measured deliberation, takes a sip from his drink, then stands up from his seat, his eyes never leaving the sight of the exotic woman. With a determined stride, he cuts through the bustling crowd, finally coming to a halt just behind her, and leans forward onto her chair. She looks up at him with curiosity, and he responds with a slight, stunned shake of his head. Her bright red lips curl into a coy, knowing smile, and she grins at the other women seated at her table before she confidently sashays off with Dillinger. He locks eyes with her warily, then looks away briefly. Billie takes the lead, guiding the way to the vibrant dance floor, where he gently takes her hand, and she places her other hand softly on his shoulder. Together, they sway rhythmically to the music as Billie smiles warmly at him. Dillinger gazes shyly into the distance, then finds her captivating face, and Billie meets his gaze with defiant intensity. Her dark eyes search his as they continue to sway harmoniously to the rhythm of the music, and she allows a faint, gentle smile to appear. Dillinger draws a deep breath, arching his brows, and her smile broadens in response. On stage, the songstress, with an air of command, gazes out over the crowded dance floor, taking in the lively scene. Later, Billie and Dillinger walk purposefully through the club's foyer, with Billie wrapping her crimson jacket snugly around her body for warmth. They step out into the cool night air, and she winces as she feels a sudden gust of wind. Dillinger turns to face her, draping his overcoat gently over her shoulders to shield her from the chill. She grins bashfully, feeling his warmth, and continues walking down the sidewalk with his jacket and his protective arm wrapped around her comfortingly. In an elegant restaurant later on, Billie, feeling a bit uneasy, scans her surroundings carefully, then glances at Dillinger and offers a tentative smile, her gaze then landing on a female diner. The snobbish woman responds with a disdainful look, causing Billie's smile to falter momentarily. Dillinger, observing the interaction, flashes an amused smile and leans back in his seat, but his attention is soon captured by another table, which he eyes with interest. Billie and Dillinger lock eyes once again, and beneath Billie's graceful nose and thick, dark eyelashes, a faint smile curls the corners of her lips. Dillinger stands up and politely holds her chair as she rises, then gently guides her through the restaurant with a light hand at her back, leading her to the coat check counter. At a nearby bar, a stocky man with slicked-back hair notices them keenly. Dillinger glances discreetly over his shoulder at the man, then leans in toward Billie and steps away. Billie, shifting her gaze irritably, then glares at Dillinger and tugs impatiently on her coat before storming out. The two men exchange a firm handshake as Nitti, a lean man with dark, slick hair and a distinctive handlebar mustache, sits slouched as he eats. A short, husky man with olive skin and a toothbrush mustache approaches Dillinger, and they exchange a quick handshake before D'Andrea departs."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Alvin gives a nod of acknowledgment and begins to move away, while Pete and Homer, with a confident swagger, make their exit in another direction. Dillinger leans in closer to Red, who is intently watching the brunette in the red dress as she gracefully makes her way back to her table. Meanwhile, Anna guides a young woman over to Red, and then she follows Red and Veronica as they casually stroll away, leaving Dillinger standing alone. His gaze remains fixed on the brunette in the red dress, who is laughing and radiating joy. The gang leader takes a sip from his drink, stands up, and keeps his eyes locked on the exotic woman. With determination, he strides through the crowd, coming to a stop just behind her, and leans onto her chair. She looks up at him, and he responds with a stunned shake of his head. Her bright red lips form a coy smile, and she grins at the other women seated at her table before she begins to sashay away with Dillinger. He cautiously locks eyes with her, then averts his gaze. Billie takes the lead toward the dance floor, where Dillinger takes her hand, and she places her other hand on his shoulder. Together, they sway to the music as Billie smiles. Dillinger, initially shy, gazes off into the distance before finding her lovely face, and Billie stares back with a defiant look. Her dark eyes delve into his as they continue to sway, and she allows a faint smile to appear. Dillinger takes a deep breath and raises his eyebrows, prompting her smile to broaden. On stage, the songstress looks out over the crowded dance floor. Later, Billie and Dillinger walk through the club's foyer, with Billie wrapping her crimson jacket tightly around her body. As they step outside, she winces against a gust of wind, prompting Dillinger to turn her to face him and drape his overcoat over her shoulders. She grins bashfully and continues down the sidewalk with his jacket and arm around her. In an elegant restaurant later, Billie uneasily scans her surroundings, then looks to Dillinger, smiles, and glances at a female diner. The snobbish woman gives her a disapproving look, causing Billie's smile to briefly falter. Dillinger responds with an amused smile and leans back in his chair, but then he breaks off his gaze, noticing another table. Billie and Dillinger lock eyes, and under Billie's thick, dark eyelashes and graceful nose, a faint smile curls the corners of her lips. Dillinger stands and holds her chair as she rises, then guides her through the restaurant with a gentle hand at her back until they reach the coat check counter. At a bar, a stocky man with slicked-back hair notices them. Dillinger glances at the man over his shoulder, then leans toward Billie and steps away. Billie, feeling irritated, shifts her gaze and glares at him, yanking on her coat before storming out. The two men shake hands as Nitti, a lean man with dark, slick hair and a handlebar mustache, slouches while eating. A short, husky man with olive skin and a toothbrush mustache approaches Dillinger, and they shake hands before D'Andrea departs."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Alvin nods and departs as Pete and Homer swagger away. Dillinger leans toward Red, who watches the brunette in the red dress return to her table. Anna introduces a young woman to Red, then follows Red and Veronica as they stroll away, leaving Dillinger alone. He fixates on the brunette, who laughs and beams, before sipping his drink and approaching her. He leans onto her chair, and she looks up, smiling coyly before leaving with him. On the dance floor, Billie leads Dillinger, and they sway together, exchanging shy and defiant glances. As they dance, Dillinger's confidence grows, and Billie's smile broadens. Later, they exit the club, and Dillinger drapes his overcoat over her shoulders against the wind. She grins bashfully as they walk down the sidewalk, his arm around her. In an elegant restaurant, Billie scans her surroundings uneasily but smiles at Dillinger. A snobbish woman catches her eye, causing her smile to falter briefly. Dillinger, amused, sits back but then notices another table. They share a moment of connection before Dillinger stands and guides her through the restaurant to the coat check. At a bar, a stocky man notices them, prompting Dillinger to lean toward Billie before stepping away. Irritated, Billie glares at him, puts on her coat, and storms out. Dillinger then shakes hands with Nitti, a lean man with a handlebar mustache, and later with D'Andrea, a short, husky man with a toothbrush mustache, before D'Andrea leaves."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Alvin nods and heads off as Pete and Homer, both known in the area for their bold and confident manner, swagger off. Dillinger leans toward Red, who eyes the brunette in the red dress, reminiscent of the glamorous Hollywood styles of the 1930s, as she returns to her table in the bustling club. Anna, whose reputation as a savvy socialite precedes her, leads a young woman to Red, then follows Red and Veronica, a woman known for her striking presence, as they stroll away, leaving Dillinger alone in the smoke-filled room. He stares at the brunette in the red dress, who laughs and beams with an air of mystery. The gang leader, notorious for his daring escapades during the Prohibition era, sips his drink and stands, keeping his eyes locked on the exotic woman. He strides resolutely through the crowd, halts just behind her, and leans onto her chair. She looks up at him, and he gives his head a stunned shake, captivated by her allure. Her bright red lips smile coyly, and she grins at the other women seated at her table before sashaying off with Dillinger, whose notoriety has made him both feared and admired. He warily locks eyes with her, then looks away, aware of the eyes watching his every move. Billie, a name that resonates with the era's jazz culture, leads the way to the dance floor, where he takes her hand, and she places her other hand on his shoulder. They sway together as Billie smiles, the music a backdrop to their wordless connection. Dillinger gazes off shyly, then finds her lovely face, and Billie stares back defiantly, a woman accustomed to holding her own. Her dark eyes probe his as they sway with the music, and she allows a faint smile to grace her lips. Dillinger, gathering his courage as he often did in his storied heists, summons up a breath and arches his brows, and her smile broadens in response. On stage, the songstress, a highlight of the evening's entertainment, gazes out over the crowded dance floor. Later, Billie and Dillinger stride through the club's art-deco foyer, with Billie wrapping her crimson jacket tight around her body to shield against the chill. They step outside, and she winces against a gust of wind, common to the night's unpredictable weather, as Dillinger turns her to face him and drapes his overcoat over her shoulders, an act of chivalry that contrasts his hardened image. She grins bashfully and continues down the bustling sidewalk, with his jacket and arm around her. In an elegant restaurant later, Billie uneasily scans her surroundings, aware of the high society clientele around her, then looks to Dillinger, smiles, and glances at a female diner. The snobbish woman gives her the eye, and Billie's smile briefly falters. Dillinger, seemingly unperturbed by the judgmental glances, flashes an amused smile and sits back but then breaks off, eyeing another table where familiar faces might be seated. Billie and Dillinger lock gazes, and under Billie's thick, dark eyelashes and graceful nose, features reminiscent of classic beauty, a faint smile curls the corners of her lips. Dillinger stands and holds her chair as she gets up, then guides her through the upscale restaurant with a hand at her back, navigating the maze of tables, until they face a coat check counter. At a dimly lit bar, a stocky man with slicked-back hair, a common look among the era's underworld figures, notices them. Dillinger glances at the man over his shoulder, then leans toward Billie and steps away, his mind calculating as always. Billie, irritably shifting her gaze, then glares at him and yanks on her coat before she storms out, her patience with his clandestine dealings wearing thin. The two men shake hands as Nitti, a lean man with dark, slick hair and a handlebar mustache, known for his ties to organized crime, slouches as he eats. A short, husky man with olive skin and a toothbrush mustache, resembling many of the ethnic gangsters who frequented the city, approaches Dillinger, and they shake hands before D'Andrea, another figure in the complex web of alliances, leaves."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Alvin nods and heads off as Pete and Homer swagger off. Dillinger leans toward Red who eyes the brunette in the red dress as she returns to her table. Anna leads a young woman to Red then follows Red and Veronica as they stroll away leaving Dillinger alone. He stares at the brunette in the red dress who laughs and beams. The gang leader sips his drink and stands keeping his eyes locked on the exotic woman. He strides resolutely through the crowd halts just behind her and leans onto her chair. She looks up at him and he gives his head a stunned shake. Her bright red lips smile coyly and she grins at the other women seated at her table before sashaying off with Dillinger. He warily locks eyes with her then looks away. Billie leads the way to the dance floor where he takes her hand and she places her other hand on his shoulder. They sway together as Billie smiles. Dillinger gazes off shyly then finds her lovely face and Billie stares back defiantly. Her dark eyes probe his as they sway with the music and she allows a faint smile. Dillinger summons up a breath and arches his brows and her smile broadens. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. On stage the songstress gazes out over the crowded dance floor. Later Billie and Dillinger stride through the club's foyer with Billie wrapping her crimson jacket tight around her body. They step outside and she winces against a gust of wind as Dillinger turns her to face him and drapes his overcoat over her shoulders. She grins bashfully and continues down the sidewalk with his jacket and arm around her. In an elegant restaurant later Billie uneasily scans her surroundings then looks to Dillinger smiles and glances at a female diner. The snobbish woman gives her the eye and Billie's smile briefly falters. Dillinger flashes an amused smile and sits back but then breaks off eyeing another table. Billie and Dillinger lock gazes and under Billie's thick dark eyelashes and graceful nose. a faint smile curls the corners of her lips. Dillinger stands and holds her chair as she gets up then guides her through the restaurant with a hand at her back until they face a coat check counter. At a bar a stocky man with slickedback hair notices them. Dillinger glances at the man over his shoulder then leans toward Billie and steps away. Billie irritably shifting her gaze then glares at him and yanks on her coat before she storms out. The two men shake hands as Nitti a lean man with dark slick hair and a handlebar mustache slouches as he eats. A short husky man with olive skin and a toothbrush mustache approaches Dillinger and they shake hands before D'Andrea leaves."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Alvin nods and heads off as Pete and Homer swagger off. Dillinger leans toward Red who eyes the brunette in the red dress as she returns to her table. Anna leads a young woman to Red then follows Red and Veronica as they stroll away leaving Dillinger alone. He stares at the brunette in the red dress who laughs and beams. The gang leader sips his drink and stands keeping his eyes locked on the exotic woman. He strides resolutely through the crowd halts just behind her and leans onto her chair. She looks up at him and he gives his head a stunned shake. Her bright red lips smile coyly and she grins at the other women seated at her table before sashaying off with Dillinger. He warily locks eyes with her then looks away. Billie leads the way to the dance floor where he takes her hand and she places her other hand on his shoulder. They sway together as Billie smiles. Dillinger gazes off shyly then finds her lovely face and Billie stares back defiantly. Her dark eyes probe his as they sway with the music and she allows a faint smile. Dillinger summons up a breath and arches his brows and her smile broadens. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. On stage the songstress gazes out over the crowded dance floor. Later Billie and Dillinger stride through the club's foyer with Billie wrapping her crimson jacket tight around her body. They step outside and she winces against a gust of wind as Dillinger turns her to face him and drapes his overcoat over her shoulders. She grins bashfully and continues down the sidewalk with his jacket and arm around her. In an elegant restaurant later Billie uneasily scans her surroundings then looks to Dillinger smiles and glances at a female diner. The snobbish woman gives her the eye and Billie's smile briefly falters. Dillinger flashes an amused smile and sits back but then breaks off eyeing another table. Billie and Dillinger lock gazes and under Billie's thick dark eyelashes and graceful nose. a faint smile curls the corners of her lips. Dillinger stands and holds her chair as she gets up then guides her through the restaurant with a hand at her back until they face a coat check counter. At a bar a stocky man with slickedback hair notices them. Dillinger glances at the man over his shoulder then leans toward Billie and steps away. Billie irritably shifting her gaze then glares at him and yanks on her coat before she storms out. The two men shake hands as Nitti a lean man with dark slick hair and a handlebar mustache slouches as he eats. A short husky man with olive skin and a toothbrush mustache approaches Dillinger and they shake hands before D'Andrea leaves."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Alvin nods and heads off as Pete and Homer swagger off. Dillinger leans toward Red who eyes the brunette in the red dress as she returns to her table. Anna leads a young woman to Red then follows Red and Veronica as they stroll away leaving Dillinger alone. He stares at the brunette in the red dress who laughs and beams. The gang leader sips his drink and stands keeping his eyes locked on the exotic woman. He strides resolutely through the crowd halts just behind her and leans onto her chair. She looks up at him and he gives his head a stunned shake. Billie and Dillinger lock gazes and under Billie's thick dark eyelashes and graceful nose. a faint smile curls the corners of her lips. Dillinger stands and holds her chair as she gets up then guides her through the restaurant with a hand at her back until they face a coat check counter. At a bar a stocky man with slickedback hair notices them. Dillinger glances at the man over his shoulder then leans toward Billie and steps away. Billie irritably shifting her gaze then glares at him and yanks on her coat before she storms out. The two men shake hands as Nitti a lean man with dark slick hair and a handlebar mustache slouches as he eats. A short husky man with olive skin and a toothbrush mustache approaches Dillinger and they shake hands before D'Andrea leaves."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Alvin nods and heads off as Pete and Homer swagger off. Dillinger leans toward Red who eyes the brunette in the red dress as she returns to her table. Anna leads a young woman to Red then follows Red and Veronica as they stroll away leaving Dillinger alone. Billie irritably shifting her gaze then glares at him and yanks on her coat before she storms out. The two men shake hands as Nitti a lean man with dark slick hair and a handlebar mustache slouches as he eats. A short husky man with olive skin and a toothbrush mustache approaches Dillinger and they shake hands before D'Andrea leaves."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Charlie shrugs and skips away as Nate and Hector tiptoe away. Thompson bends toward Blue, who glares at the blonde in the yellow gown as she returns to her couch. Lisa guides a young man to Blue, then trails Blue and Fiona as they waltz away, leaving Thompson by himself. He squints at the blonde in the yellow gown, who chuckles and twinkles. The chef leader slurps his soup and rises, keeping his gaze fixed on the peculiar gentleman. He marches determinedly through the congregation, pauses just beside him, and leans onto his bench. He glances up at him, and he gives his head a cheerful nod. His bright yellow pants frown shyly, and he grimaces at the other gentlemen standing at his bench before dancing off with Thompson. He stiffly locks gaze with him, then glances aside. Martha guides the path to the orchestra pit, where he takes his arm, and he places his other hand on her elbow. They flutter gently as Martha frowns. Thompson scans around nervously, then finds his handsome hat, and Martha looks back triumphantly. His tired feet quiz her as they flutter with the tune, and he allows a faint frown. Thompson inhales shortly and pinches his lips, and her frown deepens. Onstage, the magician glances out over the bustling orchestra pit. Later, Martha and Thompson march through the cafe's atrium, with Martha wrapping her azure cape loose around his chest. They step inside, and he blinks against a burst of rain as Thompson spins her to face him and drapes his shawl over her knees. She yawns sleepily and prances up the staircase with his shawl and cane around her. In a grand gallery later, Martha awkwardly explores his surroundings, then checks on Thompson, frowns, and gazes at a male artist. The boisterous man sends him the nod, and Martha's frown briefly steadies. Thompson emits a puzzled frown and shifts forward but then splits, glaring at another bench. Martha and Thompson twist bodies, and under Martha's thin, bright eyebrows and crooked chin, a faint frown straightens the tips of his cheeks. Thompson rises and holds his bench as he stands up, then guides him through the gallery with a leg on his ankle until they face a luggage claim cubicle. At a lounge, a slender woman with messy back hair observes them. Thompson squints at the woman under his elbow, then bends near Martha and spins aside. Martha, contentedly steadying her smile, then chuckles at him and tugs on his bag before he creeps in. The two women clasp elbows as Sammy, a bulky woman with light, messy hair and a pencil goatee, reclines as she drinks. A tall, lanky woman with bronze skin and a horseshoe brow approaches Thompson, and they clasp elbows before Mancuso wanders."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Alvin departs as Pete and Homer swagger away. Dillinger, intrigued by a brunette in a red dress, sips his drink and approaches her. She smiles coyly, engaging with the gang leader as they move to the dance floor. Billie leads Dillinger, and they sway together, sharing probing glances. Later, they exit the club, with Dillinger offering his coat to a wind-chilled Billie, furthering their connection. In a restaurant, moments of tension arise as Billie interacts with a snobbish diner, but Dillinger’s amused demeanor eases her. Their subtle bond grows as Dillinger guides her through the restaurant, displaying attentive care. At a bar, Dillinger notices a stocky man with slicked-back hair watching them. He steps away from Billie, prompting her irritation and abrupt departure. Dillinger meets Nitti, a lean man with a mustache, and D'Andrea, a husky man with olive skin, as they exchange pleasantries."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A short husky man with olive skin and a toothbrush mustache approaches Dillinger and they shake hands before D'Andrea leaves The two men shake hands as Nitti a lean man with dark slick hair and a handlebar mustache slouches as he eats  Billie irritably shifting her gaze then glares at him and yanks on her coat before she storms out  Dillinger glances at the man over his shoulder then leans toward Billie and steps away  At a bar a stocky man with slickedback hair notices them  Dillinger stands and holds her chair as she gets up then guides her through the restaurant with a hand at her back until they face a coat check counter  a faint smile curls the corners of her lips  Billie and Dillinger lock gazes and under Billie's thick dark eyelashes and graceful nose  Dillinger flashes an amused smile and sits back but then breaks off eyeing another table  The snobbish woman gives her the eye and Billie's smile briefly falters  In an elegant restaurant later Billie uneasily scans her surroundings then looks to Dillinger smiles and glances at a female diner  She grins bashfully and continues down the sidewalk with his jacket and arm around her  They step outside and she winces against a gust of wind as Dillinger turns her to face him and drapes his overcoat over her shoulders  Later Billie and Dillinger stride through the club's foyer with Billie wrapping her crimson jacket tight around her body  On stage the songstress gazes out over the crowded dance floor  Dillinger summons up a breath and arches his brows and her smile broadens  Her dark eyes probe his as they sway with the music and she allows a faint smile  Dillinger gazes off shyly then finds her lovely face and Billie stares back defiantly  They sway together as Billie smiles  Billie leads the way to the dance floor where he takes her hand and she places her other hand on his shoulder  He warily locks eyes with her then looks away  Her bright red lips smile coyly and she grins at the other women seated at her table before sashaying off with Dillinger  She looks up at him and he gives his head a stunned shake  He strides resolutely through the crowd halts just behind her and leans onto her chair  The gang leader sips his drink and stands keeping his eyes locked on the exotic woman  He stares at the brunette in the red dress who laughs and beams  Anna leads a young woman to Red then follows Red and Veronica as they stroll away leaving Dillinger alone  Dillinger leans toward Red who eyes the brunette in the red dress as she returns to her table  Alvin nods and heads off as Pete and Homer swagger off "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Dillinger leans toward Red who eyes the brunette in the red dress as she returns to her table Alvin nods and heads off as Pete and Homer swagger off He stares at the brunette in the red dress who laughs and beams Anna leads a young woman to Red then follows Red and Veronica as they stroll away leaving Dillinger alone He strides resolutely through the crowd halts just behind her and leans onto her chair The gang leader sips his drink and stands keeping his eyes locked on the exotic woman Her bright red lips smile coyly and she grins at the other women seated at her table before sashaying off with Dillinger She looks up at him and he gives his head a stunned shake Billie leads the way to the dance floor where he takes her hand and she places her other hand on his shoulder He warily locks eyes with her then looks away Dillinger gazes off shyly then finds her lovely face and Billie stares back defiantly They sway together as Billie smiles Dillinger summons up a breath and arches his brows and her smile broadens Her dark eyes probe his as they sway with the music and she allows a faint smile Later Billie and Dillinger stride through the club's foyer with Billie wrapping her crimson jacket tight around her body On stage the songstress gazes out over the crowded dance floor She grins bashfully and continues down the sidewalk with his jacket and arm around her They step outside and she winces against a gust of wind as Dillinger turns her to face him and drapes his overcoat over her shoulders The snobbish woman gives her the eye and Billie's smile briefly falters In an elegant restaurant later Billie uneasily scans her surroundings then looks to Dillinger smiles and glances at a female diner Billie and Dillinger lock gazes and under Billie's thick dark eyelashes and graceful nose Dillinger flashes an amused smile and sits back but then breaks off eyeing another table Dillinger stands and holds her chair as she gets up then guides her through the restaurant with a hand at her back until they face a coat check counter a faint smile curls the corners of her lips Dillinger glances at the man over his shoulder then leans toward Billie and steps away At a bar a stocky man with slickedback hair notices them The two men shake hands as Nitti a lean man with dark slick hair and a handlebar mustache slouches as he eats Billie irritably shifting her gaze then glares at him and yanks on her coat before she storms out A short husky man with olive skin and a toothbrush mustache approaches Dillinger and they shake hands before D'Andrea leaves"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Later Billie and Dillinger stride through the club's foyer with Billie wrapping her crimson jacket tight around her body  They step outside and she winces against a gust of wind as Dillinger turns her to face him and drapes his overcoat over her shoulders  She grins bashfully and continues down the sidewalk with his jacket and arm around her  In an elegant restaurant later Billie uneasily scans her surroundings then looks to Dillinger smiles and glances at a female diner  The snobbish woman gives her the eye and Billie's smile briefly falters  Dillinger flashes an amused smile and sits back but then breaks off eyeing another table  Billie and Dillinger lock gazes and under Billie's thick dark eyelashes and graceful nose  a faint smile curls the corners of her lips  Dillinger stands and holds her chair as she gets up then guides her through the restaurant with a hand at her back until they face a coat check counter  At a bar a stocky man with slickedback hair notices them  Dillinger glances at the man over his shoulder then leans toward Billie and steps away  Billie irritably shifting her gaze then glares at him and yanks on her coat before she storms out  The two men shake hands as Nitti a lean man with dark slick hair and a handlebar mustache slouches as he eats  A short husky man with olive skin and a toothbrush mustache approaches Dillinger and they shake hands before D'Andrea leaves Alvin nods and heads off as Pete and Homer swagger off  Dillinger leans toward Red who eyes the brunette in the red dress as she returns to her table  Anna leads a young woman to Red then follows Red and Veronica as they stroll away leaving Dillinger alone  He stares at the brunette in the red dress who laughs and beams  The gang leader sips his drink and stands keeping his eyes locked on the exotic woman  He strides resolutely through the crowd halts just behind her and leans onto her chair  She looks up at him and he gives his head a stunned shake  Her bright red lips smile coyly and she grins at the other women seated at her table before sashaying off with Dillinger  He warily locks eyes with her then looks away  Billie leads the way to the dance floor where he takes her hand and she places her other hand on his shoulder  They sway together as Billie smiles  Dillinger gazes off shyly then finds her lovely face and Billie stares back defiantly  Her dark eyes probe his as they sway with the music and she allows a faint smile  Dillinger summons up a breath and arches his brows and her smile broadens  On stage the songstress gazes out over the crowded dance floor "
        }
      ]
    }
  ]
}