{
  "ground_truth": "Dillinger wriggles his opened pants downward as Billie, kneeling over him, unfastens her dress and pulls it off over her head, revealing a silvery blue slip, then leans over on top of Dillinger. Glimpses of Dillinger thrusting into Billie from behind are interspersed with their nuzzling face to face. A recent flashback shows them arriving ecstatically, and another flash shows Dillinger kissing her mouth as his face withdraws down her chest. Later, as they cuddle, they share a warm smile, and later still, Billie strolls in her slip to a window. Open suitcases occupy every inch, filled to the brim with neatly packed clothes. Billie caresses their contents, then rejoins Dillinger in bed, laying her head on his shoulder. Rolling over to face her, he strokes her cheek and neck, his thumb gently rubbing her graceful jaw line, while his gaze pours over her face. He grins, and Billie gazes dreamily at him. He gives her another smile, and his thumb caresses her cheek in a gentle rhythm, followed by a puckish grin. At the telephone exchange, Baum stands with a listening piece to his ear and a hand-held mike at his lips. Later, the Pierce-Arrow pulls up to a curb, with Purvis driving and Baum at his side. Two other G-men approach the luxury car, and one of the street agents looks to his young partner, who bows his hat. Purvis faces Baum, points, then gets out and faces the young G-man. Purvis leads them across the street towards a building, and inside, they enter a long, dim hallway. Purvis leads Agent Barton to a door, then readies his hand on his gun as they prepare, dwarfing their trench-coated forms. Purvis lifts his knuckles to the door, which opens to reveal a young demure house dressed, with strawberry blonde hair framing her face in a curly bob. Purvis steps toward the doorway, and as he enters, Barton lingers in the hall. At a table, a stout man eats, and the baby-faced man nods. The woman steps away and returning, shows off her shoes and holds out the opened wallet as well. Purvis eyes it and gives a nod, then leaves, shutting the door. The woman looks wearily to the stout gentleman at the dining table. Now Purvis and Barton enter a stairwell, with Purvis hurrying downstairs and rushing from the building to run across the street to agent Baum. In the stairwell, Barton peers through a window in the door, squints, steps into the hallway, and lets the door swing shut behind him. From the stairwell, our gaze lingers on the door, then drifts over to a set of elevators. One of them opens, revealing a tall man with rugged features who steps off and heads for the door.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Dillinger squirms his unzipped trousers downward as Billie, kneeling over him, loosens her gown and pulls it off over her head, unveiling a silvery blue slip, then leans over on top of Dillinger. Glimpses of Dillinger thrusting into Billie from behind are interspersed with their nuzzling face to face. A recent flashback shows them arriving ecstatically, and another flash shows Dillinger kissing her mouth as his face withdraws down her chest. Later, as they cuddle, they share a warm grin, and later still, Billie strolls in her slip to a window. Open suitcases occupy every inch, filled to the brim with neatly packed garments. Billie caresses their contents, then rejoins Dillinger in bed, laying her head on his shoulder. Rolling over to face her, he strokes her cheek and neck, his thumb gently rubbing her graceful jaw line, while his gaze pours over her face. He beams, and Billie gazes dreamily at him. He gives her another grin, and his thumb caresses her cheek in a gentle rhythm, followed by a mischievous grin. At the telephone exchange, Baum stands with a listening device to his ear and a hand-held mike at his lips. Later, the Pierce-Arrow pulls up to a curb, with Purvis driving and Baum at his side. Two other G-men approach the luxury vehicle, and one of the street agents looks to his young partner, who bows his hat. Purvis faces Baum, points, then gets out and faces the young G-man. Purvis leads them across the street towards a building, and inside, they enter a long, dim corridor. Purvis leads Agent Barton to a door, then readies his hand on his firearm as they prepare, dwarfing their trench-coated forms. Purvis lifts his knuckles to the door, which opens to reveal a young demure house dressed, with strawberry blonde hair framing her face in a curly bob. Purvis steps toward the entryway, and as he enters, Barton lingers in the hall. At a table, a stout man eats, and the baby-faced man nods. The woman steps away and returning, shows off her shoes and holds out the opened wallet as well. Purvis eyes it and gives a nod, then leaves, shutting the door. The woman looks wearily to the stout gentleman at the dining table. Now Purvis and Barton enter a stairwell, with Purvis hurrying downstairs and rushing from the building to run across the street to agent Baum. In the stairwell, Barton peers through a window in the door, squints, steps into the corridor, and lets the door swing shut behind him. From the stairwell, our gaze lingers on the door, then drifts over to a set of elevators. One of them opens, revealing a tall man with rugged features who steps off and heads for the door."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Dillinger's opened pants are wriggled downward by him as Billie, kneeling over him, has her dress unfastened and pulled off over her head by herself, revealing a silvery blue slip, then Dillinger is leaned over by her. They are glimpsed thrusting into Billie by Dillinger from behind, interspersed with their nuzzling face to face. A recent flashback shows them arriving ecstatically, and another flash shows him kissing Billie’s mouth as Dillinger’s face withdraws down her chest. Later, as they are cuddled, a warm smile is shared by them, and later still, Billie is seen strolling to a window in her slip. Every inch is occupied by open suitcases, filled to the brim with neatly packed clothes. Their contents are caressed by Billie, then Dillinger is rejoined by her in bed, her head is laid on his shoulder. Rolling over to face her, her cheek and neck are stroked by him, his thumb gently rubs her graceful jaw line, while her face is gazed over by his gaze. A grin is given by him, and Billie dreamily gazes at him. Another smile is given to her by him, and her cheek is caressed by his thumb in a gentle rhythm, followed by a puckish grin. At the telephone exchange, a listening piece is held to Baum's ear and a hand-held mike is held at his lips. Later, a curb is pulled up to by the Pierce-Arrow, with Purvis driving and Baum at his side. The luxury car is approached by two other G-men, and one of the street agents looks to his young partner, who bows his hat. Baum is faced by Purvis, who points, then Purvis gets out and faces the young G-man. Purvis leads them across the street towards a building, and inside, a long, dim hallway is entered by them. Agent Barton is led to a door by Purvis, then his hand is readied on his gun as they are prepared, dwarfing their trench-coated forms. His knuckles are lifted to the door by Purvis, which opens to reveal a young demure house dressed, with strawberry blonde hair framing her face in a curly bob. The doorway is stepped toward by Purvis, and as he enters, the hall is lingered in by Barton. At a table, a stout man eats, and the baby-faced man nods. The woman steps away and returning, her shoes are shown off by her, and the opened wallet is held out as well. Purvis eyes it and gives a nod, then the door is shut as he leaves. The woman looks wearily to the stout gentleman at the dining table. Now a stairwell is entered by Purvis and Barton, with Purvis hurrying downstairs and rushing from the building to run across the street to agent Baum. In the stairwell, a window in the door is peered through by Barton, who squints, steps into the hallway, and lets the door swing shut behind him. From the stairwell, our gaze lingers on the door, then drifts over to a set of elevators. One of them opens, revealing a tall man with rugged features who steps off and heads for the door."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Dillinger wriggles his pants down as Billie, kneeling over him, removes her dress, exposing a silvery blue slip, then leans over him. Glimpses of their intimate moments alternate with face-to-face nuzzling. A flashback shows them arriving happily and Dillinger kissing Billie. Later, they cuddle and share a smile, and Billie walks to a window in her slip. Open suitcases filled with neatly packed clothes are everywhere. Billie touches their contents, then rejoins Dillinger in bed, resting her head on his shoulder. He rolls over, strokes her cheek and neck, gazes at her, and grins. Billie looks at him dreamily, and he smiles, his thumb rhythmically caressing her cheek. At the telephone exchange, Baum listens and speaks into a handheld mike. The Pierce-Arrow arrives at a curb, Purvis driving with Baum beside him. Two G-men approach, and one tips his hat. Purvis exits, faces a young G-man, and leads them across the street to a building. Inside, they enter a dim hallway. Purvis takes Agent Barton to a door, readies his gun, and knocks. A young woman with strawberry blonde hair and a curly bob answers. Purvis enters while Barton lingers. At a table, a stout man eats, and a baby-faced man nods. The woman shows her shoes and an open wallet, which Purvis acknowledges before leaving. She looks tiredly at the stout man. Purvis and Barton hurry downstairs and rush to agent Baum. In the stairwell, Barton peers through a window, steps into the hall, and lets the door close. The camera shifts to a set of elevators, one opening to reveal a rugged man who steps out and heads for the door."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Dillinger lowers his pants as Billie, kneeling, removes her dress, revealing a silvery blue slip before leaning over him. Scenes of Dillinger thrusting into Billie are mixed with face-to-face nuzzling. Flashbacks show their ecstatic arrival and Dillinger kissing her. Later, they smile warmly while cuddling, and Billie walks to a window in her slip. Suitcases brim with neatly packed clothes. Billie caresses them, then rejoins Dillinger, resting her head on his shoulder. He caresses her face and neck, gazing at her lovingly. At a phone exchange, Baum listens with a mike in hand. Later, Purvis drives a Pierce-Arrow with Baum. Two G-men approach, and Purvis leads them to a dim hallway. He and Agent Barton prepare at a door, opening to a young woman with strawberry blonde hair. Purvis enters as Barton waits. A stout man eats at a table; a baby-faced man nods. The woman returns with her shoes and an opened wallet. Purvis nods and leaves, and the woman looks tiredly at the stout man. Purvis and Barton hurry downstairs, with Purvis rushing to Baum. Barton peers through a window, steps into a hallway, and the door closes behind him. A tall, rugged man exits an elevator and heads for the door."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Dillinger skillfully maneuvers his already opened pants downwards while Billie, gracefully kneeling above him, takes the time to carefully unfasten her dress. She smoothly pulls it off over her head, revealing a shimmering silvery blue slip underneath, then gently leans forward to drape herself over Dillinger. We catch fleeting glimpses of Dillinger as he thrusts into Billie from behind, interspersed with intimate moments of their nuzzling tenderly, face to face. In a recent flashback, we see them arriving in a state of absolute ecstasy, followed by another quick flash showing Dillinger passionately kissing her mouth, his face slowly withdrawing down her chest. Later on, as the two of them cuddle closely, they exchange a warm, affectionate smile. In the following scene, Billie leisurely strolls in her delicate slip to a nearby window. Every available inch is occupied by open suitcases, filled to the brim with neatly packed clothes. Billie tenderly caresses the contents with a gentle touch before she returns to Dillinger in bed, resting her head comfortably on his shoulder. As he rolls over to face her, he lovingly strokes her cheek and neck, his thumb gently rubbing the elegant line of her jaw while his intense gaze roams over her face. He flashes a charming grin, and Billie gazes back at him with a dreamy look in her eyes. Once again, he smiles at her, and his thumb continues to softly caress her cheek in a gentle rhythm, followed by a playful grin. Over at the telephone exchange, Baum stands attentively with a listening piece pressed to his ear and a hand-held microphone positioned at his lips. Later, the Pierce-Arrow pulls smoothly up to the curb, with Purvis at the wheel and Baum seated beside him. Two other G-men approach the luxurious car, and one of the street agents casts a glance at his young partner, who tips his hat in acknowledgment. Purvis turns to face Baum, points with intent, then steps out of the vehicle and faces the young G-man. Purvis takes the lead, guiding them across the street toward a particular building, and once inside, they find themselves entering a long, dimly lit hallway. Purvis guides Agent Barton to a door, readying his hand on his gun as they prepare, their trench-coated forms towering over the scene. Purvis lifts his knuckles to knock on the door, which promptly opens to reveal a young woman in a demure house dress, her strawberry blonde hair styled in a curly bob framing her face. Purvis confidently steps toward the open doorway, and as he enters, Barton lingers behind in the hall. At a table inside, a stout man is eating, and the baby-faced man gives a nod in acknowledgment. The woman steps away momentarily and, upon returning, proudly shows off her shoes and holds out an opened wallet as well. Purvis eyes the wallet, gives a nod of affirmation, then exits, shutting the door behind him. The woman glances wearily over to the stout man seated at the dining table. Now, Purvis and Barton make their way into a stairwell, with Purvis hurrying briskly downstairs and rushing out of the building to quickly cross the street to meet agent Baum. Meanwhile, in the stairwell, Barton peers through a window in the door, squints slightly, then steps out into the hallway, allowing the door to swing shut behind him. From the vantage point of the stairwell, our gaze lingers momentarily on the door, then shifts over to a bank of elevators. One of the elevators opens, revealing a tall man with rugged, distinguished features who steps off resolutely and heads directly for the door."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Dillinger, with notable dexterity, skillfully maneuvers his already opened pants downwards, all the while Billie, gracefully kneeling above him, devotes time to meticulously unfasten her elegant dress. She smoothly pulls the garment over her head, revealing beneath it a shimmering silvery blue slip that catches the light beautifully. Then, with a gentle lean forward, she drapes herself intimately over Dillinger. Fleeting glimpses reveal Dillinger as he thrusts into Billie from behind, seamlessly interspersed with moments of them nuzzling tenderly, face to face, in an intimate embrace. In a recent evocative flashback, we witness them arriving in a shared state of absolute ecstasy, closely followed by another quick flash showing Dillinger passionately kissing her mouth, his face slowly withdrawing down along her chest. Later on, as the two of them nestle closely together, they exchange a warm and affectionate smile, full of shared intimacy. In the subsequent scene, Billie leisurely strolls in her delicate slip towards a nearby window. Every available inch is occupied by open suitcases, filled to the brim with neatly packed clothes. Billie tenderly caresses the contents with a gentle and loving touch before making her way back to Dillinger in bed, resting her head comfortably on his shoulder. As he rolls over to face her, he lovingly strokes her cheek and neck, his thumb gently rubbing along the elegant line of her jaw while his intense gaze roams over her face, taking in every detail. He flashes a charming grin, and Billie gazes back at him with a dreamy look in her eyes, full of admiration. Once again, he smiles warmly at her, and his thumb continues to softly caress her cheek in a gentle, soothing rhythm, followed by a playful grin that lights up his face. Over at the telephone exchange, Baum stands attentively with a listening piece pressed to his ear, and a hand-held microphone positioned at his lips, poised for action. Later, the Pierce-Arrow pulls up smoothly to the curb with Purvis at the wheel and Baum seated beside him. Two other G-men approach the luxurious vehicle, and one of the street agents exchanges a look with his young partner, who tips his hat in acknowledgment. Purvis turns to face Baum, points with intent, then steps confidently out of the vehicle to face the young G-man. Purvis takes the lead, guiding them across the street toward a specific building, and once inside, they find themselves entering a long, ominously dimly lit hallway. Purvis directs Agent Barton to a particular door, readying his hand on his gun as they prepare, their trench-coated forms towering authoritatively over the scene. Purvis lifts his knuckles to knock on the door, which promptly opens to reveal a young woman in a modest house dress, her strawberry blonde hair styled in a curly bob that frames her face. Purvis confidently steps toward the open doorway, and as he enters, Barton lingers watchfully behind in the hall. At a table inside, a stout man is engaged in eating, and the baby-faced man seated across from him gives a nod of acknowledgment, recognizing the visitors. The woman steps away momentarily and, upon returning, proudly shows off her shoes and holds out an opened wallet as well. Purvis observes the wallet, gives a nod of affirmation, then exits, shutting the door firmly behind him. The woman glances wearily over to the stout man who remains seated at the dining table. Now, Purvis and Barton make their way into a stairwell, with Purvis hurrying briskly downstairs and rushing out of the building to cross the street swiftly to meet up with agent Baum. Meanwhile, in the stairwell, Barton peers intently through a window in the door, squints slightly in scrutiny, then steps out into the hallway, allowing the door to swing shut behind him. From the vantage point of the stairwell, our gaze lingers momentarily on the door, then shifts thoughtfully over to a bank of elevators. One of the elevators opens with an air of anticipation, revealing a tall man with rugged, distinguished features who steps off resolutely, heading directly for the door with purposeful strides."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Dillinger begins by awkwardly wriggling his opened pants downward, shifting his body to facilitate their descent. Meanwhile, Billie, who is kneeling over him, proceeds to deftly unfasten her dress, meticulously undoing each fastening before pulling it off over her head to reveal a silvery blue slip that hugs her form. With her dress now aside, she leans over, her body lowering gently on top of Dillinger. The scene flickers to glimpses of Dillinger thrusting rhythmically into Billie from behind, their bodies in sync, only to alternate with tender moments of them nuzzling closely, face to face. The footage cuts to a recent memory where they arrive together, overflowing with ecstasy and joy, the scene then flashes to Dillinger passionately kissing Billie on her mouth before his face slowly retreats, tracing a tender path down her chest. As time passes, they are seen cuddling together, sharing a warm, intimate smile that speaks volumes of their connection. Later, Billie gracefully rises from the bed, her silvery blue slip catching the light as she strolls leisurely to a window. Her eyes scan the room where open suitcases dominate every corner, each one filled to the brim with neatly packed clothes. With a gentle touch, Billie caresses the contents of the suitcases, feeling the textures of the fabrics beneath her fingers, before making her way back to Dillinger in bed, where she lovingly lays her head on his shoulder. Dillinger rolls over to face her, his hand moving to tenderly stroke her cheek and neck while his thumb gently rubs along her graceful jaw line, allowing his gaze to pour over her face, absorbing every feature. Dillinger offers a wide grin, his eyes twinkling, while Billie gazes back at him dreamily, lost in the moment. He smiles once more, and his thumb continues to caress her cheek in a gentle, rhythmic motion, which he follows with a playful, puckish grin. Meanwhile, at the telephone exchange, Baum stands attentively with a listening piece pressed to his ear and a hand-held microphone poised at his lips, ready to relay information. The scene transitions to later moments, where the Pierce-Arrow, a luxury car, pulls up to a curb with Purvis at the wheel and Baum seated beside him. Two other G-men, clad in their distinctive attire, approach the vehicle, one of them glancing at his young partner, who in response, tips his hat politely. Purvis turns to face Baum, gives a directive point, then steps out of the car and confronts the young G-man. Leading them across the street, Purvis guides them purposefully toward a nearby building, entering a long, dimly lit hallway. As they proceed, Purvis directs Agent Barton to a specific door, his hand instinctively readying on his gun, the gesture emphasizing the seriousness of their task, their forms cast larger-than-life by their trench coats. Purvis raises his knuckles and knocks on the door, which promptly opens to reveal a young woman dressed demurely, her strawberry blonde hair framing her face in a curly bob. Purvis steps forward, crossing the threshold as Barton remains in the hall, observing. Inside, a stout man is seated at a table, casually eating, while a baby-faced man gives a nod of recognition. The woman steps away momentarily, then returns, showcasing her shoes with a slight flourish and extending an opened wallet for inspection. Purvis scrutinizes the wallet, nods with approval, and promptly leaves, the door closing behind him. The woman turns and looks wearily at the stout gentleman seated at the dining table, conveying a silent understanding. Now, Purvis and Barton move into a stairwell, with Purvis descending swiftly, rushing out from the building to cross the street and rendezvous with agent Baum. Barton, remaining in the stairwell, peers through a small window set in the stairwell door, squints to gauge his surroundings, then steps into the hallway, letting the door drift closed behind him. Our gaze lingers momentarily on this door before shifting subtly to a bank of elevators. One of these elevators opens to reveal a tall man with rugged features who steps out with deliberate purpose and heads directly for the door, his presence signifying an impending action."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Dillinger and Billie engage in an intimate encounter as she removes her dress to reveal a silvery slip and leans over him. Their interaction includes glimpses of physical closeness and tender nuzzling, interspersed with flashbacks of their ecstatic arrival and moments of affection. Afterwards, they cuddle and share smiles, and Billie walks to a window in her slip, caressing their neatly packed suitcases, before returning to lay her head on Dillinger’s shoulder. He turns to face her, gently caressing her cheek and jaw while gazing deeply at her, exchanging a series of warm smiles and grins with her dreamy gaze in return. Meanwhile, at the telephone exchange, Baum listens attentively while at a later time, Purvis drives the Pierce-Arrow to a curb with Baum beside him, meeting two G-men. Purvis leads the agents across the street and into a dim hallway, preparing cautiously as they approach a door. As the door opens, Purvis steps inside where a young woman with curly strawberry blonde hair reveals an opened wallet to him. After acknowledging it with a nod, he exits, leaving the woman looking wearily at a man dining at the table. Purvis and Barton then enter a stairwell, with Purvis hurrying downstairs to meet agent Baum outside. Barton observes through a window in the door, stepping into the hallway as the door swings shut behind him. A rugged-featured man soon emerges from an elevator, heading purposefully toward the door."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Dillinger, known as a notorious Depression-era bank robber, wriggles his opened pants downward as Billie, kneeling over him with a familiarity born from their shared history on the run, unfastens her dress and pulls it off over her head, revealing a silvery blue slip reminiscent of the glamorous 1930s fashion, then leans over on top of Dillinger. Glimpses of Dillinger thrusting into Billie from behind are interspersed with their nuzzling face to face. A recent flashback shows them arriving ecstatically at a safe house, and another flash shows Dillinger kissing her mouth passionately as his face withdraws down her chest in an intimate caress. Later, as they cuddle in the quiet aftermath of their escape, they share a warm smile, and later still, Billie strolls in her slip to a window overlooking the bustling city streets below. Open suitcases occupy every inch, filled to the brim with neatly packed clothes, a testament to their transient lifestyle. Billie caresses their contents, then rejoins Dillinger in bed, laying her head on his shoulder in a moment of tenderness amidst their life of crime. Rolling over to face her, he strokes her cheek and neck, his thumb gently rubbing her graceful jaw line, while his gaze pours over her face with genuine affection. He grins, and Billie gazes dreamily at him, reminded of the rare moments of peace they share. He gives her another smile, and his thumb caresses her cheek in a gentle rhythm, followed by a puckish grin that reminds her of better days. At the telephone exchange, Baum, part of the FBI's dedicated team hunting Dillinger, stands with a listening piece to his ear and a hand-held mike at his lips, intercepting crucial information. Later, the Pierce-Arrow, a luxury car of the era known for its elegance, pulls up to a curb, with Purvis, the famed FBI agent, driving and Baum at his side. Two other G-men, the moniker for federal agents, approach the luxury car, and one of the street agents looks to his young partner, who bows his hat in a gesture of readiness. Purvis faces Baum, points, then gets out and faces the young G-man, ready to make a move against Dillinger. Purvis leads them across the street towards a building thought to harbor enemies of the law, and inside, they enter a long, dim hallway reminiscent of noir films. Purvis leads Agent Barton to a door, then readies his hand on his gun as they prepare, dwarfing their trench-coated forms dramatically. Purvis lifts his knuckles to the door, which opens to reveal a young demure house dressed in the casual fashion of the time, with strawberry blonde hair framing her face in a curly bob that was popular. Purvis steps toward the doorway, and as he enters, Barton lingers in the hall, ensuring their safety. At a table, a stout man eats, and the baby-faced man nods, suggesting a tacit acknowledgment of the situation. The woman steps away and returning, shows off her shoes and holds out the opened wallet as well, an indication of compliance or a signal to the agents. Purvis eyes it and gives a nod, then leaves, shutting the door with a sense of urgency. The woman looks wearily to the stout gentleman at the dining table, silently communicating the tension of the encounter. Now Purvis and Barton enter a stairwell, with Purvis hurrying downstairs and rushing from the building to run across the street to agent Baum, coordinating their next move. In the stairwell, Barton peers through a window in the door, squints, steps into the hallway, and lets the door swing shut behind him, careful not to reveal their intentions. From the stairwell, our gaze lingers on the door, then drifts over to a set of elevators. One of them opens, revealing a tall man with rugged features who steps off and heads for the door, his presence suggesting the complex web of alliances in this high-stakes pursuit."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Dillinger wriggles his opened pants downward as Billie kneeling over him unfastens her dress and pulls it off over her head revealing a silvery blue slip then leans over on top of Dillinger. Glimpses of Dillinger thrusting into Billie from behind are interspersed with their nuzzling face to face. A recent flashback shows them arriving ecstatically and another flash shows Dillinger kissing her mouth as his face withdraws down her chest. Later as they cuddle they share a warm smile and later still Billie strolls in her slip to a window. Open suitcases occupy every inch filled to the brim with neatly packed clothes. Billie caresses their contents then rejoins Dillinger in bed laying her head on his shoulder. Rolling over to face her he strokes her cheek and neck his thumb gently rubbing her graceful jaw line while his gaze pours over her face. He grins and Billie gazes dreamily at him. He gives her another smile and his thumb caresses her cheek in a gentle rhythm followed by a puckish grin. At the telephone exchange Baum stands with a listening piece to his ear and a handheld mike at his lips. Later the PierceArrow pulls up to a curb with Purvis driving and Baum at his side. Two other Gmen approach the luxury car and one of the street agents looks to his young partner who bows his hat. Purvis faces. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Baum points then gets out and faces the young Gman. Purvis leads them across the street towards a building and inside they enter a long dim hallway. Purvis leads Agent Barton to a door then readies his hand on his gun as they prepare dwarfing their trenchcoated forms. Purvis lifts his knuckles to the door which opens to reveal a young demure house dressed with strawberry blonde hair framing her face in a curly bob. Purvis steps toward the doorway and as he enters Barton lingers in the hall. At a table a stout man eats and the babyfaced man nods. The woman steps away and returning shows off her shoes and holds out the opened wallet as well. Purvis eyes it and gives a nod then leaves shutting the door. The woman looks wearily to the stout gentleman at the dining table. Now Purvis and Barton enter a stairwell with Purvis hurrying downstairs and rushing from the building to run across the street to agent Baum. In the stairwell Barton peers through a window in the door squints steps into the hallway and let us the door swing shut behind him. From the stairwell our gaze lingers on the door then drifts over to a set of elevators. One of them opens revealing a tall man with rugged features who steps off and heads for the door."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Dillinger wriggles his opened pants downward as Billie kneeling over him unfastens her dress and pulls it off over her head revealing a silvery blue slip then leans over on top of Dillinger. Glimpses of Dillinger thrusting into Billie from behind are interspersed with their nuzzling face to face. A recent flashback shows them arriving ecstatically and another flash shows Dillinger kissing her mouth as his face withdraws down her chest. Later as they cuddle they share a warm smile and later still Billie strolls in her slip to a window. Open suitcases occupy every inch filled to the brim with neatly packed clothes. Billie caresses their contents then rejoins Dillinger in bed laying her head on his shoulder. Rolling over to face her he strokes her cheek and neck his thumb gently rubbing her graceful jaw line while his gaze pours over her face. He grins and Billie gazes dreamily at him. He gives her another smile and his thumb caresses her cheek in a gentle rhythm followed by a puckish grin. At the telephone exchange Baum stands with a listening piece to his ear and a handheld mike at his lips. Later the PierceArrow pulls up to a curb with Purvis driving and Baum at his side. Two other Gmen approach the luxury car and one of the street agents looks to his young partner who bows his hat. Purvis faces. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Baum points then gets out and faces the young Gman. Purvis leads them across the street towards a building and inside they enter a long dim hallway. Purvis leads Agent Barton to a door then readies his hand on his gun as they prepare dwarfing their trenchcoated forms. Purvis lifts his knuckles to the door which opens to reveal a young demure house dressed with strawberry blonde hair framing her face in a curly bob. Purvis steps toward the doorway and as he enters Barton lingers in the hall. At a table a stout man eats and the babyfaced man nods. The woman steps away and returning shows off her shoes and holds out the opened wallet as well. Purvis eyes it and gives a nod then leaves shutting the door. The woman looks wearily to the stout gentleman at the dining table. Now Purvis and Barton enter a stairwell with Purvis hurrying downstairs and rushing from the building to run across the street to agent Baum. In the stairwell Barton peers through a window in the door squints steps into the hallway and let us the door swing shut behind him. From the stairwell our gaze lingers on the door then drifts over to a set of elevators. One of them opens revealing a tall man with rugged features who steps off and heads for the door."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Dillinger wriggles his opened pants downward as Billie kneeling over him unfastens her dress and pulls it off over her head revealing a silvery blue slip then leans over on top of Dillinger. Glimpses of Dillinger thrusting into Billie from behind are interspersed with their nuzzling face to face. A recent flashback shows them arriving ecstatically and another flash shows Dillinger kissing her mouth as his face withdraws down her chest. Later as they cuddle they share a warm smile and later still Billie strolls in her slip to a window. Open suitcases occupy every inch filled to the brim with neatly packed clothes. Billie caresses their contents then rejoins Dillinger in bed laying her head on his shoulder. Rolling over to face her he strokes her cheek and neck his thumb gently rubbing her graceful jaw line while his gaze pours over her face. Purvis eyes it and gives a nod then leaves shutting the door. The woman looks wearily to the stout gentleman at the dining table. Now Purvis and Barton enter a stairwell with Purvis hurrying downstairs and rushing from the building to run across the street to agent Baum. In the stairwell Barton peers through a window in the door squints steps into the hallway and let us the door swing shut behind him. From the stairwell our gaze lingers on the door then drifts over to a set of elevators. One of them opens revealing a tall man with rugged features who steps off and heads for the door."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Dillinger wriggles his opened pants downward as Billie kneeling over him unfastens her dress and pulls it off over her head revealing a silvery blue slip then leans over on top of Dillinger. Glimpses of Dillinger thrusting into Billie from behind are interspersed with their nuzzling face to face. A recent flashback shows them arriving ecstatically and another flash shows Dillinger kissing her mouth as his face withdraws down her chest. In the stairwell Barton peers through a window in the door squints steps into the hallway and let us the door swing shut behind him. From the stairwell our gaze lingers on the door then drifts over to a set of elevators. One of them opens revealing a tall man with rugged features who steps off and heads for the door."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Gingerbread slides his buttoned hat upward as Poppy, sitting beside him, ties her scarf and pushes it under her elbow, revealing a crimson shawl, then rests next to Gingerbread. Glimpses of Gingerbread dancing past Poppy from the side are interspersed with their whispering elbow to elbow. A previous daydream shows them departing anxiously, and another daydream shows Gingerbread brushing her hair as his hand climbs up her arm. Later, as they nap, they share a cool frown, and later still, Poppy marches in her shawl to a mirror. Closed baskets fill every corner, overflowing with randomly scattered gadgets. Poppy pats their surfaces, then wanders back to Gingerbread on the couch, placing her foot on his knee. Flipping to face her, he pats her hand and shoulder, his finger softly tapping her clumsy wrist curve, while his attention drifts over her nose. He chuckles, and Poppy peers pensively at him. He gives her another smirk, and his finger nudges her nose in a slow beat, followed by a cheeky laugh. At the railroad station, Frizzle stands with a telescope to his eye and a pocket comb at his chin. Later, the rickshaw rolls up to a doorstep, with Myrtle pedaling and Frizzle in the back. Two other mailmen approach the grand bicycle, and one of the marketplace envoys nods to his grizzled teammate, who tips his boot. Myrtle turns to Frizzle, gestures, then hops out and turns to the grizzled mailman. Myrtle escorts them across the road towards a tower, and inside, they traverse a wide, bright atrium. Myrtle guides Courier Newton to a staircase, then settles his grip on his boot as they anticipate, shadowing their rain-jacketed silhouettes. Myrtle curls his fingers to the stairs, which part to reveal a young bold messenger dressed, with jet black curls crowning her nose in a wavy mane. Myrtle strides toward the steps, and as he proceeds, Newton pauses in the atrium. At a buffet, a lean woman yawns, and the wrinkled lady smiles. The messenger scurries away and returning, shows off her rings and holds out the closed satchel as well. Myrtle views it and gives a wink, then departs, closing the stairs. The messenger gazes listlessly at the lean dame at the eating counter. Now Myrtle and Newton exit a corridor, with Myrtle rushing upstairs and sauntering from the tower to dash across the road to herald Frizzle. In the corridor, Newton peers through a portal in the stairs, blinks, strides into the atrium, and lets the stairs creak open after him. From the corridor, our view rests on the stairs, then glides over to a row of windows. One of them creaks, unveiling a short woman with delicate features who tiptoes out and paces for the stairs."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Dillinger and Billie share an intimate moment as they undress and cuddle together. Their affection is evident through tender gestures and smiles, showcasing a deep connection. Billie later walks to a window filled with open suitcases, then rejoins Dillinger in bed. Meanwhile, at a telephone exchange, Baum listens intently, and later, he and Purvis drive up in a Pierce-Arrow, joined by two G-men. As they approach a building, Purvis leads the team inside, encountering a young woman with strawberry blonde hair. She shows an opened wallet to Purvis, who nods and exits. The woman wearily looks at a stout man at the dining table. Purvis and Barton then hurry downstairs, with Purvis running across the street to Agent Baum. Barton lingers, observing through a window, while a rugged man exits an elevator and heads for the door."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "One of them opens revealing a tall man with rugged features who steps off and heads for the door From the stairwell our gaze lingers on the door then drifts over to a set of elevators In the stairwell Barton peers through a window in the door squints steps into the hallway and let us the door swing shut behind him Now Purvis and Barton enter a stairwell with Purvis hurrying downstairs and rushing from the building to run across the street to agent Baum The woman looks wearily to the stout gentleman at the dining table Purvis eyes it and gives a nod then leaves shutting the door The woman steps away and returning shows off her shoes and holds out the opened wallet as well At a table a stout man eats and the babyfaced man nods Purvis steps toward the doorway and as he enters Barton lingers in the hall Purvis lifts his knuckles to the door which opens to reveal a young demure house dressed with strawberry blonde hair framing her face in a curly bob Purvis leads Agent Barton to a door then readies his hand on his gun as they prepare dwarfing their trenchcoated forms Purvis leads them across the street towards a building and inside they enter a long dim hallway Baum points then gets out and faces the young Gman Purvis faces Two other Gmen approach the luxury car and one of the street agents looks to his young partner who bows his hat Later the PierceArrow pulls up to a curb with Purvis driving and Baum at his side At the telephone exchange Baum stands with a listening piece to his ear and a handheld mike at his lips He gives her another smile and his thumb caresses her cheek in a gentle rhythm followed by a puckish grin He grins and Billie gazes dreamily at him Rolling over to face her he strokes her cheek and neck his thumb gently rubbing her graceful jaw line while his gaze pours over her face Billie caresses their contents then rejoins Dillinger in bed laying her head on his shoulder Open suitcases occupy every inch filled to the brim with neatly packed clothes Later as they cuddle they share a warm smile and later still Billie strolls in her slip to a window A recent flashback shows them arriving ecstatically and another flash shows Dillinger kissing her mouth as his face withdraws down her chest Glimpses of Dillinger thrusting into Billie from behind are interspersed with their nuzzling face to face Dillinger wriggles his opened pants downward as Billie kneeling over him unfastens her dress and pulls it off over her head revealing a silvery blue slip then leans over on top of Dillinger"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Glimpses of Dillinger thrusting into Billie from behind are interspersed with their nuzzling face to face Dillinger wriggles his opened pants downward as Billie kneeling over him unfastens her dress and pulls it off over her head revealing a silvery blue slip then leans over on top of Dillinger Later as they cuddle they share a warm smile and later still Billie strolls in her slip to a window A recent flashback shows them arriving ecstatically and another flash shows Dillinger kissing her mouth as his face withdraws down her chest Billie caresses their contents then rejoins Dillinger in bed laying her head on his shoulder Open suitcases occupy every inch filled to the brim with neatly packed clothes He grins and Billie gazes dreamily at him Rolling over to face her he strokes her cheek and neck his thumb gently rubbing her graceful jaw line while his gaze pours over her face At the telephone exchange Baum stands with a listening piece to his ear and a handheld mike at his lips He gives her another smile and his thumb caresses her cheek in a gentle rhythm followed by a puckish grin Two other Gmen approach the luxury car and one of the street agents looks to his young partner who bows his hat Later the PierceArrow pulls up to a curb with Purvis driving and Baum at his side Baum points then gets out and faces the young Gman Purvis faces Purvis leads Agent Barton to a door then readies his hand on his gun as they prepare dwarfing their trenchcoated forms Purvis leads them across the street towards a building and inside they enter a long dim hallway Purvis steps toward the doorway and as he enters Barton lingers in the hall Purvis lifts his knuckles to the door which opens to reveal a young demure house dressed with strawberry blonde hair framing her face in a curly bob The woman steps away and returning shows off her shoes and holds out the opened wallet as well At a table a stout man eats and the babyfaced man nods The woman looks wearily to the stout gentleman at the dining table Purvis eyes it and gives a nod then leaves shutting the door In the stairwell Barton peers through a window in the door squints steps into the hallway and let us the door swing shut behind him Now Purvis and Barton enter a stairwell with Purvis hurrying downstairs and rushing from the building to run across the street to agent Baum One of them opens revealing a tall man with rugged features who steps off and heads for the door From the stairwell our gaze lingers on the door then drifts over to a set of elevators"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Baum points then gets out and faces the young Gman Purvis leads them across the street towards a building and inside they enter a long dim hallway Purvis leads Agent Barton to a door then readies his hand on his gun as they prepare dwarfing their trenchcoated forms Purvis lifts his knuckles to the door which opens to reveal a young demure house dressed with strawberry blonde hair framing her face in a curly bob Purvis steps toward the doorway and as he enters Barton lingers in the hall At a table a stout man eats and the babyfaced man nods The woman steps away and returning shows off her shoes and holds out the opened wallet as well Purvis eyes it and gives a nod then leaves shutting the door The woman looks wearily to the stout gentleman at the dining table Now Purvis and Barton enter a stairwell with Purvis hurrying downstairs and rushing from the building to run across the street to agent Baum In the stairwell Barton peers through a window in the door squints steps into the hallway and let us the door swing shut behind him From the stairwell our gaze lingers on the door then drifts over to a set of elevators One of them opens revealing a tall man with rugged features who steps off and heads for the door Dillinger wriggles his opened pants downward as Billie kneeling over him unfastens her dress and pulls it off over her head revealing a silvery blue slip then leans over on top of Dillinger Glimpses of Dillinger thrusting into Billie from behind are interspersed with their nuzzling face to face A recent flashback shows them arriving ecstatically and another flash shows Dillinger kissing her mouth as his face withdraws down her chest Later as they cuddle they share a warm smile and later still Billie strolls in her slip to a window Open suitcases occupy every inch filled to the brim with neatly packed clothes Billie caresses their contents then rejoins Dillinger in bed laying her head on his shoulder Rolling over to face her he strokes her cheek and neck his thumb gently rubbing her graceful jaw line while his gaze pours over her face He grins and Billie gazes dreamily at him He gives her another smile and his thumb caresses her cheek in a gentle rhythm followed by a puckish grin At the telephone exchange Baum stands with a listening piece to his ear and a handheld mike at his lips Later the PierceArrow pulls up to a curb with Purvis driving and Baum at his side Two other Gmen approach the luxury car and one of the street agents looks to his young partner who bows his hat Purvis faces"
        }
      ]
    }
  ]
}